[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Amazing Team", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 May 2023", "job_title": "Program Coordinator in Cape Coast", "duration": "N/A", "pros": "The team is amazing. The work culture is great. Everyone is ready to support you when you need them. Everyone is passionate about the job and making an impact in the lives of others.", "cons": "There are really no cons."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Apr 2023", "job_title": "Intern", "duration": "N/A", "pros": "Good mission and generally structured well.", "cons": "There are no cons for GB as an employer"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good for a while", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Nov 2022", "job_title": "Program Manager", "duration": "N/A", "pros": "Flexible schedule Meet new people all the time Community Work Challenging Interesting", "cons": "Is not stable Too much travel Low Pay No balance Lack of team work sometimes"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great company for young professionals or people looking to a fast paced, flexible, international development org", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Global Brigades puts a huge emphasis on empowerment in every aspect of work from programming to staffing to interactions with all external stakeholders. My time with Global Brigades allowed me to grow and push myself in new and challenging ways. GB focuses on creating opportunities for staff members that are hard working to excel at their job and highlight their strengths. GB is constantly focus on innovation and pushing towards scaling and developing effective strategy. If you're looking for a job where you will be doing meaningful work, have room to learn and grow, and will feel empowered, GB is the place for you! I have thoroughly appreciated and cherished my time working for GB and will forever be grateful for the opportunities I was given.", "cons": "The international, cross-cultural work environment is dynamic and can at times be considered challenging, but ultimately provides a work environment where employees are pushed to grow and adapt. GB has made a huge effort in the past few years to improve people and operational practices, and although there is still room for improvement with internal communication and information flow, the org has come an extremely long way to improve in these areas, especially given the wide-reaching, international, remote nature of the work.\n\nBeing a non-profit, GB has limited resources that have to be used wisely, which can at times lead to restructures and changes to make resource allocation more effective, so it's important for employees to understand this aspect of GB's work and constantly remain adaptable - as long as you are flexible, you can take advantage of this dynamic and flexible environment to your benefit!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Great organisation to work for.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2021", "job_title": "Vice President of Programs in Nashville, TN", "duration": "N/A", "pros": "Work environment, team and mission.", "cons": "Although salaries are not the most competitive, it is a great place to grow professionally and contribute to the betterment of the world."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fast-paced nonprofit, amazing culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Feb 2021", "job_title": "Associate in Milwaukee, WI", "duration": "N/A", "pros": "GB is a really collaborative and thoughtful NGO. I have not seen any other nonprofit that encourages such collaboration at every level of the company. Communication is great, the organization uses Slack so it's easy to talk to team members across countries and departments. The start-up culture is fun and makes the work really exciting, there's always something new happening. Love working for an organization with such a great mission and vision that everyone is working towards on a daily basis.", "cons": "The work is fast-paced and feels like a start-up, which might not be for everyone. Remote work can be difficult, especially working with so many time zones."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good gig", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Jun 2021", "job_title": "Business Coordinator", "duration": "N/A", "pros": "Good place to learn real life problems and how to contribute to society", "cons": "Unstable workplace a lot of problems at the top of the organization"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing people working towards a better worls", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "18 Feb 2021", "job_title": "Director of Technology in Buenos Aires", "duration": "N/A", "pros": "Good people, your work makes a positive impact in the world, workload will not burn you out.", "cons": "Salaries for IT positions may be a bit low compared to the market. Being a NGO, they can't afford top IT salaries."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "More of an internship than a job", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Nov 2020", "job_title": "Program Associate in Panamá", "duration": "N/A", "pros": "Unique experience to work abroad\r\nA good mix of office work and time in the field\r\nOpportunity to work with an international staff\r\nOverall good mission although it oftentimes takes a backseat when it comes to making hard decisions", "cons": "Company is more concerned with profit than impact\r\nFinancial transparency is a core value but is severely lacking\r\nDisorganized and zero transparency from leadership\r\nLots of work for very little pay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great company, great mission", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Hands on experience, flexibility, team atmosphere, nonprofit", "cons": "Work life balance, compensation and benefits"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Jan 2021", "job_title": "Anonymous Employee in Tegucigalpa", "duration": "N/A", "pros": "GB provides the opportunity to know about different cultures, countries and the most important, you'll help the people who need it the most.", "cons": "In high seasons you'll have lots or work but you'll definitively enjoy it!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Once in a Lifetime Experience for Young College Grads", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Leadership and Strategy Opportunities - many of the decisions I got to make were hugely impactful, the kind for which many friends back home would wait 5-10 yrs in a corporate, older organization\r\n- Living Expenses - covered (housing, food, phone, internet, travel), there is a stipend above and beyond this, but it's great having all of that taken care of, especially internationally\r\n- Resume Boost - hate to put this as a Pro, but employers back in the US were VERY impressed with this kind of international work and immersion in Spanish-speaking culture. Even after being employed within a few weeks after returning home, the experiences serves me in many areas of connecting to clients and other local organizations\r\n- The GB Family - above and beyond the most important part for me; everyone's extremely committed to the organization mission and have a lot of love for everyone else working towards the same goal. One of my biggest determinants in job searching after GB", "cons": "- Administrative Duties - lots of in-office, virtual, online work. It is simply the way large impact gets done these days, especially in younger and international organizations.\r\n- Burnout - with so many passionate, young employees -- many right out of college -- it's easy to work overtime and lose sight of self-care. \r\n- Savings/Salary - if you're coming into this wanting a huge salary and savings, might be good to rethink it...and working with non-profits in general. People are not in it for the money but you are supported with living expenses and an add'l stipend for disposable income."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Loved working for a non-profit that values community partnerships", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jul 2016", "job_title": "Program Associate Manager in Estelí", "duration": "N/A", "pros": "- The staff are incredibly committed to working with and for the people of their country. It's refreshing to work with a staff as committed as this one.\r\n- The organization has interwoven the Sustainable Development Goals into their holistic approach to supporting and partnering with communities.\r\n- It is a fantastic opportunity to live abroad and experience an entirely different culture.\r\n- I made some of my best friends, and established lasting connections with both Executive Team members and local staff alike.\r\n- Because the organization is constantly changing and growing, there are a lot of opportunities for impacting the organization.", "cons": "- Impact is limited by scale, scope, and resources available within the organization.\r\n- It is tough to make the job a sustainable one unless you intend to live in Central America long term. The compensation is adequate if you are willing to live modestly in Central America, however it does not allow for much more than that without having extra resources for yourself. Visiting back home and moving back to the United States has been tough without tapping into other funds I have, as the compensation did not allow for me to save much."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "A Place for Social Entrepreneurs (Great job with recent restructure)", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Apr 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Global Brigades provides an empowering culture for those that want to make a difference in the field of international development.  Leadership in the US is very approachable when communication attempts are made. Leadership gives a lot of autonomy to the on-the-ground teams to execute and develop operations, so it is up to the staff to make the most out of their experience and make their impact. I have seen many examples where entrepreneurial team members present new business ideas to the leadership team and they are funded to start their ventures. Those types of innovative team members thrive and can build careers doing what they are passionate about.", "cons": "Over the last year it shifted its HR strategy around full-time locals instead of bringing on foreign staff for program related roles, so the opportunities for North American staff wanting to get on-the-ground field experience is limited to more office/administrative roles that support the local teams. It is a much more sustainable strategy providing longer term impact, however, for candidates looking for full-time field work, it is not a good fit."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Volunteer organization, NOT the largest movement for global health and holistic development", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Jan 2018", "job_title": "Marketing Program Associate in Estelí", "duration": "N/A", "pros": "Working in Central America is a great experience, and the local staff are amazing.  The in-country staff are extremely knowledgable and I learned a lot by going into communities with them.\r\nIf you are looking for some experience in a developing country and just want a short-term role then this is fine.", "cons": "The higher level management located in the United States are distant from the communities they work in, along with their in-country staff.  I also had a very negative experience where they took advantage of me financially.  Overall they do not treat their employees with respect.  As well, if you are looking to work in the sustainable development field then Global Brigades is not for you.  They are only a volunteerism organization and you will not be able to grow in your career.  The organization does not foster innovation, collaboration, or transparency."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great life experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 May 2015", "job_title": "Chapter Advisor in Panamá", "duration": "N/A", "pros": "Living abroad is an amazing opportunity. You have the opportunity to gain field work experience as well as office skills. With the transition to all chapter advisors to Nicaragua it can be a bit more office time but there is still ample opportunity to get out on brigades and in the field if you show interest and take initiative. \r\n\r\nMeeting awesome local staff! Navigating a cross-cultural workplace can be trying at times but it's a great challenge to take on. My Spanish skills definitely improved while in-country, don't stop speaking Spanish (it's also a great résumé booster!)\r\n\r\nThere is a lot of opportunity to travel and explore the country you are living in. Work//life balance is great. \r\n\r\nI met some of my best friends in GB. I'll always remember my time in Central America!", "cons": "Some of the brigade coordinators are extremely unprofessional and hard to work with. Can be difficult to manage that and a million other things at once. \r\n\r\nProgramatic changes are extremely challenging to implement. Program Associates // Managers need to be invested and involved in making those changes, especially to new GB disciplines."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Wonderful organization. Standing in its own way for growth", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jun 2017", "job_title": "Program Associate", "duration": "N/A", "pros": "The heart, resources, and staff of this organization are dedicated to real, effective development work. All staff, volunteers, and donors  have the ability to make a visible impact in developing countries. Staff are given large responsibilities and even new hires have the opportunity to make their opinion heard. \r\n\r\nUS employees working in program countries get to work with local experts who are genuinely interested in including you in their work.  Everyone within the organization is dedicated to their work, and they care about each other as a team.", "cons": "Despite the growing number of employees, the CEO and the President are still making all of the HR decisions. Resources are constantly limited for employees, and it directly affects the growth rate of the organization."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This company treats international staff horribly, proactively sucks the joy out of working in development", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Aug 2019", "job_title": "Program Associate", "duration": "N/A", "pros": "Ability to live abroad and meet cool people", "cons": "I was heartbroken when I came to work for GB, a company that I had admired for many years, and discovered that they could care less about the true mission and even less about the staff they employ. Global Brigades places little to no value on the Program Associate role though they love to tout in meetings that the PAs are \"the backbone of the organization.\" \r\nThe CEO could care less about the constant negative feedback she receives from PAs and the constant recommendations that they give for how their lives abroad could be improved. GB doesn't care about employee retention or longevity, they will happily burn you out, tell you \"no\" when you ask for help, and then let the door hit you on the way out. \r\nLastly, the International HR department is a disgrace. They turn a blind eye to every issue that arises within the company. This company could have  a lot of really dedicated, young staff members who work hard to support the mission. But they value them so little that people end up leaving within a year feeling like they were worth nothing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Work Experience for Recent Grads", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Global Brigades provides recent graduates with office work experience that makes a difference in the world. Although I didn't necessarily get the on-the-field development experience I was expecting, the skills I learned about time management, communication, and professionalism in an office setting have been more valuable and transferable to future jobs - and I got to learn this while living abroad! The senior management invests time with new staff to explain how the organization works and values our opinions. I've received more opportunities to share my ideas and come up with solutions to challenges than I would have expected.", "cons": "The positions available in Honduras, Panama, Nicaragua, and Ghana for foreign staff members are limited to mostly administrative and marketing roles. Although it would be great to get a more programming or field-related position, it makes sense that those roles are mainly given to local team members to build the leadership of staff from those countries."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great organization to experience nonprofit management and implementation first-hand", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 May 2015", "job_title": "Director in Panamá", "duration": "N/A", "pros": "This organization has such a wide range of services that it wouldn´t be difficult to encounter at least one aspect that triggers your professional interest. GB truly provides opportunities to test professional and personal capacities do to its ample volunteer-community development vision. No matter what role you are working on, the expectation is that all coworkers be immersed (to some degree) with tasks such as managing budgets, staff and resources, client service, development, project management, impact measurement, supervision, etc.", "cons": "The variety of roles is scarce as the organization constantly strives for low budget-lean operations. In some cases various tasks and roles are assigned to one employee in order to maintain low costs which can be overwhelming at times. Nevertheless this particular downside has provided incredible growth opportunities for those that were able to organize and balance the work load."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great Opportunity for Entry Level International Development Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Aug 2016", "job_title": " in Estelí", "duration": "N/A", "pros": "In the world of international development, it is quite difficult for fresh college graduates to get hands on experience but Global Brigades is the perfect bridge to fill that gap. In my year working for GB, we were given total autonomy to work on projects we were interested in that would enhance our skill set. The skills gained were way more than how the position is depicted in the job description posted - which puts employees at a major advantage moving forward. Overall, this was a great dip in the world of international development work and is a fantastic opportunity for those transitioning right out of college that are interested in this specific field.", "cons": "Employees aren't paid for extra hours put in and the chance of burnout is very likely due to the stipend. Work/life balance is a huge challenge and very little support is provided in this area of need."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 3, "review_title": "Great International NGO to learn and experience sustainable development!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "18 May 2015", "job_title": "Advisor in Estelí", "duration": "N/A", "pros": "- The job is extremely essential to the development and implementation for sustainable development and global health projects; really rewarding!\r\n- Incredible working environment you will never meet individuals like these; a group of dedicated people from all backgrounds, majors, experiences etc. with the same passion it's humbling; \r\n- Great opportunity for growth individually, professionally and as an organization; you get to participate in a wide range of projects and see the impact in the organization a lot of leadership development\r\n- Living accommodations/food is arranged; all you have to do is show up which is very helpful/stress reliving", "cons": "- Salary; if you're working for GB you can't expect a large paycheck but the experience and personal development is ridiculous for a recent college graduate\r\n- Online environment- everything is done virtually which is great for the organization/costs but it can be exhausting and difficult to draw the line between work and play"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great international experience with community partnerships", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Sept 2016", "job_title": "Sustainable Development Program Associate in Tegucigalpa", "duration": "N/A", "pros": "-  Experience a beautiful country and people \r\n- Travel with friends (co-workers) \r\n- Learn by doing. Learn about development and experience what works and what doesn't \r\n- Build long lasting and meaningful relationships with in-country staff and community members \r\n- Learn great teamwork skills. While a lot of the work is completed individually, you work on     \r\n  reaching the same goal with your co-workers. \r\n- Build problem solving skills. \r\n- Learn to be more patient and flexible \r\n- Interest focus: You can work on projects that relate to your interest", "cons": "- Limited mobility because of country safety \r\n- This organization is still fairly new so there are a lot of challenges. The good thing, you can be \r\n  part of finding a solution. \r\n- Cultural divisions: it can feel a bit isolating for foreigner, so if you want to feel included it takes \r\n  work"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Opportunity to Become Fully Immersed in Int'l Development Work and Social Entrepreneurship", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Regardless of position, staff are given tremendous responsibility and autonomy, and are truly empowered to execute the mission and vision of the organization. The work-environment is ideal for self-starters who don't need to be micromanaged to thrive. The organization has very little bureaucracy, and all staff are depended on to provide feedback on existing and new programs. If you want to see and experience and ins and outs of international development work, this is an ideal place for you to be.", "cons": "If you are working for the organization domestically and are not comfortable with a virtual work environment, you may have some challenges. On the international side, the organization has done a great job of establishing strong in-country offices which provides a great work environment in which you have the ability to work side-by-side with local staff and become immersed in the local culture."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Microfinance Consultant", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 May 2015", "job_title": "Microfinance Specialist in Panamá", "duration": "N/A", "pros": "One of the fewer organizations in Panama committed to support and develop an honest development efforts to increase rural poor communities access to opportunities for improvement.\r\nCross cultural environment open to improvements and always concern about the positive impact in small communities.  \r\nMost of the Program Managers are professionals with genuine interest in rural development and providing opportunities for local employment. The organizational structure is changing according to the needs of the organization and considering to make effective and sustain support to communities. \r\nThe staff is open to suggestions and feedback not only from coworkers, but supervisors and community beneficiaries.", "cons": "Most of the middle positions are for young professionals interested in a intense learning environment with great capacity building and professional development but not a long term career. \r\nRequieres discipline to operate under limited supervision"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Program Associate", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Unique opportunity to learn about development projects in a start-up environment and network with like-minded people. \r\n\r\nCultueral emersion.", "cons": "Poor higher leadership and professional development resources. They expect high turn-over if you are living abroad so they are reluctant to invest in keeping you with the organizations.\r\n\r\nAlso, mission can get vague when there is not a clear logic framework for launching new initiatives or changing programs. The student experience still outweighs the efforts made on the ground and top leadership is constantly making alterations in efforts to grow volunteer numbers without really understanding what works or doesn't work in practice."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sham of a volun-tourism company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Feb 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great coworkers and amazing experience with the community members we worked with!\r\nThe town we lived in was very welcoming and it was great to push myself out of my comfort zone", "cons": "Management (both in the US and in Country) is not trained to handle multicultural staff and issues. There was no trust between staff and management, and staff is always treated as children. Management had no respect for the staff's work and position, and there was an atmosphere of fear and speculation constantly. They replaced almost 2 full staffs in less than 6 months. Any complaints or constructive criticism/suggestions for improvement are treated as betrayal and met with dismissal. Also, the company is full of in-staff relationships, with an overabundance of nepotism. People in key positions were often married to or dating higher-ups, and this made HR a nightmare. They preach a positive work-life balance, yet staff lives where they work and this promotes or suggests the need to work all day every day."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Challenging real-world development experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Provides a new challenge every day.  Working with Global Brigades one experiences real-world, on the ground development work every day, often in very unexpected ways.  Very gratifying job, not because I \"help\" people, but because I get to work with people towards a common goal.  Incredible cultural immersion experience as an employee/", "cons": "As a NGO built from the ground up out of a movement of university students interested in international development, there have been some growing pains in terms of organization, HR practices, and leadership.  With that said these issues have improved in every year I have worked with Global Brigades and great strides have been taken in terms of professionalism and keeping up with growth."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic opportunity for young professionals. Definitely a great hands-on experience in international development.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Feb 2020", "job_title": "Program Manager in Panamá", "duration": "N/A", "pros": "Global Brigades is a great place to work, it has a dynamic environment and it's truly culturally diverse. \r\n\r\nEven if Non-Profits aren't your thing, it is a great place to learn and put in practice knowledge for the benefit of others and grow professionally.\r\n\r\nIt is an organisation that is growing fast and there are a lot of projects to get involved that make a sustainable impact in different countries.", "cons": "For some, it takes some time to adapt to the speed and dynamism of the organisational culture, but if you are prepared and open-minded you'll adjust easily."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Dynamic Organization with a Truly Global Impact", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 May 2015", "job_title": "Marketing Manager in Managua", "duration": "N/A", "pros": "Overall, had an amazing, culturally eye-opening experience working with Global Brigades that I wouldn't trade for any other job! As an employee, you have to realize that things are going to get tough but you have to be as flexible, open-minded, and driven by humanitarianism as the organization is itself. Global Brigades is lean for the purpose of maximizing the sustainable impact to the communities. It's easy to criticize and nitpick nonprofits that don't have the same resources as other companies to make you, the employee, happy. Staying optimistic and never losing focus on the overall mission (to develop the student volunteers and the communities) really helped my overall outlook and made me a happier worker. If you're choosing to work here, you're choosing to do something above yourself and promising to serve others. You will be giving a lot of yourself but making yourself a better person overall. \r\n-Transparent on all aspects of the company, including financials, volunteer growth, and future projections\r\n-Anonymity to take ownership of your position or initiative\r\n-Consistently adding new initiatives to maximize student volunteer/community impact and actively working to maintain the programs in place\r\n-Open to partnering with other organizations and being innovative\r\n-The atmosphere of working in country allows for a TON of personal growth\r\n-Surrounds you with really smart people that have the same values regarding the world and helping others as you\r\n-Very fulfilling work", "cons": "-Working virtually is difficult at times\r\n-Management is very lean and makes getting ideas/opinions across an inefficient process\r\n-The job starts to become your only focus; not a typical 9-to-5 and a lot of professional relationships can easily become too personal\r\n-Very reactive to conflicts"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Misleading Organization Primarily Invested In Their Volunteers/Students", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Dec 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fast exposure to on the ground development work. You are thrown into a position and have to learn very fast. You are able to develop relationships with community members, learn a lot about the local culture and communities' strengths and challenges.\r\n\r\nOften a job with GB is a strong springboard towards top graduate and medical schools or a respected NGO career.", "cons": "You are often thrown into a position with little oversight or training and expected to sink or swim. You are normally hired based on your passion and energy to perform your job rather than your experience in development work. You will often be under qualified for your position. \r\n\r\nIf you are not management/leadership, you as a staff member are disposable. Management strategically cycle staff in and out with 1 to 2 year contracts, to keep pay and benefits low, which indirectly sacrifices knowledge and experience continuity. There are no careers in GB unless you are management, which is riddled with nepotism and double standards. \r\n\r\nBe very weary of what management \"sells\" to you, as it is a very different outside of their office in the USA. Management fell into their roles early on and there is a prevalent \"founders syndrome\" culture. Management have spent very little time in developing countries, yet have a strong influence in programming decisions and directing the priorities of the organization. They bog down staff with work and big ideas which are solely focused on improving the \"volunteer experience\".\r\n\r\nManagement have very little idea of what the major challenges are in our communities and rarely stay in country long enough to find out. Staff quickly realize how difficult and slow development work is and the investment needed to make incremental change.  Unfortunately, management have not gained that perspective, so staff initiatives are often marginalized or discredited. Whenever a decision needs to be made between investing into volunteers or our ultimate beneficiaries (rural communities), GB will always choose the volunteers. \r\n\r\nRelationships with communities only contain hints of community empowerment or engagement. Communities are often only participants to whatever staff tell them. The same statement is applicable towards volunteers, contrary to GB's statement of being a volunteer led organization. \r\n\r\nOften staff leave with a disillusioned and frustrated view of GB. There are only poor nonconfidential feedback channels to management. With a plethora of fundamental organizational-wide issues, staff are often left with little hope to the benefits of providing honest feedback."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Fantastic Opportunity for Self-Starters and Social Entrepreneurs", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "<Leadership, Org Impact, Trust and Creative Freedom> \r\nGB operates much on a model of empowered management. Employees are trusted to know what needs to get done and to keep themselves accountable for accomplishing their goals. As a horizontal org, many decisions are made across employees of the organization, and not by middle management, which creates a profound feeling of responsibility on the part of each individual employee. Especially for individuals early in their careers, this provides a unique opportunity for leadership which can be hard to find at such an early stage. For self-starters, it provides an optimal environment to run with their ideas, and to really make the most out of the experience/allow for entrepreneurialism to thrive. \r\n\r\n<Transparency>\r\nOrg decisions are collaborative, and made known throughout the entire org. Employees affected by certain decisions, are all bought into the decision process. Democracy plays a huge role in the organization, and there is a feeling of everyone’s opinion matters. GB does a really awesome job in comparison to other nonprofits in the international development space of measuring impact, and communicating to employees/stakeholders.\r\n\r\n<Location>\r\nGB offers many opportunities to work/live in a different country, whether “in the field” or in the office, which is an incredible experience for those interested in immersing themselves in new cultures, while being paid to do so. There are few organizations that offer this type of flexibility and option fully managed by them to work in a different country. They do a wonderful job organizing all logistics of working/living internationally.\r\n\r\n<Career Advancement>\r\nDue to many of the positions granting the entrepreneurial freedom to employees, there is a lot of support for employees to pursue professional development and passion projects within their role. This in combination with a common nonprofit factor of understaffing, means that employees are given a lot of responsibilities, and opportunity to work on many different projects, and gain tons of diverse practical experience. With GB experiences under their belt, employees find a lot of doors opening that would not have previously been opened. This is especially true for employees getting started in their career. This is true of both internal career advancement within the org, and opportunities externally (where GB has a fantastic reputation with other organizations in this space and elsewhere).\r\n\r\n<GB Family>\r\nThis has been said in previous comments, but it cannot be stressed enough. When looking for a job opportunity, the people you work with are of utmost importance. GB employees are an incredibly diverse group of some of the most passionate, and well-rounded individuals I have ever come into contact with. Especially for recent college grads, it is a fun way to transition out of college and into the “real world” because, as a young organization, you are surrounded by people very close to your own age. Even when employees move on to other organizations or career opportunities, they stay involved with GB because of the bond to the community, and the passion for the mission/positive impact being created. It is very inspiring and exciting to be a part of.", "cons": "<Burnout>\r\nBecause employees are working for GB for the mission of the organization, after hours work is common. This can undermine the work/life balance that is important to prevent burnout. Additionally, with the empowerment management style can also come ambiguity, which can be hard to navigate for younger employees starting their career, and who perhaps may require a bit more guidance. These two factors in combination with many of the positions only being on a contract basis have contributed to a good amount of burnout and turnover; however, this is something that has been recognized by the organization, and that they are addressing to improve.\r\n\r\n<Financial>\r\nLike many nonprofit positions, much of the organization is driven by unpaid volunteers. In many positions, it can be impossible to save money. That said, in positions within country, you are compensated fairly per cost of living."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great life-changing experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working here has made a great impact in my life. We all work together to empower the community members and our volunteers, and in the end we are empowering ourselves as well. It allows me to develop new skills, learn a lot from other cultures and make great relationships with the community members and volunteers. This has definitely pull me out of my comfort zone and has brought a great challenge.", "cons": "No introduction to the position or it's responsibilities where given when hired."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Its a good place to start your work experience in the field of NGOs", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Sept 2020", "job_title": "Program Manager", "duration": "N/A", "pros": "Good point of start to learn \r\nMulticultural\r\nFlexible hours\r\nLiberty of innovation**", "cons": "Still exist the mindset of without volunteers the organization can't support the communities\r\nThere model of development need a little changes\r\nLow Payment specially middle positions"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Very disappointing and unaccountable", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Sept 2013", "job_title": "Program Associate in Panamá", "duration": "N/A", "pros": "Doing field work in rural communities, working with indigenous communities, working on week-long brigades with students building composting latrines, planting trees, providing med/dent services, etc.", "cons": "The organization cannot find a direction and stick with it. Staff turn over is extremely high, which makes productivity next to impossible. American management was very unprofessional  and put forth little effort to work with his in-country team. Company executives are far more concerned with the student experience rather than local communities that we were trying to impact."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It was great to work for an organization focused in sustainable rural development in Latin America.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jun 2012", "job_title": "Intern in Panama City", "duration": "N/A", "pros": "living in another country, learning another language, working towards a cause you are passionate about, working closely with a team of interested, young, and close individuals- it's a great way to get field experience when you finish with college", "cons": "pay is minimal, work environments are cramped, things are always changing"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Looking to make an impact on the ground in developing nations", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Dec 2013", "job_title": "Program Manager in Panamá", "duration": "N/A", "pros": "You develop skills quickly and are given room to explore ideas and pilot various projects. Management is very open to new ideas. Great for career starters", "cons": "Pay and benefits are very low with little to no opportunity for advancement in the organization.  There is also very little investment in the staff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Place to Work in Central America", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 Feb 2020", "job_title": "Anonymous Employee in Tegucigalpa", "duration": "N/A", "pros": "Deliver a real impact to the partner communities they witk with\r\nCreates Jobs Opportunities in Development Countries\r\nOrganizatonal Culture makes it a great place to work here in Honduras\r\nOpportunity to experience a multicultural work enviroment", "cons": "Not all of the great new Ideas to improve the impact to our community partners can be funded with our actual budget."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Program Associate", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Nov 2018", "job_title": "Program Associate in Tegucigalpa", "duration": "N/A", "pros": "GB is a great non profit organization doing great things.", "cons": "Pay is low, they say they pay based on the country you are located in, but it is only enough to survive."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good Opportunity for Young Professionals Seeking Soft Skills", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Employees are given lots of autonomy and are able to develop numerous soft skills. Additionally, Global Brigades is a multi-cultural, virtual organization which promotes collaboration and cross-cultural communication", "cons": "High-stress work environment which can lead to burn out over time."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "International nonprofit with start-up culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-Great co-workers, wonderful team\r\n-Autonomy on projects\r\n-Programs are regularly evolving based on feedback and results", "cons": "-Virtual work environment/office culture can be a struggle\r\n-Working with the limited resources of a nonprofit"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company to volunteer with!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Jan 2020", "job_title": "Volunteer", "duration": "N/A", "pros": "All about sustainability and working towards goals which will help those in poverty long-term not just short-time. Work closely with the community and generally diverse teams.", "cons": "Brigades are expensive.\r\nSometimes many volunteers to one brigade leaving some people with not much to do."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Great Experience!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I traveled to Ghana for one month as a Global Brigades Medical Intern.  The staff is super friendly and easy to work with.", "cons": "Had one unsafe experience in Ghana, but the company handled it well and no one got hurt."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Challenging but worth it", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing people, beautiful country, great immersion, learned a lot of Spanish, always interesting issues going on that need to be solved", "cons": "US staff did not always take into consideration what was best for in country teams and communities"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission, still finding its feet", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2020", "job_title": "Monitoring and Evaluation Officer in Panamá", "duration": "N/A", "pros": "cultural exchange, focus on sustainability, meet inspiring clients", "cons": "scope of work is limited by the donors, still working to solidify program goals and activities, management frequently moves forward with large programmatic changes without the input from lower-level staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Awesome organization!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Apr 2020", "job_title": "Marketing Associate in North Logan, UT", "duration": "N/A", "pros": "Flexible schedule and it is really awesome what they are doing!", "cons": "Wasn't able to work as many hours or go to full time due to them being a non profit"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I help lead up the US advisors", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 May 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Global Brigades is a special places to work for. You get immense responsibility that impacts thousands of people in need.", "cons": "You often have to work outside the US"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Average Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jan 2020", "job_title": "Program Associate", "duration": "N/A", "pros": "Great short-term experience to gain international experience.  Generally great staff and there is a decent work/life balance.", "cons": "Other co-workers don't always share your same passion and it's evident in their poor work ethic."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Employer - Meaningful & Impactful Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2020", "job_title": "Executive Director", "duration": "N/A", "pros": "- very open to suggestions and ideas\r\n- great work environment\r\n- work-life balance\r\n- high compensations", "cons": "- none i can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Field Experiece", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of field experience working with communities", "cons": "Low pay and long hours, especially during brigades"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good intro to non-profits", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working internationally and/or across cultures; good introduction to working in non-profits", "cons": "At the time, little support for in-country staff"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Don't waste your time", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Sept 2020", "job_title": "Senior Program Associate", "duration": "N/A", "pros": "Experience working abroad in developing countries", "cons": "Terrible management, salary, and overall morale is low"}]]