[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Employees are passionate and strive for excellence!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Oct 2022", "job_title": "Employee in Meridian, ID", "duration": "N/A", "pros": "In 3 years some things have changed but the reasons I joined then still hold true. If I have a question, problem, concern, or am just curious about something, I can knock on anyone's door including the President, Chiefs, Sr VPs, Director.s, Managers, and support staff, and be met with a warm smile and a listening ear. I feel valued and heard which hasn't been the case with my previous employers.", "cons": "Change is constant... But where isn't that the case?"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Apr 2023", "job_title": "Recruiter in Meridian, ID", "duration": "N/A", "pros": "The hiring process is out of this world! Everyone is so friendly and welcoming.", "cons": "I don't have any. Its been great so far"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No respect if you were never a lineworker (Or if you are a minority)", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Jun 2023", "job_title": "Marketing Coordinator in Kuna, ID", "duration": "N/A", "pros": "Honestly not much I can say here, I had some great coworkers (and some not so good ones) and for those people I am grateful. They gave me a shot out of College and for that I am also grateful, but that is where it stops.", "cons": "As a women I was discriminated against my entire time working here. My first year I thought that was how work life would be until I realized that I was wrong (I was in my early 20s fresh out of college). I was treated like I had no clue what I was doing and was yelled at by multiple higher up employees if I tried to make a difference. I would go to conferences and was used as a show pony to all the other old men who would just stare at me inappropriately and my coworker did NOTHING! I was in marketing and no one at the company knew what Marketing did so we got treated like bottom of the barrel employees with low pay. However if we didn't do something for someone in minutes of them asking then we got yelled at. I have seen this happen with multiple women who just bow down and let this happen to them. I have also seen platen disrespect for the small number of African Americans that work here, but I can not speak on their experience. Overall I would not recommend anyone to work her unless you want to be degraded and disrespected. Everyone at the top and in charge of this company could care less and would rather get married in New Zealand with their buckets of money then do anything for the employees struggling on the bottom."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Not perfect, but very good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jun 2022", "job_title": "Curriculum Developer in Boise, ID", "duration": "N/A", "pros": "- People, including managers, who are invested in your wellbeing\n- Competitive pay\n- Annual performance incentive bonuses\n- Annual market compensation analysis to ensure they are paying you competitively, which tends to result in about a 2% raise\n- Decent health, vision, and dental benefits\n- Combine PTO and sick leave hours, plus 16 floating holiday hours annually\n- $125 annual wellness compensation\n- $300 annual Benchmark Appearance uniform compensation (for corporate employees, less for others)\n- $5000 tuition assistance for employees", "cons": "- Leadership loves to praise work/life balance, but rarely models this behavior and often recognizes and rewards people doing unnecessarily hard work\n- If you don't set boundaries, you will quickly find yourself swamped with work\n- If you don't go out of your way to make your contributions visible, you may struggle to get raises or get promoted\n- Turnover is enough that you can find yourself with three to five new coworkers each year (people get burnt out)\n- Curriculum changes often and results in rework, usually at the whims of leadership and without any evidence-based decision making\n- Lack of diversity, at least in the Idaho locations (mostly white folks working here, but they're \"working on\" making NLC more diverse)\n- Accessibility is not given due consideration with regard to educational materials, which includes employee training\n- Senior management is a club, and you're not in it"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Leaving is the best thing I've done for my career and mental well-being", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jun 2022", "job_title": "Anonymous Employee in Meridian, ID", "duration": "N/A", "pros": "Excellent benefits and fair pay, plus performance-based raises and bonuses.\r\n\r\nLots of committed people working toward making the industry better.", "cons": "Working at NLC felt like corporate work life at its worst. Change is constant. Management liked to claim that the problem is inflexible employees having a hard time with change, but the problem is actually constant, poorly managed change that leaves employees always on edge about what might happen next. This applies to changes in team structures, project prioritization, physical work locations, and on and on. I have never worked at a place where employees expressed concerns about the same thing again and again and were so completely ignored. So many employees are burnt out.\r\n\r\nAdditionally, there's no clear path for advancement. Lots of people at the top get promoted repeatedly as departments are reshuffled over and over. Most of these higher positions are never advertised, instead they just announce at a staff meeting that person XYZ now has a new, higher title as part of a restructuring. The process isn't transparent and makes advancement unattainable for those who are not already in leadership, but are seeking to grow. If you start as an individual contributor, you'll likely stay there forever."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 1, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Wonderful Leadership", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Apr 2023", "job_title": "Moderator in Boise, ID", "duration": "N/A", "pros": "There is a strong company culture here, thanks to the founder.", "cons": "Could benefit from a more inclusive atmosphere"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work and grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Jun 2022", "job_title": "Chief Culture Officer in Meridian, ID", "duration": "N/A", "pros": "- Mission that starts with \"to improve lives\"\n- Opportunity to transform an industry\n- The culture and people you get to work with\n- Clear focus on our students and their education\n- Professional Technical Educator program for our Training Specialists - only one of its kind and comes with a DOL certification and PTE credential\n- Mid-size company that is part of a fortune 300 business; both are leaders in their field and serve the country\n- Excellent compensation package: NLC pays well above its size and uses national market data\n- Opportunities to grow your career: 13-16% annual promotion rate across the company\n- Outstanding employee recognition: daily, monthly, and annual recognition and awards via in-person events and online platform (peer-to-peer feature)\n- Regular company gatherings and celebrations: once a year we fly everyone to HQ for a three-day event -- the first two are development focused and the last day is a pure celebration of our people\n- Up to $5000 in education reimbursement annually\n- Paid Parental Leave\n- Challenging and rewarding work\n- Safe place to work", "cons": "- Constant change -- the demand for our services is high and we are asked to meet student and industry needs; don't work here if you're change averse\n- High expectations -- the work is often fast-paced and requires top-quality work; a core value here is Excellence and it is expected of everyone; don't work here if you have low standards or like complacency"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good (if you're the right person)", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Aug 2022", "job_title": "Anonymous/Employee in Meridian, ID", "duration": "N/A", "pros": "NLC is a uniqe organization. They hire the very best. The folks that work here are second to none I've ever worked with— just an incredible group of individuals. \n\nUnfortunately, the organization does a poor job cultivating many of those folks. If you somehow get senior leadership's attention and can impress them, you will enjoy multiple non-competetitive promotions, tons of recognition, and all the benefits that come with it regardless of your experience or leadership skill level.", "cons": "If you come to work every day, put in an A-player's effort, but don't quickly learn and abide by the many and often cultish cultural norms that can make or break your career here, you'll sit stagnant and wonder what you're doing wrong. This will likely not change because no one will communicate to you why you're stuck, you simply will be."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Once was great, Now it's struggling...", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Jun 2022", "job_title": "Anonymous Employee in Meridian, ID", "duration": "N/A", "pros": "The working employees, Great people work here. People are so grateful for what you bring to help.", "cons": "Executive team disconnected with people. Lame Salary research to justify their methods. Parent company forces actions that result in poor local management."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Burnout is Inevitable", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Mar 2022", "job_title": "Coordinator in Meridian, ID", "duration": "N/A", "pros": "I got lucky and had an incredible supervisor during my time at NLC. She genuinely cared about my success and did her best to help me manage my workload. My team was full of wickedly smart people who were passionate about the work they produced, and they were all kind and fun to work with.", "cons": "However... the culture at NLC is the most toxic culture I have ever been in. There is so much change happening all at once that nobody really knows what's going on. Timelines and expectations move so quickly that burnout is expected - but you have to keep going. Top-level leadership isn't listening to staff.\r\n\r\nDuring one KOSA call, I remember the CEO taking questions from staff. One question was, \"Do you foresee the pace slowing down anytime soon? It's been a difficult past year and it's been hard to keep up\" (not the exact wording, but the jist of it). And the CEO laughed. She LAUGHED. The question was very obviously focused on how employees were having a hard time keeping up with the change and massive workload. I had coworkers sending me emails at 11:30pm, 1am, and Saturdays and Sundays. Once I heard the CEO laugh and say that the pace would not be slowing down, I knew I had to get out of there. \r\n\r\nI've never experienced burnout like I did at NLC. I'm not afraid of hard work and I enjoy being busy, but this workload was insane. My supervisor tried her best to help manage the work, but there's only so much you can do when everybody is under the same (or more) pressure. After I left, I heard that a big portion of my team also left NLC for similar reasons."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company and Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Feb 2022", "job_title": "Coordinator in Meridian, ID", "duration": "N/A", "pros": "NLC is a great place to work. The focus on culture and employees is unlike any other place I have ever been employed. The company invests in its talent and is always looking for ways to improve and grow. NLC is very innovative, wants to be top in the industry, and is not afraid to do what it takes to make it happen.", "cons": "NLC is growing fast. This is great for career growth, but you cannot be afraid of change or hard work. It will be worth it, but you need to have the right mindset."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2022", "job_title": "Project Coordinator in Chico, CA", "duration": "N/A", "pros": "Culture, People, Perks, PTO, Hours", "cons": "Constant change, politics, job possessiveness"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Genuinely care", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jan 2022", "job_title": "Curriculum Developer in Boise, ID", "duration": "N/A", "pros": "Leadership and other colleagues genuinely care for you. You really do feel part of a large family.", "cons": "If you don't have good personal boundaries you can end up working a lot of (unpaid) overtime."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jan 2022", "job_title": "Project Coordinator in Chico, CA", "duration": "N/A", "pros": "Family oriented, great benefits, tons of perks", "cons": "Still working out management kinks, but not a big deal."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent Comany", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Aug 2021", "job_title": "Technical Communicator in Boise, ID", "duration": "N/A", "pros": "Fast-paced, rapidly growing, incredible work culture.", "cons": "Sometimes hard to keep up with speed of growth."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 May 2021", "job_title": "Instructional Designer in Boise, ID", "duration": "N/A", "pros": "High achievers everywhere, everyone has great work ethic and is committed to their work", "cons": "Poor communication from leadership on important topics, rapid growth without much strategy for sustainability"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company, great people.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2021", "job_title": "Assistant Manager in Gaithersburg, MD", "duration": "N/A", "pros": "Great company, great people all around a good place to work.", "cons": "Poor management in my case. Made for a very hostile environment when my boss would regularly corner me in a room and berate me. Even cussed me out infront of other employees and customers."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Dynamic, Exciting, Rewarding, Workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Apr 2015", "job_title": "Senior Vice President in Meridian, ID", "duration": "N/A", "pros": "The college places the highest value on attracting and retaining highly qualified individuals. To accomplish this wages and benefits are very desirable.   A huge pro is that they have an internal training department which provides training and education improving the effectiveness of each employee.  The college is committed to and has received awards for work schedule flexibility.  Employees are always provided the resources they need to perform their jobs at a high level.  The college is receptive to change and encourages innovation at all levels.  Outstanding performance is recognized through a high level awards program.  The power delivery and communications Industries are dynamic which makes training and education extremely important.  The various training services create an invigorating and rewarding environment  since they provide such positive impact on the trainees.  The college has grown to the point where there are career opportunities for advancement.  The best place I have ever worked.", "cons": "For the training staff working at the college removes you from the day to day reality of the industry so you need to make a special effort to stay connected with what is going on outside the college.  This is not difficult if you connect with individuals in the trade and keep up on  changes through the typical information sources - internet, trade magazines etc."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The greatest place I've every worked!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jul 2014", "job_title": "Creative Director in Meridian, ID", "duration": "N/A", "pros": "Northwest Lineman College cares about their employees like family. They have showed their support for my family through incredible benefits and compensation as well as small tokens of appreciation such as throwing my wife and I a baby shower as we were expecting our firstborn. NLC is an extremely positive place to work and they have supported my department in ways I could have only dreamed of. I am honored to work at such an amazing place and have no problem pouring my passion into what I do because of how my work is appreciated here.", "cons": "Sometimes figuring out the right recipe for carrying out the vision of the organization is challenging but when all your efforts start coming together and things start happening, it's an amazing ride I wouldn't want to miss!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best company I've ever worked for.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Mar 2017", "job_title": "Anonymous Employee in Oroville, CA", "duration": "N/A", "pros": "I've worked for many different company's in the power line industry and I can honestly say that NLC treats employee's better than anywhere I've worked. The staff gets along great, and we have a ton of fun with no drama. It's kinda like having a second family.\r\nThe best thing about this job is the students, there is not a more rewarding job in the world. You get to make a positive change in someones life almost every day.", "cons": "While the pay and benefit package is very good, I personally took a cut in both to come work here.  With that being said, I also get to see my family on a daily basis and don't have to think about the phone ringing every time the wind blows."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "The flexibility here is the next best thing to working for yourself!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Jul 2014", "job_title": "Graphic Designer in Meridian, ID", "duration": "N/A", "pros": "First thing I have to say is that the benefits are fantastic—and that is a good sign of a company that cares about its people. Also, the culture of autonomy is perfect for self-motivated individuals that like to construct their own schedule and workflow. The company is very diligent in their hiring, so all the people here are a great fit, and wonderful to work with. This is easily one of the best companies I have ever worked for, and I have worked in some great places. Paid time off accrues quickly and is easy to use; that's another definite plus!", "cons": "Compensation could be better, but the benefits make it doable. There is a little bit of nepotism, but it hasn't adversely affected the culture as far as I can tell."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Administrative Staff", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Oct 2013", "job_title": "Administrative Staff in Meridian, ID", "duration": "N/A", "pros": "I have never worked for a company that cared so much about their employees.  The management team is always inspiring us to be our best.  They actively listen to every idea! I know if I drop the ball my boss has my six and that is such an amazing feeling.  Co-workers are great to work with as there is no bad mouthing.  I know if I need help anyone of my co-workers are there for me.", "cons": "I cannot think of one, except I wish there were more companies out there that had the same culture as NLC."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "With ample growth and opportunity, my career is set with NLC.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jul 2014", "job_title": "Administrative Coordinator in Meridian, ID", "duration": "N/A", "pros": "NLC stands on a foundation of integrity, and treating their employees the right way for the right reason.  I love the challenge of fast paced growth, and have been given ample opportunity to expand my career horizons.  The pay is competitive and the benefits are amazing!", "cons": "With quick growth comes a lot of change, and though it's a pro most of the time it does come with challenges.  But they are always looking for ways to improve systems and the work environment as a whole."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Industry Relations", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 Apr 2015", "job_title": "Industry Relations Manager in Meridian, ID", "duration": "N/A", "pros": "I love what I do here at the campus.  I also love the fact I have the ability to go outside and train other lineman and share experiences with them.  No other company I ever worked for allowed that to happen. This keeps me current in the industry with the trade and materials.", "cons": "As the industry changes all the time I think we should attend some of the trade shows each year to interact with the industry professionals to talk and share Ideas with training needs etc."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2014", "job_title": "Marketing in Meridian, ID", "duration": "N/A", "pros": "What an incredible bunch of people to work with! This company is an extraordinary place to work. I have never had a leadership team that cares so much for its employees, from day to day interactions, recognition programs, workplace flexibility, to the top-notch benefits and compensation. This place is outstanding!", "cons": "I can't think of any other than I have to commute to get here- it is totally worth it though."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Northwest lineman college electrical  lineworker program", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "30 Mar 2017", "job_title": "Training Specialist in Oroville, CA", "duration": "N/A", "pros": "Hi levels of camaraderie.  Great pay.  Great satisfaction from student success.  No call outs. Half-day Fridays.  Good benefits.  Extra pay for additional training.  Opportunities to train  in every area of power delivery.  appreciation for management =  straight talk & profit-sharing", "cons": "None. Sometimes it gets repetitive but you learn to deal wi sometimes it gets repetitive."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Opportunity and Best Work Invironment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jul 2014", "job_title": "Anonymous Employee in Meridian, ID", "duration": "N/A", "pros": "A growing company that puts its customers and employees above all things. Exceptional potential for growth and opportunity.", "cons": "improve communication at all employee levels. Consider an incentive program like profit sharing."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Horrible Employer", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Oct 2013", "job_title": "Training Specialist in Meridian, ID", "duration": "N/A", "pros": "You get to be home most nights, You don't have to be out in the elements, You get to help future apprentices learn the trade.", "cons": "Management is horrendous, Employees must keep their heads to the ground, Any disagreement-in your personal or professional life-is means for termination, Employees are threatened and manipulated constantly, This IS NOT the family company they claim to be"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Living the dream", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Apr 2010", "job_title": "Training Specialist in Meridian, ID", "duration": "N/A", "pros": "You want to live in Idaho. You  are a lineman and do not want to be on call nights and weekends.", "cons": "You will live in Idaho. You will not have any opportunities to make additional income. You will not be tolerated if you do not agree."}]]