[[{"date": "25 Apr 2023", "title": "Bilingual Family Intervention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (West Springfield, MA) in Apr 2023", "Interview Descriptions": "I applied online for this position. The first interview was over the phone, and it consisted of a recruiter explaining the job to me and letting me know someone would reach out. The second and third interviews were virtual, and I met with the Regional Supervisor both times. During the interview, I was asked about career goals, personal experiences, etc., and given various scenarios. Since I applied for the Bilingual position, some of the scenarios were presented in Spanish, and I had to respond in Spanish. After the third interview, I was told that a Clinical Coordinator would call me, but I never heard from them. In total, I'd say the entire process took about a month.", "Interview Questions": "Based on this client's needs, what would you prioritize first?"}, {"date": "1 May 2023", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Greensboro, NC) in Apr 2023", "Interview Descriptions": "There is a rigorous interview post screening that consists of in-depth questions on scenarios and experience related to work with at-risk juveniles. Also, be prepared to elaborate on every response and give personal experiences as they relate to your work history.", "Interview Questions": "• Give a scenario is in which you had disagreements with management/coworkers. •Provide a time in which you struggled during your shift and what you did to overcome it."}, {"date": "8 Feb 2023", "title": "Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "After over a month of interviews, I was denied after being asked to provide a list of the pros and cons of the organization. The interviews included a site visit.", "Interview Questions": "How do you relate to different ethnicities and cultural backgrounds?"}, {"date": "20 Mar 2023", "title": "Director of Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Youth Villages (Asheville, NC) in Jan 2023", "Interview Descriptions": "It was an email, then a phone call, then an in person meeting and then a job offer. They were pleasant and easy to communicate with. I didn't choose to move for the job but respect the company and would enjoy working for them.", "Interview Questions": "What do you enjoy most about fundraising?"}, {"date": "23 Jan 2023", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Woburn, MA) in Jan 2023", "Interview Descriptions": "Pre screen (getting to know you, job description, benefits, scenarios, explanation of why you want to do this), formal interview, possibly a third interview with the entire team if they think you will fit in with their values", "Interview Questions": "Tell me about your experience"}, {"date": "22 Nov 2022", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "Screening call- reviewed position, benefits, training process, asked about my interest and experience, allowed time for questions. This was not a formal interview but the step prior to that. Will follow up in a week to schedule an interview.", "Interview Questions": "Why are you interested in this position?"}, {"date": "2 Jun 2022", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages", "Interview Descriptions": "3 interviews \nPhone, 2 in person \nA ton of situational questions \nThe interviews aren’t very hard. They are going to ask about previous experience with children and the why behind working at youth villages. (Why do you want to work with children with mental illness and behavioral issues?)", "Interview Questions": "Have you ever told your supervisor something that you didn’t have to tell them? Give an example. "}, {"date": "24 May 2022", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Johnson City, TN) in May 2022", "Interview Descriptions": "Lots of scenarios. Difficult to articulate the answers on the spot but the interviewers offer guidance. Do t let your nerves get to you. They look for confidence. I don’t know what else to say to make this 30 words.", "Interview Questions": "What issue from said scenario would you prioritize?"}, {"date": "16 Mar 2023", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages in May 2022", "Interview Descriptions": "The actual interview was long. You cannot just wing this one. I applied for a remote position so my interview was on Zoom. This was in May 2022. You will need to know how to provide services and essentially assess what services would be needed in a scenario for the interview.", "Interview Questions": "The employer will provide you with a few different scenarios and you will have to assess the services the family may need."}, {"date": "27 Apr 2022", "title": "Youth Intervention Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Youth Villages (Springfield, MA)", "Interview Descriptions": "Interview Process was sloppy and disorganized, staff seemed overwhelmed. Hiring manager was constantly busy or unresponsive. It has taken me over a month to hear back, and I keep getting \"we will contact you soon\" responses both via email and via phone. It has been over two months of the same response with no concrete answer. Also, the interviewer would not let me finish my responses. I am overqualified for this job and am seeing a lot of red flags so far as someone who already works I the field.", "Interview Questions": "Describe How you would respond in x situation"}], [{"date": "23 Apr 2022", "title": "Crisis Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "i had three total interviews, each were pretty laid back, especially the first one. the first one seemed to gauge whether i met the requirements for the job, the second and third were more about being a good fit for the position in terms of quality of care and ability to thrive in that type of environment (working in the field, no office, weekly schedule shifts)", "Interview Questions": "Can you tell me about your experience working with kids? "}, {"date": "5 Apr 2022", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages", "Interview Descriptions": "the interview process was very fair and timely. I didn't think they asked any crazy, unexpected questions. They were very honest about how the job really is and the types of people you may be working with.", "Interview Questions": "what would you do in certain scenerios "}, {"date": "8 Mar 2022", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Youth Villages", "Interview Descriptions": "The interview process was fairly straightforward.  After filling out the initial application online, which included some discussion type questions,  I was contacted to set up a phone interview.  The phone interview was thorough, and the interviewer was pleasant and easy to talk to rather than intimidating.  After the phone interview round, they extended me an offer.", "Interview Questions": "How would you handle a conflict between two teenagers in the treatment center or group home?\n\nName a time you had to remain calm under stressful or chaotic circumstances and describe how you handled the situation.  \n\nWhat do you know about HIPAA?"}, {"date": "31 Mar 2022", "title": "Family Peer Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Asheville, NC) in Mar 2022", "Interview Descriptions": "One interviewer was in her car, another had an artificial background. One interviewer was in a hoodie & messy t-shirt. There were weird expectations that were unspoken until after the interview. They made judgements on assumptions that also no sense.", "Interview Questions": "There were several scenario questions that specifically concerned cultural differences. And questions about the profession to make sure people know what they're talking about."}, {"date": "27 Jan 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages (Nashville, TN) in Jan 2022", "Interview Descriptions": "Quick interview process, first was a phone screening followed by a formal interview. Lastly I had to do a presentation.\r\nOverall I had a very positive and helpful interview process.", "Interview Questions": "Situational questions and making a presentation."}, {"date": "3 Mar 2022", "title": "Life Set Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Nashville, TN) in Jan 2022", "Interview Descriptions": "It was straight forward. It was many scenarios questions that requires alot of thought. it is okay to have a pause in between questions. If the questions are long, it is okay to ask to repeat it. The interviewers are very nice and sweet.", "Interview Questions": "Name a time where you was apart of a group and what was your role?"}, {"date": "6 Apr 2023", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Knoxville, TN) in Jan 2022", "Interview Descriptions": "Was good! Try to make it personable with them to stand out amongst the other interviewers. Try not to stress out too much. Think smart and think about scenario questions", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "23 Oct 2021", "title": "Recruiting Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "Straightforward. Series of interviews with team members. Typical questions with an overview of responsibilities and time left for questions and answers. Follow up with results was always within 24 hours.", "Interview Questions": "How do I handle stress?"}, {"date": "3 Feb 2022", "title": "Residential Night Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in Oct 2021", "Interview Descriptions": "Fast paced. You do have to take a physical for the job which is definitely a work out. Some staff were required to run/ walk a mile I’m not sure if that still applies", "Interview Questions": "Have you ever worked with disadvantaged youth?\r\nWould you be able to handle several youth in a room making loud noises and attention seeking?"}, {"date": "12 Aug 2021", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "Very friendly and fair interview process. Over the phone for initial consult, followed by an in-person interview with two program managers. They got back to me with an offer of employment in a timely manner.", "Interview Questions": "What skills do you posses that are suited for this role?"}], [{"date": "8 Aug 2021", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "The interview process was fairly easy. There were case scenario questions and also adequate time to ask my own questions of the employer.  There were multiple interviews where I spoke with two different staff members.", "Interview Questions": "What is your experience in treatment planning?"}, {"date": "15 Aug 2021", "title": "Youth Behavior Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Youth Villages (Memphis, TN) in Aug 2021", "Interview Descriptions": "It went very smooth and just be yourself! Don't get nervous and take a deep breathe. Do some research before you apply for YV. You go into the site and check in first,but before that they send you a notification", "Interview Questions": "Why would like to work for YV"}, {"date": "20 Jul 2021", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages", "Interview Descriptions": "It was a typical interview. They asked questions and I answered.  The first interview was over the phone and the second in person.  But did sceneries.  They did review that there would be lots of travel.", "Interview Questions": "They did tile playing but I don’t remember much else. "}, {"date": "3 Jan 2023", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Youth Villages (Knoxville, TN) in Jul 2021", "Interview Descriptions": "Very thorough but super easy. Asks a lot of scenarios and how you would handle situations. Asked about work history and education experience. Wanted to understand your knowledge about keeping kids and youth safe.", "Interview Questions": "Safety based questions about youth and different circumstances"}, {"date": "25 Jun 2021", "title": "Night Monitor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in Jun 2021", "Interview Descriptions": "Easy-Goes quickly, you will have a phone interview and several face to face. Then background-drug test and afterwards an offer. I think it takes several weeks to actually be hired.", "Interview Questions": "Describe a time when you couldnt get a job done."}, {"date": "18 May 2021", "title": "Behavioral Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "They were late multiple times to the process, but they were very attentive and enthusiastic when actually interviewing me. I really enjoyed talking with the multiple people, but I did feel a bit neglected with the multiple instances of tardiness. I think it’s the nature of the company though.", "Interview Questions": "What’s been the biggest challenge in your work life?"}, {"date": "5 May 2021", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "Amazing process! Supervisor work hard to help you transition smooth into the company. Orientation is amazing! They do a lot to make sure you feel comfortable and competent. It was pretty easy to completely the interview and Onboarding.", "Interview Questions": "If you saw someone violating and breaking ethics what would you do?"}, {"date": "4 May 2021", "title": "SCSS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "My process was overall very pleasant. It was a very easy and structured  process. Human Resources kept me informed and training was excellent. They pride themselves in educating their employed and making sure they can grow and feel comfortable making decisions on there own.", "Interview Questions": "Do you have experience with  children who may be having suicidal ideations? "}, {"date": "3 Mar 2021", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "90 minutes interview with very deficit oriented questions like „Describe a situation in your last position where you violated HIPPA“ or „When was there a situation where you did not want to go to work anymore but decided to do so nevertheless.“ plus two cases at the end verbally explained where I had to answers 3 questions about each of them what felt like sitting in an oral exam.", "Interview Questions": "Tons of questions about where I failed in my last work places or specific situations or where I got criticized or violated HIPPA"}, {"date": "25 Feb 2021", "title": "LifeSet Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Youth Villages (Boston, MA) in Feb 2021", "Interview Descriptions": "Pretty intense , many scenarios but great. Very friendly, needs clear cut answers, be confident. Dont feel worried about the second interview its pretty chill. You will do great, if you know what you want to touch on.", "Interview Questions": "Whats one critique you got from a supervisor? "}], [{"date": "24 Jan 2021", "title": "Business Planning and Policy Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "This position will be responsible for supporting Youth Villages business development, strategy, and government relations work. In addition to implementing programs directly, Youth Villages also trains and supports other organizations (partners) to implement our models. This position will focus on supporting partner service-provision growth and sustainability, new business development and expansion, and public policy efforts in assigned states and new expansion initiatives in states where we do not yet have a presence.", "Interview Questions": "Child well fair agency experience\r\n"}, {"date": "28 Feb 2021", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Knoxville, TN) in Jan 2021", "Interview Descriptions": "The interview process was a bit excessive. The pay for the position isn't great and they require three interviews. The hold an intake interview, a second interview, and then a final one if they ask you to do so.", "Interview Questions": "They asked a series of rapid fire questions"}, {"date": "26 Apr 2021", "title": "Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Plano, IA) in Jan 2021", "Interview Descriptions": "very textbook interview questions so study up on those before you interview takes place\r\nmake sure you have experiences you can talk about and bring to the table\r\nInterviewer was very easy to talk to\r\nabout a one hour phone call", "Interview Questions": "What is a weakness you have"}, {"date": "16 Nov 2020", "title": "Behavioral Youth Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages in Oct 2020", "Interview Descriptions": "Several interviews. Pre-screen, video, in-person. The interviews were pretty informative and asked standard questions related to the job, wanted to know how you would handle situations. They were good interviews, giving a good amount of information about what they were looking for and offered.", "Interview Questions": "How would you handle a child that started to fight another one?"}, {"date": "26 Oct 2020", "title": "Foster Care Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages in Oct 2020", "Interview Descriptions": "Prescreen interview with description of the position and some relaxed interview questions, next interview with a supervisor that is also over the phone and more formal questions, and a final zoom interview with another supervisor that is structured with typical interview questions and some scenarios.", "Interview Questions": "How would you deal with a conflict at work? Provide an example"}, {"date": "11 Nov 2020", "title": "Youth Behavioral Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Douglasville, GA) in Oct 2020", "Interview Descriptions": "It consisted of 3 interviews. The first was a screening interview, then there was a phone interview, and last it was in person. They were pretty good about responding and the whole process went pretty quickly.", "Interview Questions": "A lot of situational questions asking how you would act in certain situations!"}, {"date": "16 Dec 2020", "title": "Family Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages in Oct 2020", "Interview Descriptions": "Phone prescreen interview first where they asked a few structured questions and went over the specifics of the job, then a phone interview with a supervisor where the interview was more structured, then a final zoom interview with the hiring supervisor", "Interview Questions": "How would you address a situation in which a child in foster care became aggressive during a home visit?"}, {"date": "8 Sept 2020", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Youth Villages (Memphis, TN) in Aug 2020", "Interview Descriptions": "I had a phone screen a couple of days after I applied and so far the process has taken almost a month. I have had to constantly reach out to get follow up.", "Interview Questions": "Why youth villages?"}, {"date": "20 May 2020", "title": "Night Monitor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "The man was very nice and took the time to listen to me. It was a bit nerve-racking because it was the first call and I have never done a phone interview before.", "Interview Questions": "how would you get a restless child to go back to sleep inorder to not disturb the other children"}, {"date": "12 Apr 2020", "title": "Foster Parent Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages", "Interview Descriptions": "Easy interview, phone interview they gave a large detail of the job. it was helpful and they asked basic questions she was nice and made sure i knew about the large amounts of neediness for the job", "Interview Questions": "What do you think a foster parent recruiter does "}], [{"date": "12 Apr 2020", "title": "Behavioral Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Memphis, TN) in Apr 2020", "Interview Descriptions": "I had a prescreen  interview. I was contacted the same day for my interview with the hiring manager. My interview with the hiring manager was canceled due to an emergency. I rescheduled my interview a couple days later. I finally had interview with an hiring manager, and now an interview with the director of the program.", "Interview Questions": "If someone was to spit in my face , how would I handle this situation?"}, {"date": "11 Dec 2020", "title": "Behavioral Youth Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Memphis, TN) in Apr 2020", "Interview Descriptions": "The interview consisted of many questions and were scenario based. Be prepared to talk about your previous experience and situations in which you've encountered a child considered to have behavioral problems. How did you respond? How would you respond?", "Interview Questions": "Why do you think children have behavioral problems?"}, {"date": "20 Apr 2023", "title": "High Fidelity Wraparound Facilitator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Charlotte C H, VA) in Apr 2020", "Interview Descriptions": "Difficult process to navigate. They were quick to hire and seem to do so often. The process included 2 interviews with different people but same questions. Involving hypothetical situations and how you would address a crisis.", "Interview Questions": "What is your background in?"}, {"date": "15 Jul 2020", "title": "Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Asheville, NC) in Apr 2020", "Interview Descriptions": "Initial phone interview and then Zoom interview scheduled due to Covid. Communication was clear and process was smooth, especially under the current pandemic circumstances and stressors. Job duties were described very clearly during the second interview.", "Interview Questions": "Gave scenarios to test skills in creating goals/objectives for possible  treatment plans for case conceptualizations. "}, {"date": "22 Apr 2020", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Memphis, TN) in Apr 2020", "Interview Descriptions": "I applied on indeed its was a 4 week process 2 phone interviews a 1 in person the i had to wait for orientation but it was easy flow over all the hiring manager was very nice i was comfortable so i think i went well.", "Interview Questions": "What was something that made me feel under pressure"}, {"date": "4 Apr 2020", "title": "Clinical Liaison Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Youth Villages (Memphis, TN) in Mar 2020", "Interview Descriptions": "Two over the phone interviews. One is a pre-screen and the second is an actual interview. The calls were roughly 30 minutes each and I would definition recommend studying their website before hand. The hiring manager interviewing is from one of the specific locations so it’s best to be knowledgeable about the house you may be previously working at. Have questions ready for them already written down so you don’t trip over yourself trying to think of questions throughout", "Interview Questions": "Was there a time were your clients had cultural differences and how did you handle it"}, {"date": "28 Feb 2021", "title": "Intercept In Home Services Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Memphis, TN) in Mar 2020", "Interview Descriptions": "Recruiter called with date and time for interview. The supervisor that was to interview me rescheduled twice. Interview questions were basic questions you find online and she was basically reading them off a piece of paper.", "Interview Questions": "Tell me about a time you had a conflict with a co-worker and how you handled it."}, {"date": "27 Mar 2020", "title": "Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Raleigh, NC) in Mar 2020", "Interview Descriptions": "On 4th interview. How many more? Asked the same questions by the same people. Just redundant if you ask me.  They could be a little less painful in this. They say they will call and never do. I had to place phone calls myself.", "Interview Questions": "Tell me about yourself "}, {"date": "14 Feb 2020", "title": "Life Set Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Youth Villages (Knoxville, TN)", "Interview Descriptions": "I applied via Indeed.com and was e-mailed a few days later to complete a phone screening. The phone screening included a description of the job and if the candidate is able to meet the requirements. There were scenarios given in regard to children and a job specific scenario.", "Interview Questions": "How would you assist a 19 year old male with independent living skills?"}, {"date": "10 Mar 2020", "title": "Clinical Liaison Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Youth Villages in Feb 2020", "Interview Descriptions": "First completed a phone screen interview which was an overview of the position. Next I received a phone call with the manager to schedule a face to face interview. The face to face interview was structured. They asked questions about my work experience and my work ethics. I was offered the position the following day.", "Interview Questions": "Tell me about your experience, what is your preferred style of supervision, how would you handle working with aggressive patients "}], [{"date": "1 Sept 2019", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "No Offer\r\nPositive Experience\r\nAverage Interview\r\nApplication\r\n\r\nI applied online. The process took 1 day. I interviewed at ProviderTrust in March 2019.\r\n\r\nInterview\r\n\r\nI got a phone interview with one of the team members, it was a brief introduction to the company and what the role is. Then I was asked some technical questions.\r\n\r\nt starts with a quick phone call to go over the company and hear a little about the candidate. This is followed by a few technical questions in SQL and Java. Then they finish up with Q&A.", "Interview Questions": "Review a pre-written program. "}, {"date": "29 Aug 2019", "title": "Overnight Teacher Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Arlington, TN) in Aug 2019", "Interview Descriptions": "I applied online and received a phone interview about a week later. The phone interview was easy and just asked if I know anything about Youth Village. 2 weeks later, they called me for my first interview. The interview was easy and pleasant. The lady was really nice and made me feel comfortable. It was a 30 min process. A week later, I received another call for my second interview.", "Interview Questions": "What kind of activities would you suggest that will help kids cope with stress?"}, {"date": "6 Jul 2019", "title": "Intercept In Home Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Tulsa, OK)", "Interview Descriptions": "I completed three interviews.  The first interview was by telephone, basically a screener who is actually housed in another state.  This interview took about 20 minutes. The second interview was with a supervisor from the actual work site, via telephone.  This interview was much more job specific and lasted over an hour. At this point I had several questions and took LOTS of notes. The third interview was a panel interview with 2 supervisors and the regional director.  It was a pretty thorough interview where responses to scenarios were required. I was not offered the job on the spot. They notified me by phone the next day.", "Interview Questions": "How I would respond to certain specific escalated situations with youth involved who were in crisis."}, {"date": "14 Jun 2019", "title": "Office Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "Applied for the position, set up the phone screening appointment. Went through 30 minutes of a conversation with a really pleasant recruiter. Got to the end and she started to lay out the salary and benefits. The hourly rate for the position was VERY low for the position, responsibilities, and market.   I opted not to go further in the process.", "Interview Questions": "Describe a situation where you had to deal with a customer/client that was angry, and how you handled it."}, {"date": "13 Jul 2019", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Jackson, MS) in Jun 2019", "Interview Descriptions": "It was a phone interview then in person. Lots of scenarios questions. They interview 30 plus ppl so you have to.really impress at the interview because the amount of ppl being interviewed for one position", "Interview Questions": "What community resources would you use to help your clients "}, {"date": "7 Aug 2019", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Youth Villages (East Fayetteville, NC) in May 2019", "Interview Descriptions": "A recruiter called within 24 hours of submitting the online application. She scheduled a brief screening interview. It consisted of an overview of the job. Then I had an in-person interview at the office.", "Interview Questions": "You are working with a youth who ran away from home. What would you do?"}, {"date": "24 Apr 2019", "title": "Foster Care Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Memphis, TN) in Apr 2019", "Interview Descriptions": "I received an email about completed the step 2 application part and was asked to set up a phone call interview for later in the week. The phone call was about 30 minutes and asked about past experience and told me someone would call later in the week to set up an in person interview. I received a call about an hour later to set up the interview and will have the interview next week.", "Interview Questions": "Q: What is your previous job experience?"}, {"date": "4 Mar 2019", "title": "Family Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "Interview process was pleasant and informative. Questions were straightforward. Interviewer was pleasant and respectful. A series of phone interviews were conducted. Much information was provided regarding case load, responsibilities, and training.", "Interview Questions": "What goals do you have for the future?"}, {"date": "18 Jan 2019", "title": "Crisis Response Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages in Jan 2019", "Interview Descriptions": "Two interviews. One asked a lot of questions that I think were attempts to screen people who were racists or would impose their religious values on clients. Most questions asked for examples, i.e. \"Tell me about a time when...\"\r\nThe second interview involved two scenarios. I was asked what further information I would want and about what I thought would be the best course of action.", "Interview Questions": "Tell me about a time when your quick action kept a situation from getting worse."}, {"date": "15 Feb 2019", "title": "Primary Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Youth Villages (Brandon, MS) in Jan 2019", "Interview Descriptions": "Was contacted by email a day after I applied to set up a phone interview. Interview lasted around 30 minutes where I was asked about my experience and told about the salary and benefits and about the orientation requirements", "Interview Questions": "What experience I had with case management/documentation "}], [{"date": "17 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Youth Villages (Boston, MA) in Jan 2019", "Interview Descriptions": "Met with HR they asked which days I was available and sent me for a drug test. I then signed the paperwork and was told that they would call me when training began.", "Interview Questions": "What days are you available"}, {"date": "4 Dec 2018", "title": "Life Skills Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Boone, NC) in Nov 2018", "Interview Descriptions": "Initially contacted for a phone interview with talent acquisition. They asked general questions about my background and education and then went over a brief detail of the position. It lasted maybe 15 minutes. They forwarded my information to the general supervisor for the position and he contacted a week later to set up an interview at his office. It lasted about an hour, he asked probably 10-15 questions which had already been typed up on a sheet of paper. He forwarded the information to the regional supervisor and I was contacted the next day for a third interview. Meet with that supervisor the next week and she had another sheet of paper with probably 10-15 more questions. Those were mostly case study type questions.", "Interview Questions": "What are some of your strengths?"}, {"date": "24 Dec 2018", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Bartlett, TN) in Nov 2018", "Interview Descriptions": "Pre screen interview in the phone. Basic questions about why I want to work there, my experience with at risked youth and how I feel about breaking up fight, which may occur.", "Interview Questions": "How do you handle stressful situations?"}, {"date": "26 Sept 2018", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Youth Villages (Nashville, TN)", "Interview Descriptions": "I spoke with a recruiter over the phone, fast and easy! They did take their time offering a job, but i was really happy when i finally got the job offer.", "Interview Questions": "What would make you the best candidate for this job?\r\nTell me about your previous experience?\r\nWhat courses did you take in undergrad that has prepared you for this role?"}, {"date": "23 Sept 2018", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Youth Villages in Sept 2018", "Interview Descriptions": "Phone interview, it was not super long. The interviewer answered all of the questions that I had. He also explained how the process of hiring at Youth Villages, also the licensure process in another state", "Interview Questions": "What theories do I use."}, {"date": "26 Aug 2018", "title": "Behavioral Youth Counselor Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Memphis, TN) in Jul 2018", "Interview Descriptions": "First I did a phone interview and it went well, and the person told me that I was moving on to the next phase of the interview process. Two days later a supervisor called me and I interviewed two more times. I also had to take an agility test to get to the 2nd in person interview.", "Interview Questions": "Did I have any experience with youth?"}, {"date": "18 Sept 2021", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Savannah, GA) in Jul 2018", "Interview Descriptions": "Not difficult and average. Interview was good and friendly person asking the questions. I felt comfortable with the process. Just relax and be yourself and try not to over think it.", "Interview Questions": "Tell me about yourself? Why did you apply here? "}, {"date": "14 Aug 2019", "title": "LifeSet Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Oklahoma City, OK) in Jun 2018", "Interview Descriptions": "Completed the online application and was contacted by a recruiter. The recruiter asked me questions about my background before connecting me to the assistant state director for my first interview over the phone. After the phone interview a second in-person interview with the regional director.", "Interview Questions": "What is one thing you think you may have difficulty with the job."}, {"date": "8 Jun 2018", "title": "Clinical Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in May 2018", "Interview Descriptions": "Youth Villages recruiter helped me set up interview with Main counselor and Supervisor who both interviewed me and asked a several questions. They also said I could ask questions of them regarding the program, job duties, etc. at any time. Told me they'd be meeting with other applicants but would get back with me within a week for a second interview/job offer.", "Interview Questions": "What are some qualities you look for in a supervisor?"}, {"date": "14 May 2018", "title": "Family Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Youth Villages in Apr 2018", "Interview Descriptions": "It was an online interview and then a 40-minute phone screen. It was not too terribly difficult. Quick online application. I just finished the interview so I have not yet received an offer; my interviewer said they would get back to me soon.", "Interview Questions": "What is a challenge that you face in the workplace?"}], [{"date": "27 Mar 2018", "title": "Masters Level Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Youth Villages (Douglasville, GA)", "Interview Descriptions": "Repeatedly missed appointments to call and never responded to emails.  Set up phone interview, stated they would call, didn’t call, I emailed, they didn’t answer and so on and so forth for over a month.  2 months later told me I didn’t get the job.  Seems like their organization related to the hiring process needs work.  I would understand if it were someone working as a counselor/staff but this was all from the “hiring manager”.", "Interview Questions": "Never got to this point"}, {"date": "7 Aug 2018", "title": "Summer Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Memphis, TN) in Mar 2018", "Interview Descriptions": "They gave me a Question & Answer reference form for three people to fill out.  The Interview lasted about 30 minutes.  Also, there was a long checklist that had to be filled out online. This took a couple of hours.", "Interview Questions": "Name a time when a child got physical with you. How did you respond? "}, {"date": "26 Feb 2018", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Youth Villages (Memphis, TN)", "Interview Descriptions": "Very laid back. I enjoyed the interview and They asked good questions. We eventually started talking and so we knew each other, we had a lot in common and the interview was really laid-back and the girls were really cool.", "Interview Questions": "What would I do in a violent situation "}, {"date": "12 Feb 2018", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Youth Villages", "Interview Descriptions": "It was a very easy interview. I was an intern before I got hired full time. The interview questions was very easy questions. If you didn’t get the job then you must of been really bad!", "Interview Questions": "N/A"}, {"date": "13 Mar 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Memphis, TN) in Feb 2018", "Interview Descriptions": "Started the interview process with recruiter. Got a email about 2 weeks after applying. The recruiter was friendly but did not know much about the job. The next phone interview was with the HM. HM was very personable but did not stay on subject during the interview. It was hard to know whether I should have side bar conversations or try to keep the interview on track. Received a email saying I would not be moving forward in the process.", "Interview Questions": "Tell me about yourseld"}, {"date": "2 Jan 2018", "title": "Behavioral Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Youth Villages (Memphis, TN)", "Interview Descriptions": "I had a phone interview and then a in person. I then went for a second interview which was a observation. Now I have to finish agility requirements. Very simple", "Interview Questions": "What does self discipline mean to you?"}, {"date": "28 Jun 2018", "title": "Crisis Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Portland, OR) in Jan 2018", "Interview Descriptions": "Initial interview is easy they ask about background and give you an overview of the position, benefits, and company. 2nd interview they give scenarios and ask more questions related to the position.", "Interview Questions": "How do you handle crisis situations?\r\nYour experience with a difficult employee, how did you handle it?"}, {"date": "23 Nov 2022", "title": "Foster Care Trainer & Recruiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Knoxville, TN) in Jan 2018", "Interview Descriptions": "There were 3 phases to the interview process. I met with the direct supervisor, her supervisor and then the two of them together. It was easy and straightforward. They asked great questions, but looking back I should have asked more specific questions.", "Interview Questions": "N/A"}, {"date": "9 Dec 2017", "title": "Family Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "The interview process consisted of two phone interviews, one in person interview, and one ride along to a counseling session.  Overall, it took about two weeks to complete the entire process and an additional week to get the background check/drug test results back.", "Interview Questions": "Scenarios, word association"}, {"date": "28 Nov 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "There was a lengthy application process with educational background required. There was a phone interview with one individual, then 2 in person interviews. It took approximately 2.5 months from beginning to end.", "Interview Questions": "What theory do you use when working with clients?"}], [{"date": "29 Dec 2017", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Youth Villages (Indianapolis, IN) in Nov 2017", "Interview Descriptions": "I put my name down to be contacted by a recruiter at a career fair. About two months later, I was contacted. Once the interview process started, it took about 2 weeks. One phone interview and one in person with HR and a supervisor. I was asked 1 situational question over the phone and three in person. After I responded to the situational questions, I was given feedback so that was great. Overall, it seemed like a more informative interview to ensure I would be okay with all that the job required", "Interview Questions": "How much driving would you expect to do per day?"}, {"date": "27 Jan 2018", "title": "Wraparound Facilitator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Youth Villages in Nov 2017", "Interview Descriptions": "The interview process is super long. You have three interviews, one phone with hr and then two face to face. It took over two months to complete. Then they have you do a ride along.", "Interview Questions": "They asked about your experience working in the field of mental health"}, {"date": "9 Oct 2017", "title": "LifeSet Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Youth Villages", "Interview Descriptions": "Was interviewed and told I would get a response by the end of the week. Within a few hours I received a phone call from the interview offing me the job.", "Interview Questions": "Lots of scenario questions"}, {"date": "10 May 2018", "title": "Transitional Living Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Youth Villages (Tulsa, OK) in Oct 2017", "Interview Descriptions": "The phone interview was more about giving me information about the job as far as compensation and what they offer. Then I was given about 5 different scenario questions base around how they handle real life cases.", "Interview Questions": "How would i handle a stressful situation?"}, {"date": "21 Sept 2017", "title": "Behavioral Youth Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Douglasville, GA) in Sept 2017", "Interview Descriptions": "It was an open interview day. There was a short presentation then we toured the facility then they asked many scenario questions. Staff seemed nice and open but I have read about bad reviews about lack of communication between staff", "Interview Questions": "When was a difficult time you had to disagree with someone you worked with and how did you handle it"}, {"date": "27 Aug 2017", "title": "Foster Care Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "I had 3 different interviews.  It was a bit much for one position.  The pay isn't a lot, but it sounds like a good job to get your feet wet.", "Interview Questions": "What if questions."}, {"date": "28 Aug 2017", "title": "Behavior Youth Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Douglasville, GA) in Aug 2017", "Interview Descriptions": "I interviewed with a Leadership Team Member. The questions that was asked for more about the staff verses the children.  We was able to do a observation of the program and housing for the children", "Interview Questions": "What if you have child that constantly say they going to kill you everyday you come to work. How would you handle that situation?\r\n\r\nWhat you have a staff member that do not like you and you are a situation were you need help? In addition, you ask the staff member for help but she do not help you because she do not like you. "}, {"date": "11 Jul 2017", "title": "Family Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "The initial interview was with the recruiter and they asked some very basic questions to see if you are qualified.  You will also be given the opportunity to ask them clarifying questions to see if you want to continue.  After that, there is a second interview with a manager that is very flexible (video chat interview allowed if you are a long distance away)", "Interview Questions": "Family scenario questions"}, {"date": "31 Jul 2017", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Johnson City, TN) in Jul 2017", "Interview Descriptions": "They scheduled a phone interview and asked basic questions regarding your experience, skills, and education relevant for the job and had one case scenario. Next, a couple days later I was called for a second interview face to face and the interview consisted of about 25 behavioral based questions and one case scenario, lasted for about an hour. The interviewer then wanted to get me straight in to the third interview while I was there but she could not because they were tied up with something else. She said that she would call me soon. The next business day I received a letter stating that unfortunately, I did not meet the requirements. I would not waste my time with this company. It's a waste of time and effort just to be led on.", "Interview Questions": "What does family intervention specialist mean to you?"}, {"date": "3 Jul 2017", "title": "Mobile Crisis Response Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages in Jun 2017", "Interview Descriptions": "This was the first interview.  I was asked about my experience with crisis and then asked how I would handle a case scenario.  I was also asked about any de-eacalation techniques that I have been trained in, and how I would go about de-escalating a situation.", "Interview Questions": "How does your experience prepare you for this position?"}], [{"date": "13 Jun 2017", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages in May 2017", "Interview Descriptions": "YV reached out to me via email. I had a brief screening interview with a representative from the headquarters. After I was asked to apply and a few days later I had a phone interview from a representative from the location I applied to and a skype interview with the hiring manager the day after that. Interviews went well, very conversational instead of interrogative. Staff was very nice and honest about the details of the position. Interview consisted of questions about clinical, supervisory, work place experience, and a few case scenarios.", "Interview Questions": "Tell me about a time when you received criticism that you did not agree with? What would your biggest challenge would be working in this position?"}, {"date": "19 Apr 2017", "title": "In Home Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "2 brief phone interviews, 1 in person interview\r\nMy process was very speedy, I had two phone calls with someone in the office asking about my experience and my interest and then I was brought in for an in person interview. This consisted of 2 supervisors and myself. In the interview I got to learn abou the Youth Villages treatment model and was asked case based questions. I got an offer the following day!", "Interview Questions": "Most of the questions came in the form of case vignettes in which the interviewee would have to respond to with an intervention they think would be beneficial "}, {"date": "21 Apr 2017", "title": "Intervention Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Youth Villages in Apr 2017", "Interview Descriptions": "The interview was rushed and person spoke very rapidly. It was 5:30pm so perhaps they had dinner plans? I was given a brief overview of the company, quickly told about the benefit package, asked a couple of questions, and given the opportunity to \"briefly\" ask follow up questions before we moved on to the next section.  The interview then stated \"if we're interested in giving you an offer you will hear back from us in about a week\" and the call ended. The entire experience lasted about 15 minutes.", "Interview Questions": "Why am I leaving my current position? Why did I leave my former employer?"}, {"date": "22 May 2017", "title": "Behavioral Youth Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages in Apr 2017", "Interview Descriptions": "I had a phone interview which went very well, was more of a back and forth with me answering questions then the interviewer giving me more information about the position and giving me time for questions that made it feel more like a conversation. Was contacted to come in for an in person interview only two days in advance, I replied and asked if there was another interview time available since I was currently attending school 9 hours away and had classes I could not miss during the week. Never received a response, emailed again saying when I would be in the area and asked if there was a possibility to come in then, still no response. Very unprofessional.", "Interview Questions": "Tell me a challenge you have faced in past work and how you overcame it."}, {"date": "12 Apr 2017", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Youth Villages (Memphis, TN) in Mar 2017", "Interview Descriptions": "It started with a phone interview and a face to face the next day. The following week I had the third interview and was offered the job the next day", "Interview Questions": "Questions involve crisis scenario and how you would handle it. "}, {"date": "21 Apr 2021", "title": "Youth Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Nashville, TN) in Feb 2017", "Interview Descriptions": "3 interviews. They’re trying to weed out if you’re capable of doing this job as it does require confidence and assertiveness. It’s a hard job.  You are faced with really tough decisions and they’ll ask questions to see how you will react.", "Interview Questions": "Would you send someone to the hospital who was suicidal?"}, {"date": "19 Feb 2017", "title": "IT Network Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Memphis, TN) in Feb 2017", "Interview Descriptions": "Was really good - till they just disappeared out of the blue with no explanation. They out-of-the-blue turned a job with full benefits to contract based. I was really confused on why, and never got a response from anyone working there.", "Interview Questions": "Logical help-desk related questions."}, {"date": "24 Jan 2017", "title": "LifeSet Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Youth Villages (Durham, NC)", "Interview Descriptions": "Two step interview process. Scenarios given to understand your on the fly intervention development for youth. Word association exercise. Question and answer opportunity in regard to concerns and expectations of the job you are applying for.", "Interview Questions": "What role do you feel you would be best suited for as you indicated an interest in several positions."}, {"date": "3 Feb 2017", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Portland, OR) in Jan 2017", "Interview Descriptions": "Three steps. First was a phone interview with a phone recruiter from a different state. He explained benefits, the job, and asked questions from my resume for me to elaborate on my experiences. Second was an interview with the regional director in my state. The third interview was with a clinical supervisor. The second and third interviews are spilt up between \"regular\" questions and clinical vignettes.", "Interview Questions": "Free associations... What do you think of when you hear these words and how do you think they'd impact your role at YV?: integrity, accountability, team building and two others I can't remember (one of which may have been leadership?) "}, {"date": "12 Jan 2017", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Youth Villages (Southbridge, MA)", "Interview Descriptions": "Was a bit much. One would think that after 3 interviews with three different individuals you would be able to get the most qualified candidates and not just hire to fill positions and maintain numbers", "Interview Questions": "You are given vignettes \nThen asked what you would do"}], [{"date": "8 Dec 2016", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Durham, NC)", "Interview Descriptions": "I had an initial phone screening and then two interviews in person. The first interview was very informative and transparent about the demands of the job. It seemed that the transparency was due to concern of their high turnover as a result of burnout.  I was told to expect to work over 40 hours with a non-negotiable salary of $35,000.  The interviewers were laid back and friendly. However, I was surprised at how in-depth the interview questions were for such an incredibly low-paying job. Be prepared for many crisis questions and vignettes. I felt that the interview went very well, however I was not offered a position. I politely requested feedback, but they were unwilling.", "Interview Questions": "They had two double-sided pages with questions.  Many questions were vignettes that were read off and then I had to explain the interventions I would set in place. They also asked to explain the words (integrity, persistence, engagement, team work). "}, {"date": "29 Nov 2016", "title": "Staff Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Woburn, MA) in Oct 2016", "Interview Descriptions": "First I had a phone screening, then a video conference interview, then a final interview with the hiring manager and a regional director (the interviewing process took about a month). After the final interview, I was told I would hear back in 1 week about their decision.  Unfortunately, the hiring manager felt that it wasn’t necessary to notify their applicants that they did not get the position. I sent an email 2 weeks after the final interview took place and never heard back. After all the time spent interviewing, I feel this is totally unprofessional and would not apply here again.", "Interview Questions": "Generic behavioral interview questions with a lot scenario questions"}, {"date": "29 Sept 2016", "title": "Transitional Living Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Youth Villages", "Interview Descriptions": "I was contacted by email to set up a time for a phone interview to talk more about the position. The interview lasted about an hour. I was told my information would be passed on to the person who makes the hiring decisions for more interviews.", "Interview Questions": "What can you bring to Youth Villages?"}, {"date": "21 Aug 2016", "title": "Social Worker/Interventionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Youth Villages (Tulsa, OK)", "Interview Descriptions": "I applied for the job over the weekend. By Monday, I had received an offer for a phone interview, which was actually more of a screening from a worker in Memphis, TN. I was asked about experience and given a few scenarios. The worker was not able to answer questions about the geographic areas within the state where I would be working. I was told I would be expected to be on call 24/7 for my clients which would number 4-6. I was also informed that there were around (3) one hour sessions per week required with each family, which had to be around the clients' schedules. The second phone interview, I was told I was expected to move within 15-20 of my clients residences. Since they still would not tell me what exact area that was in, I wondered how a company could possibly make that request. I ended the interview after that information was conveyed to me. Their expectations are the most ridiculous I've ever heard and the pay was very low.", "Interview Questions": "I was asked about what types of counseling I was experienced with and asked about specific scenarios and how I would respond. They asked if I knew how to make a treatment plan."}, {"date": "6 Jan 2017", "title": "Teacher's Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Arlington, MA) in Aug 2016", "Interview Descriptions": "a phone interview, then an in-person interview during which you shadow a class for half an hour - during the interviews, i was asked about my past experience working with youth with emotional and behavioral disorders and if i knew anything about collaborative problem solving.", "Interview Questions": "Q: what do you know about collaborative problem solving?"}, {"date": "1 Jul 2016", "title": "LifeSet Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages", "Interview Descriptions": "I applied online and immediately got an email requesting a phone interview. Interview was conducted within a couple of days. I was then told someone would be contacting me in a few days to set up an in-person interview. I didn't hear from anyone for about 2 weeks. To give them credit, the person who finally called apologized profusely and explained the reason for the delay. I had my in-person interview a few days later and was told I did a great job and that they would be in touch within a few days. I never heard from them again. Luckily, I received another job offer just after that so I took it but I felt this interview/hiring process was very poorly handled. At least give someone an answer either way.", "Interview Questions": "Phone interview...standard questions (experience, interest level in work, etc.)\r\nin-person interview was mostly scenarios and how I would handle the situations."}, {"date": "5 Jun 2016", "title": "Transitional Living Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "I was contacted by HR who explained the position in detailed. Pay was Also discussed. Also asked me to expound on my experience and why I'm interested in working with the agency. She stated she was forwarding my app to the regional supervisor. A week later the regional supervisor contacted me for a phone interview. Phone interview was conducted the next day, & lasted an hour. Consisted of a series of questions; what made you interested in this agency, what experience or knowledge do you hold that would benefit this agency through this position, have you ever worked this target population and what are your long term goals. Then I was presented with to scenario questions. After my response to the first we stated she for she didn't need to do The second scenario due to how well I did in the first. The supervisor then expounded on the position and their expectations. Pay was explained in more detailed and the other perks; relocation assistance and etc. Was offered to shadow with A workerprior to interview. But due to the timing I was unable to commit to the shadowing on that particular day. Supervisor stated that was fine, that could easily be rescheduled.  A face to face interview was then scheduled for a few days later. Face to face interview last about 45 minutes. Interviewed with the regional supervisor and clinical supervisor. Very similar questions as before. 2 more scenario questions were asked too. Questions about previous collaboration and teamwork with current or old supervisor and employees in your previous or current position. Was informed of potential hire time, along with being informed that all interviwees would be informed of decision within another week. Currently awaiting decision", "Interview Questions": "what made you interested in this agency, what experience or knowledge do you hold that would benefit this agency through this position, have you ever worked this target population and what are your long term goals."}, {"date": "8 May 2018", "title": "Intercept Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Nashville, TN) in Jun 2016", "Interview Descriptions": "Interviewed at the Nashville headquarters. By the time my interview took place the position was already filled, so they placed me on a list of candidates for other positions in the surrounding areas. My next interview was with the office I would be working in. It was a short easy interview with a calm atmosphere.", "Interview Questions": "To react to a case study and how you would move forward with the client. "}, {"date": "27 May 2016", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Youth Villages (Oregon City, OR)", "Interview Descriptions": "You receive a phone interview from the Tennessee main office at which point they will refer you to an in person interview on site.  The Interview was with the regional supervisor.  They ask typical interview questions and have you complete some scenarios.", "Interview Questions": "Experience working with youth\r\nExperience being on call 24/7"}, {"date": "24 May 2016", "title": "Family Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "My interview took place over the phone. The interview started with a description of the job. Then my skills and educational experience were clarified. The interviewer was friendly and very frank about the long hours. At the end I was offered another interview however I decided this job would not be for me. The pay compared to the hours worked is very dismal. I appreciated their honesty as it helped me make a good decision for myself and Youth Villages.", "Interview Questions": "How do you feel about rotating on call in addition to your work week?"}], [{"date": "22 Apr 2016", "title": "Transitional Living Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages", "Interview Descriptions": "I applied online and was called for the initial phone interview within a few days. I was then contacted a few hours after the phone interview to schedule an in office intervand then called for the 3rd interview. At this one I was told the interviews would be completed that week and I would get a call whether or not I was the one selected. It's been 3 weeks and haven't heard anything. I'm OK with not being selected, however she should have kept her word and called.", "Interview Questions": "There was various scenario questions"}, {"date": "26 Apr 2016", "title": "Behavioral Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Douglasville, GA) in Apr 2016", "Interview Descriptions": "It was an open house interview. Each of us interviewed with different managers. During that, I was asked what age group did I prefer. After the interview, I was taken to a residential area where the age group I prefer lives to observe. After that, I was taken into a room with 2 managers, one of which was the supervisor of the zone I prefer. It consisted of questions that required both written & verbal answers.", "Interview Questions": "A 16yr old girl that got up after bedtime pacing in her room mumbling to herself. Once asked what's wrong she began yelling and scratching herself until she bled. How would you handle this situation?"}, {"date": "7 Feb 2019", "title": "Behavioral Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Bartlett, TN) in Apr 2016", "Interview Descriptions": "I had 2 phone interviews and an in-person interview onsite. My first phone interview was with a corporate recruiter and my in person interview and follow up phone interview were with my (later)manager.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Mar 2016", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Johnson City, TN) in Feb 2016", "Interview Descriptions": "Very smooth process. I was brought in after applying online. The first interview was by phone. I was asked a series of situational questions and then given a run down on what the position would be like. After passing this portion, I was brought in for an in person interview. This went well so I was moved on to another representative on site where I interviewed again. Very nice company that was very transparent about the challenges and benefits of the job.", "Interview Questions": "Situational questions about cases and asked how I would handle it."}, {"date": "17 Feb 2016", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Youth Villages (Paris, TN) in Jan 2016", "Interview Descriptions": "The interview was relaxed, with many situational questions. There was a phone screening first with a hiring manager then they set up the in person interview with two supervisors. The entire interview lasted about one hour. The supervisor called with in a couple of days to tell me their decision.", "Interview Questions": "What would you do in specific situations."}, {"date": "20 Oct 2016", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Youth Villages (Memphis, TN) in Jan 2016", "Interview Descriptions": "It was an open house interview. I observed in a classroom and then I was interviewed by a panel of people.  It was easy to find and I felt welcomed by the staff and leadership.", "Interview Questions": "Name three traits of a good employee."}, {"date": "26 Dec 2015", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Youth Villages in Dec 2015", "Interview Descriptions": "The first interview with two HR personnel was easy with rather simple questions. The total time for this interview was approximately 10 mins; yes, ten mins.\n\nThe second interview consisted of observing an all girls group of teens ages 14-17 as they participated in therapeutic recreation. Afterwards, I toured the facility and interviewed with a floor supervisor and program manager.", "Interview Questions": "A boy, 10 years old, has ADHD was called out while playing a game of kickball. He will not leave the base and insists he is not out. He begins to verbally attack playmates and spit on staff. How would you handle this situation?"}, {"date": "12 Nov 2015", "title": "Overnight Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "The interview was really great. Very simplistic and quick. The interviewer was very open, and brief. The hiring process was quick. The first week of work was either an orientation for some or on the job training.", "Interview Questions": "None"}, {"date": "19 Nov 2016", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Youth Villages (Arlington, MA) in Nov 2015", "Interview Descriptions": "To apply for a job you go online and fill out a pretty generic application. \r\n\r\nYou then get an email or phone call asking you to come in\r\n\r\nThey call this an \"open house interview\". You come in and check in in the main building and are walked to a conference room (this is the same room you'll have weekly meetings & CPR and random movie nights when you're hired) \r\n\r\nThey explain GL and the different programs on campus. Different managers come in and split people up. I had my interview in a group home. \r\n\r\nwe went to their office and they asked me questions like, \"what would you do if...\" and \"tell me about a situation when...\"\r\n\r\nMost people are hired on the spot. The turnover rate is crazy fast. \r\n\r\nThere will then be a two week training in Woburn", "Interview Questions": "They asked me a lot of questions about how to prevent crisis situations. \"A girl was mean to another girl and she seems really agitated\""}, {"date": "30 Nov 2015", "title": "Family Interventionist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in Nov 2015", "Interview Descriptions": "It was Tough. I was a bit nervous because the scenario questions were a little misleading. I tried as hard as possible to make sense of the scenarios and comprehend them as best as I could.", "Interview Questions": "A lot of different scenario questions."}], [{"date": "12 Oct 2015", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Youth Villages (Portland, OR)", "Interview Descriptions": "I first submitted an application using their online system. I received an email from a recruiter shortly after, offering some potential times for a 10-15 minute phone interview. This phone interview ended up being the next morning. The recruiter was very friendly and personable. She was upfront and transparent about the salary - which would start at $36,000 and raise to $39,000 after the first year. The questions were not challenging. She told me she would like to pass me along to her supervisor for a second phone interview. I considered some of the information I received during this interview and when I received the call for the second interview, I declined. I decided I did not want to be on-call 24/7.", "Interview Questions": "You will manage a caseload of families whom you will need to visit throughout each week. Will you be able to travel between homes and potentially work evenings depending on client availability?"}, {"date": "13 Oct 2015", "title": "Night Monitor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Youth Villages (Arlington, MA)", "Interview Descriptions": "Due to the high turn-over rate, YV is always conducting interviews. You are first called from the headquarters in Nashville to obtain the preliminary information. You are then called by the local office to set up an in-person interview. Interview was basically a run down of what the program entails. As long as you pass a background and drug test, you will most likely get hired because they are so desperate for people", "Interview Questions": "Why do you want to work at youth villages?"}, {"date": "27 Oct 2015", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Youth Villages (Green Bay, WI) in Oct 2015", "Interview Descriptions": "mostly company overview, salary, relocation reimbursement, work schedule.....starting wife $32,000 after one year $36,000, and after 2 years $39,000....relocation is pure reimbursement - $1,200 flat (includes everything...if you are asked to interview in person they expect the funds to travel come out of the $1,200) - seemed more like a \"here is what we offer, if you like it complete the actual legal application online then you have an interview with a regional manager\"...I believe this initial phone interview is merely to let people know how low the pay is", "Interview Questions": "Family: mother, grandmother, 16 year old son truancy and AODA challenges - what would you do to help family"}, {"date": "29 Dec 2015", "title": "Overnight Teacher Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Youth Villages (Louisville, KY) in Oct 2015", "Interview Descriptions": "I received first over the phone interview and that lasted an hour. Found out on second over phone interview that first was just a screening interview. Scheduled third interview... So many interviews but everyone was nice, clear, and helpful. I was leery with so many bad reviews but understood you have to start somewhere", "Interview Questions": "How would you handle type questions... Multiple but each similar to what others on this site said."}, {"date": "21 Sept 2015", "title": "Foster Care Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Nashville, TN)", "Interview Descriptions": "The interview process was easy. They asked the questions you would expect any organization to ask. It was casual and relaxed. I was struck by their honesty about the difficulty of the role and also, why their retention rate is so low right now. Near the end of the interview I was given two scenarios and asked how I would respond to them and I believe this plays a huge role in their assessment of your skill set/knowledge base for the position.", "Interview Questions": "(1) why are you interested in this role? (2) what do you bring to the table? (3) what would you find challenging about this work? "}, {"date": "10 Sept 2015", "title": "Teacher I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "It was a very cordial, relaxed process; however, a computer glitch voided my eligibility for the position.  I had to do the groundwork to correct this issue with little initiative from the company.  A phone interview was later followed by a group interview and informational meeting.  A 1-on-1 interview was the final step.  All portions of the process were relaxed and friendly.  I had a feeling that high turnover contributed to the mass of people hired from my cohort.", "Interview Questions": "How would you handle a child in crises during class?"}, {"date": "12 Jul 2016", "title": "Life Skills Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Youth Villages (Portland, OR) in Sept 2015", "Interview Descriptions": "Brief interview where I was asked basic interview questions, strengths/weaknesses, experience, scheduling, how I would handle certain situations with clients, If I have worked with an at-risk population, driving record", "Interview Questions": "If a client asked who I was voting for president, what would I say?"}, {"date": "30 Aug 2015", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "Called in for a first interview, where we went over exactly what YV does, the age group, behavioral problems of the clients and the details of the TC position (went well) a week later called in for an observation of the girls and a second interview. Observation time was very important to really see how everything is done.", "Interview Questions": "Three words to describe yourself."}, {"date": "12 Jun 2015", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "face to face 30 minute interview. then a quick tour of facility and 1 hour sit in with other employees. Face to face with the manager that will be over you and your location. A quick review of the rules and youth.", "Interview Questions": "what makes you the right person to work for youth villages?"}, {"date": "5 Jun 2015", "title": "Night Monitor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Youth Villages (Portland, OR) in Jun 2015", "Interview Descriptions": "Applied online, was then contacted via email for a phone interview by a recruiter. Spoke for about 40 minutes, the job was outlined and pay and schedule were touch on. then the interviewer opened it up to any questions I had.. very relaxed and easy, recruiter was open and honest. I declined to move further as the job didn't completely match up to my career goals.", "Interview Questions": "How would you handle a resident that is upset and disturbing other residents while they sleep?"}], [{"date": "31 May 2016", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Memphis, TN) in Jun 2015", "Interview Descriptions": "Initial call from an HR rep who is very nice. They explain benefits and salary. \r\nCall from local office hiring manager, which would be the clinical leadership team. \r\nTeam asks \"what if?\" questions. Team asks experience with and opinions on different job responsibilities.", "Interview Questions": "What to do in certain situations..."}, {"date": "5 Apr 2017", "title": "YVLifeSet Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Columbia, TN) in Jun 2015", "Interview Descriptions": "I was asked about previous experience, and given scenarios in how I would handle them. We discussed how I handled stressful situations in the past, and how I would handle them in the position for which I was interviewing. We talked about self-care, and my personal coping skills. We talked about a description of the job, and whether I felt like I was a good fit. I also came with questions about the organization, opportunities for advancement, and tuition reimbursement.", "Interview Questions": "Describe when you had a difficult time with a supervisor."}, {"date": "2 Jul 2015", "title": "Behavior Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Memphis, TN) in Jun 2015", "Interview Descriptions": "I applied online three weeks before an initial phone contact. The recruiter called me and explained the low salary wage. She stated that employees for this particular position had to work one  weekend day of 16hrs( Saturday or Sunday 6am-10pm). She scheduled a phone interview about my work experiences, interest in the job, and my ability to perform the job.", "Interview Questions": "How would you deal with a disruptive client?"}, {"date": "27 Aug 2015", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Bartlett, TN) in Jun 2015", "Interview Descriptions": "You go through two interviews. The first is an overview of what you will \"supposedly\" be doing. The second interview is an observation of the facility, specifically the girls or boys you will be working with.", "Interview Questions": "Why should we hire you?\r\nAre you comfortable restraining children?\r\nName a time you had to do etc...?\r\nHave you ever worked in this environment?"}, {"date": "23 Jan 2017", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Youth Villages (Worcester, MA) in May 2015", "Interview Descriptions": "3 hour long phone interview with one of the direct supervisors. She asked plenty of clinical, senerio based questions. Really intense but she tried to make it as painless as possible.", "Interview Questions": "What would you do if... "}, {"date": "31 Aug 2017", "title": "Night Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Lake Oswego, OR) in May 2015", "Interview Descriptions": "Interview was very professional and positive, and they had me spend about thirty minutes observing and interacting with clients to get a feel for what the job would be like.  This was the luck of the draw that I wasn't observing during a crisis situation.  Interview ended up lasting overall about an hour and half including the observation time.", "Interview Questions": "How do you handle crisis situations?"}, {"date": "13 Apr 2015", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages in Apr 2015", "Interview Descriptions": "I applied for the position and was contacted within 24 hrs by a recruiter I then had an interview with a supervisor by phone and then flew from out of state for the face to face interview with 3 management personnel the process took 2 weeks from start to finish. They started off the last interview saying they wanted someone with a masters which isn't in the description nor was it said in the first 2 interviews. This was especially irritating since I paid for the last minute flight assuming things were going well and I actually was qualified. Note: I have a bachelors in psychology and a year and a half of case management experience for a non profit.", "Interview Questions": "3 scenario questions in each interview. One example: there is a 5 yr old who is ok at school but at home is aggressive the mom is not present at sessions what do you do?"}, {"date": "9 May 2015", "title": "Behavioral Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Douglasville, GA) in Apr 2015", "Interview Descriptions": "The interview proceeds was very easy. They just ask a lot of scenario questions. Just be sure of what you're saying. Don't sound as though you're asking or waiting for the interviewer to assure you that your answer is correct. Is very relaxed, felt more like a conversation on all interviews than interviews.", "Interview Questions": "If you had to facilitate a group with boys who's ages range from 12-18 what would be the name of the group and what would the topic be?"}, {"date": "23 Apr 2015", "title": "Behavioral Youth Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Portland, OR) in Apr 2015", "Interview Descriptions": "I had a 30-minute phone interview with a HR person in the mid-west.  We talked about the specific position and benefits, schedule and salary.  Unfortunately this position only paid $11.50/hour, which would be extremely tight, if at all possible, in the Portland area.  She gave me a few days to think about it after the interview to decide if I wanted to move forward.  I withdrew my application.", "Interview Questions": "Would you be comfortable intervening physically with a child if needed and after completing training?"}, {"date": "14 May 2015", "title": "Teacher/Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Memphis, TN) in Apr 2015", "Interview Descriptions": "I was contacted by a recruiter from Youth Villages after submitting an application. The process began with an online interactive seminar followed by a Q and A opportunity for more information. I was later email an invitation to an 'Open House' to a group home where I was to observe the staff and interact with the clients who lived there. After the session was over, an additional interview was supposed to have been conducted but the person who was to do the interview was needed to transport a child and no one else was available. I attempted to reschedule at a later date and was unsuccessful as my calls were not returned. I later recieved an email that said the position had been filled.", "Interview Questions": "I was asked what type of activities would I be able to conduct with the girls in the unit."}], [{"date": "21 Apr 2015", "title": "Bilingual Family Intervention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Douglas, GA) in Apr 2015", "Interview Descriptions": "Interview was in-person at GA location. Interview consisted of lots of \"describe a situation where you were...\" , questions about your personal style and scenario questions. A LOT of scenario questions. They gave you a scenario and asked open-ended questions about what you would do, what approach you would take, etc.", "Interview Questions": "Describe a scenario where someone gave you feedback that you didn't agree with. "}, {"date": "4 Mar 2015", "title": "Family Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "Initial phone interview about 30 minutes long. Asked about relevant job experience and education. The woman was friendly, however they were upfront about the low pay and long work hours associates with the position", "Interview Questions": "Describe a time you had to overcome a challenge at work"}, {"date": "27 Mar 2015", "title": "Family Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Asheville, NC) in Mar 2015", "Interview Descriptions": "I had a phone interview. This was after an initial phone screen. The process went well and was quite casual until the end when I was asked several scenario questions. I received a form e-mail saying that I had not been selected. It was quite polite but obviously impersonal. I think the fact that I asked very specific questions about the workload, schedule and that I brought up the horrible reviews of the company didn't help much. LOL. Probably not for me anyway. It had an \"indentured servant\" feel to it because of the promise of paid supervision provided you work for 2 years IN ADDITION to the years it takes you to become fully licensed or else pay back the company. With the starting salary of 34k...no thanks anyway. I have to pay back my student loans somehow.", "Interview Questions": "\"You are working with a client and his mother calls you saying he is threatening to hurt her. How do you handle the situation\""}, {"date": "13 Mar 2015", "title": "Teacher Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Youth Villages", "Interview Descriptions": "The interview process is extremely laborious. I went through 2 interviews for one position then 2 interviews for one that the staff thought better suited me (the Teacher-Counselor) only to find out after a month-long process that I didn't get the job. The HR Director gave me no answer as to the reason. I later found out it was probably due to the fact that I had a speeding ticket on my background check. I think it was cowardly for them not to be honest about it.", "Interview Questions": "Typical: What are your strengths and weaknesses? How do you handle stress? They gave scenarios and asked how would you handle this situation?"}, {"date": "12 Mar 2015", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Johnson City, TN)", "Interview Descriptions": "I met with the regional supervisor for the department. Job expectations and typical problems were discussed. My resume and education was reviewed. I was then given a scenario and asked to discuss what needed to be addressed and in which order. I was asked to describe barriers that I have overcome and struggles that I have experienced in the office.", "Interview Questions": "How do you deal with stress in the workplace. "}, {"date": "13 Apr 2015", "title": "Family Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Youth Villages (Memphis, TN) in Mar 2015", "Interview Descriptions": "Interview was full of \"what-if\" type questions that were simple to answer.  Interviewer was up front about schedule and pay.  The pay was VERY low and the schedule was terrible.  You were REQUIRED (even on off days) to drive patients places on your own time, no over time given.  The position would be great for a person without kids and should most likely be single.", "Interview Questions": "How much experience do you have disciplining children?"}, {"date": "15 Jan 2016", "title": "Overnight Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Youth Villages (Bartlett, TN) in Mar 2015", "Interview Descriptions": "I applied and they contacted me by email first, I was then called and was scheduled a phone interview. On the day of my phone interview it lasted about 30 minutes. Phone interview consist of questions about you, your experience, followed by scenario questions. I was then scheduled a second interview and observation. I came in the afternoon hours (when the kids are out of school) to observe for about 20 minutes then I went back with the interviewer and was asked questions about what I observed, more scenario questions, and questions about what kind of activities I would do with the kids.", "Interview Questions": "What would you do if a kid spit on you? What you would tell a child if their parents couldn't come visit them on their birthday? ( all of these questions is something you have to actually deal with) What's your definition of self control (very important question) because you have to have a lot of self control when dealing with difficult children and times of crisis."}, {"date": "18 Feb 2015", "title": "Residential Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "I was called about 2 days after I applied online by a woman in the Tennessee area.She gave me a few options as to what job I was interested since I applied for more than one. She asked me basic questions about my experience and then gave me a scenario to answer. The scenario was about conflict and she wanted to know how I would have handled it. \r\n\r\nShe then stated the hours and salary. Afterwards she stated I may get a call back within 7 days once she sends over my info to the hiring manager for the position. I got a call back a few days later from the hiring manager. That was last week. Today I will be interviewing over the phone.", "Interview Questions": "How to handle difficult youth"}, {"date": "8 May 2015", "title": "Family Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Youth Villages (Knoxville, TN) in Feb 2015", "Interview Descriptions": "Applied online in Feb. Received an email & phone call for initial interview. I was told it would be a 2-3 month process. Went back for a second interview about 2 months after the initial contact.  The follow up call which happened in the next week informed me the position wouldn't be open until July when I thought the position would be end of April/May. I was disappointed but understanding.", "Interview Questions": "Why do you want to quit your current job?"}, {"date": "1 Mar 2016", "title": "Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages in Feb 2015", "Interview Descriptions": "A re ruiter contacted me and notified me that I had shown interest in the Tennessee area and then asked me if I would consider working in the Massachusetts office. Then she did an initial interview over the phone. Than a week later did a phone interview with a supervisor. Then allowed me to interview in person in two weeks. After being interviewed I was notified within the week that I would be hired.", "Interview Questions": "Experience in working with at risk youth. Also alot of scenario questions"}], [{"date": "2 Feb 2015", "title": "Behavioral Youth Counselor (Teacher Counselor) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages", "Interview Descriptions": "Several days after applying online, I received a short phone interview. It was very relaxed and simple questions such as any experience I had in the field, etc. Afterwards I was asked when I would be available for a face to face interview.\r\n\r\n1 week later I met with my interviewer. I showed up 15 minutes early, yet my interviewer was roughly 15 minutes late. He was very casually dressed, and the interview was not at all what I expected. The whole experience was very unprofessional, as he would constantly look at his phone or mess with his computer, showing little interest.\r\n\r\nAfter the interview I set up a date less than a week later for an orientation (walk about) at the group home I would be working at. Over all the experience went well.\r\n\r\nThe final step was a second interview, where I was asked more scenario questions, focusing more on my willingness to physically detain an uncompliant  youth. Once again the interview was unprofessional, and the interviewer seemed distracted and uninterested. Afterwards I was told he would call me later that evening to let me know if I received the job or not......never heard from him again.", "Interview Questions": "Given short scenarios to see how you would react and handle a situation."}, {"date": "11 Nov 2014", "title": "Youth Care Worker Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Youth Villages", "Interview Descriptions": "The first step in the process was a short phone interview with a recruiter where I was asked about my experience working in mental health and particularly about my experience with crisis management. The recruiter typed notes to record my answers and told me that I may or may not be contacted for the next part of the interview process. A few days later, I was contacted by a program director at the Germaine Lawrence campus and scheduled an in-person interview. I interviewed with one manager for about 40 minutes and then did a brief classroom observation. After the observation, I interviewed with another manager for about 45 minutes.", "Interview Questions": "What part of the job requirements do you think you would struggle the most with?"}, {"date": "3 Feb 2015", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages in Nov 2014", "Interview Descriptions": "I was contacted via phone to schedule an initial interview with an HR manager from HQs. I then conducted another phone interview with the regional manager and was invited to an in person interview in the local office. The interviews consisted of case studies and questions but were relatively easy.", "Interview Questions": "The interviews consist of case studies in which you are asked questions about how you would handle them. "}, {"date": "9 Oct 2014", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "I'm still in the interview process. I've had the phone interview and I have an in person interview next week. The phone interview was pretty simple and laid back. Job duties and salary were discussed. I was asked how I would handle different scenarios.", "Interview Questions": "How would you handle a child who became irate? "}, {"date": "28 Aug 2014", "title": "Transitional Living Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "I've had the pre screening interview, afterwards I was told I would be contacted 7-10 business days after that. I've been emailing and calling about the second interview.....no response. I'm kind of frustrated because they are giving me the blues about my second interview that was suppose to be THREE WEEKS AGO", "Interview Questions": "Question were fair"}, {"date": "28 Aug 2014", "title": "Family Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "There is an initial phone interview, then an in-person interview. They replied back quickly and stayed in contact with me of I had any questions.  Everyone I interacted with was pleasant and helpful. They assisted with finding the situation that worked best for me. They were open to listen to questions and concerns, and were honest about the disadvantages of the job.", "Interview Questions": "Name a time you were faced with a confrontation; how did you handle it?"}, {"date": "15 Aug 2014", "title": "Specialized Crisis Counselor Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages", "Interview Descriptions": "There was a telephone 'screening interview,' followed by in person interviews with local management. The telephone interview was weird! The interviewer was constantly pausing without explanation. I understand 'pausing' to be an interview tactic, but this was beyond that. The interviews left me with a strong impression that the company is a tad disorganized. I think most non-profits are the same way though, so I didn't draw any bias from that.", "Interview Questions": "They present scenarios during the interview and ask what you would do in that scenario. "}, {"date": "8 Aug 2014", "title": "Teacher Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "Call with interviewer on the phone then had a group interview with a home director and someone else.  I was honest and upfront. I believe one of the ladies was texting on her phone during the interview though.", "Interview Questions": "The biggest questions they ask about is situations that really happen and see how you respond. My interviewer told me when it was over that they were looking at my ability to think outside of the box."}, {"date": "3 Nov 2015", "title": "Clinical Care Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Madison, IN) in Jun 2014", "Interview Descriptions": "I was interviewed on the phone twice and was asked to come in for a face to face interview with the regional manager and regional supervisor. I did not meet my immediate supervisor until the job was already secured. I was first contacted by a recruiter out of Nashville and was later contacted by the regional manager for a phone interview.", "Interview Questions": "They asked about how I handle conflict, situations dealing with containing my shock. They asked about my experience with being on-call and with managing crisis situations. In addition, they had the supervisor on the phone to ask any questions she felt were necessary for the job."}, {"date": "3 Apr 2014", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Youth Villages", "Interview Descriptions": "The interview process was pretty easy and convenient. I was part of a large college group and they brought managers to all come together in the operations center to interview us. I was nervous and a bit unprepared but I was able to get through it by being very personable.", "Interview Questions": "Information about the company because i was confused about the numerous facilities"}], [{"date": "29 May 2015", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Knoxville, TN) in Apr 2014", "Interview Descriptions": "I met with regional supervisors, two over the course of 3 interviews. Mainly the regional managers wanted to make sure that this was the right fit for me and my family. They were very open and clear about expectations and after the 3 step interview process they made me an offer.", "Interview Questions": "What makes you think that Youth Villages is the right fit for you?"}, {"date": "20 Jan 2014", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Youth Villages", "Interview Descriptions": "I was initially contacted by a phone recruiter who directed me to complete on-line application steps separate from my initial submission through the Youth Villages website. After I completed this section, I was scheduled for an initial interview and also a second interview. High intensity in  communication was maintained by phone and email before, between, and after interviews. Staff were professional and supportive in the process.", "Interview Questions": "The most difficult question were scenario questions concerning specific clinical skill processes concerning potentially resistant clients. "}, {"date": "10 Jan 2014", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages", "Interview Descriptions": "Sent in my application and received an email a few weeks later about an interview. Scheduled a phone interview with Sister Barbara, who was very kind and friendly. The interview lasted about 30ish minutes. The questions weren't hard at all; it was more like a chat. Heard back a few months later about being hired.", "Interview Questions": "If you were an animal, what animal would you be? (not difficult, just unexpected because it came randomly towards the end)"}, {"date": "13 Jan 2015", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Memphis, TN) in Jan 2014", "Interview Descriptions": "I was first contracted by phone. Then later I had two face to face interviews. The interviews were far and in between ... It took almost 3 months ... I was offered the position... Please ask questions a lot. There are some things you may have to do extra with auto insurance.", "Interview Questions": "Plenty of scenario questions ... Remembers to think about safety first "}, {"date": "4 Nov 2014", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Youth Villages (Douglasville, GA) in Jan 2014", "Interview Descriptions": "I contacted the company recruiter for the Douglasville, Georgia campus. I spoke with her, Amanda Jordan and submitted to her my resume, references, and cover letter. I spoke with her on the phone to answer a few preliminary questions about the job. I answered questions about my availability and about my willingness to work odd hours. I was invited, after a few days, by email, to the main campus to tour it and to conduct and in-person interview. This interview consisted of questions about my education and prior work experiences. It also included questions about hypothetical scenarios involving youth and about how I would react/respond to them. I heard back from Amanda Jordan approximately two weeks later, requesting my college transcript and inviting me back to campus for observation of the unit I was applying to work with. After observation, and one last talk with Amanda about how the observation went, along with a question and answer round, I was told I had gotten the job! I went through two weeks of training and orientation and a week of on the job training before I was considered a full-time employee.", "Interview Questions": "Have you ever encountered a situation with a child that you did not feel as though you could handle and what did you do about it?"}, {"date": "28 May 2015", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Morristown, TN) in Jan 2014", "Interview Descriptions": "1st interview not ready. Management was rushed. Multitasking during interview about clients and situations. Gave case scenarios and how would I handle the situation. Interview was quick and interrupted through whole process.", "Interview Questions": "Case study  scenerio"}, {"date": "24 Oct 2013", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "Applied Online.  Received follow-up within 48 hours of applying.  Phone interview conducted 48 hours after initial follow-up.  Invited for face-to-face interview at the end of phone interview.  Face-to-face interview was conducted two days after phone interview.  Job offer presented at the end of face-to-face interview.  Start date was one week after face-to-face interview.  Quick process.", "Interview Questions": "If you do your research on the YV interview process and the models they implement (MST and Intercept model) then you will know what to expect.  Scenario questions make up a large portion of phone and face-to-face interview (\"How would you handle this situation?\")"}, {"date": "18 Jul 2013", "title": "Behavioral Youth Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Youth Villages (Memphis, TN)", "Interview Descriptions": "I applied for opportunities for future graduates in March or 2013. I was contacted through Email and scheduled a phone interview. the phone interview was 30 minutes and the recruiter asked questions about your experience and what you would do in certain situations. When it ended, she invited me to an \"open house\" to learn more about the organization and to interview again. I went to the open house and was seated with about seven other people. We were greeted by the recruiter and she explained a lot about Youth Villages. Afterwards, we were lead to a room where many of the hiring managers were located and we were spread out to various managers for interviews. the interview consisted of a manager asking us a set of questions on a list. \r\n\r\nAfter we were finished, they spread us out into specific facilities that we would be working at to \"observe\" the program and the other counselors and the kids. I sat there for about an hour watching the kids before a manager got me and told me I could go home. he said he would call within the next week, though after about three weeks I finally heard from him and was asked to come do paperwork. I went in and he told me I had to go get my fingerprints and a drug screen, then he would call me again. I did that and never heard from him again, despite trying to contact him. After about three weeks since the drug screen, a manager from another campus called me to tell me the campus I interviewed for had filled their positions, and that I could try and get into that campus. \r\n\r\nI scheduled an interview and drove up to the new campus. I met with the manager in the office and had a terrible interview. The manager was asking me questions while surfing through his email and checking his phone. It was really unprofessional. After the interview, I observed this campus for an hour until the manager told me I could leave. It was another three weeks before I finally got a rejection email.", "Interview Questions": "How do you define self-discipline? "}, {"date": "4 Sept 2013", "title": "Family Intervention Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Columbia, TN) in Aug 2013", "Interview Descriptions": "The first interview gives you details on salary and expectations as well as benefits. Keep in mind you can not work for Youth Villages if you have more than two traffic violations in the past three years. After you phone interview with the recruiter if you decide to move further they will help you move forward in the next steps which is another interview. I did not move past this step due to the relocation reimbursement not being what I expected and inability to move quickly.", "Interview Questions": "Being given a scenario  with limited information and asked how would you handle this situation and which techniques would you use."}, {"date": "1 Jun 2016", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages in Aug 2013", "Interview Descriptions": "There were two phone interviews, one with HR in Tennessee, and one with the regional director, and then one in person interview with the director of the local office. Most questions were scenario based, but also some normal interview questions such as \"tell me about your experience.\" Overall this process was very easy. The questions were straight forward, and as long as you are focused on the family system when formulating your answers, you're likely to get the job.", "Interview Questions": "They provided several scenarios of families you might encounter during service, and asked how you handle each case."}], [{"date": "19 Mar 2016", "title": "Primary Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Tupelo, MS) in Aug 2013", "Interview Descriptions": "The interview process was slightly long. There were three interview. One by phone and then two with regional supervisors. The phone interview was with the hiring manager/recruiter initially. Then there was an group open house type of situation that included a presentation about the program from current managers and then two interviews. Only those who were succeful in the first face-to-face, were asked to stay for a second interview.", "Interview Questions": "The questions were situational and case example in type. They gave you scenarios and wanted to see how you would help the families."}, {"date": "29 Jul 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages", "Interview Descriptions": "I had three interviews for my current job at Youth Villages. I was asked a lot of questions about my job and my views of the organization.", "Interview Questions": "What would you do in such and such a situation?"}, {"date": "25 Jul 2013", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages", "Interview Descriptions": "Fairly easy, some questions over work history but primarily focused on scenarios and how I would handle various situations.  This occurred in both the telephone interview and the face-to-face.", "Interview Questions": "It was really the scenarios.  You were not allowed to ask for additional information on the family/client and you were not briefed on company policy.  So when a scenario begins with \"you have been working with a family for 3 months and <blank> happens, what do you do?\" it makes it difficult as a clinician to not have additional information because hopefully after 3 months you would have a pretty good idea.  This should have been a warning that in the job, every situation has a specific response that is in no way based on clinical understanding or the therapeutic relationship."}, {"date": "17 Oct 2017", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in May 2013", "Interview Descriptions": "I dud a phone interview then i did a in person interview.  We did orientation.  During orientation we did a walk through on campus. They also taught us how to drive the sprinter vans .....", "Interview Questions": "How to handle a child in crisis."}, {"date": "16 Jun 2014", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages in Mar 2013", "Interview Descriptions": "I had a total of four Interviews. I had one phone screening and the other three were face to face. All were in a cool, welcoming environment. Most were at the various offices they had around the Memphis area.", "Interview Questions": "Most of the questions were scenarios and \"what would you do\" type instances. "}, {"date": "27 Feb 2013", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 months. I interviewed at Youth Villages", "Interview Descriptions": "Are you breathing and seem appropriate.", "Interview Questions": "Gave you scenarios and saw how you would handle it."}, {"date": "16 Jul 2012", "title": "Family Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Youth Villages (Washington, DC) in Jul 2012", "Interview Descriptions": "I had a pre-screening interview over the phone. It was awkward and the man conducting the interview sounded as though he were reading material/questions from a sheet of paper.", "Interview Questions": "I was given a scenario and asked about the strengths of the family, what my interventions would be, etc. He read the question quickly and I was left a bit flustered by it. "}, {"date": "12 Aug 2015", "title": "Transitional Living Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Youth Villages (Woburn, MA) in Jun 2012", "Interview Descriptions": "Phase one interview was over the phone and asked basic information about educational and professional experience. Phone interview also gave a rundown of basic functions of the position including day to day duties, schedule and benefits\r\n\r\nPhase two was an additional phone interview that asked more  questions about my professional experience including strengths and career related goals. What I hope to get from the job. \r\n\r\nphase three was a face to face interview where I completed a series of vignettes and discussed more about the position.", "Interview Questions": "The vignettes were the most challenging part of the interview, if you have no experience."}, {"date": "8 May 2012", "title": "Bilingual Family Intervention Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Boston, MA) in May 2012", "Interview Descriptions": "My interview was today and it was horrible! the man who interviewed me was great ! but my cellphone went out on him twice during the interview when I called back I didn't get a response so I know I didn't get this job at all and I know I am qualified for the job. I sent him a thank you and sorry note", "Interview Questions": "What do you need improvement on."}, {"date": "1 Jul 2015", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Johnson City, TN) in Apr 2012", "Interview Descriptions": "Went through a 2 interview process that was behaviorally focused (e.g., tell me about a time when...). Second interview contained a case-scenario and I was given a specific situation and asked what I would address first, second, etc and why.", "Interview Questions": "Tell me about a time you encountered a conflict at work and had to solve it. "}], [{"date": "4 Jun 2014", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Youth Villages (Memphis, TN) in Dec 2011", "Interview Descriptions": "I had two phone interviews and then one in person where they had me drive accross the country for a half an hour in one room where they officially said they hired me. It was never in the job description given to me to be on call 24 hours a day.", "Interview Questions": "They didn't really ask any difficult or unexpected questions. There were a lot of scenarios and I guess I wasn't really expecting that."}, {"date": "6 Nov 2015", "title": "Direct Care Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Douglasville, GA) in Sept 2011", "Interview Descriptions": "One on one discussion.  They just review your resume with you.  Then decide if they want to give you an offer.  Then they bring you in for orientation and training, which take 2-3 weeks.", "Interview Questions": "N/A"}, {"date": "21 Mar 2014", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in Jun 2011", "Interview Descriptions": "Internet application. Phone conversation to schedule in person interview. Possible second interview to determine team setting.", "Interview Questions": "They use situation and role playing formats for many questions. "}, {"date": "29 Apr 2013", "title": "Residential Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Youth Villages (Linden, TN) in Feb 2011", "Interview Descriptions": "It seemed a little \"hoaky\", I was given the company vision statement and told to write what it meant to me??? They seemed more interested in my willingness to \"put hands on\" a kid than my interest or involvment with kids. Most of the staff seemed distant or half there. Interview process is long and takes two weeks for orientation in another city.", "Interview Questions": "What would you do if a kid hit you and then spit on you?"}, {"date": "8 Sept 2011", "title": "Direct Service Provider Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Youth Villages (Memphis, TN) in Feb 2011", "Interview Descriptions": "The one on one interview was hard. They asked lots behavioral questions. Be prepared to answer case study questions as well. They give you scenarios and you must explain to them what you would do in extreme situations with the students involved.", "Interview Questions": "How would you prioritize this situation? If a student was attempting to jump out of the window, while one student threatens to harm themselves while two students are getting into a physical altercation?"}, {"date": "7 Feb 2012", "title": "Behavioral Health Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Youth Villages (Memphis, TN) in Oct 2010", "Interview Descriptions": "Initial communications were positive, and response time was quick for all questions. Initially started with a phone pre-screen- included job overview, responsibilities, etc. Then moved on to second interview-face to face, with role playing scenarios involved. Once this was complete- asked to shadow current employees in day to day activities. Afterwards, offered the job, pending drug test.\r\n\r\nQuick, simple, and easy.", "Interview Questions": "How would you handle a specific situation where a child attacks you physically"}, {"date": "14 Aug 2014", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Youth Villages (Memphis, TN) in Aug 2010", "Interview Descriptions": "It was a pretty good process.  They made sure new staff had the chance to observe the youth and the setting that they could potentially be working in.   The orientation was fun.  It takes a while for your background check to come back and you have to get fingerprinted and take a physical.", "Interview Questions": "They asked me if I were to do a presentation on problem sexual behaviors; what would I do?"}, {"date": "22 Feb 2013", "title": "Family Intervention Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Youth Villages in Aug 2009", "Interview Descriptions": "YV has a long hireing process. In my case it took near a month form the first interview. The office manager was mostly unreachable after 25 to 30 calls per week trying too get a person to update you on the process. The interview was mostly relevant to the position and consisted of 'what would you do in this situation' type questions. Safety is overemphasised and engagment and alignment is everything (even when it is not).", "Interview Questions": "They read cases too you and ask you to verbally analyze and develop a treatment plan. They want to know your thiking behind the treatment plan, SAFETY above and beyond and ranking of what you should do first ad so on. "}, {"date": "21 Sept 2013", "title": "Teacher Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Youth Villages (Arlington, MA) in Jul 2009", "Interview Descriptions": "Short group interview followed by simple personal interview. If you get the interview you'll het the job", "Interview Questions": "N/A"}, {"date": "27 Sept 2013", "title": "Family Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Youth Villages (Johnson City, TN) in Feb 2009", "Interview Descriptions": "1st interview ended up being a group interview. No questions were asked, it was more for telling about the company. A second face to face interview was pretty basic, mostly reviewing resume and experience.  No unexpected questions. The only thing I didn't like was that I did no interview with the person who would be my direct supervisor and I actually only got to meet her once for about 30 seconds during the interview process.", "Interview Questions": "Would you be ok working under a supervisor who had less experience and less education than you?"}]]