[[{"date": "2 Aug 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mosaic Life Care", "Interview Descriptions": "Very welcoming and friendly.  Made sure to fully explain the role and allowed me to ask any questions I had. Made me feel that they were on my side and rooting for me.", "Interview Questions": "Describe an emergency situation you were involved in. "}, {"date": "3 Jan 2020", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mosaic Life Care (Saint Joseph, MO) in Jan 2020", "Interview Descriptions": "I applied online and got a phone call to set up a 1 on 1 face interview. The interview process is short and sweet. The clinic manager interviewed me and she is a very nice lady.", "Interview Questions": "Tell me about yourself."}, {"date": "3 Jun 2021", "title": "Histology Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mosaic Life Care in Apr 2019", "Interview Descriptions": "Begin with an online application, then an organization questionnaire, if applicable and moving on through the interview process , then an interview with lab supervisor (approx 30 minutes) and then interview and shadow of the  Histology lead.", "Interview Questions": "Do you have any lab experience before applying?\nWhat is your highest level of education?\n"}, {"date": "7 Apr 2018", "title": "Life Guide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mosaic Life Care (Kansas City, MO) in Apr 2018", "Interview Descriptions": "It was very casual and quick. We met in the lobby and it only lasted about 20 minutes. They were looking for someone very friendly and positive to make people feel welcome.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Oct 2018", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mosaic Life Care (Albany, MO) in Mar 2017", "Interview Descriptions": "You usually interview with more than one person conducting the interview, it is also not uncommon for them to interview multiple applicants in one setting. You are typically interviewed by your immediate supervisor, their supervisor, and an HR or assistant person.", "Interview Questions": "How many times in the last year have you called in to your current job?"}, {"date": "28 Dec 2018", "title": "Gi Technician Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Mosaic Life Care (Saint Joseph, MO) in Feb 2016", "Interview Descriptions": "Peer/manager interviews with as many of the staff that can participate. Describe job duties and what is expected of you. Talk about your qualifications and goals. Ask about your availability.", "Interview Questions": "Why did you choose a career in health care"}, {"date": "29 Jul 2016", "title": "Site Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Mosaic Life Care (Kansas City, MO) in Jun 2014", "Interview Descriptions": "Long and unofficial. I did not feel that the interviewer had prior experience in this position. She would answer the phone and did not seem engaged in the interview process.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "20 Jan 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mosaic Life Care (Saint Joseph, MO) in Feb 2014", "Interview Descriptions": "It was very intense and thorough.  It started with 2 phone interviews. Then there were 2 personality and skills tests.   Then there  were 2 more phone interviews, followed by a full day of interviewing with about 25 people in different panels and individually.  I was interviewed by frontline staff up to C suite and physicians.  It was a very organized interview process.  I was guided through each step of the process with the talent agent.", "Interview Questions": "They really focused on jobfit. There were a lot of behavior questions. "}, {"date": "21 Jul 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mosaic Life Care (Kansas City, MO) in Jan 2013", "Interview Descriptions": "Interview with the district manager, then the office manager. Then do 1-2 days of on site job shadowing before being offered a position and then doing background check etc. You take a little bit to get acclimated to the other workers within the office. There isn't much direction when you go in for your job shadowing on how to long expect to be there or what to do.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "29 Jul 2015", "title": "Life Guide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Mosaic Life Care (Parkville, MO) in Jan 2013", "Interview Descriptions": "It took 3 months for a call. I interviewed with the Site Manager, one on one. I was called back for a second interview. This was with HR, the Site Manager, and various other Admin. We did a \"speed dating\" type of interview where each person has 3-5 minutes to ask questions followed by a tinker-toy activity. I was then called back for a third interview with the Site Manager and 3 of the Providers. The second and third interviews were done with multiple other applicants.", "Interview Questions": "Name a time when you were faced with a difficult problem, how did you deal with or resolve it?"}], [{"date": "5 Sept 2015", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Mosaic Life Care (Saint Joseph, MO) in Nov 2011", "Interview Descriptions": "A friend who worked for the company told me they were hiring so I contacted the companies physician recruiter.  He responded within a few days and I was offered an interview. I met with the recruiter and later that week received a letter of intent to hire.  Pretty smooth process.", "Interview Questions": "No typical interview questions.  "}]]