[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Excellent work culture and autonomy", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jan 2022", "job_title": "Project Manager in Toronto, ON", "duration": "N/A", "pros": "Excellent work culture and respect for autonomy.", "cons": "Low pay\r\nOkayish benefits\r\nNot much career growth/mentorship support from management"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "It's still a toxic work environment Save the Children Canada", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "19 May 2017", "job_title": " in Toronto, ON", "duration": "N/A", "pros": "Very little pros, the pension was a nice benefit. Met some great colleagues and professionals there.", "cons": "Depends on if your manager likes you how you are treated, NO leadership or care for employees, there are too many people at the top that are making bad or no decision at all and are extremely secretive and just awkward. There is no transparency at all and collaboration between departments is nonexistent and in fact often seen as a punishable offence by management. It was overall an uncomfortable place to work that made it difficult to transition to a normal work environment. If you want to work somewhere that genuinely values their employees, please seek elsewhere. There is more care given to the amount of hours you are in your office chair than to how much you can get done. There is no chance of advancement here if you start at entry level/mid level."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Save the Children Canada - Toxic Office Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Apr 2014", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "The organization itself is wonderful. The Canadian offices are confused and have a horrendous culture.", "cons": "The office culture at Save Canada is terrible. The leadership is passive or inexperienced in proper management. Employees strongly dislike one another - The development team and the program team have extreme animosity. \r\n\r\nThere's little understanding in the senior leadership team of how to grow within the Canadian market from a multitude of perspectives. The same topics are circle talked with lack of direction and/or progression."}], [], [], [], []]