[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good organization that’s going through a time of transition", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Mar 2023", "job_title": "Associate Director in Crystal City, VA", "duration": "N/A", "pros": "Switched CEOs in 2022, and that combined with the difficult years of the pandemic before that has led to some internal turmoil and turnover. But it’s a good org overall. Just needs to settle back down. A lot of the employees who have been around for a long time don’t love the new CEO. He is very different from the previous CEO, but he’s not necessarily a bad leader or even person. He just might not be everyone’s cup of tea. Who your manager is will contribute a lot to your experience. Work-life balance tends to be pretty good in most departments with pressures to work nonstop mostly being a mentality some old school individuals have but not necessarily something they expect from everyone else. Excellent benefits and PTO allotment. Generous parking or public transit arrangements offered for those who commute to the office. Very flexible hybrid work environment with a newer policy that allows managers to determine how often their direct reports need to work from the office. If you get a good manager, you can typically work from home as often as makes sense for you and your work responsibilities. No going into the office simply to check a box. Professional development funding is also available and makes it a good place to grow your career even if your specific position doesn’t have a ton of upward mobility. There have been efforts to implement in person all staff gatherings a few times a year, which has been good for getting to know other staff better and fostering open forum discussions with management. Needs more structure, but they have the right idea. With every company there will be some people who are simply not pleasant to work with, and AACP definitely has some of those. But overall, it’s a good place to work that has a lot of great employees and very nice members who really believe in their heartfelt mission to support and improve pharmacy education across the US.", "cons": "It’s a small organization—only about 35 employees— which can be both good and bad. If you have never worked at such a small org, there might be some culture shock for you. It’s very different than working at a large company. CEO can sometimes react from a place of heightened emotions. He will generally listen to reason once his emotions have calmed a bit though."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Terrible CEO", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Jun 2023", "job_title": "Director in Crystal City, VA", "duration": "N/A", "pros": "Most of the people who work at AACP are wonderful, smart, and driven individuals. There is good work/life balance and the overall benefits package is good. Full time telework or optional hybrid options were greatly appreciated.", "cons": "Terrible new CEO who is instituting a negative culture among staff. He has only been there one year and already the negative changes are apparent. Many staff have left because of the new CEO and many more will follow. Wait for the next CEO and hope they are a better person than this one before you go work here!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Dec 2022", "job_title": "Director in Arlington, VA", "duration": "N/A", "pros": "Many staff who have been there a long time and collegial and very much about taking care of the members", "cons": "Some processes need to be updated but not drastically just some movement to the 21st century needed. Staff should be able to get a sizeable salary increase without being promoted"}], []]