[[{"date": "18 Apr 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Children's Minnesota (Saint Paul, MN)", "Interview Descriptions": "I met with supervisors in person for panel interview and then received an offer via email and through my university. Everyone was very friendly and open to answering questions honestly.", "Interview Questions": "Why are you interested in working in a hospital setting?"}, {"date": "3 Feb 2023", "title": "Data Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Minnesota", "Interview Descriptions": "I was contacted for an interview about a week after submitting application. The interview was a one hour Teams interview with hiring manager and two team members. It was very casual", "Interview Questions": "They asked how I would rank my SQL level of experince"}, {"date": "23 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Minnesota (Minneapolis, MN) in Dec 2022", "Interview Descriptions": "The interview process was 3 steps. First, I had an initial phone call with a recruiter discussing the job, and what they’re looking for in a candidate. The next step was an interview with the hiring manager, and 2 other employees. This was an in-depth panel interview where I was asked several questions about my experiences/how I would handle certain situations. Lastly, I had an interview with the Department Director, which was very informal and more of a “person to person conversation” about the company, and the role they’re filling. HR was very responsive and did a great job keeping me updated throughout the process.", "Interview Questions": "Tell us about a time when you made a mistake. How did you handle that?"}, {"date": "22 Aug 2022", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Minnesota", "Interview Descriptions": "Process was smooth and informative. I got a chance to meet many of the people I would work with, see the facilities I would be working in, and they moved quickly with making an offer.", "Interview Questions": "In depth review of projects I've worked on "}, {"date": "13 Oct 2022", "title": "Registered Nurse Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Minnesota (Minneapolis, MN) in Aug 2022", "Interview Descriptions": "Was asked a bunch of behavioral/scenario questions that I have noticed in previous reviews. And to be honest some these recruiters are not qualified to screen out candidates! It felt more of like answer these questions and this is what to expect in this position. To be honest it felt like I was just another person on a list the recruiter had to go through before the end of the week during the whole process. And to add salt to the wound. When asked when I should here a response back they told me they have a list of other people they have to still interview this week and I should expect a response with in a week. So it kind of felt like a hint right there I didn’t get it.", "Interview Questions": "Tell me about a time you had a difficult situation with a co worker or patient? How do you define diversity and what does it mean to you?"}, {"date": "28 Mar 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Minnesota", "Interview Descriptions": "The interview process was smooth and the hiring managers were responsive. The entire process from start to finish gave me a good look into what would be expected of me day to day.", "Interview Questions": "Tell me about your background"}, {"date": "28 Feb 2022", "title": "Certified Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Minnesota (Minneapolis, MN) in Feb 2022", "Interview Descriptions": "This was the initial phone interview. A few days after sending in my application I was sent an email to set up a date and time for the phone interview. we discussed hours, the onboarding process, the location, pay, company values, and any other questions I had.", "Interview Questions": "They asked how I've dealt with conflict in the past as well as a few questions about why diversity is important."}, {"date": "23 Oct 2021", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Minnesota", "Interview Descriptions": "There were 2 rounds, 30-mins phone screen and one video interview with two supervisor. Most of them are behavioral questions. They are very nice. But the process is so long it takes a month.", "Interview Questions": "Strength and weakness\r\nDefine inclusiveness and dependable"}, {"date": "8 Jul 2021", "title": "Senior Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's Minnesota (Edina, MN)", "Interview Descriptions": "The recruiter reached out with a list of 20+ interview questions and told me that in order to be considered for a phone screen—not an interview, a phone screen—I needed to fill out the attached and return it within 48 hours. \r\n\r\nFor the record, there were less than 5 yes/no questions on my experience using specific databases. Most were “describe a time” behavioral questions that take a full page to answer. What’s left to ask in an interview? \r\n\r\nLook, I’m not the recruiter, it’s not my job to write an essay in lieu of you having a conversation with me. I asked for an extension, provided my answers and never heard from her again. A massive waste of my time, and frankly if  it’s standard practice to disrespect someone’s time like that, it’s not a good look for their culture.", "Interview Questions": "Tell me about your work experience, focusing on the aspects of this job that have helped prepare you for this opportunity."}, {"date": "7 Apr 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota", "Interview Descriptions": "I completed a phone interview with HR/ recruiter Penne B, which overall I felt went well, and was told at the end of the interview that I would receive a call back about arranging a second interview with the unit manager. I never received a call, and after waiting several weeks, reached out via email to the general HR and the specific recruiter I talked to but never received a reply.", "Interview Questions": "Give an example of a time when you promoted a diverse/ inclusive environment"}], [{"date": "7 Apr 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota", "Interview Descriptions": "Applied on a weekend, received a phone interview request that Monday and had phone interview on Thursday. The interviewer was nice and I believe it went well but I still haven't heard back from them after that and it's been about 3 weeks for me. I have a friend who interviewed with Children's for another position and its been a bit over a month and they haven't heard back yet post initial interview.", "Interview Questions": "Why do you want to work here? \r\n\r\nHow important is equity and diversity to you? "}, {"date": "6 Jun 2021", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Minneapolis, MN) in Mar 2021", "Interview Descriptions": "The first interview was with a vice president, and it was mostly informal, focused on the candidate learning more about the position. The second and third rounds would be with the hiring committee and another department leader respectively.", "Interview Questions": "Q: Are you comfortable managing leadership's calendars and setting up meetings with donors?"}, {"date": "10 Jul 2022", "title": "Information Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Minnesota (Minneapolis, MN) in Feb 2021", "Interview Descriptions": "Pretty laid back, chill interview process.  Mostly discussions regarding background, experience, standard interview procedure kind of stuff.\r\nStarted off with some behavioral questions pertaining to personality, work ethic, collaboration, etc.  Last half of interview was more technical asking questions regarding specific SIEM tools used, security procedures, incident response framework.  Also some situational questions as well.", "Interview Questions": "tell me about your background in cyber security"}, {"date": "26 Feb 2021", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Edina, MN) in Jan 2021", "Interview Descriptions": "Hr was non responsive. They do not communicate well with the hiring managers. They are not qualified to screen out candidates and it results in good candidates being left out.", "Interview Questions": "They will always ask about challenging situations. "}, {"date": "19 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Minnesota (Saint Paul, MN) in Dec 2020", "Interview Descriptions": "Was contacted by HR to set up an interview. Had about an hour long interview with the patient care supervisor and two nurse educators on the unit. Consisted of mostly behavioral based questions and everyone was friendly and professional.", "Interview Questions": "Name a time you went above and beyond for a patient"}, {"date": "28 Sept 2019", "title": "Unit Operations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Minneapolis, MN) in Aug 2019", "Interview Descriptions": "Was called for an interview for a .8 position located at one location. Interviewed and was not offered that position but HR contacted me via email and stated that the team thought I interviewed very well and recommended me for other positions. HR asked if I would consider a different location, same position. I said yes and interviewed a week later at that location. I was given a tour at that time of the unit. I sent out a thank you email with a couple of questions to show interest and never heard anything back from them. No thank you but no thank you email, nothing. It was very unprofessional. They also did NOT reimburse me for parking in their ramps for either interview which all other hospitals have done in the past.", "Interview Questions": "Explain a time when you needed to complete tasks under high-stress situations and how did you handle it. "}, {"date": "20 Mar 2019", "title": "Clinical Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Minnesota (New York, NY)", "Interview Descriptions": "Phone interview 30 min. Moved to hiring manager interview 45 min. Moved to final panels, 4 in total (docs, staff, other managers, execs) about 45-1 hour each. Situational and behavioral questions. Outcome - Offered to other candidate.", "Interview Questions": "Tell us about a time you had to manage someone out."}, {"date": "14 May 2019", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Minnesota (Edina, MN) in Feb 2019", "Interview Descriptions": "I applied in December, forgot about it, was contacted around the end of January for a phone interview.  A recruiter called to schedule the call for the following week. It was fairly long (about 45 minutes) and consisted of very broad theoretical questions about my experience with communications. Not particularly difficult; just very long and exhaustive. The following week I was contacted by a completely different HR person to schedule an in-person interview. By this time, it was mid February.\r\n\r\nI was scheduled to interview with four different people--an HR person (different from the recruiter and person who scheduled me), a communications manager, a marketing manager, and PR manager. The first interview was with the HR person for about 30 minutes. It was pretty generic--asked about my experience, what I think about diversity. The next was with the communications manager. She asked the same questions and a few extra job-specific questions. This lasted about 50 minutes--she continued asking more specific questions, as the PR and marketing managers were running late. One of them finally showed up and started the next process. She asked me the same questions as before. Then the other showed up and had me start all over again. After the interview concluded, they walked me out, said I'd hear back. The whole thing was very redundant.\r\n\r\nAfter asking each person various questions, I learned that the company went through a major re-org over the past year in which a lot of new people were brought in (and it was implied, though not directly stated, that others were pushed out as a result.) This position was being refilled only a few months after the position had been created as part of this. I didn't get a great feeling about it.\r\n\r\nWell, now it's mid-May. I never heard back from anyone.\r\n\r\nAfter going through these interviews that never actually built on one another or gave me a better idea of how the role interacted with the company AND taking the time to drive all the way out to their Edina campus, I would have expected at least a quick canned email rejection or update on the job status. That was never received. I accepted another position shortly after the interview, so I wasn't that broken up about it, but I was really struck by the lack of respect that Children's Minnesota seems to have for potential candidates. Do they care that little to just ghost people on jobs they've taken the time to interview for with multiple people, or are they just so disorganized that they forgot to reject someone for a job?", "Interview Questions": "What does diversity mean to you?"}, {"date": "28 Dec 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 2+ months. I interviewed at Children's Minnesota", "Interview Descriptions": "It was a long and disjointed process involving a phone interview and 3 separate interviews over a couple of months, which didn’t seem to adequately build on each other. There was poor communication during the process, given the time invested, and other red flags along the way.", "Interview Questions": "Typical questions - walk me through your background, management style, a couple of behavioral questions."}], [{"date": "19 Feb 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Minnesota in Jan 2018", "Interview Descriptions": "Was contacted 2.5 weeks post application\r\nRecruiter only gave an e-mail for contact\r\nThere was no follow-up even though the recruiter said she would follow-up with me after she spoke to the manager. \r\nI contacted them 1.5 weeks after the first interview (because I didn’t hear back as promised), the recruiter acted annoyed and I was treated with disrespect. This is my first impression of the quality of culture at this location", "Interview Questions": "Tell us in depth more about your experience & how it relates to the role. "}, {"date": "22 Mar 2017", "title": "Security Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Minnesota (Minneapolis, MN)", "Interview Descriptions": "One phone screen with Human Resources person, One in person interview with three members of security leadership.  Pretty basic overall, nothing which I was not prepared for.", "Interview Questions": "Tell us about yourself.  What are your future career goals.  What can you bring to our organization."}, {"date": "13 Nov 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Minnesota (Saint Paul, MN) in Jan 2017", "Interview Descriptions": "About an hour long, questions pertaining to the job specifically like, \"tell me a time when...\" and, \"how would you handle this situation.\"  The lab supervisor is a superb woman", "Interview Questions": "N/A"}, {"date": "20 Jul 2017", "title": "Clinic RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Minneapolis, MN) in Jan 2017", "Interview Descriptions": "Interviewed with Clinic Manager first and went well. Then a panel interview with 4 members of the clinic staff (providers and nurses).  Approximately 1 1/2 to 2 hours. Low stress interview environment.", "Interview Questions": "What was a difficult situation that you navigated through"}, {"date": "28 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Children's Minnesota (Minneapolis, MN) in Oct 2016", "Interview Descriptions": "I completed 1 phone interview and 1 in person interview. I was not contacted till about 30 days after online application submitted, then about 2 weeks later had an in person interview. The process may have been slightly slowed in that I was being considered for multiple positions with multiple managers.", "Interview Questions": "Behavioral based questions about situations I had encountered, questions about past experience and details about past positions. Also included a medication/dosages calculation exam."}, {"date": "3 Sept 2016", "title": "CSA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Minnesota in Aug 2016", "Interview Descriptions": "Phone interview then in person interview. Lots of questions about my previous experience, and possible scenarios with children. Told to wait a few days for call back, waited almost a month and received an email.", "Interview Questions": "What would you do if the nurse tells you to grab vital signs on a newly transferred child to your unit?"}, {"date": "5 Apr 2016", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Minnesota (Minneapolis, MN) in Mar 2016", "Interview Descriptions": "I was contacted by HR two months after applying for the position and she asked me a few phone interview questions right away and was set up with an interview two days later. HR sent me an \"itinerary\" for the interview with the name of just the hiring manager and I walked into six pairs of eyes on me. Was given a decision a week and a half later. I did not get the position due to lack of experience.", "Interview Questions": "Q: What are your strengths and weaknesses?"}, {"date": "21 Oct 2015", "title": "Star Studio Production Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Children's Minnesota (Minneapolis, MN)", "Interview Descriptions": "phone screening then in person interview with 3 people. everyone was really nice. the interview lasted an hour and went really well. the staff made me feel like i would get an offer then didn't contact me. I contacted them after 2 weeks and received the we went with someone else but we really liked you email reply. very frustrating.", "Interview Questions": "if you dont get this job where will you be in 5 years"}, {"date": "12 Aug 2015", "title": "Patient Safety Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Minnesota (Minneapolis, MN)", "Interview Descriptions": "The interview process was Very quick and they were accommodating with scheduling. I met with a Great team. Regret not taking the offer. Very competitive salary and benefits. The organization is all about doing the right thing.", "Interview Questions": "Why are you the best candidate for this position?"}, {"date": "22 Mar 2016", "title": "Director of Rehab Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Children's Minnesota in Aug 2015", "Interview Descriptions": "I received a phone interview about two weeks after applying online. The interview I felt went very well and was easy with the basic interview questions. I waited over 6 months before getting a final answer that they chose a different candidate. In the process I checked in every 2-4 weeks to see what progress was being made for hiring for the position. I kept being told they were continuing to look but liked my resume.", "Interview Questions": "How would your most recent boss describe you?"}], [{"date": "26 Feb 2016", "title": "CSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's Minnesota (Minneapolis, MN) in Jun 2015", "Interview Descriptions": "Phone interview to set up an in person interview. The in person interview was with the heads of the department I applied for, they asked a bunch of questions and the interview lasted about 45-60 mins. After the interview, you will get a call offering you the job if you accept HR calls you with details on the next steps.", "Interview Questions": "Why are you the perfect person for this job?"}, {"date": "10 Jun 2016", "title": "Surgery Scheduler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Minnesota (Saint Paul, MN) in May 2015", "Interview Descriptions": "I had a phone interview with HR, then a face to face with the asst manager and after that  I was called back to meet with the clinic manager and the Medical Director/Surgeon of the clinic.", "Interview Questions": "Basic general interview questions."}, {"date": "16 May 2015", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Minneapolis, MN) in Mar 2015", "Interview Descriptions": "Very inclusive and warm environment. The experience was informative and truly engaging. The staffing team prepared me for the process and kept me informed through out  the process. I enjoyed meeting the team and the tour of the hospital. Overall great experience.", "Interview Questions": "How do you stay current with your field?"}, {"date": "26 May 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "Friendly management. If you have the experience and the personality to work in this type of hospital environment, you will do well in the interview process. They only want the best, so someone with a shady background would not be considered for this highly saught after position", "Interview Questions": "Do you feel you could handle working in this environment and why? (an ICU)"}, {"date": "27 Feb 2017", "title": "Clinical Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Minnesota (Saint Paul, MN) in Apr 2014", "Interview Descriptions": "I received a call from an HR recruiter and was asked to come in to interview with the department manager. After meeting with the manager, I was asked to come back and interview with the department directors.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "19 Jul 2016", "title": "Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Children's Minnesota (Saint Paul, MN) in Jan 2013", "Interview Descriptions": "Everyone at Children's was very friendly and professional. The interview experience was great!\r\n\r\n1st interview was a phone call - \"tell me about a time question\" were the main questions asked. \r\n2nd interview was In person it lasted about an hour. Questions were very focused on your ability to multi-task and work under pressure in a high paced customer service environment.", "Interview Questions": "Name a time you had to multi task at your previous job? How did you handle it"}, {"date": "4 Sept 2011", "title": "Unit Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Minnesota (Saint Paul, MN) in Aug 2011", "Interview Descriptions": "I applied for several similar positions, and was contacted by multiple recruiters/HR by phone. Each one did a quick phone interview with me. I was then called by the manager of each department for a phone interview, and then we scheduled an in-person interview. There seem to be multiple layers of bureaucracy involved in hiring, but the department managers/supervisors do make the final call in hiring, and seem to value both competence/experience and a certain folksy charm/personality. High value placed on people skills/ customer service. \r\n\r\nAt each level of interviewing, I was surprised by how easy/open-ended the questions were. Very much the typical practice questions given by any interview prep website or course. There was lots of opportunity to put my best foot forward and steer the conversation to my strengths.", "Interview Questions": "Describe a time when when someone disagreed with you- either a supervisor, co-worker, or client. How did you handle it? What was the outcome?"}, {"date": "1 Sept 2011", "title": "Middle Mngt Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Children's Minnesota (Minneapolis, MN) in Jun 2011", "Interview Descriptions": "not very organized, no clear strategy on questions", "Interview Questions": "why do you want to work here? (big focus on seeing how hooked you are on the mission)"}, {"date": "29 Apr 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Minnesota (Minneapolis, MN) in Apr 2011", "Interview Descriptions": "Started with a phone call to arrange a phone screen. Phone screen conducted, followed by in person interview with multiple team members; it was a me versus \"they\" interview (panel).", "Interview Questions": "What brought me to Children's?"}]]