[[{"date": "5 Apr 2023", "title": "Corporate Partnerships Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Genesys Works (Washington, DC)", "Interview Descriptions": "The interview process was very long and drawn out. I had 4 rounds which included meeting various members of the team. After meeting with everyone, I was also asked to complete a long skills assessment.", "Interview Questions": "What excites you about this role?"}, {"date": "5 Oct 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Genesys Works (Chicago, IL) in Sept 2022", "Interview Descriptions": "I first had a phone interview with the head of the department. She was very friendly and immediately invited me to a second interview. I didn't live in the area that I applied to, so they were nice enough to interview me via zoom rather than in person. The second interview was with two employees who were not in the programs department. They were about 15 minutes late, claiming that they didn't realize that they were using zoom. This didn't bother me at first, but after reflection, it was a bad sign. The interview was standard with general experience questions and \"tell me about a time...\" questions. The interviewers were professional but didn't seem interested in connecting with me. I specifically asked about the next steps and was told that I would hear back- whether yes or no- the next week. I never heard back, so I reached out the following week. I still haven't heard back. I am shocked that after being explicitly told I would hear back no matter what that they couldn't send me a canned email saying that they wouldn't be moving forward with me. I have been ghosted before with applications, but never after two interviews! For an organization that teaches young adults professional skills, what does it say about them that they can't practice what they preach?", "Interview Questions": "What is the biggest barrier to success for students?"}, {"date": "8 Oct 2020", "title": "Young Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Genesys Works", "Interview Descriptions": "It was fun, but it was strict. They had you go through 3 rounds. After you are selected they ask you to choose what program you want to be apart of. And you train for the entire summer.", "Interview Questions": "Why do you want to be apart of Genesys "}, {"date": "3 Jul 2020", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Genesys Works", "Interview Descriptions": "Online application, in-person interview with proposal, reference check. Got an email a few days before the interview asking to prepare materials. They called my references but I didn't end up getting the job.", "Interview Questions": "How do you engage in recruiting a diverse group of students"}, {"date": "18 Feb 2022", "title": "Young Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Genesys Works (New York, NY) in Jul 2019", "Interview Descriptions": "This interview lasted about 30 minutes. Mike Gross interviewed me and had questions more so focused on my knowledge in IT and professional skills, challenge questions to see how my working posture and dedication to my role.  Overall come prepared to know the company and why you would make a difference.", "Interview Questions": "- How would Genesys Works benefit you?\r\n- Name a time you had to choose between two things?"}, {"date": "6 Feb 2020", "title": "Summer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Genesys Works (Saint Paul, MN) in Jun 2019", "Interview Descriptions": "The interview process was a traditional sit-down interview, with two staff. Be sure to dress to impress, which will most likely up your chance of getting the internship. Be sure to come up with a few examples of any skills you've gained or professional complications you've had in life to talk about during the interview. Good luck!", "Interview Questions": "Don't remember it word by word but within the lines of...What are you communication/organization style?"}, {"date": "15 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Genesys Works", "Interview Descriptions": "The interview process was three parts. First was a brief phone interview, then a second more comprehensive phone interview. Lastly was an in person interview at their office that lasted about forty five minutes to an hour.", "Interview Questions": "What is your experience working for a non-profits?"}, {"date": "10 Apr 2018", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Genesys Works (San Francisco, CA) in Feb 2018", "Interview Descriptions": "A consultant hired to facilitate the interview process asked me a series of questions, both professional and personal, relating to the industry and the role I was interviewing for. It was a conversational interview.", "Interview Questions": "Tell me about a time you worked closely with someone on a project/program and what you learned?"}, {"date": "5 Jun 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Genesys Works in Apr 2015", "Interview Descriptions": "Genesys Works has a multi-step interview process, with the first interview lasting 15-20 minutes and the second interview lasting an hour. My invitation to the initial interview didn't mention that there was a second interview, so I was shocked that no questions about my previous work experience were covered in the brief first interview.\r\n\r\nThe first interview requires the applicant to present a 5 minute presentation on \"How to succeed in College\" as if they were speaking to a group of high school seniors. The presentation is followed by pulling a word from Genesys Works' mission out of a hat and quickly describing it's importance. Then a beach ball with questions like \"What's your favorite restaurant\" is thrown to you. \r\n\r\nThe second interview is in a conference room with 4-5 interviewers asking you questions about your previous work experience. The hour long interview was intimidating because it felt too long and repetitive. Even though my earlier responses discussed certain experiences/projects I had, later questions would ask me to describe such an experience.", "Interview Questions": "Why do you feel you are an ideal candidate for the Program Coordinator position?"}], [{"date": "16 Nov 2016", "title": "Bus Dev Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Genesys Works (Oakland, CA) in Nov 2014", "Interview Descriptions": "Several months and ED makes the final decision.   You need to be committed to wanting to make in impact in youth development as the work is long and the pay average.", "Interview Questions": "What are you passionate about?"}, {"date": "8 Oct 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Genesys Works", "Interview Descriptions": "The interview process was multiple parts starting with a 15 minute training session that you create beforehand. You present to staff as if they are students and have a Q&A session. After the training, there were impromptu questions that you have to answer on the spot. Some are serious, some are crazy. It is a very short first round. It gives you a feel of the culture of the organization. Next, there was a traditional interview in panel format.", "Interview Questions": "What is the difference between a mentor and a friend?"}, {"date": "30 Jul 2014", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Genesys Works", "Interview Descriptions": "I corresponded with the national hiring manager through e-mail who reviewed my resumé and then set up an interview. The interview process itself was laid back and flowed like a conversation with the usual questions: \"Why do you want to work for Genesys Works?\" and \"What skills would you contribute?\" Since this was my first professional interview, I stumbled a few times, but the hiring manager was helpful in getting the conversation back on track.", "Interview Questions": "I can't recall any particularly difficult question--just be prepared to think on your feet!"}, {"date": "25 Oct 2015", "title": "IT Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Genesys Works (Houston, TX) in Jun 2014", "Interview Descriptions": "I was asked to give a presentation on IP addresses. HR manager and another IT trainer watched me teaching for about 20 minutes and ask questions like a student would do.", "Interview Questions": "Nothing technical, they just watched me teaching IP addresses for about 20 minutes."}, {"date": "12 Apr 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Genesys Works (Houston, TX) in May 2014", "Interview Descriptions": "Simple and straightforward, as long as you make your eye contact and do not completely break down during the interview, you should be fine. The interviewers were friendly and did not try to intimidate you, they are well aware you are a mere high school student trying to better their future.", "Interview Questions": "Where will Genesys Works take you in your future, whether it is with regards to your future and academics?"}, {"date": "3 Mar 2014", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Genesys Works (Houston, TX) in Jan 2014", "Interview Descriptions": "Was very surprised I had been selected to interview. I had difficulty submitting my online application and never received a confirmation that it went through. I took that as a sign so I did not try to apply again the next day from another computer. Fast forward a month later and I was asked to come downtown to their headquarters and meet a few of the team members for an interview. The interview went really well and I felt positive that I would make it to the next step in the hiring process. \r\n\r\nI was notified they decided to move ONLY internal candidates along in the hiring process. The hiring manager sent me a very gracious email complementing my work ethic and experience. Her kind words were very nice especially in this day and age were you're sent generic \"No, Thanks\" emails from the HR Dept.", "Interview Questions": "I was asked to share an experience when I did not agree with my supervisor on a decision that he/she had made. "}, {"date": "30 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Genesys Works (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "The interview was a typical interview. The questions were mostly about how you handle stress and what experience you have. I did well with the interview. The interviewers are great and easy to talk to and try to make the process more engaging. This was a fairly easy interview.", "Interview Questions": "What experience do you have with technology?"}]]