[[{"date": "22 May 2023", "title": "Friendship Line Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Institute on Aging (San Francisco, CA) in Apr 2022", "Interview Descriptions": "Had a 15 minute intake, asked about my experience working in call centers, my experience in speaking other languages, experience with mental health or with geriatric population. Any other language spoken than english is a plus, they are always looking for native spanish speakers. Once you get past intake interview, there is a spanish interview also", "Interview Questions": "Why do you want to work with elderly people?"}, {"date": "10 Feb 2022", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Institute on Aging", "Interview Descriptions": "Managers have declined to interview or have not hired candidates who have: thick accents, difficult names to pronounce or don’t speak the language they prefer. Some managers will not offer the stipends that IOA offers employees to their new hires (like language premium, work from home stipend, mileage, relocation, sign-on bonus etc.). Most jobs on their site are open just so they can show proof that they had candidates apply – but some of these jobs already have an internal referral of who they will hire. Managers have no training on interviews, so your interview is guaranteed to be different depending on who you speak to.", "Interview Questions": "All low-level basic interview questions. "}, {"date": "14 Dec 2021", "title": "BI Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Institute on Aging (San Francisco, CA) in Nov 2021", "Interview Descriptions": "Applied online and had an HR person call me to schedule up a screening call. She asked for code samples and Tableau dashboard sample.\r\n\r\nAfter that I had an 1:1 with the hiring manager who talked about the company and what they're trying to do in the BI department. It wasn't a very technical interview, it was most about my background and what I can do.\r\n\r\nHR was pleasant and always prompt with replies when I reached out for updates.", "Interview Questions": "On a scale of 1-10 how would you rate your Tableau skill?\r\nHow do you prioritize work?\r\n"}, {"date": "20 Jul 2021", "title": "Friendship Line Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Institute on Aging (San Francisco, CA) in Feb 2021", "Interview Descriptions": "Interviewer was very approachable and the process was more like a friendly chat than an actual interview. They answer any questions about the company and give helpful and precise information.", "Interview Questions": "Q: Why do you think you'd be a good fit?"}, {"date": "3 Nov 2021", "title": "Care Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Institute on Aging in Oct 2020", "Interview Descriptions": "The interview process was quick. One thing to consider was bait and switch. The company did not mention the position being temporary when extended the offer. Yet, the position was temporary until whenever. \n\nMost of the interviews were long and thorough. Asked a lot of questions.", "Interview Questions": "Why the IOA?\nWhy should we hire you?\nWhat are your strengths?"}, {"date": "5 Aug 2022", "title": "Donor Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Institute on Aging in Sept 2020", "Interview Descriptions": "Professional; Friendly; Transparent\n\nBoth the recruiter and interviewer were a pleasure to work with. I would strongly recommend this organization to potential applicants. I appreciated that the interviewer entertained my response about not being familiar with the software they use, but was firm in the importance of that experience for this position to not fall behind the department's schedule.", "Interview Questions": "Are you familiar with Raiser's Edge?"}, {"date": "21 Aug 2020", "title": "Shift Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Institute on Aging (San Francisco, CA) in Jun 2020", "Interview Descriptions": "The interview process consisted of a phone screening, an initial video interview with the director and person who held the position at that time, and a subsequent video interview with other staff.", "Interview Questions": "Why do you want to work with IOA?"}, {"date": "28 May 2019", "title": "Quality Improvement and Assurance Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Institute on Aging (San Francisco, CA) in Apr 2019", "Interview Descriptions": "This review is for an initial phone screening. Recruiter said they would call back regardless of decision within a few days, but never called and did not respond to two follow-up emails.", "Interview Questions": "Do you have experience building databases?"}, {"date": "8 Dec 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Institute on Aging (New York, NY) in Sept 2018", "Interview Descriptions": "Phone interview for 15 minutes.  Was told to expect an in person interview and nothing happened.  Why lie? \n\nIt's no wonder turn over is so high.  Be honest with candidates and they won't quit on you.", "Interview Questions": "I asked how they would describe the culture and I was told outright that top tier managers had left but they were trying to rebuild.  When I sent an email asking about my application status, I got no reply.  Very unprofessional.  No wonder turn over is high."}, {"date": "16 Apr 2018", "title": "Rehab Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Institute on Aging (San Francisco, CA) in Mar 2018", "Interview Descriptions": "Phone interview that was relatively simple followed by an in person interview after a screening process. Questions in the phone interview were very simple and easy to answer. I didn’t get the job because I’m not available to start working until July", "Interview Questions": "Why do you want to work at the Institute of Aging"}], [{"date": "12 Jun 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Institute on Aging", "Interview Descriptions": "Started as a brief phone interview.  Then they send an e-mail for a face to face.  Questions are in line with your typical questions.  Nothing out of the ordinary.", "Interview Questions": "Why do you want to work for this company?"}, {"date": "17 Sept 2015", "title": "Home Care Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Institute on Aging in Apr 2015", "Interview Descriptions": "Brief, filled out paperwork, asked clinical questions, asked about experience. Nothing unusual. 1 manager interviewed me. Seemed eager to hire people, but didn't show much interest in the company. Honestly not much to say about the process.", "Interview Questions": "Name a difficult situation and how you handled it"}, {"date": "1 Nov 2013", "title": "Social Worker/Care Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Institute on Aging", "Interview Descriptions": "Interviewed with program director and immediate supervisor. Telephone interview with VP of agency. Typically, VP is available for in-person. Interview lasted 1.5 hours, two people, unstructured. No difficult questions, not many curve ball questions. Did a short vignette. They asked what I knew about the company, asked about my experiences working at previous agencies and some of the challenges I faced.", "Interview Questions": "If I have ever worked with a difficult supervisor, and how I managed or overcame that situation. Now it's clear why they asked... the supervisor here is pretty bad. I should have seen that coming. "}, {"date": "7 May 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Institute on Aging (San Francisco, CA) in Jan 2013", "Interview Descriptions": "Slow, about 1 hour long interview. Takes about a month to get hired or longer. Or as soon as the following week if they are desperate or you have an inside referral.", "Interview Questions": "Tell us about your experience."}]]