[[{"date": "20 May 2023", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "I had an interview on Skype and then was flown in for an in-person interview which lasted for a day. I gave a research presentation and had the opportunity to meet everyone from the lab as well as some faculty members.", "Interview Questions": "What R packages have you used?"}, {"date": "30 Apr 2023", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "It was a easy interview . The questions were mostly about the type of experience with respect to the job description and the resume . The interview and also the recruiting process was very quick .", "Interview Questions": "Why do you think you are a good fit for the job"}, {"date": "3 Mar 2023", "title": "Bookstore Employee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "We spoke over the phone for about 15 minutes. It was very chill and laid back and the questions were easy to answer. After the interview, I received an offer via email.", "Interview Questions": "They listed names and asked me to say the names in alphabetical order."}, {"date": "18 Feb 2023", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 week. I interviewed at University of Colorado Boulder (Denver, CO)", "Interview Descriptions": "Submitted a Hirevue interview as opposed as an in person interview. Was rejected based on a ridiculous system that doesn’t allow interviewees to speak one on one with the hiring team. If a company ever offers Hirevue interviews, run…", "Interview Questions": "What about this job stood out to you?"}, {"date": "16 May 2023", "title": "First Year Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Feb 2023", "Interview Descriptions": "After submitting application materials I did a recorded interview on HireVue. It was five questions that allowed responses of three minutes and one untimed question that had a written response. The written question provided an example of a student email and I had to write a response. They also asked for five references, who were sent a skills review. My second interview (final round) consisted of two rounds over Zoom, the first with other first year advisors, and then the second with the hiring committee. For this interview, they sent me a sample student email in advance and asked me to prepare my response before the interview. Both rounds were about 45 minutes.", "Interview Questions": "What is a challenge relating to diversity, equity, and inclusion that you have dealt with in the workplace? Is there anything on your resume you would like to highlight?"}, {"date": "12 Jan 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Just one round of interviews and I get the response after a week. The interview was easy and only ask a few of your past experience and many behavior questions, such as why you interested in working with us.", "Interview Questions": "Why you want to work for the Advancement Department"}, {"date": "30 Oct 2022", "title": "Public Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "They requested a video of you from a past media interview or a mock simulation of one, in addition to answering written questions and having an over-the-phone interview, prior to offering in-person interviews.", "Interview Questions": "They asked about some potential crisis scenarios including if a student brought pot-laden brownies to class and distributed them without telling anyone. Would I do outreach to the media?"}, {"date": "25 Sept 2022", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Submitted a video Q&A, where I had to answer questions sent to me from HR and record my answers on a timed video. Was a weirdly anxiety inducing experience. Heard no follow up for months until they decided to not hire for the position.", "Interview Questions": "Explain my experience working in the field."}, {"date": "12 Sept 2022", "title": "Assistant Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Colorado Boulder", "Interview Descriptions": "First round virtual interview, ~45 minutes. Second round interview on site, full day of panel and one-on-one interviews, as well as a 20-25 minute presentation. Dinner with members of search committee.", "Interview Questions": "What is the hardest thing you have done professionally?"}, {"date": "24 Aug 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Talk/Presentation to full room of scientists and students along with individual interviews by staff followed by tour of facilities. Tiring long day followed by interview session with faculty at the end of the day.", "Interview Questions": "What is your salary expectation?"}], [{"date": "8 Aug 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Hire Vue first-round interview followed by ~ 2-hour Zoom interview. HireVue contained ~ 7 basic questions and took ~ 30 minutes. Zoom Interview met first with the full team and then with leadership.", "Interview Questions": "1.\tPlease tell us a little bit about yourself and why you are interested in working with college students. \n2.\tDescribe a recent accomplishment of which you were most proud of. \n3.\tPlease speak to your time management and organizational skills: how do you manage prioritizing responsibilities while completing multiple tasks? \n"}, {"date": "5 May 2022", "title": "Training Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "After greetings and introductions, I was given the opportunity to ask any questions I had. I was thrown off as typically a candidate’s questions are requested at the end of the interview with whatever time is left over. The interview panel was made up of three people of varying hierarchal levels. They took turns reading each question aloud to me. None of the questions were trick questions and all were easy to answer. The panel thoroughly expressed how much they appreciated the questions I asked. So if you want to make a good impression, do your research on the hiring body and ask well thought out questions.", "Interview Questions": "Describe a situation when you had an unpopular opinion and acted upon it. \n\nHow do you keep your manager informed as to what you’re working on? \n\nHow would you handle a situation where you’re manager is requesting confidential information that is not there’s to know? "}, {"date": "3 May 2022", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder", "Interview Descriptions": "As if the ‘looking-for-a-job’ process wasn’t already soul-sucking enough, CU Boulder has decided to embrace  the (unfortunate) trend of utilizing HireVue to conduct their first round of interviews. \r\nIf you’ve not had the “pleasure” of experiencing this type of interview, prepare yourself for a fantastic time [/s].", "Interview Questions": "Imagine/create a potential scenario that a prospective student might encounter sometime throughout the application process and write them a letter addressing both their concerns and proposing solutions—be specific to the resources offered by CU Boulder. \r\n…and do all this in 5 minutes. "}, {"date": "24 Sept 2022", "title": "Department HR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at University of Colorado Boulder in May 2022", "Interview Descriptions": "Just ask your questions and this is all. And you could tour the campus and sit there to chit chat with other interview people .And you could tour the campus and sit there to chit chat with other interview people ", "Interview Questions": "Where you graduate scholl from"}, {"date": "10 Mar 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "A screening by HR, final round with manager and two additional peers. Approx 30-60 minutes each round. Everyone was pleasant, questions were reasonable and not difficult to answer. Mostly based off of past experiences and projects.", "Interview Questions": "What type of interactions have you had in the past with students? "}, {"date": "28 Dec 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "You can expect people who will ask a variety of their own questions; there is no standardization, and people interviewing you are not trained to do interviews.  You should expect a very long, non-stop day.", "Interview Questions": "Describe your plans for research over the next 5 years.  Pitch a grant proposal idea.  How do you teach, and how do you make your teaching inclusive?"}, {"date": "3 Dec 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "It went really well, it was a few years ago so not really sure. Communication was good, and the hiring person was really friendly. Not working here anymore but needed a review for Glassdoor.", "Interview Questions": "Tell me about a time... type of questions"}, {"date": "28 Nov 2022", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Dec 2021", "Interview Descriptions": "First was a recorded one-sided video interview. Once you get over that it’s a little awkward it was a great way to interview. I enjoyed this because it’s completely flexible on when you can complete it . I think I had about a week timeframe for the deadline. For some people it ends there but I received a next round interview a few days after and it was a zoom interview with 2 managers. Then they never got back to me after the interview which I thought was rude.", "Interview Questions": "How would you work to create diversity in hiring?"}, {"date": "22 Nov 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "If you pass the online application and preliminary interview with a potential advisor, the interview day consists of three additional interviews with associated professors; some of which are in similar research tracks while the others are not to provide a range of opinions.", "Interview Questions": "What are your research interested and explain how your work up until now contributed to them?"}, {"date": "5 Nov 2021", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Although scheduling the interview went smoothly, I found the office I interviewed with, the Leeds School of Business, very disorganized and surprisingly unprofessional.  People in the office did not seem to get along.", "Interview Questions": "Where do you see yourself in 5 years?\r\nHow do you handle multiple deadlines?"}], [{"date": "28 Sept 2021", "title": "Dlf Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "First, I had to apply to be in Leeds scholars.\nThis consisted of answering basic personal questions, submitting an application, and attending an in person interview.\nThen, I could submit a 5 min video about joining DLF", "Interview Questions": "Why do you want to join DLF?"}, {"date": "2 Sept 2021", "title": "Development Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "It was very easy to apply online and it was great that they listed the salary in the position description in advance so as to not waste time. They also left a lot of time for me to ask them questions to ensure fit.", "Interview Questions": "Typical interview questions about fit."}, {"date": "22 Sept 2021", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2021", "Interview Descriptions": "I interviewed for a SMM position within the Leeds School of Business. I submitted an application on July 28 and received an invite to do a self-recorded interview a couple weeks later. A week after that I got an e-mail asking to set-up FOUR interviews with the entire marketing team and complete them the following week. I did all the interviews and after the last, I was told it would be about a week before their decision as they were down to 2 finalists - myself and another. \n\nI got a call 2 days later where they said they offered the other candidate the position because they had more higher ed experience - this was on a Friday. The following Monday, the job listing was re-posted to LinkedIn, Indeed, and the CU Boulder careers page. \n\nI felt it was rather unprofessional to have me go through this extensive interview process (5 interviews total), not provide any feedback, and then essentially lie to me about the role being filled or that I was one of 2 finalists.", "Interview Questions": "What is your proudest accomplishment?"}, {"date": "3 Aug 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Virtual interview - they asked big questions and you had to answer within 2 minutes. It was stressful. After the virtual interview, I had a Zoom interview with the team and supervisor. I wish I had had the opportunity to visit campus.", "Interview Questions": "I remember they asked about diversity & inclusion and why CU Boulder."}, {"date": "30 Jul 2021", "title": "Attorney Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "The process went through Hirevue. I was not familiar with the format of the interview as I had to record videos of myself answering to the questions.\nI felt very uncomfortable despite prepping and watching hirevue videos online.", "Interview Questions": "Why do you want to work for CU Boulder."}, {"date": "2 Aug 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2021", "Interview Descriptions": "Simply upload a resume and professor will reach out to you, the whole process just like daily chat, if your resume is good enough, they just ask you when to start. usually there is no testing on your course knowledge.", "Interview Questions": "When can you start to work?"}, {"date": "25 Feb 2023", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Aug 2021", "Interview Descriptions": "Very laid back interview, asks questions about how to assist people who are looking for housing off-campus. Usually either a zoom interview or in person, only 1 round. Super great team!", "Interview Questions": "How would you help someone who has no knowledge of finding housing in Boulder?"}, {"date": "2 Jul 2021", "title": "Library Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Pretty informal, one on one with the person from the department that was hiring. Generic questions, how did you handle a difficult situation, when can you begin, what year are you in school", "Interview Questions": "Describe a time you had to deal with a difficult teammate "}, {"date": "8 Jul 2021", "title": "Community Center Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Boulder in Jul 2021", "Interview Descriptions": "Fairly in-depth interview. Consisted of three stages, each meeting with a different group of people (potential coworkers). General questions about the job, how you would handle a given situation, etc. Was given a case study at the end where you had to review what you would two in two situations related to student supervision.", "Interview Questions": "Can you tell me about a time you dealt with organizational change?"}, {"date": "27 Dec 2021", "title": "Transfer Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Jul 2021", "Interview Descriptions": "Given questions beforehand to prepare and then had a surprise question.  The interview was over zoom with one interviewer and it lasted about 30 min with some time for questions and clarifications.", "Interview Questions": "Tell us a little about yourself and why you chose to apply for the Transfer Peer Mentor position? How do you think this position might help you grow toward your future goals?\r\n\r\n2. Surprise question\r\n\r\n3. Tell me about a time that you had to be self-directed and motivated in completing a project. How did you stay on task and structure your work to complete the project in time?\r\n\r\n4. What makes a good event or program? How can you help provide this?\r\n\r\n5. Tell us about a time when you received constructive criticism on your performance that you weren’t expecting from an advisor, teacher, coach or supervisor. How did you handle it\r\n\r\n6. At CU Boulder we have many students from different backgrounds and identities starting their academic journey together. How would you help a new student who has a different background and is facing different challenges than you, feel welcome at CU?\r\n\r\n7. Tell us about a time you lead your peers, even though you didn’t have a formal leadership title. How did you delegate tasks and create “buy in”?\r\n\r\n8. Please explain how you view this position and what the job responsibilities are. This question is to help us understand your interpretation of the position and if there's anything that can be clarified. \r\n"}], [{"date": "30 Jan 2022", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jul 2021", "Interview Descriptions": "Starts with a video interview- a series of questions that you record answers to and submit.  You must get through the HireVue process to move on to an in person interview.  HireVue feels tricky.", "Interview Questions": "What is your greatest struggle in your work environment."}, {"date": "25 Feb 2022", "title": "Architect Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2021", "Interview Descriptions": "Interview 1 was a recorded response to questions submitted\r\nInterview 2 was a live interview with multiple interviewers on zoom\r\nZoom interview had some technical issues with the coordinator so some interview time was lost", "Interview Questions": "Offer examples of large scale projects and how was it managed "}, {"date": "26 Jul 2021", "title": "Staff Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at University of Colorado Boulder in Apr 2021", "Interview Descriptions": "Without initial screen, they straight ask to do a take home assignment and followed by meeting with different group of people.\n\nThe take home assignment, they ask candidates to spent 3 weeks to implement solution to the problems they have. During the interview, they are asking candidates to solve the problems they have. Overall, they are awfully unprofessional.", "Interview Questions": "Tell me something I don't know"}, {"date": "21 Mar 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "The interview felt more like a training. I think they just want to see that you're an overall good student and have done well in some harder classes. I ended up doing a core workout with my manager and another tutor at the end lol", "Interview Questions": "How many credits have you completed?"}, {"date": "9 Mar 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "1. HireVue recorded, one-way video interview \n2. In person interviews\n3. Background check \n4. Offer and negotiation, finalizing terms \n\nI believe this is typical of CU Boulder's process but it may vary between departments.", "Interview Questions": "How does your past experience support success in this role? \nHow would you approach relationships with various stakeholders in higher ed (internal and external)? "}, {"date": "11 May 2022", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Feb 2021", "Interview Descriptions": "Online. Didn't talk to real person, used HireVue. It was super short, maybe three questions. It was basic behavioral and hypotheticals. There was only one interview for the entire process.", "Interview Questions": "You have someone going through a mental crisis, a parent of a resident, and a maintencne worker here to talk to you. Which do you prioritize and why?"}, {"date": "27 May 2022", "title": "Student Scholarship Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Colorado Boulder in Feb 2021", "Interview Descriptions": "If you apply through the student portal: \n\nYou are notified of the Interview via email or phone. Then One on One interview if they think you're a good match. \n\nYou will usually hear back within a week.", "Interview Questions": "Q: What experiences do you think would help you perform in this role?"}, {"date": "25 Jun 2021", "title": "Director of Recruiting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder in Feb 2021", "Interview Descriptions": "The process began with a video recorded interview, where you submit recorded answers through a web browser software. I reached the second round, which was conducted via Zoom. I thought the process was great. Lots of communication and kind folks. The position wasn’t what I expected and I think that was clear to both parties in the interviews. Very cordial process.", "Interview Questions": "How do you show value in diversity?"}, {"date": "17 May 2021", "title": "Leeds Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2021", "Interview Descriptions": "They asked some personal generic questions. They also asked questions about business. It was with two current students. It was well thought out and good. The interview lasted around 30 minutes.", "Interview Questions": "What is your  favorite book?"}, {"date": "9 Dec 2020", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Just normal graduate school application, there is no interveiw. what you need to do is to fill in the online application form and write a statement of purpose stating what you have done and plan to do in the future research.", "Interview Questions": "I didn't get a interview through the application"}], [{"date": "26 Oct 2020", "title": "Admission Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "In place of a phone interview, the initial round involved singing into a platform online and recording my response to predetermined questions. Following this, I was selected to move on as a final candidate and spoke with the entire admission team online. As part of the interview, I was required to make and present an informational presentation about why high schoolers should consider college. \n\nThe entire process seemed pretty fair and straightforward.", "Interview Questions": "Name a time you disagreed with a rule or supervisor and what you did?\n"}, {"date": "4 Sept 2020", "title": "Operations Support Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "CU Boulder's recruiting department posts ads for entry level positions, but only considers applicants with grad level education and experience.\n\nThey don't even give you the courtesy of a screening phone call, to introduce and sell yourself. They make incorrect assumptions based solely off your resume and reject anyone that does not fit their narrow-minded expectations of who can succeed in the job.\n\nCU Boulder's recruiting department is a dumpster fire, much like the institution itself. I suppose one must contemplate the connection between the institution's outdated and deceptive recruiting process and CU Boulder's decaying reputation.", "Interview Questions": "Nothing. They don't even bother to call you, just send auto-rejection emails."}, {"date": "7 Feb 2023", "title": "Academic Athletic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Aug 2020", "Interview Descriptions": "Was an easy interview, where I was asked behavioral questions about how I would deal with possible situations. It was completely behavioral because the technical skills depend on the student you are tutoring.", "Interview Questions": "Describe your weaknesses and strengths."}, {"date": "21 Jun 2021", "title": "Staff Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2020", "Interview Descriptions": "It was in the Zoom meeting. It was 1 hour long and it was very laid back with one interviewer only. They asked about the detail's in my resume and me previous experiences", "Interview Questions": "How to deal with difficult situations and angry customers "}, {"date": "24 Jan 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2020", "Interview Descriptions": "the interview process was very easy. communication first began over phone and then moved to email. i met with the hiring team and soon after was offered the position. i was given a tour of the areas i would be involved with and filled in on the various tasks i would be responsible for.", "Interview Questions": "why do you want to work for us"}, {"date": "23 Mar 2020", "title": "Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "The screening interview was a one-way remote interview where my answers to questions were recorded on a web-cam and reviewed by HR / others later.  This process felt very dehumanizing and I would highly recommend that anyone who has the opportunity to push back on that kind of screening to do so.  The only pro- to the one-way remote screening interview was that I could do it anytime that was convenient to me within a certain time period. \r\n\r\nThe following interviews were great, and they were accommodating to having a remote interview.", "Interview Questions": "i don't recall specific questions."}, {"date": "31 Mar 2023", "title": "Academic Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Feb 2020", "Interview Descriptions": "The first round of interviews are done through HireVue video interviewing system where you answer questions with a time limit while recording yourself on video, no playback or re-recording available. The final round was a half-day on-site interview meeting with the team and touring the building.", "Interview Questions": "How does this role align with your career goals?"}, {"date": "11 Mar 2021", "title": "IT Service Desk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder (Denver, CO) in Feb 2020", "Interview Descriptions": "Started with an online interview where I recorded myself answering questions. Passed that and got a panel interview 2 weeks later. Wasn't too bad. Some technical questions and some personality based questions. Good interviewers.", "Interview Questions": "Name a time you worked on a windows, mac, and phone system. "}, {"date": "28 Dec 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Preliminary interview where you answer questions to a blank computer screen-  awkward.  In person interview afterwards.  Low stress overall.  Usual questions about background and experience.  What's your greatest weakness etc", "Interview Questions": "Describe a time when you made a mistake"}, {"date": "29 Nov 2020", "title": "Community Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Nov 2019", "Interview Descriptions": "The first part of the interview was a series of questions served by a computer with timed periods to respond. It was pretty standard with few surprises but strange to talk to a computer and have to time out replies. After passing that I had an inperson interview with the hiring manager and team members in my department. They had a rubric to score me on as we talked. They were interested in behavioral evaluation but the interview ended up having little to do with the ultimate job function and it did not represent the team dynamics well or set realistic expectations.", "Interview Questions": "Have you ever experienced failure in a job."}], [{"date": "23 Oct 2019", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "They change the interview process every year, but it typically caters to the most outgoing and extroverted individuals. They make instant judgements so be sure to dress the part and share your name and pronouns (if you feel comfortable doing so). They also ask you to teach them something for 5 minutes. Extra points if you bring props.", "Interview Questions": "How do you approach diversity and inclusion and how do you hope to bring that into a community?"}, {"date": "13 Sept 2019", "title": "Assistant Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "Met with the lead researcher for the lab after emailing to set up a time. We talked for about 30 minutes and had aligning research interests, and there was an opportunity for position funding through the college.", "Interview Questions": "What modeling experience do you have?"}, {"date": "5 Dec 2019", "title": "Account Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Colorado Boulder in Aug 2019", "Interview Descriptions": "Hiring and interview process took about a month all together. It took about two weeks after the closing post date for an interview. The interviewer asked about 8 questions down a list, all standard, what are your strengths/weaknesses, experience, I believe one scenario case.", "Interview Questions": "What experience do you have in campus solutions"}, {"date": "9 Sept 2019", "title": "UMC Business Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2019", "Interview Descriptions": "It took about a month after I applied to recieve a call for an interview. The interview consisted of 2 - one on one interviews and then a final group interview. Total interview time was about 3 hours", "Interview Questions": "What about this position interests you?"}, {"date": "12 Jun 2019", "title": "Sponsor Accounts Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "A reference check was completed with skillsurvey. Then, I was invited to the interview. I first met with the department lead and manager. This was followed by the team one would be working with. I should mention they made the job seem horrible. Specifically, it was stated that it involves a high volume of transactions that would require one to work over 40 hours a week. I left feeling unsure about whether I would want the job. However, everyone was very nice and they seemed like good people.", "Interview Questions": "Describe you experience with multitasking and dealing with conflicting priorities. What strategies and methods do you use?"}, {"date": "12 Jun 2019", "title": "Program & Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2019", "Interview Descriptions": "After sending in my CV and cover letter, I was invited to participated in an  automated video interview with no human on the other side. It was comprised of 5 - 6 questions with 30 seconds to prepare your response and 3 minutes to respond to the camera.", "Interview Questions": "Why are you interested in this position? When you are stressed what do you do?"}, {"date": "16 Dec 2019", "title": "Economist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Boulder (Denver, CO) in Mar 2019", "Interview Descriptions": "Lengthy and detailed. Interview process took months, requiring multiple phone interviews and an in-person tour of the campus.  Weighed highly on experience and whether or not I was good fit for group.", "Interview Questions": "What interests you about the position?"}, {"date": "18 Mar 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Feb 2019", "Interview Descriptions": "(dept: Engineering) Most of the interviews with professors were casual, as they had already read my application. Mostly we chatted about the research being done in their labs. One interview was more technical: the professor asked about simulation software and experience.", "Interview Questions": "What are your plans after graduate school?"}, {"date": "2 Mar 2020", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2019", "Interview Descriptions": "Initial phone screen. Then multiple in-person interviews with the middle, and then senior library staff.  A LoC training and test was administered following the initial round of screening.", "Interview Questions": "Are you familiar with the Library of Congress Classification standards? "}, {"date": "15 Jun 2021", "title": "Events and Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder in Dec 2018", "Interview Descriptions": "HireVue is cold and painful. It is the standard first part of the selection process at the University of Colorado Boulder.  The overall timing of the selection process was met.", "Interview Questions": "Real case scenarios related to the position that you are applying"}], [{"date": "2 Mar 2022", "title": "Computer Lab Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Sept 2018", "Interview Descriptions": "Applied on the University website. Then from there the manager for the position reached out for available times to come in for an interview. The final stage consisted of interviewing in person with a few people from the department.", "Interview Questions": "What year are you planning on graduating?"}, {"date": "28 Apr 2021", "title": "Compensation Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Sept 2018", "Interview Descriptions": "It is a pretty time-comsuming interview process. First you need to submit all the standard things, then you need to write an essay and do a simulated task.  After that, you will be asked to record a video of yourself answering questions. For people who are not used to talking to themselves in front of the computer, it can be nerve wrecking. After that, you will be invited for an in-person interview. I didn't go to the in-person interview as I got another offer, but I was told that there were about 7 candidates chosen for the final interview. So it is a very long competitive process.", "Interview Questions": "Q: What was the biggest challenge in your previous work and how you overcame that?"}, {"date": "2 Feb 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Colorado Boulder in Aug 2018", "Interview Descriptions": "Very relaxed and easy going.  The College of Engineering BOLD center office needed assistants to help out with office management and scheduling rooms for student societies.  They were looking for full time students that use the space and are part of student societies. Found out about the position from work of mouth and sent in an email to the director who directed me to the application.", "Interview Questions": "What improvements would you like to see made?"}, {"date": "6 Aug 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2018", "Interview Descriptions": "They brought me in and I stood in front of a panel of managers. I talked about my skills and what I could offer to the job. Also demonstrated proficient operating skills of a windows operating system live in front of the panel. They asked some questions about previous experience on my resume.", "Interview Questions": "Why  would you be the best fit for this position?\r\n"}, {"date": "13 Feb 2021", "title": "Peer Advisor Work-study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2018", "Interview Descriptions": "A very standard interview with the typical questions asking about your strengths/weaknesses, why you want to work there, what your knowledge of financial aid is, why you would be a good fit, how well you perform under stress, etc. Very friendly and welcoming. Dress business formal and arrive early for parking (never show up late).", "Interview Questions": "How much do you know about financial aid?"}, {"date": "7 Apr 2022", "title": "HR Service Center Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder in Aug 2018", "Interview Descriptions": "First was a  Hireview Interview\r\nSecond was an In person or Zoom interview\r\nI received a quick turn around and good communication\r\nAnswered all questions I had for them during the interview process", "Interview Questions": "Tell us about a time you were overwhelmed by your workload and how you handled that stress."}, {"date": "16 Jun 2018", "title": "Dedicated Desktop Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2018", "Interview Descriptions": "I had a Zoom online interview with the other two members of the DDS staff.  They were pleasant to converse with and I believe would have been great to work with. However I emailed them twice over a three week period  and received no correspondence from them even though they set up everything prior. Found out through a random HR rep with a generic response that they offered the position to someone else. Their hiring process could use a human touch with some care.", "Interview Questions": "What's the most important skill to have when delivering technical support?"}, {"date": "23 May 2018", "title": "Financial Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2018", "Interview Descriptions": "The first interview was hosted by Hirevue. It's pre-recorded interview. You have 1 minute to read the question and 3 minutes to record. It's better to get use to record yourself before you record the interview.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "19 Feb 2021", "title": "Administrative Job Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder (Boulder, CO) in Mar 2018", "Interview Descriptions": "CU has recently begun implementing more virtual interviews, and by virtual I don’t mean in order to protect everyone from the pandemic. I mean impersonal, you get asked a question by a computer and then get three minutes to record yourself answering. And even after this you sometimes don’t have the decency of a rejection.", "Interview Questions": "Very basic question about your strengths/weaknesses followed by HIGHLY specific personal question irrelevant to the overall job. "}, {"date": "6 Feb 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "I was not interviewed for this specific position. I just applied online and got the offer through email after a month from the time I send them an email. It is part of the graduate program.", "Interview Questions": "I was not interviewed for this position. I just applied online and got the offer after a month."}], [{"date": "19 Mar 2019", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Colorado Boulder in Nov 2017", "Interview Descriptions": "The conversation about past experience and why I wanted to work there. I shared my past job experience and that I knew friends who had worked there before in the past or currently did and enjoyed their time there.", "Interview Questions": "What customer service experience do you have?"}, {"date": "10 Nov 2017", "title": "Programming Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Oct 2017", "Interview Descriptions": "I initially applied online and was offered a second interview in the form of a video interview where I recorded myself answering a series of questions. The third phase was an in-person interview, followed by check on references and background.", "Interview Questions": "In which unique ways will you contribute to the team here?"}, {"date": "4 Sept 2018", "title": "Business Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Oct 2017", "Interview Descriptions": "Received a phone call for an in-person interview where I met with 2 people.  One was the supervisor for the position, the other was another manager in the office.", "Interview Questions": "Asked pretty straight forward questions.  "}, {"date": "12 Oct 2017", "title": "Student Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2017", "Interview Descriptions": "The Professor will ask you questions about the subject. My subject is Artificial Intelligence so questions pertaining to that. The best approach is to know your subject well and give conceptually correct answers.", "Interview Questions": "Best Search Method and why?"}, {"date": "9 Aug 2017", "title": "Pre-health Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Colorado Boulder", "Interview Descriptions": "The initial interview is pre-recorded and done through HireView. Fort this position the interview questions were sent ahead of time so that the candidate had plenty of time to prepare STAR responses. There are opportunities to practice the recorded interview process and you have the option to hide the screen that shows you interviewing. During the actual interview it will have the question and then give you 60 seconds (you can skip if you want) to prepare before recording your response. You have 3-4 minutes to give your complete response.  All questions were behavioral based and most of them were specific to pre-health students.", "Interview Questions": "Describe a time that you were overwhelmed with responsibilities at work. How did you respond? What was the result?"}, {"date": "6 Sept 2017", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder in Aug 2017", "Interview Descriptions": "Received email from HR to schedule a video interview with department lead. Corresponded with department lead to schedule interview. Was provided with video call link and other information by the employer. Was told if I had difficulty accessing the call I could call in by phone. During the video interview, I was told references would be contacted by CU HR (automated survey) within a few days. No references were contacted but HR emailed saying the team was still deliberating. The following week, still no references were contacted and was never contacted again by either HR or department lead, despite one email and one voice mail follow up on my behalf.", "Interview Questions": "How comfortable are you with travel?"}, {"date": "7 Nov 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jul 2017", "Interview Descriptions": "Three separate panel interviews with members of the office the position would work for and with members of other offices the position would interact with (student affairs, admissions, tech services)", "Interview Questions": "What challenges do you think you will face in taking on this role. "}, {"date": "12 Jul 2018", "title": "Marketing Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder in Jul 2017", "Interview Descriptions": "A bit lengthy but smooth overall. Was kept in the loop with the status of my application. Video interview required before meeting with any in person team members. Overall a positive experience.", "Interview Questions": "What is your past experience l?"}, {"date": "5 Dec 2017", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2017", "Interview Descriptions": "I have sent the email inquiring about position directly to the principal investigator.\r\nWe've been talking via Skype ~1 hour, discussing my educational background, practical skills, things that I liked in my PhD studies and things that I am proud of. Then he described his lab and typical routines.\r\nI got an invitation to attend the on-site interview, but I declined.", "Interview Questions": "Describe your future plans."}, {"date": "21 Jan 2020", "title": "Executive MBA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2017", "Interview Descriptions": "Relaxed atmosphere, friendly counterpart. Precise questions. At the beginning there was enough time to make preparations and to get to know each other. Good preparation is important here. Information about this was exchanged before by mail", "Interview Questions": "Presentation of the research focus and explanations of the methodology were necessary"}], [{"date": "1 Jul 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Colorado Boulder in Jan 2017", "Interview Descriptions": "It was a slow interview process with multiple weeks of silence. The communication was not the best during the interview process. Went well overall and was offered a job. Happy with my decision.", "Interview Questions": "What is an example of a challenge you faced at work and how did you resolve it?"}, {"date": "9 Feb 2017", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Dec 2016", "Interview Descriptions": "Met with the supervisor and was asked what I could tutor and why I wanted to be a tutor. The whole thing was pretty easy and not too stressful. The person interviewing me was very pleasant and I was offered the job on the spot. I was given the paperwork to fill out and that was that", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "6 Oct 2016", "title": "Student Assistant IV Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "I received the email from the university that I needed to have an interview before I took my job. So, I made an appointment with the officer, and I talked with her. It was little nervous, but it was not terrible as what I thought. She was very kind to me. It ended well, and I got the offer from University.", "Interview Questions": "Why do you want to take this job?"}, {"date": "11 Oct 2017", "title": "Network Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2016", "Interview Descriptions": "It was amazing.  A combination of linux, network and security. The interview walked over some of my past experiences with Linux and I was asked to solve a particular scenario using Puppet.", "Interview Questions": "Describe your previous experience in Linux. Explain puppet"}, {"date": "3 Aug 2016", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2016", "Interview Descriptions": "Starts with a video interview with about 7 to 8 questions.  The video interview is prerecorded so you have to sit in front of your computer and answer questions with no one on the other side.  But the question were not difficult, just got annoyed when the internet dropped.  Questions are mostly behavior based, speaking to previous experiences.", "Interview Questions": "Why do you want the role?\r\nTell us about a time you...."}, {"date": "28 Dec 2017", "title": "Learning Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2016", "Interview Descriptions": "I actually liked the recorded online interview that they used in the first round. It was not a phone/skype interview. I got a link, and I recorded my responses to questions on my own time. There was a specific time it needed to be submitted by, but I could record whenever I wanted up to that point. The in-person interview was great. Everyone was really nice and wanted to make sure I was a good fit.", "Interview Questions": "What do you feel that you can bring to this department that we do not already have?"}, {"date": "29 Aug 2016", "title": "Academic Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2016", "Interview Descriptions": "The interview consisted of 2 panel interviews - one 3:1 and 2:1. Both were relaxed and it was more of a conversation with interview questions thrown in. Each panel was one hour with a short break in between.", "Interview Questions": "Why are you interested in working at CU?"}, {"date": "15 May 2020", "title": "Staff Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder in Feb 2016", "Interview Descriptions": "Interview was over the phone with the supervisors. The interview itself was incredibly easy and at the time the job sounded like a dream come true based on the information I received during the interview.  The supervisors asked basic questions about me, my education, experience, etc and sold me on the higher-level work as a manager. I accepted the job and worked for CU for several traumatic years.  Unfortunately, the supervisors turned out to be a well-known bully, compulsive liar, and liability that the University has been attempting to fire for years.  They lied to me during the interview and about most things including the level of job duties to attract me to the job. In hindsight, many of the interview questions were to determine if I would be willing to cover for their indiscretions, misuse of money, and harassment of students and staff.  Beware non-classified jobs at CU...they are not covered by an employee union and employees have little to no recourse against bad-actor staff members or tenured professors.", "Interview Questions": "Are you willing to keep secrets?"}, {"date": "16 Jan 2016", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "not too bad, just be professional and be prepared to answer some questions in the realm of social justice. their culture and mission is to create \"inclusive excellence\" and to get there, their role is to play social justice warriors.", "Interview Questions": "teach aliens how to make a PBJ"}, {"date": "4 Oct 2020", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2016", "Interview Descriptions": "It was a two part interview. There was a hirevue which was a video interview. A few weeks later, they contacted me for an in-person interview. This was a three-part interview with their staff, managers and director. They provide a lot of details of the day and with who you will meet. They also offer breaks in between.", "Interview Questions": "They asked a lot of scenario questions focused on financial aid. "}], [{"date": "25 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2016", "Interview Descriptions": "Went into conference room, was interviewed by two very nice ladies who asked about my background in administrative work and my experiences as a student at CU. They detailed what my job description would be but also said it depended on the needs of the department I was in. They were very prompt in their response time and overall I had a very positive experience.", "Interview Questions": "How do you handle multiple, competing priorities?"}, {"date": "31 Jan 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Dec 2015", "Interview Descriptions": "Fairly simple. Did well in the course. Professor asked if I am interested in the position and conducted an interview. Questions were generally about debugging and my general career goals.", "Interview Questions": "How would I debug a non-working board?"}, {"date": "28 Oct 2015", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Laid back and generous. First had to answer three questions over email regarding part tutoring experience and diversity. Then got a call back for in-person interview at the Writing Center on campus. The head of the department was thorough but kind. He asked questions about my prior experience and any issues I have had in the past, as well as focused on pedagogical theory I had learned in my masters program.", "Interview Questions": "Mock tutoring session with a student paper, with the head of the dept acting as the student."}, {"date": "3 Oct 2016", "title": "Linguistic Annotator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of Colorado Boulder (Boulder, CO) in Oct 2015", "Interview Descriptions": "I went in for one interview after my application had been accepted. There were three women who were hiring for different projects and each asked some questions. Overall, the interview was about fifteen minutes and felt fairly casual. I was impressed with their expertise and they made the entire process very accessible and friendly.", "Interview Questions": "If you come across a question or problem that you cannot find the answer to, what would you do?"}, {"date": "21 Sept 2015", "title": "Norlin Library Circulation Desk Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "The interview process is very standard. A couple of questions will concern your general \"fit\" with the departments culture. A few questions will also concern your work ethic. Nothing should be a surprise here. Just come prepared and well groomed/", "Interview Questions": "Why do you think you deserve this job?"}, {"date": "22 Mar 2016", "title": "ASAP Tutor-Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2015", "Interview Descriptions": "The interview was easy with personality type questions much like any HR interview. The interviewer was very humble and did not try to ask any confusing questions and kept it simple and to the point. She made sure I understood the roles and responsibilities of the position and made sure I am capable of handling multiple student groups at a time", "Interview Questions": "How would you handle a student who is not understanding the concepts and failing a course?"}, {"date": "28 Aug 2015", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "They ask questions related to job. Applied via email. Sent resume. Overall questions were related to resume and job related. \r\nQuestions were related to \r\nProgramming Questions.\r\nWeb Design Questions\r\nDatabases\r\nEmbedded\r\nHTML design\r\nCSS design", "Interview Questions": "Programming Questions.\r\nWeb Design Questions"}, {"date": "14 Nov 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2015", "Interview Descriptions": "Interviewer was polite and friendly. Took ten minutes just to have conversation, which was nice. She appeared genuine in her representation of the position, and avoided cliche and cop out interview questions.", "Interview Questions": "What is your experience like in being involved in and completing multiple projects across different deadlines."}, {"date": "3 Dec 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2015", "Interview Descriptions": "Informal discussion with graduate advisor and professor I would be working for.  I had already been working with the hardware / software for the class, had taken the class, and knew the professor from prior interaction.  The department chair stepped in and attemped to force the position to be one that paid half the amount for twice the required hours.", "Interview Questions": "What level of commitment I could provide to the class in terms of doing office hours, grading, etc..."}, {"date": "23 Jul 2015", "title": "Assistant Professor, Clinical Track Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "A 1.5 day process, beginning with dinner in Wednesday evening, followed by breakfast at 7am the next morning, interviews with a dozen people and presentation of my research. Next day, another breakfast with faculty and then taught a class. Grueling but good. They court people aggressively.", "Interview Questions": "Many questions about my research and my moral stance on the issue."}], [{"date": "28 Aug 2015", "title": "Contracting Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Colorado Boulder (Boulder, CO) in Jul 2015", "Interview Descriptions": "Recruiter sent information on the multiple-step process: online application with three parts, solo video-taped interview, one-on-one live video, then live group video interview. Asking all the correct questions for a senior role, not a purely administrative or specialist role.", "Interview Questions": "Their questions were about my background and experience relating to position, my handling of difficult and complex situations and the size and scope of contracts managed."}, {"date": "19 Jan 2017", "title": "Research Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Jul 2015", "Interview Descriptions": "Brief in-person interview, found out about offer later that day. Was referred to the position by someone who works in the same department on a different team. Spent some time talking with other current employees of the hiring team.", "Interview Questions": "What can you contribute to this line of work?"}, {"date": "14 Apr 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2015", "Interview Descriptions": "Full day interview, mostly panel orientated. Tour of campus. Opportunity to meet with a variety of staff members, faculty, and deans. It was long day, but a great experience. I walked away hoping to get the job, and I was offered the position the next week.", "Interview Questions": "Fundraising experience, experience working with difficult people, career goals"}, {"date": "2 Oct 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2015", "Interview Descriptions": "The process was relatively simple for me. I was referred for the position by a friend, so I emailed the supervisor/hiring manager for the position and got a reply within a couple days. We scheduled an interview shortly afterwords. The interview itself was pretty casual. Only me and the supervisor. Most of the questions were situational and were asked from a piece of paper that looks like it is taken out for every interview.", "Interview Questions": "How would you handle an angry parent who is calling with complaints?"}, {"date": "11 Feb 2016", "title": "Admission Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2015", "Interview Descriptions": "very extensive, interview with associate director, interview with 3 person committee, and then a 15 minute presentation to about 15 staff members followed by a single question from each person in attendance", "Interview Questions": "what does diversity mean to you"}, {"date": "21 May 2018", "title": "Accounting Technician III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2015", "Interview Descriptions": "Many people at the interview, some don't care, some want to show their knowledge. Basic question, strength, weakness. It took 25 minutes and there was nothing particular about it. You can dress business casual.", "Interview Questions": "Describe yourself"}, {"date": "15 Aug 2015", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2015", "Interview Descriptions": "A brief interview section with an extensive training and role playing section on on-the-job activities. The role playing section involved one of the interviewers playing a student and a situation from a prompt was read. The interviewee must then help the student solve the issue at hand successfully. The interviewers want to see how you handle situations and what skills you use.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "10 May 2016", "title": "Educational Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2015", "Interview Descriptions": "I found the position through the university's job website and revised my resume and crafted a cover letter to submit online. I got a confirmation email and within a week after I submitted my application, HR notified me that I advanced to the first round. I did a HireVue interview, and then received a call that invited me to an on-campus day-long interview. I think I did really well, but didn't end up being offered the job. I was notified that I didn't get it by the end of the week; the whole process seemed comparatively fast. Other interview processes that I previously and subsequently did at this institution took much longer.", "Interview Questions": "The dean asked if I had gotten my PhD."}, {"date": "23 Aug 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2015", "Interview Descriptions": "Was referred by a supervisor at CAPS, met for an in person interview for 30 minutes. I was called later that day and told I got the job. I believe that my employee reference likely set me apart.", "Interview Questions": "How will you balance work and school?\r\n\r\nHow do you plan to keep organized in this job?\r\n\r\nWhat are you majoring/minoring in?"}, {"date": "13 Mar 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "very easy, beahavior questions, situations questions mostly, want to know about you more than asking questions, want to know you have a plan, are here for a degree, the supervisors are very nice and there are almost all students to help you our in work, flexible schedules", "Interview Questions": "situational questions"}], [{"date": "9 Mar 2015", "title": "Alumni Relations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder", "Interview Descriptions": "First interview is online through a third party. The interview is a set of pre-selected questions that are displayed on the screen. You have 30 seconds to prepare an answer and 2 minutes to give your response. This interview is not live. The answers are taped and submitted individually. During the interview your screen will by you giving the response so it is a bit awkward and distracting. I would cover up the screen when responding.", "Interview Questions": "If in this position what would be your first event produced for the alumni? \r\nWhat past experience makes you fit for this specific role?\r\nWhy should we hire you?"}, {"date": "3 Sept 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Colorado Boulder (Boulder, CO) in Mar 2015", "Interview Descriptions": "Easy hiring procedure. There was not much to prepare. One to one interview and asked about my background. Had a brief discussion about the compensation and I was selected to work. Easy interview procedure.", "Interview Questions": "How well can you manage customers."}, {"date": "19 May 2015", "title": "Retail Operations Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Feb 2015", "Interview Descriptions": "Applied Online.\r\nNotified by email that I would need to answer about 10 questions via video recordings on a website they provided.\r\nNotified to submit references who then had to fill out online surveys about me.\r\nWas called back for an on-campus interview. Prior to the interview, I was provided via email with blueprints and stats of one of the stores on campus and told to prepare a ~10 minute presentation about how I would increase efficiencies in this store.\r\nAt the on campus interview, was interviewed by a panel of about 6 people, gave my presentation and spent about 75 minutes answering their prepared questions.\r\nOne more followup call with a couple additional questions that I was later told were questions asked of candidates after my interview - and were questions asked of me to maintain consistency among the interviews.\r\nAfter this, I was offered the job - at which point both a background check and a driving record check were each performed.", "Interview Questions": "What are some methods of loss prevention you would employ to reduce breakage due to theft?"}, {"date": "11 May 2016", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Colorado Boulder in Feb 2015", "Interview Descriptions": "Emailed to set a date. Flew me out. Interviewed with department faculty, about 30 minutes with each faculty member. After interviews had dinner with all grad students, and then happy hour with all faculty. Left they following day, took the shuttle from Boulder to Denver International Airport.", "Interview Questions": "How does your research speak to the aims of the department?"}, {"date": "31 Mar 2017", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado Boulder (Boulder, CO) in Feb 2015", "Interview Descriptions": "Interview process was a one on one in person interview. The interviewer asked simple questions about information technology and other questions about working within the campus. It was an pretty easy interview overall.", "Interview Questions": "How do you approach helping a customer."}, {"date": "6 Jan 2015", "title": "Research Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Single interview to determine which of the 50+ applicants would be hired.  15 people were interviewed, and after 1-2 weeks references were checked.  Make sure to have good references.  This can make or break it for you as interview performance in the sciences is only one factor during the application process.", "Interview Questions": "Nothing unexpected.  Most difficult was probably, \"what makes you the best fit for this position?\""}, {"date": "2 Feb 2015", "title": "New Resident Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Boulder in Jan 2015", "Interview Descriptions": "I applied online. You're required to answer some basic questions, submit location prefs, and attach a resume and cover letter to your application. The application closes early December, and they send out invitations for interviews early January. The process for reselecting past RAs happens a bit earlier. \r\n\r\nMy interview was late January. They did all of the interviews in one day, with lots of hall directors and current RAs on hand. You sign up for a time slot and are randomly assigned to a HD and RA in that timeslot. I ended up with an RA and HD who were not anywhere near the top of my location prefs, and neither had read my application. I also hadn't lived in either of their dorms.\r\n\r\nThe HD introduced himself and then took notes on his laptop for the rest of the ~20 minute interview without asking questions. I'm not sure if this is standard or not. All three of us had a double sided sheet of paper with questions printed on it. The questions were fairly typical, asking things like:\r\n\r\nTell us an experience when you experienced good customer service.\r\nWhat do you think will be most challenging about being an RA?\r\nHow will you try to connect with students with whom you have nothing in common?\r\nIf you've indicated any hall preferences on your application, can you tell us why you think you are a good fit for them?", "Interview Questions": "The last question involved a fake scenario where you're an RA and have to prioritize several tasks. I don't remember all of them, but here are the ones I do remember in no particular order.\r\n\r\nAgain, you are an RA. It's 7PM Thursday and you've just returned to your room. \r\n1. A girl has written a note on your door asking to talk because she's been in a fight with her roommate.\r\n2. Another girl has dropped a note saying that the A/C in her room is broken and that it's freezing.\r\n3. Your HD has sent an e-mail asking you to take care of the girl in (2) because her mother has also e-mailed the HD.\r\n4. You get a text from some classmates asking you to study with them for a test next Tuesday.\r\n5. Your friends have texted you saying they'll be stopping by later tonight to pick you up to go out and have fun."}, {"date": "28 Mar 2015", "title": "Learning Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2015", "Interview Descriptions": "I was not actually interviewed for the position. The job opened up mid year and my name was put forward to fill the position. I believe this position is typically filled in house. I do not believe they advertise the job, preferring to choose someone known within the department.", "Interview Questions": "Was I interested in the position?"}, {"date": "24 Feb 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Colorado Boulder in Dec 2014", "Interview Descriptions": "Applied through online process, then they send emails to schedule a phone interview. Then we talk on the phone for 20 minutes. Three days later, they  gave me the offer letter.", "Interview Questions": "Why choose the school"}, {"date": "4 Dec 2014", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Boulder (Denver, CO) in Nov 2014", "Interview Descriptions": "I was contacted through email with a link to HireVue for an online recorded interview, which consisted of about 5 questions, each of which I was given two minutes to review and the website immediately started recording me (whether I had an answer ready or not!) for three minutes.  About two weeks later I was sent an email saying some anonymous \"expert panel\" had reviewed all the interviews, but I was not selected to move forward in the interview process. No explanation! No interaction with any people during the entire process, it was an incredibly impersonal and off-putting process! They said to stare at the camera to make it \"feel\" like there was eye-contact being made, but it's not natural and was impossible for me to maintain!", "Interview Questions": "Given a mock storyline situation (It's 8am, you have a presentation at 10am, you haven't finished your presentation, the delivery guy calls you and is lost, etc., etc...) what do you do?"}], [{"date": "24 Oct 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Typical of all academic interviews - phone interview followed by in-person 2-3 day visit w/key faculty members & grad students. Watch out for promises not put in writing! Generally collegial audience for presentation, but I was subjected to immediate efforts to get me to take sides in departmental battles.", "Interview Questions": "In appropriate assumptions made about \"diverse\" aspects of my identity."}, {"date": "16 Jun 2015", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2014", "Interview Descriptions": "Depends on which jobs you are applying for, however, I have been through many of the CU Boulder hiring processes. Usually, for an advisory role, you will have an interview with the Director of the Department (1-on-1). He/She will usually ask very standard questions, like \"Why are you interested in this position?\" A lot of these questions stem from the specific position you applied for, but generally try to outline your strengths, and very specific examples about how you contributed to a project, workshop, or how  you engaged with students in the past. \r\n\r\nAfterwards, you then move on to a meeting with much of the members/staff of the department. The interview questions will follow a similar format. These element is probably the most important, as I also served on search committees for interviewees. This really gives you the opportunity to win over the department's staff, highlight your specific skill set and talents, and also, share a little bit about yourself as a person. Being a \"correct\" fit for the department may ultimately decide if you get the position or not. Passion always garners interest.", "Interview Questions": "Q: \"Tell us about a time when you applied yourself to a project, your organizational/planning efforts for that development, and the outcome? What else could have you done better?\""}, {"date": "2 Sept 2014", "title": "Events and Outreach Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Boulder", "Interview Descriptions": "Took a while to hear back! University has a very long hiring process. Had to have three initial interviews before hiring, but with weeks in between. Interviews are done in large groups rather than small. Panels are comprised of different personnel in the office or within its volunteer network. You don't get to speak directly with the supervisor until much later on. This makes answering some questions for the interviewers hard because they are unfamiliar.", "Interview Questions": "All of the questions were very standard."}, {"date": "23 Aug 2014", "title": "Web Content Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "Started with a group interview (solo, multiple CU people on the call), then went to solo interviews with boss and boss' boss. Process took a little less than a month. References were called.", "Interview Questions": "what's your weakness"}, {"date": "30 Sept 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2014", "Interview Descriptions": "I got referenced by a student group leader. So everything was fast, and my boss was very nice. I did not even have to submit a cover letter.  My boss is the one who actually interviewed me. He told me a bit about the position and what I should be expected.", "Interview Questions": "What major are you and why do you want this position?"}, {"date": "14 Jul 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "Just had a phone call with my advisor and talked about my previous research. We went over a ppt slide I had prepared. Another student was on the line as we'll.  took about 30 minutes or so. We exchanged emails to set the details of the hire like starting date etc.", "Interview Questions": "N/A"}, {"date": "10 Jun 2014", "title": "Mail Clerk Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "It was pretty standard process, I applied for it online, after a week they called me for interview, and at the interview they explained what the duties for this position, they also checked my availability. It was one by one interview, then I accepted the offer.", "Interview Questions": "Basic question"}, {"date": "2 Jun 2014", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "There was only one interview and it was pretty casual. I had a resume written which is probably what set me apart from the other applicants. It's really dependent on who is in charge at the residence hall that you apply to in terms of if they like you or not which will lead to being hired.", "Interview Questions": "The questions were pretty standard."}, {"date": "24 Apr 2015", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2014", "Interview Descriptions": "Video Interview that lasted about 30 minutes.  Given 2 minutes to answer each question and once recording had begun, it couldn't stop and re-record.  A timer on the screen kept track of the response time.", "Interview Questions": "All were specific to the role.  What experience have you had with work in a higher education environment?"}, {"date": "13 Nov 2015", "title": "Virtual Machine Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at University of Colorado Boulder (Denver, CO) in Jan 2014", "Interview Descriptions": "Met my employer and got the job instantly. Really easy. No technical questions were asked. He was nice and told me the job I would be doing. My job was to install virtual machine and box software for students. Very easy task.", "Interview Questions": "How do you feel about helping students?"}], [{"date": "21 Jan 2017", "title": "Field Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Colorado Boulder (University of Denver, CO) in Oct 2013", "Interview Descriptions": "I met with the Site Coordinator who was my immediate supervisor and told her about any sales history I had and she told me about the job in some detail.  She explained the nature of the research project, the goals, data collection, and the training that would be provided before I would be sent out to screen households for youth eligibility.  She made it sound interesting to me as a social worker and a student of violence prevention.", "Interview Questions": "Do you have any experience talking with people and asking them questions?"}, {"date": "16 Mar 2016", "title": "Outreach Crew Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2013", "Interview Descriptions": "The interview process was very easy and short. I interviewed on the University's campus and only had to do one interview. It was at the UMC building on CU Boulder's campus. It was mainly get to know you questions with a couple behavioral questions. The interviewer was very nice and respectful. Overall the interview process was quick and efficient. I found the questions to be quite general, most were addressing overall attitudes, values and beliefs.", "Interview Questions": "What would you do to improve this position?"}, {"date": "2 Jun 2016", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at University of Colorado Boulder in Jun 2013", "Interview Descriptions": "I originally sent in my application, and had a phone interview about 2 weeks later.  It was a standard phone interview with standard interview questions.  I was later notified that I was put on a waitlist for the job, and I didn't hear back from them until 1 year later.  I was then called up saying that an opening suddenly came up, and they offered it to me.", "Interview Questions": "Are you open to having shifts on nights, weekends, and holidays?"}, {"date": "8 May 2013", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "There was a preliminary phone screen which was followed by an on-campus interview with two individuals.  The final round included a group interview with a panel of students, as this was a student facing role.  Offers were made with a week of the final interview.", "Interview Questions": "How do you deal with ambiguity?  "}, {"date": "20 Aug 2015", "title": "Student Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2013", "Interview Descriptions": "Quick questions to gauge your reliability and personality. 5 minute conversation. They are more interested in ensuring student employees mesh with current ones in terms of personality than any past experience.", "Interview Questions": "Why do you want to work for grounds at CU?"}, {"date": "5 May 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Colorado Boulder in Apr 2013", "Interview Descriptions": "My 'interview' was primarily based upon my skill level, auditioning for the graduate program at the school of music. I would say it is mainly talent based, as well as how your personality would fit into the studio.", "Interview Questions": "What is your ultimate goal in life?"}, {"date": "29 Jun 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2013", "Interview Descriptions": "In order to gain an interview, the applicant would need to submit an application that would make it through the screening process. Afterwords, if it did, then the applicant would be called in for a one stage, one stage interview before the hiring team makes their decision. The interview consisted of three other interviewers. One person was the hiring manager for that department and the other two interviewers had positions directly in that field of work.", "Interview Questions": "\"Will you be able to work during university breaks? Such as spring, summer, fall, and winter breaks.\""}, {"date": "5 Mar 2013", "title": "IT Technician II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Colorado Boulder", "Interview Descriptions": "I don't care to add much to this segment. i find it a tad invasive. Could you please refrain from asking such questions in the future?", "Interview Questions": "N/A"}, {"date": "14 Jan 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2013", "Interview Descriptions": "This was a typical academic interview with job talk;  it was unusual for Research 1 university in that it included a teaching demo.  One guy was kind of a jerk, but as I learned after being hired, this is pretty typical of him in general.  Others were generally engaging and pleasant.", "Interview Questions": "How do you see yourself fitting into our program?"}, {"date": "21 Apr 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2013", "Interview Descriptions": "There was none. It was application based only. I applied online with two essays, transcripts and GPA. If applying to graduate school in stem fields there is usually no interview process", "Interview Questions": "N/A"}], [{"date": "11 Feb 2016", "title": "Residential Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Jan 2013", "Interview Descriptions": "CU need diversity, tons of people apply for the RA job simply because of the free housing, you're going to need to stand out somehow. You apply for the job then you go through 3 rounds, an interview online, a cold call, and a one on one or one on two interview.", "Interview Questions": "Name a time when you mediated a conflict between people."}, {"date": "8 Nov 2012", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Colorado Boulder (Boulder, CO)", "Interview Descriptions": "One must submit an application with a resume an cover letter, go to a class to learn about being an RA and go through an interview.", "Interview Questions": "What in your life makes you equipped to advise students on the subject of social justice?"}, {"date": "6 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Oct 2012", "Interview Descriptions": "For the interview they gave me two recent articles they had published that time. They asked me to write a small report about them in 2 days and send those reports to them. Next they asked me questions regarding my reports to see if i knew what i was talking about.", "Interview Questions": "Basics about finite elements and continuum mechanics."}, {"date": "29 Dec 2016", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2012", "Interview Descriptions": "I was welcome by the professor. We sit down and talk about my GPA, research experience and courses I took that are related to my research. Then we go to have lunch together. I toured the lab in the afternoon and say goodbye. A week later I get the offer.", "Interview Questions": "What kind of research have you done?"}, {"date": "1 Apr 2015", "title": "Coordinator Environment and Physical Assets Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2012", "Interview Descriptions": "Multi-level after phone screening. Met with division heads, managers and supervisors with a wide variety of titles and duties & responsibilities. Actually introduced to upper level academics probably for their general opinion of my appearance and demeanor to determine my fit in the overall academic world.", "Interview Questions": "Specifics on background and applicability to new job"}, {"date": "30 May 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2012", "Interview Descriptions": "Submitted a graduate application with GRE scores, recommendation letters, and personal statement essay. Also, needed to provide areas of interest and justification of why graduate school at this time in career.", "Interview Questions": "I was asked to bring my own graduate funding months before coming on to campus."}, {"date": "28 May 2015", "title": "Ice Rink Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2012", "Interview Descriptions": "talked to friend who worked there, they put in a recc, then set up a meeting, talked to Barb, then got an email back telling me to come back in.", "Interview Questions": "Have you driven a fork lift?"}, {"date": "10 Apr 2014", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2012", "Interview Descriptions": "I had applied to the University in December (of the year before I started working). I took the assessments required but was placed in a 'bank' of applicants. I didn't receive a call about this position (not the one I originally applied for--better actually) until April. I had a phone interview to start and got along with the woman really well (she's now my boss). We scheduled an in-person interview (in May) where I met with my [now] supervisor, the woman whose position I was going to take over (she was quitting to spend time at home with her family), and the building proctor (who plays a big role in the department). I remember interviewing and loving the people that I was interviewing with--making my answer easy when the job was finally offered. After this interview, I was told that if I made it to the top three (?) candidates, my references would be called. I was informed of this and by the end of May I was offered the position.I accepted the offer, put in my two-weeks notice, and started my position in June. I do have to say that my supervisor/boss did a really good job with hiring for this position. There are two of us who do the same job and we were selected based off our credentials but also because my boss thought my co-worker and I would mesh the best together. I appreciate the time and consideration it took to fill this position.", "Interview Questions": "N/A"}, {"date": "27 Jul 2015", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2012", "Interview Descriptions": "It took the HR some times to contact you back, but have previously worked with the family housing so they know me and made it easier for me to get the job. It was a 30 min one-on-one interview with either the resident hall director or they assistant. They would ask questions mostly about you and some situational questions to see your analytical skill.", "Interview Questions": "What were some challenges that you have experienced in the past and how did you get through it?"}, {"date": "22 Mar 2012", "title": "Professional Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Mar 2012", "Interview Descriptions": "My initial contact was through the online application process. After submitting a significant amount of information and filling out many forms, I was contacted by phone to come in for an interview. The interviewer was polite and friendly and overall my experience was positive. The actual interview itself consisted of a reasonably simple programming test, some detailed questions about my background, and some detailed questions about the technology that would be used for the position. Everything went smoothly and I believe I responded well to everything discussed. I was contacted with an offer a week later. However, due to constraints in the funding of the position, the offer was lower than I was willing to accept and I was forced to decline after an attempt at negotiation failed.", "Interview Questions": "I was presented with some code and asked to analyze it. After pointing out some bugs, I was able to correctly evaluate the purpose of the code segment and provide details about improvements."}], [{"date": "19 Jan 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Colorado Boulder in Mar 2012", "Interview Descriptions": "- emailed potential mentors with application package and was invited for an on site interview\r\n- standard postdoc interview process - meet with lab students and postdocs & PI \r\n- technical seminar on previous research\r\n- lunch and dinner with lab members\r\n- Boulder is at high-altitude so drink lots of water", "Interview Questions": "Why do you want to come here and do this kind of research?\r\nAll other questions were technical or indirectly behavioral."}, {"date": "27 Nov 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Feb 2012", "Interview Descriptions": "Initial interview was voice and video on internet, I understand now that they do video recorded interviews with pre-recorded questions which you have 30 seconds to reply.  I believe that this method is incredibly impersonal.", "Interview Questions": "Experience in managing similar projects."}, {"date": "12 Feb 2013", "title": "CU Bookstore Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Dec 2011", "Interview Descriptions": "I initially heard about the position through the school's weekly campus email. I submitted my application to the bookstore in person and was contacted approximately a week later by email to set up an interview. The interview was overall painless. I had a one-to-one interview with one of the supervisors, and was offered the position on the spot. Pay was competitive, relative to other non-technical campus-jobs, but was a flat, non-negotiable rate.", "Interview Questions": "What is the biggest mistake you have made in a previous job, and how did you handle it?"}, {"date": "23 Oct 2012", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Boulder (Boulder, CO) in Dec 2011", "Interview Descriptions": "Phone interview with 5 people.\r\nThis was followed by an onsite interview. It included meeting 20 plus members of the university and a presentation.", "Interview Questions": "Interview was easy."}, {"date": "29 Jan 2014", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Boulder (Boulder, CO) in Oct 2011", "Interview Descriptions": "The hiring process at the university takes forever. It's a very long process. You apply to the position online through their system and then receive information if you passed the resume examination. Then you have to take a general test of administrative duties that is only offered on a specific date and time that you have to make. Then if you score high enough you are placed in a pool for them to choose for phone interviews. Then if you pass the phone interview you are brought in for a physical interview usually with a committee, sometimes just with the people you are hiring for. For this particular position I was already in the university system so I was able to just have an interview with the people that were going to hire me. Then after the interview you wait. It can take several months for the final process to be completed. The interview questions are all pretty standardized. Be prepared to wait a long time to hear about the position and dealing with the long interview process.", "Interview Questions": "There weren't really any unexpected questions. They were more situation related. So be sure to have some story or specific example from past experiences to present."}, {"date": "31 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2011", "Interview Descriptions": "I was applying for a specific lab, so it was with the PI of that lab. It was very laid back. We went over my transcript, reasons for why I wanted to work in the lab, and then talked about their research.", "Interview Questions": "Why did I want to work in this research lab?"}, {"date": "22 Jul 2015", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Colorado Boulder (Boulder, CO) in May 2011", "Interview Descriptions": "Very easy, I just talked with someone about my past experience working in customer service.  The interviewer was incredibly friendy.  The environment was very casual as well, dont wear fancy clothing. The trep cafe rocks! My favorite place of all time.", "Interview Questions": "What is your spirit animal?"}, {"date": "16 Jul 2015", "title": "Research Assistant (PhD Student) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Apr 2011", "Interview Descriptions": "This was an in person meeting set after having being accepted remotely from cover letters, GRE scores etc etc. The welcome was good even though I did not come during a recruitment weekend. That said they forgot to meet me for dinner and left me to fend for myself (which was OK).", "Interview Questions": "Why did you want to work for me?"}, {"date": "8 May 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2010", "Interview Descriptions": "phone interview and on-site interview. Offer is given", "Interview Questions": "Availability to work"}, {"date": "10 May 2012", "title": "Educational Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at University of Colorado Boulder (Boulder, CO) in Jul 2010", "Interview Descriptions": "I answered a posted job announcement, then interviewed by phone with search committee, followed by an on-campus interview with prospective supervisor, colleagues and supervisees.", "Interview Questions": "N/A"}], [{"date": "25 Apr 2012", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Jun 2010", "Interview Descriptions": "We discussed my experience and how it would fit with the project needs.", "Interview Questions": "N/A"}, {"date": "6 Sept 2011", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Colorado Boulder (Boulder, CO) in Nov 2009", "Interview Descriptions": "Painless interview, questions were personality-oriented rather than job oriented. Plenty of opportunity to think through your answers and ask questions, and very comfortable. Three interviewers, consisting of one full-time adult employee and two student employees. Interview took 30 minutes, hiring process took 2 weeks.", "Interview Questions": "What would you consider to be your biggest challenge in a leadership position?"}, {"date": "14 Jun 2010", "title": "Bookstore Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Aug 2009", "Interview Descriptions": "To be expected from a university, the interview process was slow. However, I was encouraged to continually receive updates regarding my candidacy status. \r\n\r\nAfter 6 weeks of waiting and passing intermediate portfolio reviews, I was asked to come in for an in-person, panel interview. For the interview, I was to prepare a brief presentation of a few of my graphic design pieces to present at the interview. This is all of the information I was given. I prepared my materials and showed up feeling confident.\r\n\r\nWhen I arrived, I was led into a room with four interviewers behind a table. There was a chair for me on the other side. I sat down, smiled and introduced myself, expecting the same from them. Nope - no introductions, just a nod from a few. Weird, but I proceeded. After a moment or two, I was told the instructions for the presentation and handed a binder with the interview questions in it. Then I was told by one interviewer that he would be reading the questions aloud to me and I could ask them to repeat them, but they could not elaborate or help me in any way. ? At this point he also told me they were not allowed to interact with me, other than the questions, and oh, by the way - as he plopped a mini-recorder in front of me and turned it on - this was being recorded.\r\n\r\nI was floored. This was by far the STRANGEST interview I have ever been on. This was for a graphic designer job - not an oral presenter, not a teaching job...to not be told about being recorded until the day of, to not have face-to-face interviewers allowed to interact with me was just bizarre. I did the best I could with the info I had. Some of the questions were very vague but they could not help me. \r\n\r\nWe were finished in about 30 minutes. I was never more happy for an interview to end.", "Interview Questions": "Tell us how you would go about this project. "}, {"date": "30 Jul 2012", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Colorado Boulder (University of Colorado, CO) in Dec 2008", "Interview Descriptions": "Was interviewed as an on-campus employee.  Took multiple rounds.  Interviewed with individuals and panel.", "Interview Questions": "NCAA Eligibility requirements"}, {"date": "1 Sept 2012", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Boulder (Boulder, CO) in Sept 2008", "Interview Descriptions": "I submitted a resume and cover letter through the LASP website and heard back from the hiring manager within a few hours.  I had an interview a few days later which was about 4 hours long with a panel of people asking technical questions.  It was all very friendly and not exceptionally challenging.  I had a follow up interview a few days later where I talked with team leads from two different programs to see which one I'd be more interested in working on.", "Interview Questions": "Describe how a kinematic mount works."}]]