[[{"date": "23 Jan 2023", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Olathe Health (Olathe, KS)", "Interview Descriptions": "Applied online late Sunday night via Indeed, received an email at 9:00 AM Monday morning that they had already had their candidate picked. Take down the post if you have offers out and are automatically ruling out newly qualified candidates.", "Interview Questions": "N/A"}, {"date": "15 Nov 2022", "title": "Systems Administrator II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Olathe Health (Olathe, KS) in Oct 2022", "Interview Descriptions": "I met with the newly formed server team and the manager. The interview was scheduled for an hour and half but went a little over 2 hours. Majority of the questions were asked by the most senior System Administrator, who had only been with the hospital for 6 months. The manager left in the middle of the interview and came back about 30 to 40 minutes later. It seems the original team had either retired or left for another company in the last couple months. It seemed like we had a good conversation, but when I tried to follow up I was ghosted by the manager and HR even after sending emails to HR and the manager.", "Interview Questions": "If you have 9 queue balls all the same size but one is heavier and you have counter balance scale how do you find the 1 ball that is heavier with only using the scale 2 times?"}, {"date": "6 Dec 2021", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Olathe Health", "Interview Descriptions": "1st interview was a typical skills review call. 2nd was about the same, but more in-depth. Although I did not get an offer, both were pleasant and not difficult. A good experience overall.", "Interview Questions": "Standard questions regarding skill set and current job responsibilities"}, {"date": "5 Nov 2021", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Olathe Health (Olathe, KS) in Oct 2021", "Interview Descriptions": "Phone interview and then face to face interview. casual interview and it was good. very polite and answered all questions. Gave me a chance to ask my questions. ghfhjkgjlhkgng hjgjn,kkml", "Interview Questions": "Which settings do you like the most?"}, {"date": "28 Aug 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Olathe Health", "Interview Descriptions": "Lots of career fairs help to draw in people searching for a job at the company. There is an easy computer application process and you will always recieve follow up either by email or phone whether or not you got the job. If you complete the online application at the career fair, they may offer you an interview on the spot. After accepting your position you wait for your drug screen and background check to come through. After those have processed you will proceed to wait for the next general employee hospital orientation week.", "Interview Questions": "Describe a situation where you encountered a rude/frustrated client during a typical workday and how you handled it"}, {"date": "30 Jul 2019", "title": "Medical Office Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Olathe Health in May 2019", "Interview Descriptions": "HR was extremely accommodating in working around my availability. Interview was quick but efficient and HR moved quickly with hiring process. HR and the manager who hired me worked together closely to accommodate my needs and allowed me to begin work sooner than expected due to previous employer declining to allow me to finish out my given notice.", "Interview Questions": "What does professionalism look like to you?"}, {"date": "16 Sept 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Olathe Health (Olathe, KS) in Jan 2018", "Interview Descriptions": "HR calls to set up phone interview, then you meet with a hiring manager in person for another interview. If all goes well you’ll meet the unit manager of the place you’re applying for and have a short interview with them and be able to ask questions about that unit to see if it’s a good fit.", "Interview Questions": "They asked about where I’ve worked. What I would define good customer service as. Why I wanted to work there."}, {"date": "16 Nov 2017", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Olathe Health", "Interview Descriptions": "Positive Normal interview process. I had\r\nTwo interviews before landing the position, but after the second time it didn’t take long to hear back from the Human Resources person. The interview was laid back and not super formal, reading from a list of questions or anything. It was a smooth flowing conversation about prior experience and the position involved.", "Interview Questions": "It was more of a conversation than behavioral type questions. Good experience!"}, {"date": "22 Feb 2017", "title": "Clinic Coding Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Olathe Health (Lenexa, KS) in Jan 2017", "Interview Descriptions": "Did a phone interview first.  Then went to office to interview with the different managers.  Nice interview process.  Asked appropriate questions to find out my knowledge and back ground.  Everyone is still very nice!", "Interview Questions": "How do you handle stress?"}, {"date": "25 Jul 2016", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Olathe Health (Olathe, KS) in Jun 2016", "Interview Descriptions": "It was great! It went smooth. HR didn't draw it out! They were friendly and very uplifting! I love the company already! They care about the patients. They are very critical when it comes to doing the background checks. They check all references and previous employment. Great company. In training I was sitting with the CEO. He was warm and kind. He asked questions, He wasn't stuck up or snobby.", "Interview Questions": "Why are you a good fit for this position?"}], [{"date": "30 Sept 2016", "title": "Par Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Olathe Health (New York, NY) in Apr 2013", "Interview Descriptions": "Started with a phone interview, then an in-person HR interview then with the supervisor.   background check took weeks. not enough time spent on benefits.  not a lot of training provided", "Interview Questions": "what makes me special"}, {"date": "7 Nov 2012", "title": "Patient Financial Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Olathe Health (Olathe, KS) in Jun 2008", "Interview Descriptions": "Getting into HR was next to impossible unless you knew someone who could push your application through.  Felt like many questions were not applicable, and very generic, the \"situation\" questions like \"Name a time when....\"  Even if it didn't quite apply to the job you were applying for.", "Interview Questions": "Was there a time when a manager blamed a mistake on you, and how did you handle it?"}]]