[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Temporary position", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 May 2022", "job_title": "ESL Instructor in Toronto, ON", "duration": "N/A", "pros": "Nice place to work.\r\nGreat head teacher.", "cons": "Bad pay rate and unpaid breaks."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "Not worth your time or energy", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 May 2022", "job_title": "ESL Instructor in Toronto, ON", "duration": "N/A", "pros": "The international students' enthusiasm is great to see!", "cons": "This is the equivalent of a \"pump and dump\" investment scam! Instructors are not fluent in English !!! The pay works out to less than minimum wage when you include transportation costs, lesson prep and marking time. No teacher oversight because of chronic staffing issues, limited class supplies, dangerous wiring or threadbare wires for school laptops (I got shocked plugging in the class laptop for internet access!), pressure to pass students to keep them in the school for tuition, hours of unpaid prep work. They give out half the information to new instructors regarding expectations then wing it the rest of the time. The final \"exams\" are not reviewed, standardized or even scanned as soft copies. Old photocopies of exams were cut and paste like computers weren't invented yet. It is literally a joke and I feel sorry for the hardworking parents or adult learners trying to improve their language and employment prospects. Don't waste your time!!!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good for a first experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Jun 2021", "job_title": "ESL Teacher in Toronto, ON", "duration": "N/A", "pros": "Flexibility, you have the space to apply your creativity", "cons": "Salary too low to stay there permanently"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A fun, unique experience, but definitely not long-term.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Jan 2021", "job_title": "English Teacher in Toronto, ON", "duration": "N/A", "pros": "One of the most unique jobs around, and great for seeing if you want to pursue a career as a teacher.", "cons": "Salary is only viable for young people looking for experience."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Unethical and Dishonest", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jul 2018", "job_title": "Teacher in Toronto, ON", "duration": "N/A", "pros": "The teachers are wonderful people and deserve much more than what they get. They work very hard, although they know they are not being paid for their effort. Some students are wonderful as well - there are always some great students", "cons": "The principal of the school has no concept of ethics. The school is run purely as a business, and the quality of education of the students is not the priority.  This is common for international schools (many of which are run by non-Canadians who have different traditions when it comes to business ethics). The school is owned by a Korean women who repeatedly threatened to withhold our pay if we did not work overtime (which we were not paid for). This is against Canadian law. Teachers who work full time earn less than minimum wage, because they are only paid for the hours they are teaching, and not the hours to prepare courses, mark papers etc.\r\nOne teacher attempted to form a union and was fired by the principle. This is also against the law. The case went to court and a settlement was reached allowing the teacher to return to work (of course he choose not to return)"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful pay, awful managemnet", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Mar 2016", "job_title": "ESL Instructor in North York, ON", "duration": "N/A", "pros": "-location near the TTC\r\n-some nice international students that are happy to be in Canada but dont know how much they're being ripped off to study a few hours a day", "cons": "-north york location is an old decrepit space\r\n-they dont pay for lunch and take out 45 min of your cheque\r\n-lots of extra work and marking that you DON'T get paid for \r\n-students are charged a heck of  lot yet teachers are paid a fraction of that price\r\n-avoid working there like the plague"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Please don't do it....", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Mar 2020", "job_title": "ESL Teacher in Toronto, ON", "duration": "N/A", "pros": "My co-workers were very supportive", "cons": "Where do I start?....There were several red flags from the very beginning. \r\n\r\n1) No support whatsoever from management. No training or orientation. \"Don't worry, you'll figure it out\" attitude. This lack of standardization and implementation of clear policy is very worrying. It's detrimental to the teachers because it creates unnecessary stress and instability and the students also suffer because the teacher has to go on trial and error. \r\n\r\n2) Lack of clear guidelines and training. Issues are addressed once a month at teachers meetings because there are NO CLEAR GUIDELINES. This is extremely unprofessional and concerning. Things seem to be made up based on discretion, but it's presented as \"Oh, we trust you, so you can exercise flexibility\". NO, NOT OKAY!!\r\n\r\n3) Pay is abysmal for the expectations.\r\nYou will be lesson planning a lot because the \"prepared curriculum\" is so dry and insubstantial. The starting hourly wage is 19.00 in a city like TORONTO you will be scraping by. However, you may be spending up to 10 hours correcting and lesson planning each week. This looks more like 15 hours during exam weeks. Absolutely ridiculous and UNACCEPTABLE. \r\n\r\n4) School is not progressive despite claims to the contrary....\r\nWho delivers the product at language schools??? WHO??? Correct, its the teachers. The school opened in 2005 I believe. 15 YEARS and only now is there talk of minimal compensation for preparation time and marking. This came after constant complaints and teachers leaving the school. If such small progress takes 15 years for the people who are DELIVERING THE PRODUCT/SERVICE, I can't imagine how long it will take for other things to get done. Even after complaint after complaint from teachers, they would sometimes announce good news....Can you guess what this was??? The school was getting new floors and a paint job....How dare you? I frankly don't understand how any of the teachers are scraping by on these wages. You would get paid more for the ACTUAL work you do at Wal-Mart...Seriously.\r\n\r\n5) The Director and Management were supposedly once teachers. However they so out of touch with what is happening in the classrooms and the kind of pressure that teachers are under that I can only describe it as, the PERFECT EXAMPLE OF EXPLOITATIVE WAGE LABOR. Capitalism is working oh so well ladies and gentlemen. \r\n\r\n6) You are dispensable here. If you don't like it. Go. There are other desperate people looking for work ready to take your place in line. \r\n\r\nAfter I get all of my anger out, I am just left with deep disappointment. Just such a shame. You live and learn. Sometimes you live and learn and warn others. This is a warning. You are worth more than this."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Good school, poor employer", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Nov 2018", "job_title": "Anonymous Employee in Toronto, ON", "duration": "N/A", "pros": "Excellent teacher body, good students", "cons": "Humiliating pay, no growth, no readiness for progress"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good college to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Aug 2020", "job_title": "Ielts Teacher in Toronto, ON", "duration": "N/A", "pros": "very friendly and supportive staff", "cons": "few hours to work, just 3 hours a day"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Good place", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Aug 2020", "job_title": "French Instructor in Montreal, QC", "duration": "N/A", "pros": "Hours flexibility- Head teacher very comprehensive", "cons": "Students attitude is sometimes rude"}]]