[[{"date": "20 Apr 2023", "title": "Computer Science Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cal Poly Pomona (Pomona, CA)", "Interview Descriptions": "The interview process was very easy. In order to be a TA for a specific course, you simply need to receive B or above in prior semesters and fill out the required papers.", "Interview Questions": "Have you taken this course before?"}, {"date": "26 Mar 2023", "title": "Student IT Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Asking me questions to get to know me better and made sure I was ready for the interview by giving few minutes to prep. Let me ask any questions I had at the end of the interview", "Interview Questions": "Describe a time you faced a difficult technical situation."}, {"date": "6 Mar 2023", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "It is an online application with a resume on its website. waiting for the interview. background check. overall it is a long process. use the online system to review the time card. easy to use.", "Interview Questions": "can you please tell me about yourself"}, {"date": "29 Nov 2022", "title": "Student Fundraiser Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Aug 2022", "Interview Descriptions": "There will be a phone interview round & an in-person round after that. The phone round would mostly just questions about your availability & your previous experience in fundraising (it's completely OK if you don't have any). There's also a situational question at the end.", "Interview Questions": "Q: What would you say to convince a prospect to donate to Cal Poly Pomona?"}, {"date": "22 Jun 2022", "title": "Student Grader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "It was straightforward and efficient.  Ask me what I  have learned from this class and how  I am familiar with the topic. Most of the interview is to walk me through the material.", "Interview Questions": "Tell me about yourself and your experience with the specific course."}, {"date": "2 Dec 2021", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "No interview was conducted. I went in expecting one and was instead immediately hired and asked about scheduling. Acceptance is based on GPA and other academic works during previous courses.", "Interview Questions": "N/A"}, {"date": "2 Nov 2021", "title": "UHS Business Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Gives you hypothetical scenarios about how things can potnetially go wrong. Asks you about your resume, and your personality. Overall a relaxed and not stressful process. Be sure to dress business casual/formal, even though you aren't expected to for the job.", "Interview Questions": "What would you do if there was an angry client calling?\nHow will you manage your time well?"}, {"date": "2 Jul 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Thought provoking, technical, broad, and intentional.  It is an opportunity for the employer to learn about you, so be honest and personable. They will ask about relevant  qualifications for the job.", "Interview Questions": "How you will contribute to the organization?"}, {"date": "16 Jun 2022", "title": "Student Asisstant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Jun 2021", "Interview Descriptions": "Worked under him, so I just got it automatically. Try to do research or take their class first, then ask.  This is the best way to get in.\n\nIf you do go through the process, then make sure your foundation at that particular research is good as they will ask you questions about them.", "Interview Questions": "Why are you interested in this research?\nWhat extracurricular activities have you done?\nAny experience of work?"}, {"date": "1 May 2021", "title": "Math Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Tested on important math concepts that would be asked at a college level. Gave sample problems to be solved during the interview that were quite easy with more than enough time to solve them.", "Interview Questions": "What are the steps to derive a math equation? "}], [{"date": "10 Oct 2022", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Feb 2021", "Interview Descriptions": "Asked how you see yourself in the role and the social sensitivity questions. You must give examples about how you would be able to handle the position as a student and manage your schedule as well.", "Interview Questions": "Do you know what the fishbowl affect is?"}, {"date": "30 Oct 2021", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cal Poly Pomona (Los Angeles, CA) in Jan 2021", "Interview Descriptions": "It was an easy interview with basic questions about yourself. They asked questions like why are you interested in this research and what can you do to help. They also asked what roles would you prefer for example data entry. They also ask what revelent  work experience do you have for this role.", "Interview Questions": "What role would you like"}, {"date": "23 Dec 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Asked to teach in front of 3 professor for about 15 minutes. You can pick one topic to teach from a list of topics and have about a week to prepare.", "Interview Questions": "How do you promote diversity in the classroom?"}, {"date": "20 Oct 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona", "Interview Descriptions": "My interview was a five-person panel that consisted of people that held my position, the supervisor, and another colleague. It began with a presentation of about 10 to 15 minutes followed by approximately 30 minutes of interview questions.", "Interview Questions": "Tell us about a time you handled conflict."}, {"date": "13 Jul 2022", "title": "Tutor At Maximizing Engineering Potential Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cal Poly Pomona (Pomona, CA) in Jul 2020", "Interview Descriptions": "Just ask about previous tutoring experience at college level as well as some course material that were planning to tutor. Especially Electrical engineering course. Just need good grade in classes that were planning to tutor.", "Interview Questions": "What is your pervious experience with tutoring?"}, {"date": "29 Feb 2020", "title": "Operation Attendant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "It is short and easy since it is a school job and they do not need you have experience to work here. The waiting time for the interview is like a semester long.", "Interview Questions": "how can you fit in the team"}, {"date": "21 Feb 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Found the job posted online, submitted a resume and cover letter explaining interest for the job to the professor. Then had a one on one interview in their office.  That was basically it.", "Interview Questions": "What is your experience in the area?"}, {"date": "4 Dec 2019", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona", "Interview Descriptions": "you will get an online interview. They will ask you some questions like: 1. why do you want to be a tutor 2. what are your strength 3. do you have any experience 4. they will give you an example question (if you don't know it, just say you do not know it and you can review it later)", "Interview Questions": "1. why do you want to be a tutor 2. what are your strength 3. do you have any experience 4. they will give you an example question (if you don't know it, just say you do not know it and you can review it later)"}, {"date": "6 Sept 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA)", "Interview Descriptions": "I applied online and I was called in for an interview about a week later. It was a 30 minute interview and it was much more casual than I thought it would be. I was offered the job that same day.", "Interview Questions": "What are your strengths?"}, {"date": "4 Feb 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona (Pomona, CA) in Sept 2019", "Interview Descriptions": "I was hired during COVID and the interview took place virtually, I had to interview with five different people at the same time , but everyone was nice and it did not feel intimidating.", "Interview Questions": "How do you manage your time , since you are a student. "}], [{"date": "16 Jul 2021", "title": "Chemistry and Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cal Poly Pomona (Los Angeles, CA) in Aug 2019", "Interview Descriptions": "A group interview consisted of 6 people along with the supervisor and manager where they both created a conversation type of interview and threw popcorn questions at you to start conversations.", "Interview Questions": "What do you think are the skills needed to be a subject tutor?"}, {"date": "16 Nov 2021", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Mar 2019", "Interview Descriptions": "The interview process was very informative and professional. The staff was very friendly and made us feel comfortable to talk about our experiences in the field. They emphasized the importance of school as well as work so they were very flexible with our hours to accommodate busy work/school schedules.", "Interview Questions": "What experiences do you have with customer service?"}, {"date": "11 Apr 2019", "title": "Assistant Professor, Tenure Track Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cal Poly Pomona (Pomona, CA) in Feb 2019", "Interview Descriptions": "Typical academic interview in that it was long process.  Applications for an August start date opened in October of the proceeding year. It took about a month after the application deadline (November 15) to hear from the search committee chair for a phone interview (December 17). The phone interview was with the entire search committee. Questions at this stage were centered on ability to teach and mentor students. Within a week of the phone interview (December 21), I was notified that I received a campus visit. The campus interview was scheduled for January 29 & 30. I did not receive the itinerary for the visit until a week before the interview. The campus interview lasted a day and a half. It included: breakfast with the search committee, tour of facilities, search committee interview, job talk presentation, teaching demo, meeting with department students, dinner with the chairs, interview with the dean, and interview with the department chair. There was also some down time for an unguided tour of the campus. They provided guidelines for the teaching demo, but I was able to select the topic. I was offered the position a month after my campus interview (February 25). The department chair scheduled a call with me and verbally offered the position and the starting salary. They asked for my start-up request and other negotiation terms. Salary was non-negotiable. I was able to negotiate $30,000 for start up funds (that must be spent within the first two years) and service credit toward tenure. Teaching load was non-negotiable as all new hires have half a teaching load in the first two years. Moving expenses were also non-negotiable since I lived within 50 miles of the campus. My spouse was not looking for a job, so I did not request a partner hire. The chair collected my request and acted as the middle-man for negotiations with the dean. After the offer was approved, the University needed official copies of graduate transcripts before sending out the offer letter for a signature. This last part in the hiring process took several months. The department chair was very responsive throughout the entire process. \n\n**WARNING** CPP is a beautiful, huge, and hilly campus. Expect to walk about 5 miles up and down hill during the campus interview.", "Interview Questions": "What classes would you like to teach?"}, {"date": "20 Dec 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cal Poly Pomona (Pomona, CA) in Feb 2019", "Interview Descriptions": "No interview conducted, but having a high GPA is definite decision criteria. Positive professor recommendations are also a plus and can help secure the position. External club involvement also helps--they want to see you as a successful student.", "Interview Questions": "No interview conducted, but GPA is deciding criteria"}, {"date": "29 Jan 2019", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "You fill out a form with interview questions. Then you submit it to the professor that you applied with and they will tell you if you got in or not.", "Interview Questions": "How do you know the professor"}, {"date": "28 Jan 2022", "title": "Social Justice Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Jan 2019", "Interview Descriptions": "One interview with center coordinator, very easy and straight forward. I submitted my resume and application, was notified about an interview, and then was emailed that I got the role.", "Interview Questions": "What are you most passionate about in social justice?"}, {"date": "21 Apr 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Cal Poly Pomona in Jan 2019", "Interview Descriptions": "Simple, and straightforward. They test you for relevant skills and a little on your character.  At the library, it'll either be your customer service skills, or your hand-eye coordination/ability to follow instructions depending on where you apply.", "Interview Questions": "What hands-on activity do you do that showcases your skills?"}, {"date": "9 Dec 2018", "title": "Assistant Professor, Chemistry Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Cal Poly Pomona (New York, NY)", "Interview Descriptions": "Very short phone interview. No real introductions on their end. Pretty standard questions on their teacher/scholar model. Whole thing felt rushed and when they allowed me to ask questions they seemed disinterested in responding. Not everyone could be there for the call (not video) so it was recorded.", "Interview Questions": "How will you work with a diverse population?"}, {"date": "29 Mar 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Cal Poly Pomona (Chicago, IL) in Aug 2018", "Interview Descriptions": "There were multiple rounds to the faculty interview process:\r\n- Application submission\r\n- Initial screening (in person)\r\n- Final interview (one of three finalists)\r\n\r\nNote that this process overall was slower than other schools due to the level of paperwork and other approvals required at CPP/CSUs.", "Interview Questions": "- My teaching philosophy and how this extended to my classroom experience."}, {"date": "26 Feb 2019", "title": "Member Services Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Jul 2018", "Interview Descriptions": "Very straightforward interview. I sat down with the two MSA Supervisors and the MSA coordinator and they asked very stereotypical interview questions. Very easy and relaxed, the entire interview lasted about 10-15 minutes. Smile and be high energy during the interview", "Interview Questions": "What qualities make you a good fit as an MSA"}], [{"date": "13 May 2018", "title": "Carls Junior Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona", "Interview Descriptions": "The interview was held in the center of the dining area (where the subway and Qdoba is located) which was awkward and difficult to hear. It was also a group interview with other candidates which was unprofessional.", "Interview Questions": "Why do you want to work here if its not related to your major? I am having a hard time related the two and why would even benefit from a job. "}, {"date": "22 Sept 2021", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Mar 2018", "Interview Descriptions": "Had a 1 on 1 interview with the lead of the department. The interviewer was very straightforward and reasonable with their questions but also gave positive feedback and what I should focus on in an interview with future employers.", "Interview Questions": "Do you know what a MAC address is?"}, {"date": "5 Aug 2019", "title": "Graphic Artist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Aug 2017", "Interview Descriptions": "walk through the portfolio, favorite project, what I would change, what classes I have taken, why did I apply, meet marketing manager and one other designer, 15-20 minute design test,", "Interview Questions": "favorite portfolio piece?"}, {"date": "25 Apr 2017", "title": "Academic Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona (Pomona, CA)", "Interview Descriptions": "The interview was a typical all-day academic interview. Included 2 presentations, lunch and a tour. \r\n\r\nThe worst part is they never contacted me to tell me th position was filled and when I emailed to follow up I got no reply. I found out it had been filled by looking on LinkedIn.", "Interview Questions": "What evidence would you provide to show the value of this department?"}, {"date": "6 Apr 2017", "title": "Teaching Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA)", "Interview Descriptions": "Very quick and casual, The Department Chair sits you down and you have a casual conversation about the expectations about the job. They then asked why I wanted to teach and once done they said I was good to go and I would need to take a certain Bio Teaching Course before I could start teaching.", "Interview Questions": "Why do you want to teach?"}, {"date": "11 Oct 2018", "title": "Stack Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona in Feb 2017", "Interview Descriptions": "It was a very brief interview\r\n-Explained job requirements, duties, and pay rate\r\n-Made sure I was a trustworthy employee because the job is very independent \r\n-Very easy conversation about my past experience!", "Interview Questions": "There was no difficult questions"}, {"date": "30 Jan 2018", "title": "Instructional Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Dec 2016", "Interview Descriptions": "I was a student of a professor who had many students and not many TAs to help him grade. I was asked by him to be a TA for him. I worked as his TA for 1 year and worked with another professor as her TA for over 1 year. There wasn't really an interview for either professor because they both knew me well enough to give me the job without an interview.", "Interview Questions": "What do you enjoy about what your education has done for you so far?\r\nHow much time and effort are you willing to put towards this job? \r\nAre you willing to provide time for students to contact with you to work on projects outside of school?"}, {"date": "4 Oct 2020", "title": "Outreach Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona (Pomona, CA) in Sept 2016", "Interview Descriptions": "Quick. Simple questions on your academic career. Classes you are taking. Overall academic goals. Extracurricular activities and community involvement. Position also does clerical office duties like helping out in the admissions office and such.", "Interview Questions": "Personality questions and situational questions."}, {"date": "16 Jun 2017", "title": "Caller Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona (Pomona, CA) in Jul 2016", "Interview Descriptions": "Gauges more on how well you can sell, and how well you can talk. It also shows what you can do on the fly. It was a pretty easy process of getting into it but once you get in it is very hard.", "Interview Questions": "how will you sell this product given."}, {"date": "18 Jun 2018", "title": "Associate Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Jul 2016", "Interview Descriptions": "Two people interviewing me asking me about my experience and scenarios. Asked me how I would address different situations and how my previous experience will prepare me for this job.", "Interview Questions": "How would you address a problem with a student"}], [{"date": "19 Oct 2016", "title": "Assistant Support Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Cal Poly Pomona (Pomona, CA) in Jun 2016", "Interview Descriptions": "Straight forward interview process and questions are mostly hypotheticals. Received three separate calls for different ASC positions. All three positions were for different departments of the University. In each of all the interviews, the Dean of the Department sat in for the interview which does not support them to begin with. Coming from a major So-Cal University I don't understand where the Cal POly Deans find the time to sit in on an insignificant staff position. Cal Poly Pomona seems to be very nepotistic in hiring other Cal Poly/ CSU grads for staff positions while they fill their Faculty/ Administration with UC and Ivy grads. Makes sense... Save money on the staff while filling the pockets of Faculty... \r\n\r\nBut I digress... The process takes forever! At least 3-4 weeks before getting the phone interview, another 3-4 weeks for the actual interview and 8 weeks for the offer (for 1/3 positions). I assume they offered the position to someone else and it did not work out. The questions for staff positions are simple as long as you use the STAR method. The interviews were a pleasure and had a great balance between being personal and professional.\r\n\r\nThe negative for Cal Poly Pomona is how long the process takes and how unprofessional the staff is with regards to follow-up. I mean 16 weeks for basically an assistant position. I have heard from 1/3  positions and I believe I will not hear back from the other 2. When you go through 4-5 hour multi-day interviews and become a finalist, you hope that they would at least take the time to email you to let you know what the result was. Don't waste your time following up to see where the process is, they will respond with absolute silence. \r\n\r\nBasically got offered another similar position in another So-Cal University paid 1.5x more than what they would have offered. Try your luck somewhere else. I'm just sad, cause I really wanted to get a feel for Cal Poly as I was looking into a masters program they offer. I won't even waste my time on applying for that program now too.", "Interview Questions": "Can you give us an example of a difficult interpersonal conflict in the workplace and how did you resolve it?"}, {"date": "21 Jun 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Cal Poly Pomona (Pomona, CA) in May 2016", "Interview Descriptions": "This was a typical academic interview. It is non-stop for 12 hours (literally). There were meetings with everyone on the committee, and a presentation was given to a number of faculty and students. Everyone was super friendly.", "Interview Questions": "How do you see yourself in 10 years?"}, {"date": "11 Apr 2018", "title": "Student Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Apr 2016", "Interview Descriptions": "Generally pretty formal, about 30 minutes to an hour. There was a phone interview firts, then a 1 on 1, and finally we met with more people from that department.", "Interview Questions": "They asked about past experience, and software knowledge."}, {"date": "22 Sept 2017", "title": "GRE Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Cal Poly Pomona (Pomona, CA) in Mar 2016", "Interview Descriptions": "Note: I would recommend applying at the end of the quarter since there is a decently high turnover rate due to graduation, student finding internships elsewhere, etc. \r\n\r\nLike any other part time job interview.  They will ask to give an intro about yourself followed by your work history and then finally a situational question.", "Interview Questions": "If you were stuck on a island, what item would you bring with you and why."}, {"date": "23 Sept 2019", "title": "Business Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cal Poly Pomona (Pomona, CA) in Nov 2015", "Interview Descriptions": "it is pretty stnadard . i have two people interviewing me and aksed me about 5 questions. At the end, I was able to ask them some questions I had.", "Interview Questions": "Tell me about yourself"}, {"date": "22 Oct 2015", "title": "Assistant Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Cal Poly Pomona in Oct 2015", "Interview Descriptions": "Phone interview for an assistant coordinator position that mostly came off as half behind the scenes logistics/event planning and half on stage presentations, customer facing role. They described the position, but didn't really talk about themselves or the department and then just jumped into the interview. Was surprised I even got an interview because a Masters Degree was under their preferred qualifications. That could be why I wasn't selected to move forward. The whole process took about a little over a month.", "Interview Questions": "How do you like to be challenged?"}, {"date": "6 Sept 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Cal Poly Pomona (Pomona, CA) in Oct 2015", "Interview Descriptions": "The interview process took about 3 weeks. Make sure you read the mission statement and know the definition of the work \" integrity\". I had an office visit and a scenario paragraph that I had only one day to respond to.  The staff was nice and willing to answer all the questions I had. The office is really quiet and you are required to work independently and discretely.", "Interview Questions": "Tell me about our self."}, {"date": "25 Jul 2015", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Cal Poly Pomona", "Interview Descriptions": "You apply online about halfway through the academic year to secure a position for the following academic year. The interview process is fairly streamlined; you pick a time slot for an interview which lasts about an hour. A the time it was a 2:1 person interview with the possibility of several other candidates being interviewed around you (there are many FDA positions to fill).\r\n\r\nSeveral weeks later you'll receive an email on whether or not you got the position and further instructions if you did. You're obligated to live on campus for the duration of the academic year and participate in the Welcome Week Program for two weeks leading to the start of classes.", "Interview Questions": "You may need to take disciplinary action towards someone you consider a friend. How would you handle this sort of situation?"}, {"date": "14 Dec 2015", "title": "Advisor Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cal Poly Pomona (Pomona, CA) in Jun 2015", "Interview Descriptions": "The interview was a panel with 3 advisors. The main advisor in charge of the summer program was Leon. First they asked a series of questions to get to know you. Then they asked you to perform tasks on the computer that were pertinent to the job. Then they asked if you had any questions for them. It was a typical interview process. My advice to you is to really build a strong connection with whoever you are talking to. They like to be interactive and engage in a conversation rather than ask and answer.", "Interview Questions": "What are you weaknesses?"}, {"date": "18 Feb 2016", "title": "Community Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona (Pomona, CA) in Jun 2015", "Interview Descriptions": "My initial interview was via skype because I was not in the region at the time.  Very straight forward with the questions...nothing too challenging because quite frankly the vacancy was for a position that I had 4 years of experience already doing.  It felt like more of a confirmation of whether or not I was the real deal or just someone trying to inflate my skills and abilities.  The in-person interview was similar...everyone was quite friendly and straight forward.  At that point I think it was more of a final confirmation on whether or not my social skills would be a good match.  My interview might have been different if I didn't have much experience in the field.", "Interview Questions": "What is my experience with writing official documents and agreements?"}], [{"date": "12 May 2017", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cal Poly Pomona (Pomona, CA) in Mar 2015", "Interview Descriptions": "You went through a five session group training program, then you were interviewed on an individual level.  From there, they submitted offer letter to their first picks.  If anyone from the first drafts elected to reject the offer, those from the alternate pool were given a shot.", "Interview Questions": "What would you consider to be your biggest area for improvement."}, {"date": "18 Jan 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Cal Poly Pomona", "Interview Descriptions": "Tenure track faculty positions require a Ph.D. The interview process for all faculty (regardless of university) is a long process. Allocated positions are selected the year before the search. The search is a manual process requiring letter of application, full vitae, reference letters, and official transcript. Candidates are selected by a faculty committee that prescreens for complete files, fit with program, and multiple interviews.", "Interview Questions": "How would you go about teaching complex/technical subjects for students that are anxious about dealing with these issues?"}, {"date": "6 Feb 2017", "title": "LO Service Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Sept 2014", "Interview Descriptions": "I just walked in to Los Olivos after applying online and handed them my schedule and resume. They then asked if I wanted to work certain hours and briefly described what they would have me do.", "Interview Questions": "What is your availability like?"}, {"date": "22 Dec 2016", "title": "Alternate Media Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Cal Poly Pomona (New York, NY) in Sept 2014", "Interview Descriptions": "Pretty standard interview process, mainly concerned with why I wanted to work at the disability center. Interview took less than 40 minutes found out on the spot that I got the job.", "Interview Questions": "Have you ever had to work with people with disabilities? If so what happened?\r\n"}, {"date": "27 Jun 2015", "title": "LRC Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Cal Poly Pomona (Pomona, CA) in Jul 2014", "Interview Descriptions": "It was pretty easy. I showed up dressed nicely. The interview was 1 on 1. I highly recommend you have previous tutoring experience for this job, but it is not required.", "Interview Questions": "Do you have previous tutoring experience?"}, {"date": "2 May 2014", "title": "Garder Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cal Poly Pomona", "Interview Descriptions": "Basic programming questions", "Interview Questions": "N/A"}, {"date": "20 Jul 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Cal Poly Pomona in May 2014", "Interview Descriptions": "Sent in resume and recommendation letters, waited maybe 1 week before they scheduled an interview. They have plenty of available time for you to choose from. The interview took about 20 minutes. The atmosphere was very casual and friendly. The committee includes three professors. They have a lot of people to interview people, but they will pick some three people to interview you.", "Interview Questions": "Present a short 10-minute lecture. Why do you want this job? What would you say if a student asks you \"why do we have to know this?\""}, {"date": "20 Apr 2014", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cal Poly Pomona", "Interview Descriptions": "Describe any experience you have related to this position.", "Interview Questions": "N/A"}, {"date": "28 Sept 2015", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Cal Poly Pomona in Mar 2014", "Interview Descriptions": "No interview process - all that was required was my resume and acceptance of the position. Everything else was done over email. They sent out an email asking for a web developer to develop the department site. I responded with my resume and received the acceptance the next day.", "Interview Questions": "What was your work experience?"}, {"date": "1 Sept 2015", "title": "Learning Management Systems Assistant/Instructional Technology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Oct 2013", "Interview Descriptions": "I applied online at BroncoConnection, and was called about a week later to come in for an interview a week after that.  The interview process was very relaxed, with two people in the interview: the person who would be my supervisor, and the director of the department.  They asked me simple questions about my knowledge of IT and what my past experience was and how it could relate.  They really seemed to appreciate experience that spoke to my responsibilities from the past.", "Interview Questions": "What experience do you have in assisting customers and coworkers with technology?"}], [{"date": "9 Oct 2015", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Oct 2013", "Interview Descriptions": "I applied online through the BroncoConnection website then I was called and they asked some questions about when I would graduate etc. After that, I had only one interview and it was a group interview. We had to talk in front of everyone about our experience and what skills we brought.", "Interview Questions": "What experience do you bring?"}, {"date": "11 Feb 2014", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Sept 2013", "Interview Descriptions": "Referral; Interview was easy and straightforward. No questions that were surprising.", "Interview Questions": "N/A"}, {"date": "13 Sept 2017", "title": "Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Cal Poly Pomona in Aug 2013", "Interview Descriptions": "Apply online, drop off resume/ say hello to the manager, and they scheduled a quick interview for that week. The interview itself was very casual and easy. It maybe took 10 minutes tops.", "Interview Questions": "Why do you want to work here"}, {"date": "15 Jan 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Jun 2013", "Interview Descriptions": "Began with a quick phone interview.  Basic questions were asked and if passed, you moved onto an interview.  Talked to two separate supervisors on interviewing as a temporary assistant in helping international student camps.  Interviews primarily consisted of personality questions,in where being very sociable and talkative is a huge plus.  Response after the interview was very prompt.", "Interview Questions": "Do you have any experience in working with international students?"}, {"date": "11 Aug 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cal Poly Pomona (Cal Poly University, CA) in Jun 2013", "Interview Descriptions": "I applied online via BroncoConnection and was contacted by my employer through email to set a date to meet. I had a one on one interview for less than 15 minutes.", "Interview Questions": "Why are you qualified for this position?"}, {"date": "6 Mar 2013", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cal Poly Pomona", "Interview Descriptions": "Apply at Bronco Connection, and then if they like your resume, they will ask for a phone interview to see how your communication skills over the phone.  After that, there is a in-person interview, and they just ask you random questions about your technical skills.", "Interview Questions": "When is the last time you ever felt that you were given a task and you didnt know what to do?  How did you go around it? And what happen in the end?"}, {"date": "8 Apr 2015", "title": "LRC Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Cal Poly Pomona (Pomona, CA) in Sept 2012", "Interview Descriptions": "Wasn't even really an interview, they hired based on transcripts and the \"interview\" was just giving us some information. I showed up in jeans and a t-shirt and they didn't care.", "Interview Questions": "Are you willing to take this job?"}, {"date": "6 Aug 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Aug 2012", "Interview Descriptions": "The interview process is done by a manager of the unit and sometimes with their boss as well, when I first applied it was the assistant manager and Manager who did the interview. Other locations depending on the time of year as well will do group interviews because the employee turnover rate is high due to the nature of hiring students.", "Interview Questions": "Why do you want to work for us?\r\nWhat do you expect to gain from working from us?\r\nTell me a time where you had to deal with a difficult situation?\r\nTell us about yourself."}, {"date": "31 May 2016", "title": "Community Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Feb 2012", "Interview Descriptions": "Two part interview process in person interviews with panels. They have a panel consisting of different employees of the department and they each ask you different questions. You are in a room with about four other possible candidates for the same position. It is difficult to not be repeatitive since all the candidates get asked the same questions.", "Interview Questions": "If I knew their involvement in the campy community"}, {"date": "11 Apr 2013", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Cal Poly Pomona (Pomona, CA) in Oct 2011", "Interview Descriptions": "Submitted resume through university's website. Received an email saying they were interested and went in for the interview. Very basic, simple interview.", "Interview Questions": "Nothing too difficult. Very basic and general. Asked about my experience referencing off of what I put on my resume."}], [{"date": "17 Jul 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Cal Poly Pomona (Pomona, CA) in Nov 2010", "Interview Descriptions": "i was hired without any formal interview, even though i was hired as an hourly worker i still found it to be a little off.", "Interview Questions": "N/A"}, {"date": "23 Mar 2010", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Cal Poly Pomona (Pomona, CA) in Oct 2008", "Interview Descriptions": "Just discussed previous teaching exterince with the chair", "Interview Questions": "What classes have you taught in the past"}, {"date": "21 Sept 2010", "title": "Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Mar 2008", "Interview Descriptions": "First they will call you to see how you sound on the phone as well as if you can come up with answers on the fly. They will ask you why is it important that someone donate to Cal Poly Pomona? Make sure that you sound professional as well as come up with good reasons why someone should donate.", "Interview Questions": "Why should someone donate to Cal Poly Pomona if they have had a bad college experience?"}, {"date": "9 Aug 2010", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Cal Poly Pomona (Pomona, CA) in Feb 2008", "Interview Descriptions": "It was a formal interview and was very straightforward. There was an obvious sense of happiness in the room and people really enjoyed their jobs. There was an interview and then they were very prompt about giving feedback and follow up. I had a good interview and made a strong impression by being friendly. I was told that is why I was offered the job!", "Interview Questions": "Where do you see yourself in 5 years?"}]]