[[{"date": "13 May 2023", "title": "Burger Flipper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities (Le Flon)", "Interview Descriptions": "Téléphone puis entretien avec un manager. Tout s'est bien passé. Tour rapide des cuisines puis nous avons discuté des horaires et du salaires offert par l'entreprise et j'ai été engagé", "Interview Questions": "Qurlles sont vos perspective d'évolution"}, {"date": "2 May 2023", "title": "Database Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ronald McDonald House Charities (San Diego, CA)", "Interview Descriptions": "Did a phone interview and then did a one on one interview. During the interview they ask you questions about your experience and why you would be a good candidate. At the end the make you do a proof reading test. They let you know in 2 weeks whether you got the job or not.", "Interview Questions": "What do you see in a work environment?"}, {"date": "6 Jun 2023", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities (Pittsburgh, PA) in May 2023", "Interview Descriptions": "Received an email to schedule a phone interview and then had the phone call with the Development Director, very professional and wonderful to speak with. During the interview she gave a summary of the job position and the mission of the company.", "Interview Questions": "Past experience grant writing and researching opportunities for the organization."}, {"date": "3 Apr 2023", "title": "Cashier Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ronald McDonald House Charities (Miami, FL)", "Interview Descriptions": "Just a standard interview process that I considered to me quite easy with all things considered. Would definitely not recommend this process however, as it was time consuming for any student looking for a good employment opportunity to make a little extra money", "Interview Questions": "It was easy to me"}, {"date": "25 Mar 2023", "title": "Crew Member Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Intwrview was rafts if you’d like food go here you get lunch for free online at home they like to eat to you to to you go there everyday don’t be lazy go there for for food free everyday", "Interview Questions": "Do you eat McDonald’s on a daily?"}, {"date": "23 Mar 2023", "title": "Director of Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Phone interview with standard questions about background. A week later had an hour interview with the executive staff. The interview ended with a tour of the house. Got a call a day later with a job offer.", "Interview Questions": "How much nonprofit accounting experience do you have?"}, {"date": "18 Jan 2023", "title": "Cajero Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Rápido sencillo , te reúnen con 2 de recursos humanos y te hacen preguntas sobre tu currículum, sobre vos qué haces si tuviste trabajo antes si SOS estudiante , eso lo toman muy en cuenta ya que la mayoría son estudiantes", "Interview Questions": "Sueldo pretendido Dónde vivís Tenés vehículo"}, {"date": "12 Dec 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Formal and professional, definitely prepare and know your stuff for the interview. It is conducted with 3 rounds of increasingly difficult questions. The first is very personal, the second is technical, and the third is about your future goals", "Interview Questions": "What’s is your greatest weakness?"}, {"date": "5 Dec 2022", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "There was one interview and it was more of a casual interview. It lasted 45 minutes. Asked about an experience in the fundraising world that you were most proud of.", "Interview Questions": "Asked about an experience in the fundraising world that you were most proud of. Asked why you wanted to work for them."}, {"date": "31 Oct 2022", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "It was a two person interview panel, both very friendly and i felt instantly at ease. Decision was made fairly quickly as i was informed of the decision within 48 hours.", "Interview Questions": "What do you know about the charity"}], [{"date": "31 Oct 2022", "title": "Prefer Not To Say Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Very long and confusing regarding job expectations , you must meet with multiple people throughout the organization and that can feel overwhelming. Job description may not equate to the role in question", "Interview Questions": "Why did this place stick out to you ?"}, {"date": "9 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Ronald McDonald House Charities in Sept 2022", "Interview Descriptions": "This is a very special non-profit organization and it made sense that the process took two months from start to finish. Because McDonald's is the parent company, the compensation and benefits package were very competitive.", "Interview Questions": "Tell me a little bit about yourself."}, {"date": "30 Aug 2022", "title": "Guest Services Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Send resume in through website. Emailed me a few days later to set up a Skype interview. Had Skype interview with manager, she asked me about 5-7 questions and asked if I knew about what the organization does.", "Interview Questions": "An example where you went above and beyond to help someone in your employment."}, {"date": "25 Aug 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Heard about the volunteer role through a friend, and then applied. Then was brought in for a brief interview and meet with the team and then a tour! Would recommend as it's a great company and charity", "Interview Questions": "Why would you like to volunteer here?"}, {"date": "7 Sept 2022", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ronald McDonald House Charities in May 2022", "Interview Descriptions": "Told to send a resume, heard back 6 weeks later to hear the position had been filled. Position opened up shortly after when the person who accepted backed out, so I was offered an interview finally. Had the interview; waited 3 weeks to hear I didn't get it. Not a great experience.", "Interview Questions": "How would you handle a stressful, sensitive situation like asking a family to leave for not following policies?"}, {"date": "23 Mar 2022", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities in Feb 2022", "Interview Descriptions": "I went through three rounds of interviews, with the first one being on Zoom and the next two being in-person. I was interviewed by the same person for the first two interviews and two additional individuals for the final interview. Communication was timely and very efficient.", "Interview Questions": "The first interview question I received was \"What do you know about Ronald Mc Donald\"\r\nFor my second interview I was given potential problematic scenarios and asked how I would solve them.\r\nIn my third interview I was asked why I want to work for RMHC and also why I felt like I was suited for the position.\r\n"}, {"date": "19 Jul 2022", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Ronald McDonald House Charities in Jan 2022", "Interview Descriptions": "There was one Zoom  interview with the supervisor, another Zoom interview  with the higher manager and then they let me know about their decision pretty quickly,  during the same week of the last interview", "Interview Questions": "Experience with paid social media ads "}, {"date": "26 Mar 2023", "title": "Event Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ronald McDonald House Charities in Jan 2022", "Interview Descriptions": "Quick, direct and ready to find the right person with direct questions but friendly staff and tour of the facility to really see what they’re about. Enjoyed the overall process.", "Interview Questions": "What are some previous events you managed? Describe your role within that event."}, {"date": "21 Feb 2022", "title": "Family Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ronald McDonald House Charities in Nov 2021", "Interview Descriptions": "Thorough and easy interview, feels like a genuine conversation with someone that wants to get to know you. Seems like they want the best for everybody involved. Enjoyable, genuine conversation instead of a robotic interview with cookie cutter questions.", "Interview Questions": "Why would you want to volunteer with us"}, {"date": "30 Dec 2021", "title": "Communications Team Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Ronald McDonald House Charities in Oct 2021", "Interview Descriptions": "A recruiter from Ronald McDonald House messaged me on LinkedIn and provided me with a link to apply to this role. After confirming with her that I was interested, I subsequently applied to the role via provided link, one day later I received an automated rejection. I then forwarded the rejection to her, inquiring on the contradictory message therein. She replied that it was an ATS error and reinstated me in the system. We proceeded to an initial phone screen, and was later emailed that I was moving forward.\r\nFor the amount of good the charity does in the community, the high turnover rate must absolutely come from the top down. Namely, the Senior Manager of Talent development, Meredith Lewando? The aforementioned second round was scheduled for the same week. On the day of the interview, I checked in with Meredith, who was now overseeing the process from the initial recruiter, despite her being copied on the e-mail thread, she was “unaware that an interview was scheduled” she stated “she would check with them team and get back to me by tomorrow”. Two and a half months and five follow-up emails later, there is no second interview, and no response from the organization.", "Interview Questions": "Standard Comms Manager questions/initial screening."}], [{"date": "8 Feb 2022", "title": "House Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Ronald McDonald House Charities (London, England) in Sept 2021", "Interview Descriptions": "Had to do a presentation on my first proposed 6 months as manager (no set questions or criteria). Had a tour of the house and met management. Two rounds of interviewing", "Interview Questions": "As above - presentation was flexible"}, {"date": "22 Jul 2021", "title": "Stagista Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Dopo la telefonata mi hanno detto di andare in sede la settimana dopo.\r\nDopo il colloquio in sede mi dissero che il giorno dopo mi avrebbero ricontattata se il colloquio fosse andato bene. \r\nMi ricontattarono e iniziai a lavorare il martedì successivo", "Interview Questions": "Quali sono le tue attitudini?"}, {"date": "22 Jun 2021", "title": "Community Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Community Engagement Manager.\n\nPhone interview, then a Zoom interview with an additional staff member, then another Zoom interview with several staff members. Fairly thorough with their questions and a lot of back and fourth conversation too", "Interview Questions": "What would you do if you were giving a presentation and there was an awkward silence?"}, {"date": "6 May 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "A phone call, normal questions about project management; the lady was nice but there was no follow-up after the interview and after I reached out she said they discontinued the position. No communication between the interviewer and myself which seemed unprofessional", "Interview Questions": "Why do you want to work at Ronald Mcdonald?"}, {"date": "14 Oct 2021", "title": "Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ronald McDonald House Charities in May 2021", "Interview Descriptions": "The interview process allowed me to learn about the Ronald McDonald house team and I felt I was given opportunities to thoroughly share my skill set. The human resources representative representative was very helpful at keeping me informed throughout the entire process.", "Interview Questions": "Lots of experiential questions and culture fit questions. "}, {"date": "25 Jan 2023", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ronald McDonald House Charities (London, England) in Feb 2021", "Interview Descriptions": "Structured questions are usually. Know the in and out of operations. Fair and to the point and knowledgeable interviewer. Was a bit late because of traffic. However they where willing to re-schedule", "Interview Questions": "Explain dealing with difficult people"}, {"date": "11 Jan 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "They scheduled the interview under COVID guidelines the same day that I applied. The video call lasted about 30 minutes. At the end, they requested more samples. I sent them promptly and followed up twice, but they never replied.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Dec 2022", "title": "Janitor/Cleaner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities (Indianapolis, IN) in Jan 2021", "Interview Descriptions": "It was easy and friendly the people were nice and caring. Place was clean. Right across from the hospital. Very professional but made you feel like family all at the same time.", "Interview Questions": "Why I wanted the job"}, {"date": "5 Apr 2022", "title": "Communications Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ronald McDonald House Charities in Aug 2020", "Interview Descriptions": "After applying online, I received an email to set up an interview over zoom. In the first interview, I met the head of the team. I then was asked to submit some writing samples. In the second interview, I met with another team member. A few days later, I was offered the position.", "Interview Questions": "How do you manage multiple projects and deadlines?"}, {"date": "28 Feb 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "They made it very easy and comfortable for me. The people who interviewed me were very nice and welcoming. It was more of a conversation about my goals and aspirations of the internship versus then just questioning me the whole time.", "Interview Questions": "What do you want to get out of this internship?"}], [{"date": "18 Feb 2021", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Ronald McDonald House Charities (Toronto, ON) in Nov 2019", "Interview Descriptions": "Was called in for an interview with the ED and HR. Overall it was a pleasant experience, however, was not hired. Feedback, when requested, was that I was too \"senior.\" I suspect this meant 1) My salary expectations were too high (even though I disclosed this before the interview or 2) I was older than the ED and so wouldn't be considered. Either way I find this kind of pat feedback unhelpful and not genuine.", "Interview Questions": "What would you do in your first 90 days on the job?"}, {"date": "10 Mar 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ronald McDonald House Charities (Oklahoma City, OK) in Oct 2019", "Interview Descriptions": "I applied to the position and quickly received an e-mail to schedule a phone screen/interview for the Director of Program Operations position. The person I spoke with seemed disinterested in my responses; in fact, she interrupted me in the middle of an answer and told me she would call me back. I was shocked, to say the least. \r\n\r\nI received an invitation for the next round of interviews. When I arrived at the address I was given, I was told I had gone to the wrong location and my interview was supposed to be at a location approximately 20 minutes away. Again, this was the address I received from the staffing agency. I had to wait for my interviewers to meet me at the location I was at, which doubled the time for the interview. \r\n\r\nI then received a request to complete a lengthy personality test, which I did.  I was then told I was one of the final candidates and would need to come in for one more interview, which would be at least 75 minutes. I made time in my schedule to attend the interview and I really enjoyed learning more about the program's history and the potential areas of growth. I was told that regardless of the outcome, I would hear back from them within a week. \r\n\r\nThat was in October 2019 and I never heard another word from them. This interview process left an extremely bad taste in my mouth and, to be honest, I expected more from an organization with such an illustrious history. I will consider this a lesson learned and will share with my peers how I was treated so they will know what to expect if they apply for a position with this organization.", "Interview Questions": "If you were a parent of a child here in the hospital, what would you need from volunteers and staff of the Ronald McDonald House?"}, {"date": "6 Sept 2019", "title": "Marketing & Communications Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2+ months. I interviewed at Ronald McDonald House Charities (New York, NY) in Sept 2019", "Interview Descriptions": "It was a very long interview process for such an entry level position. I had one phone interview and three in person interviews. What infuriated me the absolute most was the final interview where I was blindsided with editing an article and designing a pamphlet which by the way, wasn’t really part of the job description. I had about an hour and a half to do both of this then I was rushed off the computer. I wasn’t upset that I didn’t get the job but how much time they’ve wasted of mine for a very entry level job that was essentially an assistant role to everyone with occasional marketing and I guess now designing.", "Interview Questions": "Why do you want to work for a nonprofit?"}, {"date": "27 Aug 2019", "title": "Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ronald McDonald House Charities (San Diego, CA) in Apr 2019", "Interview Descriptions": "Three interviews. First with direct supervisor, second with peers, third with C level. The communication was severely lacking. Weeks would go by without a word from the hiring manager. The staff was very friendly. The C Level interviews didn't seem to care about this position or who they hired for it.", "Interview Questions": "What are your 10 weakest traits?"}, {"date": "5 Mar 2020", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (Austin, TX) in Mar 2019", "Interview Descriptions": "Very chill process. went over resume and they asked about prior work experience. They asked me what I wanted from the opportunity and what my future plans were. They got back to me in 3 weeks.", "Interview Questions": "What are your future plans?"}, {"date": "2 Mar 2021", "title": "Gift Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities (New Haven, CT) in Mar 2019", "Interview Descriptions": "There were three rounds of interviews in one day, followed by a second day interview with ED. First round by possible colleagues in the team, then by two different set of managers, then by ED.", "Interview Questions": "Questions about experience and transferability of skills. Questions asked about why I want to leave current position."}, {"date": "9 Aug 2019", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Ronald McDonald House Charities (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "Lengthy process leading to interview and with little communication.  The actual interview was casual and more of a meet and greet.  There was a significant lag in their follow up and it was via email despite their only being three candidates that made it to the final interview round.", "Interview Questions": "Tell me more about your experience with capital campaigns."}, {"date": "18 May 2019", "title": "Chef Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ronald McDonald House Charities (London, England) in Jan 2019", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates, and making a hire.23 Feb 2017", "Interview Questions": "N/A"}, {"date": "13 Apr 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities in Jan 2019", "Interview Descriptions": "Easy! Questions related to job description. Asked about long term plans. Job involved long hours, so interviewer wanted to ensure you are ready for the tasks. Interview completed with director. Ended with a tour of the facility.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "27 Jun 2019", "title": "Guest Service Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (San Francisco, CA) in Nov 2018", "Interview Descriptions": "I applied and they emailed me back for an interview within a few days and then hired me on the spot. The interview itself was very easy -- probably because no one wants to work there.", "Interview Questions": "Why do you want to work here"}], [{"date": "12 Sept 2018", "title": "Events & Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (Vancouver, BC) in Aug 2018", "Interview Descriptions": "I submitted my application via email and have two interviews in person. The first interview was with two individuals and the second was a more in-depth/behavioural interview with an individual much higher up.", "Interview Questions": "What are your stress behaviours?"}, {"date": "29 Nov 2017", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Had 3 rounds of interview; Aptitude, Technical and HR\r\nAptitude test which was very easy to crack. Only basic questions were asked.\r\nTechnical round fully deals with marketing questions. But the questions were very intent.\r\nHR round was about personal data and about the work timing.", "Interview Questions": "about yourself"}, {"date": "12 Jul 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities (New York, NY) in Jul 2017", "Interview Descriptions": "I had 2 interviews, a phone screening and an in-person interview. The phone screening was with an intern, and the interview was with a consultant. There was a few emails which were repetitive. The in person interview with the consultant went well, the person was friendly and profesional", "Interview Questions": "How I deal with challenges in the work place"}, {"date": "25 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "It was a very simple interview process. Before the interview, I submitted my cover letter and resume. During the interview, the position was described to me and we discussed my goals for the internship.", "Interview Questions": "Why do you want to intern at RMHC?"}, {"date": "31 May 2017", "title": "Professional Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "The second interview was with the current dept staff and an administrative assistant.  The staff members were kind while the administrative assistant was borderline rude in questioning my professional experience which made me rethink my interest in the opportunity.  I sent a form thank you letter to the Executive Director, but it was the administrative assistant who responded to me to tell me that my skills didn't match the needs of the organization.", "Interview Questions": "Why do you want to work here?  If you were hired what would you do first?"}, {"date": "25 Feb 2019", "title": "Guest Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ronald McDonald House Charities (Valhalla, NY) in Jun 2017", "Interview Descriptions": "Standard interview process.  Questions about past part time job experience and volunteer work. Fairly informal interview process focusing on strengths and weaknesses. Non profit, extracurricular, and volunteer experience  discussed.", "Interview Questions": "What is a past experience that you feel would make you a good fit for this position?"}, {"date": "9 May 2017", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Ronald McDonald House Charities (Red Deer, AB) in May 2017", "Interview Descriptions": "I was called for an interview one hour after I emailed my cover letter and resume.  The interview took place 2 days later with an HR person, the supervisor, and the Coordinator of Family Services.   I received very positive feedback from the supervisor after each answer which helped to give even better answers.", "Interview Questions": "How would you go about your new role in the first 30, 60, and 90 days?"}, {"date": "27 Apr 2017", "title": "Communications Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Very casual and laid back. Seemed like a conversation with friends. It was very easy to talk to all the interviewers in the room. However, they seemed a little unprepared to talk to me.", "Interview Questions": "How would you take risks to grow our social media channels?"}, {"date": "22 Feb 2017", "title": "Marketing Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Phone screen, 1:1 interview, standard interview. \r\nThey took almost two months of \"I'll let you know\", then decided to hire no-one, and to not be surprised if I see the job posting again. Huge waste of time", "Interview Questions": "Describe your background. "}, {"date": "1 Oct 2019", "title": "Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Ronald McDonald House Charities (Sydney) in Feb 2017", "Interview Descriptions": "there are no interview process taken place as it was a volunteer work assisting children in homework after school, therefore there was only an induction, no interview of any sort", "Interview Questions": "N/A"}], [{"date": "14 May 2017", "title": "Custodin Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Ronald McDonald House Charities (Honolulu, HI) in Feb 2017", "Interview Descriptions": "Fairly straight forward.  The manager there along with the person I was going to replace listen to my experiences.  Then I was shown around the premises and got to know more about the facilities and the maintenance worker.", "Interview Questions": "What were your primary duties with your previous job?"}, {"date": "28 Nov 2017", "title": "Guest Service Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Ronald McDonald House Charities (Corpus Christi, TX) in Jan 2017", "Interview Descriptions": "The interview process was with the house manager and the business manager.  I was asked  questions pertaining to myself and the management introduced their position and length of time at the community.  There were several questions asked about in case of emergency and how you can best fit the position.  Be confidently prepared. The Director stepped in during the closing of the interview process to ask what my future goals.", "Interview Questions": "How can you contribute yourself to our 24 hour home?"}, {"date": "29 Apr 2017", "title": "Corporate and Community Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Ronald McDonald House Charities (San Diego, CA) in Jan 2017", "Interview Descriptions": "45 minute phone interview with the Major Gifts Officer followed by 1 hour in person interview a few weeks later with her and the rest of the development team (3 people total). Everyone was really nice and made the interview process comfortable.", "Interview Questions": "Name a time you disagreed with a decision at work and how did you handle it?"}, {"date": "12 Mar 2018", "title": "Sales Associate/Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Ronald McDonald House Charities (San Diego, CA) in Jan 2017", "Interview Descriptions": "interview is actually very casual and it feels like talking to your aunt, and sharing bits of your work life and or student life. They will also ask you what you think about the schedule and if you are working part time in some other workplace too", "Interview Questions": "what is your strength?"}, {"date": "15 Dec 2017", "title": "Relief Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (Phoenix, AZ) in Nov 2016", "Interview Descriptions": "Phone and then in-person interview. Visited the main Phoenix location to be the interview in an office by the director of operations and house manager. It seemed like making a follow up with an email and phone call helped.", "Interview Questions": "How to deal with residents who don't follow our policy."}, {"date": "25 Feb 2019", "title": "PT Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Ronald McDonald House Charities (Indianapolis, IN) in Jun 2016", "Interview Descriptions": "Phone interview, personal meeting and background check required. Met with management and other PT managers to get an understanding of the day-to-day job duties and responsibilities.  The staff was very friendly and welcoming.", "Interview Questions": "What do you know about RMHCCIN?"}, {"date": "29 Oct 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (London, England) in Mar 2016", "Interview Descriptions": "I had 2 interviews. The first interview was lead by Operations Manager and House Manager. It consisted  of with generic questions on my experience and examples of achievements. The second interview included a  presentation on first 6 months plan and the fundraising manager attended also", "Interview Questions": "Why do you want to work for us? "}, {"date": "5 Feb 2018", "title": "Special Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (Milwaukee, WI) in Dec 2015", "Interview Descriptions": "Typical interview, asked why RMCH and what you would contribute, pretty straightforward. The woman I interviewed with was very kind, patient and passionate about her job.  I had a pre-screen phone interview to make sure I was still interested and then had an in-person interview later. I was competing with 3 other candidates and got the job because of my passion for the position and excitement.", "Interview Questions": "Do you have previous non-profit experience?"}, {"date": "22 Mar 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Ronald McDonald House Charities (Memphis, TN) in Oct 2015", "Interview Descriptions": "It was a very basic and straight forward interview.  I met with the woman who I would work under, and we talked for probably twenty to thirty minutes.  We discussed my previous experiences, why I wanted to intern at Ronald McDonald House, and what I hoped to gain from the internship.", "Interview Questions": "What did I want to get out of the internship?"}, {"date": "9 Oct 2015", "title": "Guest Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Ronald McDonald House Charities (Saint Louis, MO) in Aug 2015", "Interview Descriptions": "Interviewed by 3 people. They had questions on a paper and would write down my responses. I had a chance to ask questions. I was told a little about the job but I was not shown around.", "Interview Questions": "What I would do in an emergency"}], [{"date": "21 Feb 2017", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ronald McDonald House Charities (Pensacola, FL) in Aug 2015", "Interview Descriptions": "One 20 minute phone interview, one in person interview with senior level management and then one interview with staff. The phone interview was more informational and the interview with senior level management asked a lot of \"tell me about a time\" questions.", "Interview Questions": "Tell me about a time you had a repport with someone and how you handled it "}, {"date": "24 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Ronald McDonald House Charities (Chicago, IL)", "Interview Descriptions": "It was a one on one interview and the hiring took place about two weeks later. She called me and let me know. It was after they checked my background check that i had heard back.", "Interview Questions": "Why are you interested in the charity"}, {"date": "26 Nov 2014", "title": "Database Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "They were really nice. They called me to come in for an interview. I did the interview and then about 3 weeks later they called and offered me a position. I did not negotiate for a salary. From interview to acceptance time I started working after about 1 month. I think I may have interviewed with two people- the marketing person and the development director.", "Interview Questions": "N/A"}, {"date": "17 Sept 2014", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Setting up the interview was a pleasant process as I received both a phone call and email giving me the details of the interview. The interview itself was with two individuals, one from the development staff and one from HR. The interview was a much more intense situation than for which I was prepared, and the very first question was, \"Tell us the mission of the Ronald McDonald House.\" I was challenged on a lot of my answers and definitely thrown off my game. I would definitely prepare for tough questions about your past experience and be prepared with a lot of examples.", "Interview Questions": "The most difficult questions were follow ups, i.e. if they asked how I would handle interacting with families and I said that I would try to be there for them, they would ask if I would get too involved."}, {"date": "27 Jun 2014", "title": "Manager Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "Three interviews, very long process for each - instead of being the thirty minutes each I was told to expect, they were more like 3 hours each with the waiting time included.", "Interview Questions": "Sell me this invisible pen"}, {"date": "13 Jun 2014", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "two interviews. One with the Executive Director and one with the board president. I was then called and offered the job with the salary. I negotiated the salary only a few $1,000 more.", "Interview Questions": "Sale us on you if you are a good salesman"}, {"date": "14 Nov 2015", "title": "Special Events Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ronald McDonald House Charities (New Hyde Park, NY) in Apr 2014", "Interview Descriptions": "Very laid back and relaxed. Met with Director then entire staff in same day. Everyone was kind at the interview. Should have known it was too good to be true.", "Interview Questions": "Basic questions: how do you handle stress? Can you multitask?"}, {"date": "2 Jun 2013", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ronald McDonald House Charities", "Interview Descriptions": "I brought a resume, but the interviewer (and potential immediate supervisor) had her own copy.\r\nShe spent a lot of time explaining the houses, company, functions, mission, and everyone's position. She also explained the demands of the job and the pay scale.", "Interview Questions": "There really weren't any difficult questions. The interviewer asked me to confirm details on my resume or elaborate on a point or two.\r\nThe interview was supposed to take a half hour, it lasted about an hour."}, {"date": "4 Sept 2017", "title": "Job Coach Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Ronald McDonald House Charities (New York, NY) in Jan 2013", "Interview Descriptions": "Very easy going and pleasant very quick and easy to do very timely for myself. This thirty word minimum is a bit harder than what it was to setup the interview. Which was very easy going.", "Interview Questions": "What I enjoy "}, {"date": "28 Oct 2012", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Ronald McDonald House Charities (Cleveland, OH) in Mar 2011", "Interview Descriptions": "Many questions. How committed are you? Do you like to work in a group? Are you a team player", "Interview Questions": "Can you work by yourself?"}], [{"date": "6 Mar 2012", "title": "Fry Cook Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Ronald McDonald House Charities (East Palo Alto, CA) in Aug 2010", "Interview Descriptions": "Why do you want to work here", "Interview Questions": "Why do you want to work here"}]]