[[{"date": "12 Oct 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Social Finance", "Interview Descriptions": "The interviews themselves were fine. When they were finally set up. Weeks later than expected. It took several more than a month before I was invited for my first interview. Thereafter it was almost 2 months before I heard back. Granted, Covid had just hit so I gave benefit of doubt. But thereafter it was a series of following up, being told to expect feedback or an interview date within a certain time frame, not hearing back within said time frame and it took another month just to get an interview date. After the 2nd interview I didn't hear back for almost 2 months and it was the same back and forth. I felt really disappointed in the process. In the end I had to pull out of the process but felt I had wasted so much time and emotional energy.\r\nThe interviews themselves were fine. Challenging but perfectly fine if you prepared.", "Interview Questions": "Perform a cost-benefit analysis for a project."}, {"date": "13 Jul 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Social Finance", "Interview Descriptions": "Submitted application online, then invited to a first round of interview (telephone), then a second round (case study). There were two interviewers per interview who were friendly and tried to help when I was struggling with a question.", "Interview Questions": "General questions on motivation and interest in the sector\r\nCase study"}, {"date": "4 May 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Social Finance", "Interview Descriptions": "The nice person there. The interview was not so difficult. Smart people and great culture. They are kind and responsible. However, did not get this job in the end. But I still have a positive feeling of this process.", "Interview Questions": "Why you choose this job?"}, {"date": "12 Apr 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Social Finance (London, England) in Feb 2021", "Interview Descriptions": "Met lots of people at the organisation which was a good way to understand the peopel and culture of the organisation. The interviews required a lot of time from the candidates, which I felt wasn't matched by their feedback.", "Interview Questions": "The first round was a simple 4 question interview which was based on my values and experience. The next round was a lot more intense and required a competency interview and a task which in total was 3 and a half hours. I put a lot of effort in, and was disappointed that when I was told I was unsuccessful I wasn't given any feedback. I felt that it wasn't particularly thoughtful or sensitive to jobseekers who should be able to learn something  from the recruitment experience. When I asked for feedback a few weeks later I received data showing my answers compared to the top answers and from what I could see I did really well, so I didn't really learn anything from the experience. It was ironic because in my interview I had talked about the importance of quantitative and qualitative data, and I would have really benefitted from one of the interviewers taking the time just to write a couple of lines about what could have been improved. "}, {"date": "15 Mar 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Social Finance in Feb 2021", "Interview Descriptions": "Stage 1: Phone Interview  (30 minutes)\r\nStage 2: Case Interview (2 Hours) + Competency (30 minutes) \r\nStage 3: Final Interview (didn't get to this stage)\r\n\r\nAbsolutely need to do prep. I prepared for weeks in between each round and was unfortunately unsuccessful. You're interviewed by different people each time which is a shame as it never feels as if Social Finance can build an understanding of you.\r\n\r\nVery long process (with a lot of effort required) so it's disheartening that you don't receive feedback. Moreover, the competency interview is far too short to build any sort of picture of a candidate's capabilities (just 5 questions asked). I suspect they weigh the case interview section particularly high relative to the competency part. It's hard to say as your interviewers are different each time - so who knows what is going on behind the scenes!", "Interview Questions": "Market Sizing/Estimation question in the Phone Interview. Case Interview involved three stages, initial discussion about an issue (breaking it down), then the financial modeling, then some probing questions and presentation.\r\n\r\nCompetency Interview was only 30 minutes long. Question included: can you tell me a time where you did something on a project that you'd now do differently upon reflection."}, {"date": "15 Dec 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Social Finance (London, England) in Sept 2020", "Interview Descriptions": "2x1 phone screen with a brief verbal case, then 2x1 case and fit interview, then 4x1 background deep dive and intense modeling test, then 3x1 final round to identify team match", "Interview Questions": "all the cases were about aspects of social impact bonds -- this may be obvious, but you need to know SIBs inside and out and be able to model them expertly on the fly"}, {"date": "4 Sept 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Social Finance (London, England) in Jan 2020", "Interview Descriptions": "I waited over a month to hear back after passing the CV screen, as well as after each of the rounds. I had to prompt several times before being updated, after not hearing back for ~3 weeks after being told I would hear back the following week . There was no feedback given at the end of the second round. Comms from the internal recruiter / manager of the hiring process were unclear.\r\n\r\nOverall the experience left a very sour taste in my mouth. It takes two minutes to email a candidate a \"sorry for the delay, we are still deciding\" message. It takes five minutes to copy and paste some internal feedback into an email for a candidate. If the company runs its recruitment like this, how bad are its internal processes / comms?", "Interview Questions": "First round was a 30 min video call with a market sizing question and some questions about competencies (e.g. tell me a time when). Make sure you have an example or two of government social policies you agree with.\r\n\r\nSecond round a 30 minute competency interview followed by a ~2.5hr case study which involved a couple of calls, some reading materials and an excel exercise which was fairly straightforward.\r\n\r\nI did not progress to the third round."}, {"date": "19 Jul 2017", "title": "Graduate Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Social Finance (London, England)", "Interview Descriptions": "Stages were as follows:\r\n\r\n1. CV and cover letter submitted\r\n2. Telephone interview with graduate analyst and associate\r\n3. 1.5h case interview w/ graduate analyst and associate followed by 1h interview w/ assistant director\r\n4. 1h interview w/ director and COO", "Interview Questions": "Do you consider yourself to be an entrepreneurial person? \r\nWhat is a challenge that you think you may encounter if you join the firm?"}, {"date": "15 Nov 2018", "title": "Graduate Analyst - International Team Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Social Finance (London, England) in May 2017", "Interview Descriptions": "I was invited for the first stage interview which was over the phone. The two people interviewing me were in a very noisy room and the connection kept breaking up, which made a whole thing a bit more stressful than it could have been. The interview lasted approx. half an hour.", "Interview Questions": "What motivates you to work in International Development?"}, {"date": "22 Aug 2018", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Social Finance (London, England) in Jan 2017", "Interview Descriptions": "Submitted application online.\r\nCompleted a fairly simple Modelling test followed by a model review with two associates.\r\nThen met two directors and had a final interview with the COO. \r\nIn general, the team was very nice, passionate about their work and clearly hard working.  The compensation could be more competitive across all levels and also they operate on a fixed promotion track which didn't seem to reward outperformers in my opinion.", "Interview Questions": "How do you handle the pressure ?"}], [{"date": "26 Jul 2016", "title": "Graduate Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Social Finance (London, England)", "Interview Descriptions": "Had a phone interview with two employees (not HR). The interview lasted 30 minutes on the minute. They seemed stressed and bombarded me with questions. I often got interrupted and didn't get time to complete my answers before next was asked. At the end, I had two minutes to ask my own questions before they had to move on to the next interview.", "Interview Questions": "How could XXX (charity) benefit from an investment?\r\nHow the same charity can develop/improve their 'business model'.\r\nQuestions about SIBs and what difficulties they meet in the investment process.\r\nAbout my passion for social issues, which ones I am most passionate about and why."}]]