[[{"date": "22 Feb 2023", "title": "PhD Researcher Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sanger Institute", "Interview Descriptions": "tedious long winded and almost childish, my expectations were very high given the reputation of the institute however, there are great works being undertaken here on a daily basis, the location is not easy to access", "Interview Questions": "what are you hoping to achieve"}, {"date": "14 Oct 2022", "title": "Leadership Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sanger Institute", "Interview Descriptions": "Happened over a video call with 3 internal people. Included a background discussion, many scenario questions, general chat about expectations for the role. Felt it was quite one sided and biased.", "Interview Questions": "Q. Tell us about implementating a strategy"}, {"date": "25 Aug 2022", "title": "Apprentice Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sanger Institute (Cambridge, England) in Aug 2022", "Interview Descriptions": "Online application form, kind of lengthy, lots of diversity/inclusion questions. After that if you're successful, you go to interview. For me this was with a panel of three people from the team the job is with. Interview was 45 minutes long and they said they would 'move fast' as the degree apprenticeship started in about a month. Ten days later I email, get a quick reply that the panel is still reviewing. Decision came sixteen days after interview, recruitment were very polite although omitted feedback.", "Interview Questions": "What can you tell me about yourself? What are your hobbies? How are you at time management? Can you tell me about a time you dealt with conflict? Can you look at and fix this code? "}, {"date": "20 Apr 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sanger Institute", "Interview Descriptions": "Almost full day; combination 1:1 and small groups; included presentation to department; great experience to learn about group and institute; lot of emphasis put on making sure person right for the group and group right for the person.", "Interview Questions": "What will be main challenge of successful?"}, {"date": "12 Dec 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sanger Institute", "Interview Descriptions": "2 interviews - carried out over zoom. Felt very friendly and clear instructions. Member of HR staff sat in on interviews. Felt very professional. Quick to respond with a decision.", "Interview Questions": "Presentation required for second interview"}, {"date": "3 Sept 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sanger Institute", "Interview Descriptions": "Didn’t even bother to email an outcome let alone call.\r\nAsked to prepare 15 minute presentation answering 10 questions. Interviewer turned up 10 minutes late to interview. Hour long interview. Told I would hear after the weekend but nothing at all 2 weeks later. A lot of wasted effort when you can’t even be bothered to contact a candidate with an outcome.", "Interview Questions": "How do you plan a project?"}, {"date": "30 Aug 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sanger Institute (London, England) in Mar 2021", "Interview Descriptions": "It was a virtual interview. three panel members were there. all the questions were relevent to the job. the questions were easily answerable. it was a very nice experience. Now I am  working at Sanger institute . It is a very nice place to work.", "Interview Questions": "what was your past experience?\nExplain about PCR process.\nLIMS system\nSOP\n\n"}, {"date": "1 Feb 2021", "title": "Advanced Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sanger Institute (Cambridge, England) in Jan 2021", "Interview Descriptions": "Applied online in early December. Invited to interview mid January and interviewed a week after invitation online via Zoom. Interview was conducted by a panel of 3 including the recruiting manager, with questions specific to the role as well as a couple of HR-related questions at the end. Received outcome 3 working days after interview. Very prompt and professional communication with recruiting manager and HR.", "Interview Questions": "Tell us about your research experience, and how does this align to the job description?"}, {"date": "3 Jan 2021", "title": "Bioinformatician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanger Institute", "Interview Descriptions": "Simple, clear and thorough with a focus on relevant skills and publication history. HR were helpful if at times a little slow to respond. Recruitment and interview process was reasonably efficient.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "5 Nov 2020", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanger Institute", "Interview Descriptions": "I had my interview over Zoom with three members of staff. I was required to first give a 10 min presentation on why I was suitable for the role, highlighting my previous research experience (this I prepared in advance). I was then asked a number of questions, some related to the presentation and some competency-based questions. \r\n\r\nThe interviewers were very pleasant and I felt quite at ease. \r\n\r\nSince I completed the interview not long ago, I am not sure if I have received an offer yet, so I selected \"Yes but declined\".", "Interview Questions": "Tell me about how you approached an issue in the lab, how receptive the person/people were to you approaching the issue, and what was the consequence of this. "}], [{"date": "12 Nov 2020", "title": "Bioinformatics Support Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sanger Institute", "Interview Descriptions": "Interviewed by the team leader and an employee of the same position. Very friendly and nice. Asked some basic questions about unix command line and python basic concepts. Explain nicely about the term I don't understand.", "Interview Questions": "Any experience of supporting others with some technical issues"}, {"date": "15 Oct 2020", "title": "Research Assistant - DNA Pipelines Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Sanger Institute", "Interview Descriptions": "Online interview on Zoom with three panelists and each one asked a couple of questions. There were a couple of HR related questions at the end and a chance to ask them any questions you may have about the role.", "Interview Questions": "Can you explain what PCR is and how it functions?  \r\nCan you provide an example of when you had to pay close attention to detail?\r\nWhy do you think you would you be a good candidate for this position?  \r\nTell us about a time you work as a team \r\nDo you know what LIMS is and how it works\r\nHow do you ensure that you get the task done as planned\r\n"}, {"date": "9 Mar 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Sanger Institute (Cambridge, England) in Feb 2020", "Interview Descriptions": "1 hour face to face interview with 3 operation leads. Skill based questions followed with a tour of the laboratory and a surprise lab test. The employers were friendly but questions were very similar.", "Interview Questions": "Give an example of when you had to collect data"}, {"date": "14 Oct 2019", "title": "H R Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sanger Institute (Cambridge, England)", "Interview Descriptions": "Over the phone initial interview, face to face (1:1) for second round. Team were friendly and process was organised and not daunting. Would have been good to meet a wider group of the team in the interview process.", "Interview Questions": "Discuss previous work with Database systems"}, {"date": "7 Oct 2019", "title": "Research Assistant - DNA Pipelines Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sanger Institute (Hinxton, England) in Sept 2019", "Interview Descriptions": "Very pleasant experience at the institute, the panel were very reassuring and easy to talk to. The interview consisted of a variety of  competency based questions from each panel member following HR related questions. This was followed by a practical assessment in which I had to calculate and perform a few DNA dilutions within a certain time frame, and finally a tour of the laboratory.", "Interview Questions": "Why do you think you would you be a good candidate for this position?"}, {"date": "19 Jan 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sanger Institute (Saffron Walden, England) in Jul 2019", "Interview Descriptions": "I applied for the role of Reseach Assistant in the DNA sequencing department of the Sanger Institute in Cambridge, England. The interview consisted of a 30-40 minute verbal interview with three panelists, followed by a simple, practical exercise involving basic laboratory techniques. I received a rejection several weeks later, though was quite possibly due to my own error. I was too anxious about the interview due to it being my first interview after graduating from university.", "Interview Questions": "Can you tell me how Illumina sequencing works?"}, {"date": "11 Apr 2019", "title": "Advanced Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sanger Institute (Hinxton, England) in Mar 2019", "Interview Descriptions": "I received an invitation two weeks before the interview. The interview had a group or panel type (I was interviewed by 3 specialists). At first, I was asked to tell about my experience. And then they asked about my soft skills. The interview lasted 60 minutes. After the interview, I met with the laboratory staff and they gave me a tour of the laboratory. All the staff are very friendly and interesting.", "Interview Questions": "Tell us about your experience?"}, {"date": "31 Jan 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sanger Institute (Hinxton, England) in Jan 2019", "Interview Descriptions": "I applied online (deadline 3 December). A month later I was invited for a series of interviews at Sanger. I had 3 single interviews with 3 PIs each lasting 30 minutes and one panel interview with 3 PIs that lasts 30 minutes as well.  The single interviews depend on the PI, but in general they are about your interviews and credentials and they want to get a sense of what your interests are. The panel interviews goes more deeply into your current or recent research experience and are in general harder than the single interviews.", "Interview Questions": "-Tell us about yourself.\r\n-Why do you you want to do a PhD at Sanger?\r\n-Tell me about a technology that you think was important in the last 10 years.\r\n-Tell me about a technology you think will have a strong impact in the next 10 years.\r\n-What is your background?\r\n-Tell us about a research paper that you really like and why?\r\n-Very detailed and specific questions about my latest research experience."}, {"date": "11 Sept 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanger Institute", "Interview Descriptions": "Following my online application, I was called in for interview. There was only one interview where four interviewers interviewed me at the same time.  The interview lasted for about 30 - 45 min.", "Interview Questions": "Give an overview of your work experience"}, {"date": "8 Oct 2018", "title": "Advanced Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanger Institute (Hinxton, England) in Sept 2018", "Interview Descriptions": "I applied online and was invited to interview at the institute with a three member panel, one of which was the group lead for the advertised position. Everyone was very welcoming and the overall experience was very positive. After not receiving an offer, I did ask for feedback and the lead was more than accommodating to respond. Unfortunately they did not believe I had enough experience to work autonomously from day 1, and this is fair because I also agree that I would need some training to undertake the position they advertised. Overall, it was good experience and something that has definitely helped in my future applications.", "Interview Questions": "What technical experience do you have that makes you suitable for this role"}], [{"date": "15 Jun 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sanger Institute", "Interview Descriptions": "3 individual interviews with prospective PIs and one group interview. Thorough and challenging but interesting. The interviewers definitely test your knowledge and your passion for the subject. Even though the interview process is quite exhausting, it is always conducted with respect and enthusiasm.", "Interview Questions": "If you had a large grant and 3 post docs working for you, what dream project would you pursue?"}, {"date": "8 Jun 2018", "title": "Computational Biologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sanger Institute (Cambridge, England) in Apr 2017", "Interview Descriptions": "Panel interview with 3 members of staff, individual interview with another, then meeting of the team I would be working with. Panel interview involved 20 minute presentation of my work.", "Interview Questions": "What are some challenges you encountered during your work and how did you deal with these?"}, {"date": "17 Apr 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sanger Institute (Cambridge, England) in Apr 2017", "Interview Descriptions": "The job description had lots of spelling mistakes and the name of the manager was not given, which I felt was a great oversight.\r\n\r\nA personality test is used.  This is has real value for use in screening out extremes eg narcissistic behaviour and was pleasing to see.  For anything more subtle, it was  like a horoscope ie true however you filled it in.  I filled it in honestly and it came out looking as if the test was unreliable.  I imagine it would be easy to look at the job description and fill it in according to the desired traits.  The time taken to do the test is given, so if you have lots of interruptions it will look as if you took a long time to complete the test.\r\n\r\nThe face of the person interviewing me, visibly fell when she saw me.  I had brushed and polished myself up, so it was probably my gender or age that was  the problem.\r\n\r\ni imagine that the job went to an internal candidate.  This wasted considerable time and effort on external interviewees' part which was partly made up for by travelling expenses being paid.", "Interview Questions": "Many questions about my current position; not many about the position being applied for.  This means if you are looking at taking the next step up, there are few opportunities to show you can do the job."}, {"date": "14 Dec 2016", "title": "Corporate Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sanger Institute (Cambridge, England) in Dec 2016", "Interview Descriptions": "Applied online, was sent an advanced interview date, psychometric test and title for presentation.  Attended a one hour panel interview with pre-prepared presentation and competency questions. This was followed by a further panel meeting with HR to go through psychometric test. A follow up 2nd interview was then quickly arranged via e:mail the next day, having told me they'd only keep me waiting a few days, they were even more efficient.", "Interview Questions": "Typical competency......tell me about a time, or give me an example of - these are based on your psychometric test which guides them where to probe. "}, {"date": "30 Nov 2016", "title": "Advanced Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sanger Institute (Hinxton, England) in Nov 2016", "Interview Descriptions": "it was a 90 minute interview. First interviewed by 3 people (1 HR, and 2 Senior scientists) lasted for 40 minutes. Then the senior head interviewed for 10 minutes 1:1. Then lab tour and introduced to other members of lab who took for coffee and chat and send off.", "Interview Questions": "1) Tell me about your research experiences? \r\n2) How do you pass information about your work to colleagues?\r\n3) where do you see yourself 5 years from now?\r\n4) what is the most effective experiment or research work you have done? \r\n5) what motivates you?\r\n6) how do you trouble shoot? \r\n7) and asked to explain the techniques in the job description"}, {"date": "26 Sept 2016", "title": "Senior Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sanger Institute (Cambridge, England) in Sept 2016", "Interview Descriptions": "I applied weeks before the deadline and received an invitation for an interview only 3 days after the deadline date. I could choose my preferred day and timr for the interview from a good number of available slots, which was very nice. There was a panel of 4 senior staff, including the group leader. I had to give a 10 minute presentation on what I could bring to the position. Then, they interviewed me for around 50 minutes and lastly I was shown around the lab and the rest of the campus", "Interview Questions": "What are the main challenges in this field?"}, {"date": "5 Aug 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Sanger Institute (Hinxton, England) in Aug 2016", "Interview Descriptions": "I attended an interview for a Research Assistant position. The interview was scheduled for 90 minutes.\r\n\r\nUpon being seated in the interview room, I was informed that the Group Leader, would not be attending the interview. No reason was provided for her non-attendance. I felt the interview should have been cancelled and rescheduled if the entire selection committee was not able to attend.\r\n\r\nThe interview was poorly structured and poorly organised, as the panel of two had no pre- set questions to ask me regarding the position or the Sanger Institute itself. \r\n\r\nThe interviewer informed me that the position was required for 8 months only. However this was not stated in the job description.  \r\n\r\nNone of the interviewers present were able to answer my questions. Both could not explain the scientific concepts\u007f neither in words nor sentences, even though my question was about something highlighted on their group website. \r\n\r\nThe interviewers did not have a copy of my CV or the job description to hand. No Human Resources staff were present during the interview and no copies of my qualifications or ID were requested.\r\n\r\nThe interview lasted for a total of 25 minutes. The interviewers informed me that I would hear back in one week regarding an outcome. Fifty minutes afterward a recruitment adviser sent an email to say my application will not be progressed. However, when requested, she could not provide any feedback. \r\n\r\nI was offended at the poor and unprofessional interview conduct of the interviewers.\r\n\r\nThe Wellcome Trust Sanger Institute itself looks like Elysium space station. The architecture and landscaping is gorgeous.", "Interview Questions": "Tell me about yourself."}, {"date": "16 Apr 2016", "title": "Courses and Conferences Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sanger Institute (Hinxton, England) in Feb 2016", "Interview Descriptions": "I was asked to prepare 2 proposals for new conferences, in a topic that I don't know. I prepared a solid slide show, they seemed to like me. Interview was 1h + almost 1h informal.", "Interview Questions": "What other conferences would you organise?"}, {"date": "22 Jun 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sanger Institute (Hinxton, England) in Sept 2013", "Interview Descriptions": "Interviewed for two different groups - the process is very different depending on who you are applying to work with. One interview was just an hour with two interviewers with a short presentation and questioning, the other interview was a chat with the PI, followed by a full day involving presenting a seminar and meeting each member of the group individually.", "Interview Questions": "What skills do you have that will add something to the group?"}, {"date": "22 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sanger Institute (Cambridge, England) in May 2012", "Interview Descriptions": "Panel interview based on site with the group leaders and senior lab members that I would be working with. First presented my previous work in a 10 minute presentation, followed by questions about both my previous work and the skills that I could bring to the advertised position. The interview only lasted for about an hour.", "Interview Questions": "Specific questions about the science"}], [{"date": "21 Oct 2015", "title": "Placement Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sanger Institute (Hinxton, England) in Mar 2012", "Interview Descriptions": "Two people interviewed me, both team leaders within the same large research group. We first talked about the nature of the position and my background. They then asked why I had applied and what kind of relevant experience I had to bring to the table. They also asked a few \"text book\" questions about biochemistry to test my general knowledge of the subject. They then told my that they would contact me and let me know in the near future.", "Interview Questions": "Can you tell me about DNA replication?"}, {"date": "8 Dec 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sanger Institute (Hinxton, England) in Jan 2012", "Interview Descriptions": "You are invited for an open day if you are shortlisted. You are chaperoned by a current student and have your interviews spread through the day. You have three one on one interviews with faculty and one panel interview with 3 members of faculty.", "Interview Questions": "Why do you want to do a PhD at the Sanger?"}, {"date": "30 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sanger Institute (Cambridge, England) in Sept 2011", "Interview Descriptions": "A one stage interview held by two interviewers. A fairly conversational interview which put me at ease. As I hadn't had much work experience a lot of the questions were based on the sort of work I had done at University and how they could be applied to the current position. Introductions to the group and a tour of the laboratory and other facilities followed.", "Interview Questions": "What did I know about the group and the company?"}]]