[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "It was a life changing experience... Immense exposure", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Apr 2015", "job_title": "Associate in Noida", "duration": "N/A", "pros": "If you have ideas, you are creative, you are motivated.. you will get exposure and responsibilities you can't even dream of. You get to meet and share/present your ideas to big corporates, big NGOs,  bureaucrats, and even ministers. \r\nCool atmosphere, just as you can expect in a start-up where average age of employees is just 25-26. \r\nVery competitive diverse sets of people, with wide knowledge and good experience.", "cons": "If you are not pro-active, no body will give a damn about you. you will feel left out. \r\nManagement is yet to be structured properly\r\nYou might have to miss a lot of weekends and might have to burn a lot of mid night oil.\r\nMale-Female ratio is too bad. 60:10\r\nLacks experienced employees"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Shameless cheats and completely immature organization. A major red flag for any professional. AVOID AT ALL COSTS", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Jan 2015", "job_title": "Senior Associate in Noida", "duration": "N/A", "pros": "There was a time when they managed to lure in some top talent. Some of them are still here, and the processes set by them are still here. For a fresher, there is some learning from them and those processes. There is some exposure to government and political projects which cannot be gotten as easily.", "cons": "Nearly all the things told to us at the time of interviews and selection have been lies. Complete overstatements of salaries, responsibilities, projects, transparency etc. \r\nThere is no training when we join, just some repetitive self boasting of what they've done in the past. \r\n\"Leaders\" are decided at random, without justification and truly only by a few people. No new-comers, regardless of their caliber or the promises made to them, are elevated to leadership. Micromanagement and miniscule, inconsequential mistakes are pointed out to bury them down\r\nPolicies are made at the whims and fancies of people in these \"leadership\" positions. If they're late to work, the late times are shifted. If they need saturdays off, that happens. I am yet to understand how some of the people have been recognized as the executive level leaders, despite being underqualified, immature, unskilled and having no real talent or experience in management of a company"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Joining this company will likely spell doom for your career if you have any hopes of growing or learning new skills.", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Mar 2015", "job_title": "Associate in Noida", "duration": "N/A", "pros": "I cant really think of any pros of joining this organization. I have heard from several people that at one point of time, people from IITs, IIMs and best universities in USA and UK used to work here, but I only see a freshers from a few IITs right now and people from Tier 2 and Tier 3 colleges.", "cons": "It is like a college dorm where a few underqualified and unskilled people dictate and change rules, job scopes and what not. Till date, I have not been paid my salary on time or been given the kind of work that I was promised. I see my colleagues being bored by mundane work which, frankly, any Class 12 pass can do.\r\n\r\nThe concept of promotions or career growth doesn't exist here. The entrenched club of graduates who currently control the organization, will continue to control it in the foreseeable future.I am yet to see the \"dynamic, young organization that is changing India\" that they advertise and use to attract employees.\r\n\r\nJoin this organization only if you are desperate and have no other options. You arent going to grow at this place and neither are you likely to enjoy your stay here."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I feel cheated and let down after leaving a good job to come here", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jan 2015", "job_title": "Associate in Noida", "duration": "N/A", "pros": "Free coffee is available in the office. There are some intelligent people you get to network with over here. It is a relatively secure job too.", "cons": "Draconian rules about half a day's salary deducted if you are 30 mins late, full day's if you are an hour late. Saturdays are working days unofficially though they are supposed to be holidays. They promise you a certain amount of pay when you join, but only pay you about half of the promised amount every month. There are no major projects for the company and it is in bad financial shape.\r\n\r\nThe management is arrogant and doesn't care about the employees. People are insulted routinely and made to feel as if the organization is doing them a favour by retaining them. The middle management routinely belittles the junior employees and takes all the credit for their work.\r\n\r\nOverall, I would not come to this organization if I were a prospective employee again."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Yet another avatar of Citizens for Accountable Governance", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Dec 2014", "job_title": "Associate in Noida", "duration": "N/A", "pros": "Just as with the previous version of the same organization, some extremely smart people work here, though that is changing as people leave. Be that as it may, the organization still offers people the chance to work with some very intelligent people.", "cons": "The quality of management is very poor, with no sanctity for promises made to employees. Salaries that are promised are not paid, with lower amounts being paid in a delayed manner.  Several vendors and ex-employees are owed large amounts of money by the organization and it doesn't look like they will get paid.\r\n\r\nThe roles are not structured, with people having overlapping responsibilities. This encourages a large amount of infighting and internal politics- thus enabling the top management to have a free-reign.\r\n\r\nPolicies are changed as and when the management feels like doing so, sometimes with retrospective effect- thus creating a lot of confusions and resentment among employees."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Was promised the sky when I was offered a job, was given nothing", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jan 2015", "job_title": "Full Time Member in Noida", "duration": "N/A", "pros": "The peer group is fairly talented and accomplished in their own fields. There is also a good diversity in the employee pool that makes for good interactions at the workplace.", "cons": "I was lured with an offer that was extremely competitive and the promise of a job scope that seemed very attractive. Once I joined, I was told by a consultant that I would get only half of what I was promised (salary) but that this would be reviewed after 3 months. \r\n\r\nI stuck on as I was still interested in the job scope. Post this period, my salary was unchanged and my job scope was just making presentations without any objective. We kept making presentations to each other and nit picking each other's work. Finally, we were told that the project was scrapped and that we should find new projects to work on. It was a complete waste of my time.\r\n\r\nI don't think any company treats MBA passouts of the top business schools in the country in this manner."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Life-changing experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2015", "job_title": "Senior Associate in Noida", "duration": "N/A", "pros": "1. Some of the most brilliant people I have ever met from diverse set of backgrounds\r\n2. Great exposure - working alongside stakeholders across the spectrum - from government, corporates, NGOs, communities etc\r\n3. The perfect mix between a corporate and a NGO (more like a start-up)\r\n4. The organization rewards merit more than background, qualifications and age", "cons": "1. Work-life balance is not too great for people who are looking for a stable life. Lot of travel and lots of changes keep happening.\r\n2. Work is ambiguous because there is not a specific product that the company is providing and it does not stop at consulting which might not suit people who come from super structured backgrounds.\r\n3. Change management given that it is an extremely fast growing start up organization"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "The organization is trying to do something, which seemed difficult till recent times, and key will be the team", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Feb 2015", "job_title": "Associate in Noida", "duration": "N/A", "pros": "Kind of exposure, freedom of thinking creative programs, satisfaction of seeing your work impacting lives on-ground, working with some really creative and passionate people, work-environment and kind of project we are pursuing.", "cons": "The team has transitioned from a flat structure(everyone at same level) to hierarchical structure and with the kind of job we do, it's also important to conserve the start-up culture we possess. Hence, the HR policies, structures, have to a little extent failed to incorporate views of everyone."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Warning to freshers and experienced alike: You will get stuck at a very bad work-place with no exit options", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Feb 2015", "job_title": "Associate in Noida", "duration": "N/A", "pros": "There are no pros left. Smart aspiring people whose degrees and background are shown on website and Pre-placement talks have all left the organisation. Their expectations were thrashed by senior management. The presentation being shown on campus-recruitment drives and job description on websites would fool people easily. You would think that you are getting into an awesome organisation and will work with awesome people, but the reality has changed at \"grassroot level\" within organisation.", "cons": "Really bad \"Indian Culture\" of working - slow, bureaucratic and lots of politics. Freshers specially would start hating jobs in such a setting. Hence don't make it your first job at all.\r\nNo Experienced Leadership within organisation\r\nNo exit options"}], []]