[[{"date": "14 Mar 2023", "title": "Mitarbeiter Patientenaufnahme Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Helios Kliniken (Pforzheim)", "Interview Descriptions": "Standort Pforzheim: Im Besprechungsraum der Personalabteilung (anderes Gebäude), 30 Minuten lang, mit Personalsachbearbeiterin und Leitung der administrativen Patientenaufnahme. Schnelle Einladung zum Vorstellungsgespräch, danach aber mehr als 2 Monaten Wartezeit, bis alle Bewerber durch sind", "Interview Questions": "Fragen zu Belastbarkeit, Bereitschaft zur Arbeit am Wochenenden und Feiertagen, Gehaltsvorstellung"}, {"date": "7 Feb 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helios Kliniken", "Interview Descriptions": "1. Begrüßung durch die verantwortlichen Personen 2. Gegenseitige Vorstellung aller Beteiligten 3. Fragen zum Lebenslauf und bisherigen Erfahrungen 4. Fragen des Bewerbers + Antworten 5. Weiteres Vorgehen (wann wird Entscheidung getroffen und so weiter) 6. Verabschiedung", "Interview Questions": "N/A"}, {"date": "21 Jun 2023", "title": "Unternehmenskommunikation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Helios Kliniken (Erfurt) in Feb 2023", "Interview Descriptions": "Angenehmes Gespräch mit Führungskraft und fachlich Vorgesetztem Mitarbeiter. Etwas ungenaue Beschreibung der Stelle in der Ausschreibung wurde im Gespräch konkretisiert. Meine Fragen wurden ohne zu zögern beantwortet. Ich wurde intensiv über meine vorherigen Tätigkeiten befragt.", "Interview Questions": "Sie kommen nicht aus der Branche, wie würden sie zu einem Test stehen?"}, {"date": "12 Aug 2022", "title": "Gesundheits- und Krankenpfleger Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Helios Kliniken (Wuppertal) in Jul 2022", "Interview Descriptions": "Es war ein sehr angenehmes Vorstellungsgespräch \r\nIch wurde zu allen Themen aufgeklärt. Mir wurde immer fachlich und freundlich geantwortet \r\nDas Gespräch machte mich nicht nervös, weil die Vorgesetzten im Gespräch sehr offen waren", "Interview Questions": "Warum sie bei uns Arbeiten wollen"}, {"date": "29 Apr 2021", "title": "Praktikant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Helios Kliniken", "Interview Descriptions": "Ich kam rein und ging in einen extra Konferenzraum. Dort haben wir darüber gesprochen wie ich auf das Klinikum gestoßen bin und warum ich hier her wollte. Dann hat er mir gesagt was ich hier an Aufgaben bekommen werde", "Interview Questions": "Warum haben Sie das Krankenhaus ausgewählt?"}, {"date": "29 Apr 2021", "title": "Masseur und Medizinischer Bademeister Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Helios Kliniken (Leezen, Mecklenburg-Western Pomerania) in Apr 2021", "Interview Descriptions": "Bisher noch Bewerbungsphase; angenehmer Telefonkontakt.\r\nBei der Nachfrage des bisherigen Bewerbungsstands bezüglich meiner Bewerbung, detaillierte Antworten, die meinerseits motivierend wirkt. Genaue Zeitangaben, zu denen ich mit Rückmeldungen rechnen kann.\r\nGesamte Einschätzung bis hierher gut.", "Interview Questions": "Welche Ambitionen haben Sie bei der Helios Klinik Leezen zu arbeiten?"}, {"date": "14 Mar 2021", "title": "der Gesch&auml;ftsf&uuml;hrung Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Helios Kliniken", "Interview Descriptions": "Online Initiativbewerbung, Telefonat zu Rahmenbedingungen, Persönliches Gespräch (hier wurde bereits der Ablauf des Praktikums sowie die Möglichkeit einer anschließenden Abschlussarbeit erläutert und damit auch eine finale Zusage getroffen), Vertraglicher Rahmen wurde direkt transparent aufgezeigt und mit beiderseitiger Einstimmung festgelegt", "Interview Questions": "Motivation des Studiengangs, Motivation der Schwerpunkwahl"}, {"date": "25 Jul 2021", "title": "Gesundheits- und Krankenpfleger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Helios Kliniken (Schwerin, Mecklenburg-Western Pomerania) in Mar 2021", "Interview Descriptions": "Ich betrat den Raum und sollte mich setzen, danach wurden mir Fragen gestellt, anschließend konnte ich Fragen stellen. Dann war es vorbei. Alles in allem ein sehr gelungenes Bewerbungsgespräch. 5/5 Sterne gerne wieder.", "Interview Questions": "Warum haben Sie sich um eine Stelle als Krankenpfleger beworben?"}, {"date": "26 Nov 2020", "title": "Gesundheitspfleger Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Helios Kliniken (Munich, Bavaria)", "Interview Descriptions": "Sehr freundlich Gespräch aber sehr kurz. Das Gehalt war extrem niedrig für eine Fachkraft mit mehrjähriger Berufserfahrung. Die Bewerbungsmappe wurde nur kurz durchgeschaut, es kamen keine qualitativ hochwertige Fragen trotz mehreren pflegerischen Stellen bei hoch angesehenen Kliniken.", "Interview Questions": "Wie lange sind sie in der Krankenpflege tätig gewesen?"}, {"date": "17 Dec 2020", "title": "HR Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Helios Kliniken (Bad Saarow) in Jul 2020", "Interview Descriptions": "Sehr freundlich! Es war dabei der Koch und der HR Manager. Die waren so nett dass das gespräch sehr angenehmen gelaufen ist.  Obwohl ich für die Stelle nicht ausgewählt wurde fande ich das Gespräch trotzdem sehr gut.", "Interview Questions": "Wie wurden Sie Ihre führungsstil beschreiben?"}], [{"date": "7 Nov 2019", "title": "Referent Unternehmenskommunikation Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Helios Kliniken", "Interview Descriptions": "Das Gespräch an sich verlief locker und die Gesprächspartnerin war sehr nett.\r\nMir wurde jedoch zugesichert, dass man sich in der nächsten Woche direkt mit einer Zu- oder Absage melden würde. Trotz Nachfrage habe ich jetzt, nach 3 Wochen, immer noch keine Antwort erhalten.", "Interview Questions": "Wo sehen Sie sich in 5 Jahren"}, {"date": "4 Jul 2019", "title": "Gesundheits- und Krankenpfleger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Helios Kliniken (Nienburg (Weser)) in May 2019", "Interview Descriptions": "Ich würde erstmal abgeholt und in den Bewerbungsraum gebracht, dort saßen dann 5 Personen. Es wurden mir fragen gestellt und ich sollte einen kleinen Test machen, in dem Test ging es darum wie ich verschiedene Situation priorisieren würde.", "Interview Questions": "Wie würden Sie reagieren, wenn ein Patient, handgreiflich wird?"}, {"date": "22 Dec 2018", "title": "IT Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Helios Kliniken", "Interview Descriptions": "Ich wurde freundlich empfangen, nett begrüßt. Das Vorstellungsgespräch war angenehm und locker. Es wurde das technische Verständnis abgefragt und die Beweggründe für die Bewerbung. . . . . . . . . . . . . . .. . . .. .", "Interview Questions": "Was sind Ihre Beweggründe?"}, {"date": "20 Dec 2018", "title": "Leiterin Unternehmenskommunikation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Helios Kliniken (Plauen) in Jun 2018", "Interview Descriptions": "Eines der angenehmsten Vorstellungsgespräche meiner Laufbahn: Meine Interviewpartner waren sehr gut vorbereitet. Das Interview war sehr strukturiert. Ich gewann den Eindruck, dass man sich im Vorfeld sehr genaue Gedanken über die Besetzung der Stelle und den damit verbundenen Abläufen gemacht habt.", "Interview Questions": "Die Fragen drehten sich um den Aufgabenbereich \"Unternehmenskommunikation\". Eine der Fragen lautete, wie ich konkret im Fall einer Unternhemenskrise (Krisenkommunikation) agieren würde."}, {"date": "24 Aug 2020", "title": "IT-Berater/Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Helios Kliniken (Berlin) in Apr 2018", "Interview Descriptions": "Informelles Gespräch mit Vorgesetztem und Teamleiter eines anderen Teams. Gespräch war auf eine Stunde angesetzt, ging letztlich nur 45 min und es wurden wenige Fragen gestellt, dafür sehr viel erzählt. Gefühl nach dem Gespräch war nicht so gut. Trotzdem Angebot erhalten.", "Interview Questions": "Wie sind Sie auf uns aufmerksam geworden?"}, {"date": "7 Jan 2021", "title": "Gesundheits- und Krankenpfleger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Helios Kliniken in Mar 2018", "Interview Descriptions": "Es war ein sehr angenehmes Gespräch auf Augenhöhe.  Alle Teilnehmer waren sehr freundlich. Ich habe einen guten Einblick erhalten in die künftige Arbeit. Mir wurden alle Fragen freundlich und kompetent beantwortet, die mir wichtig waren.", "Interview Questions": "Was wünschen Sie sich von uns als Arbeitgeber?"}, {"date": "24 Feb 2021", "title": "Teamleitung Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Helios Kliniken (Berlin) in Mar 2018", "Interview Descriptions": "Zusammentreffen mit potenziellem Vorgesetzten und weiteren Abteilungsleitern. Kennenlernen der potenziellen Kollegen und Kolleginnen, Besichtigung des zukünftigen Arbeitsplatzes und Führung durch das Gebäude. Die Atmosphäre war zu jeder Zeit freundlich und wertschätzend.", "Interview Questions": "Nenne konkrete Beispiele für Deine Ergebnisse."}, {"date": "16 Aug 2017", "title": "Personal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Helios Kliniken (Erfurt) in Jun 2017", "Interview Descriptions": "Unpersönlich ; sehr unfreundlicher Empfang. Wenig Interesse am Bewerber . Das Gespräch verlief sehr standardisiert, es schien ein Bewerbermarathontag gewesen zu sein. Ungenaue Angaben zur Stelle, sowie fehlende Informationen zu Arbeitskonditionen", "Interview Questions": "Warum wir"}, {"date": "14 Sept 2017", "title": "Informatiker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Helios Kliniken (Aue, Saxony) in Nov 2016", "Interview Descriptions": "Nach schriftliche Bewerbung, folgte eine Einladung zum Vorstellungsgespräch per E-Mail. Eine Woche nach dem Gespräch, habe ich eine Zusage erhalten. Vorstellungsgespräch fand mit drei Mitarbeitern des Unternehmens statt. Betriebsratsvorsitzender, Mitarbeiter der Personalabteilung und Bereichsleiter der beworbenen Abteilung.", "Interview Questions": "Wo sehen Sie sich in den nächsten 10 Jahren."}, {"date": "19 Jan 2018", "title": "Klinikgeschäftsführung Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Helios Kliniken (Berlin) in Jun 2016", "Interview Descriptions": "Einreichung der Unterlagen Online, Online - Assessmenttest (Wissenfragen zum Unternehmen und allgemeine Fragen der BWL), Telefoninterview mit einem Recruiter des Talentmanagements das ca. 45 Minuten ging - entspannte Atmosphäre (Fragen gingen hauptsächlich um Berufserfahrung und Motivation), ein Tag AC im HQ in Berlin mit Gruppenarbeit, Einzelinterviews, Selbstpräsentation vor allen Teilnehmern und Jury", "Interview Questions": "Warum bei Helios arbeiten ?"}], [{"date": "8 Aug 2015", "title": "Dipl Psycholge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Helios Kliniken (Hildburghausen) in May 2015", "Interview Descriptions": "Bewerbungsgespräch in Räumen der Klinik. Gespräch mit leitender Psychologin und Oberärztin. Anschließende Führung durchs Unternehmen. Sehr offen und ehrlicher Umgang miteinander möglich gewesen. Auf Fragen und Schwierigkeiten wurde sehr kompetent eingegangen", "Interview Questions": "Wie gehen Sie mit Situation XY um?"}, {"date": "7 Sept 2015", "title": "Krankenpfleger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Helios Kliniken (Gifhorn) in Sept 2013", "Interview Descriptions": "Sehr freundlich, sehr faktisch, praktisch, offen; sehr interessant. Für mich persönlich war es sehr aufregend, da ich mich nach einer längeren Berufspause das erste Mal wieder bei einem Arbeitgeber beworben habe. Es hat dann aber dennoch und sehr schnell geklappt.", "Interview Questions": "Wie sind sie auf uns gekommen?"}]]