[[{"date": "10 Jul 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "I interviewed with the recruiter first Then I interviewed with two managers. Had to do a personality test. They were easy going. I asked a lot of questions. A lot of scenario based questions.", "Interview Questions": "Why do you want to be nurse"}, {"date": "10 Mar 2023", "title": "Manager, Regulatory Affairs and HIPAA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at VNS Health in Feb 2023", "Interview Descriptions": "I applied for this role on Jan 17 and got a call from a talent acquisition specialist a week later. I had a screening call with a recruiter. I then had a 30 minute interview with the hiring manager/potential supervisor, a 45 minute interview with 2 staff members of the compliance team, a 45 minute interview with 2 staff members of the RA team, a 45 min interview with the AVPs of Govt. Affairs and Compliance, and a 45 minute interview with the CCO and another director. I was also asked to submit a writing sample. This entire process took 3 months, just for me to receive a call from the recruiter stating that they're reconsidering the role due to budget concerns. The recruiter told me that I will receive a follow-up call from her if they decide to go with another candidate, or if this team wishes to extend an offer to me. You would think these people would have the common sense to confirm their budget BEFORE a job posting was made public. These people (the C-suite) have absolutely no respect for their candidates. How exactly do you expect to command any respect from a future employee if this is how you treated them during the interview process? These people have ZERO regard for someone else's time and dedication to this process. Again, how do you expect to have someone show any loyalty or dedication to this role if this is how you treated them? Honestly, if they made me an offer today, I'd reject it. This process has been an absolute sh*t show, this is an obvious reflection of the people running this team and I want no part of it. I feel like I dodged a bullet. *Please note that the reason I rated this interview process as \"very difficult\" was not because of the questions asked. The interview questions weren't challenging, each interview felt like a normal conversation to me. The \"difficult\" part about the last 3 months was the lack of communication I received from these people. I had to be the one reaching out to them every week for updates.", "Interview Questions": "Most interviews started with \"tell me about yourself\" - that's where you can talk about your current role, how you got there, and why you're looking to pursue this role. Specific questions about project management, process improvement, etc. as cited in the JD."}, {"date": "10 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at VNS Health (New York, NY) in Feb 2023", "Interview Descriptions": "Long process but the team was responsive for the most part. Had an initial 15 minute interview with a recruiter, followed by a 30 min interview with hiring manager, 60 minute interview + presentation with panel of managers/directors, and final 45 min interview with c-suite member. Everything went well and I thought I would have been offered the position. Two weeks later the recruiter reached out informing me that I was not chosen. I wish they would have provided some feedback. I do not think they have filled the position as of now.", "Interview Questions": "Describe your leadership or management style"}, {"date": "18 Oct 2022", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "The interview was very welcoming and informative. It went for two rounds that were primarily informational. I first spoke to the person I would work under, then the VP of the department. I explained my passions and interests in the work, and my desire to work with the person who would become my supervisor. The process of onboarding was very quick.", "Interview Questions": "Experience Interest Passions in Health Academics Expectations"}, {"date": "17 Mar 2023", "title": "Quality Improvement Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health in Mar 2022", "Interview Descriptions": "I had an initial screening interview with the recruiter which was pleasant. She went over the role, what the company offers, etc. Then I was scheduled for an interview with the hiring manager. That went well, After that a panel interview where they asked me to prepare a presentation and project proposal for a quality improvement project based on data they provided. In hindsight, I should have never done it. It was free work. The panel interview went well. I then went on to meet with the head of the department. She liked me but I found out she contacted my former boss. Nothing terrible was said but I think it influenced her decision not to hire me. The role was supposed to be remote but I found out the department head likes to have her staff in the office. That wouldn't have worked for me at this point in time. Overall, not a terrible experience.", "Interview Questions": "Tell us about your experience with quality improvement projects."}, {"date": "6 Jan 2022", "title": "Senior Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at VNS Health", "Interview Descriptions": "I applied to the senior project manager - marketing position. Over the course of 2.5 months, I had 4 interviews. Mid-course, the job I was interviewing for changed -- still a PM role, but not with the marketing department. No one explicitly explained this \"update\" to me until the end of the 3rd interview. I was still interested, however, and pressed on. Finally, after the 4th interview, I was told they were very interested in offering me a position, but there's been yet another change: This time, a more junior role and a significant cut in salary.\n\nI found everyone I spoke with at VNSNY to be incredibly professional and personable. I felt great about every single interview, and the rapport I had with each person. Moreover, they all seemed to truly enjoy working at VNSNY, which was great to observe as a job candidate.\n\nBut of course, all of that goodness and goodwill quickly disappears when there is so much ambiguity, upheaval, and uncertainty about their actual hiring needs. Flashing red lights that they don't know this much about their organization's needs before starting the process of recruiting candidates. It also seemed as if they were slugging through molasses to move the process along -- 2.5 months is insane.\n\nI am choosing to view this as good interview prep. I am grateful I saw VNSNY's true colors before landing on their payroll. Honestly though, the experience left a bitter taste in my mouth. I feel disrespected, and I was definitely strung along. They can and should do better.", "Interview Questions": "What interests you about working at VNSNY?"}, {"date": "8 Dec 2021", "title": "Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "Lengthy process, but straightforward and pleasant people who conducted the interview. I came back for multiple interviews.  This was all pre pandemic interviewing, meaning in person, so it might be different now.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Jan 2022", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VNS Health (Staten Island, NY) in Dec 2021", "Interview Descriptions": "Was very straight foward , questions pertained to nursing. The conversational portion was not awkward i rate 10/10. Was a zoom interview (Virtual) took about 15 minutes. The questions were specific to the job description.", "Interview Questions": "What was a mistake you recognized and why ? and what would you do different "}, {"date": "18 Nov 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "Smooth and straight-forward, not intimidating, personable. The interview consisted of an initial phone screening, followed by a first interview and then shortly after a second. The interview was very candid and transparent with expectations and the role specifically.", "Interview Questions": "What you are hoping to gain from the position. "}, {"date": "4 Nov 2021", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "Interview was very good, manager was very thoughtful and understanding throughout interview. I’m not sure what it would be like working for company. But they are good people. I wish everyone the best of luck for when they are looking to work here.", "Interview Questions": "N/A"}], [{"date": "14 Nov 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at VNS Health (New York, NY) in Aug 2021", "Interview Descriptions": "Upon finding my resume, I was contacted by a recruiter. The interview went well, and I was told that I will be contacted at a specific time because the hiring was set for a determined dates unfortunately I didn't have that call back.", "Interview Questions": "I was promised a call back"}, {"date": "9 Jul 2021", "title": "Customer Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "Very efficient non intense. Self explanatory The interview was super easy. You usually go through 2 short interviews. They asked about very basic questions, like where you live, how you commute, and what your availability is. One question they asked was what you think good hospitality is. You know right after if you are hired or not.", "Interview Questions": "What are your weaknesses and strengths?"}, {"date": "29 Apr 2021", "title": "Community Outreach and Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "Interview was tough, panel style with several different people from the department. I flew a lot of pressure due to the structure of the interview. I did no get the position after the extremely long interview process, however I still really admire the company. Would definitely try to apply for another position there.", "Interview Questions": "Tell us about some of the challenges you faced at your previous job?"}, {"date": "28 Apr 2021", "title": "Psychiatric Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at VNS Health", "Interview Descriptions": "Interview process was very straight-forward, asked about resume and I walked the employer through it.  They really value ability to connect with people from all walks of life and cultural fit.", "Interview Questions": "What is your experience working with different types of people"}, {"date": "25 Mar 2021", "title": "Caregiver Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health (Auburn, CA) in Feb 2021", "Interview Descriptions": "It was average just be honest about it and work your way through it . . . . . . . . . . . . . .  They will train you some hands on stuff, some looking over videos and answer question", "Interview Questions": "Are you okay with cooking meals?"}, {"date": "28 Jan 2021", "title": "Billing Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at VNS Health (Phoneton, OH) in Jan 2021", "Interview Descriptions": "it was very easy only asked questions about job not about yourself. got right back to me within days to offer a position. was very nice and easy going. only took about 15 minutes", "Interview Questions": "what modifier do i use, experience on the job, daily duties, big pay or wins, "}, {"date": "10 Sept 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "It was cool. I enjoyed the interview because it was good people with good attitudes, Thanks to the company. Keep at it, because you guys are super courteous. Basic premises in the interview.", "Interview Questions": "What do you want to do in 5 years?"}, {"date": "15 Jan 2021", "title": "RN Hospice Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at VNS Health (New York, NY) in Sept 2020", "Interview Descriptions": "Laid back, professional, overall great people. We met in an open space in manhattan, corporate moved their home base. I interviewed with the managers from Bronx location. They hired me on the spot. We had a good time,  finger foods and wine. Not a bad combination", "Interview Questions": "Have you ever done hospice before?  Are you willing to travel?"}, {"date": "5 Feb 2021", "title": "Organizational Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at VNS Health (New York, NY) in Sept 2020", "Interview Descriptions": "The interview process was quite seamless. I went through two rounds of interviews, one with Amanda Weiner, the Organizational Development Consultant, and another with Anastacio Alaniz, Organizational Development Manager. Each interview lasted about a half an hour. They also gave me time to ask any questions that I had.", "Interview Questions": "What are you most interested in learning in this role?"}, {"date": "11 Aug 2020", "title": "Family Advocate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VNS Health in Jul 2020", "Interview Descriptions": "It went well, there are multiple rounds to the interview process. Be yourself and know how to describe your experiences and how they relate to the position you are applying for. Use examples", "Interview Questions": "Know company information and why you want to work there"}], [{"date": "29 Apr 2020", "title": "Wellness Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at VNS Health (Brooklyn, NY) in Mar 2020", "Interview Descriptions": "I went to a hiring event hosted by VNSNY. They promised every applicant that they will get back to them. \r\n\r\nI received an email about a week later regarding the position and scheduled an interview for a few days later. \r\n\r\nThe interview vibe was very casual but they did ask \"standard\" interview questions such as: Why do you want to work with us? How would you handle a crisis happening in front of you?\r\n\r\nThe interviewer was transparent and admitted that they are currently understaffed and the workload may get overwhelming. There were questions around that such as, \"How do you stay organized? Are you comfortable with Excel? What if you had 2 appointments back to back and I handed you another work assignment that conflicted with your calendar?\"\r\n\r\nThe interviewer liked me a lot so I was given a second interview by the director after. The questions were very similar.", "Interview Questions": "How would you handle a client who is in crisis?"}, {"date": "29 Feb 2020", "title": "Care Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VNS Health (New York, NY) in Jan 2020", "Interview Descriptions": "I was called by a recruiter, he set up the interview for me.  He also forget to give me the directions for the place. I had to call him.  To me that was very unprofessional.  I did go to the interview in Manhattan.  The woman who interviewed me was very unprofessional.  She made me wait for almost two hours to be interviewed.  The interview was a disaster from the start.  She went out of the room for ten minutes and then came back in.  She forgot what she was asking me.Her office was so on organized.  The woman also has laundry on her chair. She asked me basic questions.  I answered each of them.  I have over five years of social work experience.  This was the worst interview I ever went too. Lastly, she told me that she would make a decision in one week.  I waited for over two weeks.  I then called the recruiter to find out if there was an update.  He told me that her had forgotten to call me, to inform me that the assistant director was not interested.", "Interview Questions": "What do you do under stress? How do you manage your caseload?"}, {"date": "5 Feb 2020", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at VNS Health (New York, NY) in Jan 2020", "Interview Descriptions": "Waste of time, had a attitude, waited for over an significant amount of time for the interview to start.   Spoke to a group of people, who I believe had no intentions in hiring me. Was just going through the motions. Complete waste of time.", "Interview Questions": "Why should I hire you? "}, {"date": "9 Dec 2019", "title": "Quality Improvement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "I applied online and heard back from an on staff HR recruiter the next week.  She scheduled a phone interview just to go over my experience and ask my salary requirements. I was then asked to have a phone interview with who would be my supervisor/manager. She liked me and asked me to come in for a Interview with the team. I also had to create a presentation displaying my ability to use excel pivot tables and present pertinent data. It was nerve wracking but fun!", "Interview Questions": "What expert y do you have in quality improvement?"}, {"date": "26 Nov 2019", "title": "Volunteer Recreational Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "The interview process had a few steps but was fairly straightforward overall. I first met with the hiring manager for a formal 121 interview process after submitting my application, then the heads of the specific center I was placed in. There was a background check first and the interview itself was not longer than 30 mins.", "Interview Questions": "How will you contribute to the activities with the seniors?"}, {"date": "2 Oct 2019", "title": "Compliance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "Was told a live interview would be scheduled but the follow-up has not been prompt. The recruiter was very nice, but the hiring manager is extremely slow to move forward with scheduling an interview.", "Interview Questions": "General screening questions, salary requirements, background, interest in position, etc."}, {"date": "9 Aug 2019", "title": "Collections Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "Easygoing interview  but have not heard anything at all in weeks. The first part was a scheduled phone interview which seemingly went well because I was asked to come in for an interview. The in person interview was very relaxed but they said I’d hear back in a week and, three weeks later, I haven’t heard anything at all.", "Interview Questions": "N/A"}, {"date": "25 Jul 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "Awesome... everyone was warm,  friendly,  genuine. I felt very comfortable and the process was not stressful.  Great company to work for. Process did not take long as. Staff were professional, efficient,  and answered every question in a timely manner.", "Interview Questions": "Previous work history "}, {"date": "17 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at VNS Health", "Interview Descriptions": "First, there was a meeting with the department heads, then a meeting with the group heads, and then a meeting with the direct supervisor. All the meetings took place on the same day. Basically, the process was to answer questions about my qualifications, skills and past experience. Just one interview. Not sure if that is the norm but that was my experience.", "Interview Questions": "What was my interest in the company? How much I knew about what the company does."}, {"date": "11 Jun 2019", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "I applied the data scientist position online. Contacted by an HR within a week, who went through my resume and scheduled a technical interview a week later. The technical interview was with two hiring managers, and lasted about 30 min.", "Interview Questions": "Go through projects, dig deep into statistics. How do you handle missing data, etc."}], [{"date": "20 Jun 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "One of the most outdated hiring process. HR needs to learn more regarding the hiring of the candidates.  In short- Laid back. The technical rounds were not at all technical and below expectation as I was expecting atleast few questions regarding the tools or skills that were required for the position. Not sure on what basis they hire employees.", "Interview Questions": "not at all technical"}, {"date": "29 May 2018", "title": "Home Health Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "Great great great great great we had a very good time . she explained the job details extremely well i was pleased with everything explained and got the job on the spot.", "Interview Questions": "How well can you work with people"}, {"date": "13 Sept 2017", "title": "Analyst/Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "The recruiter was amazing.  There was the initial phone screen, then invitation to interview in person. The interview with department individuals/group was not terrible; therefore, I was optimistic. Interview questions asked were based on experience as it related to the job and situational.", "Interview Questions": "The interview questions were based on experience i.e. can you tell me a situation when you had to do \"xyz\" and provide the details step by step."}, {"date": "12 Oct 2017", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VNS Health (New York, NY) in Jun 2017", "Interview Descriptions": "there was phone interview that lasted 45 mins then they give you an in person interview which was really easy.  once that was done they tell you on the spot your hired and you come in to do paperwork for background check and physical.", "Interview Questions": "tell me about yourself."}, {"date": "3 May 2017", "title": "Nurse Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "It's a 3 part interview process. First you get the phone interview, which may be intimidating, but Dian is a very sweet lady. She has a genuine interest in getting to know you, so just do your best! If you pass the phone interview, you meet Dian in person. She'll ask you questions about your clinical experiences, and will want to know how you approach difficult situations, and if you have ever been assertive while in clinical.  Next, if you pass the interview with Dian,  you meet HR for a very simple interview about why you want the position.", "Interview Questions": "Describe how you apply the nursing process. Describe a time when you have been assertive in the hospital."}, {"date": "2 Aug 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VNS Health (New York, NY) in May 2017", "Interview Descriptions": "The process took 1 day. I interviewed at VNSNY in New York, NY in May 2017.\r\n\r\nHad a short interview with a couple of people. Since it was an intern role, the questions were generic. The interview was quick and easy.", "Interview Questions": "What are your interests"}, {"date": "25 Sept 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at VNS Health (New York, NY) in Apr 2017", "Interview Descriptions": "was asked about ten questions. Felt very comfortable and was able to express myself throughout the time . Very nice building and everyone was very welcoming. Was offered the position same day", "Interview Questions": "Willing to commute?"}, {"date": "17 Apr 2017", "title": "Licensed Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at VNS Health in Feb 2017", "Interview Descriptions": "phone interview, in person interview with HR then with director. HR interview were mostly behavioral questions and what would you do? Asked about my work experience as well as clinical experience. Asked about cases I've had in the past and challenging situations I've had. Pretty average interview, however be prepared and do your research about the company.", "Interview Questions": "Tell me three qualities about yourself"}], [{"date": "21 Jan 2018", "title": "OTR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at VNS Health (New York, NY) in Feb 2017", "Interview Descriptions": "1 interview in person series of interviews over the phone  drug test personality test and has to wait for an orientation which was offered only 1x a month.", "Interview Questions": "How would you handle an emergency on the field?"}, {"date": "13 Nov 2016", "title": "Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at VNS Health (Auburn, CA) in Nov 2016", "Interview Descriptions": "It was a very comfortable interview process. Remind yourself that people who choose to work in this field will usually be very kind people. \r\nThe employer just wants to know if you have all the right intentions to help the elderly community, along with a responsible, patient and kind character and a willingness to learn all skills necessary to help clients in their daily living.", "Interview Questions": "Why are you interested in this line of work?"}, {"date": "1 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at VNS Health (New York, NY) in Aug 2016", "Interview Descriptions": "It was very fast.  They took the RN's quickly, took the test, went over the test if you passed you moved on to the interview process.  The nurse manager was very friendly and expected you to know your knowledge.  But very friendly and truly got to know you.  I saw her 3 weeks later, she remembered my name, what i told her i was doing in the time i was coming to my orientation.  She really listened and cared.", "Interview Questions": "What do you look for for flu vaccinations?"}, {"date": "8 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "one on one with manager; she asked me questions about how i felt going into people homes, how i would deal with an emergency, how the hospital job had prepared me as a nurse. did i enjoy nursing, if i was not a nurse what other profession would i choose.", "Interview Questions": "how are you with people."}, {"date": "20 Aug 2016", "title": "Third Party Credit Collection Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 11 months. I interviewed at VNS Health (New York, NY) in Jul 2016", "Interview Descriptions": "Smooth but the recruiter seemed to be unidirectional. The recruiter made it clear she had no intention in someone such as my self. She disappointed me and left me\r\nExtremely discouraged. I felt it was a waste of time. U have to know someone in order to actually get hired. There are little to no advancement opportunities", "Interview Questions": "How does your experience relate to this position"}, {"date": "18 May 2018", "title": "Quality Improvement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at VNS Health (Brooklyn, NY) in Jun 2016", "Interview Descriptions": "Spoke to Visiting nurse recruiter, was screened with basic questions and discussed my work history and experience, then was brought in to interview with the hiring manager onsite. I was asked to submit writing materials from past work experience.", "Interview Questions": "How familiar are you with Managed Long Term Care and data reporting? "}, {"date": "10 Feb 2019", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at VNS Health (New York, NY) in May 2016", "Interview Descriptions": "Walk in took the exams and waited a few mins and got the results I speak with a staff member and was the told that I got accepted and I was told I have to go to a four week classes so that I can get certified and then put on a case to start working as a certified home health aide.", "Interview Questions": "Why do you want to be a home health aide"}, {"date": "9 Apr 2016", "title": "HCC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at VNS Health", "Interview Descriptions": "It was a quick process for me. But I spoke with my direct manager and the recruiter prior to accepting the offer. I had questions about salary due to the lack of a pension plan and they were nice enough to accommodate me.", "Interview Questions": "Why do you feel you would be the best candidate for this position?"}, {"date": "28 Aug 2016", "title": "Organizational Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at VNS Health (New York, NY) in Apr 2016", "Interview Descriptions": "I applied through my university. I was initially shortlisted for an interview based on my resume and cover letter. The process of arranging an interview slot was done quickly and in a very organized manner - I was given a list of time slots and asked to choose one which suited me. \r\n\r\nThe actual interview was done in person. It was a behavioral interview combined with a few competency based assessments. The behvaioral questions were split between two interviewers to minimize interviewer bias. Additionally, they were also very accomodating to my schedule and allowed me to do one portion of the interview on the phone as I wasn't able to make it to both the in-person sessions.\r\n\r\nThe questions themselves were very straightforward - I was asked to describe certain situations andhow I handled them to demonstrate various competencies. The entire process was very transparent and well organized.", "Interview Questions": "Tell me about a time when you had to work as a team."}, {"date": "13 Jun 2016", "title": "Director, Digital Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VNS Health (New York, NY) in Mar 2016", "Interview Descriptions": "They didn't have the decency to send me an email declining their interest in my candidacy.  HR left me hanging.  That says a lot about an organization.  They lack respect.", "Interview Questions": "They asked unimpressive questions pertaining to the position."}], [{"date": "24 Mar 2016", "title": "Business Analyst/Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at VNS Health (New York, NY) in Jan 2016", "Interview Descriptions": "The interview was actually very easy. Very straightforward questions were asked. Mainly discussed about prior experience, the skill set I carry, my IT knowledge, and focused on other BA skills. Discussed about my educational background. They gave info about what is the position for and high level details about job responsibilities. The overall process went very smooth. The interview was for an hour and 2 different manages interviewed separately. They told me about the company a bit. They have provider as well as payer lines of businesses. They server all the 5 boroughs of New York. The interview was for a duel role business analyst/project manager. The requirement was urgent but the project duration was short.", "Interview Questions": "What other Healthcare clients you worked for before?"}, {"date": "12 Dec 2015", "title": "Hha Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "You have to take a 4 weeks course and they put you through the wire!\r\n-disrespect you\r\n-condescending \r\n-It is a 100 percent free\r\n-The classes are 5 days a week for 4 weeks \r\n-you have to do tests while in the class \r\n- you have to take a drug test, a background test and a overall health assessment", "Interview Questions": "no interview just do the 4 weeks course."}, {"date": "23 Sept 2015", "title": "Web Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at VNS Health", "Interview Descriptions": "met with management, met with HR, had to bring in diploma to prove it was real.  Had to make sure i had all my vaccines.  Process was quite easy.  Was too taxing.  Didnt dig very much", "Interview Questions": "Problem i had solved"}, {"date": "6 Nov 2015", "title": "Medical Management Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at VNS Health (New York, NY) in Sept 2015", "Interview Descriptions": "Received a call from a recruiter, set up an interview for the following week. Day of interview met with recruiter who asked a few straight forward questions and told me more about the position, then I waited to meet with the manager and supervisor. Interview with manager/supervisor was very straight forward, mostly we went over my experience and a lot of scenario questions", "Interview Questions": "how would you decide which task is most important? something along those lines."}, {"date": "11 Jun 2015", "title": "Research Interviewer Per Diem Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VNS Health (New York, NY)", "Interview Descriptions": "The interview process was fairly easy. The HR recruiter calls for a phone interview first. If that goes well a personality test is sent via e-mail to complete. If that goes well, then the interview is arranged with the department, which was a mini phone interview and followed with an in-person interview.", "Interview Questions": "How would you redirect the patient back to the project?"}, {"date": "31 Aug 2016", "title": "Compliance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at VNS Health (New York, NY) in May 2015", "Interview Descriptions": "They didn't ask very many questions. They wanted to see if I had basic computer skills and was familiar with the Microsoft Office software package. Besides that everything they asked were behavioral questions. I wouldn't stress the interview process with this company, the work doesn't appear to be overly challenging, and they won't be giving you any new tasks to complete any time soon, so you'll have more than enough time to perfect your skills to finish the work given to you.", "Interview Questions": "How do you handle high stress level situations?"}, {"date": "19 Apr 2019", "title": "Member Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at VNS Health (New York, NY) in Apr 2015", "Interview Descriptions": "Interview was good.  Regular questions were asked. The interviewer was really nice. The environment was comfortable. There was no stress or any need to feel intimidated.  Interview was not a long process. Salary offered was low.", "Interview Questions": "Typical interview questions nothing major"}, {"date": "23 May 2016", "title": "Organizational Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at VNS Health (New York, NY) in Mar 2015", "Interview Descriptions": "1) Phone interview\r\n2) In-person interview with 1 OD team member\r\n3) Same-day in-person interview with 2nd OD team member\r\nFirst in-person interview included some general questions about my strengths, experiences, interests, etc. The second part of it was a case interview, where they presented me with a current ongoing issue and asked me to think through my approach and articulate my thoughts and solution. It was not difficult, but there were quite a few levels of probes. \r\nSecond interview involved the same kind of general questions (I think the two OD specialists divided the general questions among themselves to make sure they don't ask the same ones), and in the second half I was asked to read a print-out email and suggest edits. It was fun, I enjoyed it.", "Interview Questions": "If your previous boss had to describe you in one word, which word would he or she use?"}, {"date": "18 Nov 2016", "title": "Intake Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VNS Health in Feb 2015", "Interview Descriptions": "I submitted my application. The next day, I received a link to an assessment test that had to be completed before my interview day. On the day of my interview, I met with the talent acquisition specialist and business supervisor of the department I work in today. Overall, the hiring and interview process was relaxed and straightforward.", "Interview Questions": "Why do you want to work with VNSNY? Where do you see yourself five years from now?"}, {"date": "22 Apr 2015", "title": "Research Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VNS Health (New York, NY) in Feb 2015", "Interview Descriptions": "Received an e-mail response followed by a HR phone interview, and then the hiring manager. Asked to come in for face to face interview and that interview was more intense but very comfortable.", "Interview Questions": "How would you keep unbiased?"}], [{"date": "9 Aug 2015", "title": "Hha Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at VNS Health (New York, NY) in Feb 2015", "Interview Descriptions": "You can call the main location and ask about the hiring process. They schedule you in for an interview within the week. One there, you are given a multiple choice reading comprehension type of assessment test, along with a written essay on why you want to be a home health aid. Before getting hired you must attend a 3 week home health aid class with daily exams on topics reviewed. Drug screen and vaccinations must be completed and submitted as well", "Interview Questions": "why do you want to be a home health aid"}, {"date": "1 Jan 2015", "title": "Home Care Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at VNS Health", "Interview Descriptions": "I was per diem with another department through a staffing agency and got laid off. I was then being rearranged to interview with the current department and got a full time position.\r\nThe staffing agency part was very easy. Submitted my resume, interview process with the staffing agency was a joke. Paid my fees to health checks and they matched me with the MLTC liaison position which was in huge demand, attracting a lot of new RN's. For the MLTC position I was put in for an interview in the Bronx region and got in after one brief interview - they were basically taking everyone. Then a huge audit hit the agency, and interviews starts happening for other positions in the agency. \r\nI was interviewing at a couple of locations for the same job and every time I learned more about this current role. When I finally interviewed for this position, I already have a good idea of what this job is about and impressed the interviewer/regional manager with my knowledge and personality. I then interviewed with the regional director who basically asked me the same questions as the regional manager but rather casually since the manager already put in a good word for me after initial interview. I was then supposed to meet the regional VP but never happened.", "Interview Questions": "What do you know about this job?"}, {"date": "22 Dec 2017", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at VNS Health (New York, NY) in Jan 2015", "Interview Descriptions": "very short / met with two managers. they asked questions about my mental status really. how do i handle this or that , never really knew why they did'nt ask billing questions and i got the call next day to show up. i showed up ready to work and there was no desk for me and the  same manager was very mean the next day. i was a temp . this company uses many temp agencies for new hires. it is easier to let people go , as they lay off people every 6 months.", "Interview Questions": "how do you handle stress?\r\nwhat do you do in a rude situation?\r\nhow are you with co workers ?\r\nwhen was last billing job ?"}, {"date": "22 Oct 2014", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at VNS Health", "Interview Descriptions": "Lengthy, took too long. It can be very convoluted as the organization is so big and if you speak to more than one person, you may get a different answer.", "Interview Questions": "N/A"}, {"date": "11 Oct 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at VNS Health", "Interview Descriptions": "Took forever - about two months from application to offer. Overall a pretty average experience. One person I spoke with demonstrated a complete lack of professionalism by asking where I was from.", "Interview Questions": "standard questions"}, {"date": "8 Aug 2014", "title": "Licensed Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VNS Health", "Interview Descriptions": "There is usually a long wait because first you interview with the recruiter, then with the discipline supervisor at the regional office. The wait between the interviews is very long. I was told that this process would take a long time because the regional office was \"slow\". I was surprised.", "Interview Questions": "I do not remember any unexpected questions at the interview. The most unexpected question at a job interview elsewhere was what my 3 favorite TV shows were."}, {"date": "24 Mar 2015", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at VNS Health (New York, NY) in Aug 2014", "Interview Descriptions": "Interviewer Deb was LATE 20 mins  they had me sit in a corner in front of her office. Then she came in and didnt particularly want to discuss my qualifications just what happened with my old job. I informed her that we lost the contract with the MTA. Then she says o so you were fired.  RUDE. I then explained that 678 ppl were fired but i was wondering why she was so focus on this when i didnt really plan on discussing the past. I moved on and thats why im here. I didnt get the job maybe i shouldnt have fed into her button pushing but after waiting for her to arrive and then being spoken to so harshly i decided it was for the best.", "Interview Questions": "What happened to your last job where you worked for 4 years"}, {"date": "30 Jul 2014", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at VNS Health", "Interview Descriptions": "You sit down and meet this both a manager and director. Questions are easy and straight forward. After that i received a call two weeks later saying I was hired for the job. they will not negotiate their very low paying salary.", "Interview Questions": "How have your past experience made you eligible for this job"}, {"date": "8 Jul 2014", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at VNS Health", "Interview Descriptions": "Its one interview after you finish taking the exam and right then and there they tell you when your classes start and at which location you will be going to.", "Interview Questions": "In my opinion there weren't any difficult questions that were asked."}, {"date": "26 May 2015", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at VNS Health (New York, NY) in Jul 2014", "Interview Descriptions": "Standardized interview questions, sometimes worded very oddly and not directly applicable to position you are applying. Interviewed by HR and then by rehab manager in region to which I was applying. Had to take personality and ethics quizzes sent by HR prior to any in person or phone interviews. HR interview was general whereas rehab interview asked skill specific questions.", "Interview Questions": "How would you describe your time management skills?"}], [{"date": "12 Jul 2014", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at VNS Health (New York, NY) in Jun 2014", "Interview Descriptions": "I loved Eileen Rowland. She has a deep understanding of nursing and is eager to make a good fit between new employee and job. All interviewers were confident experts in their fields. Interviews were short, clear, and relaxed. It was a very positive experience.", "Interview Questions": "Why did you get so much academic preparation? "}, {"date": "25 Jul 2015", "title": "Hha Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at VNS Health (New York, NY) in Jun 2014", "Interview Descriptions": "Didn't really have an interview. Showed that I was certified and that was about it. Everything else went pretty quick. Got material to study for a test that was really easy a few days after. Soon as you were done you gotta go to paid orientation. After that they tried to find you a case.", "Interview Questions": "No questions were asked"}, {"date": "27 Oct 2015", "title": "Recruitment Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at VNS Health (New York, NY) in Jun 2014", "Interview Descriptions": "Interviewed with 2 hiring managers, the HR director and VP. Smooth process, questions were specific to the role. Asked about things I like to do in my spare time so it wasn't strictly about the position which made me feel a sense of comfort.", "Interview Questions": "Why VNSNY?\r\nHow many years of recruiting experience do you have? What type of recruitment?"}, {"date": "13 Sept 2015", "title": "Home Care Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at VNS Health (New York, NY) in May 2014", "Interview Descriptions": "Long interviews and much more comprehensive...Approximately 2 hours whith a lot of behavioral questions, greatest strength/ weakness, tell me more about yourself type of questions, and the interview ended with a home care situation where you have to response to. Even though the interview was long, the manager who interviewed me was great and very welcoming.", "Interview Questions": "Tell me a time where you have responded to a complex situation and how your clinical instruction responded to your actions?"}, {"date": "1 May 2014", "title": "Customer Service Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at VNS Health", "Interview Descriptions": "Several interviews, screening, initial, and panel final interview. Some points it appeared  as though the goal of the panel interview was to disorient the applicant.", "Interview Questions": "why  should i choose you over another applicant"}, {"date": "15 Feb 2018", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at VNS Health (New York, NY) in May 2014", "Interview Descriptions": "They  gave me a behavioral test to take and the interview folowed by the training. It was a very long process back then. I waiited weeks toi b eplaced on the training.", "Interview Questions": "tell me about yourself"}, {"date": "3 May 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at VNS Health (Brooklyn, NY) in Apr 2014", "Interview Descriptions": "Very Smooth and no pressure at all. One of the accountants interviewed me for an intern position. Workers are very nice and always smiling. You won't even feel the pressure of an job interview. Interviewer is straight forward and they don't ask questions to mess you up. Formal and very natural environment. Also, the interview process is very short. Overall, just be yourself and try not to reinvent yourself. You can get through without any worries.", "Interview Questions": "Why VNS?"}, {"date": "18 Aug 2015", "title": "Nurse Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at VNS Health (New York, NY) in Apr 2014", "Interview Descriptions": "It was a pleasant experience overall. HR staffs and recruiters are very nice. I was asked a few typical questions such as why do you choose nursing, what are your strength and weakness and then a lot of scenario questions. At the end I was asked to fill out a scenario question answer sheet.", "Interview Questions": "What have you done to make a difference for your patient?"}, {"date": "20 Apr 2015", "title": "Writer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VNS Health (New York, NY) in Feb 2014", "Interview Descriptions": "I was contacted by HR, based on my LinkedIn profile, and brought in my HR.  They then had me meet with the hiring manager, and then with five different people.  The problem was that they could never come up with a Job Description, despite my multiple requests.  An offer was made to me very quickly, but they could not agree on a title for me, and it caused internal squabbling.", "Interview Questions": "Why do you want to do this?\r\nWhat makes you a good candidate?\r\nTell me about yourself"}, {"date": "8 Dec 2015", "title": "Member Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at VNS Health (New York, NY) in Jan 2014", "Interview Descriptions": "Upon entering the location i was greeted by a supervisor. He explained the job title and duties. then i spoke with a quality assurance manager and he did a few test calls. he was in a room and i was in another. I was given a booklet of a few different types of calls and was told how to answer and close the call. Then he called the phone in the office about 3 different times to make sure i memorized the script correctly", "Interview Questions": "Do i have good computer and speaking skills"}], [{"date": "8 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VNS Health", "Interview Descriptions": "Must submit resume with clinical experience\r\nInterview with HR\r\nInterview with hiring manager", "Interview Questions": "How do you handle stress and manage your personal life versus work?"}, {"date": "18 Jan 2014", "title": "Organizational Development Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at VNS Health (New York, NY) in Nov 2013", "Interview Descriptions": "Application Material (submitted electronically): Resume, Cover Letter, Writing Sample\r\nApplication Process: submit application and then called-in for 1:1 interview in NY HQ\r\nInterview Process: 1:1 with two different managers and then informal discussion with current intern\r\n\r\nDuring the interview I was treated with respect, people were very friendly and polite. The first interviewer asked me general questions and the climate was more that of a casual chat. The second, higher ranked interviewer asked me typical questions such as \"why did you choose to attend [X] University\" and \"why are you interested in VNSNY\", but beyond that no difficulties. I then had the opportunity to informally discuss with the current intern. \r\n\r\nI met with the three participants (interviewers and intern) on a 1:1 basis.\r\n\r\nHowever, the interviewers avoided giving a direct answer to \"tricky\" questions from my part, for example \"what is a negative aspect of working here\", or \"what is the men/women ratio and age distribution of your employees\".\r\n\r\nIn general, I had a positive experience. Even though I did not get an offer, I have no bitter feelings. I would have probably rejected it because I did not see a good fit: not really challenging environment and too large an organization with lack of structure.", "Interview Questions": "No difficult or unexpected questions"}, {"date": "16 Nov 2017", "title": "Hha Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at VNS Health (New York, NY) in May 2013", "Interview Descriptions": "quick hire after completing hha classes its a 6 week process if u already have the hha certification and the rest of paper work needed then u should be hired on the spot just after u pass a drug and background check", "Interview Questions": "they ask about oral temperature rectal temp, sicknesses ,,,,,how would u handle helping sick ppl  etc. its a long list "}, {"date": "3 Sept 2016", "title": "Home Health AIDS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at VNS Health (New York, NY) in Apr 2013", "Interview Descriptions": "you do paper work, take a test, then talk to someone to tell you how many classes you need and schedule. and give you study paper at home and meet with the nurse.", "Interview Questions": "my pass work places"}, {"date": "24 May 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at VNS Health (Brooklyn, NY) in Mar 2013", "Interview Descriptions": "fill out the application for paoli scholar on the VNSNY website and follow up with any recruiter. then you have to attach your resume and cover letter. they make you do a computer competency test if you are eligible for an interview", "Interview Questions": "i had to look at a patient's scenario and determine the care and priorities."}, {"date": "29 Jan 2013", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VNS Health", "Interview Descriptions": "Two interviews.", "Interview Questions": "Clinical questions on first interview."}, {"date": "11 Jan 2013", "title": "Home Care Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VNS Health (New York, NY) in May 2012", "Interview Descriptions": "A single interview as given where the interviewer asked about your available hours, experience, and why you wanted to work for the company. There is an informal test given to assess your reading level. There is also a survey given to assess what skills you have which may be useful to the company.", "Interview Questions": "None. "}, {"date": "15 Jul 2015", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at VNS Health (Bronx, NY) in Mar 2012", "Interview Descriptions": "The interview was done on site at the physical location. It was a normal interview in which I was asked about my background and experience. I was also asked to complete an \"pretend\" intake form and given a few different examples of a client's case notes. This was to determine if I had working knowledge about completing an assessment/intake. Additionally, I had to complete a great deal of paperwork and once offered the job I have to go through various background checks/finger printing. All very normal when working in this industry.", "Interview Questions": "What type of case management experience do you have? "}, {"date": "24 Sept 2016", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at VNS Health (Webster, NY) in Mar 2012", "Interview Descriptions": "on site interview after speaking with human resources professional with two physical therapy supervisors and an HR person., followe by an overview of benefits options for full tme, part time, part time pay per visit with benefits, part time pay per visit without benenfits. Easy , personal, and professional questions, could ask questions myself, received an offer the next day", "Interview Questions": "do not recall"}, {"date": "25 Sept 2015", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at VNS Health (New York, NY) in Jan 2011", "Interview Descriptions": "Interviewed in the office by 3 supervisors each asking questions. I was later email a ink to complete math and verbal exams online and had to get a certain score. I must have receive a high enough score because I was later called in to take a few customer service and situation exams in person. I completed those exams and later was called in to HR to bring in my personal documents such as social security card and original copy of my degree to begin employment. Lastly I had to complete orientation and an on-boarding process. Once this was all complete and i did not miss any days I was able to begin working.", "Interview Questions": "What would you do if you had an assignment to work on and was then given another assignment to complete in a similar deadline."}], [{"date": "1 Mar 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at VNS Health (New York, NY) in Jan 2011", "Interview Descriptions": "Job interview from recuriter. Management group interview, offer letter", "Interview Questions": "N/a"}, {"date": "30 Jul 2015", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at VNS Health (New York, NY) in Jan 2011", "Interview Descriptions": "The lady ask me to come in  and have a sit she ask how i was doing she ask why I enjoy my work have i ever had any problem with any other angency.  Why I feel the should give me a chance to work for them", "Interview Questions": "Why I wanted to be a home health aide"}, {"date": "20 Mar 2014", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at VNS Health (New York, NY) in Nov 2010", "Interview Descriptions": "Hiring process was smooth, 3 weeks of training. Staff and trainers where very professional and understanding.", "Interview Questions": "there were no unexpected question"}, {"date": "12 Nov 2013", "title": "Rehab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at VNS Health (Queens Village, NY) in Jun 2010", "Interview Descriptions": "initial hr phone interview, followed by personal interview and then regional interview with clinical director", "Interview Questions": "describe  a clinical success story"}, {"date": "31 Mar 2014", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at VNS Health in Apr 2010", "Interview Descriptions": "joined the the school to get certified, you get tested every day at the end of the day for 3 months they have strict dress codes and policies. if you succeed and pass they have supervisors that you will be assigned to and the will find you work.", "Interview Questions": "how do we fix the balance between female and male employees."}, {"date": "27 Nov 2012", "title": "Home Health Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at VNS Health (New York, NY) in Mar 2008", "Interview Descriptions": "it was 1;1 very easy answer the questions why you want to do this etc  you take a basic reading and writing test and then they tell you if you passed and you buy the uniforms and handbook and come back they give you the 3 week course and then your certified to go into the feild", "Interview Questions": "they were basic "}]]