[[{"date": "8 May 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wildlife Conservation Society (New York, NY)", "Interview Descriptions": "3 interviews. Almost three months. I reached the final interview and had to ask because they never let me know, that is something wrong. However, another company was in charge of the hiring process.", "Interview Questions": "Two weaknesses and how I did manage to multitask"}, {"date": "10 Mar 2023", "title": "Fish and Wildlife Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Short process enjoyed working there definitely recommend and flexible work hours with good benefits had to leave for school unfortunately but plan on returning next summer as a fish and wildlife technician at a different location", "Interview Questions": "Are you available most days of the week"}, {"date": "5 Mar 2023", "title": "Budget and Grant manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (Toronto, ON) in Feb 2023", "Interview Descriptions": "the interview lasted two hours, one online and one on-site, unfortunately, they even ask for references and after that, they rejected you after making you call your managers to ask for a reference, I will recommend if you get an interview be very careful, as mentally will be a negative experience", "Interview Questions": "why did you choose to submit your application here?"}, {"date": "13 Jan 2023", "title": "Discovery Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "I was asked questions on Zoom by one of the workers at the New York City Zoo I picked. Questions were straightforward and pretty standard. The interview lasted around half an hour.", "Interview Questions": "Why do you want to be a Discovery Guide?"}, {"date": "2 Dec 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Wildlife Conservation Society (Denver, CO) in Nov 2022", "Interview Descriptions": "I had a conversation with an HR rep, then an interview with 2 team members which was recorded (video) and then an interview with the hiring manager. I had to contact HR repeatedly to get an answer out of them - which ultimately was 'sorry, the email was in my drafts box'. I asked for feedback and was told twice 'we are going in another direction'. This was overall an extremely negative experience. I was told they 'hadn't found a good fit' for 6 months. Not surprising. No-one seemed to know what this job was for or how it would work. The panel interview did not include the hiring manager ('too busy') and was almost entirely behavioral questions, leaving little time for me to talk about my experience and expertise or ask questions of my own. The hiring manager did not seem to have read my application and decided despite my significant international experience in one health that I had 'not been working in conservation' and I 'wouldn't understand the language'. Good grief. I found it patronizing, added to by having to repeatedly ask HR what was going on after being ghosted afterwards. I was told the decision would be in a few days. Interviews by fellow veterinarians do not need to be insulting. They are going in another direction - me too, as far in the opposite direction as possible. If this is how they treat applicants, I would say being an employee there is not likely to be a good experience.", "Interview Questions": "Describe a situation where you disagreed with somebody, and how you dealt with it."}, {"date": "5 Jun 2022", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "You apply and someone will reach out to you with following steps through email and tell you the time to come in for the interview. They will ask you Questions and you response.", "Interview Questions": "Do you have any Previous experience ?"}, {"date": "17 May 2022", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Questions were fair and the conversation was enjoyable. Interview lasted one hour. Staff is knowledgeable and stressed importance of diversity and inclusion. Staff was professional kind. Stressed importance of professional development.", "Interview Questions": "Questions about my research process. "}, {"date": "15 May 2022", "title": "HR Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society (New York, NY) in Apr 2022", "Interview Descriptions": "Recruiter was extremely professional - presented role in detail and able to connect with the candidate, very passionate and devoted to the company.\r\nVery flexible with scheduling the phone screening and precise.", "Interview Questions": "Why interested in this role and this organization?"}, {"date": "3 Apr 2022", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Wildlife Conservation Society (New York, NY) in Apr 2022", "Interview Descriptions": "The interview was quick and very direct. Information about the position was provided perfectly and the expectations were very well said. It was calm and the questions were very straightforward.", "Interview Questions": "How did you hear about this job? "}, {"date": "25 Mar 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "A phone interview was conducted and there after a three member panel interview was conducted.\r\n\r\nRelevant questions were asked which dealt from Experience, Diversity and Inclusion and Team experience was discussed.", "Interview Questions": "How do you organize yourself?\r\nWhy WCS? \r\nWhy do you want leave your current job?"}], [{"date": "8 Mar 2022", "title": "Merchandise Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wildlife Conservation Society (New York, NY) in Mar 2022", "Interview Descriptions": "The process is very easy. I was asked a few questions and then the manager briefly explained scheduling, uniform, employee policies, training, and asked if you were able to lift at least 25 pounds. \r\n\r\nThen after that, I was allowed to ask questions. Interview was virtual and lasted under 15 minutes, didn't have to take a math assessment during it either.", "Interview Questions": "Tell me something that isn't on your resume?"}, {"date": "11 Feb 2022", "title": "Technical Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (Paris) in Feb 2022", "Interview Descriptions": "4 Personen\r\n2 Laender\r\n2 Sprachen\r\nremote, \r\nstandard persoenliche Fragen und Fragen zur Organisation, wenig fachliches, mehrere Wochen Vorbereitungszeit, multinationales Team\r\njeder im Team stellte abwechselnd Fragen sie bis auf zum Schluss eindeutig vorgegeben waren", "Interview Questions": "private Fragen zu konflikmanagment, Erfolgen, Gehaltsvosrstellung und Verfuegbarkeit"}, {"date": "6 Jan 2022", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "I had an two interviews before I was hired to work at WCS. It was a standard interview process and interviewers were very nice and friendly.  Great place to work as a young adult.", "Interview Questions": "Why did I want to work for the organization "}, {"date": "25 Jun 2021", "title": "Server/Waiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "I was working in the dancing crane cafe. There was a written exam comparing coins and bills and the interview was your standard interview questions. They told me I was hired at the end of the interview.", "Interview Questions": "Why do you want to work here? "}, {"date": "25 Jun 2021", "title": "Donor Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Phone interview followed by virtual call as this was the start of Covid. Great, laidback experience. Unfortunately, hiring was put on a pause but I wasn't told that without having to follow up. I had to follow up again weeks later to be told the position was filled.", "Interview Questions": "Salary expectations for the position"}, {"date": "16 Feb 2022", "title": "Federal Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society in May 2021", "Interview Descriptions": "I submitted my application materials and was contacted two weeks later for a virtual interview. The interview itself was pretty conversational and mostly focused on past experience that would transfer to the position.", "Interview Questions": "Have you taken any classes that pertain directly to federal policy, or better yet, environmental policy?"}, {"date": "6 Apr 2021", "title": "Restaurant Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Wildlife Conservation Society (New York, NY)", "Interview Descriptions": "Not hard at all. They only ask simple questions and after you complete your interview, you are offered to come back as a rehire as many times as you want. You don’t have to do an interview as a rehire so this is a solid job as long as you do what you’re supposed to do.", "Interview Questions": "How did you hear about this job?"}, {"date": "18 Mar 2021", "title": "Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (New York, NY)", "Interview Descriptions": "be prepared. have work samples. look at what they do. be yourself. ask lots of questions. understand the mission statement and goals of the company.  you will work with lots of people with different focuses, be versatile.", "Interview Questions": "why do you want to work here"}, {"date": "5 Mar 2021", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "it was an easy process, all you have to bring is your resume. The question were not difficult and was a short process. They emailed me after 2 week of applying.", "Interview Questions": "what do you want to work here?"}, {"date": "30 Dec 2020", "title": "Climate Adaptation Evaluation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Two rounds of interviews with the project team. One was with two or three people, the next was with one. I ended up working closely with all of the people who interviewed me. Both pretty straightforward and felt like a conversation.", "Interview Questions": "Previous experience, what I want to get out of this internship, why I want to work there specifically "}], [{"date": "12 Jan 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wildlife Conservation Society (New York, NY) in Nov 2020", "Interview Descriptions": "Really easy! Everyone was so nice. The manager that I spoke with was so easy going and provided feedback on q’s as we spoke! The recruiter was so nice and they kept me informed at every step!", "Interview Questions": "What problem have you faced and how did you tackle the situation? "}, {"date": "29 Jul 2021", "title": "Security Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wildlife Conservation Society (New York, NY) in Oct 2020", "Interview Descriptions": "On-line application to Wildlife Conservation Society\nContacted by e-mail to schedule interview\nEmail follow up with Manager when contacted\nFirst telephone interview with Manager\nSecond telephone interview with Manager\nSounded like a great job\nSounded like great place to work\nCould not meet my salary requirement", "Interview Questions": "Experience\nQualifications\nWeekend work\nOff Hours Work\nFirearm qualification"}, {"date": "11 Mar 2020", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (Bronx, NY)", "Interview Descriptions": "I applied online and was contacted for a screening phone call. The screening phone call did not last very long, and was a little strange as I was repeatedly told that \"everyone is crazy!\" I was asked to come in for an in-person interview. I met with the hiring manager and two other people.  I was told I was the top pick and should anticipate a potential offer the following week. I was not contacted. I followed up after two weeks, was told that they moved forward with someone else, and then asked to apply for a position completely unrelated to my background. Seems like a cool place to work with intelligent people who are passionate about making a difference, but a few red flags related to communication, organization, and role definition.", "Interview Questions": "How would you improve communication amongst teams?"}, {"date": "15 Feb 2021", "title": "Donor Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society in Mar 2020", "Interview Descriptions": "Applied on the WCS website, received an interview request with HR within a week for a phone interview for the following week. Short phone interview followed by request for in-person interview with management and HR. Hiring delayed due to corona virus but eventually hired.", "Interview Questions": "Tell us about yourself and your experiences, was there anything you didn’t like about your previous work"}, {"date": "25 Feb 2020", "title": "Assistant Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "No interview. My application was under review for 5 months and in that time I heard nothing. They didn't even tell me that I wasn't being considered for the position or anything. If this is how they treat people in the application process then maybe I dodged a bullet.", "Interview Questions": "N/A"}, {"date": "13 Apr 2020", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (Bronx, NY) in Sept 2019", "Interview Descriptions": "The hiring process wasn't bad at all the key is to have confidence however it did take a long time watching videos taking notes reading the rules and regulations but it was worth it", "Interview Questions": "How would I deal with certain situations to help the customer in need "}, {"date": "16 Oct 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wildlife Conservation Society (Bronx, NY) in Sept 2019", "Interview Descriptions": "You apply online sending resume and cv. They will contact you. You come in for an interview. They will let you know within a few weeks if you got it.", "Interview Questions": "Why do you want to join?"}, {"date": "26 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "There was a brief phone call in which the interviewer asked me about my previous work experience and how that would relate to the internship. She then asked me what I hoped to get out of the position. A few days later I was offered the internship.", "Interview Questions": "How will you be able to translate your data management skills to this position?"}, {"date": "12 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society (Washington, DC)", "Interview Descriptions": "Was contacted for a phone interview within a couple weeks of applying. The interview lasted maybe half an hour and were standard questions about government and legislation. Half the interview was discussing the organization.", "Interview Questions": "How do you handle working with people with different opinions from your own?"}, {"date": "9 Apr 2019", "title": "Sales Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wildlife Conservation Society (Bronx, NY) in Mar 2019", "Interview Descriptions": "Got an email in about a week after I applied they give you a math test so be prepared for that you get yelled if your hired the day off so you don’t need to wait for a call back so that’s a plus", "Interview Questions": "What’s your availability "}], [{"date": "27 Feb 2019", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "The process with the recruiter was OK afterward if was disorganized and took a long time to get follow up interviews. It seemed to be a disconnection from HR to the technical team.", "Interview Questions": "Why do you want this position? how does it fit your professional goals?"}, {"date": "27 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wildlife Conservation Society (New York, NY)", "Interview Descriptions": "I applied, set up a meeting with the volunteer coordinator, met in the Central Park Zoo facility to interview and discuss the job description.  It was easy and fast and very nice.", "Interview Questions": "What do you think the role of zoos are? "}, {"date": "28 Dec 2019", "title": "Conservation Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (New York, NY) in Feb 2018", "Interview Descriptions": "Very organized and efficient.  First work in groups and given a small lesson you have to teach and they do one on one interviews with one of the education leaders of the WCS locations.", "Interview Questions": "Situational questions: What would you do if *blank* happened....."}, {"date": "15 Feb 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wildlife Conservation Society (New York, NY) in Jan 2018", "Interview Descriptions": "Went on a first round interview with a women from HR. After a 20 minute conversation, she took me to meet with my current supervisor. We spoke for about 30 minutes. They were very welcoming and friendly. I was asked to come for a second round interview the next week. I was told in advance that I would have to complete a short exam that consisted of some relatively beginner excel work and a typing test. I also met with three different staff members in the department that I'd be working with. I actually liked taking the test-- it was a good preview into the work I'd be responsible for if I accepted the position, and it gave me an additional way to prove my skills outside of just the interviews. Tests are not typical of a program assistant position. These details vary based on department.", "Interview Questions": "Tell me about yourself."}, {"date": "26 Sept 2017", "title": "Front End Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Wildlife Conservation Society (New York, NY)", "Interview Descriptions": "First round was an initial phone call where the position/my background was discussed. Next step was a short code test, followed by an in-person interview. The whole process was very transparent and they were prompt in communication with me.", "Interview Questions": "How do I stay up to date with my technical skills?"}, {"date": "6 Feb 2018", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wildlife Conservation Society in Sept 2017", "Interview Descriptions": "It was a thirty minute phone interview to learn about initial interest in the role and go over position qualifications. The interviewer was very pleasant and happy to answer all of my questions. It felt like a standard interview process.", "Interview Questions": "Why are you interested in working for the Wildlife Conservation Society?"}, {"date": "30 Apr 2017", "title": "Design Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Was interviewed by two people, the interview was relaxed and conversational. Few formal questions. Received a call before the interview asking for my preferred salary and whether I would be available to work a part time schedule.", "Interview Questions": "Where do you see yourself in the future?"}, {"date": "14 Feb 2018", "title": "Aerial Adventure Course Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society (Bronx, NY) in Mar 2017", "Interview Descriptions": "The interview process was simple and fun. since the company is willing to train to train you, the interview process is there to make sure you are physically and mentally ready.", "Interview Questions": "how did you deal with a teacher or supervisor you had a misunderstanding with?"}, {"date": "20 Jan 2017", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Wildlife Conservation Society (Bronx, NY) in Sept 2016", "Interview Descriptions": "Was interviewed by three senior employees in one of the trailers at the flagship location at the Bronx Zoo. Was seen after roughly half an hour. Interview took ~45 minutes to an hour. Each interviewer prepared their own questions.", "Interview Questions": "How would you deal with an upset client?"}, {"date": "9 Jun 2016", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Wildlife Conservation Society (New York, NY) in Jun 2016", "Interview Descriptions": "Interview process took about 3 hours, They had told me to come at 12:30 i got out of there at exactly 3:30-4. It was a one on one interview and there was 6 people including me. The manager that interview me was such a charm and he was high spirited and very understanding. Just have to have patience and be confident.", "Interview Questions": "Describe a situation when a co worker had told you to do a task, while already doing a task the manager had given you. what would you do ?"}], [{"date": "8 Mar 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "I applied online and was contacted by HR for a phone screening a week later. I came in and interviewed with HR, the program manager, and the department director, about a half hour each. They were average, not too difficult. I was offered the position a few days later.", "Interview Questions": "What do you know about this position? How do you handle difficult personalities?"}, {"date": "31 Aug 2016", "title": "Merchandise Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Wildlife Conservation Society in Mar 2016", "Interview Descriptions": "It was a quick and easy process. Since I had no prior work experience she molded the questions she asked me to fit in a school environment. The interview took less than an hour.", "Interview Questions": "Have you ever worked in a group?"}, {"date": "24 Aug 2015", "title": "Guest Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Wildlife Conservation Society (Bronx, NY)", "Interview Descriptions": "Straight forward, asked basic questions about what you know about the establishment. This job is helpful in that you are able to network and also great for young people that want to enter the workforce.  Also, this process may have changed, I worked at this establishment a few summers ago.", "Interview Questions": "What do you think about when you hear the word \"guest services?\""}, {"date": "10 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Two rounds of interviews with staff members. Asked me about my interest in the non-profit and about my qualifications. Also asked me about my hobbies and about where I saw myself in the future.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Mar 2016", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Wildlife Conservation Society (Bronx, NY) in May 2015", "Interview Descriptions": "At the interview, I was asked to read a few lines from the script. I was asked two questions that I don't remember, nothing too difficult. For me the interview process was brief and easy.", "Interview Questions": "Can't recall - possibly what challenge(s) did you have to overcome at your previous job? "}, {"date": "3 Dec 2019", "title": "Sales Associate/Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society (Brooklyn, NY) in May 2015", "Interview Descriptions": "The manager was very friendly and open. It helped me relax for my first official interview. He asked questions about my resume like my volunteer work, school, and if I had previous work experience.", "Interview Questions": "Did you ever have issues with other employees and how did you handle it?"}, {"date": "9 Jul 2015", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wildlife Conservation Society (New York, NY) in Mar 2015", "Interview Descriptions": "Went inside the building, met with one of the team leaders, filled out a basic math test first then after I was done I was interviewed one on one. The atmosphere at the place was quite chill,the co-workers didn't seem bothered by my presence and had a very organic flow, I was pretty nervous as this had been my first actual interview but it all went well.", "Interview Questions": "Did you have a good relationship with your previous boss?"}, {"date": "26 Jan 2015", "title": "Translator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Wildlife Conservation Society (Health, AR)", "Interview Descriptions": "please, to hire salary,bonus ,position interviewing , duties or responsibilities, do you have criminal record or suffering from an deceases? what wcs respond? at the moment i still don't know yet if i can past this interview i am sure I will know this job in the future.", "Interview Questions": "how many words can you translate per minute"}, {"date": "24 Apr 2014", "title": "Conservation Fellowship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Wildlife Conservation Society (Bronx, NY) in Mar 2014", "Interview Descriptions": "Invited for a 1 of 3 rounds of group interviews at the Bronx Zoo, about 25 per group so I estimated 75 people up for about 20 positions at the various WCS zoo/aquarium locations.\r\n\r\nFirst we split off into groups based off which age group we're most interested in working with during the zoo camp (toddlers, elementary, middle , teens) and were given a task to come up with a lesson plan in 10 minutes.  This was pretty hectic.  Next we had 1-on-1 interviews for 30-40 mins  or went on a short tour of the Bronx Zoo.  Questions were basic situational and behavioral questions, such as:\r\n\r\nTalk about a time when you had to work in a team\r\n\r\nTalk about your experience working with X age group", "Interview Questions": "How would you deal with a long frustrating, stressful day of working with students"}, {"date": "4 Jan 2014", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Wildlife Conservation Society (Bronx, NY)", "Interview Descriptions": "Series of back-to-back interviews for an Assistant Director position, with individuals or panels from various levels.  Presentation to an open invitation group.", "Interview Questions": "The questions themselves were not difficult, but the way some of them were posed was odd.  Questions from the presentation ranged in quality because audience was open, some attendees were specialists and others were attending from unrelated units as a lunchtime talk."}], [{"date": "7 Nov 2017", "title": "Prospect Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Wildlife Conservation Society (Bronx, NY) in Apr 2013", "Interview Descriptions": "I had two interviews at WCS.  THe first interview with the Director was great but the second round was strange.  I met with the person I would be working closely with and she seemed totally unprepared and not ready to conduct an interview. She clearly hadn't reviewed my resume and did not prepare any questions. She also apologized and said this isn't a good time of day for her because she gets sleepy in the afternoon.  I finally just said to her, \"Would you like me to tell you myself and my interest in the position?\"  It was very awkward.  I didn't get an offer but I was completely okay with that. I lost interest after that interview.", "Interview Questions": "What resources do you use to conduct your research?"}, {"date": "19 Oct 2015", "title": "Merchandise Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wildlife Conservation Society (Bronx, NY) in Mar 2013", "Interview Descriptions": "Apply online and then after you are sent an email asking you to come in or an interview. When you arrive you are seated in a room with almost 20 other people you are asked to take a small test that checks your basic math skills (adding, subtracting, multiplying, dividing). After you have finished the exam you wait for your name to be called and then brought to another room where you wait to meet with one of the managers for the actual interview that last about 20 minutes or so. After that interview they bring you back to the first waiting room and from there you wait till they call your name to go into another room where they offer you the job. they ask you to come in for a day of paid training and then the next day you start working.", "Interview Questions": "Describe i time that you were asked to work with a difficult coworker/classmate and expalin how you handled the situation."}, {"date": "13 Oct 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Wildlife Conservation Society", "Interview Descriptions": "Interview process happened quickly.  i received a call for an interview two weeks after submitting through the online WCS application process.  Had two series of interviews at the Bronx Zoo and received an offer the two weeks afterward.", "Interview Questions": "Nothing too unexpected.  Lots of questions about track record, demonstrated performance, overcoming obstacles."}, {"date": "10 Mar 2013", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Wildlife Conservation Society (Brooklyn, NY) in May 2011", "Interview Descriptions": "3 interviews. 1. phone 2. direct supervisor 3. department head. overall process took 1 month.", "Interview Questions": "There weren't odd or hard questions. It was just a standard interview "}, {"date": "24 Aug 2011", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Wildlife Conservation Society (Bronx, NY) in Mar 2011", "Interview Descriptions": "It wasn't terrible.", "Interview Questions": "What are your weaknesses?"}, {"date": "12 Oct 2011", "title": "Director of Education Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wildlife Conservation Society (Bronx, NY) in Oct 2010", "Interview Descriptions": "After applying online and submitting my resume, I was interviewed very briefly by phone and set up a date for the in-person interview. I actually had two interviews that day: with the head of HR and with the Head of the Education Department. Each was about 30 minutes. The HR interview had much more to do with the overall work environment and benefits at WCS and with answering more generic questions about my viability as a candidate. Then I went to interview with my potential boss and he explained the aspirations of the education department, what they've been doing in the past and how they've updated their offerings, and their plans for online and other education. He described the daily work,who my reporting staff would be, and the office atmosphere. He asked me about my experiences developing environmental education and teacher training programs. it was not very unusual, no questions about where I want to be in 5 years or what sort of vegetable I would be if I were a vegetable. Straight-forward.", "Interview Questions": "how would you translate in-person and onsite courses and offerings to an online format, trying to keep the most important benefits intact? What is most important to retain in online courses?"}]]