[[{"date": "20 May 2023", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Quinnipiac University (Hamden, CT)", "Interview Descriptions": "Both a group and individual interview process. Group, focusing on how well you work well with others, while the individual process focus on general interview questions and what you would do to impact your individual community if hired.", "Interview Questions": "How would you go about creating an inclusive environment in your residential area?"}, {"date": "30 Jun 2022", "title": "Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "It was not a difficult process but I just got an offer at a location that was closer to me. The interview process required me to come in person and I was provided a tour.", "Interview Questions": "What could you bring to the community at QU?"}, {"date": "19 May 2022", "title": "Technology Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "It was straight forward. The interviewers were extremely friendly and explained the environment and what it is like to work there. They also helped explain who I would work with and what it is like helping professors and students.", "Interview Questions": "What technology experience do you have?"}, {"date": "17 Feb 2022", "title": "Director of Technology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "Multiple interviews with Search Committee and others.  Several rounds of interviews but nothing unusual.  Iff anything, interview questions were predictable but asked in different ways by different people. Ultimately, nothing to indicate that they had a clear idea of how to lead an interview effectively.  Lots of repetitive questions.    Lots of people in the interview panel.", "Interview Questions": "What is your management style?"}, {"date": "19 Aug 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "To start there were screening interview questions sent via email which was then followed by an in-person interview in the department with the supervisor. Overall positive and thorough interview experience.", "Interview Questions": "How would you describe your work ethic? \nWhat is your experience with Microsoft?\nWhat hours are you available? "}, {"date": "25 Feb 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "One Zoom call, lasting thirty minutes. Everyone was very nice, and still is! They described the task, and talked about the longevity of the position. They were very open and honest that this is just a Covid position. Talked about salary, and covered all of my questions!", "Interview Questions": "How do you handle conflict, what is your availability"}, {"date": "18 Jan 2023", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Quinnipiac University (Hamden, CT) in Oct 2019", "Interview Descriptions": "The people interviewing me were very easy to talk to and kind. I was a student at the time for the student admissions job and they were very receptive to what I was saying.", "Interview Questions": "Why do you want to become a tour guide?"}, {"date": "26 Sept 2019", "title": "Poll Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Quinnipiac University", "Interview Descriptions": "One time in-person interview. It was about a 20 minute conversation and I was hired on the spot. Questions were basic interview questions. Great entry-level/just out of college job to get recent grads into the workforce.", "Interview Questions": "It was so long ago, I honestly don't remember specific questions."}, {"date": "23 Aug 2018", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "The interview process begins with an application to the Department of Residential Life. After the initial round of application reviews, applicants that move on progress to a 2-day session of interviews. The first session is a group round where you are interviewed with other applicants. If you make it past the group round, the second day is an individual interview session.", "Interview Questions": "Why do you want to be an RA?"}, {"date": "16 Jul 2018", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Quinnipiac University (Hamden, CT) in Apr 2018", "Interview Descriptions": "Very professional. Was given a wonderful tour, had back to back meetings pre-set up with staff, and was asked if I needed a break with water a few times.", "Interview Questions": "Asked about why I was leaving my current job"}], [{"date": "21 Nov 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Quinnipiac University (Hamden, CT) in Mar 2018", "Interview Descriptions": "The interview process was very thorough. Required a group interview with other applicants and then individual interview with the RHD. They tested soft skills and collaboration. The turnaround for the results took a few weeks", "Interview Questions": "How would you handle a student who made a racially insensitive comment?"}, {"date": "9 Feb 2017", "title": "Assistant to the Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Quinnipiac University (Hamden, CT) in Feb 2017", "Interview Descriptions": "I applied in november or early december, didn't hear back until february. They sent me an email to pick an in-person interview time slot, but it snowed, so I then was emailed to choose either a phone or skype interview. I choose the phone interview. Not sure if this was the best idea or not. It seemed like the in-person interview would have had a skill test, and they probably would have been more interested in asking me questions. The interviewer pretty much only asked me if I had any questions, so I barely had a chance to sell myself. I haven't heard back yet, but I have a feeling I won't be getting an offer.", "Interview Questions": "Tell me about your background and experience."}, {"date": "24 Aug 2016", "title": "Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Quinnipiac University (Hamden, CT) in Apr 2016", "Interview Descriptions": "one on one interview, asks questions, tells you to explain how to do something step by step, very comfortable the interviewer was very friendly and the overall experience was great. didn't make me feel nervous or under pressure", "Interview Questions": "what would you do if you found an elephant in your back yard"}, {"date": "21 May 2015", "title": "EF Go Ahead Tours Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Quinnipiac University (Boston, MA)", "Interview Descriptions": "Phone interview followed by in person interview. The phone interview was not that bad as the person interviewing was very nice .  they asked questions typical in a job interview. the in person interview was not that intimidating however they are truly evaluating  your interest in travel and the position", "Interview Questions": "If you were selling a trip what questions would you ask the potential traveler?"}, {"date": "16 Jun 2014", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Quinnipiac University (Hamden, CT)", "Interview Descriptions": "Went through two interviews before being offered the job. Response time was quick, only took about two weeks after applying before I heard from the University. You will need to take a computer skills test.", "Interview Questions": "Typical question about why you want to work for the university, what you can bring to the table, etc"}, {"date": "13 Feb 2017", "title": "Peer Catalyst Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Quinnipiac University (Hamden, CT) in Jun 2014", "Interview Descriptions": "Met the the head of the program and he asked basic behavioral questions and what I can contribute to the program. This is a position that is acquired by being recommended by a professor so the interviewer knows that you are of a higher caliber.", "Interview Questions": "Describe a time when you had to display leadership."}, {"date": "14 May 2014", "title": "Fitness Center Facility Attendant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Quinnipiac University", "Interview Descriptions": "Very easy interview by your future boss and a few people who currently work there. Hear back quickly and accepted the job since its work study you either use the money or you lose it", "Interview Questions": "N/A"}, {"date": "6 Feb 2014", "title": "Cati Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Quinnipiac University", "Interview Descriptions": "The entire process was very simple, I submitted an application in October 2013 and was called in for an interview in early November.  Once you get an interview you are basically hired, you only need to submit a background check.  The interview was very simple, it was based off of a paper questionnaire, no surprises.", "Interview Questions": "Why do you want to do polling?"}, {"date": "2 May 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Quinnipiac University (Hamden, CT) in Jan 2014", "Interview Descriptions": "Just the usual hiring process with phone interview, on campus interview, teaching session, Q&A session, lunch, dinner and various meetings throughout the 1-2 days.", "Interview Questions": "Why must we hire you When the question was obvious, my skills and experience was exactly what they were looking for. They then probed on and on about this at interview!!"}, {"date": "20 Aug 2013", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Quinnipiac University", "Interview Descriptions": "Questions about computers, people skills, and just if you could hold a conversation", "Interview Questions": "there were some hard techy computer questions"}], [{"date": "10 Jul 2017", "title": "Sales and Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Quinnipiac University (Hamden, CT) in Aug 2013", "Interview Descriptions": "Very friendly and straight forward.  More of a conversation than an interview.  They want to know the personality of the candidate more than just picking apart a resume.", "Interview Questions": "What is the most difficult thing you've had to do in your life?"}, {"date": "14 Jul 2013", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Quinnipiac University (Hamden, CT)", "Interview Descriptions": "Interview process was extremely lengthy. 6 weeks after applying online, I received an email from hiring manager asking to set up a phone interview. One week after phone interview, I was invited up to Quinnipiac for face to face interview, tour of campus, and to present on a relevant issue. 5 weeks after in-person interview, I received email that I did not receive job. The interview process would have been ok had it ended there, but I am STILL (2 months after interview) waiting for reimbursement of expenses related to in-person interview. I continue to interact with the hiring manager and administrative assistant to follow up on where the check is...a bit awkward. Note to any out-of-towners applying to Quinnipiac: If they offer to cover expenses related to getting to interview, be prepared to wait several months before receiving reimbursement. I'm just glad I chose the $500 1-stop flight vs the $1400 non-stop flight!  Who knows if I'll ever get my money...", "Interview Questions": "N/A"}, {"date": "7 Jan 2016", "title": "Residence Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Quinnipiac University (Hamden, CT) in Jun 2013", "Interview Descriptions": "First, I had about a 20-30 minute phone interview. Then, they invited me to campus. I had a half day interview. However, most candidates have a full day, on-campus interview. The day starts with a quick breakfast. There is a presentation, and interview with the RHDs, senior staff, student staff, campus partners, and then a wrap-up meeting with the Director.", "Interview Questions": "What experience do you have with crisis management and how can you apply that to working at QU?"}, {"date": "24 Jan 2017", "title": "Athletic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Quinnipiac University (Hamden, CT) in Feb 2013", "Interview Descriptions": "very easy and felt comfortable with interviewer. Questions we very straight foreword. Asked to go over resume and talk about previous experiences.  Talk a lot about potential situation that may arise during the job.", "Interview Questions": "why do you feel you would be a good fit?"}, {"date": "23 Jan 2015", "title": "Polling Institute Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Quinnipiac University in Jan 2013", "Interview Descriptions": "Was called for an interview at the polling institute.  Interviewer was very nice and polite.  Asked only about past telephone interviews.  Most of the time was spent describing the job and the training that the employee would need to complete.", "Interview Questions": "No difficult questions"}, {"date": "21 Apr 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Quinnipiac University (Hamden, CT) in Jul 2012", "Interview Descriptions": "I was referred to the department through a colleague at another university. I contacted the department head and was asked to come in for an interview later that week. Questions based on my teaching experience, style, and philosophy were asked. My availability was also gone over during the interview. It was a very comfortable, fairly informal, experience as the department head lead the interview more as a conversation with questions and answers versus an interrogation.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "19 May 2015", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Quinnipiac University (Hamden, CT) in Nov 2011", "Interview Descriptions": "The position was a short -term, one semester. The Department chair contacted my school and inquired if there were available candidates to take the position. Given my background, I was the logical choice. The school and the department were extremely gracious and hospitable. it was the best interview that I have had before or since in its polite and yet thorough vetting process. I would recommend this school as a place to teach.", "Interview Questions": "The questions were standard: research interest, dissertation topics, ideas re teaching."}, {"date": "2 May 2010", "title": "Library Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Quinnipiac University (Hamden, CT) in Jun 2008", "Interview Descriptions": "It was a 1 on 1 interview, where questions were asked.  Most of the questions regarded my timeliness and dedication to jobs I have had in the past.", "Interview Questions": "Will you work saturdays?"}]]