[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Oct 2022", "job_title": "Person Centred Support Worker in Adelaide", "duration": "N/A", "pros": "-Work life balance \r\n-Pay\r\n-Shift rotation", "cons": "-Can only do max 76 hours a fornight\r\n-Some managers do not consider workers feedback"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Managers to precious to come to work during covid", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Jan 2022", "job_title": "Disability Support Workers in Victor Harbor", "duration": "N/A", "pros": "The participants are the only reason most of us are here", "cons": "Managers stay at home during covid on 75 grand a year or more, Do not attend participants houses to do thier job. While the very underpaid covid exposure soldier's ( support workers) take the risk of contracting covid to ensure our participants wellbeing over Christmas and well before. We have children under 12 and grandchildren that are not eligible to be vaccinated yet and our own health, but we don't matter to CLO. Staff shortages managers are supposed to full in shifts but no to precious to really care and support our disability participants. It's atrocious"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "H", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Aug 2021", "job_title": "Support Worker in Adelaide", "duration": "N/A", "pros": "Ok work environment. Not bad for new support workers & careers.", "cons": "Management, onboarding process really poor, no good care for workers"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Best of the Worst Living Options", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Mar 2021", "job_title": "Client Service Coordinator in Adelaide", "duration": "N/A", "pros": "Opportunity to work in different areas of the organisation and pick up a wide repertoire of skills and increase your ability to work under pressure and versatility -albeit whether you want to or not-.", "cons": "While I solemnly declare the above is true is correct, the organisation has only survived this long by immovable professional ethics and integrity of its staff, forcing them to work in conditions with pay non-commensurate with experience even if you were more qualified than your manager. Prepare yourself to work to the bone, living your life under the constant pressure of 6-month rolling contracts, and the fine print at the bottom of the contract reminding you that you are dispensable by politely that \"subject to funding\". I've been a professional in the human services for over 19 years, but I left work every day bitter, angry, and often after 8pm in tears of exhaustion and frustration. I have framed the two emails that I got in 14 months saying \"thank you\" as if it were a sighting of a UFO. I worked night after night and on weekends which management was aware of given the emails after 7 or 10 pm, and waking up to a work/life balance one from management in the morning. Picture a place were entire departments resign en masse, and staff of diverse backgrounds making complaint after complaint about racist behaviour and words only to receive the \"insufficient evidence\" quasi-automated response. Further, picture the same place where even temp staff refuse to work at, and those who do lasted a week at best. I am yet to converse with a fellow colleague who resigned without emotional scarring, a place where meeting your targets was to your own detriment, as it was construed as you are cruising, and watch in horror as it doubles, and triples, and soon after you are cordially invited to a Performance Management meeting asking why. No job has ever been harder since, for which I bear gratitude, but the bitterness and lashing out that my resignation elicited, left a sour taste in my mouth, chronic back pain from the worse than Ikea chairs and desks, and the loss of confidence and self-esteem that followed me to my new role akin to PTSD. CLO-nistan. I miss my colleagues every day, and leaving there was like leaving prison after forming life long bonds with your fellow inmates."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst company to work for", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Feb 2019", "job_title": "Anonymous Employee in Thebarton", "duration": "N/A", "pros": "There really aren’t any pros to this company", "cons": "Employed for a particular role that never eventuated so was stuck working a role that I was not employed for ‘while waiting for the project to start’ the project never started, office politics, not a ‘team’ environment, everyone is out to blame others and get other people into trouble (I observed other staff purposely setting up other staff to get disciplined), the money is poor, communication with the company is very poor and critical information is shared via email when a phone call would be more appropriate, very very low standards of care for clients, very poor inductions for staff and high expectations for new workers that aren’t familiar with the dozens of forms which vary greatly between clients. Not a support team, management aren’t supportive, would advise people not to work here, it is so poorly run. You get very very little client info, I worked with clients that had significant forensic mental health diagnoses and was only given their address and name, no background information, no behaviour information, you get thrown in the deep end with no idea what you’re walking into which puts everyone at risk"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "workers will gain valuable experience but don't expect support from management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Nov 2019", "job_title": "Person Centred Support Worker in Adelaide", "duration": "N/A", "pros": "great peers\r\nvaried work experience\r\nsee clients gain skills and experience opportunities", "cons": "When working for CLO it is made clear to support workers that you are a pawn they can move around to sites without consultation. \r\n\r\nUnbelievably poor management and consultation procedures for staff that directly affect their lives, income and family.  \r\n\r\nAre more focused on completing required NDIS paperwork/procedures than delivering person centred support.  Will continuously place casuals with clients that have anxiety over meeting new people or working with particular genders, then permanent support workers are left to clean up the emotional mess.\r\n\r\nCoordinators are stretched too thin and do not have adequate time for client related matters.  They often work well beyond their allocated hours without pay.\r\n\r\nTraining and professional development is poor. Training for a particular subject is a 2-3 hour affair read of a powerpoint by unqualified people to talk on each matter. \r\n\r\nProfessional development paperwork occurs just so they can tick a box saying it was done. \r\n\r\nIf you are planning to  work passive shifts please consider other companies that pay you much better for your time."}], []]