[[{"date": "11 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marist College", "Interview Descriptions": "There was a zoom interview with the Director of the program. The interview lasted about 20-30 minutes. It was a fairly low stress interview. If you show that you are interested that is all he is looking for.", "Interview Questions": "What is your current major?"}, {"date": "30 Jul 2022", "title": "Phone Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marist College", "Interview Descriptions": "There was no interview process. We were hired immediately after applying the job. After applying for the job, they sent everyone, who applied for the job, a message to come in to receive training for the position. After the training, we were asked what shifts we wanted to take and to start immediately.", "Interview Questions": "No interview question for position."}, {"date": "1 Mar 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marist College in Feb 2022", "Interview Descriptions": "Great vibe, the committee members were warm and welcoming, I felt excellent. They let me know about the details of the position and then moved on to the questions, which were very easy to follow and respond to.", "Interview Questions": "Why Marist?\r\nHow would you teach X class?\r\n"}, {"date": "25 Oct 2021", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marist College", "Interview Descriptions": "Group interview.  Met with admissions stall and gave a presentation.  They did it in Sean’s office.   I had don’t research to get good information.  The. Office was in the rotunda.", "Interview Questions": "Type of student was I?"}, {"date": "5 Oct 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Marist College", "Interview Descriptions": "Two interviews:\nfirst one on one round where they ask you behavioral questions and tell me about yourself stuff\n\nsecond group discussion with real life case scenarios, where you will have to act on how you will react to real life scenarios.", "Interview Questions": "Why do u want to be an RA?"}, {"date": "20 Apr 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marist College", "Interview Descriptions": "The interview started with a phone call, which was not scheduled. This was slightly alarming, because it's always nice to be in the right head-space to get asked questions about a job I applied for.  It was then a long interview process, with multiple people, students, etc.", "Interview Questions": "What about the job description made you want to apply for this job?"}, {"date": "22 Mar 2021", "title": "Reports Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Marist College in Oct 2020", "Interview Descriptions": "The interview process initially proceeded normally, and I felt supported. Interviews were all conducted virtually, including the two initial phone interviews, 6 person panel interview and additional 3 person panel interview. After four interviews and being told I was one of only a few candidates left in the running, I was informed that the school was dealing with covid-related issues and they would follow up soon. I never heard from them again. I understand covid has added a very confusing layer to hiring processes, but the complete lack of communication was very unprofessional. Furthermore, the job was posted again months later, and I was not contacted in any way and had to reach out to them first. This process was disorganized, uncommunicative, and unprofessional.", "Interview Questions": "Q: Why do you want to work at Marist?"}, {"date": "16 Apr 2021", "title": "Assistant Director of Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Marist College (Poughkeepsie, NY) in May 2020", "Interview Descriptions": "There were multiple rounds. First an initial screening interview, then a one on one with the Head of Marketing, a group interview with some of the HR team, admissions, and Marketing team, and the last interview with another member of the Marketing team.", "Interview Questions": "There were a few design and writing tests I had to take. I was also interviewing for a designer position as well."}, {"date": "16 Jul 2018", "title": "Full-Time Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marist College", "Interview Descriptions": "The interview process was simple, there were few individuals who seemed uninterested. Fast forward through the interview, I ended up with the Director for the department, she was completely uninterested, she would just look at me like a deer in headlights. She would not contribute to the conversation what so ever, if I didn't ask a question we would just sit in silence. What a complete waste of time, then I find out they hired a candidate with no higher education background what so ever. She has only been in higher education for less than five months and has no experience in the position she was hired for what so ever.  As well the candidate is an Alumni, so what I am trying to say is if you want to work for Marist you need to be an alumni because  I have a Master's degree with 5 plus years of experience and they went with an Alumni who has ZERO higher ed experience and no Master's degree. Unethical hiring practices, what a disservice to the students.", "Interview Questions": "Why do you want to work for Marist?"}, {"date": "11 Mar 2019", "title": "Desktop Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Marist College (Poughkeepsie, NY) in Apr 2018", "Interview Descriptions": "A one time Skype or in person interview  with basic questions.  They asked basic questions about what you do as a student. They were very concerned with availability. Need to be able to work about 20 hours a week during the school year. 32 during the summer.", "Interview Questions": "How would you resolve a user who cant connect to the internet "}], [{"date": "3 Jul 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Marist College", "Interview Descriptions": "Discussed experience and job responsibilities. The process was very simply and conversational. The interview was informal and mostly consisted of a nice conversation with the supervisor about experience and interests.", "Interview Questions": "How would you handle a student bad-mouthing a professor?"}, {"date": "8 Sept 2017", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Marist College (Poughkeepsie, NY) in Oct 2014", "Interview Descriptions": "There wasn't much of an interview process. I applied for work study and was recommended for the position because of my major. I spoke with the (former) supervisor for about 10-15 minutes about my interest in the job, and then I was hired.", "Interview Questions": "What is your tutoring experience?"}, {"date": "28 Sept 2014", "title": "Student IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Marist College", "Interview Descriptions": "Applied at the annual career fair my Freshman semester. Handed my resume, was asked a few questions on the spot about my interests and such. Got a phone call to come in the next day. Was sat down and asked a bunch of standard support procedure questions such as troubleshooting network printers and how I would address a faculty or student on the phone or in an email.", "Interview Questions": "If a customer were to call and explain their printer wasn't working, what's the first step you would ask them to diagnose? If that fails, what would be next step? And if that fails, what would be the next step? Ect. ect."}, {"date": "26 Jan 2018", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Marist College (Poughkeepsie, NY) in Sept 2014", "Interview Descriptions": "Casual interview with one of the Desktop Administrators. You usually leave with a good idea of if you got the position or not. The way to get an interview is basically to find out who works in the department as a whole time faculty member and sending them an email with your interest. they are generally looking for freshman and sophomores who  will stick around a couple of years", "Interview Questions": "A printer isn't working what do you do"}, {"date": "5 Aug 2014", "title": "Marist College Help Desk Operator (Level II) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Marist College (Poughkeepsie, NY)", "Interview Descriptions": "Professional telephone interview with experienced Marist College Help Desk supervisor.  Very basic questions on your high school performance and where you are coming from.  Available during the summer?  What is your major?  Do you have interest in working with computers/IT.", "Interview Questions": "N/A"}, {"date": "29 Jun 2016", "title": "Assistant Sports Information Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marist College (Poughkeepsie, NY) in Aug 2014", "Interview Descriptions": "Met with the top administrators in the department, who gave me a tour of the building and took me out to lunch. My questions were answered thoroughly. I wish I got to see my office on the tour.", "Interview Questions": "What experience do you have with building an audience on social media?"}, {"date": "22 Sept 2013", "title": "Student Technician Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Marist College", "Interview Descriptions": "emailed, went to interview, emailed back with result", "Interview Questions": "why are you here?"}, {"date": "4 Jun 2013", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marist College (Poughkeepsie, NY)", "Interview Descriptions": "One interview, then an extremely brusque job offer.", "Interview Questions": "N/A"}, {"date": "4 Nov 2015", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Marist College (Poughkeepsie, NY) in May 2012", "Interview Descriptions": "The interview process was easy but that could be because I knew someone who was working there who put in a good word for me. The manager was really nice and he didn't really care if you had experience because you can learn everything you need to know by installing software on a flash drive.  Of course now I believe resent it under new management so the questions I was asked might be alittle differet. Just want to know basic malware removal. and maybe some hardware repair and diagnosis tools.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Nov 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marist College (Poughkeepsie, NY) in Aug 2011", "Interview Descriptions": "Spoke with the Assistant Director of Security. We discussed my work history, particularly my time as a Peace Officer in New York City. We then discussed what was expected of me and I was hired.", "Interview Questions": "Why do you want to work at Marist College?"}], [{"date": "7 Jun 2012", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Marist College (Poughkeepsie, NY) in May 2008", "Interview Descriptions": "Interview was extremely brief in duration my the standards of most academic interviews lasting only a few hours.  Met with Dean and faculty members, had lunch in presentation room, gave a research presentation, had a debriefing, brief campus tour, and that was it.   In retrospect, it was rather strange since there were no opportunities to meet and speak with students, and no teaching presentation.  Lunch was catered by the college and served buffet style in the room in which the presentation was to be given.  Faculty members were somewhat obnoxious during the presentation -- frequent interruptions; one faculty member fell asleep during the presentation so soundly that you could hear snoring from the back of the room.  Pretty low budget compared to most institutions.", "Interview Questions": "Why Marist?"}]]