[[{"date": "15 Mar 2023", "title": "Reporting Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ADRA in Mar 2023", "Interview Descriptions": "Ask numorous questions about the past job experiences, types of reports required by different donors and how to collect data from the field team. Also, how to devise a tool to collect information for the different types of periodic reports", "Interview Questions": "Q: what are the types of periodic reports?"}, {"date": "14 Dec 2022", "title": "Sales Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ADRA", "Interview Descriptions": "Bastante buena experiencia, muy amables, buen sitio donde trabajar y aprender de la experiencia de los compañeros. Horario flexible. Buen ambiente de trabajo en el centro de la ciudad y con facil acceso en transporte, caminando o coche", "Interview Questions": "Que puedo aportar en la empresa?"}, {"date": "15 Dec 2021", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ADRA (Washington, DC) in Nov 2021", "Interview Descriptions": "Extensive interview process with several executives and directors. Complicated questions and long interviews with department heads.  Responded to at least 10 questions from each per interview session.  Had to prepare extensively for the experience to respond appropriately.", "Interview Questions": "About strategy  and how to improve operations."}, {"date": "1 May 2023", "title": "Educadora Social Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at ADRA (Pouso Alegre, Minas Gerais) in Oct 2019", "Interview Descriptions": "Eu como participante do processo seletivo junto da equipe de coordenação e RH numa conversa de entendimento da vaga, os requisitos para tal , horários, locais de trabalho e a proposta da empresa .", "Interview Questions": "Falar de mim, abordando minhas origens, atualizações, pontos positivos e negativos."}, {"date": "9 Nov 2021", "title": "Assistant Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at ADRA (Uvira) in Aug 2019", "Interview Descriptions": "On arrive à la salle d'entretien, l'administrateur nous donne le mot d'ordre sur les conditions du test, il donne les papiers sur lesquels sont mentionnés les questionnaires. Après le temps fixé pour le test, il récupère les papiers.", "Interview Questions": "Quels sont les trois piliers de la sécurité alimentaire ? "}, {"date": "7 Jun 2015", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at ADRA", "Interview Descriptions": "Fake process. They already picked someone but they called me anyway because one of the HR person made the mistake to mention to me that the position was still open. This whole time, an executive's niece has already been hired for the job.", "Interview Questions": "How do I compare Adra to Red Cross."}, {"date": "12 Nov 2015", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ADRA (Silver Spring, MD) in Apr 2015", "Interview Descriptions": "Interview panel with 3 people plus a written exercise.  They asked different questions with scenarios relating to communications.  The panel members were friendly and made me feel comfortable.  The written exercise consisted of reading through a document and then writing a press release.  In total the interview lasted about 1 hour.", "Interview Questions": "Tell us about yourself"}, {"date": "3 Nov 2017", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at ADRA (Harare) in Jan 2013", "Interview Descriptions": "GOOD Panel of five people ask you both technical and personal questions to try and get an understanding of your work background and experince in the field and chosen location of interest", "Interview Questions": "WHAT IS THE ROLE OF GOVERNMENT IN DEVELOPMENT WORK "}, {"date": "22 Feb 2011", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ADRA (Silver Spring, MD) in Nov 2010", "Interview Descriptions": "Within one week of turning in my application, I received a call requesting writing samples. Then a phone interview was scheduled for a few weeks later, and after that, they flew me to ADRA headquarters for an in-person interview with the development team and vice-president. They were very hospitable and paid for all of my traveling/hotel/food expenses. \r\n\r\nThe final in-person interview could have been done better. Their questions were not very investigative; instead, there were a lot of general questions like, \"What are your strengths/weaknesses?\" or \"Are you a team player?\" I didn't feel as if the questions allowed me to really talk about my qualifications. I also didn't feel like my resume or cover letter had been looked at very well by anyone other than the HR representative.\r\n\r\nAfter my interview, I was told I would hear back within one week, but I didn't actually hear back for one month.", "Interview Questions": "What do you like most and least about ADRA?"}], []]