[[{"date": "4 Jul 2023", "title": "Undergraduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "The interview process was not harsh. There is an initial interview that then lets you get contacted by a lab for a specific interview. The questions mainly revolve around your experiences and how they might have been rewarding for you.", "Interview Questions": "What would you say your most fruitful work experience is and why?/"}, {"date": "16 Feb 2023", "title": "Bioinformatics Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Rockefeller University (New York, NY) in Feb 2022", "Interview Descriptions": "The interview was not as challenging as I imagined. Knowing why and what you want to do really helped. I would just say to make small talk because they loved it.", "Interview Questions": "1)Are you willing to take extra courses to fit our job criteria?"}, {"date": "11 Jan 2022", "title": "Summer Science Research Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rockefeller University", "Interview Descriptions": "Your interview is with the specific research mentor you have been matched with (if a match is made after submitting your application). Therefore, the interview entirely depends on your mentor; it's not at all standardized. I just met my mentor on campus, and she asked me very informally about my interests and told me about her research. She essentially told me just to let her know if I was interested and that was all.", "Interview Questions": "Very basic questions about what I wanted to gain from the experience and my general interests."}, {"date": "28 Apr 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rockefeller University", "Interview Descriptions": "The interview process was very straight forward and professional. I felt as though the interviewers were truly interested in getting to know me and seeing how I may be a good fit for the position. They were very friendly and answered any questions I had along the way.", "Interview Questions": "Tell me about your self?"}, {"date": "20 Mar 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rockefeller University", "Interview Descriptions": "It was alright. The lady was really nice. She asked questions about my thesis. She also asked me about my career goals and why I wanted to work at Rockefeller.", "Interview Questions": "What would your thesis advisor say is your strength or weakness? "}, {"date": "9 Aug 2021", "title": "PhD Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Rockefeller University (Boston, MA) in Mar 2021", "Interview Descriptions": "4 different interviewers being separated into 3 different days. The Zoom experience is extremely harsh in my opinion. One of the interviewers criticized my research proposal and talked trash on it even though the project was still on-going. Very unpleasant experience.", "Interview Questions": "Why should I care about your research"}, {"date": "1 Dec 2020", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "There were 6 interviews with professors, including the one who wants to be my advisor. Most professors just chatted about science in general during the interviews, but some of them asked me more technical questions. There was an hour-long presentation I needed to do based on my PhD research, and I think the presentation was the most important part for the interview process.", "Interview Questions": "Solve certain questions in dynamical systems."}, {"date": "9 Feb 2020", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "I applied through my college listing, and then was selected to interview with an HR staff member. The interviewer was very kind, and it lasted about 30 minutes. After the interview, I was instructed to complete an application process.", "Interview Questions": "Why are you interested in working as  a Research Assistant"}, {"date": "10 Feb 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "First round HR interview, not too technical. Asked about past projects and skills. Asked about future plans. Comfort with animals was a topic. Didn't ask or talk about any particular lab, more general first round", "Interview Questions": "What skills did you learn from your last research project?"}, {"date": "4 May 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rockefeller University (New York, NY) in Feb 2020", "Interview Descriptions": "The interview process was several days of getting to know the university and several one-on-one interviews. The interviewers were mainly trying to get to know me and had a very friendly approach.", "Interview Questions": "Why are you interested in this university? What other offers did you get? What are your main interests?"}], [{"date": "19 Dec 2020", "title": "Senior Network Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rockefeller University (New York, NY) in Nov 2019", "Interview Descriptions": "First HR does a email screening\nThen a phone screening, both are easy, just gauging your interest\nThen a final interview on the phone with a panel of IT folks, very laid-back, not formal, not scary, HR gives good updates on where you are in the process and what to expect.", "Interview Questions": "What is split horizon?\n\nDo you have experience with Aruba? Cisco?\n\nHow do you go about challenging a superior, especially if you know they are wrong?\n\nHow can we offer wireless internet to our employees without say, people off-campus also getting access?\n\nHow can we increase bandwith and allow for higher throughput?"}, {"date": "25 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "Informational interview before getting access to online application. Listed labs that I was interested in joining. They got back to me about 2 months later with interested labs, but none that I had selected", "Interview Questions": "Tell me about your research experiences"}, {"date": "16 May 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rockefeller University", "Interview Descriptions": "Basic phone interview where recruiter asked me preliminary questions to get more information about me and briefed me further about the application process. The phone call was about 30 minutes and was very relaxed.", "Interview Questions": "What is your experience in research like?"}, {"date": "7 May 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "Behavioural Interview with Human Resources. She asked basic questions for 30 minutes about my interests and experiences so that they could match me with labs that had open positions.", "Interview Questions": "Walk me through your resume"}, {"date": "11 Apr 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rockefeller University", "Interview Descriptions": "It was an on-campus screening interview with a member from human resources that was obtained through a college job portal. It followed an online application for various labs at Rockefeller. It also requires three letters of recommendation.", "Interview Questions": "Past research experience"}, {"date": "10 Jul 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rockefeller University (Ann Arbor, MI) in Mar 2019", "Interview Descriptions": "The interview process was very clear cut. I was invited to a first round interview where they asked simple questions like what my research interests were and to describe my lab and class experience in these areas. They were also very receptive with questions I had about the program in general. However, just note, they are more interested in you showing knowledge of the bigger picture beyond the experiment, the 'why are you doing this experiment' , and 'what is this experiment doing for the project as a whole', than hearing you list a bunch of processes you can do in the lab.", "Interview Questions": "Describe your research interests?"}, {"date": "23 Mar 2019", "title": "PhD Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Rockefeller University (New York, NY) in Feb 2019", "Interview Descriptions": "There are four professors to interview with. One by one.  Generally, you need to introduce about your own previous research experiences. And they will ask some research related questions. But also about your personalities. Then they may talk about their own research.", "Interview Questions": "What scientific questions you want to address?"}, {"date": "10 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rockefeller University (New York, NY) in Feb 2019", "Interview Descriptions": "HR is very reasonable. Make sure you know what labs you're interested in, and what generally interests you. They will also ask about your future plans, don't be afraid to let them know.", "Interview Questions": "Tell us about your previous research"}, {"date": "28 Mar 2019", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rockefeller University (New York, NY) in Feb 2019", "Interview Descriptions": "Went onsite for an interview. The interview lasted for about 2 hours. Met all laboratory members and the the hiring manager and had 1:1 interview with everybody. The last round of interview was with the HR which lasted for 30 minutes.", "Interview Questions": "What is something new that you will learn in this job"}, {"date": "10 Jul 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rockefeller University (New York, NY) in Aug 2018", "Interview Descriptions": "The first interview was a  phone interview through HR. It was quite pleasant. HR representative set up interviews with two labs based on my previous experiences. Both interviews were with the head of each lab.", "Interview Questions": "What is your background in research?"}], [{"date": "24 May 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "Interviewed with HR and filled out an application afterwards, HR lady was very nice and it was a good experience getting to speak with her, she followed up afterwards with what else i needed to do in the process", "Interview Questions": "Tell us about your research"}, {"date": "8 May 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rockefeller University (New York, NY) in Apr 2018", "Interview Descriptions": "Applied online and got an email for an HR interview. The HR people are super nice. After a phone interview was invited for an on site interview. They didn’t ask at all about my research really, which was unlike other interviews I’d done.", "Interview Questions": "Would you work with animals?"}, {"date": "25 Jul 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rockefeller University (Philadelphia, PA) in Apr 2018", "Interview Descriptions": "Pretty straightforward, asked you about your research experiences and skills. Asked personal character questions as well such as your strength & weaknesses. Also asked about how other lab members/friends would describe you", "Interview Questions": "What is your biggest weakness?"}, {"date": "11 Mar 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "First interview was with HR person covering basic research experience, second round involves an online application and interviews with a PIs. The first interview took place on my college campus.", "Interview Questions": "Why did you choose your major?"}, {"date": "2 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University in Mar 2018", "Interview Descriptions": "At my university, I met with an HR representative, then with a current employee in the position. The current employees did not ask any questions, but told me about their experience and gave me time to ask any questions I wanted to.", "Interview Questions": "Tell me about yourself and your interests"}, {"date": "3 May 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rockefeller University in Mar 2018", "Interview Descriptions": "I applied through the handshake when they recruiting the graduating students. The first interview took place at my University with the HR. Then, I submitted my application materials through their website. They will pair you up with the lab. The second round will be on their campus.", "Interview Questions": "Tell me something about your coursework and lab experience."}, {"date": "16 Apr 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rockefeller University (New York, NY) in Mar 2018", "Interview Descriptions": "After an employee referral, I was put in touch with the postdoc in the lab. A few emails back and forth with the postdoc lead to her connecting me with an HR rep that set up an in-person interview within a couple of days. In-person interview consisted of a one-on-one interview with the postdoc, a tour of lab and conversation with other lab members, and a one-on-one interview with the HR rep. Interviewed for a total of 3 hours.", "Interview Questions": "What relevant experience I had, what I was hoping to get out of the position, if I was comfortable working with mice. "}, {"date": "30 Oct 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rockefeller University (New York, NY) in Oct 2017", "Interview Descriptions": "I applied through my career services office for a recruiting event called the Fall Recruiting Consortium (Fall 2017). I was accepted and called for an interview, and I traveled to NYC where they held them in a hotel's business center. The interview was fairly general, with an emphasis on how I decided on my major as well as my research experience (they consider this very important). After the interview process, they hand you a folder with application materials for the 2nd round. I have yet to complete this, but I will update.", "Interview Questions": "Are you comfortable working with mice?"}, {"date": "26 Feb 2018", "title": "Production Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rockefeller University (New York, NY) in Jul 2017", "Interview Descriptions": "I was out of town on vacation and then had a death in the family and ultimately my interview had to be pushed back a couple of times which HR was helpful in organizing. I did think that the distance between the Press and the University should've been noted beforehand since it was summer and this meant an interview that took about 2 hours or more which is a long time to be out of work. I met the managers who were nice and I took an editing test (expected), but never heard back in terms of negotiation on salary for this position.", "Interview Questions": "Why was I searching for a new position?"}, {"date": "3 Nov 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at Rockefeller University (New York, NY) in Jun 2017", "Interview Descriptions": "first by email were I introduced my self and my research. After that I had a phone call with the PI where we talked on my research and her research and what type of projects I can work on with I join the lab. And after that I flew to NY  for a personal interview where I gave a presentation of my work and we talked more on projects in the lab.", "Interview Questions": "My research "}], [{"date": "28 Mar 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rockefeller University in Mar 2017", "Interview Descriptions": "It was an interview over Skype, where we went over basic interview questions, my research experiences (emphasis on techniques), and my interests.The interview lasted approximately 30 minutes. The interviewer was nice and pleasant.", "Interview Questions": "What are past techniques you have used?"}, {"date": "12 Jun 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University (Poughkeepsie, NY) in Mar 2017", "Interview Descriptions": "I applied through my college's job link. I submitted a resume and cover letter then waited for my college's career development office to contact me if I was selected for an interview. Once selected, the interview was conducted on campus; a representative from HR at Rockefeller met with me.", "Interview Questions": "Why did you choose your major?"}, {"date": "29 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rockefeller University (New York, NY) in Mar 2017", "Interview Descriptions": "Gave presentation. Received offer a couple weeks later. The professor runs the presentation. I met other members of the group. It lasted the whole day. The group members were really great.", "Interview Questions": "Very detailed about my background, but that depends on the PI."}, {"date": "1 Feb 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "Interview with recruiter on college campus. Brought to Rockefeller University about one month later after receiving two interviews. It was a one-day process. I spoke with the PIs, was given a lab tour, and spoke with 2-4 grad students/current research assistants.", "Interview Questions": "Asked me in depth about my research. There was also a written quiz"}, {"date": "4 Nov 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Rockefeller University (Ithaca, NY) in Feb 2017", "Interview Descriptions": "The HR interview happen on-campus at my university. It was more of an assessment to get to know me and my research/career interests for them to match me to labs. It was fairly simple; I just spoke about my previous research experiences and how I wanted to build on that in my next job.", "Interview Questions": "What do you think the people you have worked with in the lab would say about you?"}, {"date": "18 Nov 2016", "title": "Laboratory Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rockefeller University", "Interview Descriptions": "The interview was arranged by a recruiter. I was interviewed on the phone by a member of HR. It was a straightforward interview with the expected questions. I came in for an interview on the campus. It was a bit of a hike but again, straight forward and nothing unexpected.", "Interview Questions": "Are you comfortable working in a lab where animals are tested?"}, {"date": "27 Oct 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rockefeller University (New York, NY) in Oct 2016", "Interview Descriptions": "First you meet with HR about your application and they ask you about your research experience, when you would be available to start working etc. Then you meet with lab members to get a sense of how the lab runs and what projects you would potentially be working on/ what your day to day would look like. Then it's back to HR for additional follow up.", "Interview Questions": "Describe your research experience?"}, {"date": "24 Aug 2016", "title": "Clinical Research Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "Online application and HR notification via email for 1st round interview with nurse manager and nurse director. Then proceed to 2nd round panel interview with nursing staff if selected as a candidate.", "Interview Questions": "Tell me about yourself. Why research nursing? Where do you see yourself in the future?"}, {"date": "4 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rockefeller University (New York, NY) in Jul 2016", "Interview Descriptions": "Very disorganized and I had very little feedback throughout the process. I was told to come in for my first day after not hearing back for 2 weeks. Overall, they don't weigh hard on your experience as long as you demonstrate a willingness to work hard.", "Interview Questions": "Q: What molecular biology techniques are you familiar with? "}, {"date": "21 Jul 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Rockefeller University (New York, NY) in Jun 2016", "Interview Descriptions": "I was taken to Human Resources to fill out paperwork (if at all possible, make sure you do this online, it would be easier and simpler) and then was walked to the lab and interviewed by three people who worked there. I got to talk to several of the members of the laboratory and had an overall pleasant experience.", "Interview Questions": "Tell me about yourself.\r\nWhat lab technique experience do you have?\r\nAre you already working on relocating?"}], [{"date": "2 Aug 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rockefeller University in May 2016", "Interview Descriptions": "overall very average interview. not very efficient workflow, very awkward questions. quiz at the end which I felt was unnecessary. Was not given much information prior to attending the interview.", "Interview Questions": "what are your career aspirations? "}, {"date": "24 Apr 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rockefeller University (New York, NY) in Mar 2016", "Interview Descriptions": "I applied onlineto a couple of open positions. Was invited to interview with two different labs. Each lasting about an hour. One lab I met only with the fellow Research Assistants so it was very low key, while the other lab I met with multiple post docs, all separately, so had to repeat a lot of the same info. HR is super pleasant and helpful the entire time.", "Interview Questions": "Tell me about your research experience?"}, {"date": "2 May 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rockefeller University (Ithaca, NY) in Feb 2016", "Interview Descriptions": "I had applied through my school's recruitment portal. The interview happened on campus, conducted by a Human Resources person. They asked about my research and the skills listed on my resume. 3 letters of recommendation were required.", "Interview Questions": "Tell me about your current research experience"}, {"date": "27 Jan 2016", "title": "Part Time ECE Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rockefeller University (New York, NY) in Jan 2016", "Interview Descriptions": "Overall the interview process was very straight forward and went very smoothly. First the lady from human resources reached out to me in regard to a phone interview that lasted 15 minutes where she explained to me the positions that were available at the children and family center and mentioned to me that she would pass my information along to the directors and if they were interested they would reach out to me. Needless to say about a week later they reached out to me through email asking if I would like to meet with them for an in person. Such an amazing group of directors that I have met. I am still awaiting feedback but overall it was a great process at Rockefeller!", "Interview Questions": "If there were two children paying with blocks and another child happened to come and kick down their blocks, how would you as a teacher rectify the situation for the children?"}, {"date": "2 Nov 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University (New York, NY) in Oct 2015", "Interview Descriptions": "The interview went well. All the questions are basic and straight forward. After the interview, I was asked to summit transcript and others to the website. One question they asked is do I fell comfortable with working with animals.", "Interview Questions": "What is the name of your senior thesis? "}, {"date": "28 Jul 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rockefeller University (New York, NY) in Jul 2015", "Interview Descriptions": "I applied online and was scheduled an onsite interview directly after 2-3 weeks. I had met the HR first was asked generalized questions, then head of the laboratory who talked about the position and requirements and 3 team members who asked me both technical as well as personal questions. I was given a tour of the lab at the end.", "Interview Questions": "Asked about my skills, lab experience and very easy technical questions based on molarity. They presented me with cloning despite knowing I had no experience and the position did not require cloning but I managed to answer it."}, {"date": "30 May 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "Straightforward.  Met with human resources, followed with another interview with the lab managers.  Questions are pretty basic and direct.  Some questions related to work ethic and how your degree if any prepared you for the position.", "Interview Questions": "How do you feel working with mice?  Are you comfortable with performing procedures on animals?"}, {"date": "30 Dec 2018", "title": "Summer Science Research Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rockefeller University (New York, NY) in May 2015", "Interview Descriptions": "Brief introduction and tour of facilities\r\nIt was clear I had been selected for the position before the interview happened, so the interview was more of an introduction to my boss and the lab I was working in", "Interview Questions": "They asked about my academic interests"}, {"date": "17 Apr 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "After applying through my college career development department, a recruiting agent from Rockefeller contacted me to set up a Skype interview, in which she asked me questions about my research experience, my future plants, etc.", "Interview Questions": "Describe your research experience. "}, {"date": "9 Dec 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rockefeller University (New York, NY) in Apr 2015", "Interview Descriptions": "I came across the application through my University's career development website. The first phase was of the process was to submit my transcript and resume. If satisfactory, HR then asked to schedule an interview with you, after which you were asked to submit 3 letters of recommendation, a formal transcript, and a brief summary of past research experience and skills. HR would then distribute your complete application to different labs to evaluate. If they were impressed, you would then come in for a final interview with the specific PI and/or person you would be working with.", "Interview Questions": "Tell me about the project you were working on in your previous lab. "}], [{"date": "16 Apr 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University (New York, NY) in Apr 2015", "Interview Descriptions": "I first had an on campus interview with HR which was fairly low key: they mostly asked about my previous lab experiences, skills, techniques, etc. After that, they tell you to submit some application materials: three letters of reference, official transcript, an inventory of skills checklist that you have to fill out, and a preliminary list of labs you might be interested in. \r\n\r\nUnexpectedly, I missed the deadline to submit these materials, but they still contacted me via email in early April to set up some on-site interviews. I met with three different labs in one day: most have you talk to a postdoc or research faculty under whom you would potentially work, and then they give you some time to talk to current RAs in the lab to just ask about their own experiences at the job. Pretty low key, they spend half or more of the time talking about the lab and what they research, and the other half asking about your lab experiences, interests, future path, etc.", "Interview Questions": "What are your research interests?"}, {"date": "20 Apr 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rockefeller University (New York, NY) in Apr 2015", "Interview Descriptions": "Start at HR to fill out some paperwork, and wait for someone to pick you up. The interview itself was laidback, mostly conversation about your experience and their current work. There is a follow up with HR.", "Interview Questions": "When are you ready to start working?"}, {"date": "9 Mar 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rockefeller University", "Interview Descriptions": "Interview was fairly neutral, apart from the fact that the interviewer did not answer any of my questions about the institution effectively and was fairly vague about the type of work involved. Asked me to talk about what I wanted to get out of the 1-2 year research assistant program and how long of a period I could commit to.", "Interview Questions": "Asked me to talk about my undergraduate research and explain its relevance."}, {"date": "25 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rockefeller University (New York, NY) in Mar 2015", "Interview Descriptions": "Applied online, contacted by HR within a few week. Initial phone interview, eventually invited to visit Rockefeller where I met both HR and principal investigators seeking research assistants. Everyone was nice, courteous. Overall a pleasant interview. Research facility is great, and both staff and students seemed happy.", "Interview Questions": "Describe all of your laboratory skills"}, {"date": "11 Sept 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rockefeller University", "Interview Descriptions": "The application process is fundamentally the same as every grad school. You fill in the application form and submit the supporting materials through the online system; similar to every graduate school; No interview required for making a decision; Accepted students are invited to attend an open-house session.", "Interview Questions": "N/A"}, {"date": "24 Sept 2014", "title": "Research Support Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rockefeller University in Sept 2014", "Interview Descriptions": "I was there for nearly 4 hours ( about 40 minutes of that was waiting time, because  I got there about 15 minutes early). however they tell you to leave 2-3 hours for the interview process. It was a 5 part process:\r\n\r\n1) go to HR to fill our paperwork (basically filling in something similar to the online application\r\n2) meet with HR person (about 20- 25 minutes)  to get an overview of you, your interests, your expectations, your educational background, what the institution has to offer etc (not position specific)\r\n3) meet with department head ( about 1 hour and a half - 2 hours ) - this is specific to the position, so this is where you get into the details of why you're there, why you would want the position, previous research you've done, position responsibilities, etc. \r\n4) tour of the lab/ facility and meeting with other people in the lab (abut another hour) to get an idea of what they do, how they like it there, more of an on-the-ground look into the day-to-day of the lab, etc. \r\n5) return to HR ( 10- 15 minutes) to give your impressions of the interview process, what the position has to offer, etc. \r\n\r\nNone of the questions were particularly difficult, but it was definitely a lengthy process", "Interview Questions": "There was nothing really difficult or unexpected. In HR they asked if I would be okay working with animals and/or stem cells p. which was unexpected because the position that I applied for doesn't work with either in a direct way. "}, {"date": "21 Apr 2014", "title": "Postdoctoral Researcher Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "Pretty straight forward.", "Interview Questions": "N/A"}, {"date": "11 Apr 2014", "title": "Assistant Technology Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "I applied for the job online initially and received a call from HR the next day to set up an interview. The interview was with the Director of my department. Questions were very straightforward and less technical than I expected.", "Interview Questions": "There were no unexpected questions."}, {"date": "7 Mar 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rockefeller University (New York, NY)", "Interview Descriptions": "Pretty straight forward/easy interview process. I was interviewed by two people. The questions were all general interview questions. There was nothing that would catch anyone whose previously been on an interview off guard. Applied and got hired a month later.", "Interview Questions": "None of the questions were unexpected. All the general questions you would find at any interview."}, {"date": "6 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Rockefeller University", "Interview Descriptions": "The process took one day and was held at my university's career services office.", "Interview Questions": "What are all the techniques you have performed in lab?"}], [{"date": "4 Mar 2016", "title": "Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rockefeller University (New York, NY) in Jan 2014", "Interview Descriptions": "Two interviews within three months\r\nLong and drawn out\r\n\r\nWalked through facility\r\n\r\nJust asking redundant questions about how I would handle certain situations if they ever came up\r\n\r\nSat with two different upper level supervisors in an office setting\r\n\r\nSat with someone in human resources who asked similar questions", "Interview Questions": "N/A"}, {"date": "2 Mar 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rockefeller University", "Interview Descriptions": "HR interview. had applied through university career services. Warm personality of the interviewer. Asked how working in Rockefeller would benefit your career? What techniques have you learnt in every project you worked on so far?", "Interview Questions": "Do you think you have the ability to carry out techniques which you haven't worked on so far?"}, {"date": "6 Dec 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Rockefeller University (New York, NY) in Feb 2013", "Interview Descriptions": "On site research presentation, one on one meeting with all lab members including head of lab. Met with head of lab for 1hr discussing on going research in the lab, demonstrated how I can help its progress, both by driving current approach and by introducing innovative solutions.", "Interview Questions": "What is the  biological question you are most passionate about?"}, {"date": "13 May 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rockefeller University (New York, NY) in Aug 2012", "Interview Descriptions": "Typical postdoc interview. I met with lab head, then I met with all the lab members. I talked about my research and had lunch with everyone. No one was grilling me, just asking me questions because they were curious. The lab head asked a couple questions just to make sure I knew my stuff - but he mostly just went by my letters of reference and my research summary.", "Interview Questions": "Do you expect to work 9-5?"}, {"date": "3 Aug 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Rockefeller University (New York, NY) in Dec 2011", "Interview Descriptions": "the usual scientist interview. Applied online to the professor. Exchanged a couple of e-mails and was invited to give a talk. A hour long talk followed by Q&A. Met the other members of the lab.", "Interview Questions": "What research project are you interested in?"}, {"date": "3 Dec 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rockefeller University (New York, NY) in Aug 2011", "Interview Descriptions": "great people in the HR department.  Very well organized and pleasant staff. Highly recommended. great overall experience was great.  Staff was very  cordial. Several interviews in other departments.", "Interview Questions": "standard background and experince questions"}, {"date": "7 Sept 2015", "title": "Environmental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rockefeller University (New York, NY) in Jun 2011", "Interview Descriptions": "First, someone from human resources will contact you via email to schedule an interview. Then on the scheduled date, the person who emailed you from human resources will meet you first and ask you pretty generic questions, then you meet the person in charge of the lab and they will interview you next. At the end, you get a tour of the lab. If they're interested in hiring you, human resources will then call your references and then tell the head lab about what the individual has said about you.", "Interview Questions": "Why are you interested in this position?"}, {"date": "4 Apr 2011", "title": "Researcher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rockefeller University (New York, NY) in Mar 2011", "Interview Descriptions": "It consists of speaking to the lab head about your research interest, meeting and chatting with each lab member and then giving a presentation of the work you did during your Ph.D. They will also take you to a nice lunch with lab members, and maybe a dinner with lab head and his wife.", "Interview Questions": "Where do you see yourself 5 to 10 years from now?"}, {"date": "27 Feb 2011", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rockefeller University (Philadelphia, PA) in Feb 2011", "Interview Descriptions": "A sit down interview with questions such as why Rockefeller, interest in graduate school, research interest", "Interview Questions": "Describe a research project you worked on"}, {"date": "23 Jun 2010", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Rockefeller University (New York, NY) in Jun 2010", "Interview Descriptions": "First had phone interview with HR, set up through my university career center.  Spoke with Marivel Morillo, who was very helpful and communicative throughout the whole process.  When a position opened up, she invited me for an interview.  I met with her in person, and then was brought to the specific lab.  I met first with the PI, who asked standard research assistant questions: experience, educational background, etc.  I was most interested in that he was looking for someone who was eager to learn science, rather than just do labwork.  He asked about my future goals.  I got to hang out with the current research assistants, which I enjoyed very much.  I then was interviewed by a specific post-doc in the lab, who asked more specific questions about my laboratory experience and what exactly I was interested in doing.  Lastly, I went back to Marivel to give my impressions of the interview.  All in all, a very amicable process that was almost enjoyable, despite the anxiety.", "Interview Questions": "Do you plan on pursuing more graduate school?"}]]