[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Nothing but good vibes and great people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 May 2023", "job_title": "Instructor in Orlando, FL", "duration": "N/A", "pros": "Community in FIRST is great. I feel like there is a lot of support for instructors in terms of materials they are given to work with and even flexibility with teaching style. They have also started to include more professional development for instructors which is a plus for anyone looking to refine their knowledge in the position.", "cons": "Courses need to be optimized a bit more to become more suited towards getting employment for students but it is something they are already working on."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful, don't even bother applying.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jun 2023", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "None at all, waste of time.", "cons": "Awful environment, strange practices. Don't even waste your time applying."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Needs major improvement", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2023", "job_title": "Instructor in Maitland, FL", "duration": "N/A", "pros": "Great coworker morale Decent work facilities", "cons": "Level of compensation does not match job responsibilities Little room from advancement Bias/favoritism toward HR/Admissions"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "\"Where Learning never ends \"", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Sept 2021", "job_title": "Director of Admissions in Orlando, FL", "duration": "N/A", "pros": "-F.I.R.S.T Institute is growing so there are opportunities that might not immediately exist\n-F.I.R.S.T. provides regular communication, listen to and consider new Ideas and continually encouraging growth, both personally and professionally\n-F.I.R.S.T. understands work-life balance and actually respects that\n-F.I.R.S.T. is a place you can call home; many employees have been here a long time. Which allows deep integration into the business and the ability to create pathways to success for others\n- The F.I.R.S.T. culture is conducive to creating friends and mentors with lots of opportunities to get involved based on your interests", "cons": "No company is perfect .while we grow ,there are things that are evolving. that come along with any growing company. it's important to not get hung up on what's wrong .but to focus on what is happening that is right and the progress in actions(not just words)that support that. With this growth is an opportunity to define the future and the role you play in it. That mindset is rewarded at F.I.R.S.T. Institute."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great team environment! Students who want to better themselves.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Aug 2021", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "Wonderful schedule, good pay, and a great team to work with. I've seen previous reviews say that it felt like they were being set up to fail with unrealistic goals, and that may have been true in the past, but I feel that the current leadership does not view it that way and are trying to set up the whole team for success. The facilities are top notch and the students are always wowed when they see what F.I.R.S.T. has to offer. The new building is also a huge improvement and future growth seems achievable with the upgraded facilities.", "cons": "Success isn't guaranteed to come quickly and that could be frustrating for some, but pushing through and being open with leadership is the best way to combat this. At the end of the day *some* (not all, but a notable amount) of your job success is based upon factors outside of your control and this can lead to frustration when it's your livelihood."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Family enviro", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jun 2022", "job_title": "Marketing in Orlando, FL", "duration": "N/A", "pros": "Really nice people work here", "cons": "Low salary makes it hard to stay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "I Love My New Career", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 May 2021", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "FIRST is a family! I was laid off due to the pandemic and this was my first time in an office job at a small company. I always feel like my hard work is recognized and appreciated by my supervisors and I've been given a lot of opportunity to grow and learn in return. One of the best parts of working at this school is that the programs gives a lot of people an opportunity for education. It's more affordable than a four year program and is a great option for people who need hands on learning or are looking to start a second career. The school is growing, which presents a lot of additional opportunity and benefits for the staff.", "cons": "I wouldn't necessarily say this is a con, but this is a place where you are expected to work hard every day. All of our faculty is very passionate about whatever they do, and given that it's a small environment, everyone has to be a team player. If you are willing to put in the effort and learn, this is a great place for you!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Oct 2021", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "The staff is extremely friendly, approachable, and helpful. The schedule is great for balancing work and life because weekends are typically off and Friday is early release. The work environment itself is calm. Daily objectives are very clear and achievable.", "cons": "Nothing really unexpected. If you are not familiar with basic tech/software or being on the phone often then it may become an issue."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Dishonest, disorganized", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Dec 2021", "job_title": "Instructor in Orlando, FL", "duration": "N/A", "pros": "Great coworkers. Okay pay and benefits. Consistent hours.", "cons": "Was asked to do far more work than I signed up for. Administration was unfriendly and treats instructors like they are disposable. Ended up doing off the clock work constantly to keep up. Women beware, it can have a boys club atmosphere."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "jlj", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Feb 2022", "job_title": "Graduate Research Assistant in Melbourne, FL", "duration": "N/A", "pros": "great environment\r\nhighly competitive\r\nfast pace environment", "cons": "more focus on the cultural community"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Love it at F.I.R.S.T.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Aug 2021", "job_title": "Student Success Coordinator in Orlando, FL", "duration": "N/A", "pros": "I've been at F.I.R.S.T. for almost three years now and I can't say enough good things about it. I began working here during a really big transition in my life and I couldn't have worked for a better company during this time. They've also given me the opportunity to move into other positions. Grateful to be a part of the F.I.R.S.T. team, great place to work!", "cons": "After the upgrade to the new building, I can't think of any."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Creating a Path", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 May 2021", "job_title": "Director of Campus Affair in Orlando, FL", "duration": "N/A", "pros": "It has been an absolute pleasure to join this team. I have been empowered by the fierce leaders in this company to develop a different area of the business. Day to day operations allows you to be creative and troubleshoot relevant issues. The accommodating attitude from the team allows you to feel supported and valued. I can’t wait to see where this journey takes me within the organization.", "cons": "At this moment I have zero cons to share."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Be Careful....", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 May 2021", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "Some do well here, some do not.", "cons": "It's a very anxiety ridden environment for some unfortunately, it is very much a sales position so there is a lot of unnecessary pressure and stress even if you think you are performing well. Also there are not really any benefits, all you get is some vacation time, there is no overtime, and the health insurance is expensive. Overall not a creative, encouraging, or nurturing environment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great place to work if you like a fun, professional, laid back environment.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Apr 2012", "job_title": "Admissions Advisor in Orlando, FL", "duration": "N/A", "pros": "The F.I.R.S.T. School, Orlando students are great, and it had a great team environment. I had a office with 3 cubicles, and even though I don't work there currently, I have mostly positive things to say.I made a few friends with the other staff members, and had a few nice staff days together. One thing that I wish they had was a better benefits package as I really did need to have health insurance and they did not offer that at the time. Other than that, my pay was decent for what I did, and I could mostly do what I needed to do with our much over sight from Donney Smith (School Director) or Alan K. Forbes (Director of Admissions). Overall, great place, and the school is really growing.", "cons": "Because of the smaller private size aspect of the school, the benefits package was very small, and did not include health care insurance at the time, not sure if they offer it now either."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Admissions Representative", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jan 2018", "job_title": "Senior Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "Great team environment, open and honest teammates which adds to the small family environment, great for both seasoned and new admissions representatives. Fantastic work / life balance, respectful of time off and having the weekends to spend with family.  Able to leave  pre recorded, automated voicemails and work with the velocity system, doing all the busy work for you so you can just focus on your daily and weekly activities, as well as enrolling students.  We all  work in sync with the financial aid department to have strong starts every 2 months, expected goals are within reason, and push you to become a better representative, leading to promotions and raises after your 90 day and annual review.", "cons": "Having 2 DOA's get's a little confusing at times when it comes to policies and procedures. Ability to grow to different tiers/ promotions is not outlined in the employee handbook.  Personal days  are extremely limited, would love to have more included after 90 days  in case your sick for a week and not use vacation time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jan 2020", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "I really liked the training here at F.I.R.S.T. I have gone through some intense and extensive training before but nothing like this. The leaders of this school really want you to be successful in your position so they provide tips and tricks. Philosophical techniques to do on the phone when it comes to speaking with students. \r\n\r\nThe environment is amazing as well, they're motivated and believe in helping the students grow and develop themselves into a career for their future. This program is amazing for students to get involved in because they don't have to waste time getting an education with classes that don't pertain to what they really want to learn. Its hands on , career focused with an opportunity to get their foot in the door after graduation. Sounds like a win win to me. \r\n\r\nWork balance life is good and you get to connect with the CEOs of the institution who built this amazing school and they're amazing individuals.", "cons": "No cons really, it can get hectic some days but that's a good thing."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Current Film Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2017", "job_title": "Film Instructor in Orlando, FL", "duration": "N/A", "pros": "The main pros are that students get their hands on training starting from the very first day. They learn most of the essential skills to allow them to seek work in the film industry and speak intelligently about most areas of the industry. I feel that the fast pace of learning gears them up for what they can expect in the real world. The school is a tight knit family from the very top to the very bottom. I could not have been treated better or with more respect that I have here. I love the staff and students and this is where I would like to work until I retire.", "cons": "Being fast paced it can be hard for some students to keep up. Although we try are best, if they miss a lot of classes they will quickly fall behind. It would be nice to have a more formal tutoring process or possibly peer tutoring."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "We are a Family!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Feb 2019", "job_title": "Director of Career Development in Orlando, FL", "duration": "N/A", "pros": "There are not too many opportunities where you can help change the course of someone's life, but here at F.I.R.S.T. Institute, this is what I get to do on a daily basis.  I have enjoyed each day I have worked here and look forward to being here for a long time. I started off as a part time Career Development Advisor and now I get to direct the Career Development Department. There is definitely opportunity to grow and everyone here is treated like family. My Mom had passed away of Breast Cancer and throughout that difficult time, everyone was very patient with me.  They gave me their full support and for that I am forever grateful! Definitely the best company to work for!", "cons": "There is nothing that comes to mind."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "No place like F.I.R.S.T Institute (FL Institute of Recording Sound and Technology)", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Feb 2019", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "F.I.R.S.T is celebrating our 15th year of educational excellence!  It's a very exciting time for us as we continue to grow and thrive, and the admissions team is consistently changing lives each day and helping students achieve there dreams! We As a member of staff, we have a great work / life balance - no weekends!  Pay is within industry range and it's important to not that you are working for a stable company that is licensed and accredited!  Owners care about there staff, there facility and oversee general operations.  The department structure is known from day one and is easy step process to move up with the company.  Still new, so there is plenty of room to grow up with the company and progress in your career.  You can come into work every day knowing your doing something positive for others and working alongside some of the best co workers ever!  Students, faculty and staff all love the creative culture  and warm environment here.  Admissions team is extremely helpful and always looking for the students best interests.  Inclusiveness, diversity and equality are celebrated here.", "cons": "Other than some policy changes for sick time increase in # of days allotted per year in case you need to be out more than 3 days in a row , life insurance policy for $50,000 min, and  vacation time increased to 2 weeks after 2 years vs 3 years of service, absolutely nothing! If the policy does not change, its still A TON  more pros than cons in my opinion."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Working Environment!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Sept 2018", "job_title": "Marketing Associate in Orlando, FL", "duration": "N/A", "pros": "I love working at F.I.R.S.T. because of the friendly work environment. The directors as well as coworkers are very inclusive and really help you get acclimated to the space and progress in your position. It's fun to work here because you're working to help students reach their career dreams and get a quality education. I have enjoyed the experience that the directors and staff bring to the table as far as the digital media industry. Definitely recommend to those looking for a job!", "cons": "My boss is just way too nice, haha. I've got nothing."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great All Around", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Jan 2018", "job_title": "Marketing Associate in Orlando, FL", "duration": "N/A", "pros": "Working at F.I.R.S.T. Institute has been an incredible experience. Our needs in the marketing department are always met. If there's anything we need, we get it and it makes our task smooth as possible. I love the open environment. When we have recommendations, concerns or questions, we always discuss it as a team. Our input is always welcome and appreciated. One of the best jobs and teams I've ever worked for.", "cons": "There's never been a negative experience. Management is always respectful."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Admissions Department", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Sept 2018", "job_title": "Director of Admissions in Orlando, FL", "duration": "N/A", "pros": "I have enjoyed my many years here at F.I.R.S.T., mainly because the job is so fulfilling. As well, the staff is always courteous and ready to help out in any way they can. Its great to work at a place that, regardless of your position, everyone is on the same page to make it a fantastic school!", "cons": "I can't wait until we can grow even more, as I know our programs work and our graduates do so well!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good Atmosphere/ Amazing Staff", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Sept 2018", "job_title": "Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "Wages are awesome compared to other jobs in the area/ staff is amazing/ Leaderhip is extremely flexible with hours and schedule/ Friday half day is awesome/ leadership incorporates ideas from staff and puts it into practice immediately.", "cons": "Wish we had more vacation time/this company really has no cons- this institute is a blessing to the community."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Everyday is an opportunity to make dreams become a reality! What's better than that!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jan 2020", "job_title": "Director of Admissions in Orlando, FL", "duration": "N/A", "pros": "The best work environment and teamwork anyone can ask for!  Passion, motivation, commitment to success from all!", "cons": "None!  More growth means more opportunities to help more people!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "first institute", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Mar 2017", "job_title": "Instructor in Orlando, FL", "duration": "N/A", "pros": "great employees , family like vibe....", "cons": "broken gear doesnt always get fixed in a timely manner , low pay ..."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Assistant Admissions Representative", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Feb 2019", "job_title": "Assistant Admissions Representative in Orlando, FL", "duration": "N/A", "pros": "I love working here! Great leadership, clearly defined expectations & goals, healthy work environment, and a lot of support is in place for you to succeed.", "cons": "I can’t really think of any!"}]]