[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good work culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2022", "job_title": "Analyst in New York, NY", "duration": "N/A", "pros": "Helpful team and colleagues in the company", "cons": "No cons, at least from my experience"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Work culture needs improvement", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2023", "job_title": "Senior Grants Manager in New York, NY", "duration": "N/A", "pros": "-working with country teams -gain experience -tuition assistance after 2yrs", "cons": "-no support or comprehensive training -extremely fast paced -minimal work life balance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Apr 2023", "job_title": "HR Manager in New York, NY", "duration": "N/A", "pros": "Great benefits and access to University", "cons": "Long hours and travel required"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good stepping stone, overall terrible place to work", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Nov 2021", "job_title": "Communications in New York, NY", "duration": "N/A", "pros": "-Interesting projects\r\n-Ability to travel\r\n-Opportunity to work with some really smart/motivated people\r\n-Looks good on resume", "cons": "-Little to no room for growth\r\n-Low pay\r\n-Long hours and expectations to work around the clock\r\n-Poor sr. management\r\n-Toxic work culture\r\n-Horrible facilities\r\n-No work from home"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Decent employer", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Jun 2021", "job_title": "Procurement and Logistics Officer in New York, NY", "duration": "N/A", "pros": "The work people do genuinely makes the world a better place, even if sometimes it's mired in senseless bureaucracy due to Columbia and US Gov't policies and structures (funding is mostly USG grant-based). Leadership is generally respectful and considerate. Benefits are above average, especially unlimited sick leave and 25 paid vacation days/year with option of carrying over some unused days into the next fiscal year. Office environment is generally friendly and low-drama. Depending on the job, there are often opportunities for domestic and international travel which are fun and great learning experiences.", "cons": "Sub-par work-life balance. Leadership people are workaholics and the work expectations trickle down into the rest of the organization. Leadership is stuck in the Compensation is average for the market at best. Office space is crowded and limited (no common dining areas, very small conference rooms, etc.). Resources provided for work such as IT equipment, desk equipment, etc. veer toward the cheap side (asking for a Mac laptop to work on is laughable). Professional growth opportunities are also quite limited due to nature of funding and organization structure. Your best bet for promotion is to have someone vacate a position you desire and are qualified for."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Burnout is real", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Jun 2022", "job_title": "Communications Officer in New York, NY", "duration": "N/A", "pros": "Decent pay and benefits for global health sector", "cons": "Little respect for employee’s time or effort\nHarsh environment \nExpectation to work 24/7"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mixed", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jun 2022", "job_title": "Program Manager in New York, NY", "duration": "N/A", "pros": "Conducts meaningful and impactful work", "cons": "Disconnected leadership, everything takes infinitely longer than it should"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "organizational  change needs to happen ASAP", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Oct 2021", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "-Opportunity to work with prominent researchers in the field and within an Ivy League university\r\n-Opportunities for travel (less so during the pandemic of course)\r\n-Decent benefits working for Columbia University, like generous vacation days and good healthcare options\r\n-Salaries are comparable to other NGOs, so not bad\r\n-The organization receives plenty of new funding opportunities including COVID-related work", "cons": "-Many managers overwork and bully their own staff as well as those in other units. Unless you luck out with a supportive manager, you are expected to be available for work at all hours. It is near impossible to enjoy vacation as it is frowned upon to actually be offline during days off and senior staff set a poor example by responding to emails at all hours even during their own vacation time. Some managers show no appreciation for the work their staff do, despite junior-level staff doing the majority of the work driving projects forward. \r\n-Little appreciation is given to country staff, especially when grant-related deadlines are set without any respect for time zone differences and competing priorities. ICAP should be working to decentralize the work from HQ and give more power to country teams to lead the projects in their own countries. There are too many people hired in NY to do jobs that should be handled locally.\r\n-ICAP HQ refuses to push back on unreasonable requests from the funder and prides itself in \"never saying no'' to funding, even if it is not in the best interest of the organization or staff.\r\n-The majority of senior management at HQ are white, cis, straight people, and you can feel the impact of that trickle down. ICAP formed a Racism Taskforce in June 2020 and it is hard to tell if the taskforce has any actual power to enact change or if anything has in fact changed since then.\r\n-After working remote for 16 months, the organization is forcing everyone back to the office at least 3 days per week. Currently everyone must wear masks for the full workday unless they have their own private office (senior management)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Salary", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Mar 2022", "job_title": "Nutritionist in Kent, WA", "duration": "N/A", "pros": "Good company to work for", "cons": "Contractual jobs which can end anytime"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great cause for global public health work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Feb 2022", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The people, the programs, the diversity, helping to shape the course of global health.", "cons": "Too many projects and deliverables to handle at the same time."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "No.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jul 2021", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "-Great pay - The only thing keeping me going by the end. \r\n-Excellent benefits - Besides the standard benefits, some highlights include ability for you and your dependents (spouse, children) to study at Columbia for free, and contributions on your behalf to a retirement account, regardless of whether or not you make your own contributions \r\n-Work life balance achievable (with effort) - Many people don’t achieve it, but if you make the conscious choice that you won’t bleed yourself dry, you can close the laptop at 5.30 every day and go live your life\r\n-The people - 95% of the people I worked with were amazing and inspiring and doing really good work.", "cons": "Zero accountability - Consistent pattern of country teams ignoring requests for funder-required deliverables, or of turning in shoddy and frankly embarrassing work. When this happens, HQ staff are expected to polish a turd. It’s one thing to collaborate on things together to build off each other’s strengths and close weakness gaps; this is not that. Some teams have learned that there’s no consequences for this kind of behavior, so they run with it; can’t blame them. Every time this gets raised to management, employees are told to report it next time it happens, which they would, but nothing ever changed and the same cycle repeated time and time again. \r\n\r\nOverly prescriptive on the weirdest stuff, ignores the real issues - Staff will get guides with exact email language they should use to circulate a pdf, but no one seems to know who’s responsible for more major tasks like managing financials on certain projects. \r\n\r\nOverloaded portfolios - No one at the mid level can do the quality of work they’d like to do because they’re overworked and have no admin support \r\n\r\nPost-COVID measures show zero care for what employees want - It’s a widely known “secret” the founder doesn’t like remote work. Staff have been told not to ask about it, despite there being a Columbia policy allowing it. In post covid times, teams had hoped there would at least be a conversation about what returning to work looks like. Instead staff got an email with a top down diktat about how this would be managed (spoiler: it wasn’t sensitive to what people wanted, nor did it even ask employees what they wanted). Kicker is most staff are finding themselves commuting over an hour one way to sit in solo offices alone with their doors closed b/c of Columbia covid requirements, which they could frankly do from home without the stress or cost of a commute. A lot of people are leaving in response to this. When staff raised concerns about return to work and expressed a desire for a conversation about the new normal, they were shut down, which is quite on brand. There are far too many global health and global development orgs and companies out there doing things like employee surveys, and responding to what employees want, for them to be taking this approach. Frankly, people have options and they’re going to exercise them if this keeps up. \r\n\r\nNo growth - No path for growth. If you look at the org chart, the mid level people with titles like “Senior Blah Blah Blah” are the bottom of the org chart, so they’re supposed to be Senior Blah Blah Blahs while also doing insane amounts of grunt and admin work. Past these roles, you get to a Deputy Director or Director, and there’s only a handful of these, so if you want to grow you have to go"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great Mission and Dedicated Staff, High Rate of Burnout", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Dec 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Dedicated and hardworking teams, opportunity to work on a number of different projects, and gain new skills. The organization is always on the lookout for new funding sources and diversifying its portfolio and job security is high.", "cons": "Little to no opportunity for advancement; at times it is unclear why people who did advance received a promotion. Salaries are low compared to other organizations for the amount of work you do, and annual increases are roughly only 1-3%/year. Burnout and turnover are high, and morale can be low at times. There is a lot of work, and little appreciation of staff. Some are quick to blame others for problems in projects, often those at a higher level not taking responsibility for projects that they manage."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Team and Flexibility", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Apr 2021", "job_title": "Data Analyst", "duration": "N/A", "pros": "- Flexible work load\r\n- Supporting team members\r\n- Growth mindset \r\n- Open to discussing innovative solutions\r\n- New challenges", "cons": "- HR department isn't that great with respect to prompt and accurate responses"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Zero Work Life Balance", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Sept 2020", "job_title": "Officer in New York, NY", "duration": "N/A", "pros": "Opportunity to contribute to meaningful projects\r\nUnique travel opportunities\r\nLinkage to larger Columbia University resources", "cons": "Zero project management employed by leadership - trickle down of crunched and demanding project timelines\r\nGeneral rudeness widely accepted in all interactions - courtesy and kindness very rare in communication\r\nZero growth opportunities - linger at Officer role for years even as responsibilities increase\r\nWork/life balance is nonexistent as urgent and demanding emails are received all times of day and night\r\nA culture of perfectionism that isn't drawn from a desire to do better and be better but from trying to appeal to leadership's egos."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Specialist", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "18 May 2016", "job_title": "Specialist in New York, NY", "duration": "N/A", "pros": "The benefits Columbia offers, some competent peers", "cons": "Very little respect for employees (expected to work 24/7, on holidays and even on vacation), salaries that are well below market rate and laughably low raises, no opportunity for advancement, no training opportuniteis offered, out of touch with the public health world."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Mission, Low Employee Satisfaction", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Sept 2014", "job_title": "Project Officer in New York, NY", "duration": "N/A", "pros": "Fantastic university environment and very good health, dental and retirement benefits. The mission of the organization is very important and the senior researchers are inspiring experts in their fields.", "cons": "Career growth and employee satisfaction were not prioritized so employee talents were underutilized. University bureaucratic structure made it difficult to let go of under-performers or promote high-performers."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Strong mission but disloyal to its own values", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Oct 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Meaningful work, numerous opportunities for learning (but not advancement)", "cons": "Staff and faculty of color treated differently with mainly whites given or advanced to meaningful leadership positions."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "I enjoyed my experience at ICAP.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Dec 2011", "job_title": " in New York, NY", "duration": "N/A", "pros": "Work is meaningful and has an impact in support of the fight to stop the spread of HIV/AIDS in Africa.\r\n\r\nOpportunity to work with some very talented people.", "cons": "The upper-manhattan location (Washington Heights) can be a bit of headache to get to.\r\n\r\nVery few places to go for lunch."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poor management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "29 Sept 2020", "job_title": "Project Manager in New York, NY", "duration": "N/A", "pros": "International Travel \r\nGreat Mission\r\nGood Colleagues\r\nInteresting Research\r\nTuition benefits", "cons": "Detached and out of touch management\r\nDepartmental favoritism\r\nSiloed departments\r\nLacks diversity \r\nInexperienced management"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Demeaning and rude, very demanding.  HR was no help whatsoever, as usual. I felt I was being setup for failure.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Nov 2011", "job_title": "Office Manager in New York, NY", "duration": "N/A", "pros": "The focus of the group was great, and colleagues were nice, but management wasn't what you expect from people in the healthcare business.", "cons": "Family leave to take care of a spouse dying of cancer was brutal, and only allowed 3-days after passing before due back at work."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Meaningful work and interesting projects for a part-time graduate student role", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Sept 2020", "job_title": "Short-term Casual in New York, NY", "duration": "N/A", "pros": "Get to work on a variety of interesting projects", "cons": "Can be a bit fast-paced for a part time role"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Doing great work for humanity", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Feb 2019", "job_title": "Officer in New York, NY", "duration": "N/A", "pros": "Travel opportunities and unique projects", "cons": "Hard to keep work-life balance"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Employer, Great Impact", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Oct 2020", "job_title": "Advisor in New York, NY", "duration": "N/A", "pros": "It's a supportive work environment with good leadership", "cons": "Short turnaround for deliverables at times"}]]