[[{"date": "16 Jan 2022", "title": "Tutor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bergen Community College", "Interview Descriptions": "They asked questions and I answered, there were some requirements, they wanted sample documents, etc, I went there, talked to them, send documents they reviewed , give fredback, it was good", "Interview Questions": "What is your goal for this job"}, {"date": "1 Sept 2020", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bergen Community College (Jersey City, NJ) in Feb 2018", "Interview Descriptions": "They ask you to go through your resume, make sure you study your resume properly. Tell me about yourself is a must question that would be asked. Just be yourself and you will be fine", "Interview Questions": "Run through your resume for me and tell me about yourself"}, {"date": "4 Nov 2018", "title": "Assistant Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Bergen Community College (Paramus, NJ) in Jul 2017", "Interview Descriptions": "I submitted my application in person, as I was already working there and was than interviewed with formal questions by a search committee a month later.  It was a very stiff artificial feeling type of interview with people that I knew and had already worked with pretending not to know me.", "Interview Questions": "Questions about technology accomplishments "}, {"date": "21 Feb 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Bergen Community College (Paramus, NJ)", "Interview Descriptions": "They have you do a pretend lecture of the subject you wish to teach. They let me know on the spot if I was hired or not. We then talked about what days and hours I would be available to teach.", "Interview Questions": "What experience do you have?"}, {"date": "16 Nov 2016", "title": "Student Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bergen Community College (Paramus, NJ) in Sept 2016", "Interview Descriptions": "First I applied online and then was called in for an in-office interview. It was fairly similar to how other interviews have been conducted. They were very patient and attentive. It wasn't too intimidating and they were very welcoming.", "Interview Questions": "They asked simple interview questions such as,\r\n\"what are your strengths/weaknesses\"\r\n\"why are you fit for this position\"\r\n\"what are your past job experiences\""}, {"date": "7 Jul 2016", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bergen Community College", "Interview Descriptions": "This was in 2007 so hopefully things have changed since then:  I was called to schedule an onsite interview by someone who was unable to tell me where on campus I should park, was \"not sure\" who would be doing the interview, did not know what I would be required to present, or a definite start time.    I never received a confirmation, so when I called to confirm the week before the interview, I was transferred through offices until I was connected with someone who -- when asked to confirm the interview -- blurted out \"Oh, I thought that position was already filled.\"   That's when I knew it was a dirty search and an internal candidate had already been promised the position.   At this point I was so amused I went forward with the \"interview\".   Arrived on campus only to be told to \"Please take a seat and wait while they find the search committee\".  An hour later, I was escorted into a conference room in which two students and an assistant student activities director were seated.   Apparently, they were the search committee -- never mind that the position had nothing to do with student activities.   Amused, I answered their questions even though the questions had nothing to do with the job to which I had applied.   No one wrote down a word.  Not surprisingly, I did not get an offer and but the next week received an email that someone else had been hired for the job.   No surprise there.   Since then, I accepted a nice position with a competitor institution and have never looked back.", "Interview Questions": "If I was married."}, {"date": "30 Apr 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Bergen Community College (Paramus, NJ) in Mar 2016", "Interview Descriptions": "There was not much of an interviewing process, which I appreciated since the chair of the department was looking at my course experience and therefore allowed me the freedom to select which courses I wanted to teach.", "Interview Questions": "What range of courses can you teach?  "}, {"date": "8 Dec 2020", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bergen Community College (Paramus, NJ) in Feb 2016", "Interview Descriptions": "It was okay, not bad at all. It was pretty easy. I got there early and left early. I was in  and out. Be sure to bring a copy of your  resume", "Interview Questions": "What are your positive qualities"}, {"date": "27 Sept 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Bergen Community College (Paramus, NJ) in Jan 2015", "Interview Descriptions": "Brief and cold ...no interest from the interviewer(s) .... felt like a number not an educator ... they were impressed by my resume punches but not willing to pay me for my experience.\r\nMs B was the HR contact but very cold and distant ... reminded me of a bad movie scene \r\nmet Mr Miller after like him alot but chose not to take the job", "Interview Questions": "last job I taught\r\nmy hours\r\nmy curriculum\r\n*my resume had too many bonus punches and was over qualified"}, {"date": "15 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Bergen Community College (Paramus, NJ) in Mar 2013", "Interview Descriptions": "Admin has interviewed about my basic computer skills as well as your personality. Your preferred job environment.  It was not hard questions. Then you have the chance to have to meet the supervisor there.", "Interview Questions": "Are you familiar with handling Windows and Mac OSX?"}], [{"date": "14 Feb 2016", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Bergen Community College (Paramus, NJ) in Mar 2013", "Interview Descriptions": "Had phone interviews with Director and Executive Director. Then visited and discussed the entire project as it related to the many aspects of my skills and experience. It was pleasant but thorough and it appeared that I was a fit both culturally and in terms of my capabilities.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Oct 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Bergen Community College (Paramus, NJ) in Nov 2011", "Interview Descriptions": "i was hired by search committee, as my job was upper level admin job. they contacted me shortly after i sent in resume, that part did not take long. was interviewed in december, called back for second interview in march, and then told i was lead candidate and that they wanted to hire me, 2 more months go by, i had to make it rain, so i spoke up and we finally made it happen....6 months from start to finish. i loved the people and the location, they were a little strange, but i expected that. everyone was supersweet and my kinda people.", "Interview Questions": "easy questions, for the most part: name one problem that you have solved on the job and how you did that."}, {"date": "5 Sept 2011", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bergen Community College (Paramus, NJ) in Dec 2010", "Interview Descriptions": "You go to the office of the department and you request an appontment for an interview. Once intervied they ask if you have any experience with sign language or deaf people. They explain what youd be required to do then they get your information and wait to be called.", "Interview Questions": "How would you talk to  student who is deaf if an interpreter is not around?"}, {"date": "8 Mar 2014", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Bergen Community College (Paramus, NJ) in Sept 2010", "Interview Descriptions": "Interview consisted of attending a meeting and taking notes, providing notes of the meeting to the lead instructor who I don't think ever even read them. Attended a total of three meetings before she put me on the payroll, even though it was implied to others that I already was.", "Interview Questions": "That I wasn't asked a single one other than if I could use Datatel and HTML. "}, {"date": "2 Feb 2013", "title": "Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bergen Community College (Paramus, NJ) in May 2009", "Interview Descriptions": "I replied to an ad on the college's website.  I went for an interview, and spoke to several people separately on the same day.  The conversations were reasonably pleasant and informative.  After the interviews, I never heard from them.  I would have expected, after going there and speaking to them, that I would have received, at least, a letter telling me that I was not hired.", "Interview Questions": "There were various questions about my ability to trouble-shoot computer problems.  "}]]