[[{"date": "22 Feb 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at VON Canada", "Interview Descriptions": "3 people interviewing, lots of situational questions. It was very stressful but they just want to see how you react. They are looking for your body language and reactions to their questions and your responses.", "Interview Questions": "How would you proceed if you walked into a clients home, and they were on the floor."}, {"date": "25 Jun 2021", "title": "Personal Support Work Psw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at VON Canada", "Interview Descriptions": "It was a panel interview. They went person to person asking questions. It was via video chat. It was a little intimidating, but the questions were your average interview questions so nothing too extreme. Then you wait a couple days and they get back to you.", "Interview Questions": "Where do you see yourself in 5 years? \r\nWhy do you want to be a PSW? "}, {"date": "31 May 2021", "title": "Personal Support Work Psw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at VON Canada (Toronto, ON) in May 2021", "Interview Descriptions": "They zoom call and ask question they let you know about what is going to happen. They contact your references. You wait.  Then you either accept or deny the position if offered", "Interview Questions": "Strengths"}, {"date": "10 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VON Canada", "Interview Descriptions": "an interview is arranged via admin assistant. the interview took place on site. questions surrounded nursing skill and qualifications to work independently in the community, and ensuring you have a car as that it required. I heard back in about 3 or 4 days with a job offer following the interview then orientation was on site combo of classroom and at home learning with in the field shadowing.", "Interview Questions": "Order of prioritization of clients \r\n- diabetic management \r\n-wound management with an apt \r\n- s/c med mgmt "}, {"date": "14 Jan 2021", "title": "RPN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VON Canada", "Interview Descriptions": "I applied on the company website and was contacted about 4-5 days later. The ZOOM interview was straight forward; I was asked about 3-4 questions and was provided more information about the job. The interview lasted about 30-45mins in total and was quite enjoyable.", "Interview Questions": "What are two of your strengths?"}, {"date": "24 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at VON Canada", "Interview Descriptions": "Was greeted very warmly, had a great interview, was very informal. Started off filling out a skills checklist and then discussion revolved around my skills and hours available to work. I   was offered the job at the end.", "Interview Questions": "What expereince do you have "}, {"date": "30 Mar 2022", "title": "Client Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VON Canada (Toronto, ON) in Oct 2020", "Interview Descriptions": "Two phone calls in total. First one with the manager of my would be position to screen, then if you pass that, a second interview with the same person and another manager.", "Interview Questions": "How did you know this company? Why do you want to work here? How do you deal with an angry customer? What steps did you take to resolve an issue with said customer? Are you good with multitasking? How do you multitask?"}, {"date": "27 Oct 2019", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at VON Canada (Toronto, ON)", "Interview Descriptions": "telephone screen then face to face interview.  Waited weeks before hearing anything from HR department.  Did not seem connected to interview process (checking phone during session?).  1 hour interview.  Began 15 minutes late", "Interview Questions": "Why this organization? Many 'what would you do questions' along with understanding of community health. Why did you leave your last employer? Future academic  considerations?"}, {"date": "8 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VON Canada", "Interview Descriptions": "Question and answer format. It was less conversational than I expected and it seemed very rehearsed. There were two interviewers each taking turns asking questions and writing down the answers to the questions that I provided", "Interview Questions": "What level of working independently do you like? "}, {"date": "31 May 2022", "title": "RN/Visiting Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VON Canada (Toronto, ON) in Aug 2019", "Interview Descriptions": "The interview was long and conducted by a panel of interviewers.  They inquired about transportation ability, having a phone, and were very particular about clients being phoned to let them know when you will be there.  They covered experience, and liked wound care courses.  They discussed use of supplies and time constraints.", "Interview Questions": "What would you do if you don't know what to do when at a client's home?"}], [{"date": "17 Apr 2018", "title": "Lisenced Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at VON Canada (Halifax, NS) in Apr 2018", "Interview Descriptions": "Was very simple, I arrived, and the lady at the front desk greeted me and told me she would let them know I was there. Manager came and got me, They introduced themselves, explained what I had applied for. Asked me questions based on my qualifications and then some scenarios. At the end they asked what my references would say about myself, and then thanked me for coming.", "Interview Questions": "You have 3 people to see this morning, Who do you see first, second and third\r\n1. a paralyzed man who needs his bowel care, which takes 2 hours to complete. He likes it done before his care provider comes in at 10am.\r\n2. a diabetic lady who need insulin in the am\r\n3. a lady who needs wound care done who needs to be at work for 9am. "}, {"date": "26 Jul 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at VON Canada (London, ON) in Dec 2017", "Interview Descriptions": "One time job interview with managers (1-2), about an hour length; skills review by questionnaire \r\nFriendly and stress less interview \r\nAfter the interview, you probably know you have been selected if they asked you what scope of services you can work for and how far you can work for them.", "Interview Questions": "Scenario question, medicine calculation "}, {"date": "14 Oct 2016", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VON Canada", "Interview Descriptions": "I applied online and then heard from a recruiter about a slightly diffeent position 2 months later\r\ninterview was in the office with two managers\r\nbegins with long explanation of job to ensure you are still interested\r\ninterview is set with many questions and interviewers write notes\r\nsome situation questions\r\nconversational tone\r\nlooking to make sure you understand CNO requirements\r\nfollowed by brief written test\r\nfollowed by online reference form for 3 references\r\nwas offered job at interview", "Interview Questions": "Tell us about a difficult situation and how you handled it."}, {"date": "24 Oct 2017", "title": "PSw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at VON Canada (London, ON) in Feb 2016", "Interview Descriptions": "Phone call interview , then asked to come for one on one interview. They asked several questions about role of psw and skills review. Checked my references and wanted police check before starting, interview process took one week to the job offer.", "Interview Questions": "Why did you leave your last position"}, {"date": "11 Feb 2016", "title": "CSA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at VON Canada (Toronto, ON) in Apr 2015", "Interview Descriptions": "Panel interview (2 people) typical behavioral questions such a \"Can you tell us a time when...\" \r\nAlso ask about work experience and how you would prioritize, etc. They were in a hurry to hire and everything seemed in a rush, although I was kept waiting over 40 minutes past my appointed time before I was called in. Other applicants were arriving who were scheduled after me, seemed unprofessional.", "Interview Questions": "You are having a busy day and the phone is ringing, you have 3 urgent emails and someone is sanding behind you asking for something. What do you tackle first?"}, {"date": "26 Aug 2016", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at VON Canada (Toronto, ON) in Nov 2014", "Interview Descriptions": "quick, structured, interviewer writes down your answers, relaxed. allowed me to ask questions, gave background of job and company, phone interview done prior to interview, no offer mentioned, only said we will call you", "Interview Questions": "What is your greatest strength"}, {"date": "11 Feb 2016", "title": "CCA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at VON Canada (New Glasgow, NS) in Feb 2014", "Interview Descriptions": "it was professional and friendly and they made you feel comfortable. The nurse managers were very open and calm and slow in asking questions and allowing time to answer. Also they were nice looking and welcoming", "Interview Questions": "what would you do if a client was on the floor and you could see her threw a window."}]]