[[{"date": "28 Jun 2022", "title": "Digital Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ISEP", "Interview Descriptions": "One zoom interview which went fine. Was told I would hear back one way or the other by the following week and then I was completely ghosted. Sent a follow up email two weeks later and just nothing. It felt completely unprofessional. I didn't necessarily expect an offer, but after a half hour video call, I did expect a response.", "Interview Questions": "What excited you most about the role?"}, {"date": "27 Jun 2021", "title": "International Student Services Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ISEP (Arlington, VA) in May 2021", "Interview Descriptions": "The first interview was with the HR. It was not by phone but by Teams. It took about 20 min. First, the HR Director introduced about ISEP and their mission. And then dived into asking 5-6 questions.", "Interview Questions": "Asked me to go over my resume and explain. "}, {"date": "18 Jan 2019", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ISEP in Dec 2018", "Interview Descriptions": "The process went very smoothly and rather quickly. After submitting my cover letter and resume, I was contacted by the HR director within a week. From there, we scheduled a initial HR screening, which, frankly, was one of the best HR screenings I have ever had. These initial interviews are notorious for being rather robotic and overly formal, but the HR director made me feel comfortable to ask questions, raise concerns, and learn more about the position itself. Afterwards, she quickly responded to schedule a follow-up interview the following week with my main supervisor as well as two other future teammates on the advising and program management team. Not even as much as a week later, I was given an offer letter. I would highly rate the efficiency of this interview process.", "Interview Questions": "How do you prefer to be managed?"}, {"date": "7 Sept 2017", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at ISEP (Porto, Oporto) in Sept 2014", "Interview Descriptions": "Hired based on an interview and professional experience. My resume was evaluated and background was match with the requirements of the job. At the end, it was a good match and I end up getting this job.", "Interview Questions": "What are your interest?"}], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], []]