[[{"date": "8 May 2023", "title": "Creative Artworker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Battersea (London, England) in Apr 2023", "Interview Descriptions": "Emailed Test followed by in person interview where we discussed test and answered a list of questions - interviewed by two members of staff. Only one interview wasn’t shown around or introduced to the team.", "Interview Questions": "Favourite campaign of theirs? What would you expect from a manager? Would you do a job fast or slow but perfect ?"}, {"date": "5 Jun 2022", "title": "Rehoming and Welfare Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Battersea in Jun 2022", "Interview Descriptions": "First submit an application document including statement of purpose, then interview with the head officers and attend an on site assessment in the next few weeks. The process took around 1-2 months to completez", "Interview Questions": "How to handle the client complaints?"}, {"date": "30 Jul 2022", "title": "Operations Directorate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Battersea (London, England) in Jun 2022", "Interview Descriptions": "This relates to two interviews, one in 2020 and one in 2022. I would like my review to reflect the organisation rather than specific interviewers hence I have amalgamated into one review and also omitted some identifying details. Both experiences were extremely positive - the earllier process seemless despite being only a week or two into Covid; and in the earlier interview I reached the final two candidates but was unsuccessful. Follow up and feedback was prompt, thorough and positive and in fact I kept in professional contact with the lead interviewer. Second role interview equally positive, very well arranged and follow up prompt and I was offered employment.  Really like the new online portal. Only downside is having to enter a lot of information in different fields which could be served better by attaching a CV - a bit of a faff when applying for lots of jobs, and indeed multiple roles with the one employer. Also made aware that shortlisting appeared to be blinded (well done Battersea). Just a great experience both times and the organisation seems to be trying hard to run a quality process.  ", "Interview Questions": "Questions were a combo of experience based and approach base. I can't recall specific scenario-based questions per se on either - but approach and values questions negated this. Both role interviews struck a good balance between candor and discretion with also inspired trust. "}, {"date": "7 May 2022", "title": "Marketing Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Battersea in Apr 2022", "Interview Descriptions": "Two rounds with the first being a question answer and with second round being a presentation with more questions. Both rounds were quite rigid with the people just asking questions that were prepared before rather than a conversation about the role. Disappointing that after spending hours preparing for both interviews and having the interviews with the same people and getting to know them, the rejection was an automated hr email which offered feedback upon request but they don’t reply to you even if you ask for it.", "Interview Questions": "Why do you want to work at battersea and why are you fitting to this role"}, {"date": "23 Mar 2022", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Battersea (London, England) in Mar 2022", "Interview Descriptions": "I had a first interview, which was carried out on Zoom. The interviewees were pleasant, but felt slightly cold, closed off and lacking in open conversation when asking their interview questions - more prompts and interest could have been helpful. Personally I prefer a more relaxed interview approach, which this definitely was not. The interview questions related directed to the job spec - to be expected. The team also provided some feedback regarding the interview after not proceeding to the second round of interviews, which most companies wouldn't do, so this was helpful for the future!", "Interview Questions": "Tell us about yourself and background? "}, {"date": "14 Dec 2022", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Battersea (London, England) in Mar 2022", "Interview Descriptions": "The interview process was an extremely formal one, and as a Social Media Specialist role the expectation for a more enjoyable interview was not met. Although the interviewers were friendly and pleasant enough, the questions asked felt much more like an interrogation than an interview. A lot of", "Interview Questions": "A lot of questions around use of influencers and why in my opinion why they are worthwhile using."}, {"date": "7 Aug 2021", "title": "Academy Programmer & QA Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Battersea (London, England)", "Interview Descriptions": "I was invited to attend a one-hour panel interview with 10 minute presentation at the Dog & Cat Home with two members of the Battersea team - the Head of L&D and the Executive Head of the Academy.", "Interview Questions": "What is your experience of working with awarding bodies?"}, {"date": "7 Apr 2023", "title": "Training & Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Battersea (London, England) in Apr 2021", "Interview Descriptions": "Lead interviewer was stunned when he joined Zoom to find I was a black woman. He was so stumped and speechless that I had to get the interview process going. Asked for my slide deck and then when they got them swiftly replied that I didn't have the job...But they were keen to get their hands on my slides", "Interview Questions": "N/A"}, {"date": "3 Mar 2021", "title": "HR Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Battersea", "Interview Descriptions": "Interview involved a very long competency with no feedback or call, interview before hand. Really poor, as I would have expected a pre call or a phone screen first from Battersea.", "Interview Questions": "Went straight to a long competency which in itself wasn't an issue, however the length of it should have been a second stage or received some feedback."}, {"date": "29 Oct 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Battersea in Mar 2021", "Interview Descriptions": "Process was clear - written application submitted online and online interview, with a task. Panel were friendly. A lot of questions but was more of a discussion than a scary interview. No unexpected questions and task was straight forwards. Feedback received afterwards could have been more detailed.", "Interview Questions": "How do you manage a team?"}], [{"date": "10 Jul 2019", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Battersea (London, England) in Mar 2019", "Interview Descriptions": "Very short phone call - interviewer went through my CV to ask me a series of questions. Mostly focused on asking about fundraising. Seemed that they were after someone to do a lot of cold calling for the business to try and get a lot of admin work done for the team.", "Interview Questions": "Asked about my experience in fundraising"}, {"date": "25 Oct 2018", "title": "Canine Behaviourist and Training Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Battersea (London, England) in Sept 2018", "Interview Descriptions": "About 2 weeks after submitting my application I was given an initial hour long interview and dog practical element with a panel of two very lovely ladies who made me feel very comfortable. Then I was accepted for a work trial 4 weeks later. I had such a great time at the work trail day and everyone was so lovely to me. Unfortunately I did not receive the job although got down to the last two candidates.", "Interview Questions": "To order the example days tasks in order of highest priority to lowest."}, {"date": "25 Apr 2018", "title": "Public Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Battersea", "Interview Descriptions": "Quite a lengthy process involving application, presentation on a campaign and then two interviews. The presentation on BSL is a great experience. The interview itself was okay, questions were straight forward. Interviewers lacked enthusiasm and personality and came across slightly awkward. Actual offices looked very nice and environment was very lovely!", "Interview Questions": "A campaign you thought was successful and why."}, {"date": "3 May 2018", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Battersea (London, England) in Apr 2018", "Interview Descriptions": "Before any calls or face to face interviews, the 1st stage involved a task which took 1 hour and 20 minutes. I was happy to complete this even with very little notice. I received an email asking for the task to be completed within a few days or I could attend the office and complete it the next day. I was told I would hear back by the Thursday with feedback. Almost 2 weeks later I still haven't. Considering this was a HR role I would have expected a better process. Before any interviews or telephone calls, to ask for candidates to complete a lengthy task, I think was a lot as it basically just was saving them time interviewing and then to not hear any feedback back even after I have chased on it is unprofessional and a very bad way of interviewing. It felt like it was a waste of my time.  I would have expected a lot more from a HR role and I have yet to speak to anyone on the phone about any of these stages. Hugely disappointing, although I have to say the HR Assistant has seemed to have done her best.", "Interview Questions": "Task based 1st stage, 4 task questions that gave you 1 hour and 20 minutes, which personally wasn't enough time. "}, {"date": "20 Apr 2018", "title": "Cattery Intake Coordinator (Part Time) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Battersea (London, England) in Apr 2018", "Interview Descriptions": "I was met by two members of the cattery team and briefly told about the role before being asked standard interview questions. It lasted about 40 minutes and ended with some scenarios that may be encountered within the role. I received a response two days after the interview.", "Interview Questions": "Have you ever had to give someone bad news and how did you handle it?"}, {"date": "11 May 2018", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Battersea (London, England) in Apr 2018", "Interview Descriptions": "Poorly organised and insulting process from the initial contact. I applied at the start of April, to be  contacted about the role 3 weeks later. I was sent a request to complete an assessment/test that would take an hour and a half, to be completed remotely or on-site. The first time slot given was for same day the email was sent - 2 hours later!\r\n\r\nI agreed to complete the test that evening, but the HR contact sent the email through 45 minutes late. I was invited to a first stage interview a week and a half later with two HRBPs. They seemed inexperienced in Recruitment and took turns to fire questions at me from a printed list. There was no attempt at small talk, or natural flow during the conversation, it all felt very awkward. At one point one of the interviewers asked me detailed questions about my HR qualification and how I was assessed, making a comment about 'how times have changed' as if to undermine my hard work and insinuate I had an easy pass.\r\n\r\nAlso worth noting - they didn't check availability with me at all, just told me the time I would be interviewing over email 'Your interview will be held at XX time on XX date'. Very inconsiderate. \r\n\r\nTwo weeks later I received a standard rejection email - no feedback given, just a confirmation that they wouldn't be proceeding with my application. The email was three days late in arriving. Bullet dodged.", "Interview Questions": "Describe a complicated ER case worked on?"}, {"date": "14 Mar 2018", "title": "Public Affairs Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Battersea", "Interview Descriptions": "Applied online and got an interview. Asked to design a campaign on Breed-Specific Legislation beforehand so I made a 10 minute presentation and 4,000 word report in prep. Went to the interview and was made to wait over 30 minutes in the reception. Interviewer was checking their phone and looking out of the window the whole time and paid no attention to my presentation.  Asked very basic questions.", "Interview Questions": "Who is your political inspiration?"}, {"date": "3 Aug 2019", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Battersea (London, England) in Jun 2017", "Interview Descriptions": "Informal \nSeries of skill related questions \nPractical task \n1 1/2 hours long \n\nInformal style of questioning followed by a practical task and asked to prepare a short presentation. Interviewers were good and made me feel at ease", "Interview Questions": "what is your opinion on BSL"}, {"date": "17 Aug 2017", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Battersea (London, England) in May 2017", "Interview Descriptions": "There was first a 30 mins written test, and then an interview with two people afterwards. The interviewers both took notes when they were asking questions, and they took turn to ask the questions. They had a prepared list of around 20 questions. Many of them asked for you to give examples of when you exercised a certain skill that you would need for the job. Would be important to check the person specifications for the job opportunity!", "Interview Questions": "Can you give an example of a time when you had to prioritise different tasks?"}, {"date": "11 Jan 2017", "title": "Learning and Development Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Battersea (London, England) in Jul 2016", "Interview Descriptions": "I was asked to prepare a scenario based on L&D background and given the chance to present my work in a very conducive and pleasant atmosphere. This was followed by general and then specific questions on my experience and exposure to L&D. Throughout the interview the team were extremely helpful and supportive and their questions were highly professional and focused on the job. I was given sufficient time to asked and discuss the role and their expectations and finally was given a fair review on why I sadly hadn't received the role.", "Interview Questions": "To present a presentation based on a L&D scenario \r\nGeneral question on personal development and reasons for choosing L&D and their company\r\nSpecific questions relating to my previous experience and background in L&D and which areas I had been involved in"}]]