[[{"date": "18 Apr 2023", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at International Justice Mission", "Interview Descriptions": "Long interviews with many rounds including written assessment but very casual settings and friendly interviewers. The location was difficult to locate for safety purposes. Questions asked were very common questions.", "Interview Questions": "Challenges and how you overcome"}, {"date": "7 Mar 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "Very kind interviewer. No stress at all. The phone call lasted roughly 30 minutes. Very pleasant experience. Not too many technical questions. Second interview a week later. Felt like a nice conversation.", "Interview Questions": "Why IJM and what do you expect out of the internship?"}, {"date": "16 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "The process was an application and two rounds, with the second round being with the team you would be joining. The process took place over a 3-4 week period. Pretty simple.", "Interview Questions": "What is your idea of biblical justice?"}, {"date": "21 Jul 2022", "title": "Field Office Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at International Justice Mission", "Interview Descriptions": "2-3 phone interviews followed by one day of 7 individual interviews.  Plenty of opportunities to ask a lot of questions and learn more about the organization! Good process overall.  Allows meeting different leaders.", "Interview Questions": "How you lead during challenges and adversity. "}, {"date": "30 Jun 2022", "title": "Seasonal Donor Caller Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (Washington, DC) in May 2022", "Interview Descriptions": "It was a great interview process. An IJM employee called me and asked pretty standard questions. They did a nice job providing details of what the role required and how long the job would be for. Overall, it was a lovely experience.  ", "Interview Questions": "Are you comfortable speaking with donors? "}, {"date": "14 Dec 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Justice Mission", "Interview Descriptions": "It was a lengthy process, but everyone was kind at each step. The interviews were conversational and thoughtful. It was a great experience overall, and the recruiter was extremely communicative through the entire process.", "Interview Questions": "Why do you want to work for IJM?"}, {"date": "25 Nov 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (Bengaluru)", "Interview Descriptions": "Had two rounds of interview. The First with two staff and the second with the Department's Director. Following this, I was also asked to design a presentation and a prepare a check list for an event.", "Interview Questions": "About my past work experience, why I chose this field of work etc."}, {"date": "12 Mar 2021", "title": "Constituent Relations Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "Three rounds of interviews. First a phone interview with the recruiter, then a phone interview with the hiring manager, and finally a half-day in-person interview with multiple staff members. Pretty straight-forward.", "Interview Questions": "Lots of behavioral based interview questions. "}, {"date": "19 Mar 2021", "title": "Senior Program Writer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (Manila, Manila) in Mar 2021", "Interview Descriptions": "It was structured and organised and the interviewer had good follow up questions. She allowed me to explain and discuss the points to highlight my strengths and listened intently. She was also very cordial and easygoing.", "Interview Questions": "fit into the role, skills, qualities"}, {"date": "24 Jun 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Justice Mission (Washington, DC) in Mar 2021", "Interview Descriptions": "Great interview, which was very fun, comfortable, and holistic. I was lucky to be offered a position, where it appears there are a lot of great people at IJM! The interview was very conversational.", "Interview Questions": "How do you align with IJM's mission?"}], [{"date": "8 Feb 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "I had two interviews (both on the phone), then was offered an internship position fairly quickly after the second interview.  I only declined the internship because I had an offer elsewhere.", "Interview Questions": "- What attracted you to this position?\n- How do you handle stress?\n- How would your friends describe you?"}, {"date": "18 Nov 2021", "title": "Auditor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Justice Mission (Manila, Manila) in Feb 2021", "Interview Descriptions": "I was virtually interviewed by HR in the Philippines.  Afterwards, I sent a couple of follow-up emails to check on the status of my application.  Unfortunately, there was no response at all from HR.", "Interview Questions": "Audit background in nonprofit setting."}, {"date": "3 Oct 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "Was interviewed twice: first by recruiter, then by potential supervisor. Standard questions on background, motivations for applying, asked if I could be flexible with job duties .  Got some behavioral questions on conflict, leadership, and collaboration.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Sept 2020", "title": "Prospect Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Justice Mission (Hong Kong) in Sept 2020", "Interview Descriptions": "A call was scheduled through email on a phone messaging application quite easily for about a week out in advance.  The process took under an hour and covered all bases of a standard interview.", "Interview Questions": "They asked to go through the finer points of my CV and to expound. "}, {"date": "9 Jun 2020", "title": "Temp Role Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "Very kind interview, great teams, got a few emails and then a zoom call with the team, they were very kind and had a lot of questions to ask but very relational team!", "Interview Questions": "Tell about a time I handled unexpected change."}, {"date": "6 Nov 2019", "title": "Financial Analyst, Business Systems Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at International Justice Mission (Crystal City, VA) in Nov 2019", "Interview Descriptions": "Don’t mention remote or telework, the recruiter told me they declined because I brought it up. Also, prayer in the office twice a day and a statement of faith is required.", "Interview Questions": "Describe your experience with an ERP"}, {"date": "23 Sept 2019", "title": "Finance Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at International Justice Mission", "Interview Descriptions": "I've been contacted by a third party recruiter. I did extensive research about the organization and left impressed. When I have been told about phone interview with hiring manager, I was so happy.  \n\nHiring manager called on right time, gave me briefing about his role and the position I was interviewing for. Than he said \"before moving further\" he wanted to confirm If I am Christian by religion (which I'm not) because full time employee at IJM has to be Christian. I understand they are exempt from EEOC. But this should have the part of job requirements. So basically interview lasted for couple of minutes.\n\nIts really disheartening for someone who is actively looking for a job and to be honest I don't have any gruges against the organization or recruiter. It's just the incomplete information they're sharing with candidates.", "Interview Questions": "Are you Christian?"}, {"date": "17 Sept 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Justice Mission", "Interview Descriptions": "The timeline was pretty extended. I applied and heard back months later for the Field Office internship and once I got the first round interview I heard about the second round a week and a half later. Once I got the second interview directly with the Field Office the interview was much more casual and informative about the specific office culture and what my role would be like once there. I enjoyed the process.", "Interview Questions": "Tell me about yourself "}, {"date": "16 Sept 2020", "title": "Program Monitoring and Evaluation Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (Washington, DC) in Sept 2019", "Interview Descriptions": "Great Interview Process. Extremely nice people who care about the organization and just want to see that you are a good fit for their company culture. It was a phone interview with the hiring staff, then the team.", "Interview Questions": "Describe a time you failed and how you bounced back."}, {"date": "13 Jan 2020", "title": "Communication's Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (New Delhi) in Jun 2019", "Interview Descriptions": "the interview process for the interns consisted of three stages. the first one was the CV screening, where I submitted my cv through an online portal. Then I was contacted by the HR who asked basic questions. the third round was conducted by the communications' head who asked me about my previous experience with writing , and that was it.", "Interview Questions": "asked basic questions about my previous internships"}], [{"date": "23 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at International Justice Mission in Apr 2019", "Interview Descriptions": "This was a fairly straightforward and productive process. IJM asks fair questions which serve to screen their applicants well. The interview process is short however at least the phone portion because they have many applicants to talk with and serve.", "Interview Questions": "How have you dealt with a challenge in your life?"}, {"date": "27 May 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at International Justice Mission in Mar 2019", "Interview Descriptions": "The interview process was challenging since the interviewers were highly specialised. There were a total of 5 interviews throughout the process more than I've ever had before. It was interesting since I was interviewed by staff across different offices and continents so learnt more about the breadth of the work.", "Interview Questions": "What is your experience in managing budgets? \r\nExpand on your experience included in your application\r\nWhere do you forsee challenges in the role you've applied for?"}, {"date": "7 Oct 2018", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at International Justice Mission (Washington, DC)", "Interview Descriptions": "Applied for position and 5 minutes later received email that somebody has been already selected for this position. However position was posted on official website only two days before that. So therefore either they have the fastest interview process in the history of humanity or they post online ‘fake positions’ taken already by internal candidates. Not very professional from company having ‘ justice ‘ in its title . I would recommend maybe change name to International Injustuce mission. Also when you ask feedback nicely to the HR, they never respond. Well why would they care right.", "Interview Questions": "N/A"}, {"date": "6 Jun 2018", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Justice Mission", "Interview Descriptions": "I applied in 2012. Sent the application and all its parts through the mail. Once they received the application, I got a 15-minute screen call from IJM, and they told me I'd hear back from them via email if they wanted to proceed. I heard back within the week, and they told me my next and last interview would be with the communications supervisor at one of the international offices. Because of the time difference, the interview took place over the phone at 2 am. A couple time we were disconnected, but I was always able to call back and get through. The interview lasted maybe 30 minutes to 45 minutes. Two weeks went by before I heard back. I actually emailed the recruiter to check on the status of my application and within the next couple days she replied with a yes.", "Interview Questions": "How would my friends describe me?\r\nCan you give an example of how you've handled conflict in the workplace?"}, {"date": "2 Jan 2020", "title": "People Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at International Justice Mission (Washington, DC) in Feb 2018", "Interview Descriptions": "The interview process had 2 phone calls- one with general questions and the second one with more role-specific questions. The interviewers were all friendly and asked standard questions. I also heard back within a relatively timely manner about their decision.", "Interview Questions": "Do you have any experience organizing an event?"}, {"date": "25 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at International Justice Mission (Washington, DC) in Feb 2018", "Interview Descriptions": "It was an interview process with 2 interviews total, not stressful, great people, they got back very quickly in responding to emails and updating on good or bad news. The first one was more general and the second one was a lot more specific to the internship applied for", "Interview Questions": "How do you handle stress?"}, {"date": "2 Aug 2019", "title": "Director of Strategic Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Justice Mission (San Francisco, CA) in Dec 2017", "Interview Descriptions": "After applying online I was contacted by a recruiter from IJM.  We exchanged emails then spoke on the phone.\r\nNext, I had a Skype session with the Sr. Director of Strategic Partnerships.  From there he recommended a face-to-face with a current employee in the same role I was applying for.\r\nAfter the face-to-face I had another Skype session with the Sr. Director and then another Skype session with a long-term employee in the same role in another part of the country.\r\nShortly after this final interview, the original recruiter reached out to share that they were going to continue their search without making me an offer.  \r\nI requested feedback and they replied with some great information as to why I wasn't the perfect fit for the job at this time.  I really appreciated the entire process and the care they took in handling each step.", "Interview Questions": "How passionate are you about the work of IJM?"}, {"date": "5 Oct 2017", "title": "Finance Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Justice Mission", "Interview Descriptions": "Interviewed with five different people. Given both technical questions and questions based on experience. The HR one was mainly about my own spiritual walk. Nothing surprising. Everyone was really friendly and HR reached out to me again within a week.", "Interview Questions": "How do you juggle competing priorities?"}, {"date": "4 Jul 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Justice Mission (Indi, Karnataka)", "Interview Descriptions": "I had different rounds of interview both telephonic and personal rounds. There were organized so well with almost no repeated questions. They asked repeatedly how I will handle integrity issues.", "Interview Questions": "How i will handle integrity issues"}, {"date": "25 Apr 2019", "title": "Legal Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at International Justice Mission in Jun 2017", "Interview Descriptions": "Online application and two phone interviews.   In my situation it took a very long time, almost six months to get the offer.  But I learned later that was because there was a lot of moving around due to visas being denied to legal fellows in other countries in the deployment class before me.", "Interview Questions": "Q: Why I wanted to work for IJM.  "}], [{"date": "15 Jun 2017", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (Arlington, VA) in May 2017", "Interview Descriptions": "If and when you get to the in-person interview step in the process with IJM, it becomes suddenly very formal and thorough – if you haven’t seen any of that before that point. I had nearly a full day of one-on-one interviews with the hiring manager and others across the organization – from 10:00 to 5:00 – with a break to attend the morning prayer time with all staff in the office and for lunch with my HR host (which could have been part of the interview process too, for all I knew). Before my day there, I had been given a formal letter with a formal schedule of my interviews. I was told they do this with all candidates – this long day of interviews – when they want to see you in person.\r\n\r\nHowever, this formality and thoroughness may not be something to mess with, and it may cost you. When I had received my schedule before the day, I had responded via email with a request to go to lunch with a current employee who is an acquaintance. My email was totally ignored and went unanswered. Also, since it’s a faith-based organization, I pressed the hiring manager a bit, wanting to know how much influence, if any, there was of religious beliefs on any business-related practices or procedures in the office. She took it to mean any influence or pressure on employees to adopt certain religious doctrines, and she responded with a firm no, and I stopped trying to explain what I was getting at. It seems there are high expectations to comply with organizational practices, even if they aren’t dictated or even guided by any religious beliefs. There is a certain rigidity to the organization, and I got the feeling that asking questions about them, even just to understand them, is frowned upon.\r\n\r\nOf course, with so many people interviewing me over the course of the day, I had some repetition of questions, but that wasn’t a big deal. In fact, there was less repetition than I expected, mostly due to another very strange thing: After the interview with the hiring manager, it appeared as if every other person had a script to follow – a set list of questions to ask me. Nearly every person asked me their questions as if reading from a list. I wanted to ask one of them who gave them that list of questions. Some took notes on a laptop while I answered their questions. They were interesting, probing questions, and this was the thorough part of the interview – many chances for them to ask about my professional experiences and who I was as a person. Nothing too personal or too off-the-wall (except for one or two questions), but just strangely very thorough – more so than other organizations.\r\n\r\nEverybody was very warm and friendly, personable and hospitable. They were sympathetic to the fact that it was a day full of interviews and being bombarded with questions. Everybody seemed very professional. Many talked about operating at a high level of excellence and being driven to do that personally and by the culture there. There is an energy in the office to do well, to perform at a very high level, to always be working hard, to always be striving for something even better. It was the usual talk I’ve heard at nonprofits about being committed, dedicated and “mission-driven,” but only at an even higher (almost impossible) level. While this was all admirable, I felt like some of it was a bit artificial, like they were expected to be robots, or that there was a false sense of perfection, that mistakes shouldn’t and couldn’t be made. I felt almost like I might be inadequate there if I brought any human frailties or weaknesses into the office or position. That, ultimately, might have been why I didn’t make it past this stage.\r\n\r\nDuring the interview, I was told that I would be given a skills test, which would have to be completed at home within 24 hours of the interview. This was the first time I had been told about having to do a skills test, and I was not pleased to have it sprung upon me like that. (Why could I not have been told in my formal letter, which was sent before the interview, or why could they not have done the skills test when I was with them for a full seven hours?) When I got the test very late that same night, it turns out that I had two or three days after all to complete it. I sent it back after a day, but I never heard anything about it – not even an acknowledgement that they had received it.", "Interview Questions": "Why does Donald Trump use Twitter, and how can his use of it be useful to this organization in advocacy?"}, {"date": "21 Mar 2017", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at International Justice Mission (Washington, DC)", "Interview Descriptions": "I was first scheduled for a phone interview. Within the week, I was contacted to schedule an in-office interview. The on site interview consisted of six separate interviews with various members of the department.", "Interview Questions": "Describe how you handled unexpected changes in your schedule."}, {"date": "20 Apr 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Justice Mission (Washington, DC) in Sept 2016", "Interview Descriptions": "Initially, the applicant will apply online. Internships at International Justice Mission are fairly competitive. In general, you should have pre-existing experience in the field or concentration where you are seeking employment. There is a specified recruiter for all intern and fellow positions through IJM. He is a very pleasant person and takes a genuine interest in each individual. The best part about the interview was that I felt like he wasn't working through a predetermined set of questions. It was very conversational. If you pass this round, you will be passed along to the person who will most likely be your direct report during the course of the internship.", "Interview Questions": "What attracted you to this position?"}, {"date": "18 Sept 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at International Justice Mission (Washington, DC) in Aug 2016", "Interview Descriptions": "Initial phone screen with recruiter, interview with another director followed. In person interview was 8 hrs with each interview consisting of pretty much the same questions. Their hiring process is pretty disorganized and the recruiting team seemed swamped because they are in a hiring surge. It took a few months for them to come back with interview results. I love the organization’s mission and I hope this is not a reflection of how work is done there.", "Interview Questions": "With limited funding what are things you would do to secure our infrastructure?"}, {"date": "29 Feb 2016", "title": "Recruitment Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Justice Mission (Arlington, VA) in Jun 2015", "Interview Descriptions": "The interview process consists of a full day of interviews with a hiring team.. While tiring, the experience was very well-thought-through and enjoyable. The recruiting team pays for transportation of candidates for on-site interviews in the DC area. Candidates meet with a variety of stakeholders throughout the day, including a lunch interview, and joining for the daily all-staff gathering, where the CEO is often present. In my interview process, I was also given a one-hour skills assessment.", "Interview Questions": "Can you describe your experience managing campaigns?"}, {"date": "23 Apr 2015", "title": "DAML Contractor Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at International Justice Mission (Arlington, VA) in Aug 2014", "Interview Descriptions": "Because I was a contractor, the interview process was different than being a FT employee. We interviewed over the phone, reviewed the job description, and if I would be a good fit. Then I met in person with my manager and the team lead to review the process moving forward, signed a contract, and began working. It was efficient.", "Interview Questions": "What strengths do you have that will make you a good fit for this role?"}, {"date": "8 Nov 2016", "title": "IT ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at International Justice Mission (Calcutta) in Jul 2012", "Interview Descriptions": "Five people interviewed me and i had a separate interview with the director on another day. The total process of hiring took a little more than two months. The interviewers were frank and friendly. i was made to feel comfortable and the questions were clear and some were repeated questions from different interviewers. The purpose was to see if i give consistent answers.", "Interview Questions": "Have you ever taken or asked for a bribe?"}, {"date": "30 Aug 2012", "title": "Structural Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at International Justice Mission (Guntūr) in May 2012", "Interview Descriptions": "Site Paid staff. direct appointment n the site with Reference from family and an old staff working in IJM", "Interview Questions": "Reason to stay even though less paid"}, {"date": "14 May 2012", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at International Justice Mission in May 2012", "Interview Descriptions": "Three Phone Interviews over 2 and a half months.  (Heard back each time after 2-2.5 weeks)  Each interview lasted around 1 hour.  Interviews went into very specific of the job specifications.  I would advise having many specific examples for each job specification.  Also, it seems to be much better to have much more experience than they state in their advertisement.\r\n\r\nPeople seemed very nice and friendly.  \r\n\r\nOffice, as many NGOs are, seemed understaffed but trying to do their best.\r\n\r\nWill ask you specific questions about your spirituality.  Work culture seems to value modesty and similar norms.", "Interview Questions": "Explain how your upper level monitoring and evaluation was conducted, your role, and what you would have changed about the process monitoring.  "}, {"date": "3 Jun 2009", "title": "Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at International Justice Mission in Apr 2009", "Interview Descriptions": "Communicated via email. One interview that was 1:1.", "Interview Questions": "How would you handle different types of donors?"}]]