[[{"date": "18 Apr 2023", "title": "Customer Success Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences (New York, NY) in Mar 2023", "Interview Descriptions": "30 min interview. Questions were relatively simple (typical behavioral questions). at around the 20min mark we were done and I had time to ask questions regarding the company and role", "Interview Questions": "tell me about yourself how would your previous skills fit the role you are applying to? how to you deal with multiple projects with impending deadlines"}, {"date": "11 Jan 2023", "title": "Community Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "I applied online, the did a phone interview with the COO, then did an in-person with the COO. I received an offer a few weeks later after hearing nothing. My contact had been on vacation.", "Interview Questions": "They asked very basic interview questions."}, {"date": "19 Oct 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TED Conferences", "Interview Descriptions": "The interview process was very thorough, 4 rounds with different team members over the course of a month. Great communication and swift response; the team was great and I enjoyed the process.", "Interview Questions": "Why do you want to work at TED?"}, {"date": "20 Sept 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "HR reached out and set up a time to meet. When the time came, they didn't show to the scheduled online meeting and didn't reply to emails from then on. In the end, I'm glad to have dodged a bullet if that's how they operate.", "Interview Questions": "N/A"}, {"date": "6 Jun 2022", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TED Conferences", "Interview Descriptions": "I love the concept and company and interviewed with the local founder.  Though I felt like a good fit for the role I must not have connected with him as I did not get the job. Good process overall.", "Interview Questions": "My interest in TedX and why I want to work with the team."}, {"date": "31 May 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at TED Conferences", "Interview Descriptions": "Three interviews, people are very engaging and super nice. Not that hard, regular questions about experience and what you want out of a job. Be able to answer how you would approach certain situations", "Interview Questions": "Tell me about your experience"}, {"date": "25 May 2022", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences", "Interview Descriptions": "I was ghosted for the screening interview. I of course reached out and offered a reschedule, but they never followed up.  It seems I'm not the only one to have experienced this.", "Interview Questions": "None. There was no interview."}, {"date": "23 Mar 2022", "title": "Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences in Mar 2022", "Interview Descriptions": "Never even started, pulled myself out of the process after attempting to schedule two phone screens. Recruiter reached out with a single time they were available.  After I replied requesting additional times the phone screen could occur, there was a week before I heard anything. Even then, the connection was from me. \r\n\r\nThe recruiter offered a time the next day, and never called.", "Interview Questions": "Not applicable, disorganized approach to recruitment."}, {"date": "19 Jul 2022", "title": "Associate Editorial Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TED Conferences (New York, NY) in Mar 2022", "Interview Descriptions": "Writing sample submitted. Friendly interview with whole team involved questions about my experience and company fit, but also questions re: pop culture and current trends. Company culture seems to be positive.  A diverse and talkative group, mostly young people with a very organized manager.", "Interview Questions": "What’s something you’re watching/listening to these days that you’d like to share with us?"}, {"date": "6 Jun 2022", "title": "Content Curation Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TED Conferences (New York, NY) in Feb 2022", "Interview Descriptions": "Easy and smooth.\r\n5 people interviewed me. They were all friendly and explained the position clearly. \r\nI enjoyed the interview process. It wasn't stressful and they were accepting and engaging with my questions.", "Interview Questions": "Tell us more about yourself?\r\nWhat is your added value?"}], [{"date": "29 Nov 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "Unnecessarily Extensive process, was asked same list of questions by all. Seems they pride themselves on this long interview experience & some teams warn a candidate before they even start the process that if they are not prepared for hours of interviews, then don’t continue.", "Interview Questions": "My ability to have Attention to detail?"}, {"date": "15 Sept 2022", "title": "UX Designer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TED Conferences (New York, NY) in Oct 2021", "Interview Descriptions": "went through the entire interview process including a whiteboarding session where they got free designs from me. they sent me an offer, and less than a week later rescinded it when i told them i had another offer i was looking at.", "Interview Questions": "why do you want to work at TED"}, {"date": "18 May 2022", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at TED Conferences in Sept 2021", "Interview Descriptions": "The interview took place remotely during the early days after the lockdown. There was a good amount of grace the interviewers gave me because all parties were trying to understand how to navigate work relationships post lockdown.", "Interview Questions": "How will your previous work experience help in your role with TED Conferences?"}, {"date": "15 Aug 2021", "title": "Media Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TED Conferences", "Interview Descriptions": "Interview process was great! Had a solid conversation with two members. The unfortunate news however, was that although they told me that they will be reaching back out on next steps since they wanted to continue the interview process, they never contacted me back (even after a follow up).", "Interview Questions": "Tell me more about yourself. "}, {"date": "27 Jul 2021", "title": "Technical Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at TED Conferences in Jun 2021", "Interview Descriptions": "I had three separate interviews with the leaders of the team for the role. I got positive feedback during those interviews, but there was a long wait after the third. Finally, I heard back and was told that they wanted to schedule a fourth interview for a code pairing session even though this was a non-coding role. After that, I never heard back and no further interviews were scheduled.", "Interview Questions": "Tell me about your current role and tasks."}, {"date": "24 Sept 2022", "title": "Digital Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at TED Conferences (Egypt, ID) in Jun 2021", "Interview Descriptions": "He welcomed me, then began to ask about my experience and knowledge in the field, then the questions became more difficult by asking more specialized questions, and what I learned from my training courses and how to apply it in the field of work", "Interview Questions": "what do you know about digital marketing"}, {"date": "25 Mar 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "Initial interview was quick but getting a 2nd interview took over two weeks - though this is during the pandemic so it may just be taking longer than usual. Overall a good experience just really long", "Interview Questions": "Stuff about my resume and past experience "}, {"date": "24 Jan 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences", "Interview Descriptions": "interview process was not the greatest. Interviewer was kind of rude which made it awkward. The interview was quick and I would have turned down any offer based on how the guy talked to me.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "29 Nov 2020", "title": "Product Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at TED Conferences", "Interview Descriptions": "The interview process was standard up until a certain point. There was a screening followed by a \"Round 1\" of interviews in which smart team members asked thoughtful interview questions.  I really liked the idea of calling these people teammates. Thanks to their great interview style,  I'll call this a neutral (ie not negative) overall experience.\r\n\r\nRound 2 never happened. A clear rejection wasn't given (which I know happens sometimes), but rather the CTO offered vague \"Let's be in touch...things are really busy right now.\" mixed messages with ambiguous signals.  I'd honestly rather they ghosted me than leave me hanging with such confusion. Say no or say nothing. They maybe followed by radio silence left me baffled. I can only assume it's a chaotic executive leadership environment.", "Interview Questions": "As a PM, how do you know you're working on the right things?"}, {"date": "7 Oct 2020", "title": "Media Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "A phone interview that lasted about 30 min. The interviewer asked questions about my resume and what I know about TED. Then the interviewer introduced the detailed duties of this position.", "Interview Questions": "What do you know about TED?"}], [{"date": "27 Feb 2020", "title": "Media Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TED Conferences in Jan 2020", "Interview Descriptions": "It was a casual over the phone interview, and direct assessment afterwards within a week. The interview was lax, just basic questions and room for conversation. The assessment was more direct, but since I didn't get the offer not sure what I could've done better.", "Interview Questions": "Why do you want to work at TEDx"}, {"date": "11 Aug 2020", "title": "Customer Success Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at TED Conferences in Nov 2019", "Interview Descriptions": "Great interview. The people were friendly and they were genuinely curious in my experience. Although I did not get the role I was pleased with the process and the hiring managers.", "Interview Questions": "Most important personal achievement to date."}, {"date": "22 Jul 2019", "title": "TED Fellows Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "Good interview with the Fellows staff. Everyone was kind and provided useful information about the company and the position. I was glad to interview and learn more about TED and the Fellows program.", "Interview Questions": "Tell us about prior relevant experience."}, {"date": "23 May 2019", "title": "TEDx Licensing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TED Conferences", "Interview Descriptions": "There were two rounds of interviews:\r\nFirst round interview was conducted online and it focused on the job I applied for.  However, the interviewer explained my access field exposure qualified me for a different role within Tedx section. \r\nSecond round interview was conducted at TED office by two employees,  different from the first one.", "Interview Questions": "What are the areas of improvement for TED content?"}, {"date": "17 Feb 2022", "title": "TEDx Licensing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at TED Conferences (New York, NY) in May 2019", "Interview Descriptions": "Super casual and easy-going. I had 2 round of interviews. First was with the head of the team, and second with the rest of the team. They're really not trying to catch you out. Don't need to prepare too much. Asked the stereotypical interview questions", "Interview Questions": "how do you think your past experiences will help you with this job? Strengths? Where do you see yourself in 5 years?"}, {"date": "13 Apr 2019", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences in Apr 2019", "Interview Descriptions": "The interviewer kept cutting me off when answering. He was very rude when I asked what timeframe would I hear back if successful. Wouldn’t recommend the company as their whole focus on sharing ideas is a front and a show they on when they actually don’t care. THE REVIEWS ARE TRUE.  Haven’t heard back so I’d assume they loved on", "Interview Questions": "Why ted?"}, {"date": "1 Feb 2019", "title": "TEDx Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TED Conferences (New York, NY) in Jan 2019", "Interview Descriptions": "Applied online and got a request for a short phone screen the next day, where basic questions such as what the difference between TEDx and TED were,  simple background questions such as am I qualified to work without sponsorship in the US, etc. Met for a group interview with the two team leaders the same week.  They were looking for someone to start before the end of the month and I met with them in the middle of the month, so I suspect not all interview processes will be this fast.", "Interview Questions": "What kind of skills can you bring from a previous internship in a different field?"}, {"date": "7 Aug 2018", "title": "TEDx Media Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TED Conferences in Jun 2018", "Interview Descriptions": "I had 2 video calls and 1 writing assignment. Overall great process. They were also very good about letting me know when I was not chosen for the position. Very nice people and easy to talk to.", "Interview Questions": "They asked me what is the different between TED and TEDx. They also asked what was my favorite TED or TEDx talk."}, {"date": "16 Oct 2017", "title": "Team Coordinator, TEDx Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TED Conferences (New York, NY) in Sept 2017", "Interview Descriptions": "After submitting my resume and cover letter online, I received an email that same day for a video interview with the current Team Coordinator who was moving on to a new position. After that video interview, I was then scheduled for another video interview with the Deputy Director who was based in California at that time. Then the last step was the final in-person interview with the head of TEDx.", "Interview Questions": "Why are you interested in this job?"}, {"date": "7 Mar 2017", "title": "Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TED Conferences (New York, NY)", "Interview Descriptions": "The hiring manager will call for a basic phone screen. Once you pass the phone screen they will invite you for an in person interviews with manager and director of program.", "Interview Questions": "What's your favorite TED talk?"}], [{"date": "19 Nov 2021", "title": "Lightman Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at TED Conferences (Atlanta, GA) in Mar 2017", "Interview Descriptions": "Alright, could use some work. Doubted myself in some of the steps however, I was able to move past it. Thankfully it wasnt too hard.  Yeah, thats how it was. Thankfully.", "Interview Questions": "What gets you out of bed every morning?"}, {"date": "9 Jan 2018", "title": "TEDx Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TED Conferences in Jan 2017", "Interview Descriptions": "Was reached out over email to schedule interview\r\nFirst interview was a video chat, pretty easy questions and getting to know you. This is helpful if you are applying from outside the state and cannot come in person\r\nSome hires had more than one interview\r\nAbout 1-2 weeks later received email with job offer to start the next month", "Interview Questions": "Tell us about yourself, do you know how to use YouTube Creator Studio"}, {"date": "5 Mar 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at TED Conferences (New York, NY) in Jan 2017", "Interview Descriptions": "Great! Had a lot of interviews, met with a lot of future colleagues who were engaged and asked fair questions. They followed up quickly after the interview to schedule another one and I never felt as if I were left out of the process.", "Interview Questions": "Asked me about my experience for the role. Asked about what I wanted to get out of the position. "}, {"date": "6 Dec 2016", "title": "Production Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at TED Conferences (New York, NY) in Oct 2016", "Interview Descriptions": "Phone interview followed by in-person interview at their office. They contacted me for a phone interview two days after my application was submitted. The in-person interview was held a week later. There were two people in the in-person interview and both were very friendly. The tone was fairly relaxed and they seemed interested in what I had to say. Questions were typical interview questions, nothing out of the ordinary --why are you interested in this position, what do you hope to learn, what are your strengths etc. Interview lasted about 30 minutes. They contacted me on interview results one month later.", "Interview Questions": "Do you have experience with video production?"}, {"date": "5 Sept 2016", "title": "Media Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at TED Conferences (New York, NY)", "Interview Descriptions": "Two interviews, writing test, and big picture questions. It was a positive process and it was indicative of the job itself. I found the process stimulating and manageable. It mostly occurred over email and in person with two face to face interviews. The rest of the process was via email questions and writing assessments.", "Interview Questions": "How do you translate big ideas for a broader audience?"}, {"date": "31 Jul 2016", "title": "Community Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences", "Interview Descriptions": "I was contacted for a phone interview, but to make a long story short, it was cancelled and reschedule like 6 or 7 times!  I would've given up, had the person not told me that she really wanted to interview me.  And when the phone interview finally happened, she didn't even apologize for all those cancellations but was very rude and curt over the phone, often cutting my answers short by saying, \"Yeah, yeah.\"  Very unprofessional and a pure waste of my time.  I really believe all the negative reviews about this place!", "Interview Questions": "What is your favorite TED talk and why?"}, {"date": "5 Aug 2016", "title": "Partner Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at TED Conferences (New York, NY) in Jun 2016", "Interview Descriptions": "Very easy process. The recruiter was very good at responding and connecting with me. She laid out the role very clearly and was very honest with her feedback and the vision/direction of the company.", "Interview Questions": "What was my favorite TED Talk?"}, {"date": "16 Sept 2020", "title": "TEDx Licensing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at TED Conferences (New York, NY) in May 2016", "Interview Descriptions": "This was the strangest interview I've ever had. I was a little under-qualified for the job, as I was about to graduate from college. The interviewer opened by noting that I'd applied to many positions at TED, as if that were a problem. I'd only applied to 2 other roles, but he said I'd applied to 6. He then proceeded to ask me why I would apply for this job when I wasn't qualified, and asked what made me think I was qualified. It was all very pleasant, but I was confused about why he connected with me in the first place. He said he would consider me for other open roles to which I had applied. I never heard from him again.", "Interview Questions": "With your limited experience, what makes you think you can do this job?"}, {"date": "20 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TED Conferences", "Interview Descriptions": "I applied online through their website and heard back from the hiring manager within a week. Interviewed in person in the office and was offered the job within 2 weeks. They asked the typical interview questions and discussed the job that I would be doing.", "Interview Questions": "What is your favorite TED Talk?"}, {"date": "17 Apr 2016", "title": "Position Name Withheld for Anonymity Purposes Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at TED Conferences in Jan 2016", "Interview Descriptions": "TED's interview process is the most unprofessional interview process I have ever been through. \r\n\r\n1. Started interviewing in an untimely matter - Did not take into account time managing their own events that would delay the interview process\r\n2. Emails flew into my inbox at bizarre hours such as 1am\r\n3. Asked for interview availabilities the night before a proposed interview time\r\n4. Disregarded my interview time availabilities and proposed different times without reason\r\n5. Forgot to schedule an interview with a TED employee, which left me waiting around my phone\r\n6. Confirmed interviews the day of or at a late time the night before\r\n7. Opened emails many times without responding timely (I tracked them)\r\n8. After personalized emails with my main contact for the position - a generic rejection flew into my inbox. After kindly asking for feedback on my performance for future job search, I haven't received anything. \r\n\r\nOverall, the interviews themselves were very easy, but the process was extremely rushed and for no good reason. You would think after so much effort (6 interviews), that they would really be interested. I think the messy interview process is a great foreshadowing of how the organization actually runs. I'm glad I don't work there. Apply for TED if you want to waste your time on the job hunt.", "Interview Questions": "What book are you reading?"}], [{"date": "17 Sept 2015", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at TED Conferences (New York, NY) in Aug 2015", "Interview Descriptions": "Contacted me very last minute. Interview was very casual, and interviewer went off on many unrelated tangents. Really unprofessional in that there was no response after many emails regarding an offer or not.", "Interview Questions": "What is your dream job?"}, {"date": "18 Apr 2015", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at TED Conferences (New York, NY) in Jan 2015", "Interview Descriptions": "Two PMs interviewed with me and asked some questions about my past experience. Had a nice talk with them. They introduced me about the tasks I would collaborate with, and the future vision of this year. I was really enjoy the talk with them. They also explained me about the compensation. Emphasizing the fact that here is a non-profit organization while they explained about compensation.", "Interview Questions": "as you know, we are a non-profit organization. Do you have any financial concern?"}, {"date": "26 Oct 2014", "title": "TEDx Talk Screening Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at TED Conferences (New York, NY)", "Interview Descriptions": "I submitted the application online. I was contacted by the Screening Coordinator for an on-site 1:1 interview after maybe 3 days, very quickly. The interview process was laid back. There are questions to test if you know what TED,especially TEDx does. But they are not hard. As long as you did basic research in advance, you will be OK.", "Interview Questions": "unexpected question: your favorite film "}, {"date": "27 Nov 2015", "title": "TEDx Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at TED Conferences (New York, NY) in Apr 2014", "Interview Descriptions": "The interview process wasn't overwhelming--you speak with a number of current employees who evaluate your past experience and whether you would be a fit based on personality. The questions are all very straightforward.", "Interview Questions": "Tell me about your past experience?"}, {"date": "13 Nov 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at TED Conferences", "Interview Descriptions": "Very general. Got all your typical behavioral interview questions.", "Interview Questions": "What is your favorite TED talk and why?"}]]