[[{"date": "7 Jun 2023", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy For Animals", "Interview Descriptions": "Never got one; I was eliminated because I refused to answer the applications on sexual orientation. Deplorable behavior of companies in CA asking sexual orientation questions on applications. I've reported to ACLU, but they are useless, too.", "Interview Questions": "Not applicable. As I said, while I was qualified for and passionate about the role, I was excluded."}, {"date": "6 Apr 2023", "title": "Jovem Aprendiz Administrativo Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mercy For Animals (São Paulo, São Paulo)", "Interview Descriptions": "Foi um bom processo. Um pouco demorado porém deu tudo certo. o RH foi muito atencioso e esteve comigo o tempo todo me atualiznado sobre o processo. Gostei muito do processo e recomendo essa empresa para todos que conheço.", "Interview Questions": "Fale sobre um pouco sobre você"}, {"date": "23 Mar 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy For Animals (New York, NY) in Jan 2023", "Interview Descriptions": "Thorough and friendly. The recruiting specialist was great at communicating next steps and answering questions. The interview process includes 3-4 stages: phone screen, hiring manager interview, written assignment, and panel interview.", "Interview Questions": "Name a time when you experienced conflict at work"}, {"date": "27 Oct 2022", "title": "Recruiting Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy For Animals in Sept 2022", "Interview Descriptions": "The interview process was well organized and professional. Excellent follow up and timely replies from recruiter. * Phone screen with recruiter on Google Meet * Video Interview with the hiring manager (1 hour) * Take-home written assignment (select roles only) * Video panel interview with 3-4 MFA team members (1 hour)", "Interview Questions": "be prepared for 10+ behavioral interview questions"}, {"date": "4 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mercy For Animals", "Interview Descriptions": "I was treated with respect by everyone I met with throughout the process. Responses to questions were quick. The questions felt appropriate for the position. There weren’t long periods of time when I didn’t hear an update on what to expect next.", "Interview Questions": "I don’t feel comfortable answering that. "}, {"date": "2 Jun 2022", "title": "Fundraising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy For Animals", "Interview Descriptions": "Was interviewed for a VP role, but didn't make it further than HR for another role much lower in responsibility. This makes no sense to me. Not sure what their expectations are.", "Interview Questions": "Was I a vegan and for how long?"}, {"date": "24 Aug 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy For Animals in Mar 2022", "Interview Descriptions": "El proceso duró meses y en cada entrevista me hicieron las mismas preguntas . No hubo seguimiento de rrhh. La vacante seguía abierta meses después y pedían business case sin dar retro.", "Interview Questions": "Cargos anteriores, experiencia, trabajo remoto"}, {"date": "17 Feb 2022", "title": "Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy For Animals", "Interview Descriptions": "Their recruiter was the nicest person to speak with in the initial stages. I didn't feel like I was in a formal interview, it felt like a friendly conversation. They made sure to provide a space to think about your answers before speaking, and to follow up with anything else after the interview was done.", "Interview Questions": "Tell us a little bit about yourself. "}, {"date": "7 Feb 2023", "title": "Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy For Animals (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "I had 5 interviews and then received no call or email back regarding my chances of working with MFA. I still admire them and would support them, but it's a tough pill to swallow when you put in so much effort and emotion into the possibility of working with a cause you care about to be ghosted. A simple \"you didn't get the position\" would be rough but better than no reply ever.", "Interview Questions": "Many question's interviews, and video parts sent to MFA."}, {"date": "7 Dec 2021", "title": "Legal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy For Animals", "Interview Descriptions": "It was a good interview, but no offer.  I feel like it was a blessing in disguise. I think that the people are nice, but something felt off. I wonder if there is high turnover.", "Interview Questions": "I do not remember this."}], [{"date": "1 Dec 2021", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy For Animals", "Interview Descriptions": "Interviewer was kind, but couldn't answer many of my questions about the job/benefits/etc. I did appreciate that they explained what the interview process was at the start, and confirmed salary requirements (so tired of that guessing game with other orgs!) Some of the questions were awkwardly phrased and hard to understand what they were looking for.  They did seem very enthusiastic about the company but other than \"it's great\" I didn't really get a good sense for what made it a great company to work for. I got an automated rejection email which was a big turn off.", "Interview Questions": "A question about veganism, but I can't remember exactly what. "}, {"date": "26 Nov 2021", "title": "Demonstrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy For Animals", "Interview Descriptions": "No interview  for this position, just seen post for demonstrating and you just show up to various locations. Great company to demonstrate for, very fulfilling educating as we demonstrate for great causes.", "Interview Questions": "No questions for demonstrating  👍"}, {"date": "9 Nov 2021", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy For Animals in Oct 2021", "Interview Descriptions": "I only went through two of the four stages of the interview process. The recruiter was kind and genuine and made me excited for the role! The next step was an assignment. I spent a lot of time on it, but I didn’t move forward. The email sent at that point was generic, so I can only assume my work on the assignment wasn’t up to par. I am glad they let me know that I wasn’t moving forward in a timely manner, but I do wish more details were given since I had invested significant time.", "Interview Questions": "Which is more important - culture or strategy?"}, {"date": "10 Feb 2021", "title": "Summer Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy For Animals (Los Angeles, CA) in Jan 2021", "Interview Descriptions": "I submitted an application through their website and was invited to interview about a month later. The interview was straightforward, but was less conversational and more centered around structured questions. They conducted only one interview.", "Interview Questions": "Can you describe how you approach a legal research question?"}, {"date": "22 Aug 2020", "title": "Legislative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mercy For Animals", "Interview Descriptions": "The process was very smooth and the hiring manager was wonderful to interact with. There was clear communication and I was followed up with quickly. I enjoyed the interview process.", "Interview Questions": "Why do you like you are the ideal candidate for this position?"}, {"date": "15 Aug 2020", "title": "Corporate Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Mercy For Animals (São Paulo, São Paulo) in Jul 2020", "Interview Descriptions": "O processo seletivo durou quase cinco meses com retornos que levavam em média 3 semanas. Primeiro precisei preencher um formulário em inglês e português, em seguida  realizei uma entrevista por telefone de 15 minutos com o HR e depois me pediram uma série de tarefas estratégicas para serem realizadas. Ocorreu então a segunda entrevista, com todas as pessoas da área e em inglês e português. Após quase dois meses fui contatado para uma entrevista dinâmica com as responsáveis da área. Ao final, recebi um e-mail genérico, daqueles que parecem automático e no-reply, agradecendo minha participação e sem feedback algum depois de todos esses meses que me fizeram apenas perder tempo.", "Interview Questions": "Descreva sua rotina, como seus colegas te trabalho te veem, o que você pensa sobre viajar a trabalho, por que a MFA deveria te contratar"}, {"date": "15 Aug 2020", "title": "Corporate Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Mercy For Animals (São Paulo, São Paulo) in Jul 2020", "Interview Descriptions": "O processo seletivo durou quase 5 meses com longos períodos entre uma fase e outra (em média 3 semanas). Tive que preencher formulários, elaborar estratégias, fui entrevistado em inglês e português por várias pessoas e passei ainda por uma dinâmica relacionada ao cargo. Ao final de todos esses processos e meses recebi um e-mail genérico agradecendo minha participação e sem feedback.", "Interview Questions": "Como é sua rotina, como seus colegas de trabalho te descrevem, por que a MFA deveria te contratar"}, {"date": "30 Apr 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy For Animals", "Interview Descriptions": "El proceso es un poco largo y tedioso. Al principio te dan un test sobre un proyecto que debes de hacer, esto toma más de dos días. Después de que lo califican de manera anónima y sí les gusta, sigue la entrevista. Siento que te hacen perder el tiempo, ya que, debería de ser primero la entrevista y sí les gustas entonces deben de darte el test. \r\nLa persona que me entrevistó fue muy amable.", "Interview Questions": "Qué libro estoy leyendo y como los aplicaría a Mercy for Animals"}, {"date": "28 Oct 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mercy For Animals in Mar 2020", "Interview Descriptions": "Straight forward process. There was an initial screening interview with basic questions, followed by an interview with a hiring manager, then a writing sample, and finally two panel interviews. My interview process lasted approximately 2-3 months.", "Interview Questions": "What is your plan for your first 30 days?"}, {"date": "9 Apr 2023", "title": "Especialista Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Mercy For Animals in Feb 2020", "Interview Descriptions": "Moroso e com muitas etapas que, hoje, julgo desnecessário. Diminuir etapas seria útil e não teria impacto negativo no final, a meu ver. Todas as etapas foram feitas virtualmente, o que é excelente!", "Interview Questions": "Entrevista geral Assigment Painel com algumas perguntas em inglês Entrevista com gestores 100% em inglês Entrevista com diretoria executiva"}], [{"date": "1 Mar 2021", "title": "Especialista Em Políticas E Gestão De Saúde Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Mercy For Animals (São Paulo, São Paulo) in Jan 2020", "Interview Descriptions": "Foram mais de 8 etapas, com tarefas como desenvolver projetos inteiros, pesquisas rebuscadas, entrevistas com diversos setores repetidamente, e quase meses sem resposta, até que encontrei a vaga disponível no linkedin. Muito descuido do RH e equipe com os finalistas. 1 ano depois, quando chegaram a um veredito sobre a vaga a RH enviou apenas um e-mail informando que não havia sido selecionada e um link caso eu quisesse me candidatar a outra vaga deles. Achei no mínimo desumana a postura.", "Interview Questions": "Foram mais de 8 etapas, com tarefas como desenvolver projetos inteiros, pesquisas rebuscadas, entrevistas com diversos setores repetidamente, e quase meses sem resposta, até que encontrei a vaga disponível no linkedin. Muito descuido do RH e equipe com os finalistas. 1 ano depois, quando chegaram a um veredito sobre a vaga a RH enviou apenas um e-mail informando que não havia sido selecionada e um link caso eu quisesse me candidatar a outra vaga deles. Achei no mínimo desumana a postura."}, {"date": "12 Nov 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy For Animals (Los Angeles, CA) in Mar 2019", "Interview Descriptions": "Interview process was lengthy and it included an acutual work session of 4 hours.  Instructions provided were too brief and vague, and not sufficient.  When I asked for clarification, I was still not provided with sufficient information to complete the work.", "Interview Questions": "Create a system for supply order"}, {"date": "1 Aug 2018", "title": "Campaign Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy For Animals in Jul 2018", "Interview Descriptions": "Interview consisted of a preliminary phone call, an hour and a half Google hangout with two Campaign Managers, and then finally a 4 hour test over the span of 3 days. The representatives were not very friendly and seemed scattered. I was told I would receive a response within a certain period of time and had to follow up twice. Personally, even if I don't receive a job, I wish to be notified by the organization/company if I didn't get it. If someone takes two days off of work to dedicate time and passion to a company's interview process, they deserve a response either way. Was entirely not impressed with MFA's sense of professionalism and interview etiquette. The interview itself actually made me not want to work for them, but social justice and advocacy are two important causes so I gave the 4 -hour skills test a chance. Bottom line: they are very flaky and if you are looking for a role with job security, it doesn't seem you will find that here.", "Interview Questions": "How do you prioritize having to deal with multiple, time-sensitive tasks at once?"}, {"date": "5 Apr 2018", "title": "Advertising Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mercy For Animals", "Interview Descriptions": "The interview process is incredibly long, slow, and time-consuming. It starts with an application and intelligence test. There was a phone interview followed by a working assignment. Then 2 webcam interviews. Many questions were asked multiple times and it did not feel organic or conversational.", "Interview Questions": "What traits would I focus on when hiring new employees?"}, {"date": "30 Aug 2017", "title": "Assistant Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy For Animals", "Interview Descriptions": "This process took several months. I applied online and filled out a lengthy application with essay questions. A few weeks later, I was sent a SAT-style test which I had one hour to complete. Several weeks later, they scheduled a \"video interview.\" Basically, you record yourself answering questions over video. The questions are asked by the computer—no communication with a real person. \r\n\r\nAfter that, I was invited to take a 4-hour work assignment (unpaid). I hesitated here a bit because so far, I had invested quite a bit of time into this interview process while Mercy For Animals had invested no time into me. I hadn't spoken to a human yet- so this felt very one-sided. But, I really respect the work being done by MFA so I decided to go for it. In reality, this work assignment was largely data entry and much of it did not seem at all relevant to the position I applied for, so I felt very caught off guard. \r\n\r\nMost organizations don't ask people to sink hours in to work tests unless you are a top candidate, but for all I know, there were hundreds of people going through the same process as me since MFA couldn't even take the time to have a phone call with their candidates. \r\n\r\nAfter all that, I received an automated email a couple weeks later stating that my cover letter and application have been reviewed and were not selected for further consideration. Um, WHAT? Are you telling me that you didn't review my cover letter and application until I had already completed the 4-hour unpaid work assignment? \r\n\r\nI do believe in the mission of the organization, so I hesitated to write a harsh review of my experience. But I hope it's a wake up call because MFA needs to seriously reconsider their hiring process. What a dehumanizing and insulting process to put your supporters through— you lost a supporter in me.", "Interview Questions": "Why are you interested in this position"}, {"date": "22 Aug 2017", "title": "Education Advertising Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy For Animals (Remote, OR)", "Interview Descriptions": "The process was so long - about 2 and a half months. I applied online through glassdoor, then had to fill out an application form which contained about 5 paragraph questions about why you want to join the company, personality questions etc on top of this a cover letter and your resume/cv.\r\nAfterwards I received an email in which I had to take an assessment test, and then shortly after about a week later was asked to do a video interview for them at my own time which took about 1 hour.\r\nAfter I submitted this, it took about  a week and a half for them to come back to me saying that they would like to move me forward and gave me a 4 part 4 hour work assignment in which I would have to take my free time to do this UNPAID. \r\nAfter completing the assignment I didn't hear from them for two weeks until finally they told me that they had selected someone else.\r\nI felt like this process is ridiculous for such a great organization. It was completely one sided and impersonal! I never got to speak with any of the hiring managers directly to ask them anything about the role. The video interview was cold and me just talking to a pre recorded video, afterwards I THOUGHT ok I CAN address my questions about this role, and no one contacted me, instead I was asked to do a 4 part  1 hour each assignment in which I had to do this without a break 4 hours straight of my free time, for a work assignment that I felt unprepared for as I had some questions because one question in particular was more to do with logistics and digital marketing and this is not a digital marketing job!", "Interview Questions": "What makes someone a good manager "}, {"date": "22 Feb 2020", "title": "Philanthropy Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Mercy For Animals in Aug 2016", "Interview Descriptions": "I was contacted by a recruiter and asked to supply a cover letter and resume. Initial phone interview with recruiter. Then 2 video interviews with 2 staff members.. Then 4 hour unpaid working interview. Then in person interview with president, head of HR and SVP of development. \nThis is an important role to fill and was important to me that it was the right fit so I appreciated the thoroughness and professionalism during the process. It was a long process over 2 months because we were all very busy and they were short staffed.", "Interview Questions": "Tell us about yourself."}, {"date": "4 Apr 2014", "title": "Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy For Animals (Los Angeles, CA) in Feb 2012", "Interview Descriptions": "Watch videos, talk about investigations", "Interview Questions": "Wanted to know if I was a vegan"}]]