[[{"date": "16 Mar 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seed Company", "Interview Descriptions": "I applied for the job online. I sent my resume and even a cover letter. The interviewer reached out to me as to arrange a virtual interview due to Covid restrictions. The interviewer was a nice lady, A typical job interview. Asked some questions about myself such as educational background, experience, interests.", "Interview Questions": "Tell me about yourself. Why should we hire you? What is your prior experience?"}, {"date": "23 Jul 2020", "title": "Development Relations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seed Company in Jul 2020", "Interview Descriptions": "The whole process was very thorough and left no stone unturned. I had a total of 4 encounters. I call them encounters because one or two of them felt more like a way for them to feel me out and get to know me rather than a formal interview. Some may feel like 4 interviews was a lot but I think that it allowed me to get to know the team before I even got hired. Which gave me the opportunity to decide if this was a group of people I could work with.", "Interview Questions": "Do you work better in a team or individually?"}, {"date": "23 Jul 2018", "title": "Information Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seed Company in Jul 2018", "Interview Descriptions": "Great professional staff seeking to get the best-qualified candidate.  Interviewer focused on applicants whole person concepts to include technical proficiency. Interviewer focused on applicants whole person concepts to include technical proficiency.", "Interview Questions": "How my faith has helped me throughout my career."}, {"date": "25 Feb 2015", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seed Company", "Interview Descriptions": "It took a total of 3 months to get hired on with Seed Company. I also interviewed with about 3 people including HR. Although I would've preferred to start my employment sooner, I appreciated their thorough evaluation before presenting me with an offer.", "Interview Questions": "Do I believe in Jesus Christ?"}], []]