[[{"date": "3 Oct 2022", "title": "Mortgage housing counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Neighborhood Assistance Corporation of America (Bergen op Zoom) in Sept 2022", "Interview Descriptions": "I believe NACA  only has ghost jobs. They have these online job fairs quite often. The application process is an essay that takes hours to complete. I received an email a few days later stating I had been invited to do an online interview via zoom. Two days prior to the interview I received another link to take an assessment during working hours that was also live on Zoom. The interview took 3 hours. Most of that was spent waiting for someone to do the interview. The person I interviewed with did not even have my resume nor did he had any questions that could have been used to assess my skills. After speaking with me for about 5 minutes he was going to send me to a manager for a second interview. The manager was not available and I was supposed to be scheduled at a later date. Two weeks later I get an email on a Sunday night indicating that they had moved on with another candidate. Tacky way to do job interviews.", "Interview Questions": "Please tell me about yourself."}, {"date": "2 Mar 2022", "title": "Housing Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Neighborhood Assistance Corporation of America (Chicago, IL) in Feb 2022", "Interview Descriptions": "It was a virtual interview(s). You are 1st given an assessment and then 2 interviews. The assessment is about 45 minutes long. The entire process was about 3 hours long.", "Interview Questions": "Define debt to income ratio."}, {"date": "1 Mar 2022", "title": "National Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Neighborhood Assistance Corporation of America (Boston, MA) in Jan 2022", "Interview Descriptions": "You summited your application and resume, after they will schedule you through zoom interview if you are hired they will be sending you to training for 30 day most of the time through zoom.", "Interview Questions": "Company history applicant wants to have knowledge about NACA. "}, {"date": "12 Sept 2021", "title": "Mortgage Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Neighborhood Assistance Corporation of America (Dallas, TX) in Sept 2021", "Interview Descriptions": "The email for the virtual interview stated that the company would be interviewing between the hours of 9 am until 1 pm est I am on central time so I was on zoom at 7:30 am which was 30 minutes early to wait to be let in the meeting at 8am (9 am est) I was let in and there was a message on the screen saying you will be interviewed based on the time you came into the zoom. I was waiting almost 6 hours before I decided to leave the call. My entire Saturday morning was for nothing. I left the meeting at 12:40 central my time so that means it was 1:40 est their time 40 minutes over the ending interview time. I felt like if my time isn’t valued that you would have me sit and wait on an interview for almost 6 hours this company can’t possibly care anything about it’s employees. I’ve never been to an interview in a Saturday for as long as I was able to work . I wish they would improve that issue in the future because it was literally a waste of my time and Saturday.", "Interview Questions": "N/A"}, {"date": "14 Aug 2021", "title": "Housing Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Neighborhood Assistance Corporation of America (Charlotte, NC) in Aug 2021", "Interview Descriptions": "Very wordy application, essay questions.  Almost a year later they sent me an email for a virtual interview. I prepared arranged childcare and got up early and signed on only to be kicked out of the meeting because it was full. Couldn't even sign back in. I was so hurt.", "Interview Questions": "N/A"}, {"date": "6 Jul 2021", "title": "Real Estate Agent Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Neighborhood Assistance Corporation of America", "Interview Descriptions": "It was not difficult. The interview process was not bad at all. I had a phone call interview with some one national and then a local face to face interview after that. I got hired on the spot .", "Interview Questions": "N/A"}, {"date": "14 Jun 2021", "title": "Housing Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Neighborhood Assistance Corporation of America", "Interview Descriptions": "The interview was through video because of the pandemic. The interviewer did not seem interested in what I was saying. Was asked what I knew about the program and various housing/lending terms. Was told I would hear back the following week and heard nothing. Sent a follow up email and heard nothing back. Forgot about it and two weeks later received a phone call and email saying I got the position.", "Interview Questions": "What do you know about the program?"}, {"date": "27 Nov 2018", "title": "Housing Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Neighborhood Assistance Corporation of America (Chicago, IL) in Oct 2018", "Interview Descriptions": "The application process actually took much much longer than the interview itself. I waited about an hour to see the hiring manager for our scheduled interview only to meet for 15mins. I came prepared with my resume in hand, however she wanted email it to her so she could look at it later. I thought that was the point of having an interview, to follow up on experiences noted through the application.", "Interview Questions": "What do you know about what the position entails?"}, {"date": "16 Jun 2016", "title": "Mortgage Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Neighborhood Assistance Corporation of America (Atlanta, GA)", "Interview Descriptions": "Application available online via company website (it was long); I was contacted next day with info on scheduled phone interview. The phone interview rep gave ALL information about what would happen next and the requirements for the role. She answered all my questions. I took several assessments prior to the phone interview, they were SAT based and are difficult to most.", "Interview Questions": "Questions they ask dependent on how your scored on the assessments. If you scored low in math section, they will many math questions to gauge competency. They give a couple customer service related scenarios and require your thought/answer. I would recommend the STAR format when answering."}, {"date": "23 Apr 2018", "title": "Payroll Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Neighborhood Assistance Corporation of America (Boston, MA) in Apr 2016", "Interview Descriptions": "Met with Accounting Director and CEO and answered all their questions in an casual atmosphere. Asked very good and job related questions and were very direct on the job and skills they were looking for.", "Interview Questions": "Work experience, do I know about the company and their goal"}], [{"date": "20 Nov 2018", "title": "Mortgage Loan Processor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Neighborhood Assistance Corporation of America (Buffalo, NY) in Feb 2016", "Interview Descriptions": "She was very quick with the interview process but all in all it went well it was what I was looking for not sure what else to say. My interview was short and in person my skills spoke for itself", "Interview Questions": "did I really want to work here"}, {"date": "30 Apr 2017", "title": "Mortgage Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Neighborhood Assistance Corporation of America in Jan 2016", "Interview Descriptions": "I had two phone interviews with HR people. Then an in-office interview with the local manager. All very nice people. I also had to take a couple of personality and sales tests, including some basic math questions.", "Interview Questions": "What is 'economic justice'?"}, {"date": "22 Dec 2015", "title": "Mortgage Consultant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Neighborhood Assistance Corporation of America in Oct 2015", "Interview Descriptions": "Started with attending a workshop. Then an online test while at the face to face. Sat in on an appointment. Had 2nd phone interview. Verbal offer one week later from Rafeal. I submitted my documentation and then never heard back from him. He did not respond to emails, vm, or text messages. After thinking about it, I would not want to work for a company that did not return my calls.", "Interview Questions": "1) Why do you want to work for Naca"}, {"date": "17 Jul 2015", "title": "Mortgage Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Neighborhood Assistance Corporation of America (Tampa, FL) in Feb 2015", "Interview Descriptions": "Complete online application. The questions are basic background with explanation essay style, it is time intensive. I had a telephone interview with former underwriter in the Southeast region. It was over 1 hour long. STAR style questions. He explained the job, pay structure and system.", "Interview Questions": "Are you aware that the pay is $12/hourly and you will not earn commissions for a month or two? What is your experience working with nonprofits? What do you know about NACA?"}, {"date": "18 Jan 2019", "title": "Real Estate Agent Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Neighborhood Assistance Corporation of America (Charlotte, NC) in Jan 2015", "Interview Descriptions": "Basic Interview. Seems to me that you would want candidates that believe in the program. But it was a basic real estate interview. Commission Only with Employee Requirements. Beware that they will want you to teach seminars with no guidance on weekends when you should be selling.", "Interview Questions": "How many transactions have you done? How many were NACA transactions? Do you know contracts? What continuing education do you have? "}, {"date": "3 Jan 2016", "title": "Mortgage Consultant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Neighborhood Assistance Corporation of America (Chicago, IL) in Mar 2014", "Interview Descriptions": "It took 2 months to happen and was conducted by a young woman who did the interview by phone and was clearly reading a script. The HR department did not get back to me in any fashion at all until I left a message saying I was prepared to move on.", "Interview Questions": "the usual, \"where do you see yourself 5 years from now?\" . \" Tell me about a time when you felt you handled a really tough situation\"......nothing new"}, {"date": "17 Jan 2014", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Neighborhood Assistance Corporation of America", "Interview Descriptions": "Had to be 3 months from applying to getting a call from HR (Ralferal Ramirez). Was set up for a phone interview to be conducted with regional operations director (ROD). ROD called...asked 6 to 7 questions....was asked to have a face to face at local office....met at local office (approx. 5 days later)...semi-professional questions", "Interview Questions": "N/A"}, {"date": "19 Sept 2014", "title": "Mortgage Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Neighborhood Assistance Corporation of America (Houston, TX) in Oct 2013", "Interview Descriptions": "long and drawn out as they require licensing to be completed, and out of pocket expense before hiring. Website application submission often unreliable and no prompts or how to info to resolve any issues in submitting application.", "Interview Questions": "This is a non profit so buying into the mission is as important as experience. So be prepared to decide if this type of work if for you, or are you needing max cash opportunity."}, {"date": "24 Apr 2013", "title": "Mortgage Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Neighborhood Assistance Corporation of America in Mar 2013", "Interview Descriptions": "Applied online- very time consuming and detailed application.  I followed up and received an email that said I would have a better chance of being hired if I volunteered for them.  Nonetheless they called me for an intervew a few months later.  I had a phone interview with a Regional Manager who was unabble to answer basic questions about benefits and training.  They made me an offer via email that referenced their compensation plan but had no specifics about benefits or reimbursement for education I was expected to obtain.  I asked for this and never heard back.  After 4 days, and having read numerous negative reviews on glassdoor as well as many many complaints on BBB website, I decliend the offer.  Over a week later they sent me the same offer letter in the mail.  Very disorganized.  Every time I got an email from them I got it 3 times- their email system has some issues so I am wary of the rest of their software systems.", "Interview Questions": "what is the most recent book you read?"}, {"date": "27 Mar 2012", "title": "Mortgage Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Neighborhood Assistance Corporation of America in Jan 2012", "Interview Descriptions": "interviewer  asked several questions", "Interview Questions": "Tell me about yourself"}], [{"date": "27 Sept 2015", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Neighborhood Assistance Corporation of America (Charlotte, NC) in Aug 2011", "Interview Descriptions": "All applicants must complete an in-depth online application. Selected candidates are scheduled 2 interviews to assess skill and matching company profile. Candidates have the opportunity to describe their skills and work experience.", "Interview Questions": "Why do you want to work for NACA?"}, {"date": "8 Jun 2010", "title": "Call Center Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Neighborhood Assistance Corporation of America (Charlotte, NC) in Jun 2009", "Interview Descriptions": "It was a job fair experience for NACA (foreclosure prevention). I got there at 8:30 and waited about an hour with about 2500 other applicants. We first saw a movie about the company and then Bruce Marks, the founder, spoke briefly about the company and how and why he started it. Then we moved as a group to another room and waited about another hour for a one on one interview. I then left the building and received a phonecall about an hour later to come in for another interview later that same day. I came back at 4:30.This interview was a panel interview of about 10 people by 10 people from NACA. The interview lasted about an hour and a half before Mr Marks had to catch a plane and leave very quickly. I didn't get the job but I wish I had. The people really seemed to enjoy working with each other and to also enjoy what they did. I didn't meet anyone that I felt was unfriendly or unprofessional. There was a very diverse group of people running the show and they all worked well together interviewing and questioning people to start the Charlotte office of NACA.", "Interview Questions": "What was your  toughest or most difficult job experience?"}]]