[[{"date": "16 Apr 2021", "title": "College Completion Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at College Forward", "Interview Descriptions": "There was a phone and in person interview. It took one week total. Pretty quick process. Contacted initially through the Americorp website.  They were very quick about getting back to me and moving everything along.", "Interview Questions": "Describe a moment when you had to diffuse a situation."}, {"date": "15 Apr 2021", "title": "College Access Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at College Forward", "Interview Descriptions": "The interview was via phone and was very laid back. It felt like more of a conversation than an interview. It was full of questions relating to my past experience and a few fun get to know you questions which really speaks on the fun culture at College Forward", "Interview Questions": "If anyone could play you in a movie about your life who would you choose and why?"}, {"date": "19 Apr 2021", "title": "College Access Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at College Forward (Austin, TX) in Apr 2019", "Interview Descriptions": "Very straight forward and relaxed. The entire conversation only lasted around 30 minutes. Usually, you will be interviewed by both a professional staff member and a currently serving AmeriCorps member.", "Interview Questions": "There will be a few \"fun\" questions, such as \"What's one thing you like or enjoy doing that others may find odd?.\""}, {"date": "26 Jul 2016", "title": "College Completion Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Forward (Austin, TX) in Jun 2016", "Interview Descriptions": "I applied online through the AmeriCorps portal, and was contacted via email within a few days to set up an interview. I clicked a link within the email that took me to a google calendar that gave me the option to choose between various interview slots and interviewers. I was under the impression that it was going to be a video call, but when the time came for my interview, I received a normal phone call. There was only one round in the overall process, but the interview was longer than most (over an hour).", "Interview Questions": "Why College Forward? What's the most useful criticism you've received? What's something you're working to improve? If you had to plan a carnival event with a budget of 100 dollars what would you have at the carnival? What's your favorite joke? What's the weirdest thing that makes you smile? What social justice causes do you care about? "}, {"date": "22 Apr 2016", "title": "College Completion Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Forward (Houston, TX) in Feb 2016", "Interview Descriptions": "I applied online, I was contacted the same day to set a phone interview up. I got to choose between many times/days to fit my schedule. The interview lasted about an hour and forty minutes. They also contacted my references", "Interview Questions": "What's your favorite joke? If we asked your current coworkers their favorite thing about you what would they say? Why CoFo?"}, {"date": "15 May 2015", "title": "College Access Coach/College Completion Coach Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Forward (Austin, TX) in May 2015", "Interview Descriptions": "Sent in Americorps general application, and in less than a week was asked to fill out a second more focused on this program application. Basically the next day they asked me for an interview date I had 3 options, and chose the one later that week. I was offered the position 6 days later.", "Interview Questions": "1.) What is the weirdest thing that makes you smile?\r\n2.) If you had to plan a carnival event with a budget of 100 dollars what would you have at the carnival?\r\n3.) What is something you are working to improve? (a weakness)"}, {"date": "16 Jun 2016", "title": "College Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Forward (Austin, TX) in Jul 2013", "Interview Descriptions": "It was a good process and quick. The hiring manager, Monica, is really good at what she does. She was responsive and informative throughout the entire process. I was interviewed by a Program Manager and a Completion Coach in Austin. It gave insight to how the organization was run and what my role would be on a daily basis.", "Interview Questions": "Why do you want to work with this population of students?"}, {"date": "24 May 2013", "title": "College Coach Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at College Forward", "Interview Descriptions": "A hour long phone behavioral interview. Be prepared to answer a lot of scenario based questions. They need to fulfill a 55 or so hires so if you work on your application thoroughly and don't stumble on your interview, you should be fine. As long as you show a passion to work with their student population and access to higher education, it should be a good fit. They are usually pretty quick in making a decision which is great unlike other places. You can find out about their decision within a week after the interview.", "Interview Questions": "What was the most useful criticism you received"}, {"date": "16 Dec 2014", "title": "Completion Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at College Forward in May 2013", "Interview Descriptions": "I had one interview via the phone with a current coach and a manager. I was unclear at the time who the coach was and had assumed it was someone else in a manager/leadership role. The interview lasted about 30 minutes and was pretty basic: explaining your background, schedule expectations, the organization's mission, etc. I didn't really receive any follow up information or anyone to contact with questions which was disappointing.", "Interview Questions": "Questions were very straightforward. \"Are you comfortable working with diverse populations?\" \"What experiences do you have working within education or with students?\" "}, {"date": "14 Oct 2016", "title": "Senior College Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Forward (Houston, TX) in Jul 2012", "Interview Descriptions": "2 phone interviews. They were your basic questions- tell me about a time in which you handled a group project, tell me a time in which you had to encounter a difficult situation, etc.", "Interview Questions": "Basic interview questions"}], [{"date": "9 Oct 2015", "title": "College Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at College Forward in Jun 2011", "Interview Descriptions": "I went through several rounds of interviews. There was a brief initial phone interview and then a longer 30-60 minute phone interview. At that point I was added to the waitlist for the position. A month later they scheduled another interview for me and I was offered the position, so it was a long process.", "Interview Questions": "Tell us a time you encountered an ethical dilemma  "}]]