[[{"date": "14 Apr 2023", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SUNY Oswego (Oswego, NY) in Apr 2023", "Interview Descriptions": "After I applied online, my references were sent requests for reference letters. Then I was contacted for a 30min Zoom interview with the search committee. They asked basic questions related to the position, including why I wanted to teach there. It can be difficult to get people who will stay because of the winters. About a week later, they requested that I do a teaching demo. Although they gave me to option of doing it remote because of the short notice (a faculty member was going on maternity leave shortly and they wanted to do it asap), I opted to teach in person. While there, I also met with the dean. Turns out, HR requires the in person interview even if the search chair and dean want to extend an offer.", "Interview Questions": "Why do I want to teach there? How do I engage intro students?"}, {"date": "6 Jul 2022", "title": "Assistant Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at SUNY Oswego (Oswego, NY)", "Interview Descriptions": "Committee interview with staff, athletic director, students, and any other pertinent staff members. Campus tour and athletic facility tour. No prepared presentation or any summary to present. Strictly just getting to know the campus and the people.", "Interview Questions": "Tell us a little bit about yourself and why Oswego? "}, {"date": "24 May 2021", "title": "Counter Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at SUNY Oswego (Oswego, NY)", "Interview Descriptions": "was easy and it was also a short one. the interviewe was nice and he was very direct. was easy and it was also a short one. the interviewe was nice and he was very direct.", "Interview Questions": "“what experience do you have?"}, {"date": "21 Sept 2020", "title": "Graduate Resident Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at SUNY Oswego", "Interview Descriptions": "Once your application is submitted, you will receive different interview times with multiple department heads and other who live and work in the building you are applying to live/work in.", "Interview Questions": "How would you create a sense of community among your residents?"}, {"date": "20 Sept 2020", "title": "Food Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SUNY Oswego", "Interview Descriptions": "More like a job introduction than an interview. You go in and they sit you down to tell you some rules of the job, then they show you around and tell you when you start.", "Interview Questions": "Hours I'd like to work."}, {"date": "25 Sept 2018", "title": "Aux Services Dining Hall Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at SUNY Oswego", "Interview Descriptions": "called me in and asked me what times I was available and make clear their policies for showing up late, dress code, and other policies. It was a very simple process and they showed me around just make sure I was familiar where things were and told me not to worry, I would pick things up quick since things weren't too hard there. They took health and safety seriously, being a food service job, and made clear the way they did things.", "Interview Questions": "If I was clear with all of their policies"}, {"date": "11 Jun 2019", "title": "Assistant Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at SUNY Oswego (Oswego, NY) in Apr 2017", "Interview Descriptions": "General Application> Phone Interview> In Person Interviews which consisted of a room in front of Hall Directors and Assistant Hall Directors, a room of Resident Assistants and a room of more Hall Directors along with higher positions.", "Interview Questions": "Describe what diversity means to you. "}, {"date": "19 Nov 2021", "title": "IT Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at SUNY Oswego (Oswego Bitter, NY) in Mar 2017", "Interview Descriptions": "Group interview. It was fine. Asked decent questions and included tour. There really wasn't any one on one time yet. I am basically filling this out to be able to use the site. This is a terrible way to get data entry since it leads to false information like this. I don't have anything to really offer but I am forced to in order to continue to use the site.", "Interview Questions": "How do you keep up with Technology?"}, {"date": "17 Apr 2019", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at SUNY Oswego (Oswego, NY) in Nov 2015", "Interview Descriptions": "The interview consisted of about 10-15 questions regarding the person's knowledge of the desk attendant duties. It wasn't a difficult interview, but wasn't easy, either. They asked you a lot of questions that made you think quick on your feet, which is exactly what the job is all about.", "Interview Questions": "Name three resources on campus. "}, {"date": "27 Jun 2014", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at SUNY Oswego", "Interview Descriptions": "Very Easy, you pretty much got the job on the spot. if you made it to the interview process you pretty much just sit there and go over the employee manual and finding out what the job is all about.", "Interview Questions": "why do you want to work here?"}], [{"date": "24 Apr 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at SUNY Oswego", "Interview Descriptions": "All very organized and hospitable. Many meetings pre-arranged (search committee, dean, provost, research office, entire department). Had to provide presentation to staff and teach a class.", "Interview Questions": "N/A"}, {"date": "18 Mar 2014", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at SUNY Oswego", "Interview Descriptions": "I had known the Hall Director for a while already, so she already knew my character. She asked the typical questions about customer service, but certainly wasn't out to trick me. It was a very simple interview.", "Interview Questions": "I don't remember any of the specific questions, because it took place several years ago. I think she asked me something about how I would respond if a friend tried to get me to break the rules."}, {"date": "9 Jun 2015", "title": "Transfer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at SUNY Oswego (Oswego, NY) in Mar 2011", "Interview Descriptions": "A previous mentor interviewed me, as well as a group of others, followed by a group presentation. The presentations were an indicator of creativity, as well as projects we ended up working on throughout our time of employment.", "Interview Questions": "What are your ambitions?"}, {"date": "18 Mar 2009", "title": "Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at SUNY Oswego (Oswego, NY) in Dec 2007", "Interview Descriptions": "There was a panel interview with 6 or 7 people from the department and ancillary departments. I suggest you pay attention and memorize their names as they are introduced. They each had designated questions to ask, and asked them even if I had already answered them in my response to another person's similar question. I felt foolish because I was required to keep repeating myself. It wasn't a real conversation wherein the participants listen to each other; it was simply going around the circle and asking the predesignated questions regardless of what had already been covered. I suggest you bone up on your tautology. One question I remember is \"How do you deal with stress?\" There was also a skills test; I have no idea how well they thought I performed because there were no guidelines.", "Interview Questions": "They asked me if I had ever used the university's proprietary database."}]]