[[{"date": "14 Jun 2023", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Jun 2023", "Interview Descriptions": "Initial telephone screening very simple yes or no answers. In person interview Very simple and straightforward questions and answers. What shift, what experience applies to the job, do you think you can handle all of these requirements?", "Interview Questions": "Why should I choose you over my other applicants ?"}, {"date": "4 Jul 2023", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Jun 2023", "Interview Descriptions": "Very personable screening process. Easy to talk to. Easy flowing conversation. Short 20 minute first interview call. Very responsive to email correspondence. The lady was very flexible with the date, time for the interview call.", "Interview Questions": "Tell me a bit about yourself"}, {"date": "21 May 2023", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Health System (Summit, NJ) in May 2023", "Interview Descriptions": "I applied through their website careers portal. The manager of the unit that I applied for called me in for an interview. She did not tell me that I’d be meeting with her along with two other people. They asked me situational questions and basic personality questions. After the interview, I did not get an email stating that I wasn’t selected. I had to log back onto the careers portal to find out for myself.", "Interview Questions": "Tell me a strength and a weakness Tell me about your most stressful day at work and how did you resolve it Tell me about a time where you had to work with a difficult coworker Why should we hire you over other candidates?"}, {"date": "17 Apr 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System (Morristown, NJ)", "Interview Descriptions": "The interview was pleasant, I didn’t get i offers yet but was very interesting , people are friendly, the place is nice and clean, I was feeling like I was talking with friends", "Interview Questions": "Experience, my background, what I look for in a career and if I’m passionate about my career"}, {"date": "5 Apr 2023", "title": "Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System (Elizabeth, NJ)", "Interview Descriptions": "Easy - one round, got the offer by the end of the first call. The person that hired me is no longer with the company so the process is likely different.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "25 Mar 2023", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System in Mar 2023", "Interview Descriptions": "A few question via Ring central. Very straight forward and fairly question sand then gave me an offer in 48 hours. Wasn't bad just surprising how fast the process moved.", "Interview Questions": "Database questions that consist of administrative task"}, {"date": "28 Feb 2023", "title": "Senior Manager Consulting Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "A three-round interview process with a recruiter, hiring manager, and HR Director. The overall process took about three 1/2 weeks from the initial call with the recruiter. It was a straightforward and candid interview with some behavioral questions and general questions about yourself.", "Interview Questions": "Tell us about yourself. Could you walk us through a problem you solved? How do you work across cross-functional teams? How do you prioritize competing priorities?"}, {"date": "14 Feb 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "received an email with a link to sign up for a first round interview. first round with HR, asked basic behavioral and experience related questions. what are strengths what are you involved in on campus etc.", "Interview Questions": "What community service are you involved in?"}, {"date": "23 Feb 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Atlantic Health System (New Providence, NJ) in Feb 2023", "Interview Descriptions": "Interview went well. Met with two people who I would be working under. General interview questions: inquired about my experience on my resume. Brief details given on the position. When would I be able to start the position? Was I familiar with the area?", "Interview Questions": "When was a time I had to deal with a difficult issue? What was the outcome? What is the reason Im looking to switch jobs? Do I have EHR experience? What are my strengths? Weakness/ what I can be better at?"}, {"date": "18 Jan 2023", "title": "Talent Acquisition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "It was Seamless, positive . They made me excited about the potential of growing in this well established system. The interview was friendly and engaging even though it was virtual.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "29 Nov 2022", "title": "New Grad ER Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Consisted of 1 telephone interview followed by 1 in-person panel interview with various staff nurses, emergency room nurse educators, and assistant managers. Very competitive interview process with many applicants. The staff was very kind and welcoming during the interviews.", "Interview Questions": "What qualities make for an amazing ER nurse?"}, {"date": "21 Oct 2022", "title": "Physicians' Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Very smooth with positive feedback; i learned a lot about the organization in a friendly atmosphere. the interviewers were engaging and interested. They were able to provide information about scope of job and compensation and benefits", "Interview Questions": "How did i hear about them"}, {"date": "24 Mar 2023", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Health System (Morristown, NJ) in Aug 2022", "Interview Descriptions": "Interview was via Zoom with both Assistant Nurse Managers from the floor. They mostly asked generic behavioral questions and about my nursing school experience so far. The vibe was pretty relaxed. I was offered the position within 48 hours.", "Interview Questions": "Describe a time you went above and beyond for a patient. Describe a time you had a difficult interaction with a patient or family member. What did you do to resolve the issue? Why do you want to work for Atlantic Health? etc..."}, {"date": "31 Jul 2022", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Applied via the online portal. There was a  Long wait time to be contacted for interview. Once interview conducted, Long time between communication from Hiring team & required follow up.", "Interview Questions": "How my experience makes me a prime candidate for role. "}, {"date": "28 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System in May 2022", "Interview Descriptions": "Interview was held by various people, manager, assistant managers, and unit educators. Consisted of personal getting to know you questions and scenario based questions. It can be quite intimidating when there is many people present but if you are confident in your skills and experience, it will go smoothly!", "Interview Questions": "What is a magnet hospital?"}, {"date": "14 Mar 2022", "title": "Office Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "General manager starts with initial process of questions and going over background. Later on has medical director ask questions of his own after tour which would be based on how you would react at a hypothetical situation", "Interview Questions": "How would you react towards a problem you are not familiar with"}, {"date": "8 Mar 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "Had a peer interview which was a very negative experience. Employees did not seem happy in their job at all and were not trying to hide it. It was disappointing", "Interview Questions": "Did I know this job would include weekend work?"}, {"date": "2 Jun 2022", "title": "Summer Internship Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Atlantic Health System in Mar 2022", "Interview Descriptions": "Took 3 months of communication. He went off the grid for weeks to months at a time, then would say one position was closed, then offered me another. After I interviewed for that position, two weeks later he said it was closed, then offered me a position with the first internship I applied to.", "Interview Questions": "What would you do in certain situations?\nDescribe yourself (3 strengths, 3 weaknesses)\nDescribe what you enjoy doing"}, {"date": "23 Feb 2022", "title": "Speech Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "Conversation about previous clinical experience and gained information on position caseload and expectations. There was a tour of facility following interview and opportunity to ask questions occurred throughout process - very comfortable experience", "Interview Questions": "Tell me about ______ experience"}, {"date": "12 Feb 2022", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Impossible to get interview unless you know somebody or unless you hit all the key words their automated system is looking for. Super short staffed, hire many travel nurses but will treat current employees poorly.", "Interview Questions": "How did you deal with a difficult situation at work in the past?"}], [{"date": "10 Feb 2022", "title": "Manager Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Atlantic Health System in Nov 2021", "Interview Descriptions": "The interview process was smooth and went well.  I first met with the hiring manager and a few weeks later met with a senior HR person.  It was about a six-week process, I thought everything went well, but did not hear back after the interview (the HR person shared they were going to be making a decision soon).  It would have been nice to receive an email sharing that they decided to go with another candidate, but  I never heard anything back).", "Interview Questions": "Share your experience or give an example of doing x in your current role?"}, {"date": "25 Sept 2021", "title": "Finance Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "Interview was held by three different supervisors. Went pretty smooth, they did reiterate growth isn't happening quickly it takes time. They want to make sure customer service is A1. Quality over quantity.", "Interview Questions": "Still waiting on an offer."}, {"date": "14 Sept 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Good and easy. All of my questions were answered. I answered all of their questions to the best of my ability. Everyone was on time and professional.  Hopefully this helped you all", "Interview Questions": "Why you want to work here "}, {"date": "30 Aug 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Open house with multiple interviewers.   Leadership interviews followed by peer interview. Vendor interviews was the last.  Then you were dismissed, but I was then called back as I was walking out and was asked to wait for about 20 mins. Then they told me I could leave and that I would be called.   Strange.", "Interview Questions": "Tell us about prior experience "}, {"date": "21 Aug 2021", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Health System in Aug 2021", "Interview Descriptions": "Was easy they were friendly, they asked about past experience, what you would do in specific situations and who you would report too. Wasn't hard at all they made me feel very comfortable", "Interview Questions": "What would you do in specific situations for example if a customer asked you to do something you're not allowed too etc "}, {"date": "25 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Smooth, great communication from nursing floor during the process. There was a very Quick orientation turnaround time which allowed for a speedy on boarding process for me. There were resources available if needed.", "Interview Questions": "What are your professional plans"}, {"date": "24 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Morristown, NJ)", "Interview Descriptions": "My interview with Atlantic Health was a series of questions for management to get me to do what they wanted me to do. Will you be okay going to other facilities 1 week a year to allow someone else from another facility to go on vacation? Not telling me that this was putting me into a float pool and them telling me where i would go the day before (floating me to 4 of the facilities whenever they wanted to.) sometimes a different facility every day of the week. I was told i would be on call 1 day of the week and one weekend a month. This was a lie as I ended up being on call anywhere from 15-22 days a month. Per diems were permitted to pick first which meant they always picked the week days, which left the Full timers to be forced to pick up the call on all of the other days… meaning i was on call almost every weekend.", "Interview Questions": "How would you respond to a physician that asked you to do something that you were uncomfortable with. "}, {"date": "28 Aug 2021", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Health System (Newton, NJ) in Jul 2021", "Interview Descriptions": "1. Applied online on the company website \r\n2. Spoke on the phone with the interviewer to briefly discuss the role, myself, and set up an interview time\r\n3. Interviewed in person and was given a tour of the facility\r\n4. Received an email from HR", "Interview Questions": "Described and experience where you worked with someone who you did not get along with?"}, {"date": "15 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Atlantic Health System in Jul 2021", "Interview Descriptions": "My interview process consisted of an interview with the nurse manager and a phone call with the recruiter. Had a few patient scenario questions in addition to the standard interview questions. Overall, the interview process was easy and relaxed and both the hiring manager and the recruiter were very informative.", "Interview Questions": "Can you tell me about yourself"}, {"date": "26 Mar 2021", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Atlantic Health System", "Interview Descriptions": "Did a microsoft team meeting for the i interview. They asked me about what I wanna do in five years, what can I bring to the team, and those general interview questions.", "Interview Questions": "I wanna do in five years, what can I bring to the team, and those general interview questions. "}], [{"date": "24 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Atlantic Health System (Jersey City, NJ) in Mar 2021", "Interview Descriptions": "Descriptive about job functions and staff culture. Could tell they valued supporting new employees. Spent about equal time talking as I did listening and felt well informed after the interview. The people I interviewed with were polite and friendly to the utmost caliber.", "Interview Questions": "What is important to you as an employee?"}, {"date": "26 Feb 2021", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Straight forward, organized, as expected; met folks from multiple levels of the org. Provided transportation to the area from out of state based on personal travel preferences, recruiter extremely welcoming and adept, nice thank you gift.", "Interview Questions": "I would never disclose this type of information. It was standard for the role. "}, {"date": "18 Feb 2021", "title": "EMT-B Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "I had no video calls only phone calls which is good so they do not care what you look like. But, nobody from my department interviewed me only human resources did.", "Interview Questions": "Talk about a time I was faced with a challenge."}, {"date": "17 Jun 2021", "title": "Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Atlantic Health System in Jan 2021", "Interview Descriptions": "The manager and lead analyst interviews you. It was a friendly interview. You are asked whether you can handle the fast pace and how well you manage projects. I was told by HR to prepare a lesson to teach the interview panel. I received really positive about teaching the lesson I prepared but I never heard back after the interview. I received an automated email saying I didn’t get the job after a pretty long interview process.", "Interview Questions": "How do you handle competing priorities?"}, {"date": "13 Jan 2021", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Morristown, NJ) in Jan 2021", "Interview Descriptions": "Very good they really care about you and what your goals are. Why would you choose Atlantic Heatlh? Es plainer all their benefits. Described the position and what the hours would be. And asked to tell them about yourself", "Interview Questions": "Where do you see yourself in a year or two"}, {"date": "19 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "Applied online and after a few days, met with HR over the phone to discuss job details and availability. The next step was meeting with the hiring manager of the unit.", "Interview Questions": "Can you tell me about yourself"}, {"date": "24 May 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Dec 2020", "Interview Descriptions": "Simple 3 Questions where they put you in a different scenario and see how you handle the situation.\r\nEx. a time where you had to work with someone you weren’t familiar with.", "Interview Questions": "A time where you had to solve a problem where the answer wasn’t clearly In your face"}, {"date": "28 Jan 2022", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System (Newton, NJ) in Mar 2020", "Interview Descriptions": "First I met with the Assistant nurse manager.  They asked  several questions. Then I had a phone interview with HR.  I received an email with an offer the same day.", "Interview Questions": "Tell me about a difficult situation you were in and how you handled it"}, {"date": "11 Mar 2020", "title": "Talent Acquisition Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Feb 2020", "Interview Descriptions": "Phone interview, followed by on-site with recruiting manager, then 2nd on-site. Very basic questions about experience. \r\n\r\nThe Second on-site interview completely turned me off from the company. The interviewer was late to the interview, admitted they hadn’t even looked looked at my resume and asked me what position I was interviewing for.  Overall,  this left a horrible impression of the company and team. \r\n\r\nThe worst part was after a phone interview and 2 on-site interviews there was zero follow up!  I sent a follow up message with no response. I can understand no response if you are just an applicant but after 3 interviews some sort of response is required. Between the lack of communication and the Interviewers not being engaged I would never pursue a position there in the future.", "Interview Questions": "Walk me through your resume"}, {"date": "23 Aug 2021", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Pompton Plains, NJ) in Feb 2020", "Interview Descriptions": "Easy , and practical. 2 interview process, with two different people. The recruiter asks you more questions than the boss. First you get interviewed with the recruiter , then the boss interviews you and asks you a few questions.", "Interview Questions": "I hat did you do in your last job . "}], [{"date": "8 Sept 2020", "title": "Assistant MOA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Atlantic Health System in Jan 2020", "Interview Descriptions": "Great; interviewer was very relatable. Made me believe there was a position for me though and then did not follow through with it. I felt like i wasted my time to be honest but over all, great interview process.", "Interview Questions": "N/A"}, {"date": "16 Jan 2020", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Jan 2020", "Interview Descriptions": "Applied online. Invited to a job fair, which hasn’t been my typical experience with hospitals . Met with HR to go over a few things. Then with the supervisor of the unit. She asked me standard interview questions.", "Interview Questions": "Tell me about a time you had to learn something really fast "}, {"date": "12 Jul 2022", "title": "Rec Therapy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Atlantic Health System (Summit, NJ) in Jan 2020", "Interview Descriptions": "Phone interview. Took about 5 min. Just a get to know you interview. Offered me a job right on the call. It helped that I did my internship there. Pleasant interview", "Interview Questions": "Why do you want to work here?"}, {"date": "27 May 2022", "title": "Mental Health Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Elizabeth, NJ) in Jan 2020", "Interview Descriptions": "Went great, and was super comfortable! The woman was very nice, and asked me good questions. Normally interviews make me nervous but I was not at all! Overall, one of the best ive been on!", "Interview Questions": "Tell me a Strength about yourself "}, {"date": "18 Sept 2019", "title": "Community Health Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Atlantic Health System", "Interview Descriptions": "The entire process took 3 months from when I applied to ultimately got rejected from the job. In their defense, it was a new position so they have to be thorough but it took up a lot of my time and set my hopes up high. I believe there were 4 interviews in total. They also took at least 2-3 weeks to get back to me in between each interview.", "Interview Questions": "They asked me behavioral questions, asking me about a time I handled something well. They also asked me about which populations I would be comfortable working with and wanted to know more about my knowledge about the field. "}, {"date": "17 May 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Went well -- I found them to be helpful and kind in dealing with others.  It was a great way to end the day. I know there s no way you will read this.", "Interview Questions": "Approach to learning?"}, {"date": "24 Jun 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Atlantic Health System in May 2019", "Interview Descriptions": "Two phone interviews were fairly basic and easy. \n\nAsked the typical interview questions and gave me an offer after the second interview.\n\nWas a quick process overall and painless.  I was surprised they did not do a video interview.", "Interview Questions": "Tell me a little bit about yourself "}, {"date": "3 Jan 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ)", "Interview Descriptions": "I had two phone interviews with recruiter, and one in-person interview. The in-person interview started 45 minutes late and there was never any follow-up from the in-person interview.", "Interview Questions": "Walk me through your resume."}, {"date": "11 Dec 2018", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "I received a call for interview.  Pharmacy manager and one other person did the intervie. It was really good experience. They asked about availability first. Why I want to work for the company.", "Interview Questions": "Did you ever disagree with a prescriber?"}, {"date": "5 Dec 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at Atlantic Health System (Morristown, NJ)", "Interview Descriptions": "I came thru as a temp and was hired thru there. After working with the temp agency for three months, I was hired permanently.  The coordinator really liked me so worked diligently to get me in the system", "Interview Questions": "What’s the most difficult part of your current job "}], [{"date": "6 Dec 2018", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Talking about why interest in hospital and background. The interview process is done through the ACGME match. You interview with members of core faculty. There is a dinner the night before with the co fellows", "Interview Questions": "why morristown medical venter"}, {"date": "20 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "Comfortable and relaxed environment although did not have any choice of the date/time of the interview and was unaware it was during an open house. Met with one manager and then the recruiter. Took less than an hour overall and got a phone call with an offer a few days later.", "Interview Questions": "How do you handle a difficult coworker? How do you interact with your aides? Recall a time you had to learn a new skill quickly, "}, {"date": "4 Oct 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Health System in Sept 2018", "Interview Descriptions": "HR called 3 months after I applied on the website, on the day of the interview, i was given a tour of the floor that I would be working on, sat down and talked about the position, no questions asked so it was more of a casual conversation with the coordinator, heard back in 1 and  a half weeks", "Interview Questions": "N/A"}, {"date": "8 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Atlantic Health System in May 2018", "Interview Descriptions": "Smooth. People at AHS are amazing. HR interview will emphasize on different pt scenarios but if you have some nursing experience you will succeed. The interview with the unit manager is related to nursing tasks.", "Interview Questions": "What do want to be part of the facility? "}, {"date": "13 Dec 2018", "title": "Credentialing Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Dec 2017", "Interview Descriptions": "Filled application online. 2 weeks later received a call for interview. \nInterview lasted about 45 minutes. They asked basic interview questions.\nThen the manager proceed to tell me about their \" family environment\".\nI received a call a few days later, I got the job and HR started the paperwork.\nthere was nothing there with a \"family environment'.", "Interview Questions": "they asked me questions about my resume, and experience as well as the basic interview questions that they ask everywhere else."}, {"date": "2 Aug 2017", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Atlantic Health System (Pompton Lakes, NJ)", "Interview Descriptions": "I went through a recruiter, and was called in for an interview the next week.  When I arrived at the location, I was cheerfully greeted by the Recruiter.  We went into her office, and she described the position and the skills needed.  About half-way through the interview, the Recruiter became obnoxious and very professional.  She started asking me personal questions that had nothing to do with the job or my experience or my skills.  In my opinion, Atlantic Health Systems should develop guidelines for their Human Resources Recruiters on how to interview more professionally.", "Interview Questions": "what computer skills do you have?"}, {"date": "27 Nov 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Atlantic Health System (Newton, NJ) in Aug 2017", "Interview Descriptions": "Personal and professional. Met with the nursing manager and staffing coordinator who both interviewed me at the same time. During the process, reasons on why I wanted the position as well as whay is expected were discussed. Overall, the interview was excellent from both every perspective.", "Interview Questions": "What led me to choosing Atlantic Health system"}, {"date": "3 Aug 2017", "title": "Director of Total Rewards Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Summit, NJ) in Apr 2017", "Interview Descriptions": "Applied to LinkedIn posting by Exeter Group (recruiter).\r\n\r\nCalled by research person and reviewed experience.\r\n\r\nScheduled to meet with team of their senior search executives.  \r\n\r\nMeeting was typical with a lot of back and forth.  Didn't get passed to AHS since I didn't have Hospital background.", "Interview Questions": "What would you do in first 100 days?"}, {"date": "5 Dec 2016", "title": "Insurance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morris Plains, NJ)", "Interview Descriptions": "once you receive the call of interest, please be sure to bring a legal form of ID for yourself... maybe even a copy of ID's with social security card included. bring resume & give yourself time for parking. please allow at least an hour for the interview,.", "Interview Questions": "reason why you would like to work for AHS"}, {"date": "15 Dec 2016", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Nov 2016", "Interview Descriptions": "After sending my resume, was called within few weeks for video interview. They had me install a software for video chat. The interview was very relaxing, no pressure. Amazing people. And did not attack much, they were very nice and easy going asking about my experience in work field. After the interview, in 2 weeks I got a call saying I was selected and wait for paper work.", "Interview Questions": "How well do you work with teams !?"}], [{"date": "12 Oct 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Newton, NJ) in May 2016", "Interview Descriptions": "I was cross examined by 2 lower level employees. I don not think this is common, usually it is the hiring manager who will interview, but she was busy. Overall it was a laid back and easy interview.", "Interview Questions": "Name a time you made a mistake and what you did to correct it."}, {"date": "7 Dec 2016", "title": "Event Coordinator/Fundraising Specialist (Temp Assignment) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Atlantic Health System (Pompton Plains, NJ) in May 2016", "Interview Descriptions": "It was comfortable and informative.  I felt like I belonged there.  The director was easy to speak with.  She was very specific on what skills and knowledge I had.", "Interview Questions": "What experience do you have in event planning and fundraising?"}, {"date": "10 Apr 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "I applied online via their careers section for many PCT jobs. After about 4-5 months, I got a phone call saying they were interested in having me come in for an interview. I interviewed with HR for about 25 minutes, and was then taken to the floor where I spent about an hour on the floor speaking with the nurse manager, the charge nurse, and another PCT. Everyone was very friendly and welcoming. The process went very quickly from then- PPD testing, physical with occupational health, signing contracts, etc.", "Interview Questions": "Tell us about a time you had to deal with a difficult patient. How do you manage the situation?\r\nHow do you handle conflicts at work, specifically if you don't get along with another employee?\r\nTell us about a time you went above and beyond to help a patient. What was significant about this time?\r\nWhy should we hire you?"}, {"date": "15 Jun 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Atlantic Health System (Morristown, NJ) in Apr 2016", "Interview Descriptions": "Interview process was thorough and direct. They asked me mostly about my nursing experiences. I had 2 interviews, but on separate days. Both nurse managers were very pleasant and friendly. They made the interview feel like a normal conversation.", "Interview Questions": "Name a time that you had a difficult patient or family member to deal with. How did you handle that situation? What was the outcome? "}, {"date": "11 Jan 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ)", "Interview Descriptions": "Interview was mostly hiring person complaining about their job and the stress they were under. Final interview was good business discussion, but every promise of support that was provided during interview ended up being a lie once employment started.", "Interview Questions": "Pre-interview I was allowed to visit location and interview staff. One of my questions was, \"don't you agree they all need to be fired?\". Very unprofessional."}, {"date": "9 Mar 2016", "title": "Nurse Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Atlantic Health System (Newton, NJ) in Dec 2015", "Interview Descriptions": "applied online. was contacted by mgr of department for a part-time position. manager pleasant on phone and very interested..set-up interview. position in Newton which is about an hour drive on the hwy for me. At interview team lead present. turned out they knew each other from St. Clares. thought interview went well. met with HR before i left. was asked for previous mgr reference which was sent to HR rep immediately.. salary was avg. .heard a week later not selected. called HR. said they hired internally..it left a bad taste in my mouth.", "Interview Questions": "why do you want this position. what is your past experience. what EMR are you familiar with."}, {"date": "29 Nov 2015", "title": "Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Atlantic Health System", "Interview Descriptions": "Takes a long time to get called for an interview. Must submit application online only. Go in for interview, sit down and talk. do background check and pre-employment physical. I don't want to add more. You should accept what people write instead of making this process as difficult as getting a job!!!!", "Interview Questions": "Discuss a difficult patient or doctor that I dealt with in the past and how I handled it."}, {"date": "24 Oct 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "Extremely nice and very good. highly professional. the interviewer was calm and very soft spoken. they made me feel relaxed and had a lot of patience. They asked me about my past experience and also my skills. They also reviewed the work samples.", "Interview Questions": "Q: Describe briefly about your past job?"}, {"date": "6 Dec 2015", "title": "PD Courier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System in Aug 2015", "Interview Descriptions": "Very professional and comfortable. Met with the coordinator and had a good conversation. Questions were hard but eventually got it. 2 part interviews with the HR also. Make you wait until orientation to work.", "Interview Questions": "What was a difficult situation and how did you handle it?"}, {"date": "1 Sept 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Atlantic Health System in Aug 2015", "Interview Descriptions": "Very friendly staff, can be a bit confusing to get around hospital but pleasant experience. I got a tour of the department and was explained what the hours and days that were available for work", "Interview Questions": "Tell us about a time that you had to deal with an unhappy customer and what did you do to resolve it"}], [{"date": "4 Dec 2017", "title": "Unit Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Atlantic Health System (Morristown, NJ) in Jul 2015", "Interview Descriptions": "Two-Step Interview, first received a call from human resources for a quick phone interview. Then  I received a phone call from my unit coordinator to schedule an in-person interview.", "Interview Questions": "Describe a time that you dealt with a difficult customer. "}, {"date": "21 Aug 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Atlantic Health System (Morristown, NJ) in May 2015", "Interview Descriptions": "I was contacted by an assistant to set up the interview. I interviewed and was hired. My start date was dependent on the availability of mandatory employee training for all employees.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Jul 2015", "title": "Business Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Atlantic Health System (Morristown, NJ) in May 2015", "Interview Descriptions": "Was asked to come in 2 days after the call by the manager. Came in and interviewed with the manager and then the director. the next week I was offered the position by HR", "Interview Questions": "Where do you see yourself going?"}, {"date": "8 Mar 2015", "title": "PD Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System", "Interview Descriptions": "Very easy process.  Asked about prior work experience and questions how I handled several situations at my prior job.  The recruiter then provided me with information re: benefits, PTO, and duties", "Interview Questions": "Did you ever have a co-worker that was difficult to work with?"}, {"date": "6 Sept 2016", "title": "Unit Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Atlantic Health System (Summit, NJ) in Mar 2015", "Interview Descriptions": "The interview was about a half hour total. It involved the usual interview questions like describing yourself, strengths/weaknesses etc. Then I was asked about 10 different situational questions which were pretty difficult. Then finally, I was taken on a tour of the floor.", "Interview Questions": "What would you do if a patient's family asked you to do something that was out of your job description?"}, {"date": "30 Jan 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Atlantic Health System (Morristown, NJ) in Jan 2015", "Interview Descriptions": "A series of questions by the direct manager, followed by a second interview with the same manager and their supervisor. Interview by HR, then full background, credit, employment check, drug screening and medical exam.", "Interview Questions": "How would you handle the aspect in other ares of your life?"}, {"date": "24 Dec 2014", "title": "Medical Records Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Atlantic Health System", "Interview Descriptions": "I applied to Atlantic for over 8 months before a manager from medical records department contacted me & asked me to come in for an interview. I met with the manager and the person who was going to be taking her job . They asked basic questions about my work history and accomplishments. They constantly exchanged glances with each other during my interview & had side convos. Very unprofessional . At the end of the interview she asked me if I had any questions , I was able to get one of my questions answered but she rushed me out . The interview only lasted 10-15 mins so I do not know wu the Rush was. I had another successful interview with Atlantic , (which was much more formal) and ended up gettig that position . I think it just depends on who you end up interviewing with .", "Interview Questions": "What character would describe you ?"}, {"date": "22 Feb 2016", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Nov 2014", "Interview Descriptions": "I was contacted by an agency recruiter initially for the role.  I had one 20 minute phone interview, and then one in-person interview during which I met with two different people.  Both managers were very friendly and I've heard that Atlantic Health Systems is a great company to work for.  I'm not entirely sure they really knew what they were looking for.  Shortly after interviewing I was told the position was put on hold.", "Interview Questions": "They asked me to describe a time when I was able to convince a candidate they should explore an opportunity that they weren't initially sure about (not in those exact words, but essentially what they were asking)."}, {"date": "2 Feb 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Newton, NJ) in Sept 2014", "Interview Descriptions": "I do not remember much of my interview other than I was qualified and pretty much hired on the spot since they were short staffed. it took a total of 4 weeks from interview to start", "Interview Questions": "my experience"}, {"date": "16 Jun 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ)", "Interview Descriptions": "Applied online. Got a call maybe 2 weeks later and went in for an interview. Initially met with HR recruiter, then with the office manager. Heard back fairly quickly with an offer which I accepted, no salary negotiation. Had to do background check before starting with company. Was a pretty standard interview process for administrative role.", "Interview Questions": "Pretty standard; asked about ability to multitask."}], [{"date": "7 Jun 2014", "title": "Medical Records Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Atlantic Health System", "Interview Descriptions": "I was contacted by the department coordinator for a brief 30 minute interview that consisted of situational questions that were based on the job.  It wasn't necessarily about the job functions but how you would work as a team player, problem solving, etc.  A week later, I was scheduled a phone interview with an HR person that dealt with more personality/behavioral questions that see if you would fit with the organizations goals and mission values.\r\n\r\nThe process was kind of long, especially for a per diem position.", "Interview Questions": "Think about a time you helped or coached a colleague"}, {"date": "6 Aug 2015", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Atlantic Health System (Parsippany, NJ) in May 2014", "Interview Descriptions": "intellectual conversation, felt it went smooth - asked the good questions - i was called back with in 5 weeks time to sign up and get the paper work done.  HR was smooth as well.", "Interview Questions": "Why did you leave your last job"}, {"date": "27 Jan 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Mar 2014", "Interview Descriptions": "I was brought in for an interview and met the director and the person who would be my manager.  It was pretty short and sweet, I did most of the talking, afterwards, they told me if I was still interested to let them know.  I thought about it and said I was still interested, and they brought me back for another interview to meet the rest of the staff.", "Interview Questions": "What is your experience with Clinical Trial Research"}, {"date": "7 Jan 2016", "title": "Systems Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Atlantic Health System (Pompton Plains, NJ) in Jan 2014", "Interview Descriptions": "The interview was long and professional. I was interviewed by the team lead and then the manager. It took them 3 days to get back to me after the interview and they called me with a good news that I was selected. Just remember to stay focused on the interview and prepare before you go for the interview.", "Interview Questions": "How to troubleshoot workstation when it cannot connect to the internet, how to add The printer and workstation to the network, The process or migrating workstation from one OS to Another."}, {"date": "24 Oct 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Atlantic Health System (Summit, NJ) in Nov 2013", "Interview Descriptions": "I applied for the position and came in soon after - maybe a week or so. Very basic and standard questions, which weren't very challenging. I applied for another position at the organization which was based more on skillset and experience.", "Interview Questions": "What are your strengths/weaknesses?"}, {"date": "27 Jan 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Nov 2013", "Interview Descriptions": "Very good process. HR was good and willing to work with you. Standard interview questions nothing out of the ordinary. Meet with my manager and senior manager.  Was able to start right away after interview.  Knowing about company culture and mission statement is very important.", "Interview Questions": "How I felt my personal attributes could benefit me in the job. "}, {"date": "30 Jul 2016", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Morristown, NJ) in Aug 2013", "Interview Descriptions": "Phone interview with the head of HR and then a 1 on 1 interview with the department coordinator. Questions asked about previous work experience as well as getting a sense of your work ethic and personality", "Interview Questions": "Do you work well in a team setting? Do you work well under pressure? How do you handle adversity at work?"}, {"date": "4 Sept 2015", "title": "Doctor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Atlantic Health System (Summit, NJ) in Jun 2013", "Interview Descriptions": "Met with VP Several times, he was very cordial, described salary range,and wanted to know my experience.  I told him about my experience, and ability to be a team player.", "Interview Questions": "Why are you working here?"}, {"date": "1 Jun 2013", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Atlantic Health System in Apr 2013", "Interview Descriptions": "The whole process took a long time. Applied for job, exactly one month until call back for interview, had interview, waited another month for hiring decision. It will take another month for me to complete testing and paperwork before I work. Whole process 3 months. The interview was seemingly laid back but I could tell they really care about who they hire. I'm thrilled to be working there!", "Interview Questions": "Mostly situational questions. "}, {"date": "30 May 2015", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Atlantic Health System (Morristown, NJ) in Mar 2013", "Interview Descriptions": "My interview at Atlantic Health Systems was not any different than any other interview process.Being said that,if I was not recommended by my former manager more than likely I would not have gotten employed.Through that connection,I interviewed with both hiring managers and got hired.", "Interview Questions": "How long have I have been an certified technician?"}], [{"date": "15 Jul 2015", "title": "Radiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Mar 2013", "Interview Descriptions": "Easy interview onsite. Asked typical interview questions along with situational questions. Very easy going people. Interviewed by two people and was asked questions concerning how I would handle certain situations.", "Interview Questions": "What would you do if you had a very angry patient on the phone with you?"}, {"date": "26 Jan 2017", "title": "CMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Mar 2013", "Interview Descriptions": "The interview is a little intimidating. You are interviewed by 3 managers, one after another. You leave the interview not knowing if they are going to offer you the position because HR has to make the offer.", "Interview Questions": "How did you handle a situation?"}, {"date": "2 Apr 2015", "title": "Administration Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Atlantic Health System (Newark, NJ) in Apr 2011", "Interview Descriptions": "the interview itself went fast HR took time to get back to me. I made sure interviewed myself during the process. I went in strong and eager. I called constantly to get a status HR was very slow following up. I ended up calling management directly", "Interview Questions": "Why health Care"}, {"date": "20 Mar 2013", "title": "PC Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Atlantic Health System (Morristown, NJ) in Dec 2009", "Interview Descriptions": "It was such a long time ago, I'm sure it has changed.  Back then, it was very low key.  I think there was only 1 interview with the manager and it was all technical questions....  But, since it's a hospital system, you need to pass all the health exams (physical, blood, urine, etc...)", "Interview Questions": "None that I can think of.  It was all tech stuff on PCs, printers, network stuff, login scripts, hardware/ software, etc"}, {"date": "14 Nov 2012", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Atlantic Health System (Summit, NJ) in Sept 2008", "Interview Descriptions": "Was contacted within 12 hours of submitting application on atlantichealth.org, interviewed 1 week later and hired within 2 weeks of interview.  Fastest interview/hiring process I have ever experienced.", "Interview Questions": "Questions mostly related to specific position applied for, nothing overly difficult."}]]