[[{"date": "9 Dec 2019", "title": "Student Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bradley University (Peoria, IL) in Nov 2019", "Interview Descriptions": "I was interviewed  by two individuals which lasted about  20 minutes. The questions were of average difficulty.  Don't expect to be notified if you weren't chosen.  Even after contacting  HR.", "Interview Questions": "My weaknesses. I think I told them the wrong thing"}, {"date": "27 Feb 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Jul 2018", "Interview Descriptions": "It wasn't actually an interview my advisor just needed to know whether I was capable of doing the job or not. \r\nNext, it was about checking that my GPA matched the requirements and then checking how I did in my past semester in terms of working as a grader for another professor.", "Interview Questions": "When do you graduate?"}, {"date": "4 Jan 2018", "title": "Student Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Bradley University", "Interview Descriptions": "Fairly quick & easy. Only one interview if you apply as a freshman versus two or three if you apply as a current student. They conduct the interviews during your orientation so be prepared.", "Interview Questions": "What are you looking forward to getting involved with at Bradley?"}, {"date": "30 May 2016", "title": "Student Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bradley University", "Interview Descriptions": "I was hired as an incoming freshman. I know from friends that the application process is much different in that case.  I had to fill out an initial application that required me to creatively answer a variety of question such as why I think I would be a good fit for the job, what famous person I would most like to be for a day, etc. After waiting for quite sometime, I was contacted about an interview.  I had the interview on the first day of my freshman orientation. It was incredibly relaxed.  I went into the office and had a conversation with my future boss and two current college students.  We just talked about why I liked Bradley, why I wanted the position, and just chatted about who I was as an individual. I was contacted for hire within the next few months.", "Interview Questions": "Why do you want to be a STAR?"}, {"date": "21 Aug 2015", "title": "Career Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Bradley University (Peoria, IL) in Apr 2015", "Interview Descriptions": "Standard application with resume and cover letter. Offered an interview and group interview with 3 other individuals. It was a very simple process and everyone was great to work with. The interview only took 30 minutes and was about 7 questions in length.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Feb 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bradley University (Peoria, IL)", "Interview Descriptions": "I was called for an interview two days after submitting my resume. The search panel was kind, but the interview was very easy and informal. Panel just briefed me on the job and benefits. Very few real interview questions were asked, other than my prior work experience. I was told the salary range and thought there would be room for negotiating. There wasn't. It appears they have great benefits, but who cares about that when you can't even pay your monthly bills on their offered salary? It's insulting. They have excellent opportunities and want experience, but their pay structure is for recent graduates only.", "Interview Questions": "Why do you want to work for Bradley? Why are you wanting to leave your current employer? What are your future goals?"}, {"date": "7 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Feb 2015", "Interview Descriptions": "The selection was process and chosen because of my good academic performance,Presentations and assignment work.\r\nThey ask you if you interested to work with them and assist them in the research field.", "Interview Questions": "Why we should hire you? \r\nhow you can be an asset to the organization?\r\nWill you be able to manage research work and your studies simultaneously.\r\nwhich field are you interested in?"}, {"date": "27 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Feb 2015", "Interview Descriptions": "They took my resume and interviewed about my projects. I clearly explained each and every project clearly. My confidence has helped me in cracking this interview. They are very specific to their requirements and ask more questions on their area of interest.", "Interview Questions": "They took my resume and interviewed about my projects.They took my resume and interviewed about my projects. I clearly explained each and every project clearly. My confidence has helped me in cracking this interview"}, {"date": "22 Apr 2016", "title": "Finance Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Jan 2013", "Interview Descriptions": "Really simple. The coordinator reviewed my grades with me. Asked if there were any classes in particular I was comfortable tutoring others in. Asked to tell a little about myself, my classes enrolled in, and such. The process was very smooth. No trick questions or examinations of any kind.", "Interview Questions": "What classes are you comfortable tutoring others in? Have you tutored before?"}, {"date": "22 Feb 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Bradley University (Peoria, IL) in Oct 2012", "Interview Descriptions": "Mostly behavioral questions. You apply by submitting your resume and application then everyone gets an interview with two hall directors asking questions and then there's a group interview. If you get an email back to move on you have a final interview with the director of residential living.", "Interview Questions": "Strengths and weaknesses."}], [{"date": "20 Mar 2016", "title": "America Reads Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Bradley University (Peoria, IL) in Sept 2012", "Interview Descriptions": "I met with a representative during the career fair, submitted a paper application, and then interviewed in person. The interview process was straightforward, and I received feedback within the same week.", "Interview Questions": "What is your experience working with children?"}, {"date": "14 Aug 2015", "title": "Administrative Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Aug 2012", "Interview Descriptions": "Very easy, but archaic. You actually have to go in and take a typing test to prove you can type at least 50 words per minute. What admin with any experience is unable to do that? You really have to prove it?", "Interview Questions": "I can't recall. It was all very boilerplate."}, {"date": "3 Jul 2012", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bradley University (Peoria, IL) in May 2011", "Interview Descriptions": "Very professional and friendly. About an hour long discussing projects I've worked on and software experience I've had. Called next day to have an one on one interview aand they were few direct questions about my project which i had put in my resume and it was quite indepth about my project", "Interview Questions": "transistor level questions"}, {"date": "5 Aug 2010", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bradley University (Peoria, IL) in Nov 2008", "Interview Descriptions": "Interview took 30 minutes, asked basic questions about former training for PhD. Very laid back, easy going conversation.", "Interview Questions": "How many years did you spend in post doc?"}]]