[[{"date": "13 Nov 2021", "title": "Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Blumont (Ḩawwārah, Amman Governorate)", "Interview Descriptions": "First interview typical interview questions. \nBut when I asked about any training opportunities, I got faced with a No, that will be up to the project and the project has no budget for that. \n\nI asked again about career development, I got faced again with a No, the project is responsible for career development, but the project has a fixed structure and fixed rules. \nI can't move in my career if all the positions are already filled. \n\nI got asked for a 2nd interview, I declined", "Interview Questions": "Why do you want to join Blumont?"}, {"date": "9 Jun 2020", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Blumont", "Interview Descriptions": "Initially did a call screening with a recruiter from HR after applying online. Was then scheduled for an interview several days later.\r\n\r\nThe interview was structured as two separate interviews––each with 2 supervisors––conducted back to back. The interviews were immediately followed by a 2 hour writing test. So in all, the process took about 3.5 hours.\r\n\r\nAfter a few weeks of waiting, I was declined for the role and told someone with more direct experience in the development field was chosen over me despite the fact that the recruiter told me it wouldn’t be an issue in the initial phone screening.", "Interview Questions": "What is your 5 year plan?"}, {"date": "5 Aug 2019", "title": "Talent Acquisition Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Blumont (Arlington, VA) in Jun 2019", "Interview Descriptions": "Really great to work with the team. Had an initial phone screening and then a more formal process ensued.  This included meeting with several future internal clients, as well as speaking with everyone on the team that I would go on to join.", "Interview Questions": "Experience in the world of ID"}, {"date": "13 Aug 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Blumont (Arlington, VA) in Mar 2018", "Interview Descriptions": "It has very well set it up. It started with a phone interview then followed up with an in-person interview.  I met the hiring manager and managing partner after. They asked me personal questions", "Interview Questions": "Where do you see yourself in 5 years?\r\nWhy do you want to work here?\r\nCan you use R, SQL ?\r\n"}, {"date": "13 Apr 2017", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Blumont (Washington, DC) in Mar 2016", "Interview Descriptions": "I first got an email about my application. I applied almost a month prior so I almost forgot that I even applied. The whole thing was relatively relaxed and standard.", "Interview Questions": "Very standard questions--things you would typically expect. "}, {"date": "29 Feb 2016", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Blumont (Arlington, VA) in May 2015", "Interview Descriptions": "I would say that 0verall process was smooth. It was easy to find the place. There was a standard set of questions and the testing. HR Manager was very helpful and well coordinating the process of hiring. The time was convenient for me. The person who was supposed to interview me came on time. She held a small talk to make me feel relaxed. The general atmosphere was pleasant.", "Interview Questions": "all the questions were standard. Nothing special I was asked. "}, {"date": "2 May 2015", "title": "Logistics and Procurement Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Blumont (Herat) in Nov 2013", "Interview Descriptions": "the interview processed remotely via internet using SKYPE application. several managers were interviewing and asking expertise and technical question regarding duties and responsibilities as a logistics and procurement assistant, and they showed interest about my logistical and inventory skills . they asked me about previous and employer and the duties i performed.", "Interview Questions": "Describing Cycle of procurement, Inventory and Supply Chain, bidding and soliciting, vendor list, preparing quotation,"}, {"date": "21 Jun 2012", "title": "Associate Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Blumont (Rosslyn, VA) in Feb 2011", "Interview Descriptions": "I was invited to apply by a current employ that I new from previous work. After my initial application IRD waited six weeks to contact me. The sector Director that I work under interviewed me along with a future colleague. They both had read my resume, but they were clear what they were looking for. I would recommend coming into an interview ready to answer random technical questions but also ready to guide your interviewer.", "Interview Questions": "Technical questions about small grants programs"}], [], []]