[[{"date": "19 Apr 2023", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Girls Inc (Dallas, TX)", "Interview Descriptions": "1. Phone screen (~20-30 mins) 2. Virtual Zoom Interview (~1 hr) 3. In-person interview with 2-3 people from leadership (~1.5 hrs) 4. Drug Screen + Background Check Overall, the interview process was way too much for the position itself. Some of my fellow co-workers even had interviews that were two hours. Interviews over an hour are a red flag for me.", "Interview Questions": "How did you prepare for this interview?"}, {"date": "15 Feb 2023", "title": "Lead Program Facilitator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Girls Inc (Seattle, WA) in Feb 2023", "Interview Descriptions": "First a phone interview with a hiring manager. Then a zoom meeting with two hiring managers. After that they let you know within a week if you have the job.", "Interview Questions": "How to develop the whole girl? What is your flexibility and adaptability working with people from different cultures? What if the girls were bored with the curriculum?"}, {"date": "16 Dec 2022", "title": "Program Facilitator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Girls Inc (Dallas, TX) in Nov 2022", "Interview Descriptions": "The interview process was smooth, informative, and thorough. I was able to ask questions that helped form my understanding of the position. The first step was a virtual interview with a hiring specialist and then progressed to an on-site interview scheduled for the following week. Everyone I spoke with that was associated with Girls Inc was very professional and eager to create a shared understanding of the expectations of the role and how to fulfill those expectations.", "Interview Questions": "It was a very thorough, interrogative process that posed a lot of open-ended statements that began with \"Describe to me a situation where...\" or \"Explain to me how you would deal with [insert scenario]\" I feel like the main one that caused some stumbling for me personally was \"How would your coworkers describe you if you were struggling with something?\""}, {"date": "12 Oct 2022", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Girls Inc", "Interview Descriptions": "it was chill conversation based. ask if youre good with kids and children. make sure you ask a lot of questions. book the converstaion over email or apply at handshake", "Interview Questions": "what are your strengths and weaknesses"}, {"date": "27 Sept 2022", "title": "Data Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Girls Inc", "Interview Descriptions": "The interview process was very well organized and seamless. The interviewer was extremely friendly and candid in answering all the questions I had about the role I was interviewing for and the organization.", "Interview Questions": "Why are you interested in this role?"}, {"date": "30 Aug 2022", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Girls Inc", "Interview Descriptions": "The interview was very straightforward. The staff was very polite and friendly. They asked mostly about who you are as a person, your background, and your goals. Make sure to just be yourself and be honest.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "19 Jan 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Girls Inc in Apr 2022", "Interview Descriptions": "It was a virtual interview on Zoom and I was put in a room with about 6 other people who took turns asking me common interview questions. They were all very nice and approachable.", "Interview Questions": "What are your greatest strengths?"}, {"date": "24 Nov 2021", "title": "Staff Facilitator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Girls Inc in Nov 2021", "Interview Descriptions": "Was screened through a 15 minute phone call, the first interview was 40 minutes of experience related questions, opinion questions, questions about hypothetical scenarios, etc. It was with two people, sort of intense, but they were friendly and the questions were not really hard for those with experience in childcare.", "Interview Questions": "Why do you want to work with youth and Girls Inc?\nWhat does it mean to develop the \"whole girl\"?\nWhat is your experience with gender non-conforming/gender expansive youth?\nWhat would you do if a child came up to you and said they were in danger at home?\nWhat was a time you practiced adaptability in a new situation?\nWhat experience do you have with lesson planning?"}, {"date": "12 Nov 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Girls Inc (New York, NY) in Oct 2021", "Interview Descriptions": "The interview consisted of one zoom interview with 3 interviewer and presentation to real students.  It was a quick process, my first interview was on a Thursday and I was called back for a second interview the same day. My presentation was the following Monday and I was selected for the position the Next Morning. If you genuinely love and are interested in working with kids, let that shine and the interview should be a breeze.", "Interview Questions": "Tell us about a time you had to find a solution while working with a coworker with a different work style than your own. "}, {"date": "19 Aug 2021", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Girls Inc", "Interview Descriptions": "Very relaxed format of interview. Questions were asked in a way to make it more conversational. I was able to ask questions about the day to day experience and the flow of each day.", "Interview Questions": "My interest in the job and what I hoped to get from the experience. "}], [{"date": "15 Feb 2021", "title": "Camp Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Girls Inc", "Interview Descriptions": "The interview process was very easy. My interviewer made me feel very comfortable. We talked for about 15 minutes then she offered me a job. I loved my time while I was there.", "Interview Questions": "When are you available to work?"}, {"date": "14 May 2020", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Girls Inc in May 2020", "Interview Descriptions": "I was first asked to do a phone interview, which was rather easy. Then, I was called into an interview with three people asking some questions. They were all very kind and genuine women. If you love working with kids, show it. Give ideas you have for activities you would do, etc.", "Interview Questions": "What are some of the resources you need to build an effective team?"}, {"date": "28 Aug 2019", "title": "Middle School Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Girls Inc (Denver, CO)", "Interview Descriptions": "I got called in for an interview with three current employees interviewing me. They were very friendly and relaxed. The office was very casual. They got back to me very quickly.", "Interview Questions": "How do you work with diversity in the classroom?"}, {"date": "29 Jan 2020", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Girls Inc (White Plains, NY) in Jun 2019", "Interview Descriptions": "Brief phone call and then an interview in the office. After meeting with the director of development and the executive director I was given the opportunity to come in and do a demo lesson in front of around 4 staff members. The demo lesson was focused on the companies mission to empower girls to be strong, smart, and bold", "Interview Questions": "How you lead a group full of under served girls"}, {"date": "3 Mar 2019", "title": "School Based Specialist - Memphis Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Girls Inc", "Interview Descriptions": "Phone interview with hiring manager, current employee in the role, and Girls Inc. participant. Lasted about 30 minutes with rotating questions. Asked questions mainly focused on Girls Inc. and interacting with youth - less about work experience or relative skills. Interviewers were not prepared for a remote candidate.", "Interview Questions": "What does the mission mean to you? "}, {"date": "17 May 2019", "title": "Director of Individual Giving Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Girls Inc (Oakland, CA) in Feb 2019", "Interview Descriptions": "First I had a phone screening with a recruiter and then came in to meet with the CDO. She liked me so I was invited back to meet with her and a few members of the development team and then the CEO. The other staff were great and so was the CEO. It seems like they are doing really great work there.  From the first meeting the CDO described herself as \"intense\" and I should have taken that more seriously. She began calling or texting me almost every day. She told me that I was the only and top candidate at the time but she was worried about how I would do \"not having my hands in all aspect of development\" since my previous position was a Development Director.  When I asked about leadership opportunities she made it VERY clear that she was a Chief and that she was in charge. Later I found out from the CEO that the position would sit on the org's leadership team so I am not sure why the CDO wouldn't have just responded to me with that. She then called each of my references (including my boss at the time). Each of the told me it felt like she was trying to figure out what was wrong with  me and didnt want to hear anything positive. She described me as \"aggressive\"  and \"loud\" during my panel interview to my current employer... Yes. this is a girls serving organization and I can't really think of too many more sexist things to say about a person who was interviewing. She event offended one of my references who was a donor to my past org. When she finally decided she wanted me, I told her that I would need some time to get back to her  so I could go to one final interview with a different org (she knew I was interviewing other places) she was completely unprofessional. She was gas lighting my decision to interview with this other organization and pushing me for details about the other role I was interviewing for and bullying me to take the job.  She even texted me the morning of my interview with the other company letting me know she  was hoping I would get the clarity I needed. I ended up not getting the job with the other org AND declining the offer with Girls Inc. If that's how she was treating me during the interview process, I can't even imagine what it would be like to work for her.  It is unfortunate because I would love to be a part of the work that they are doing!", "Interview Questions": "Tell me about a successful individual that you cultivated as a donor?"}, {"date": "28 Mar 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Girls Inc in Feb 2019", "Interview Descriptions": "I had two interviews, a skype interview with HR and a phone interview with the hiring manager. The HR interview lasted 45 minutes and was almost entirely questions of the \"Tell me about a time when you...\" variety. The 1-on-1 phone interview was more detailed about my background and knowledge of the field. The manager clarified that the focus of the position was slightly different than came across in the job posting, which threw me off a bit. But it was all very positive and friendly.", "Interview Questions": "Tell me about a time when your ethics were tested."}, {"date": "6 Jun 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Girls Inc (Indianapolis, IN) in Oct 2018", "Interview Descriptions": "Apply online  by answering some questions and standard application questions. Then they will contact you to organize an interview on the phone or in person (depending on the position). They were very friendly and professional. It was a really great experience.", "Interview Questions": "Who inspires you?"}, {"date": "5 May 2022", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Girls Inc (Lowell, MA) in Apr 2018", "Interview Descriptions": "Met with one individual who was to be my boss. Asked about work history, what about the job I was looking forward to/that interested me most. Any special skills or interests I would be willing to share/do programs about.", "Interview Questions": "Have you worked with children before and in what kind of setting?"}, {"date": "14 Nov 2017", "title": "Teen Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Girls Inc", "Interview Descriptions": "The interview process began with a group interview. There were about 15-20 other candidates and you were broken down into groups of 3-4. One team member would interview you and then switch until you interviewed with about 5 team members. After this initial interview, there was a second interview where you needed to prepare a lesson on a topic of their choice.", "Interview Questions": "Do you prefer to work alone or with others?"}], [{"date": "11 Sept 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Girls Inc (Portland, OR) in Aug 2017", "Interview Descriptions": "initial phone call interview that asked typical questions like describing such and such time, then an in person interview with 3 other staff including the directors. The interview was intense and was not very conversational. They asked a lot of questions in regards to academic rhetoric and socio-political terminology.", "Interview Questions": "What does feminism mean to you?"}, {"date": "13 Jul 2017", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Girls Inc (New York, NY) in Jul 2017", "Interview Descriptions": "The interview was in person with three people interviewing me. The position was not for any particular girls inc. school site as they place people according to need and suitability.", "Interview Questions": "How would I build rapport with a group of young women?"}, {"date": "5 Apr 2017", "title": "Fitness Program Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Girls Inc (Oakland, CA) in Mar 2017", "Interview Descriptions": "I found the listing on craigslist and local wise. I applied by sending an email to the hiring team because they requested for your resume, professional references, and cover letter as your application. About a week later they emailed me to schedule for a phone interview which took about 30 minutes. Another week and a half later, they requested for me to come in for a 2nd interview in person. For the 2nd interview they basically asked the same questions from the first interview but more questions were added, also I had to present a sample lesson plan. I was interviewed by two people and it took about an hour. Took about another week and a half to hear back if I got the job or not.", "Interview Questions": "1. What types of challenges might a middle school girl go through academically and personally? and How would you help her face those challenges?\r\n2. What drawn you to work for this program?\r\n3. What are the benefits of an all girl organization?\r\n4. What are your strengths and weaknesses?\r\n5. What types of barriers or challenges do middle school girls go through today?\r\n6. Describe any experiences you have dealt with personally, socially, or academically with peers, youth, or adults\r\n\r\nMany scenario questions.  \r\n"}, {"date": "13 Aug 2019", "title": "Program Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Girls Inc (Oakland, CA) in Jan 2017", "Interview Descriptions": "The first step is a phone screen. They will ask you pretty basic questions. It was pretty easy. If you pass this part they will ask you right then and there if you passed or not. If you did they will ask you to come in for an in person. In person is pretty easy.", "Interview Questions": "If you write that you speak an other language they will ask you a question in that language "}, {"date": "18 May 2017", "title": "Site Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Girls Inc (Portland, OR) in Aug 2016", "Interview Descriptions": "Initially,  the program coordinator responded to my email to set up a phone interview. The phone interview was brief but gave me some good insight. Then, I was invited to an in-person interview with two program coordinators. The interview itself was about 30-45 minutes long, and they were very receptive to hearing me out and answered the questions fully. Then, within about a month, they followed up with an offer.", "Interview Questions": "Describe your experience facilitating groups with youth?"}, {"date": "25 Jul 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Girls Inc (Los Angeles, CA) in Aug 2016", "Interview Descriptions": "There was no interview process to become an intern. I reached out to the Girls Inc. in my area, signed up for a group training at their corporate office. After the training session, I filled out some paperwork, submitted a background check and got my fingerprints scanned at the police department.", "Interview Questions": "You need to pass a background check, training quiz and fingerprint scan"}, {"date": "17 Jul 2019", "title": "Program Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Girls Inc (Oakland, CA) in Jul 2016", "Interview Descriptions": "3 people interview at once with pre judgement  attitudes that makes you feel really uncomfortable  with prejudice judgment written all over their faces and makes you feel as if they’re testing you to see if you’re ever going to break or give up while flooding you with quietness", "Interview Questions": "Do you see yourself working in urban neighborhoods long term?"}, {"date": "24 Jun 2017", "title": "Development Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Girls Inc (New York, NY) in Feb 2016", "Interview Descriptions": "I submitted my application online in late January/early February 2016. I participated in a phone screening, followed by an in-person interview with the Director of Development, and a final in-person interview with the Chief Development Officer and other members of the Development team. Finally, I was asked to submit references and participated in a video interview with an HR Director. They extended an offer in mid-late February.", "Interview Questions": "Tell me about a time when you made a mistake."}, {"date": "15 Oct 2015", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Girls Inc (New York, NY)", "Interview Descriptions": "Step 1: Participate in a 30 minute to 1 hour phone interview\r\nStep 2: Participate in an in-person panel interview\r\nStep 3: Provide a presentation and/or short lesson which applicant will deliver with real program participants", "Interview Questions": "Do you have experience faciitating curricula?"}, {"date": "2 Dec 2015", "title": "Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Girls Inc (Birmingham, AL) in Jun 2015", "Interview Descriptions": "2 interviews before decision was made. Ultimately, they had a person in mind that didn't apply so after interviews were over approached that person and basically strong-armed them into applying. Shady hiring practices and a waste of time", "Interview Questions": "Typical questions about strengths, weaknesses, how to handle tough situations"}], [{"date": "31 May 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Girls Inc (Bloomington, IN) in Feb 2015", "Interview Descriptions": "The interview was very brief and welcoming. The questions were very straightforward and I felt confident in how it went. Everyone that I encountered was friendly and eager to help me out. Also, I found the website very helpful to prepare.", "Interview Questions": "Q: What are you most interested in learning?"}, {"date": "4 Jan 2016", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Girls Inc (Fort Worth, TX) in Dec 2014", "Interview Descriptions": "Interview process required a resume, filling out application form, consent to background check and formal in-person interview with Girls Inc. interviewing personnel. The interview process took approximately an hour. It covered a review of personal knowledge of the agency and what their mission, goals, and expectations are. It also covered a more in-depth history of the mission, goals, expectations. Interview process included questions about personal skills, strengths & weaknesses, knowledge about working with children, etc.", "Interview Questions": "If a child asks you to keep a secret how would you respond? \r\nIf a child sits in your lap how would you respond?\r\nOn a scale of 1-10 how would you rate your organizational skills?\r\nAlso, questions about previous work experience based on resume provided."}, {"date": "25 Sept 2014", "title": "Elementary Program Facilitator (Orange County) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Girls Inc (Costa Mesa, CA)", "Interview Descriptions": "I saw a posting for an open position on their website. Submitted my resume and a short introduction letter that was not asked for but I felt it was appropriate. I was invited to an informational which was really a group interview. There we learned more about the position and work environment . We were then asked to tell us more about ourselves and why were here. After this they broke us up into smaller groups and asked us the usual interview questions. \r\n\r\nAfter a few days I was invited to a second interview . Here I was expected to present an activity and answer more interview type questions.", "Interview Questions": "Why should we hire you?"}, {"date": "15 Sept 2014", "title": "Public Policy Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Girls Inc", "Interview Descriptions": "I applied for an internship with Girls Inc with the Washington DC branch. Before the interview we communicated via email and that was simple enough, I received fast replies and was quickly set up a phone interview. My phone interview was pretty typical of all interviews for DC internships. We talked about my experience, especially the one that directly related to the internship, why I chose Girls Inc and quite a bit about the position itself. My only issue is that the woman who interviewed me was very pushy about me starting as soon as possible, yet she hadn't exactly offered me any position. Within a day or two I was offered the position but declined because they seemed way too pushy starting before my available start date and I read previous reviews that their internships didn't actually reflect what actually was expected. \r\n\r\nThis also just popped into my mind. During the interview she mentioned another internship position that wasn't currently opened. I casually mentioned that I had seen that internship on past listings and that that position looked like something I would enjoy doing as well, especially since I had such a big background working in marketing. That is all I said. She then went on to comment something along the lines of, \"you do know you're interviewing for the Public Policy Internship right?\" Maybe I was just being sensitive but it just rubbed me the completely wrong way.", "Interview Questions": "Would you be comfortable attending large meetings to simply take note of what occurred then report that information back to whomever necessary? Do you have experience doing anything like this?"}, {"date": "15 Jul 2015", "title": "Facillitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Girls Inc (Goleta, CA) in Sept 2014", "Interview Descriptions": "Straightforward, asked for examples of how you would interact with children. Also asked about how previous work experience or leadership roles would help you out with this job and working with children of all learning styles and abilities", "Interview Questions": "What are some strategies you would take in talking to a difficult child?"}, {"date": "19 Sept 2016", "title": "Program Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Girls Inc (Oakland, CA) in Aug 2014", "Interview Descriptions": "There was an initial phone interview with the GIRLStart Program Manager. After this, when asked to come in form an interview I was given a prompt  (a brief story about a child being brave) and asked to create a lesson plan using this prompt. This was to include vocabulary words and an enrichment activity afterword. Once at the interview, I was asked to deliver the lesson to the two people interviewing.", "Interview Questions": "Tell me about yourself. "}, {"date": "18 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Girls Inc (Dallas, TX) in Jan 2014", "Interview Descriptions": "The supervisor asks about ourselves and gives quite a few scenarios to see what we would do in a certain situation.  She wants to make sure we can handle working with various age groups. Very easygoing.  Nothing was asked that would be considered out of the ordinary.  She just wanted to know if we had ever worked with children and what brought us to this company.", "Interview Questions": "Do you think a child has to like you in order to do your job effectively?"}, {"date": "11 Aug 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Girls Inc in Jun 2013", "Interview Descriptions": "One phone interview with human resource coordinator that talked with me about the job and the position more in depth. Very transparent with what it required and the pay. \r\nCalled for an in person interview with the hiring manager", "Interview Questions": "Why do you want to work for us"}, {"date": "30 May 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Girls Inc in Apr 2013", "Interview Descriptions": "Initial information session with a group of applicants all there at the same time. We then broke out into groups. After the info session, I was then called in for a personal interview where I had to prepare a presentation. I was given limited information. After that interview, it was possible I was going to need to interview again, but then the hiring manager let me know it was down to me and one other person. In the end, the 3rd interview was not necessary and she offered me the position.", "Interview Questions": "Describe a time when..."}, {"date": "13 Mar 2017", "title": "Program Facilitator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Girls Inc (San Antonio, TX) in Feb 2013", "Interview Descriptions": "The interview process took place over only one interview. It has been a while since I have worked there so their process may be different now. I had always been interested in working for non profits and over all, it was a good experience.", "Interview Questions": "How much experience have you had working with children?"}], [{"date": "18 Dec 2013", "title": "Program Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Girls Inc (Hagerstown, MD) in Aug 2012", "Interview Descriptions": "Submitted my resume, received an interview and call back within a few days. The interview was scenario based with two people in the room. It wasn't intimidating or intense, the individuals who interviewed me were extremely nice and were simply looking for a new hire that they saw potential in. I knew the outs and ins of the company, therefore they hired me the same day they interviewed me.", "Interview Questions": "N/A"}, {"date": "30 Nov 2011", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Girls Inc in May 2009", "Interview Descriptions": "Called and didn't hear back for a long time, but finally set up an interview on a Friday afternoon. Interviewed one-on-one with two different supervisors. Initial perceptions: a little disorganized but they have a good reputation", "Interview Questions": "What is one of your weaknesses?"}]]