[[{"date": "30 May 2023", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PATH (Washington, DC)", "Interview Descriptions": "The interview process was very fair and straightforward. There was an initial HR screening, panel interview with similar job-level staff, and a final interview with the director. There was two test - one administrative and another technical.", "Interview Questions": "Q: How do you handle stress."}, {"date": "24 May 2023", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH in May 2023", "Interview Descriptions": "Three-step process: 1. recruiter screen- an introduction to the role and general screening 2. Panel interview- competency-based interview matching your background to the role. STAR methodology to answer questions. 3. Final interview: motivation for applying for the role. Very well-coordinated interview. The team was very friendly.", "Interview Questions": "Tell us about yourself. Recruiter competency-based questions"}, {"date": "8 Mar 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at PATH", "Interview Descriptions": "Interview was seamless. Interviewers were cordial and open. Interviewers were happy to share more about the company and answer questions frankly. They were also transparent with pay range and open to negotiation.", "Interview Questions": "How did your experiences prepare you for this role?"}, {"date": "23 Sept 2022", "title": "Talent Acquisition Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "My interview process was efficient and effective.  The team did an excellent job of answering my questions and providing me updates regarding my status.  I was very impressed at the professionalism of the team.  I had an interview panel of about 4 individuals across different time zones and it was coordinated very effectively.  ", "Interview Questions": "Familiarity with BD recruitment, recruitment platforms, managing a team, managing a team, exp.  managing an employee with poor performance\n"}, {"date": "22 Aug 2022", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Several rounds of interview with recruiter, then hiring manager. Followed by a round robin panel. The recruiter kept me updated on the following steps. I found the process to be smooth and transparent and fairly quick.", "Interview Questions": "I was asked about risk management"}, {"date": "19 Aug 2022", "title": "Grants and Contracts Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Screening interview with recruiter, interview with the hiring manager, then panel interview with three team members. This interview process felt very comfortable. The internal recruiter made sure that I had the best application possible, the hiring manager was very kind and very helpful, and the panel interviews went well.", "Interview Questions": "N/A"}, {"date": "20 Aug 2022", "title": "Regional Ntd Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PATH (Lucknow) in Aug 2022", "Interview Descriptions": "Question ask from Job Description, start from basic intro than an in-depth analysis of the topic, also you're previously worked experience share, fieldwork, officials panel therefor question    and reply on point only", "Interview Questions": "From your previously worked related field work"}, {"date": "31 May 2022", "title": "Commercialization Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Overall okay but the organization didn't seem to agree on what the person they were looking to hire would actually do (what's the job description, who will they work with, what projects will they work on, what's their role)", "Interview Questions": "Tell us about yourself please"}, {"date": "3 May 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Virtual process that asked questions about experience ands relatedness . Zoom link was sent and I was interviewed by program managers and lead case mangers. The interview process took about 30 minutes", "Interview Questions": "What is the Housing first model?"}, {"date": "8 Jun 2022", "title": "Credentialing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PATH in May 2022", "Interview Descriptions": "At first there is a phone screening where you discuss your experience and the position. Then if you make it through that you have a zoom interview. Next process is a take home case study and then another zoom interview if they liked your case study.", "Interview Questions": "Salary requirement, experience, and why you are leaving current job."}], [{"date": "18 Apr 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Seattle, WA) in Apr 2022", "Interview Descriptions": "Super fast response after resume was uploaded. Excellent HR interaction. Overall very professional and well organized. The panel included a broad set of peers, collaborators, employees and leadership. Fast and constructive feedback.", "Interview Questions": "What is the aspect of the JD that you have the least experience with?"}, {"date": "10 Feb 2022", "title": "Behavior Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "1 interview lasted 30 minutes.  The interviewer mostly told me about the position and did not ask that many questions of me. They seem willing to acoomodate clinicians needs and schedules", "Interview Questions": "Asked about availability and approach"}, {"date": "27 May 2022", "title": "Human Resource Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Nairobi Hill) in Jan 2022", "Interview Descriptions": "The interview process was well planned, well executed and feedback was timely and efficient. The staff are very professional. I would recommend applying to path or working at path to anyone who has the right qualificaitons for the role. Their process is also very transparent, and they give/offer feedback in a timely manner throughout the process.", "Interview Questions": "Interview process was thorough, adequate and appropriate"}, {"date": "2 Nov 2021", "title": "HR role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at PATH", "Interview Descriptions": "They reached out to me so that we could have an introductory one on one chat about the role. It was short notice and I gave them a date. They never responded back!!Two email follow ups later and I still got no response.  After afew weeks I wrote to them that I was still interested in the role and was looking forward to our one on one meeting and thats when they responded that they were moving forward with other candidates. It gave me a bad candidate experience and I don't think its a place I would want to work in!", "Interview Questions": "The one on one interview never happened "}, {"date": "10 Feb 2022", "title": "Intern Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PATH (New Delhi) in Oct 2021", "Interview Descriptions": "It was a comprehensive two step process. First being CV shortlisting and second was the telephonic interview by the Communication Officer. I absolutely enjoy the conversation. The officer assess your communication skills and the authenticity of the skills mentioned in CV.", "Interview Questions": "How many years of experience do you have and what are the projects you worked on?\r\n\r\n"}, {"date": "25 Jan 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH (Seattle, WA) in Oct 2021", "Interview Descriptions": "I loved the way the interview was handled, different people scheduled to interview you at different times.  The interviewers were all very professional. The main recruiter kept the communication lines open and was always wiling to answer any questions.", "Interview Questions": "Previous experience in proposal recruitment."}, {"date": "24 Sept 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH", "Interview Descriptions": "The interviews themselves were fairly easy. I think they had another candidate in mind for the position but they needed to interview a certain amount of people in order to \"compete\" the job.\n\nI've been on the other end of those interviews, interviewing people who I knew had no real chance at getting the job. Sometimes that's just how it is. My issue was that they required 4 references beforehand, including 2(!) former supervisors. The references themselves had to go to an online system and fill out a form, PATH couldn't be bothered to do the reference checking themselves. It was fairly dehumanizing to have to go to a former boss and ask them to spent their time filling out information in a goofy third party system on my behalf. I have never been asked to do this before or since in the hundreds of jobs I have applied for in my lifetime.\n\nBased on this experience I will never apply to Path again, and I would encourage Path HR to take a hard look at their recruiting and hiring procedures.", "Interview Questions": "How do you manage priorities?"}, {"date": "22 Sept 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Lengthy interview process, HR phone screen, hiring manager screen then six individual one hour interviews that are a mix of case questions and behavioral questions. They simultaneously run reference checks. The entire process took me 2+ months to get through.", "Interview Questions": "Case study questions as they related to portfolio work and behavioral situation based questions. "}, {"date": "7 Jan 2023", "title": "Senior International Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Washington, DC) in Sept 2021", "Interview Descriptions": "There were three rounds of interviews and it was good. A phone screen and two rounds of technical interviews. The whole recruitment process took about a month. The people I interacted with were pleasant and accommodative.", "Interview Questions": "Why are you interested in joining Path?"}, {"date": "11 May 2022", "title": "Program Associate, Market Dynamics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Nairobi) in Jul 2021", "Interview Descriptions": "Well planned and fair interview.  The interviews were done virtually by teams in various cities across the world and punctuality was observed. The only issue was that feedback on how the interview went was not given and I had to call back after a couple of weeks to do a follow-up on the interview process.", "Interview Questions": "Do I have any research work experience and if so what were the challenges?"}], [{"date": "24 Aug 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (New Delhi) in May 2021", "Interview Descriptions": "They asked simple questions related to job description, my past work experience and how it is related to public health.Since I have work experience in Covid Hospital and the project was related to medical oxygen , so they asked some technical terms also.", "Interview Questions": "What all have you done in your past job?"}, {"date": "20 Apr 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Very convoluted process- particularly for Africa-based positions. 30-min HR screening interview followed by 2 panel interviews with hiring team. Reference checking is done prior to conducting a final interview. If you are successful, background screening with US-based company takes place but you might also be required to submit additional documents (+ documents you provided during the background screening process) depending on country HR requirements.", "Interview Questions": "What is your leadership style?"}, {"date": "15 Apr 2021", "title": "Technical Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Dar es Salaam, Dar es Salaam) in Apr 2021", "Interview Descriptions": "Well structured and interactive interview. I was informed of the interview prior the interview day, which gave me a good time to prepare, I was given details about the  interviewing panel, which helped me address their names when responding to their questions.", "Interview Questions": "1. Tell us about yourself\n2. After reviewing the job descriptions what thoughts came in your mind? \n3. What challenges do you foresee if you take up this role?\n4. What makes a project fail?\n5. What are you doing at the moment? \n6. How soon can you join us?"}, {"date": "25 May 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Seattle, WA) in Mar 2021", "Interview Descriptions": "Interviewed for the program assistant position. It was very conversational and friendly.  The interviewer was kind.  Do some research about the position beforehand and be able to explain your interests.", "Interview Questions": "Why do you want this position?"}, {"date": "9 Sept 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH", "Interview Descriptions": "great and straight to the point. very professional and was interviewed with a panel.  Overall process was great with great people who are very enthusiastic about the mission statement.", "Interview Questions": "how would you deal with a difficult person?"}, {"date": "7 Jul 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Seattle, WA)", "Interview Descriptions": "I applied for a position and had a phone interview with the HR recruiter.  Was awkward, did not feel like it was a conversation but just a list of questions and no responses from the recruiter.  More behavioral based, some more technical questions.   I did not hear back from the recruiter after I emailed to follow-up which I find very unprofessional.  I decided to pass on this job as I am not at all impressed with their ability to interview.", "Interview Questions": "Very robotic typical questions off a list.  At lest 3 were the same question stated in different words: Why do you want to work for PATH?"}, {"date": "1 Aug 2020", "title": "Senior Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at PATH (Seattle, WA) in May 2020", "Interview Descriptions": "Initial 30 min phone interview followed by 1st round 60 min video interview w/ hiring manager and 2nd round loop w/ a series of individual and group interviews  w/ team+. Process was transparent, fair and efficient. Really enjoyed getting to meet so many members of the team (9+ different people). Overall interviews were relaxed and friendly. Balance of technical and behavioral questions. Didn't receive the offer until 2 weeks after the final interview.", "Interview Questions": "Describe prior experience using certain tools / methods (excel modeling, costing analyses, etc). Explain how you would approach a certain strategic problem / question (steps you would take, important stakeholders and communications to consider, etc). "}, {"date": "22 May 2020", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at PATH (Lusaka, Lusaka) in May 2020", "Interview Descriptions": "The staff were friendly,  down to earth and emphasized how amazing being a part of their team is for your career. They also want to know that you have passion and a clear understanding of the work that they do", "Interview Questions": "What are qualities do you feel are most important in a supervisor ?"}, {"date": "9 Mar 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH (Kisumu) in Apr 2020", "Interview Descriptions": "The process was inclusive and progressive. The interviewers were not intimidating but listened to answers provided carefully. I enjoyed the interview process. The reply to my interview took shortest time. The Human Resource department sent back the response very fast.", "Interview Questions": "What are your strengthens that match up with this job?"}, {"date": "26 May 2021", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Seattle, WA) in Apr 2020", "Interview Descriptions": "I interviewed under strict pandemic conditions in April 2020, so my experience may not be typical. I had basically two rounds of interviews, first round with a couple of my superiors, and the second with a number of colleagues and again with the superiors. Everyone was positive and remained mostly supportive, overall it was a very good experience.", "Interview Questions": "There were many questions, but mostly revolved around my experience with managing pharmaceutical projects. "}], [{"date": "28 Feb 2020", "title": "Assistant Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH", "Interview Descriptions": "The entire interview process took probably three weeks, two phone interviews, one with HR and one with hiring manager, then an in person interview with 3 team members. Overall a good process.", "Interview Questions": "How do you prioritize tasks"}, {"date": "2 Jan 2020", "title": "Grants Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH", "Interview Descriptions": "The hiring process was slow, but that was due to the busy end of the year season. Overall, they were very engaging, relaxed, and up front about how long the process would take.", "Interview Questions": "How do you handle conflict or differing opinions at work?"}, {"date": "9 Oct 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Skype chat, role job didn't end up matching job  description. Timing of when position was needed was not clear. Recruiting gave limited information. It was hard to know what they really needed from a candidate.", "Interview Questions": "Interviewer wanted backup for everything "}, {"date": "26 Aug 2019", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "very professional and respectful, mindful of time and trying to limit the amount of hurdles.  All the interviewers I had were punctual, making me at ease and sounded interested and trying to make me feel at ease. Questions felt like asked to really figure if I was the best match, not to corner me, like some recruiters do sometimes.", "Interview Questions": "How does your profile match what we are looking for for this position?"}, {"date": "23 Jun 2021", "title": "Associate Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at PATH (Nairobi) in Aug 2019", "Interview Descriptions": "The interview process was quite engaging but seemed transparent to me. There were different sessions, First the written then the oral sessions. They didn't take too long to send a response after the interviews.", "Interview Questions": "Please tell us about yourself"}, {"date": "30 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH in May 2019", "Interview Descriptions": "Applied online, got email setting up interview, 30 minute Skype interview where I answered questions and also learned more about the position. It was pretty casual and the interviewer was very friendly.  The questions were quite simple so as long as you have answers to basic interview questions, there should no surprises.", "Interview Questions": "Why do you feel you are a good fit with PATH?"}, {"date": "28 Mar 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at PATH", "Interview Descriptions": "1st contact is with a recruiter and pretty typical process. My recruiter was easy to connect with and informative. \r\n\r\n2nd interview is with hiring manager.  Another great, rather informal conversation. \r\n\r\nIn-person interviews to follow. They we’re conducted in a round robin style. 6 interviewers total, 30/45 minutes each.", "Interview Questions": "What’s your experience in a matrix organization? What’s your approach to systems change?"}, {"date": "6 Jun 2019", "title": "Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH (Washington, DC) in Jan 2019", "Interview Descriptions": "I interviewed with the company a few months ago. I was very excited about the possibility of working with PATH. Everything seemed great until I met 2/5 individuals who are on the team. While the there were three people that were very polite to me, there were two others who I found to be incredibly rude and it was so disheartening. I was so excited about this opportunity until I met the two members. During the interview, they didn’t greet me in a nice manner nor did they make me feel comfortable. I could barely do my interview correctly because I was so side tracked by how they were treated me. I didn’t understand why they were so hostile. It is unfortunate as I left there heartbroken. I was quite relieved when I did not get an offer because not only was I not surprised, I realize I would never want to work in an environment with people like that. First impressions mean the most.\n\nOn the plus side, everything the company stands for is great.", "Interview Questions": "How did you find this position?"}, {"date": "14 Apr 2019", "title": "Marketing Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH (Seattle, WA) in Jan 2019", "Interview Descriptions": "PATH asked for 4 REFERENCES BEFORE the FINAL INTERVIEW!   I thought that was super strange since most companies ask for references before a job offer.  My references ended up wasting their time answering questions since I didn't even get a job offer!", "Interview Questions": "Why did you leave your last employer?"}, {"date": "7 Oct 2018", "title": "Project Data Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PATH (Kisumu) in Sept 2018", "Interview Descriptions": "Friendly and good. It took two days in a span two weeks. They take their time carefully to ask questions and listen to answers. The interview is panel based. In the initial stages of the interview they could as behavioural questions", "Interview Questions": "What is quality data"}], [{"date": "25 Sept 2018", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Seattle, WA) in Sept 2018", "Interview Descriptions": "Straight forward, three-step process:  Initial screening with recruiter, video conference interview in the next stage and then an in-person in their office with several potential managers and colleagues.  PATH's HR is very professional, answered all questions and there were no surprises.  The interview process went very smoothly.", "Interview Questions": "\"Describe a situation where you ran into conflict in your previous position and how you overcame it.\""}, {"date": "28 Aug 2018", "title": "Senior Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at PATH (Seattle, WA) in Jun 2018", "Interview Descriptions": "Great process, good communication with HR and talent acquisition team. Hiring team and managers very polite, easy to talk to, eager to hear about you, well-coordinated. Everyone I spoke with at all the stages of the interview was knowledgeable about the organization and knew intimate details about the role they were interviewing you for. Everyone all the way up to Senior Management and CEO knew what they wanted, paid attention to you throughout the interview and were structured in their questions and their response to your inquiries - very professional, accommodating and insightful.\r\n\r\nLeast favorite interaction was dealing with expense reimbursement with admin and finance. Took them more than 3 months to process any type of payment and even to date hasn’t been fully resolved since I haven’t been fully reimbursed for valid business expenses. They say they have a new payment system that they were still learning how it works.....and then came delayed communications and non-responsiveness which got so bad that 3 or 4 follow ups weren’t enough to get a response. I have eventually decided to be zen about it and just consider it a donation to the organization since the transaction cost of getting a response from them is greater than actually being right/owed a response or getting reimbursed. I was very disappointed but maintain that PATH remains a great organization.", "Interview Questions": "Talk to us about the general trends in global health and how you think PATH can be well positioned to capitalize on them."}, {"date": "10 Mar 2018", "title": "PM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "formal process over 2 days to get to know leadership team, as much an interview for me as it was for them. Met with HR on final day. People were very committed to the cause, passionate about their work and wanted to make sure applicant had right skill set and experience.", "Interview Questions": "Reason for applying"}, {"date": "8 Mar 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at PATH (Seattle, WA) in Feb 2018", "Interview Descriptions": "A recruiter will do a screening call, and if they recommend you for the position that will be followed by a hiring manger screening call. If that goes well, you'll be called in for a mini-marathon of interviews (3+ in one sitting) in person.", "Interview Questions": "Why PATH, Why this team, Why the role of Program Assistant?"}, {"date": "23 Oct 2019", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH (Seattle, WA) in Dec 2017", "Interview Descriptions": "I had an initial phone call which was very standard. I was asked quick and short questions about my interest in the role, my background, etc. I was asked in for an in-person interview where I met with my boss and my team lead, and we met for around 45 minutes. Also traditional questions, with a few specific to the industry. I was glad I did research before. I did not know who I would be meeting with ahead of time so I couldn't research their specific backgrounds.", "Interview Questions": "What interests you about PATH when you  have no health/medical background? "}, {"date": "19 Oct 2017", "title": "Project Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Seattle, WA) in Sept 2017", "Interview Descriptions": "After applying it took 1 month to be contacted for an interview. The interview was pretty weird. They had two interviewers both interview me separately. This was unexpected but whatever. The first person I talked to was really nice and I felt a report with. Then the second person was just stone-cold the whole time and asking me essentially the same questions the previous interviewer had asked me. Also the two interviewers also held the Project Officer role so there was not an opportunity to ask my potential supervisor questions. The nice one had been there 1 year, the cold one 3. I got the sense that turnaround was a big issue here.", "Interview Questions": "Why do you want to work at PATH?"}, {"date": "28 Aug 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH", "Interview Descriptions": "Submitted application, the interview process was efficient, relaxed and friendly. I first got an email from a recruiter, then interviewed with an individual on the team I was applying for.", "Interview Questions": "Which of the potential roles we have available in this position would you like to do most? Are there things you are not interested in doing?"}, {"date": "1 May 2018", "title": "Product Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Seattle, WA) in Aug 2017", "Interview Descriptions": "Thirty minute phone interview with human resources representative to learn about the position. Human resources representative informed me that notes would be passed up to someone more directly related to the role. We discussed my background, salary, start dates, and other general details. No technical questions were asked.", "Interview Questions": "General information; clarifying experience and resume points; no technical questions"}, {"date": "4 Aug 2017", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at PATH (Washington, DC) in Jun 2017", "Interview Descriptions": "Contacted via recruiter on LinkedIn. Submitted by CV and got an automated NO from the company. Pinged the recruiter on LinkedIn and she did the screening and then arranged for the interview. The screening with the recruiter was wonderful - really engaging and interesting- the interview was a nightmare.", "Interview Questions": "Why do you want to work for PATH?"}, {"date": "24 Jul 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH (Seattle, WA) in May 2017", "Interview Descriptions": "Interview process took about 1.5 months total, first a phone screening (30 min), then a phone interview with two members of the team (1 hour), and then finally an in-person interview at PATH headquarters (1 hour). Overall the recruiters and staff were very open and welcoming throughout the process. Everyone got back to me in a timely matter.  Questions asked in the very beginning were broad regarding qualifications and interest in the position, but as I got to the last interview, the questions were more situational (\"Tell me about a time when..\")  to help team see if I was a good fit.", "Interview Questions": "Where did you hear about this job?"}], [{"date": "3 Jul 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Seattle, WA) in May 2017", "Interview Descriptions": "Very relaxing conference phone interview. There were two people at the interviewer's end of the phone. I had no tension during the process. It just felt like a chat with familiar people. The interview lasted 30minutes", "Interview Questions": "What do you know about Plasmodium vivax"}, {"date": "25 Apr 2017", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PATH (Seattle Heights, WA) in Apr 2017", "Interview Descriptions": "Two phone interviews followed by a group interview at their officers in Seattle.  Questions were based on the job description. Very nice group of people. I would have taken this job but because of my family circumstances I chose a job that was nearby my family.", "Interview Questions": "Technical questions regarding the job"}, {"date": "21 Apr 2017", "title": "M&E Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PATH (Washington, DC) in Apr 2017", "Interview Descriptions": "Started with a screening call with a recruiter, followed by a couple more screening calls dues to changes in HR. After about 1 month I spoke with the hiring manager, for about 30-40 min. At last I had an on-site interview with the entire core team.", "Interview Questions": "Explain how you developed or supported M&E processes in your previous job"}, {"date": "24 Nov 2017", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Lucknow) in Feb 2017", "Interview Descriptions": "Telephonic as well as face to face. I was given time telephonically for the interveiw. After telephonic screening I was shortlisted and called for face to face interveiw where a panel of three experts were present. I was asked in detail about  my past experinces in last employment and why I chose to apply in this organization. technical and relevant questions were also asked.", "Interview Questions": "About government initiatives for the control of Vector borne diseases, About methods of prevention of VBDs, "}, {"date": "9 Feb 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at PATH (Seattle, WA) in Jan 2017", "Interview Descriptions": "I was referred by a friend for the role. Sue Wallace (senior recruiter) contacted me for the first round of interview and it was a really pleasant call with an genuine effort to get to know me as a candidate and a person. I then had a face-to-face interview with the hiring manager and another interview with the strategy team. The questions were all extremely intelligent digging into the nitty gritties of practical project management experience. Even though challenging, I enjoyed every bit of it. Kudos to Sue to be fully involved both pre and post interview process.", "Interview Questions": "Questions revolved around change management and organization design. \r\nProvide an example of a really important decision that you had to make. Provide details of the decision making process. What are the factors that you take into account while making decisions?\r\n"}, {"date": "6 Jan 2017", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at PATH (Fairfax, VA) in Nov 2016", "Interview Descriptions": "Avoid PATH at all costs! This company wastes your time with 6 (yes, 6!!) interviews. They say they will get back to you, but 3 weeks (!!) go by without a word. Disrespectful and Unprofessional.", "Interview Questions": "I was asked 6 different times \"Why do you want this position\"."}, {"date": "3 Jul 2017", "title": "Corporate Engagement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at PATH (Seattle, WA) in Nov 2016", "Interview Descriptions": "Introduced to internal recruiter and development executive by mutual friends. Recruiter invited me to open house, exec accepted info interview. They helped me better define an ideal role, but there was no such opening at the time.", "Interview Questions": "How do you see contributing to PATH's mission?"}, {"date": "26 Aug 2020", "title": "Contracts and Grants Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PATH (Nairobi) in Jul 2016", "Interview Descriptions": "Well done and professional to say the least. Good management. Fast process too with great ability to negotiate pay. Has great job security coz of the pay and benefits are great.", "Interview Questions": "Tell us about yourself and experiences?"}, {"date": "26 Aug 2016", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH (Seattle, WA) in Jun 2016", "Interview Descriptions": "The interviews included: a phone interview, email correspondence and  an in-person interview. The interview process was very professional and expectations were clearly explained. The whole process was up-beat and productive.", "Interview Questions": "Questions were focused on specific experience in project focus area and ability to speak the language and work effectively in the country where the project is carried out."}, {"date": "4 May 2016", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "I was contacted by HR, who did a phone screening with me. Then I did a group interview with 3 people on the team I'd be working with. They asked 10 questions, all pretty straightforward.", "Interview Questions": "What I would do the document the impact of a program success in a newsletter or web format"}], [{"date": "30 May 2016", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH (Seattle, WA) in May 2016", "Interview Descriptions": "It was very quick. I heard back a couple days after I applied for a phone interview. The recruiter was very helpful and nice. She answered my questions and was upfront about the qualifications about the job.", "Interview Questions": "Basic questions that assessed my background and competency for the job"}, {"date": "21 Jun 2016", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PATH (Seattle, WA) in Apr 2016", "Interview Descriptions": "I had the initial interview with HR. They are all standard interview questions, such as: why path, why this position etc. And they will send an email to let you know their decision very quickly. I think it is nice for the candidate. I don't need to guessing the result for weeks.", "Interview Questions": "Why PATH?"}, {"date": "19 Jan 2016", "title": ", Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at PATH (Washington, DC) in Jan 2016", "Interview Descriptions": "Applied through an online application, and received an email for a phone interview less than one week later, offering several different time slots. The phone interview itself was very brief - less than ten minutes. The interviewers (there were 2) were polite, but very straightforward, and asked questions specific to the position. There were little to no formality questions. Received an offer two days later via email.", "Interview Questions": "How does PATH fit into your long-term career plan?"}, {"date": "3 Feb 2016", "title": "Monitoring and Evaluation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH (Seattle, WA) in Dec 2015", "Interview Descriptions": "Very professional and courteous HR team kept me informed of each step along the way. Began with an initial phone screen and then there were several one on one interviews plus an assessment. They took a long time to reach a decision at the final stage, but other than that the process was very straight forward and transparent.", "Interview Questions": "Of all the duties listed in the job description, name one you think you'll be great at and one you will struggle with"}, {"date": "18 Oct 2015", "title": "Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at PATH", "Interview Descriptions": "Only outsiders seem to be valued at the new PATH. The interview was perfunctory and obviously not serious. Several new hires have doubled up their responsibilities rather than offer leadership opportunities to existing senior staff.", "Interview Questions": "What could I contribute to the new matrix organization"}, {"date": "20 Oct 2015", "title": "Senior Commercialization Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PATH (Washington, DC) in Oct 2015", "Interview Descriptions": "Very well organized and highly professional.  HR was extremely effective in keeping an open line of communication during the entire process, both before and after the interview.  While I was not offered the position, the people I interviewed with were engaged and on time.  One item I would change would be a change of scenery during the day: I remained in the same room the entire day.  While offered the usual bathroom breaks and coffee as needed, for a seven hour interview it would have been nice to leave the small room for a change of scenery or be in a large, more open conference room.  That said, that's a minor qualm to an otherwise smooth day.", "Interview Questions": "There was a moment where one interviewer was asking a question which didn't make any sense: it wasn't really clear what answer he was looking for and I can't for the life of me remember what the question was to this day due to how convoluted it was.  It was related to work philosophy, which I thought I was answering, but apparently was not to his satisfaction.  This went on three times and go to the point where I had to apologize that I just really didn't understand what he was really asking.  The subject got changed to other items, and ironically, I wound up answering the question later on indirectly (which he had pointed out to me).  "}, {"date": "15 Sept 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at PATH (Seattle, WA)", "Interview Descriptions": "The HR recruiter was very knowledgable and my impression of the organization, based on the interview, matched my experiences after starting work. Great questions, quick follow up, friendly and professional. Good overall experience.", "Interview Questions": "Why are you interested in working with the organization?"}, {"date": "9 Sept 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH (Seattle, WA) in Sept 2015", "Interview Descriptions": "It was a straight forward process. The recruiter was up front about salary and wanted to discuss requirements in the first conversation. Questions were typical for the job description and the recruiter and hiring team were very open about what they were looking for in a qualified candidate.", "Interview Questions": "Tell me about a time when you disagreed with a colleague and how you overcame that challenge."}, {"date": "14 Dec 2015", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at PATH (Seattle, WA) in Sept 2015", "Interview Descriptions": "The screening process took longer than other organizations (due to vacations), so I was quite a ways into the process with other employers when PATH got back to me.  When I explained that I had other opportunities, the HR representative was very understanding and worked hard to move the process along as it was a good fit in both directions.  It was hard to schedule interviews as interviewers were traveling and had vacations.\r\nI had a phone screening interview with the Recruiter and came in a total of 3 times for in person interviews (due to scheduling this was easier and I was local so this expedited the process).  I was extended an offer immediately after my last in person interview.", "Interview Questions": "Do you have Project Management tools that you would bring to PATH?"}, {"date": "5 Nov 2015", "title": "Commercialization Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at PATH (Seattle, WA) in Sept 2015", "Interview Descriptions": "The process was fast in the beginning (HR phone calls), then after my site visit, I did not hear back from them for a few weeks. When I finally sent a follow up email, they just sent me a standard rejection email. Other than that, the HR team was professional but the interviewers in Seattle were not.\r\n \r\nLogistics-wise, they asked me to park my car in the building garage but they would not validate parking so I had to pay $25 for a 4-5 hour interview. I could have parked elsewhere for cheaper. My interview went over lunch time, and they did not offer to provide lunch or join me (the 30 minute lunch period was reduced to 20 mins because the interview went over). They just sent me away to get food and asked me to come back later, which I thought was very rude. It gave a negative impression of how they treat their employees.\r\n\r\nThe people who interviewed me were mostly new to the organization themselves (less than 2 years). I don't think they had much experience interviewing people and yet I was being evaluated by them. Some interviewers had never worked in for-profit organizations and seem to dislike private companies. As non-profit, they still need to interact with for-profit companies. I wonder how that goes?\r\n\r\nI thought overall the site interview process was long and unwelcoming. I was asked several times, why I wanted to work for PATH, because with my resume, I could have gone to a private company and made more money. The last guy who interviewed me was bragging about how many professional degrees that he has, and no other in the organization has his credentials. Overall, they gave me negative vibe about the company despite the company's actual mission.", "Interview Questions": "How did you describe your job to your mother?"}], [{"date": "22 Oct 2015", "title": "Shop Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at PATH (Seattle, WA) in Aug 2015", "Interview Descriptions": "They interview was easy as if they don't always hire people. They seemed to have no questions to ask me at first. Sat down and told me the story about what the company has been doing. Asked me 'tell me about yourself' type of questions then see if there's anyone else who wanted to talk to me. Asked a question about solving a problem they have faced, and that's it. Promised to get back in a week, but never heard anything back even followed up.", "Interview Questions": "Tell me about yourself"}, {"date": "12 Jul 2015", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at PATH", "Interview Descriptions": "The entire process took three week. I applied online. After 1 week got  email asking for phone interview. Then had skype interview. All the questions were behavioral. Then had onsite interview.", "Interview Questions": "How do you keep yourself organized"}, {"date": "7 Aug 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Seattle, WA) in Jul 2015", "Interview Descriptions": "The phone screen was about 45 minutes. The recruiter started by talking about Salary requirements which I thought was inappropriate. After that It was a pretty standard phone screen. She described the hiring process and asked pretty standard interview questions about my background and experience.", "Interview Questions": "Why are you interested in this role?"}, {"date": "20 Sept 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Washington, DC) in Jul 2015", "Interview Descriptions": "- Submitted application online \r\n- Had phone interview with a fantastic HR representative who was very kind and encouraging. Gave me tips for my in-person interview (wasn't guaranteed at that point, but she seemed confident I would get one) and told me skills/experiences I should emphasize\r\n- Had in-person interview--two panel interviews with 3 panel members each.", "Interview Questions": "- How are you with budgets?\r\n- How is your writing?\r\n- Do you have experience with scheduling/travel arrangements/dealing with different time zones?\r\n- How do we know you will stick around? (Staff turnover is a common issue)\r\n- How willing are you to learn new things?"}, {"date": "6 Sept 2018", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Seattle, WA) in Jul 2015", "Interview Descriptions": "Initial phone interview with HR, then a follow-up with the hiring manager.  After that, an in-person series of interview on-site at the company.  In-person interviews lasted for several hours, ranging from 1-on-1 sessions to panel sessions depending on who this job might interact with on a regular basis.", "Interview Questions": "Why do you want to work in this particular industry?  What draws you to humanitarian work?"}, {"date": "3 Aug 2015", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at PATH (Washington, DC) in Jun 2015", "Interview Descriptions": "Excellent process from top to bottom--one of the reasons I took the position offered was the treatment/professionalism of the HR staff (especially compared to other public health organizations). \r\n\r\nAfter applying online in mid-May 2015, I passed an initial email screen and then was contacted by a recruiter. Next came a phone screen/interview, at the end of which I was asked to fly out to DC the following week for an in-person interview. PATH graciously paid for all expenses (airfare, meals, etc.) and had a very responsive HR person assigned to answer any questions/needs that arose.\r\n\r\nThe group interview in DC took around 2 hours; everyone was friendly, accommodating, and professional. Afterwards I was told that if I was selected to be a finalist I would be informed within a week about a final telephone interview with the Seattle office. Instead I was told within 2 days and a phone call was arranged.\r\n\r\nThird interview was relatively short, only about 45 minutes. Again I was told it would be approximately a week before I would hear; four days later I was contacted and an offer was made.", "Interview Questions": "Why are you interested in this field?\r\nWhat has been your experience working with the UN system?\r\nHow do you balance working with partners/staff based in different countries and time zones?"}, {"date": "8 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at PATH (Seattle, WA) in May 2015", "Interview Descriptions": "The interview process lacked coordination between different members of the teams, and the interviewers were not upfront about explaining their role or process. \r\nI went through 3 interviews for the position - talk about extensive for an internship! All the interviews took place within a span of 1 week. \r\n1. 2 program associated interviewed me. They asked general questions, and tried to give the impression that the process was very competitive and they were talking to a number of candidates.\r\n2. I was contacted by a person for an interview - as it later turned out after clarification that the person contacting me was the executive assistant to schedule an interview with the director. The Director's Skype Video didn't work but wanted me to turn on mine. This interview was better in terms of understanding the work and expectations. As it turns out, the Director mentioned that they were only interviewing me and one more candidate (contrary to interview 1). \r\n3. Again I was interviewed by the same program associates from interview 1. Why? I'm not sure.\r\n\r\nI offered to come in for the interviews, but that was just ignored and no one responded to it. All my interviews were on Skype.", "Interview Questions": "How would you find out a country's health burden?"}, {"date": "8 Apr 2015", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH", "Interview Descriptions": "Initial phone interview with senior recruiter within a week went well. Second phone interview with a team of 4 from the program went fairly well. Being a new role and the first to be interviewed, some questions where a little vague and I probably didn't answer them as expected. I was asked to send a writing sample and ask any questions via email. Sadly, no one got back to me with answers to my questions or to acknowledge receipt of the writing sample. I  thought that was not very professional on the team leaders part.", "Interview Questions": "Why I am interested in working with PATH?"}, {"date": "25 Jul 2017", "title": "Advocacy Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PATH (Lusaka, Lusaka) in Apr 2015", "Interview Descriptions": "It was very good and I was interviewed on phone by someone from America. The time it took for them to contact me and the interview was commendable as they did not take a long time. Their communication was also very good during the whole process.", "Interview Questions": "They asked me about the work experience that I had and how it was relevant to the position that had been advertised. They also asked about my educational background. "}, {"date": "23 Jul 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Seattle, WA) in Mar 2015", "Interview Descriptions": "I interviewed for 2 different internships with PATH and they were very different. For one, I had a phone call with 2 employees, a Skype call with a director, and then another phone call with the first 2 employees I spoke with resulting in no offer. The other interview was a phone call with the director of a department directly and received an offer.", "Interview Questions": "How do you handle when partners on a project have different visions or conflicting ideas?"}], [{"date": "22 May 2016", "title": "Major Gift Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PATH in Mar 2015", "Interview Descriptions": "HR representative reached out to schedule a phone interview, phone interview took about 40-50 min,  the recruiter then sent out the benefits information, and then 2 weeks later came back with a decision.", "Interview Questions": "Why are you interested in PATH?\r\nWhat project management experience do you have?"}, {"date": "3 Feb 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH", "Interview Descriptions": "Applied online and about two weeks later was called for an interview with the HR person. The interview process was pleasant and the recruiter tried her best to work with you. The only alarming aspect of the interview was when the recruiter mentioned that very few applicants are selected for this entry-level job without a master's degree. The interview process lasted about an hour and revolved mostly around my previous experiences.", "Interview Questions": "All questions were interview expected questions"}, {"date": "27 Oct 2014", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH", "Interview Descriptions": "Applied online and about two weeks later I received an email from the HR department asking to set up a phone interview with one of their global recruiters. The phone interview lasted 1/2 hour and revolved mostly around my previous experiences and why I wished to work for PATH.", "Interview Questions": "The question that messed me up the most was simple, but the phrasing was confusing. She asked for an example of a time I've shown leadership. I answered in the way I believed applicable (people), but she clarified she was looking more for an answer that dealt with outputs (projects)."}, {"date": "6 Oct 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Washington, DC) in Aug 2014", "Interview Descriptions": "Smooth albeit somewhat disorganized. The recruiter checked my references and sent the wrong candidate information to my reference. Needless to say, my reference asked me 100 times if I was sure I wanted to work for a company that couldn't even get my name right when interviewing.", "Interview Questions": "How do you deal with bombastic personalities?"}, {"date": "22 Sept 2014", "title": "Manager IT, Field Service Delivery Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Nairobi) in Aug 2014", "Interview Descriptions": "I applied online. They contacted me two weeks later via email. The first round of interviews was with the Internal regional HR recruiter via phone. First there were the general questions/walk-through) my CV then the technical questions. More along the lines of \" what is_ and how does it apply to ITSM. The second round of interview was a conference call with  the line manager in Seattle and another  supervisor. Most of the questions were about service delivery using ITIL and  ITSM principles.", "Interview Questions": "How would you ensure that the regional team leaders reporting  to you are achieving their targets  without micro-managing them?"}, {"date": "18 Jun 2014", "title": "Advocacy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PATH", "Interview Descriptions": "I had a phone interview with HR and then one in person interview.  The in person interview consists of two different groups of people, one followed by the other.  Usually two members of the team you will work on (they rate how well you get along with the team highly).", "Interview Questions": "the last book i read"}, {"date": "30 Apr 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PATH in May 2014", "Interview Descriptions": "A 30 minute phone call one time. It was friendly and fairly easy. They mostly asked about a few relevant past experiences and how I think I fit into the role. Also my interest in the organization. Not much time for me to ask questions though I asked in follow up emails.", "Interview Questions": "What interested you in this position and how do your past experiences fit with it?"}, {"date": "26 Jan 2018", "title": "Corporate Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at PATH (Seattle, WA) in Apr 2014", "Interview Descriptions": "Went through a 6 month interview process meeting with 7+ individuals, a flurry of interviews followed by long silences and a series of miscues between recruiting, hiring department and corporate planning. The process began with a 1.5 hr phone interview with an internal recruiter, a series of peer meetings, and two upper management interiews in both group and individual sessions. After 3 rounds of interviews, they decided to eliminate the position. The in-person interviews were engaging and appeared to constructive fo the candidate and the hiring team, but then there was no feedback or dialogue for several months until the next round of interviews. And the second and third round of interviewers did not appear to have knowledge of any previous conversations.", "Interview Questions": "The interviews were detailed and content heavy. It focused more on specific work products in contrast to how I work. "}, {"date": "26 Mar 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH (Washington, DC)", "Interview Descriptions": "Was contacted by HR manager shortly after I applied for a phone interview. The manager got back to me pretty quickly about setting up a first round of interviews with person who would be my performance leader. The second round happened with the department director.", "Interview Questions": "How well I work with a group of people with bombastic personalities."}, {"date": "9 Sept 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at PATH (Washington, DC) in Feb 2014", "Interview Descriptions": "Brief interviews, basic questions, good description of the position and the interviewer was prepared and professional.  Given a tour and realistic description of what the position would be. I was very prepared to ask questions, but ran out of time.", "Interview Questions": "Tell us about yourself"}], [{"date": "29 Oct 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at PATH (Seattle, WA) in Jan 2014", "Interview Descriptions": "Gauntlet of 30 minute interviews with various staff in unclear positions of decision making or supervision. Questions indicated lack of cultural cohesion and high expectations that this new position will magically connect all the disconnected dysfunctional parts of the organization.", "Interview Questions": "What is your ideal job"}, {"date": "2 Oct 2013", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at PATH (Seattle, WA) in Sept 2013", "Interview Descriptions": "I applied for the position via the company website, but the process was clunky and indicated errors so I wasn't sure that my application was received. I decided to double my chances by forwarding my resume and cover letter to the company's career email address. Coincidentally, I received a broadcast message via LinkedIn from a PATH representative in HR, providing a brief description of the position and encouraging me to apply. I responded that I had already applied through the company's website and via email to the careers email address, with no confirmation of receipt. The HR representative found no record of my application, and asked me to forward my documents to her, which I did. Immediately thereafter, the next day I believe, we spoke by telephone, and the next day again, we arranged my in-person meetings with the team - a paralegal, the hiring attorney, and the HR representative. Because these things transpired quickly, I had guessed that the team was eager to fill the position; and in spite of the initial website issues and lack of response to mail I'd sent to the careers email address, I was impressed with their efficiency and decisiveness. In light of my active search and interviews for new employment, the HR representative requested that I stay in contact about the status of my search, generally, and specifically about this position. It has been almost three weeks since my in-person meetings with the team.", "Interview Questions": "There were no difficult or unexpected questions. The meetings were conversational and comfortable. (Incidentally, I did bring several questions of my own which each member of the team were happy to answer.)"}, {"date": "8 Nov 2013", "title": "Clinical Research/Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at PATH (San Francisco, CA) in Sept 2013", "Interview Descriptions": "I recently went through the interview process at PATH.  The initial phone interview with the Senior Global Recruiter was pleasant and informative.  The discussion was helpful for me to see what PATH was looking for and whether it would be a good fit.  After several weeks, I was contacted for a phone interview with a Program Officer, Program Manager, Medical Director, and Global Director.  The calls were conversational with questions specific to skills related to clinical trials.  I learned more about the job functions and some potential projects I might be working on.  I was invited for an in-person interview several weeks later where I talked to other team members.  The Senior Global Recruiter also flew in to meet and talk in person.  A competitive offer was made a week later.  I was very impressed with the process from start to finish and can see why PATH is a highly regarded global organization.  It became clear through the interview process the level of talents, collaboration, and professionalism at PATH.", "Interview Questions": "Questions on specific skills relating to job function."}, {"date": "10 Aug 2013", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH (Seattle, WA)", "Interview Descriptions": "Three round interview process. First was through an HR recruiter. Second round was with four different individuals within the team, one of which I would replace. Third round was with the project director.", "Interview Questions": "What do you find the most difficult when working in a global environment? "}, {"date": "18 Aug 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at PATH (Seattle, WA) in Jul 2013", "Interview Descriptions": "First step was a phone interview with HR - basic questions relating to your skills and why you want to work at PATH. Second step was a in-person interview with the program administrators which lasted about 45 minutes. More specific questions about your skills and how it could relate to the work at PATH. Then met with the two other program assistants from the team. This was more of a personality check to see if you would fit well on the team.", "Interview Questions": "Have you had to \"manage up\" before and if so describe. "}, {"date": "7 May 2013", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PATH (Johannesburg) in May 2013", "Interview Descriptions": "interview was over the phone was asked about myself", "Interview Questions": "Why do you want to join path"}, {"date": "22 Jan 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PATH in May 2013", "Interview Descriptions": "There were four interviews: HR, program coordinator, the entire team, director and program coordinator. Questions were fairly straightforward; there seemed to be a greater emphasis on the right fit with the rest of the team.", "Interview Questions": "Many scenario questions."}, {"date": "2 Oct 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PATH (Seattle, WA) in Apr 2013", "Interview Descriptions": "Recruiter was friendly, professional and a pleasure to work with. I first had a phone interview with the recruiter and then a panel interview with several people in the department.", "Interview Questions": "Questions related to administrative experience"}, {"date": "4 Mar 2016", "title": "Grants and Contracts Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 5 months. I interviewed at PATH (Seattle, WA) in Nov 2012", "Interview Descriptions": "It was about 5 months long. Had 6 interview sessions. Entire process was waiting on a Director who was constantly traveling globally. We started with phone screening, one month passed before I had 2 in person interviews. Another  month passed before I had another interview and a panel interview.", "Interview Questions": "Did I manage staff placed in organization's field offices globally?"}, {"date": "23 Jul 2012", "title": "Programme Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (New Delhi)", "Interview Descriptions": "Online application filed and then after shortlisting there were two rounds of telephonic interview and each interview was used to further shortlist candidates. Then there was a written exam and a final interview with the HR Manager and the manager to which the position reported and with the country director.", "Interview Questions": "Why do you want to join NGO sector and how could you contribute towards achieving the goals of the organization?"}], [{"date": "25 Jul 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at PATH in Apr 2012", "Interview Descriptions": "I had to meet with several people, take a filing and typing test (they don't do that anymore) and then come in for a final interview.  I conducted a lot of interviews over the years for PATH, and there is a lot of ambiguity between the job descriptions and the actual position.  Sometimes they know they need someone and have no idea what they will actually have them do.  Ask for clarity if you are the type of person who needs clear job descriptions and responsibilities.", "Interview Questions": "How does this fit in your 5 year plan?  Why do you want to work at PATH?  How do you deal with ambiguity?"}, {"date": "15 Jan 2016", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PATH (Washington, DC) in Jan 2012", "Interview Descriptions": "Phone screening by HR; then first and second round of interviews; thought I was on the right track but in second round, hiring manager seemed tired and uninterested; felt like I was just a cursory interview -- i.e., like they'd already picked a candidate but still had to go through the motions w/ me; i would have appreciated it if they hadn't wasted my time", "Interview Questions": "Why do you want this job"}, {"date": "20 Jan 2011", "title": "Technology Solutions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Seattle, WA) in Oct 2010", "Interview Descriptions": "Had 2 interviews, one with PATH recruiter and then she referred me to the hiring manager.Recruiter interview lasted 45min. Salary expectation was requested in first call, since as a non-profit they offer a bit below the industry average and as the recruiter told me \"learning the salary range for the position usually stops people who are not very interested\". \r\n\r\nSecond interview with hiring manager was ok, I got the impression that things were very political and chaotic at PATH. Interview was not very structured, I asked more questions about the position than they asked me. No offer was made of course, but a thank you but no thank you email would have been nice either from the hiring manager or the recruiter. No word whatsoever from either one!  Sorry, but that experience and everything I learned about the organization made me think twice about applying there again. Too bad...", "Interview Questions": "What was your last salary?"}, {"date": "16 May 2012", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at PATH (Seattle, WA) in Jun 2010", "Interview Descriptions": "PATH gets a TON of applications, and I was lucky to have been chosen for an en entry-level communications position. It was more similar to an administrative position, and didn't really play up to my prior skills as an ED for a non-profit, as well as a Program Director for another non-profit. \r\n\r\nI had a panel interview, with really basic questions. After that interview I was asked to interview with the director I was going to be assisting, and that was a brief 1 on 1. \r\n\r\nI was told that the job was very administrative and wouldn't play to my prior director level experience well. In all honesty, I'm happy they told me that and that I didn't move forward, because I think I wouldn't have been too happy in that position.", "Interview Questions": "What do you like about PATH"}, {"date": "25 Jan 2012", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at PATH in Mar 2010", "Interview Descriptions": "Phone interview, and then a tour of the lab facilities. Manager of the lab asked how I'd improve on the test setups that they had available. I asked a lot of questions, which is why I think I got it (my background wasn't really a closely matching fit for the position) -- overall, work culture seems great; employees get travel opportunities, and everyone I met seemed to really enjoy working there (and had strong enthusiasm for the company's mission/impact as well).", "Interview Questions": "How would you improve on this test setup? What questions would you have in order to ascertain its efficacy?"}, {"date": "29 Jun 2010", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PATH (Seattle, WA) in Oct 2009", "Interview Descriptions": "Received a phone interview from the HR recruiter shortly after posting my resume to the site.  Discussed my background and was told I was a good candidate.  Three weeks later I was invited to a day of 1:1 interviews with the Directors and VP, all of whom were under the impression I was going to be working for them aboutt 75% of the time.  In my followup call with the recruiter, I noted the perception that I was going to be working for many different bosses.  I asked who I would be reporting to and this threw the recruiter for a loop.  They ended up not hiring for the position when they couldn't decide on a supervisor and job design.", "Interview Questions": "What experience do you have in vaccine development?"}, {"date": "26 Jul 2013", "title": "Procurement and Logistics Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at PATH (Wilbur By Sea, FL) in Oct 2009", "Interview Descriptions": "I had all the tool that they were looking for working with shipping companies", "Interview Questions": "I had what they were looking for dealing with shipping with all this companies and sending items across the world"}, {"date": "18 Oct 2012", "title": "Senior Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PATH (Seattle, WA) in Jan 2008", "Interview Descriptions": "Hiring and interview process went fast and it was smooth. My recruiter was fantastic. she advocated for both (PATH and me) and made sure everything was on time. Interview was a day long and with 8 different people.", "Interview Questions": "No difficult questions. General standard questions were asked. No surprises. \r\nBe sure to say you love Global Health."}]]