[[{"date": "11 Feb 2022", "title": "Security Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Womans University", "Interview Descriptions": "It starts with an initial HR interview that goes over basic HR phone screening. After I was panel interviewed by various members of the IT Solutions team who round-robin interview questions.", "Interview Questions": "Describe the TLS handshake process?"}, {"date": "23 Feb 2022", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Texas Womans University (Denton, TX) in May 2021", "Interview Descriptions": "The process was simple. Met with the professors of whom you would like to work with and they told you a bit about their research. They then asked about your passion for it, and offered you a position.", "Interview Questions": "Why are you interested in this field?"}, {"date": "21 Jan 2020", "title": "Contract Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Womans University (Dallas, TX) in Aug 2019", "Interview Descriptions": "The interview process was very informal, but brilliantly designed. My supervisor introduced herself and another member of CAPS and gave me a tour of the T. Boone Pickens campus, introducing me to other staff members along the way. I got the sense she was watching my interpersonal style as I introduced myself to other staff and made use of the brief amount of time we had together. At the end, the three of us sat together and we had an informal conversation. It was a very human and authentic encounter.", "Interview Questions": "There weren't really any that I can remember, other than, \"tell us about yourself\" and \"what do you feel like knowing about us\"... and perhaps \"what do you want to us to know about you?\""}, {"date": "7 Mar 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Texas Womans University (Denton, TX) in Aug 2018", "Interview Descriptions": "My interview was fairly informal. I was asked if I had any experience working with certain equipment and the like and I simply corroborated what I said from my resume. It was more of a tour of the work environment and a description of the kind of work I would be doing rather than a series of interview questions. However, the process was still useful to the interviewer because she was examining my professionalism, conduct, and demeanor.", "Interview Questions": "N/A"}, {"date": "5 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas Womans University (Denton, TX)", "Interview Descriptions": "The interviews that I went to (about 3) were pretty casual. I applied online and met with the supervisors that I would be working under. I received 2 of 3 offers.", "Interview Questions": "Why I applied for those positions, what interested me about the positions"}, {"date": "7 May 2017", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas Womans University (Denton, TX) in Mar 2017", "Interview Descriptions": "They were very structured and organized, but also open and flexible.  Very welcoming and upbeat team.  Everyone seems to enjoy eachother as well as the work they do.", "Interview Questions": "Tell us about a time you complied with a policy, even though you did not agree with it."}, {"date": "11 Nov 2017", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Texas Womans University (Denton, TX) in Aug 2016", "Interview Descriptions": "No formal interview. I just contacted the professor seeing whether there is a position for the research assistant. Then the professor just introduced his new project which offered the research assistant position.", "Interview Questions": "What is my experience using the certain types of equipment"}, {"date": "10 Apr 2016", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Womans University (Denton, TX)", "Interview Descriptions": "Takes awhile to get interview but be patient because it's worth it if you get hired.  Being a State of TX employee is sought after position.  People get these jobs and seldom leave.", "Interview Questions": "Basic questions"}, {"date": "20 Apr 2017", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Texas Womans University in May 2015", "Interview Descriptions": "The first interview was over the phone and fairly basic: four committee members went around and asked me questions regarding my experience, my qualifications, and my approach(es) to resource management. \r\n\r\nThe secondary interview was in person with the same committee, and they asked a few scenario-specific questions in addition to recasting some of the same initial ones.", "Interview Questions": "What are your strengths?\r\nWhat is your weakness?\r\nHow do you manage stress?\r\nAre you a quick learner? \r\n"}, {"date": "20 Jan 2015", "title": "Technical Support Analyst II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Texas Womans University", "Interview Descriptions": "The interview process took a long time to respond. I was interviewed in front of a board of 5 people and was asked to present a power point to review my work history and qualifications. Over all it was an okay experience but it was very stressful, the people that I work with here are all very helpful and overall this is a good place to work but you will not get rich.", "Interview Questions": "How do you prioritize your work?"}], [{"date": "27 Mar 2015", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Womans University (Denton, TX) in Jan 2015", "Interview Descriptions": "Skype interview.  It was supposed to be a team interview but only one person was available.  I did not receive the email telling me where to be in enough time to have everything working and there were technical issues.  The interviewer was not understanding and the rest of the interview felt strained.  Having expected two interviewers I felt there was no", "Interview Questions": "Canned questions, the typical questions that you hate to hear."}, {"date": "15 Dec 2014", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Womans University", "Interview Descriptions": "The interview process is 2 steps with the first requiring a phone interview then the second is an in-person interview with the hiring committee and sometimes the department you'll be working with.", "Interview Questions": "Most Difficult: What are your weaknesses"}, {"date": "17 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Texas Womans University (Denton, TX) in Aug 2014", "Interview Descriptions": "The interview process was very relaxed. I found the job posting on the University's website ad applied. I was contacted withing a few days via phone to schedule an interview. My employer and I  scheduled an interview in between two of my classes and we briefly discussed my previous work experience and my ability to work alongside other college students.", "Interview Questions": "Why do you think you would be a great candidate for this position?"}, {"date": "30 Sept 2015", "title": "CISO Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Texas Womans University (Denton, TX) in Jun 2014", "Interview Descriptions": "3 parts - 1) phone, 2) Skype 3) in person - with small panel, then huge open-ended presentation of your choice for college-wide attendees and satellite campuses.  Each stage included multiple people on the university side.  The Skype interview was interesting in that I did feel as if I was sitting at the end of a long table looking at the entire panel.  In step 3, there was individual time spent with the CTO, then meetings with 2 peer directors, before being led to a room where I presented twice for 45 minutes each.  After the presentation, one of the directors took me on a 2 hour tour of the campus so I could visualize the facilities and speak to people in person that would report to the position.  \r\n\r\nWhile the 8th floor of the tower is the location of the Technology Dept leaders offices including CISO, CTO, and Directors, the mood was very sterile, dry, too quiet.  Only about 30-40 minutes was built-into the day to spend with the CTO. This was concerning since the CISO role would report directly to the CTO.", "Interview Questions": "Task was to create a presentation (no topic given) that would last 45 minutes.  Plan to give it twice back to back.  Audience could be anyone from the University, but mainly staff.  This included being broadcast live to satellite campus."}]]