[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Recommended", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Feb 2023", "job_title": "Enrollment Officer in Baghdad", "duration": "N/A", "pros": "Place to grow. Respectful environment. Decent salary", "cons": "working on weekends and holidays"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Do Not be Fooled", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jul 2023", "job_title": "Full Time Faculty in Baghdad", "duration": "N/A", "pros": "The campus of AUIB boasts beautiful greenery, flowers, and trees that provide a peaceful atmosphere, away from the hustle and bustle of city life. The university provides free bicycles and buses, allowing staff to take full advantage of these tranquil surroundings. Another unique aspect of AUIB is its architectural legacy. The campus includes repurposed palaces from the era of the Ba'ath party, which have now been transformed into educational spaces. The exterior architecture of these former political palaces is visually striking. The aim to uplift the educational standard in the country is indeed a laudable mission undertaken by the owning family. The intention to provide an international standard of education in Iraq is an admirable objective, which brings hope for the future of the nation's youth. The campus has serene lakes and an abundance of birdlife, providing a serene environment conducive to reflection and creativity. The harmony of nature amidst the educational structures makes for a unique blend of tranquillity and scholarly pursuit. The institution's reputation and practices are rooted more locally, diverging from those typically associated with American academic institutions.", "cons": "Unfair sudden decrease happened in all salaries. The announcement of a 20% salary reduction due to new taxes was not only poorly timed but also unjust. Unlike many international organisations, AUIB passed the tax burden onto its employees, directly affecting their income. The lack of prior notice left many employees stranded, unable to make timely decisions about their employment status.  At AUIB, rumours and gossips often serve as the primary mode of communication rather than direct, professional exchanges. It is disheartening to discover changes concerning one's employment status from hearsay rather than an official communication. This lack of transparency is bad planning."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Jul 2023", "job_title": "Director in Baghdad", "duration": "N/A", "pros": "Lovely location greenery lakes beautiful scenery", "cons": "Not good staff relationships between academic side and site management"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "AUIB creating a new future for education in Iraq", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Jan 2023", "job_title": "Director in Baghdad", "duration": "N/A", "pros": "AUIB's vision is to transform education in Iraq, This needs a dedicated and experienced team. The Founder and President are always supportive to any project that will realize the vision. What makes AUIB a wonderful place to work at is the that 99% of faculty and staff are committed to AUIB's vision, they are team players, and work with dedication. The students are the bright young minds of Iraq. Many times I hear - our students are fantastic from faculty and ELA instructors. As employee: no stone is left untouched to make life easy and enjoyable. The safety of expats are given priority, always in armored vehicles and with wonderful security team. Traveling out of the country, the security team take care of you until you are booked in. Everyone get VIP treatment. Health insurance: fully staffed clinic on campus, insurance for outside and inside Iraq, in times when emergencies happened, the bill was paid by the Founding Family. Every employee is treated as a family member. Housing: top of the range, modern housing. All utilities are paid for by AUIB. Maintenance issues are taken care of within hours of reporting. Furnishings and finishings are high end, no costs were spared. Gym: excellent, fully equipped gym with table tennis, darts, billiard tables, etc. Airconned, free water supply, free membership. Food court: variety of food outlets, traditional Iraq food, fast foods. Grocery store: stocks everything you need from international and national brands. Fresh vegetables and good cuts of meat. Health foods, organic, vegan supplies as well. If you need anything, the staff will gladly order and deliver to you. AUIB club: luxurious setting with swimming pool, excellent food, you get discounts of up to 45%, theme nights, quiz nights. This is where everyone meets after a long day. Management: as a start up, changing educational landscape, merging American Style educational style with Iraqi education is not easy. There are many challenges from legislative to logistics, merging enrollment methods, aligning curriculums, hiring according to prescribed registration rules in Iraq, etc. The management team has to be light on their feet to address external as well as internal issues. The team therefor has to be well educated, global experience, team players and team builders. Not everyone that was hired could adapt to these challenges. Add covid and world recession and only the best will survive. The President is the Founding President, the Founder and his family is the sole supporter of the project - they have what it takes not only to make it work but to make it success. The business structure: policies and SOPs are in place, the Iraqi labour is followed to the T. Several approval steps have all checks and balances in place. Personal development is encouraged, many events are held on campus for participation. Further studies are encouraged, supported and approved. The success of AUIB is possible because the Founder and President has a balanced working relationship, they compliment each other professionally. To have a good sense of humor is very important. The President keeps the team in a light heart, the is excellent for creating a good work environment. You always leave a meeting at the President's office with a smile on your face.", "cons": "There are always a small group of people that could not make it at AUIB. These are the ones that did not have what it takes to operate in a fast changing, high pressured environment. Your work place is your choice: not a good fit, find a good fit."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Opportunity to touch lives!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Jan 2023", "job_title": "Assistant Professor of History in Baghdad", "duration": "N/A", "pros": "Great People, Beautiful campus! Great experience!", "cons": "As a new institution there are still times of confusion and duplicaiton"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing venture to work in", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jan 2023", "job_title": "Anonymous Employee in Baghdad", "duration": "N/A", "pros": "Exceptional environment, AUIB will get Iraq back to its golden age. Very promising for the Iraqi students, who will definitely be the greatest leaders in the future.", "cons": "Everything is great so far"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "New university....great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Jan 2023", "job_title": "Chief Executive Officer (CEO) in Baghdad", "duration": "N/A", "pros": "New and challenging environment. The chance to really make a difference.", "cons": "Any new university will have growing pains at times."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Feedback for quality of Service", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Dec 2022", "job_title": "HR Director in Baghdad", "duration": "N/A", "pros": "Due to my current work in the American University of Iraq Baghdad I have seen that it is one of the best innovative university in iraq which is focusing about Extracurricular activities. Research facilities. Financial aid. Campus size. Campus location.", "cons": "I donot see any negative sign."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "A Disingenuous, treacherous place with many instances of nepotism and deceit", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Jul 2021", "job_title": "ESL Instructor in Baghdad", "duration": "N/A", "pros": "Beautiful campus, great security who were polite and friendly, as well as the  head of security, very nice garden and construction workers, very skilled colleagues who were quite helpful, a couple of great IT staff that were helpful, and of course, the students!!", "cons": "Rude colleagues, disorganized upper management that confused you, rude President, no medical facilities, disaffected sponsor who seems to be out of touch, as after a colleague supposedly died on campus, suggested they take staff to a museum to get their mind off of \"negative\" thoughts. It was an incredulous and unbelievable atmosphere. I would not advise anyone who wants to keep some morals and positivity in their life to go to work there. I am glad for the experience as it was nice to see Iraq, and meet a few people at the shopping mall, but the University does not seem safe, in many ways. Enter at your own risk!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work in!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Jan 2022", "job_title": "Anonymous Employee in Baghdad", "duration": "N/A", "pros": "- Friendly Environment \n-Supports Iraq's young students 100%\n- one of the best Universities in the middle east", "cons": "Nothing bad to say! really good place"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Friendly environment.  Great place overall.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Jan 2022", "job_title": "Administrator in Baghdad", "duration": "N/A", "pros": "A new university with outstanding facilities. Very attractive campus. Helpful people. Good academic programs.", "cons": "I really can't think of any!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great people and a great opportunity.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Aug 2021", "job_title": "Assistant Professor of History in Baghdad", "duration": "N/A", "pros": "This reported income is free of Income taxes so it has the buying power of over 100K. A fabulous new apartment is included with all utilities that would be likely be $2500 a month if one rented it in the New York area. Contrary to popular opinion it is very safe here, Security is like having the secret service protect you. (and a thousand soldiers)", "cons": "The medical benefits are next to nothing here. They currently have a middle-eastern insurance company that pays for nothing stateside."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Do Not Work Here!", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Dec 2021", "job_title": "Teacher in Baghdad", "duration": "N/A", "pros": "Pay when they managed to pay it on time", "cons": "Quite literally everything else. That place is a dumpster fire who treats their employees awfully! The great salary wasn't worth it."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Most of the staff are educated", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Nov 2021", "job_title": "Associate Director, Executive Assistant in Baghdad", "duration": "N/A", "pros": "Intelligent,Hard worker, Team sprite,Working under pressure, Problem Solving, English proficiency,MS proficiency", "cons": "Helping others often makes it a burden"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing AUIB", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jan 2021", "job_title": "Director in Baghdad", "duration": "N/A", "pros": "A professional environment, collaborative staff and faculty. A management that goes out of its way to make sure employees are taken care of. Very engaging community", "cons": "Personally there is nothing that is not good."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "AUIB", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jan 2021", "job_title": "Executive Assistant to the President in Baghdad", "duration": "N/A", "pros": "Great environment, an amazing addition to your resume", "cons": "brand new University it will be tier-one University in Iraq and Middle east"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work With an Amazing Future!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Aug 2020", "job_title": "Director of Communications &Amp; Marketing in Baghdad", "duration": "N/A", "pros": "Strong vision for the future, clear mission goals, dedicated team of Iraqis and Expats, strong commitment from the sponsors, and an amazing campus.", "cons": "While the campus is still under construction, it gets better every week! COVID is making planning difficult, but that is true everywhere. Summers are very hot, but you now that before coming here, right?"}]]