[[{"date": "16 Mar 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at South Dakota State", "Interview Descriptions": "The process is very simple. First, we need to apply for the graduate program at SDSU and, once it is approved. Then we had to attend a Zoom interview followed by final offer letter via mail.", "Interview Questions": "Tell me about the graduate program."}, {"date": "7 Apr 2018", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at South Dakota State (Brookings, SD) in Feb 2018", "Interview Descriptions": "Looked through my resume and then asked questions. Even asked about my previous work experience and then discussed then discussed with the type of work I need to carry out.", "Interview Questions": "Asked questions of different programming languages and software "}, {"date": "31 Oct 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at South Dakota State (Brookings, SD) in Jan 2017", "Interview Descriptions": "It was 30 min interview, talked about my previous technical work and my future goals. Furthermore, we discussed my research interest and why i want this job. Interview was casual.", "Interview Questions": "technical questions based on my past experience"}, {"date": "18 Mar 2017", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at South Dakota State (Brookings, SD) in Dec 2016", "Interview Descriptions": "standard faculty recruiting process. One day from breakfast to dinner. Meet search committee, chair, dean, graduate students. One teaching talk (30 mins) and one research talk (1hr). People are very nice during the whole process. Received the offer after 2 weeks.", "Interview Questions": "research plan in the next 5-10 years. how do you plan to teach XXX courses and what new courses you can offer. how do you plan to apply for external funding."}, {"date": "10 Oct 2017", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at South Dakota State (Brookings, SD) in Nov 2016", "Interview Descriptions": "I saw the position via social media, I then decided to apply online. I was selected for Skype Interview. I was notified via phone for the interview and offer. The entire process took roughly two months.", "Interview Questions": "Name a time where you should have does something differently"}, {"date": "11 May 2016", "title": "Program Assistant I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at South Dakota State (Brookings, SD) in Feb 2016", "Interview Descriptions": "I submitted my application online and interviewed with the office staff.  For a job paying so low, I was very surprised they contacted my previous employers (I was already an employee here and my boss had given a great recommendation) and asked them a lot of detailed questions.", "Interview Questions": "Describe a difficult time in your previous job and what did you do to overcome it."}, {"date": "13 Aug 2015", "title": "Admissions Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at South Dakota State", "Interview Descriptions": "The interview itself was an in-person interview with conducted by two supervisors. The questions were pretty basic (generic) interview questions. It was a face-to-face meeting that took about a half-hour. I got a call back the same day letting me know I was hired. Overall, I thought it was a fairly easy interview.", "Interview Questions": "Why do you think you will be a good fit for this position?"}, {"date": "29 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at South Dakota State (Brookings, SD) in Mar 2015", "Interview Descriptions": "Luckily, I had the advantage of being on good terms with the PI prior to the interview. I had discussed the possibility of continuing my hourly work into a graduate project and led to our formal discussion concerning my project. I was allowed my input as well as time to reflect on the proposed work and can honestly say it was a great experience. However, I recognize it doesn't compare at all to an interview setting in industry, of which I am sure would be more formal and strenuous.", "Interview Questions": "What ideas do you have for this project laid out?"}, {"date": "8 Oct 2017", "title": "Undergraduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at South Dakota State (Brookings, SD) in Jan 2015", "Interview Descriptions": "Sat down with a professor to discuss research interests. The professor told me about his research areas and why they are important. He asked me several questions. Very casual meeting.", "Interview Questions": "What laboratory techniques do you posses?"}, {"date": "24 Jun 2015", "title": "Camp and Conference Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at South Dakota State (Brookings, SD) in Apr 2014", "Interview Descriptions": "Filled out the form, then I was called back for an interview, the interview took about 30minutes. They are very nice, no tricks.Just asked about some common questions. They also wrote something down when you answered the questions. After the interview, I got my offer after 2 weeks.", "Interview Questions": "How do you deal with emergency issue?"}], [{"date": "29 May 2017", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at South Dakota State (Brookings, SD) in Apr 2014", "Interview Descriptions": "The interview process was one that had three people asking questions about how I would handle certain situations. How I would go about helping other students with school life and how to correctly direct them to the proper services.", "Interview Questions": "How would you handle two room mates fighting?"}, {"date": "23 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at South Dakota State (Brookings, SD) in Aug 2013", "Interview Descriptions": "It was great, asked about my previous background experience and education. They were also concerned about my ability to work in the field given that I was coming from a country with a completely different climatic conditions. However, these fears were alleviated when I assured them of my flexibility and told them about former work experiences.", "Interview Questions": "Are you able to work in field conditions?"}, {"date": "15 Mar 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at South Dakota State (Brookings, SD) in Jan 2012", "Interview Descriptions": "The host who took me from one faculty's office to another was having certain bias towards their own female faculties as while talking about them he clearly indicated that how he wished that the whole campus should have been white male only faculties though to comply with diversity policy they have to have females and also faculty of color. I was shocked. I am white and male so I certainly would be welcome here though, I have worked with so many African Americans, Asians, and females and I would like to bring some of them as collaboration and this goes against my own personal values. The interim head of department was totally clueless on what the department's goal is and told me that they are actively searching a new head that by policy has to be an external candidate and once head is finalized he will be able to answer this question for me. I knew that the new had will not be me female and person of color at any time!", "Interview Questions": "1. My values as christian while male? \r\n2. Will I be bringing females into my research group?\r\n3. Am I okay with female colleagues in my department?\r\n4. Why did I applied for job at SDSU?\r\n5. What do I bring as a researcher?\r\nMany more though these few stands out"}]]