[[{"date": "7 Feb 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Culinary Institute of America (Hyde Park, NY) in Jan 2023", "Interview Descriptions": "Students are paired with a professor or chef that meets the criteria of the job they are looking for. This is a scholarship based program through Earn and Learn that will offset your overall tuition.", "Interview Questions": "What is your GPA. What are your career interests. How do you work with others. What extracurriculars are you a part of"}, {"date": "30 Dec 2022", "title": "Culinary Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at The Culinary Institute of America (San Antonio, TX) in Oct 2022", "Interview Descriptions": "Most unprofessional interview process I've ever experienced. The lack of communication and adherence to timelines was a big red flag - I lost a lot of respect for the institution through the process. Submitted an application in the fall. Had a phone interview in the spring, was told I would get followup in a few weeks, did not hear anything for two months, and then an interview was scheduled. Completed the working interview, which turned out to be a group interview (4 hours). Was asked to reschedule the rest of the interview- was told I would be brought in the following week. No contact for a month. Completed the final process and was told I would hear within a month- did not hear anything for three months. Was asked to repeat the interview process, and completed the 4 hour process for a second time. Was told the timeline to choose a candidate was a month. Did not hear for two months, and was sent a standard email from the school informing me that they would not be moving forward. No one at any point acknowledged the fact that they consistently did not follow up or ever keep to their timeframe through the process. A heavy time commitment, with very few clear parameters for judging. Several instances of sending follow up emails that were ignored.", "Interview Questions": "Why do you want to work at the Culinary Institute of America?"}, {"date": "9 Dec 2021", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Culinary Institute of America", "Interview Descriptions": "A 20 minute introductory phone call/ interview. A zoom interview that was scheduled for 1 hour that went for nearly 2.5 hours and I thought went great. An in person interview that was scheduled for 30 minutes and went over an hour. I felt certain I had gotten the job and then..... nothing. I never got any follow up after the third round of interviewing until two weeks later I got a one sentence system generated rejection email. Yuck, not a great way to reject someone after they have spent nearly five hours in your inefficient interview process.", "Interview Questions": "Tell us about your previous experience, how have you dealt with conflicts/ disagreements in the workplace, and other generic questions nothing too memorable. "}, {"date": "8 Feb 2023", "title": "Resident Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Culinary Institute of America (Hyde Park, NY) in May 2021", "Interview Descriptions": "It was a long full day meeting lots of people to get a feel for the campus. It provided great insight into the campus dynamic and the people you would work with.", "Interview Questions": "What prior experiences had prepared me for this"}, {"date": "21 Jun 2021", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Culinary Institute of America (San Antonio, TX) in Nov 2020", "Interview Descriptions": "Put in application online and was contacted by HR representative less than a month after. Initial interview was a phone call screening. I made it clear that I was needing at minimum a $48k salary. The HR representative said that the position only paid a maximum of $40k but would see if there was any room for negotiating. A week after the interview HR rep called me back to inform me that they could not budge on the $40k salary. I wished them the best of luck on their job search.", "Interview Questions": "Tell me a time you had a difficult situation and what you did to resolve it."}, {"date": "4 Mar 2020", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Culinary Institute of America (New York, NY) in Feb 2020", "Interview Descriptions": "It consists of a phone interview, on-site HR and technical interviews. Followed by 5 assessment test. It was a waste of time. They took 1month to reply and keep ignoring.", "Interview Questions": "Experience with SQL"}, {"date": "8 Aug 2019", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Culinary Institute of America (San Antonio, TX) in Jun 2019", "Interview Descriptions": "five interviews total, three phone, one on site and one Skype. All interviews were about a week to 10 days apart. The great thing is that the HR person from the first interview was the point of contact throughout the whole experience. There was enough communication which I appreciated.", "Interview Questions": "What would be the most difficult thing about the position "}, {"date": "14 Dec 2018", "title": "Blank Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Culinary Institute of America", "Interview Descriptions": "HR manager setup the interview and I had an interview with my boss, and then a panel, and one other person within the department I would work with. They do panel interviews for the most part.", "Interview Questions": "Questions related to your job experience and how it will work for the position. They also ask pretty deep questions as well, to get to know you as a person. "}, {"date": "6 Jan 2019", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Culinary Institute of America in May 2018", "Interview Descriptions": "Phone interview followed by about 7 tests I had to take and was then invited onsite for an in person interview.  I found the testing process frustrating.  The HR and IT folks I met with were friendly and professional.  I was very frustrated that after taking multiple tests and sitting for an interview that nobody ever followed up with me with regard to filling of the position.   Several attempts at reaching out to HR regarding the status of my candidacy went nowhere.  Obviously I didn’t get the job but they could have given me the respect of letting me know considing the time I spent in testing and interviewing.", "Interview Questions": "Skills questions ranging from infrastructure to virtualization and everything in between."}, {"date": "13 Nov 2018", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Culinary Institute of America in Mar 2018", "Interview Descriptions": "Smooth & Easy interview if you are well prepared for the common questions. Demonstrate enthusiast while answering and driving yourself during the interviews. The HR team is competent and help the candidates through the process. The process took longer due to the background check, but at the end everything went good.", "Interview Questions": "What is a deal breaker for you?"}], [{"date": "8 Apr 2017", "title": "General Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Culinary Institute of America (Hyde Park, NY)", "Interview Descriptions": "Really easy. There were two rounds of interviews and both were very straight forward. Both were about an hour long tops. You take some testing mainly on the Microsoft Office Suite.", "Interview Questions": "Where do you see yourself in 4 years?"}, {"date": "29 Aug 2018", "title": "MGT Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Culinary Institute of America (Hyde Park, NY) in Jan 2017", "Interview Descriptions": "deceitful presentation of job. Sr mgt is off the rails with expectations and pay. Benefits are only good if you have been there for many years. New hires get the short end of the stick.", "Interview Questions": "nothing pertaining to the role"}, {"date": "7 Feb 2019", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Culinary Institute of America (Hyde Park, NY) in Sept 2016", "Interview Descriptions": "Short interview with ITS manager over duties and requirements. Went over available schedule, so that the student can work and also be able to be on time to class. Took tour of lab and discussed EFI printme.", "Interview Questions": "Tell me about your previous jobs and responsibilities?"}, {"date": "29 May 2016", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Culinary Institute of America (Hyde Park, NY)", "Interview Descriptions": "Applied online, got called in for 2 interviews, it was pleasant exp. you must have the exact skills for job listed or  you will not be called. took 8 months to finally get the job, was interviewed by someone from the department and human resources at the time. make sure you are dressed proper and well mannered and keep goo eye contact, also they like to hear that you are a \"yes\" person type.", "Interview Questions": "Why should we consider you for the position?"}, {"date": "14 Dec 2016", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Culinary Institute of America (Hyde Park, NY) in Oct 2015", "Interview Descriptions": "I was first contacted by phone by someone in HR and had a short phone interview with them. I was then asked to schedule my first in-person interview. There I met with the same HR person and the person who would be my immediate supervisor. I was then asked to return for a second interview where I met with two of the department heads. Because of the position I applied for, I had to take an Excel and Access test. I was then contacted about 2 weeks later by HR saying they would like to extend the opportunity to me.", "Interview Questions": "Why do you think you would be a good fit here?"}, {"date": "18 Dec 2013", "title": "Director of Public Safety Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at The Culinary Institute of America (Saint Helena, CA) in Jul 2013", "Interview Descriptions": "I was called by the HR Director after the initial application while I was on vacation (mid-July). She conducted a brief telephone interview. They claimed to be highly motivated and looking to fill the position by August 1st.  They requested an in person interview that required me to leave the  vacation a day early.  The interview was at their main campus located in the former Christian Bros. winery.  I sat through three interviews, first the HR director, then the college president and then the chief chef (equivalent to the provost in most colleges).  All were very enthusiastic and reiterated their commitment to fill the position by August 1.  After that interview there was nothing but silence.  No rejection letter, no phone calls, no emails... nothing.  I made several inquiries as to the status as August 1 approached and received no response.  None of the above parties answered their phones or returned messages.  I continued on with my job search and was eventually hired at the end of September by another academic institution.  In mid-November..... approximately 4 and a half months after the interview I received an email advising the position was filled.", "Interview Questions": "The entire interview was low key.  Strictly qualifications review and discussion regarding my background and experience."}, {"date": "7 Oct 2011", "title": "Admissions Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Culinary Institute of America (San Francisco, CA) in Jun 2011", "Interview Descriptions": "I was called by the Recruiter for a phone interview in regards to the Admissions Recruiter position. We talked for about 20 minutes about my background, going down the list of jobs one by one. I answered some questions about my motivation and what I was looking for in a company, and my salary expectations. I didn't hear back from him.", "Interview Questions": "What motivates you as an employee?"}]]