[[{"date": "16 Jun 2023", "title": "Adminstrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University Hospital", "Interview Descriptions": "It was smooth and efficient. I had pleasant interview experience with the interviewers. They were open in sharing about this role and was able to answer my queries. Overall, I was able to answer these questions confidently and managed to get an offer.", "Interview Questions": "What are your strengths and weaknesses Why do you want to take on this role"}, {"date": "16 Jun 2023", "title": "Staff Nurse I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at National University Hospital in May 2023", "Interview Descriptions": "Online interview through zoom. Interviewees were one of the ADON and one sister from high up. Just ask simple questions, no scenario-based or personality questions. Was quite quick since I interned with them before.", "Interview Questions": "Why nursing? What dept you prefer to work in (2 choices)? Why?"}, {"date": "13 Apr 2023", "title": "Health Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Hospital (Singapore)", "Interview Descriptions": "I applied through online website and the interview was relatively smooth. I was asked questions about my availability period and my past working experiences. It was a pleasant and fast interview process overall.", "Interview Questions": "What are you past working experiences?"}, {"date": "5 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University Hospital (Jurong West New Town, ) in Apr 2023", "Interview Descriptions": "Easy to talk to, they were not very demanding. I was nervous but they gave me enough space to adequately express myself. They were also very detailed with their questions", "Interview Questions": "Why did I choose to apply to the hospital Is there any unit that I'm keen on"}, {"date": "15 Feb 2023", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at National University Hospital (Singapore) in Jan 2023", "Interview Descriptions": "Went to NUHS to attend the interview. Overall a good experience. I was applying through a recruitment agency. During my interview, there are 4 persons there to interview me. Mostly they talk about the detail of this job and this industry to align the mindset. I was asked about to introduce myself and also about my plan to join this industry. It is mostly like a talk with the HR team to align our understandings.", "Interview Questions": "Please tell me about yourself"}, {"date": "13 Dec 2022", "title": "Programme Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at National University Hospital (Singapore) in Oct 2022", "Interview Descriptions": "If you were recruited by a recruitment agency, the recruiter helps you prepare for the interview by prefacing you with what to expect. A written and timed assigment (1 hour) with about 5 questions and then 2 interviews. Questions like \"How do you see the healthcare sector in Singapore?\" (Yes in that kind of grammar) \"What are your goals in life?\" First interview with an HR member and the reporting manager. Second with the Head of Dept. After the assignments and interviews the recruiter gathers feedback from you which is how they have info to prepare candidates. The HR team takes long to give you an offer and finalise things. After the interview they inform you that you are selected but take one week to decide and inform you your salary, without a contract. And only upon your acceptance will they prepare the contract, which takes another week. This is inefficient. They give you one day to respond to their salary offer which is unprofessional and insufficient.", "Interview Questions": "I honestly forgot most of it since I was the one doing most of the talking about myself and my jobs."}, {"date": "11 May 2022", "title": "Staff Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at National University Hospital (Singapore) in May 2022", "Interview Descriptions": "The interview was straightforward and I was comfortable and welcomed throughout the interview. It was arranged by the agency where they asked me why didn't you apply early. I was like even now I wasn't approached by the hospital, although I have applied 3 months before and  have been waiting for their response to my application in NUHS website. It seems like they don't even bother to look through the applications.", "Interview Questions": "With the usual questions like \r\n- Introduce urself\r\n- Department preference and why? Although they will explain why we cant be allocated to those wards, so IDK why they asked this question?\r\n- Career plan such as in 2 yrs/5yrs...\r\n- What have you practiced/learned during my clinical training? (Cases seen, skills & procedures performed)\r\n"}, {"date": "20 Nov 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University Hospital", "Interview Descriptions": "Despite being a fresh graduate with some intern and work experience, the interviewers were judgemental. They criticize me for not committing to a job long-term, according to them they call it \"touch and go\". Hello is just I only have term breaks to intern or work. Is called a term break for a reason. As per usual NUH interviewers and interviews are always done by people who are struck up and judgemental", "Interview Questions": "dont bother applying to them"}, {"date": "20 Nov 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University Hospital (Singapore) in Nov 2021", "Interview Descriptions": "Despite being a fresh graduate with some intern and work experience, the interviewers were judgemental. They criticize me for not committing to a job long-term, according to them they call it \"touch and go\". Hello is just I only have a term break to intern or work. Is called a term break for a reason,  Do you expect a fresh grad with 10 years of work experience in the industry? As per usual NUH interviewers and interviews are always done by people who are stuck up and judgemental", "Interview Questions": "don't bother they think highly of themselves"}, {"date": "28 May 2021", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University Hospital", "Interview Descriptions": "Was quite a friendly and chill interview. You just pass your resume to the hiring manager and answer a few questions about yourself and your work ethics. Not much else.", "Interview Questions": "Why do you want to work here ? "}], [{"date": "1 Feb 2021", "title": "Ops Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University Hospital in Jun 2020", "Interview Descriptions": "Questions about interest and motivations. Be prepared and ready to answer tough questions. Do know more about healthcare before applying. Learn about the role and understand what you have to do. There might be more than 1 interviews", "Interview Questions": "Why do you wish to pursue healthcare"}, {"date": "7 Mar 2020", "title": "Patient Service Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at National University Hospital", "Interview Descriptions": "There were 1 Hiring Manager and 1 HR Officer. Hiring Manager was nice but the HR Officer blatantly ignored my presence and continued playing with her phone. Super rude. She sounds very condescending as well. Just beware if you’re applying for the PSA position.", "Interview Questions": "Tell me more about yourself?"}, {"date": "27 Aug 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National University Hospital (Singapore) in Jan 2020", "Interview Descriptions": "Very calm,  very nice interviewers, was able to ask about job scope etc, overall a very smooth process, although waiting time took quite a while. Benefits and all were mentioned and although didn't pass, was still not a bad experience overall", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "5 Mar 2020", "title": "Care Coordinator ACP Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National University Hospital (Singapore) in Nov 2019", "Interview Descriptions": "The main interviewer has PMS problem, was rude and unprofessional (was belittling me during the interview, using words like 'do you know', pointing at me', smirking when I talk/answer her question. Despite me elaboration of my education and previous job experiences, she may not have the brain capacity to understand.", "Interview Questions": "can you handle death?"}, {"date": "21 Oct 2019", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University Hospital in Oct 2019", "Interview Descriptions": "Applied online and was invited down for an interview. The interview was smooth and the panel explained about the job and what is to be expected. They wanted to know why am I interested in the position and what I feel the job is about. They also wanted to know if my interest is towards clinical chemistry or other areas and if given the choice which department would I choose. They also explained how they are different from other hospitals and how long training will take. The whole process took about 2 weeks and the HR was really friendly and professional and would give updates regarding the process after the interview was done.", "Interview Questions": "What is your idea of clinical chemistry?"}, {"date": "24 Aug 2019", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University Hospital", "Interview Descriptions": "There were two Nursing leaders( interviewers ) and two HR people.  The interview process was fast and to the point. The interview was held in a small room, everyone was seated together around a round table.", "Interview Questions": "Why did you join nursing?\r\n Why do you want to work here?\r\nHow did you find the culture here?\r\nBehavioural questions were asked.\r\n"}, {"date": "22 Aug 2019", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University Hospital (Singapore) in Apr 2019", "Interview Descriptions": "Went through two rounds (first with HR & manager; second round with manager & head). Time taken to get back to me after the first round was long (2-3 weeks) and they require you to bring so many paper documents (it's 2019; please save paper and go digital like everyone else is doing). Interview itself was rather standard, although during the first round they told me AFTER the whole interview that the job is actually a 2-year contract (no mention of it in the job posting or anything prior). Felt that it went quite well after my second and final round but after that HR did not even get back to me with the rejection/outcome, which I felt was quite unprofessional. Fortunately by then (since they had taken so long) I had already gone for another company interview + received a better offer.", "Interview Questions": "How do you think you can contribute to the team and role?"}, {"date": "25 Mar 2019", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at National University Hospital", "Interview Descriptions": "They will ask you about yourself and attitude to work, how you handle difficult situations. Whether you can see blood as you will be facing patients, how you going to handle stress.", "Interview Questions": "Describe yourself"}, {"date": "4 Nov 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at National University Hospital (Singapore) in Mar 2019", "Interview Descriptions": "The interview is relatively quick and brief. The setting was not a formal setting and they are very welcoming of interns. I believe my interview was roughly about 10 minutes long", "Interview Questions": "Explain some previous experiences and the troubles I've faced"}, {"date": "16 Nov 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University Hospital (Singapore) in Sept 2018", "Interview Descriptions": "First interview involved expressing my interest to embark on a PhD to which the surgeon suggested that he consult a professor who has a project at hand. During the second interview, I explained my research ventures and was told that although they may want to offer me the PhD, it is up to the university whether they acknowledge my Newcastle University degree.", "Interview Questions": "Honestly nothing significant as I felt they were more interested in fulfilling the role."}], [{"date": "31 Aug 2018", "title": "Senior Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at National University Hospital (Singapore)", "Interview Descriptions": "Submit application via agency. Company called for Telephone interview  first followed by arrangement of formal interview together with the department head.  Waiting time to see the interviewer takes more than 15 mins than the scheduled time.", "Interview Questions": "Tell more about yourself.\r\nIf selected, when can you start work."}, {"date": "9 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University Hospital (Singapore) in Feb 2018", "Interview Descriptions": "seems to be a really understanding interviewer. Really felt welcomed and eased my stress away by preparing me ealier. Was able to answer my questions. Kept me updated with the process at all times.", "Interview Questions": "where do you see yourself in this career"}, {"date": "24 Sept 2017", "title": "Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at National University Hospital (Singapore) in Sept 2017", "Interview Descriptions": "The interview process was fairly straightforward. The panel wanted to know if you have strong customer service skills because this job requires you to be in contact with patients. The hiring process was standard and the interview was scheduled very quickly after getting a phone call.", "Interview Questions": "What are some challenges of this role ?"}, {"date": "13 Nov 2019", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National University Hospital (Bedok New Town, ) in Feb 2017", "Interview Descriptions": "1- 2hrs long interview with supervisors and or reporting officer.  Friendly conversations getting to know each other.  Questions are specific to job position and can also be a bit personal. The interview will explain about the culture in the department.", "Interview Questions": "What do you know about clinical trial?"}, {"date": "20 Apr 2018", "title": "Corporate Communication Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at National University Hospital (Queenstown Estate, ) in Feb 2017", "Interview Descriptions": "A writing test and an interview with the 3 communication managers in the team for about 30 mins. The writing test would require you to write a holding letter for a certain scenario.", "Interview Questions": "If I could work well in a fast paced environment?"}, {"date": "13 Jul 2020", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at National University Hospital in Jan 2016", "Interview Descriptions": "It was through a phone interview first, followed by a formal interview with HR and Supervisor in charge. Standard particulars form. Interview was about 1 hour.  There's an official orientation after hire.", "Interview Questions": "Reason for leaving "}, {"date": "15 Feb 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University Hospital (Singapore) in Nov 2015", "Interview Descriptions": "There were supposed to be 4 interviewers unfortunately the 4th( Head of the Pharmacy Department) was not there for the interview. The people present was the head of Hemetology and Oncology, the research manager and an investigator for the clinical trial I would be working on.  They primarily wanted to look for research interests and accomplishments in the relevant field as well as how much I knew about the process of clinical trials.", "Interview Questions": "What experience have you had with respect to clinical research?"}, {"date": "27 Oct 2015", "title": "Medica Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at National University Hospital (Singapore)", "Interview Descriptions": "I applied directly to the hiring manager's email address. I got the notice 2 days later. I was invited for an interview. There were 2 interviewers. They looked through my resume and asked about my position as a customer sales officer. The interview was rather long, where I was asked many questions and they shared much information about the jobs. Basically, they asked me to choose between clinical biochem or molecular biology departments and I had to come up with the decision swiftly. They shared that shift work is to be expected as the lab runs 24/7 and on-call duties are expected when scheduled. Work days are 5 day rostered work week , 2 off days. Allowance in additional to basic salary will be given for shift work, on-call duties etc. Clinical biochemistry is a very busy role and the training alone takes at least 8 months. NUH holds many continuing education type of courses.", "Interview Questions": "How would you react if doctors are chasing for results of samples ran and there was a small error to rectify, which took up much precious time? The doctors are very furious and refuse to accept your reasons?"}, {"date": "8 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at National University Hospital", "Interview Descriptions": "Face to face interview with hr. Questions were mostly assessing candidate and his knowledge of the company such as its values, how candidate see himself fitting in.... also questions on school stuff like the modules etc.... that are applicable to the position", "Interview Questions": "Values of company"}, {"date": "4 Nov 2015", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at National University Hospital (Clementi New Town, ) in Sept 2015", "Interview Descriptions": "Really dumb interview. Interviewers made me waited for 20minutes. Came in and asked few discriminatory and senseless questions. The interviewer was challenging your intelligence. Trying to act smart type. The HR was so quiet and dont even asked questions. Trying to act like a vase which she isnt anywhere near to it.", "Interview Questions": "\"are you going to have another kid?\" \r\n''in a race between a rat and ox, who do you think will win the race?\""}], [{"date": "31 Aug 2017", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at National University Hospital (Singapore) in May 2015", "Interview Descriptions": "Fastest process among other hospitals. interviewers consisted of HR & department manager. Basically review all your previous job experiences, and basic knowledge about the medical benefits provided by the government, eg; Medisave, MediShield", "Interview Questions": "Strength & weakness, why chose this job"}, {"date": "12 Apr 2013", "title": "Patient Service Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at National University Hospital", "Interview Descriptions": "Not very detailed, as the entry requirement is 'N' or 'O' levels only. As mine is a specialist outpatient clinic, every clinic has different people interviewing you. Not really sure how other clinics work, but for my clinic is quite a breeze.", "Interview Questions": "Most difficult question is the practical question, whereby they ask \"When a patient comes up to you at the counter, yet you are on the phone, what would you do?\""}, {"date": "3 Aug 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at National University Hospital (Singapore) in Mar 2012", "Interview Descriptions": "It is rather easy. Once you get passed the CV screening, you could be certain that you get the internship position.", "Interview Questions": "All typical questions. Try to indicate what you want to learn and what you are interested in so that they can give you the project you are more comfortable with."}]]