[[{"date": "22 Sept 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Jefferson Center for Mental Health", "Interview Descriptions": "Initial interview of 10 general questions.  Will, depending on position, have a 2nd interview with other staff.   Once rhat is complete background and UA.   References checked and if all three are clear and offer is made.", "Interview Questions": "Why is diversity and equity important "}, {"date": "19 May 2022", "title": "Child and Family Services Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Jefferson Center for Mental Health in May 2022", "Interview Descriptions": "It was a virtual interview with the hiring manager and a newly hired therapist. It lasted about an hour and consisted of prepared questions. I did get an answer right away, and they provided some helpful feedback.", "Interview Questions": "I was given a master's level case question (similar to the cases we get in grad school) and asked how I would assess and diagnose. "}, {"date": "23 Dec 2021", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Jefferson Center for Mental Health in Oct 2021", "Interview Descriptions": "The application process was very strung out  and kind of all over the place. The whole process took about three months as I went deep into the interview process. They ask for references right off the bat which is something I would reconsider because it can be bothersome to your references to have to notify them that a company may be reaching out over and over again. I suggest saving that for the end of the application process. \n\nThe team leader I was in contact with was personable enough and seemed to be very knowledgeable about the position, however after the final interview, there was radio silence from the whole philanthropy team after reaching out. Not that I necessarily expect daily correspondence or anything, but often times candidates put a lot of effort into applying for a position so a little bit more effort on their end would be nice. On that note, receiving a boilerplate, copy paste rejection email weeks after the fact from a name I’ve never heard of was rather insulting given the amount of effort I put into learning about the company and the position itself. Again, not expecting an essay but a quick thank you email from someone on the team would have been nice. \n\nAll in all, I wish Jefferson Center the best in their mission as this is a cause I hold very dearly, however, a few changes to their hiring practices would make things a lot more palatable for candidates.", "Interview Questions": "How do you handle disagreement? Lack of cooperation?"}, {"date": "18 Sept 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Jefferson Center for Mental Health", "Interview Descriptions": "Phone interview first. Then 4 people asking scripted questions taking notes. Then job offer a week or 2 later. Then HR sends an email to get you set up. Pretty easy.", "Interview Questions": "They asked about my relevant experience and what I’d do in certain situations with difficult clients"}, {"date": "17 Feb 2021", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jefferson Center for Mental Health (Arvada, CO)", "Interview Descriptions": "Interviewed in person for the position. Felt like the interview went well, but then I never heard back from them about the position. The least they can do if someone interviews, is so call and let them know they were not selected.", "Interview Questions": "Why do you want to work at JCMH? "}, {"date": "3 Jun 2020", "title": "Family Services Outpatient Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Jefferson Center for Mental Health (Denver, CO) in Mar 2020", "Interview Descriptions": "I did a phone screen then interviewed with the program manager, then with about 10 members of the team. It was a positive and useful experience. The questions were tough but were very relevant to the job.", "Interview Questions": "they asked how I would conceptualize a specific case"}, {"date": "7 Apr 2020", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Jefferson Center for Mental Health (Evergreen, CO) in Feb 2020", "Interview Descriptions": "After a phone interview, I was asked to come into the office where I was applying and meet with the supervisor and another Sr Admin Asst.  They were friendly, organized, and easy to talk to.", "Interview Questions": "How I would handle certain, different scenarios at work."}, {"date": "1 Nov 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jefferson Center for Mental Health (Lakewood, CO) in May 2019", "Interview Descriptions": "Applied on-line.  Received a call back within 2 weeks to schedule an interview.  Had 2 interviews.  First with Director and second was panel style.  Following 2nd interview, heard back within a week about moving forward with background and reference check.  Relatively easy and straight forward interview process.", "Interview Questions": "Interviews had scripted questions about experience related to job applying for, scenario's, ethics, etc. "}, {"date": "21 Nov 2018", "title": "Outpatient Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Jefferson Center for Mental Health", "Interview Descriptions": "asked questions about past experiences, scenario questions .  there was an initial phone interview and then 3 supervisors conducted the interview in person.  it was pretty straight forward.", "Interview Questions": "how would you handle this situation, what is bipolar disorder , how do you deal with conflict, what population do you prefer to work with, what if you could hear commotion during group therapy, how would you handle that situation"}, {"date": "6 Nov 2018", "title": "Addiction Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Jefferson Center for Mental Health (Wheat Ridge, CO) in Oct 2018", "Interview Descriptions": "Applied online and got a call the next day. Set up an in person interview which consisted of two people. The questions they asked were not your typical interview questions (strengths, weakness, etc). Questions were more about the process. I left the interview very confused wondering if I even did well. Afterwards, I got a request for background check and Drug screen.  Finished both then got a decline letter from HR. Five days later, I got a call stating they didn’t decline because they didn’t want me, but they had already someone else that finished the process. They asked if I was still interested in a position, but I declined. I had already accepted a position elsewhere.", "Interview Questions": "What would you do if you went to the hospital and they did not agree with our policy?"}], [{"date": "10 Jun 2019", "title": "Intake Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Jefferson Center for Mental Health (Wheat Ridge, CO) in May 2018", "Interview Descriptions": "Structured and fair. It's very straightforward where you are asked about availability, experience,  which site you prefer to work at, etc. The process is very diplomatic where you are interviewed by a panel of clinicians, each of which bring a different perspective. One of the great things about JCMH is that the people you interview with have their own questions, which often invokes some of their clinical experience. This is a good way to get to know about the staff and some of their theoretical orientations and I encourage all potential applicants to consider this going into the interview.", "Interview Questions": "How would you respond to [insert situation]?"}, {"date": "3 Dec 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Jefferson Center for Mental Health (Wheat Ridge, CO) in Apr 2018", "Interview Descriptions": "I applied online, and it was super easy to upload my resume and cover letter, and to answer a few screening questions. I was contacted within a few days by a recruiter to complete an application and then to schedule an interview. I came to the office for an in-person interview with two people from the department, and they were incredibly friendly, welcoming, and easy to talk to.  I was then scheduled for a second interview with the whole team, which I did via video conference. We had some technical difficulties, but overall it was good. I then competed a quick online form for the background screening, and once that was complete (it didn't take very long), the hiring manager called me to offer the position.", "Interview Questions": "One question they asked me how I would handle a situation in which a coworker disagreed with me.  They also asked me general questions about my past experience, and why I wanted to work for Jefferson Center. "}, {"date": "19 May 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Jefferson Center for Mental Health in Apr 2018", "Interview Descriptions": "I applied online and was contacted within 2-3 weeks. I had two in-person interviews - both were panel style. For the second interview I was asked to prepare a writing sample that we discussed in-person. I completed a background check and provided information for my references. I felt well-informed throughout the process,  and was offered the job within about a week and a half from my second interview.", "Interview Questions": "Why do you want to work for Jefferson Center?"}, {"date": "27 Mar 2018", "title": "Addiction Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Jefferson Center for Mental Health", "Interview Descriptions": "Over the phone interview with HR asking about my previous experience and what pay I am currently looking for, a thorough background check took place. After, HR asked me  to write a letter explaining my traffic violations from 4 years prior which were just speeding tickets, but they wanted to know why I had that on my driving record. I than proceeded with a drug test & paperwork, and orientation.", "Interview Questions": "Whats your experience in Mental Health?"}, {"date": "11 May 2018", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Jefferson Center for Mental Health (Wheat Ridge, CO) in Feb 2014", "Interview Descriptions": "I interviewed with the manager that I now work for.  I had 1 interview but was already working within the company.  The interview was a little nerve wrecking, but manageable.", "Interview Questions": "Why would you be a good fit for this role?"}]]