[[{"date": "3 Feb 2023", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pomona Valley Hospital Medical Center", "Interview Descriptions": "The interview was held with a group. There were around 7–8 people on the panel, and everyone was very kind and generous. They introduced themselves first and asked each of us to introduce ourselves and started with questions related to cultural competency and when we went above and beyond, and so on", "Interview Questions": "Please tell me about yourself"}, {"date": "11 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pomona Valley Hospital Medical Center", "Interview Descriptions": "It was good! and afterwards I got to go on a tour of the unit. They were very informative and allowed plenty of time for all of my questions. Manager was outgoing my and made me feel comfortable.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "11 Jan 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Pomona Valley Hospital Medical Center in Feb 2022", "Interview Descriptions": "Ok, easy questions and was only about 30 minutes long nothing major. The schedule wasn't the best that's why j didn't take it. Would want something different with better benefits.", "Interview Questions": "Where do I see myself in 5 years?"}, {"date": "16 Mar 2021", "title": "Pharmacy Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center", "Interview Descriptions": "it was ok. They interviewed through the phone but there seems to be a schedule problem thats why they were hesitant to hire me. The process was fast and they didn't get back to me since my schedule is not that flexible", "Interview Questions": "What days are you available to work? "}, {"date": "21 Jan 2021", "title": "Office Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center", "Interview Descriptions": "Very easy in the process. done within two weeks.  got a call then a in-person interview within two weeks.  orientation was a easy process and all questions where answered by human resources in a timely manner.", "Interview Questions": "How would you contribute to our team"}, {"date": "27 Feb 2023", "title": "Student Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center in Jan 2020", "Interview Descriptions": "A combination of a group interview and personal interview. The more important one is the personal interview in which you’ll be asked a few basis questions about your experience and then a personal question about yourself.", "Interview Questions": "What do you like to do in your free time?"}, {"date": "1 Dec 2022", "title": "FNS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center in Aug 2019", "Interview Descriptions": "Really simple and easy. I got hired on the spot. You just have to be yourself. Lots of questions that just require common sense answers, if I’m not mistaken I believe I received a packet to read and was tested on it that same day.", "Interview Questions": "What do you see yourself doing 5-10 years from now"}, {"date": "25 Aug 2019", "title": "Clinical Nurse I (New Grad) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Jul 2019", "Interview Descriptions": "I applied mid-June, I was set to take my nclex first week of July and had my interview about mid-July. The interview was a  panel of 7 managers plus the recruiter. They all introduced themselves and they asked me my top 3 choices of units. I brought a portfolio with me and most of their questions came out of that. Definitely ask a lot of questions and know about PVHMC when you go for your interview.  I was offered a position after a week and a half.", "Interview Questions": "Why do you want to work at Pomona Valley?"}, {"date": "23 Apr 2019", "title": "Referral Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Pomona Valley Hospital Medical Center in Apr 2019", "Interview Descriptions": "Questions were quit common, it was a good interview. I asked for a certain amount, they said that was in the budget. They did offer my the job but with 3 dollars less. I didn't take it.", "Interview Questions": "Are you familiar with Cerner? "}, {"date": "4 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Feb 2019", "Interview Descriptions": "Two Interviews with team and vice president, asked questions about the position and what you know about the hospital. Very quick process since the team was very responsive. Both in-person interviews.", "Interview Questions": "What  are you looking for in this position? "}], [{"date": "17 Dec 2021", "title": "STEP Force Junior Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Oct 2017", "Interview Descriptions": "Simple and fast. The interviewer was very nice and approachable and made the whole scenario less stressful than I anticipated. Overall a good experience. It is nothing to be afraid of, but do prepare to answer the questions to the best of your ability.", "Interview Questions": "What was the last movie that made you cry?"}, {"date": "24 Feb 2018", "title": "Admitting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in May 2017", "Interview Descriptions": "First, you get tested for basic math and English skills. After that, casual interview appointment with a supervisor. Just your typical one-on-one interview. It takes a while to finally start since you have to get medical clearance, pass a background check, etc,  but that comes with any hospital job. Training is paid and is stretched out to 2 weeks.", "Interview Questions": "Are you familiar with different health insurance plans and running their eligibility?"}, {"date": "11 Apr 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Mar 2017", "Interview Descriptions": "Late night interview at the hospital.  Appointment was scheduled a week later, each appointment was scheduled every 15 minutes from other candidates.  Panel of 3, including supervisor.  Friendly, comfortable atmosphere.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Oct 2016", "title": "Registered Nurse LDRP Post Partum (New Grad) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Oct 2016", "Interview Descriptions": "I applied online and got a call a few days later for a next day late night interview with the three night shift nursing supervisors (all VERY nice). The interview took place in the supervisor's office, it was comfortable and informal. Average length, they described the position and asked a few questions - \"tell me about yourself\"", "Interview Questions": "Tell us about a time in clinical where you did something you were proud of, or a time where you made a mistake that you learned from"}, {"date": "12 Jan 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center (New York, NY) in Jul 2016", "Interview Descriptions": "The initial interview was great but the meeting with HR was horrible.  They aren't much help at all or at least the person I was dealing with at the time.", "Interview Questions": "Why do you want to work here "}, {"date": "7 Sept 2019", "title": "ICU Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Jul 2016", "Interview Descriptions": "Applied online to a hiring event, went to panel interview, then interviewed with manager of unit then the director. The whole process took a couple of weeks but that was only because the manager was on vacation at one point during the process.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Aug 2019", "title": "Shift Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in May 2016", "Interview Descriptions": "Panel interview with a total of 2 visits with department heads. The return interview was with the department manager. A last phone call with the department manager will confirm offer and hire process to move forward into background checking.", "Interview Questions": "Why should we hire you?"}, {"date": "19 Apr 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA)", "Interview Descriptions": "I applied in person and was interviewed at the hospital by the unit manager and charge nurse. I was asked about what shifts I could work and how often (applied for per diem position). After interview, the manager showed me around the unit, and I was introduced to a few staff members. It took about an hour altogether.", "Interview Questions": "Describe a conflict between you and a co-worker and how you handled it."}, {"date": "4 Aug 2015", "title": "Admitting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Jan 2015", "Interview Descriptions": "they asked why you wanna work there, describe yourself, has clerical exam and typing test, supervisor was very casual and the exam area is at the hr, pretty much it is a good experience", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Jun 2018", "title": "Junior Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Apr 2014", "Interview Descriptions": "Once you have submitted your application and everything, the interview is suppose to take place in a group setting-with yourself and two interviewees and three other students. But for me, something happened and the other students didn't show up so I had to do it alone. Luckily, it was a fun one...", "Interview Questions": "Why do you want to volunteer at PVHMC?"}], [{"date": "24 Mar 2014", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA)", "Interview Descriptions": "I am a former employee of this institution and was hired by the past director of the E.D. back in 2006. Was very satisfied until the new management completely took over and basically did what they wanted to do. That former director was disliked by many of the registered nurses but she did more for the good of the E.D. for all her employees because she stepped up to back up her employees and the E.D. She was more real with the application of social and analytical skills, instead of just hiring and/or keeping \"good\" employees.", "Interview Questions": "None because she realized that the formalities aren't as important in the hiring process. That's what the application or resume is for. She asked questions or the conversation during the interview was based more on who and what the potential employee really is because she knew that would result in a better employee."}, {"date": "19 Sept 2017", "title": "ER SCRIBE Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Mar 2014", "Interview Descriptions": "Relaxed\r\nasked questions about my experience working with patients\r\nVery nice and polite\r\nnot intimidating whatsoever\r\nStaff seemed nice \r\nGave a detailed description of what i would do\r\nThe interview was quite short and lasted only 20 minutes and it was with the lead scribe and doctor. They were very nice and polite", "Interview Questions": "How do you handle multiple things?"}, {"date": "9 Mar 2012", "title": "Human Resources Analyst/Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in Feb 2012", "Interview Descriptions": "Received a call from hiring manager, she screened me and mentioned there was another opportunity in the same field and would I like to apply for that too? I thought that is very kind.\r\n\r\nWas a 3 person panel interview.\r\n\r\nHead of HR department  spoke in a derogatory manner. After 5 minutes I knew it was a huge waste of time.", "Interview Questions": "Asked why I wanted to work there? Quizzed on do I know who the hospital is?"}, {"date": "15 Apr 2015", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pomona Valley Hospital Medical Center (Pomona, CA) in May 2011", "Interview Descriptions": "The interview process is painless and thorough giving the applicant a sense of feeling welcomed. The HR staff is friendly and highly competent. Together with the education department, the hospital ensures that an applicant has met and fulfilled any necessary requirements for the job. You are made to feel like part of the team immediately upon being hired and support remains consistent as part of the hospital infrastructure", "Interview Questions": "Why the interest in PVHMC and why an interest to work there. "}]]