[[{"date": "28 Feb 2023", "title": "Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Biohub (San Francisco, CA)", "Interview Descriptions": "The recruiter began the initial interview by reading a script (rambling through it quickly) about the organization, leading me to wonder whether or not she understood the business herself. The subsequent interview process moved very quickly, but before making an offer or deciding whether I would accept one, the recruiter contacted all my references. After two weeks, without any word either way, I followed up with her. After three follow-ups (!), each time being told, \"we are doing our due diligence,\" the company's reputation had already been tarnished in my eyes, and&nbsp; I lost interest. It has been at least six months since the cycle began, and to date, the recruiter has not contacted me. The job is still posted, a sad commentary on the organization's lack of professionalism and \"polish.\"", "Interview Questions": "\"What is your current availability?\""}, {"date": "30 Nov 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Biohub (San Francisco, CA) in Nov 2018", "Interview Descriptions": "Had three steps. My first interview was with my potential future boss. My second interview was with a potential teammate. The first two were over the phone and had questions about my general career interests, my background, my knowledge of relevant science to the project, my ability to learn, and my interest in the role. There weren't technical questions in the first two rounds beyond asking more about my prior experience. They also provided me a good amount of time to ask them questions. \r\n\r\nMy last round was in person and was half-a-day, including a lunch in addition a tour of the lab space and the offices. I was interviewed by a wide range of people with different backgrounds ranging from data science to biology and chemistry to public health. The questions in the first two rounds were used again for the interviewers who had met during the half-day interviews. I was asked a few more technical questions regarding my understanding of the project. The entire organization works with data in some capacity, so I was asked about my coding/data analytics skills and ability to learn more. The fact that I don't have much experience didn't appear to be a deterrent in my particular case as there is a learning system in place available to the organization. People also asked a few questions to get to know me, such as my hobbies or asking me about volunteer experiences I had listed on my resume. Everyone I met was very receptive to my questions and made very welcoming efforts to explain the structure of the department and how all of the roles were related to each other. I am fortunate enough to say that every individual I met was someone that I would happily work with on a daily basis.\r\n\r\nOverall, the interview process was very fair and seemed to focus on finding a good match between me (the applicant) and the group in terms of current knowledge, personality, capabilities to contribute, and adaptability with regard to learning new skills.", "Interview Questions": "Tell me about yourself."}], []]