[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Proceed with HIGH caution", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Aug 2021", "job_title": "Anonymous Employee in Miami, FL", "duration": "N/A", "pros": "Campus landscaping and interesting architecture that was once owned by an Iraqi tyrant. Meeting (very few) like-minded people and building relationships with the local Iraqi people.", "cons": "Several people in positions of power abused their knowledge of weaknesses or gaps in campus security to stalk and harass female expats living on campus, and create drama amongst staff and faculty with malicious gossip and fabricated rumors. Some faculty broke contract due to general dissatisfaction with lack of logical protocols and rampant disorganization, and others were let go in blatant violation of Iraqi labor laws. Although official reports outlining the reason for the layoff were promised to these employees, none were ever provided. There were uninsured expat employees who were put off and treated as a nuisance for requesting urgent medical attention - from a broken foot (that occurred in the campus library) to debilitating gut issues to mental health concerns. This was most likely due to the fact that the sponsor/CEO was reluctant to provide any health insurance plan to employees. Instead it was promised to pay medical bills if needed, which was not enough for many people who signed contracts that indicated international insurance would be provided upon arrival to the job in Iraq.\r\nIn my brief time with this business, I often felt unguarded and at risk due to lack of safety advisory, no health services on campus, and the forcing of unvaccinated instructors into classrooms that were not well-ventilated - even after being promised in the interview that classes would be fully remote through summer. There is flagrant nepotism, incompetence, and general boot-licking occurring in daily practices. In addition, an employee took his own life in campus housing due to a reported refusal of mental health services.\r\nFor anyone who reads a reply from AUIB stating disgruntled employees’ comments should be taken with a grain of salt, beware. This is the typical attitude and psychology that will be seen in this organization. Faults will not be admitted, proactive behavior does not exist, and there will always be a scapegoat or an excuse for their poor and unscrupulous ways. The job market may be tough for many of us nowadays, but I would strongly recommend anyone who considers this a viable and healthy place of employment to reassess. Since expat employees live on campus, it is impossible to escape the vitriolic environment. The salary is attractive, but accepting employment with AUIB could be to your mental and emotional detriment, as it has been for several former employees. \r\nA final note: If you thrive on drama and toxicity, and you have a high tolerance for the illogical, this could very well be the place for you. However, if this description sounds like a nightmare, you’re not alone. Either way, my hope is that you can make an informed choice with this review."}]]