[[{"date": "19 Apr 2022", "title": "School Service Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City Year UK", "Interview Descriptions": "Over the phone initial conversation which was then followed by a 2nd stage interview and assessment to see if my personality was a good fit for the job description. It is a fantastic role in terms of exposure if you are looking to get involved in the charity sector from the ground up.", "Interview Questions": "Why are you interested in youth work?"}, {"date": "13 May 2021", "title": "Volunteer Mentor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at City Year UK (London, England)", "Interview Descriptions": "Make sure to always to pick up the phone with a smile in your voice, City year often called out of the blue on different numbers.\nThe interview was especially long and at times difficult but be sure to prepare through common interview questions e.g an example where you showed professionalism, your greatest weakness etc. \nBe prepared for the maths and English test- it is striaght forward but not so much if you haven't done gcse maths/English in a while. \nResearch city year and their values and competencies.", "Interview Questions": "give an example of when you showed professionalism"}, {"date": "30 Dec 2019", "title": "Volunteer Learning Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at City Year UK", "Interview Descriptions": "The process was smooth and the recruiters were amazing and I received my offer the following day. I did do the assessment centre but there is a possibility that other people did the assessment centre.", "Interview Questions": "Where do you see yourself in 5 years time?"}, {"date": "15 Oct 2019", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Year UK (Manchester, England) in Jul 2019", "Interview Descriptions": "The interview process was friendly and I thoroughly enjoyed meeting the interviewers. Tasks followed what was expected from prep work. I was, however, very disappointed not to receive any feedback from my interview, despite asking 4 times and it being promised to me. I understand this is difficult for companies at application stage but having spent a lot of time preparing for an interview, presentation and additional skills task (on top of a written application and further written short answer questions), I felt quite let down. I would ask City Year UK to consider this for future applicants.", "Interview Questions": "Present your strategy for growth into schools."}, {"date": "5 Aug 2021", "title": "Volunteer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at City Year UK (London, England) in May 2019", "Interview Descriptions": "Three stages; application, interview, and academic review. The academic review included maths and English skills such as going two paths papers one with a calculator and one without. The English skills were looking through a piece of writing and noticing any punctuation errors etc.", "Interview Questions": "Strengths and weaknesses\nA time where you were a leader."}, {"date": "3 Aug 2018", "title": "Volounteer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City Year UK (Manchester, England) in Jul 2018", "Interview Descriptions": "Applied online and was called in for an interview two days later. Had a situational judgement test based on a video and a scenario I had to create an action plan to resolve. Then had my interview, which was relaxed and lasted about 20 minutes. After the interview date, I was given an English and maths test which I did online and was offered the role the next day.", "Interview Questions": "What do you want to do in the future "}, {"date": "1 May 2018", "title": "Volunteer Learning Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at City Year UK (London, England) in Dec 2017", "Interview Descriptions": "Online form \r\nCompetency based interview questions\r\nWatched a situational video and answered a multiple choice test based on it \r\nthere was also a maths and English online test to be completed after I was offered the position but was told my role was not contingent on it.", "Interview Questions": "Describe a time when you had to work in team and made a success of it"}, {"date": "12 Mar 2018", "title": "Volunteer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City Year UK (Manchester City Centre, England) in Jun 2017", "Interview Descriptions": "It was a very enjoyable day; group task, situational judgement test (based  on a video) then interview. Very friendly and relaxed, they began with a game for us to introduce ourselves, seemed quite formal at the time and like they're looking for a lot (they write a lot of notes) but I asked for my interview feedback a few months into the programme and it was all very positive; they're not looking for much,  you just need to make sure you don't give them a reason not to take you on.", "Interview Questions": "Tell me about a situation you handled badly."}, {"date": "22 Jun 2020", "title": "Volunteer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City Year UK (Birmingham, England) in May 2017", "Interview Descriptions": "Competency-based interview. Very friendly staff, questions were easy and expected. Lasted about 30 mins. I was interviewed by 2 people, alternating questions towards me. A very positive experience for my first interview.", "Interview Questions": "Describe one experience when you had to deal with conflict?"}, {"date": "19 Feb 2018", "title": "Volunteer Learning Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City Year UK (Birmingham, England) in Mar 2017", "Interview Descriptions": "I applied online first, then was called in for an interview and assessment centre we we had to work together in groups to formulate solutions presented to us, or to create a new club idea that would accommodate to the children in the scenario . I then had an interview with 2 people. After passing the Interview, I had to do an online English and Math test and then after that I heard back with an offer.", "Interview Questions": "An example of how I dealt with disagreements with someone/or people on a team, and how I came to a solution. "}], [{"date": "5 May 2017", "title": "Human Resources Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City Year UK (Islington, England) in Oct 2016", "Interview Descriptions": "Two Rounds: the first round was a round table discussion and competency based interview with the Head of HR and Executive Assistant.  The second was a situational test and more detailed interview after.", "Interview Questions": "Why should we hire you?"}]]