[[{"date": "11 Aug 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Erie Family Health Centers", "Interview Descriptions": "Two interviewers and six to seven basic behavior questions but harder for new grads to answer,  no tech questions. They are nice and friendly, maybe more tech questions in further interview. Also should notice it is non-profit.", "Interview Questions": "How to communicate with others who do not have background of your projects"}, {"date": "2 Mar 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Erie Family Health Centers", "Interview Descriptions": "The first step was a 30 minute screener interview with an HR generalist, who was friendly and communicative but didn’t seem to have a great grasp of the job. Then I interviewed with the hiring manager and another team member, who spoke with me for an hour. Questions were fairly standard.", "Interview Questions": "They asked me describe my experience with the job responsibilities."}, {"date": "10 May 2022", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Erie Family Health Centers (Chicago, IL) in Mar 2022", "Interview Descriptions": "There was an initial phone call interview which went well and then I was called for a group interview. The group interview was a little more intense. I was on a call with about 6 people and they each had 3 questions for me.", "Interview Questions": "What tasks did you achieve and how did you achieve it?"}, {"date": "21 Jul 2021", "title": "Advancing Practice Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Erie Family Health Centers", "Interview Descriptions": "- initial paper application\n- short phone interview (screening)\n- in-person interview with four people including one current APRN fellow\n- high level of communication about the process and timeline by program coordinator", "Interview Questions": "One of the interviewers posed a question that was a patient scenario (case study)."}, {"date": "25 Apr 2021", "title": "Director, Enterprise Data and BI Reporting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Erie Family Health Centers (New York, NY) in Mar 2021", "Interview Descriptions": "Meetings were with various levels (individual contributors through chief) with focus on interpersonal relationship building and technical problem solving. Went through four sets of interviews, sent follow ups to the recruiter, and didn't receive any follow up on the results after going through the months long process.", "Interview Questions": "How would you plan and prioritize work given requests from multiple levels and business functions?"}, {"date": "17 Mar 2021", "title": "IT Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Erie Family Health Centers (Chicago, IL) in Feb 2021", "Interview Descriptions": "Had 4 interviews with leader of the department, HR, team and business folks. Overall theme of the interviews was why I wanted to work at Erie, and my background and skills. After 4 interviews that all come at  a rapid pace with positive feedback there was no  response. Followed up after a couple weeks and was assured they would get an update and again radio silence.", "Interview Questions": "What interests you at Erie.\ntechnical questions.\nManagement style."}, {"date": "24 Aug 2021", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Erie Family Health Centers (Chicago, IL) in Feb 2021", "Interview Descriptions": "You apply for the position  you are interested in.  You submit your resume. You wait for a call to interview. You provided hard copies of your resume. You go in for your interview and you interview with multiple people.", "Interview Questions": "Where do I see myself in 5 years. "}, {"date": "8 Sept 2020", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Erie Family Health Centers", "Interview Descriptions": "I was contacted through email for interview appointment. The day of the interview I was interviewed by 5 people. They all first introduced themselves and then proceeded to ask questions.", "Interview Questions": "What makes you a good candidate? \nHow do you react to hard situations?\nWhat experience is relevant to the position?"}, {"date": "23 Apr 2020", "title": "Medical Health Promotion Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Erie Family Health Centers (Chicago, IL) in Jan 2020", "Interview Descriptions": "I interviewed two times during a 6 month period for the same job. The first time was in front of a 2 person panel , the second time was in front of a 3 person panel. Both times I asked if I would receive an email or phone call indicating If I had been hired or not. Both times - I never received a phone call or email response. I understand no answer , is in itself an answer. But if I took 1 hr out of my day to come and interview 2 times ( each interview was about an hr) you guys can’t just say “ hey , we didn’t pick you- via email”", "Interview Questions": "So many repetitive questions regarding scenarios and your own experience. And everything is written down . "}, {"date": "28 Jan 2020", "title": "Nurse Care Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Erie Family Health Centers (Chicago, IL) in Dec 2019", "Interview Descriptions": "I accepted the job offer (email letter) and provided my present employer 2 weeks notice - in which Erie knew about. 1.5 weeks later after accepting job offer one of Erie's managers calls me and tells me that \"they decided to move to a different direction with the position\"", "Interview Questions": "What are your strengths / weaknesses "}], [{"date": "11 Feb 2020", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Erie Family Health Centers (Chicago, IL) in Oct 2019", "Interview Descriptions": "While the interview process was pleasant, the end result was not. Leadership was not present and forthcoming after the offer and the result was extremely damaging to me personally and professionally.", "Interview Questions": "N/A"}, {"date": "4 Aug 2019", "title": "Clinical Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Erie Family Health Centers in Apr 2019", "Interview Descriptions": "The interview process was expedient, I got a request for an interview a day after sending in an application. The interviewer was very friendly and asked why I was passionate about the position and what experience I brought to the table - pretty standard. There was a Spanish language proficiency part of the interview.", "Interview Questions": "What unique talents or skills do you have that you would bring to Erie Family Health and this department/position specifically?"}, {"date": "15 Apr 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Erie Family Health Centers (Chicago, IL) in Jan 2019", "Interview Descriptions": "Initial interview was phone interview. Then one week later an in-person interview with MA Team Lead and MA Trainer. The questions were to help the team learn my motivation and goals and how I would fit in with the team. I was able to ask questions on specific MA duties and expectations and type of training support.", "Interview Questions": "Why healthcare?"}, {"date": "9 Feb 2018", "title": "Care Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Erie Family Health Centers (Chicago, IL) in Feb 2018", "Interview Descriptions": "First conducted brief screening phone interview and was then contacted to set up an in-person interview in a short amount of time. Interview was conducted with a group/panel and lasted for about thirty minutes. Was asked general questions about behavioral characteristics and professional background or experience, as well as a few questions more specific to community health centers and knowledge of them.", "Interview Questions": "What is your general knowledge of disease prevention?"}, {"date": "22 Feb 2016", "title": "H-IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Erie Family Health Centers (Chicago, IL)", "Interview Descriptions": "Applied online. Application was followed up by a screening phone interview. This was followed by an in person interview where I met with the hiring manager and other members of the department. Was emailed the day after my in person interview to complete a backround check and drug test.", "Interview Questions": "Standard interview questions. Strenght and weaknesses, interests, who does working at an npo interests you."}, {"date": "27 Dec 2015", "title": "Health Promotion Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Erie Family Health Centers (Chicago, IL) in Jun 2015", "Interview Descriptions": "The department manager and my supervisor interviewed me. They called me to come in to one of the Erie clinics and have the interview at one of the conference rooms. The interview took an hour.", "Interview Questions": "When you have faced a problem, how did you resolve it?"}, {"date": "18 May 2015", "title": "Health Education Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Erie Family Health Centers", "Interview Descriptions": "It was fast but the hiring process can be very long. More than a month, you are expected to complete drug test and background check. And you might have to interview with the site director even after the department has made the decision.", "Interview Questions": "Weakness strength  and if you are applying for a bilingual position  be ready to answer some questions is Spanish"}, {"date": "1 May 2018", "title": "Clinical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Erie Family Health Centers (Evanston, IL) in Dec 2014", "Interview Descriptions": "I received a call from the site's operations director and had a quick phone interview on the spot in which she set up a date for a future face to face interview.  When I met with her she did a thorough interview and had me complete the paper application after offering me the job.", "Interview Questions": "N/A"}, {"date": "29 Apr 2014", "title": "RN Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Erie Family Health Centers", "Interview Descriptions": "Received interview over the phone and then face to face. Process took about 3-4 weeks.", "Interview Questions": "What is one of your weaknesses"}, {"date": "3 Jan 2012", "title": "Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Erie Family Health Centers (Chicago, IL) in Aug 2011", "Interview Descriptions": "Great interview experience. All of the interviewers were very nice and  interested in what I was saying, unfortunately they were looking for a very specific skill that I did not have. Excellent followup after the interview.", "Interview Questions": "Specifically, what pay are you looking for?"}]]