[[{"date": "24 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Jupiter Medical Center", "Interview Descriptions": "The interview process at Jupiter Medical Center was pleasant and straight forward. I would recommend working at this facility if you are a Registered Nurse wanting to gain a wealth of experience.", "Interview Questions": "The interview questions were typical and straight forward."}, {"date": "22 Feb 2023", "title": "RN Med/Surg Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Jupiter Medical Center (Jupiter, FL) in Dec 2022", "Interview Descriptions": "The first interview was horrible. The interviewer didn't even bother showing up and I found they sent me the wrong \"zoom\" link to the interview. So they wasted my time and effort. The second time I interviewed I was rushed through the interview after I disclosed that I had another job offer but was excited to interview with Jupiter since I heard great things about them. I heard from a reliable source that they basically blacklisted me and accused me of being \"Very rude\" to them which was a lie. I believe it was because I disclosed I had another job but I wanted to see what Jupiter was offering (pay, patient-to-nurse ratio, and benefit-wise) but the director/recruiter for Jupiter took that as being \"rude\" how unbelievable. Honestly, if you value your time don't bother with them. They weren't even willing to offer $37 for a nurse of 4 years with almost 4 years experience of Med-Surg and multiple other areas of nursing.", "Interview Questions": "Tell me about yourself, tell me a time where you had a difficult patient and how did you handle it, etc."}, {"date": "23 Oct 2022", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Jupiter Medical Center", "Interview Descriptions": "Process was longer than anticipated but easy. First step with HR/recruiter office. Second interview with team from JMCF. Both interviews via Teams. I appreciated the follow up phone call even though not selected.", "Interview Questions": "Basic questions related to the position."}, {"date": "22 Mar 2023", "title": "Inpatient Coder Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Jupiter Medical Center in Mar 2022", "Interview Descriptions": "The HR interviewer yawned three minutes into the virtual interview which made me feel very awkward then proceeded to let me know I should not be looking down while being interviewed by the hiring managers later on as a tip of advice . I found this to be very unprofessional.", "Interview Questions": "I was asked how many years of experience? Why did I choose this career and if I had any certifications."}, {"date": "25 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Jupiter Medical Center", "Interview Descriptions": "HR interview was pleasant and brief. They like being an independent hospital and so mentioning that in the interview helped start a conversation. I met with HR for the preliminary interview and then interviewed with the nursing manager on the unit", "Interview Questions": "What was a time where you had to work with a difficult coworker? "}, {"date": "19 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Jupiter Medical Center in May 2021", "Interview Descriptions": "The interview was a virtual process, it was during the pandemic. I initially spoke to the recruiter and then I was interviewed by the unit manager. The interview wasn't difficult. I had a chance to answer and ask questions.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "30 Mar 2021", "title": "CT Scan Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Jupiter Medical Center (Jupiter, FL) in Feb 2021", "Interview Descriptions": "Interviewed at a job fair for a brief interview and was later contacted and asked characteristic questions. We talked about my availability and strengths and weaknesses. A very smooth and quick interview.", "Interview Questions": "What do you do in your current life that shows how you would improve this department?"}, {"date": "23 Dec 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Jupiter Medical Center", "Interview Descriptions": "The interview was straightforward asking about availability and educational background. It was in the format of a group interview with about 4 people. They asked where I was interested in being placed and whether or not I had any medical experience.", "Interview Questions": "Have you had any medical experience and if so how will it help in your role as a volunteer? "}, {"date": "7 Mar 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jupiter Medical Center in Aug 2020", "Interview Descriptions": "Interviewed with supervisor. One week later interviewed with the manager. Basic previous job situational questions and how they were handled. A call was received no more than one week after the second interview.", "Interview Questions": "Did you ever have a challenging manager or supervisor?"}, {"date": "23 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Jupiter Medical Center", "Interview Descriptions": "About 25 minutes total, did it via video conference. Staff was very friendly and open to conversation and answering questions. They gave a lot of information on how they support new grads in the program.", "Interview Questions": "Why do you want to work at Jupiter Medical Center?"}], [{"date": "13 Oct 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Jupiter Medical Center (Jupiter, FL) in Mar 2020", "Interview Descriptions": "Interview with 3-4 Department Managers\r\nCNA Job fair (other CNA) waiting to be interviewed \r\nFill out paper work prior to \r\nAsk your own questions for yourself \r\n30 min interview process\r\nCall back to let you know if you have job offer", "Interview Questions": "Why do you want to work for JMC?"}, {"date": "18 Apr 2018", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Jupiter Medical Center (Palm Beach Gardens, FL)", "Interview Descriptions": "I spoke with a recruiter who asked me what I was looking for and set up an interview. It was a panel interview with the directors of each floor there. They asked why I would be a good fit, why I wanted to be a nurse, why I wanted to be a nurse there, and asked me to give them examples of a clinical experience and what I did in the situation. They were all professional and nice, but you have to sign a 3 year contract with them as a new grad, with a 10K penalty, which I was ultimately uncomfortable with. Unfortunately, because of that I had to decline the job they offered me.", "Interview Questions": "Tell us about a time where a patient was in a serious situation and what did you do to help?"}, {"date": "18 Jan 2017", "title": "Scheduling Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Jupiter Medical Center (Palm Beach, FL) in Jan 2017", "Interview Descriptions": "sat down with the manager and supervisor in testing center and was briefed on the basics, talked about the multiple computer programs, if i was able to type quickly, being comfortable with coming up to the supervisors and managers with any questions, etc.", "Interview Questions": "are you able to type using more than one hand"}, {"date": "26 Jun 2016", "title": "RT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jupiter Medical Center (Jupiter, FL)", "Interview Descriptions": "I applied online and someone reached out to be fairly quickly, I was called in for an in person interview with Managemnt and it was one on one. It was a little intimidating but it was fine. They ask qualification questions and situation or behavioral questions. I was hired on the spot.", "Interview Questions": "Tell us about yourself"}, {"date": "30 Nov 2015", "title": "RN ICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Jupiter Medical Center (Jupiter, FL) in Oct 2014", "Interview Descriptions": "Met with HR and the Director of ICU; had to do a drug screen which I do not approve of but it is part of the hiring process for the job; also had to submit to a background check", "Interview Questions": "years of experience\r\nspecialty areas"}, {"date": "1 Mar 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jupiter Medical Center (Jupiter, FL) in May 2012", "Interview Descriptions": "Online application got a call met with their contracted hiring people, who were alittle weird and no longer work there. Later met with the director of the unit that I would eventually work on.", "Interview Questions": "Experience"}]]