[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good Salary Structure", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Aug 2022", "job_title": "Coordinator- Training and Teacher Support in Mumbai", "duration": "N/A", "pros": "Travel allowance is granted on time.", "cons": "Varying salaries for the same position"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "20 Years of enabling and inspiring teachers !", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jun 2022", "job_title": "Coordinator in Bengaluru", "duration": "N/A", "pros": "The range of programmes and services that TTF offers school teachers is not matched by any other NGO. School leadership, coaching and mentoring, school well-being/social-emotional learning, inclusive education and curriculum development. The depth of one-on-one support of teachers too is unmatched.", "cons": "The only con is that there is 'let up' for improving one's practice! We have to keep enhancing our own standards."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Substandard Training", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 May 2022", "job_title": "Teacher Trainer in Bengaluru", "duration": "N/A", "pros": "You will be training teachers.\r\nNot inder too much pressure if you know your job.\r\nNot a boring desk job.", "cons": "Middle management is inefficient and partisan.\r\nLots of favouritism and petty office politics.\r\nSenior management is indifferent and oblivious to staff issues.\r\nMost training is bookish, may not be useful in a real classroom.\r\n Administration can be more efficient.\r\nNo career prospects."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "\"Work at The Teacher Foundation is not for the faint-hearted\" for sure!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Jan 2021", "job_title": "Anonymous Employee in Bengaluru", "duration": "N/A", "pros": "If you are someone who can keep your mouth shut and not share your opinion about the unhealthy practices in this organization, this is a good place to learn about working with schools. \r\n\r\nIf you can remain low profile, you can think of working here as a freelance trainer than a full-time trainer. This way you will still get to work with different kinds of schools when you work here.", "cons": "Like in a typical Indian Movie, The Director is the hero! If you outshine her as a trainer, the Operations and Admin people in this organization will make sure that you feel miserable about working there and eventually leave. The Director will not be directly involved in this harassment. She uses other people to do it for her.\r\n\r\nThe Director is well connected in education circles. She will use this clout to bad-mouth you if you cross her the wrong way, once you leave this company. During my time as an employee there, people used to talk about how she contacted similar organizations not to hire people who worked there when they wanted to leave.\r\n\r\nThey have no sensible long term marketing strategy in place. As a result, you will be pushed to make sales calls even if you are a trainer. They have no concept of using people they have hired for the purpose they have hired them for in the first place. \r\n\r\nThey do not have a hire and fire policy. If you think it is a good thing, you are wrong. They keep the wrong people so that they are loyal and not question the management.\r\n\r\nYou will not get a decent exit if you want to leave this company. They will play around with your experience and relieving letter. They will try not to give you your experience letter as much as possible, especially if you are leaving for a similar organization.\r\n\r\nThis is the most micro-managed organization you can work for in the Education NGO sector in India. You will feel like there is someone peeping at your computer screen all day. Forget taking initiative and independent decisions about your work if you join this company.\r\n\r\nThis company is a family-run business masquerading as an NGO. The Director's family members sit at the top executive and board levels in this NGO. They will create unnecessary issues for you at work if you are vocal about their unhealthy practices.\r\n\r\nTheir Admin Department has more say in everything than their Operations or Content or Training Department. The Admin Department promotes very trainer-unfriendly practices in this company, at the behest of the Director. For example, getting your travel and stay sorted with the Admin Department is a pain. If you openly voice your concerns about your travel or stay, the Admin Department will run a smear campaign against you in the company. There is an HR Department whose only work is organizing 'Secret Santa' in December!\r\n\r\nTheir talk about inclusion is all a load of baloney. If you come with a degree from a foreign university (Has to be from the USA or UK!) and can keep your mouth shut about what you do not agree with, you will be accepted quickly into the fold. They will also poke their nose into your very personal matters and make it a lunch table discussion when you are not around if you are seen as different. Their Admin Department leads this!\r\n\r\nThere may not be any scope for you to innovate in this company. Innovation is met with scorn unless it comes directly from the Director herself. Any academic discussion outside of meetings is usually made fun of by the seniors, especially their Admin Department. Their training content dates back to their founding days. Much of what they are pushing into the market today is the repackaged versions of their first set of workshops. Or they are ripped off from International Experts. For example, their ISELF is a direct rip off of CASEL's Framework. They did a pan-Indian Survey for a few months and called it research for their SEL framework. Imagine doing research on something as complex as SEL and coming up with a Framework in less than 3 years after getting teachers and students to fill up a few questionnaires - if you can understand why this is wrong, you can understand what level of innovation is possible for you in this company."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very Disappointing", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Jun 2014", "job_title": "Coordinator in Bengaluru", "duration": "N/A", "pros": "Growing organization with a large variery of clients..", "cons": "It is saddening however to see how the employees are treated. On an individual level the employees are treated like workers. There is a high level is mistrust and autocracy that goes on, where only the director is the face of all the work that happens and any other individuals work is merely a contribution to that. \r\nThey HR is rude and is constantly giving new rules to follow, to make matters worse, they have team viewer installed in all the computers and have someone watching each screen constantly to ensure everyone works. \r\nIts difficult to work here and have a sense of happiness in the work that one does…"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Transforming Teaching - Online", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Oct 2020", "job_title": "Senior Coordinator in Bengaluru", "duration": "N/A", "pros": "TTF has swiftly reached out to thousands of teachers and schools across India during the Pandemic - focussing on developing their pedagogical skills as well as their over all well-being.", "cons": "During these difficult times TTF has begun to work solely from home - so one misses the camaraderie of face-to-face discussions"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Work in the space of SEL", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Sept 2019", "job_title": "Coordinator in Bengaluru", "duration": "N/A", "pros": "Anybody who wants to work in the SEL should definitely come to TTF for the immense amount of work that has been done by the organisation, through ISELF and their other initiatives.", "cons": "Not the place for people who are looking for flexi working hours in a full-time employment."}]]