[[{"date": "8 Aug 2019", "title": "Case Manager (Multiple) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Behavioral Health", "Interview Descriptions": "First there was an in-person group interview, then a HireVue video interview that was shared with different departments, which then set up individual in person interviews. None of the positions that I interviewed for fit my needs/professional desires at the time.", "Interview Questions": "Why do you want the job?"}, {"date": "21 Aug 2019", "title": "Medical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Valley Behavioral Health (Millcreek, UT) in Aug 2019", "Interview Descriptions": "They do two interviews with you. Phase 1 and Phase 2. Phase one is a group interview, phase 2 is a more personal interview with your supervisor to which position you applied.", "Interview Questions": "If I would rather work with kids, homeless or substance abuse. "}, {"date": "10 Jun 2019", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Behavioral Health", "Interview Descriptions": "Group interview with 3 other applicants that were all applying for different jobs.  All of us were asked to share something about ourselves that wasn't on our resumes.  Then the two people doing the interviews proceeded to ask questions to each of us one at a time.", "Interview Questions": "If bills and money wasn't a factor why would you continue to come to work?"}, {"date": "17 Jun 2018", "title": "OFFICE SPECIALIST Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Jun 2018", "Interview Descriptions": "I get really nervous in interviews, but this interview was like I was meeting old friends. We did this exercise and met with the hiring manager, and she was really awesome.", "Interview Questions": "What did you get out of this exercise?"}, {"date": "24 May 2021", "title": "Medical Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Mar 2018", "Interview Descriptions": "It was a group interview with all applicants for various jobs. All hiring managers were in the room listening to their potential employee when it was there turn. We all went to our respective managers after and talked with them privately about our specific jobs.", "Interview Questions": "Why do you want to work for Valley Behavioral Health?\n"}, {"date": "18 Apr 2018", "title": "School Based Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Oct 2017", "Interview Descriptions": "I was hired by professional woman, who was responsive to my calls and questions. However, she was new to the position and wasn't able to train me or answer some questions properly.", "Interview Questions": "Why I wanted the job."}, {"date": "14 Nov 2017", "title": "Senior Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Oct 2017", "Interview Descriptions": "The best part of the interview process was meeting with the Chief of HR and the recruiting team.  They were exactly the type of people I want to work with.  The interview was comfortable and conversational, and they were also open to answering questions from me and telling about the company.", "Interview Questions": "What is your least favorite part of recruiting?"}, {"date": "17 Oct 2017", "title": "Staff Training and Development Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Aug 2017", "Interview Descriptions": "online interview via recorded webcast, then you attend a group interview with people for all different departments to see if HR recruiters like you, after that you attend the third round with the direct supervisor.", "Interview Questions": "how fun are you?\r\n\r\nWhat does management style not work for you?\r\n\r\nCan you delegate tasks?"}], [{"date": "14 Jun 2017", "title": "Business Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Jun 2017", "Interview Descriptions": "You have a group interview where it is you with a few other candidates, and then two of the recruiters. They only ask you 3-4 questions and don't give you much time to brag about yourself and show why you are qualified. They don't even know the positions that you applied for beforehand.", "Interview Questions": "Here are our company values, which one do you feel like you need to work on the most?"}, {"date": "10 Jul 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Feb 2017", "Interview Descriptions": "Group interview with team work, then invitation to do an interview video via hire vue, final interview with possible supervisors.  It was different from any interview process I've ever done, which made it more exciting when I was offered the position!", "Interview Questions": "What is you experience with domestic violence?"}, {"date": "27 Mar 2017", "title": "Family Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Feb 2017", "Interview Descriptions": "First interview was a group interview which was great had fun teambuilding exercises very interactive second one was WebCam very different experience I've never done anything like that before it's seem to streamline the process", "Interview Questions": "How I would handle a specific situation involving a client"}, {"date": "10 Jan 2017", "title": "Talent Acquisition/Human Resources Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "The position had been open for quite some time before I applied.  But when I did, they responded via email and it was within a few days of applying.  I had to schedule an interview online.  They had openings for the next 30+ days and I scheduled one that was about 10 days out due to the holiday break.  \r\n\r\nDuring this process, I should note, I had not talked to anyone.  I liked having the technology, but the personal touch was missing.  I set up my interview time and then prepared for the interview.  \r\n\r\nMy interview was scheduled for a Monday morning.  Less than three hours before my interview I received an email from someone at the company (they only provided their name, not their title) saying they had found their final candidate and that I was no longer being considered.  I never had the chance to interview with this company.", "Interview Questions": "N/A"}, {"date": "2 Apr 2017", "title": "Human Resources Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "The company calls in several candidates, applying for different positions, for a team building exercise and references.  If you are selected to continue with you will be asked to conduct a video interview using Hirevue.", "Interview Questions": "Asked about previous experience with benefits administration.  "}, {"date": "16 Sept 2016", "title": "Rehabilitation Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health", "Interview Descriptions": "The interview process was about 2 weeks. It involved a lot of classroom time learning about the values and policies. They also trained us on their computer system and introduced us to Slack ( their version of Facebook). On one of the days we took a tour to all the different valley locations which was interesting.", "Interview Questions": "Do you have experience with people with mental disabilities?"}, {"date": "16 Jun 2016", "title": "Autism Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valley Behavioral Health", "Interview Descriptions": "I was interviewed by a group of team members looking for an assistant for their classroom.  Everyone was kind and welcoming.  It was overwhelming walking into a room with 5 or 6 people interviewing me but they all made me feel calm and comfortable.", "Interview Questions": "Define reinforcement."}, {"date": "8 Jul 2017", "title": "CSW Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in May 2016", "Interview Descriptions": "With Vally you first start with a micro screening, where they have groups of people interviewing for different positions who do some type of activity, while the interviewers watch and observe. After the screening, people will approach you and ask you to come to their clinic for an interview. You will then go the clinic for an interview with a couple members of the team at that Unit. You will then possibly be asked to do another interview, one on one , with your direct supervisor. After this Valley's HR will call and offer you the job.", "Interview Questions": "Who is someone that you admire? "}, {"date": "28 Apr 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Mar 2016", "Interview Descriptions": "The interview was impersonal and competitive.  Sixteen people were interviewed at the same time, but all for different positions.  Most people sat like deer in the headlights.  Their was a team activity in which person was rated on how they interacted with the other members of the team.  Because some people saw this as a means to shine, they dominated the activity while others did not get a chance to help.", "Interview Questions": "They asked us to describe our strengths in three words"}, {"date": "9 Apr 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health in Apr 2014", "Interview Descriptions": "They called me and asked me to come in for an interview.  They did ask good questions.  I had to have the right education and license to work there.", "Interview Questions": "Normal questions"}], [{"date": "31 Jul 2015", "title": "SSW Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Salt Lake City, UT) in Sept 2013", "Interview Descriptions": "The interview was with two panel members. It was fairly pain free. The two members alternated questions to ask. The questions ranged from very general such as Why should we hire you for this position? Tell me a time when you encountered a stressful situation with a client how did you solve it.", "Interview Questions": "If you enter a home and find your client laying on the bed and reports to you they have not taken there medications for awhile. You also notice bed bugs all over the apartment what would you do?"}, {"date": "19 Feb 2013", "title": "Adult and Child Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Behavioral Health (Sugar House, UT)", "Interview Descriptions": "Applied on-line. Interviewed in person.", "Interview Questions": "N/A"}]]