[[{"date": "20 Nov 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Shenandoah University (Winchester, VA)", "Interview Descriptions": "The application process was not cumbersome at all . I was already an internal employee. I submitted a letter of  interest and received an email response. Followed by an  in person interview with the staff and the chair of communications.", "Interview Questions": "Why are you interested in teaching this particular course? "}, {"date": "21 Jun 2023", "title": "Student Affairs Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Shenandoah University in Sept 2020", "Interview Descriptions": "There were three interview panels. The interviewers made me feel comfortable. They wanted to know how I manage professional staff and ideas on professional development opportunities. The interviewers seemed like a big family that understood everyone's quirks and strengths. You could tell they want the best for their students.", "Interview Questions": "How do you deal with challenging situations in this political climate?"}, {"date": "28 Jan 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Shenandoah University", "Interview Descriptions": "The interview had multiple parts.  The behavioral interview was the first part of the process where the search committee members asked situational questions.  I then provided a guest lecture to a class.  And finally, I met with the VP of Academic Affairs.", "Interview Questions": "In the academic setting, you will encounter many different situations.  One example of a situation may be a student that is upset with a grade they have earned. How would you manage a difficulty or aggressive student? What experience do you have dealing with this particular situation, if any?"}, {"date": "4 Jun 2018", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shenandoah University", "Interview Descriptions": "The interview process was fairly straight forward. It consisted of a office tour, interview with the direct coworkers, a panel interview of the larger admission's office, and then an interview with the VP and director of admissions. I've included the weirdest question I was asked that seemed a little off.", "Interview Questions": "What kind of bird would you be and why?"}, {"date": "22 Jun 2018", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Shenandoah University in Dec 2017", "Interview Descriptions": "Very thorough phone interview with the whole team. I really liked that they called candidates to discuss why they weren't selected. The team were all positive and everyone seemed like they enjoyed their job. The interviewer even referred me to another job! I really like this university and definitely recommend applying.", "Interview Questions": "What do you know about Shenandoah University?"}, {"date": "21 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Shenandoah University (Winchester, VA) in Dec 2017", "Interview Descriptions": "Interview process is very lengthy and unnecessary.  It is in a group setting... asking the typical Q&A style questions one after the other. Very tiring. It helps tremendously if you were a student there or had a work study program in that department.", "Interview Questions": "Typical interview questions. Q&A style with multiple people throughout the day "}, {"date": "10 Feb 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Shenandoah University (Winchester, VA)", "Interview Descriptions": "I was called for a phone interview the day after I submitted my resume. I only answered a few questions about why I was looking a the position and a bit about my background. We promptly set up and in person interview. The in person interview took about 3 hours with the associate director, director and VP.", "Interview Questions": "How would you recruit?"}, {"date": "13 Feb 2016", "title": "Recruiting Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Shenandoah University in Oct 2015", "Interview Descriptions": "Phone interview at first. The next step was a day on campus, but I didn't make it that far. The interviewer was nice enough and fully described the position and then described the hiring process in detail. At the end of the call, she welcomed any follow-up questions via email and said she looked forward to the next step. After hearing more about the job, however, I was no longer interested, so I made no follow-up efforts. Subsequently I did not receive a job offer.", "Interview Questions": "Typical behavioral questions: describe a time when you disagreed with your supervisor, etc. "}, {"date": "9 Jan 2018", "title": "Lead Preschool Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Shenandoah University (Winchester, VA) in Feb 2014", "Interview Descriptions": "First, I interviewed with the Director and Assistant Director. Then they sent me to the SU campus and I interviewed with their boss. Then, we had to wait for background checks and drug screen to come back.", "Interview Questions": "Tell us about your experience in the classroom."}, {"date": "14 Jul 2016", "title": "Caterer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Shenandoah University (Winchester, VA) in Apr 2012", "Interview Descriptions": "i was called in for an interview with a few questions on experience with customer service and asked to set a table for different events.it was a little difficult as i was nervous but i pushed through. my manager was very kind throughout the whole interview.", "Interview Questions": "how would you handle dealing with a customer that  is rude and refuses to be served what you are offering because of your race?"}], [{"date": "25 Feb 2016", "title": "Visiting Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Shenandoah University in Apr 2012", "Interview Descriptions": "The interview was done over the phone, and was a fairly basic interview. Each person asked a question, gave you time to answer, and then moved on. I was honestly a little thrown off by the silence and panel's seeming disinterest in what I had to say, but I think this is more the culture of the area and not genuine.", "Interview Questions": "Beyond the basic questions that tailored a few to me specifically based on my experience, teaching philosophy, and academic background. "}, {"date": "30 Apr 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Shenandoah University (Winchester, VA) in Jan 2011", "Interview Descriptions": "First I initiated a phone call to department head. Then sent a letter requesting interview and interest. Then department head called me for one on one interview. Interview was about 45 minutes. Nothing available at the time, but after several months was called and I accepted the position.", "Interview Questions": "Asked about my background and college education."}]]