[[{"date": "2 Mar 2023", "title": "Proctor, Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Juilliard School in Feb 2023", "Interview Descriptions": "Applied to a part-time, seasonal role through the School’s career site, and was contacted within a week or so to schedule an interview.  Since this position was only needed for a short time, the interview process was not lengthy, and I received an offer within 48 hours.  Questions were generally geared towards why I was interested and what I could bring to the table.  Interviewer was very kind and professional, as were the other members of the Juillaird community that I interacted with during my time of employment. Great experience!", "Interview Questions": "What interested you about this role?"}, {"date": "30 Jan 2023", "title": "Director, Earned Revenue Strategy and Customer Engagement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Juilliard School (New York, NY) in Jan 2023", "Interview Descriptions": "Phone interview with recruiter (former Juilliard employee) to discuss my experience as it related to the position. I was told I would hear back within a week, but that never happened.", "Interview Questions": "Discuss my previous experience with non-profit organizations"}, {"date": "15 Dec 2022", "title": "Events Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Juilliard School (New York, NY)", "Interview Descriptions": "This was the most unprofessional interview process I have ever experienced. I don't think they were planning to hire anyone who applied, just string us along for months waiting and then completely ghosting. I am not a fan of this institution and they are part of many scandals, but the position was in education and community outreach and was something I aligned with greatly. I was very disappointed after feeling like the interview went well and I was a very good candidate to not even be told I was not selected.", "Interview Questions": "They asked me to provide a very detailed work sample that I received no feedback on and then was ghosted completely. I am pretty positive they used the interview to fish for free labor and creative ideas."}, {"date": "6 Dec 2022", "title": "Student Affairs Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Juilliard School", "Interview Descriptions": "Normal interview experience. Very welcoming and easy going. However, completely ghosted after second interview, regardless of multiple attempts to follow-up. Not a bad experience aside from that, just seemed a little unprofessional.", "Interview Questions": "Standard questions regarding the experience, a large chunk revolving around experience handling conflict resolution."}, {"date": "28 Oct 2022", "title": "Desktop Support Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Juilliard School", "Interview Descriptions": "The interview staff was extremely professional, friendly, and accommodating. They made me feel comfortable and thoroughly covered the job needs and expectations. The job environment and culture is fantastic. I would certainly recommend applying!", "Interview Questions": "We don't only want to know about you professionally - so what do you like to do on your free time?"}, {"date": "8 Jun 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Juilliard School in Apr 2022", "Interview Descriptions": "The interview itself was really nice. Great vibe, really positive experience. There was no HR involvement which I think really slowed down the process because the direct report was too bogged down with their job responsibilities to keep the hiring process moving along. I was then left on read with absolutely no updates for about two months. I followed up multiple times and received either a wishy washy response or no response at all. Finally was told an offer had been accepted by someone else. Pretty disappointed with how they handled the whole process post interview, which I had thought went really positively. Goes to show why HR departments need to be part of the hiring process to keep communication open and not leave people hanging for so long.", "Interview Questions": "Is there anything in the job description that sounds new or unfamiliar to you?"}, {"date": "24 Feb 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Juilliard School in Oct 2021", "Interview Descriptions": "It was a very casual interview, no difficult questions, it was basically to see if you were a good fit but in a very relaxed environment. There were 2 interviewers (both were part of the team), the questions were easy. The whole process was very nice.", "Interview Questions": "Why would you like to work here?"}, {"date": "8 Aug 2021", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Juilliard School", "Interview Descriptions": "I had a phone interview first and ultimately withdrew. If I had continued, I would have had a video conference interview, which was described as the final round of interview.", "Interview Questions": "Q: How much do you know about musical terms?"}, {"date": "15 Mar 2021", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Juilliard School (New York, NY) in Sept 2020", "Interview Descriptions": "It was held online has a remote interview, the interview was professional and friendly. I was asked a series of questions about my ability to handle the job requirements, and my personal interests.", "Interview Questions": "How did you solve a recent crisis?"}, {"date": "7 Oct 2019", "title": "Special Events and Artistic Programs Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Juilliard School", "Interview Descriptions": "The process took several weeks. After submitting my application, it took about a week and a half for them to get back to me. The interview process was easy and very laid-back. I felt quite comfortable. Most of it was them explaining the role to me fully.  I was asked to proofread a document there and was given two writing assignments to get back to them afterwards.", "Interview Questions": "Where do you see yourself in five years? "}], [{"date": "10 Apr 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Juilliard School in Feb 2019", "Interview Descriptions": "Applied online, received interview request after 4-5 weeks, had a phone interview and then a Skype interview a week later.  I never heard back after the Skype interview. Fairly easy  process and standard interview questions, but very strange timing and poor communication.", "Interview Questions": "Why are you interested in this position?"}, {"date": "8 Nov 2018", "title": "Graphic Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Juilliard School (New York, NY) in Aug 2018", "Interview Descriptions": "After phone screen  interview , I had on-site interview with my portfolio. \r\nI didn't get there offer. I selected 25ppl on phone interview and then, passed 7ppl for on-site interview. Still, they have VP interview.", "Interview Questions": "please describe your portfolio"}, {"date": "1 Sept 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Juilliard School (New York, NY)", "Interview Descriptions": "The interview was long and exhaustive, but the interviewers ( a panel of 3 senior administrators)  kept a very calm, casual attitude throughout. I was asked to perform a variety of simple administrative tasks (which was a fun experience actually). In any other scenario this would have freaked a candidate out, but the interviewers were so easy going that it was not that threatening. Overall a very positive interview experience", "Interview Questions": "To proofread a few documents "}, {"date": "11 Jul 2016", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Juilliard School (New York, NY)", "Interview Descriptions": "The interview process was pretty standard. I met with a panel of my future colleagues and one other staff member I wouldn't be working with. They asked the general questions asked during the interview such as the dreaded \"Tell me about yourself...\" Then they asked about my prior work and education experience in relation to the job I was interviewing for. Nothing really out of the ordinary.", "Interview Questions": "What is your greatest weakness?"}, {"date": "15 Aug 2016", "title": "Head Show Producer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Juilliard School (New York, NY) in Feb 2016", "Interview Descriptions": "Responded quickly to my resume.  Took me out to lunch, explained the position. Contacted my references. Asked interesting questions.  Detailed the benefits.  Seemed interested in my input and my contact with others at Julliard, too.", "Interview Questions": "How would you improve our product"}, {"date": "26 Dec 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Juilliard School (New York, NY)", "Interview Descriptions": "I was met at the elevator and walked to the office by the scheduling coordinator who was very nice. I was met by the Artistic Director and Administrative Director. We spoke in his office for a few minutes. They were interested in my experience at the Dance Theatre of Harlem, my dance experience and my interest in working for Juilliard. After speaking and sharing interests, I was asked to type a sample letter.", "Interview Questions": "What are you interested in."}]]