[[{"date": "11 Apr 2023", "title": "Billing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey) (Wyckoff, NJ)", "Interview Descriptions": "Easy interview process. Very nice management who were very comfortable to interview with. HR representative was wonderful and explained the entire process to me. I did end up accepting the position.", "Interview Questions": "How much experience? Salary range"}, {"date": "16 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Valley Health System (New Jersey) (Ridgewood, NJ) in Mar 2023", "Interview Descriptions": "They got back to me very quickly from the moment I applied to the job offer. I applied on a Friday and by Tuesday, I was scheduled for an interview", "Interview Questions": "How have you dealt with a difficult patient? How have you included the patient’s family in their care?"}, {"date": "14 Jan 2023", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Interview Process: The interview was mainly standard behavioral questions. It was low key. There were some scenario questions. The hospital is nice. Prepare scenario answers based off of your work experience.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "4 Jan 2023", "title": "Application Developer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Health System (New Jersey) in Dec 2022", "Interview Descriptions": "I applied for the Application Developer role and went thru the interview process which mostly consisted of behavioral and light technical questions. There were about 4 rounds: 1 - video call with a supervisor, 30 minutes, discuss the role 2 - video call with a team, discuss about your experience and skills 3 - video call with the hiring manager, behavioral questions 4 - HR call to discuss an offer. This is when things went downhill real quick. They gave an offer but it was for Application Analyst role, not Application Developer. It felt like a bait and switch. I had to decline it and move on.", "Interview Questions": "- have you used Informatica before? - have you ever worked with SOAP based API calls and parsed XML data? - do you know SQL? do you know how joins work?"}, {"date": "14 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "The first interview will be with the HR team, which will receive general questions. For example, why did you apply here? If it passes, you will see an interview with the unit manager for the second time. Interviews with unit managers are asked more in-depth questions.", "Interview Questions": "How Would You Deal With Someone Who’s Not Satisfied With Their Patient Care?"}, {"date": "21 Jan 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Very kind, I interviewed with many people and felt that the whole process was very welcoming and smooth. They are definitely thorough, but in a way that is very practical and easy to follow.", "Interview Questions": "tell us about a time you had a patient case that was very challenging and how you navigated that?"}, {"date": "8 Nov 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Valley Health System (New Jersey) reached out to me by email to set up a virtual interview with different team members.  After the interview they responded back to me by email.", "Interview Questions": "Where have you worked in the past"}, {"date": "6 Oct 2021", "title": "Billing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Nice interview process.  Hiring manager was easy to interview with, HR very personable and informative.  The job sounds busy but interesting and I hope to get another interview or a job offer.", "Interview Questions": "How did you deal with conflict in the workplace?"}, {"date": "15 Jun 2021", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "It was easy, very friendly staff everyone was welcoming and I met with 4 different people during my interview. They asked expected questions, about time management, leadership, and past work experiences.", "Interview Questions": "Leadership experiences and time management "}, {"date": "21 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Health System (New Jersey) (Newark, NJ)", "Interview Descriptions": "Interview was a group setting with people and a nurse manager. Questions were fairly average and was told I got the job about a few month later. Bring resume and cover letter and be expected to talk about your experience and skills you bring to the table.", "Interview Questions": "why do you want to work for valley?"}], [{"date": "14 Dec 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valley Health System (New Jersey) (Newark, NJ) in Feb 2020", "Interview Descriptions": "Interview with management and then a group interview with staff. Everyone is super nice and helpful. The interview is more of a guided conversation. Big hospital system with great facilities and new hospital being built.", "Interview Questions": "Tell me about yourself and experiences "}, {"date": "22 Oct 2019", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey) (Ridgewood, NY)", "Interview Descriptions": "Say in a room with over 100 other potential hires and waited 2 hours before finally being called into the interview. I was interviewing right next to others, which made the process very informal.", "Interview Questions": "Why do you want to work for Valley"}, {"date": "19 Feb 2020", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valley Health System (New Jersey) (Paramus, NJ) in Oct 2019", "Interview Descriptions": "I received an email and interviewed within 2 days of the email. My interview lasted about 45 minutes. I was scheduled to meet with 3 people total, only met with 1 person. I was told I would receive follow-up within a certain time frame, but have not heard anything.", "Interview Questions": "What are your current responsibilities as an HRBP?"}, {"date": "25 Apr 2019", "title": "Admini Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Interview with Supervisor then group interview with team members. Be prepared to answer a lot of questions regarding \"What would you do...Tell me a time when...?\" Otherwise the interview process is a lot of behavioral questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Jul 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Interview was a group setting with 6 people and 4 nurse managers. Questions were fairly average and was told i got the job about a month later.  Bring resume and cover letter and be expected to talk about your experience and skills you bring to the table", "Interview Questions": "What makes you a good team member"}, {"date": "5 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Valley Health System (New Jersey) (Ridgewood, NJ) in Dec 2017", "Interview Descriptions": "Interview with the department head. Resume Review and questions about the interview process. Overall very clean and easy questions. Very straight forward and no trick questions. If you meet the requirements posted you have a good chance of getting the job and internship.", "Interview Questions": "What classes and experiences do you have that would help you contribute to this department"}, {"date": "8 Nov 2017", "title": "Pct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Valley Health System (New Jersey) (Paramus, NJ) in Nov 2017", "Interview Descriptions": "It’s was fast and easy  , after they tell that they will call and tell the result of interview so no Ofer in day of interview . It takes some days to decide and make an ofer .", "Interview Questions": "Why I want to work in valley hospital ?"}, {"date": "27 Nov 2017", "title": "Pct Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Health System (New Jersey) (Paramus, NJ) in Nov 2017", "Interview Descriptions": "i was there 3 times and everything was fine , they keep tell me that can you came next time and it was 3 times and then no calls no emails ..................silents", "Interview Questions": "my background questions"}, {"date": "25 Jan 2017", "title": "Helpdesk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Valley Health System (New Jersey) (Ridgewood, NJ) in Jan 2017", "Interview Descriptions": "It was a great interview process. I was interview by 3 people, all of whom were very welcoming and not at all intimidating. The questions ranged from basic HelpDesk questions about troubleshooting to customer service questions.", "Interview Questions": "Have you ever had to deal with a difficult Client?"}, {"date": "18 Nov 2016", "title": "Clinical Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Hire quality, competent people and not just bodies to accommodate or fill shifts. Be consistent with progressive discipline for problematic and toxic employees (especially the ones who have gotten too comfortable and have been employed there for a while) and ensure that your infrastructure is current and up-to-date. Micro management can kill the overall workplace environment and morale. Not enough supervision in other areas of the department. Reevaluate or oust your incompetent supervisors and managers.", "Interview Questions": "When can you start?"}], [{"date": "30 Nov 2016", "title": "Housekeeper Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Valley Health System (New Jersey) (New York, NY) in Nov 2016", "Interview Descriptions": "I applied and a day later I was sent an email to take a skills assessment test. A day later, I received a call from a recruiter for an interview and scheduled it the following week. There were several people interviewing at the same time as me, they desperately needed 7 spots filled probably because of their high turnover rates. I applied for a full-time position ONLY and after they offered me the position they told me I would be working per diem(on-call). HIGHLY unprofessional and a complete waste of my time. They only had 2 full-time positions and the rest was all per diem, which they failed to mention. When I chatted with another interviewee he also applied for full-time but was given per diem. Ridiculous. No wonder they have a high turnover rate.", "Interview Questions": "Describe your past work experience\r\nWhat does two-way communication mean to you?"}, {"date": "21 Apr 2016", "title": "Business Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Health System (New Jersey) (Ridgewood, NJ)", "Interview Descriptions": "HR Rep and Manager both met with me. First, I met with the HR Rep who asked me the standard questions and what I wanted to do with the position. How would I learn from it and how my previous experiences would help me. I thought that it was very fair and the people I work with were very nice.", "Interview Questions": "Why are you interested in working for Valley? How do you demonstrate compassion for your coworkers and patients"}, {"date": "16 Aug 2016", "title": "Network Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Valley Health System (New Jersey) (Paramus, NJ) in Mar 2016", "Interview Descriptions": "The interview process took place in the operations manager office. It also included the ciso in the interview process.  They asked me questions on organizational skills, how I can work with people who have tight schedules, and whether or not I would be available during off hours.", "Interview Questions": "Pen test experience"}, {"date": "14 Aug 2015", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Interviews can go for 2 or 3 rounds of in-person meetings plus an initial phone interview. Peer and manager interviews are  common but their goal is to make sure you feel the right connection with the right group. I would say these are average to difficult but definitely worth the time and enough to get a feel of all the groups and department structure.", "Interview Questions": "Describe a day at work with us..."}, {"date": "18 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Valley Health System (New Jersey) (Ridgewood, NJ) in Mar 2015", "Interview Descriptions": "1. Initial HR interview\r\n2. Called back for panel department interview\r\n\r\nInitially contacted in January 2015 by HR recruiter. Met 1 on 1 with recruiter and was asked basic questions about education and experience. Received an email notifying me that I was selected to participate in panel interview with nurse managers. Panel interview took place in March 2015. Offered position in April 2015 and accepted.", "Interview Questions": "How do you deal with difficult patients/situations?"}, {"date": "11 Feb 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Applied online through hospital website. Received a phone call fairly quickly to set up an interview the next week. Also scheduled to take a pharmacology test the day of the interview (this is flexible).  Interviewed with nurse recruiter and then unit manager.", "Interview Questions": "Why do you want to work here? How do you handle stressful situations? Strengths/weaknesses. Nothing out of the blue."}, {"date": "16 Nov 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Valley Health System (New Jersey) in Jun 2013", "Interview Descriptions": "Just standard background check and had to get a TB test.  Originally applied online and then went in person to talk with the woman who coordinates all of the volunteer activities for the hospital.  Very friendly staff, and more of a behavioral interview process", "Interview Questions": "Why do you want to volunteer here?"}, {"date": "24 Jan 2013", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Valley Health System (New Jersey)", "Interview Descriptions": "Interviewed with Nurse Manager and Charge Nurse - went well", "Interview Questions": "N/A"}, {"date": "10 Jan 2013", "title": "Ultrasound Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Valley Health System (New Jersey) (Ridgewood, NJ) in Aug 2011", "Interview Descriptions": "A manager & staff will interview you.  You will be asked about the content on your resume & then you will be asked to scan.  This department is interested in individuals who are registered and can scan both general and vascular ultrasound exams.", "Interview Questions": "Name a time when you were presented with a conflict and how did you react. "}]]