[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Executive Team and Organisation Review at DCSS Australia Inc.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Jan 2020", "job_title": "Director in Melbourne", "duration": "N/A", "pros": "Over the past 5+ years that I have worked with DCSS Australia, the organisation has gone through a lot of achievements, Successes, Challenges and Hardship, it began with a very humble beggining and still is to this day. \r\n\r\nThe team continues to show it passion towards Community Services; Social Services; Social Justice; People as well as its values which is strongly embedded into all aspects of the organisation.\r\n\r\nThe organisation is now the leading and only dual-accredited organisation within New South Wales and Victoria working with the Victorian Department of Justice - Fines Victoria and NSW Revenue Department - Legal Aid to help vulnerable people with their infringement debts.\r\n\r\nDCSS Australia continues to push through all challenges that it faces with strong leadership and members who are passionate, compassionate, loyal, respectful and always treating everyone with Equality, Integrity and Honesty.", "cons": "Due to no strong source of income, there is no funding or money to have paid employees, however, everyone is treated the same as employees and engaged as Pro-Bono Employees (Volunteers) which means they operate like any other Business, Not-for-Profit and Charities across Australia, which means the team take their role very seriously and endeavours to deliver great results to the community and stakeholders."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A Learning Experience", "rating": "1.0", "reviewer_affiliation": "Former Intern", "job_date": "21 Oct 2020", "job_title": "Volunteer in Melbourne", "duration": "N/A", "pros": "Gave me the chance to learn as a volunteer a number of things about \"toxic\" corporate workplace culture and how that looks in the not-for-profit setting.", "cons": "Training provided is almost completely irrelevant to the actual role. Effective communication is limited, despite the number of app notifications and emails. Quite often it is difficult to know what is going on or what you are expected to do. Occasionally, lip service is paid to volunteers, but you get the sense that there is no true respect or appreciation. You're not even referred to as a volunteer most of the time, but as a \"pro bono employee\", which actually sums it up quite nicely - you are seen as an unpaid worker and treated as such. Letter of engagement says that\"you will not have reasonably predictable or regular hours of work, and may be required to work at any time of the week including late nights, weekends and public holidays to suit the Employer's operational requirements upon negotiation.\" Gives you a pretty good idea of how things stand. Organisations can virtue signal as much as they want but that doesn't mean they will actually treat people well. My advice would be to keep your head down, get some experience and then leave as soon as you can. The turnover and vacancy rate is high for a reason. Sorry to be so negative, but felt obligated to warn others."}]]