[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Promoting Boxing's Global Growth Amidst Governance Challenges", "rating": "4.0", "reviewer_affiliation": "Former Contractor, more than 1 year", "job_date": "12 Jul 2023", "job_title": "Communications Manager in Lausanne", "duration": "N/A", "pros": "Impactful Contribution: AIBA provides an opportunity to make a meaningful impact on the sport of boxing at a global level. By working for AIBA, you can actively contribute to the growth, development, and promotion of amateur boxing, fostering the talent of young boxers, and shaping the future of the sport. International Exposure: AIBA's global reach provides employees with the opportunity to work in an international environment, collaborating with professionals from different cultures and backgrounds. This exposure can broaden your horizons, enhance your intercultural skills, and expand your professional network. Professional Development: AIBA offers avenues for professional development and growth. Working in a dynamic and challenging environment, you can gain valuable experience, learn from experts in the field, and develop new skills that can benefit your career in sports administration, event management, athlete development, or other related areas.", "cons": "Governance Issues: AIBA has faced significant governance challenges, including allegations of corruption and mismanagement. These issues have led to the suspension of AIBA's recognition by the International Olympic Committee (IOC) and have negatively impacted the organization's reputation. Working in such an environment may involve navigating through ongoing governance and administrative difficulties. Uncertain Future: Due to the loss of Olympic recognition, AIBA's future is uncertain. The association's ability to regain its status and restore its position as the governing body for amateur boxing remains unclear. This uncertainty can impact job stability and prospects for career advancement within AIBA."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "NEVER work at AIBA, the World Series of Boxing or AIBA Pro Boxing...EVER!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 May 2014", "job_title": " in Lausanne", "duration": "N/A", "pros": "You will learn how to deal with volatile, egotistic and abusive senior management in a way that will serve you extremely well should you ever need to look for a job somewhere like the North Korean government. You will also learn how to watch your back, develop a skin thick enough to make a rhinoceros look like a pin up model for Nivea skin care,and to understand what a reign of terror and a failing organisation looks like from the inside. Perhaps more usefully you will also be able to compare job hunting strategies and CV's with the entire staff, and join a voluminous underground network of sympathetic ex-employees.  To other employers please note that the majority of mid-management level employees at AIBA are extremely hard-working, competent people. They will genuinely be improved as potential future members of your team for having been through the pressure cooker that is the International Boxing Association (AIBA).", "cons": "- 80% annual staff turnover.\r\n\r\n- Roughly 1/14 chance of being fired every month. (on average 1-2 members of staff leave or are fired every month)\r\n\r\n-A borderline psychopathic and ego-maniacal senior management team led by the most ruthless and incompetent CEO imaginable.\r\n\r\n- A culture of bullying\r\n\r\n-Creativity undervalued. \r\n\r\n- Some staff last less than three months. 75% last less than a year, only two or three members of staff have been in place more than 2 years.\r\n\r\n- There is no historical knowledge of the organisation internally (unsurprisingly). This can create problems.\r\n\r\n- The revolving door policy complicates project delivery.\r\n\r\n-Staff are under-paid\r\n-Bank holidays are not respected.\r\n-Holidays can only be taken in week long blocks - single/double days not allowed\r\n\r\n-No over-time is paid or compensation time is allowed for weekend or late night work.\r\n\r\n- For some staff, 16 hour+ days are expected between November and May. \r\n\r\n-One member of staff recently completed a 25 hour working day! Another member of staff was fired on the spot for contesting this situation.\r\n\r\n- They are planning to relocate. But no one knows where to, this is creating uncertainty. \r\n\r\n- AIBA is running out of key suppliers and partner organisations at an alarming rate owing to mismanagement of those relationships.\r\n\r\n- New staff are no longer arriving fast enough to replace those fired, meaning that existing employees are further stretched.\r\n\r\n-Two people have left in the last 6 months suffering from acute depression/nervous breakdowns\r\n\r\n-Staff and senior management have needed to be separated in the past as arguments became physical.\r\n\r\nMost surprisingly of all, insufficient care is given to the sport, the athletes or the Olympic values. This is highly demotivating. There is a lack of former athletes and boxers on staff (as they have all left), this undermines the required knowledge base. \r\n\r\nFinally, extreme caution should be exercised when accepting a role at AIBA. Any role is almost certainly not very secure, particularly if you are considering relocating from abroad. Careful study of Swiss prices (esp rent) should be examined before entering into salary negotiations as Switzerland is extremely expensive, and what may initially sound like a large income can in reality be insufficient."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Good Experience out of University", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Jun 2014", "job_title": "Event Manager in Lausanne", "duration": "N/A", "pros": "Colleagues are friendly. Traveling are interesting and give the opportunity to meet a lot of people.", "cons": "The high management is not very professional"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Interesting experience which I will use to define the type of jobs and organisations I DO NOT want to work for in future", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Sept 2013", "job_title": "Anonymous Employee in Lausanne", "duration": "N/A", "pros": "Excellent sport\r\nExciting opportunities\r\nGrowing fast\r\nNetworking with other IFs\r\nTravel", "cons": "Management structure, style\r\nLack of HR structure and policies\r\nFunding issues\r\nLack of expertise in critical areas\r\nLack of accountability\r\nNo job descriptions\r\nWorking environment"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Working at AIBA is like an Orwellian Parody", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Feb 2016", "job_title": "Coordinator in Lausanne", "duration": "N/A", "pros": "International status\r\n\r\nOlympic event organising experience\r\n\r\nMulti-cultral work force", "cons": "High Level Corruption (bribable)\r\n\r\nAthletes and economically weak sports federations systematically being ignored\r\n\r\nFlawed ideology\r\n\r\nPoor working enviroment\r\n\r\nLack of respect for staff free time"}], [], []]