[[{"date": "21 Jan 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Middlesex Health (Middletown, CT) in Jan 2023", "Interview Descriptions": "Panel interview with multiple team members. Thorough and thoughtful questions. Set clear expectations of what they were looking for. Very professional when setting up interview and good communication from recruiter afterwards.", "Interview Questions": "What communication style do you use?"}, {"date": "19 Aug 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Middlesex Health", "Interview Descriptions": "Drawn out over many months - multiple interviews with multiple people; some lasting hours . Never got a rejection notice so not sure if they ever hired for it.    Took up a lot of time with no resolution.", "Interview Questions": "How do you prioritize work?"}, {"date": "9 May 2022", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Middlesex Health", "Interview Descriptions": "The interview came off as very intimidating. There were many people sitting around a conference table and each had a packet of about 20 questions to bombard you with. Some questions were worded to trick you.", "Interview Questions": "Give an example of when you had conflict with a previous manager."}, {"date": "21 Jan 2020", "title": "Hospitalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middlesex Health in Dec 2019", "Interview Descriptions": "panel interview, laid back, three hospitalist, one recruiter consist of team. straightforward general interview questions. Mainly, they wanted to know how many patients we handled and past experience dealing with  different variety of cases. All lasted for 4 hrs.", "Interview Questions": "how many pts we handled "}, {"date": "5 Apr 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Middlesex Health (Middletown, CT) in Feb 2019", "Interview Descriptions": "While it took a VERY long time to get picked for the interview process, and many applications, it was all very easy and fluent once the interview came and the offer followed within a timely manner", "Interview Questions": "How do you handle disgruntled patients? "}, {"date": "24 Nov 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Middlesex Health (Middletown, CT) in Mar 2018", "Interview Descriptions": "Basic questions \r\nWhy do you want to work for us \r\nWhat do you expect from us \r\nOther basic question as to your work history and what did you do in a difficult situation and how did you handle it \r\nWhat do you like to do in spare time", "Interview Questions": "What do you expect from us "}, {"date": "15 Nov 2017", "title": "Hospital Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Middlesex Health (Marlborough, CT) in Nov 2017", "Interview Descriptions": "Applied and got a response in 3 weeks. Initial interview was with lead rep in department at clinic and second interview was with manager at clinic. Very helpful at answering my questions and definently would recommend to friends.", "Interview Questions": "What was one time that you went beyond the call of duty?"}, {"date": "19 Aug 2017", "title": "Population Health Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Middlesex Health (Middletown, CT) in Jul 2017", "Interview Descriptions": "I interviewed with two current employees and both were extremely friendly and professional. I had interned with the hospital and applied for a full time position. I very much enjoyed my time there and learned a lot from the people that I was working with.", "Interview Questions": "What can you contribute to this position?"}, {"date": "7 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Middlesex Health (Middletown, CT) in Jun 2016", "Interview Descriptions": "I used the hospital's website to apply for a staff nurse position at the main hospital and got a call from the hiring manager the same day.  She explained what the position was, what she was looking for in candidates, and asked me about myself, and then invited me in for an interview that week.  I was very pleased that I did not have to go through a recruiter or someone in HR first, as many hospitals have job candidates do.  It showed that the manager had respect for me as both a professional and a human being, which is contrary how many other organizations treat prospective employees with pointless phone interviews and personality tests.  \r\n\r\nI met the manager in the lobby for my interview and she walked me to her office, where I met with another manager and a nurse educator.  The interview felt very friendly and it had an informal tone. I immediately liked the manager's warm demeanor.  There were some typical back and forth, run of the mill \"Describe a situation where you had to  ____\" type questions mixed in with idle chit chat here and there.  After about 45 minutes of that, I was asked if I would like to shadow another nurse for a couple hours the next day, which I did.  The manager met me again and showed enthusiasm for me working there.  I was contacted the next day with the offer.", "Interview Questions": "They asked about my experience. They also asked why I was interested in a change, instead of the oft asked, rude question of \"What don't you like about where you work?\""}], [{"date": "27 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Middlesex Health (Middletown, CT) in Mar 2015", "Interview Descriptions": "The nurse manager brought me in for a one-to-one interview, gave me a tour of the unit and then told me to call her if I was interested in \"the next step\", which turned out to be shadowing on the unit for two hours and a panel interview with four other members of the team. I was really nervous for the panel, but they were really nice. I got a call back that afternoon and I haven't regretted my decision.", "Interview Questions": "Why do I want to work on that specific unit, what life experiences have I had that I can bring to the job, what do I do for self-care."}, {"date": "10 Jul 2017", "title": "Hospital Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middlesex Health (Middletown, CT) in Mar 2015", "Interview Descriptions": "it took a while to get an interview about a month.  I had a phone interview first Then I had one interview with the lead then one with the manager.  Keep in mind they can see everything you have applied for within the organization.", "Interview Questions": "Why did you apply for a full time position in another department but a part time decision within this department?  Do you know what you want?  "}, {"date": "14 Jan 2014", "title": "Nurse Residency RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Middlesex Health (Middletown, CT) in Mar 2010", "Interview Descriptions": "I was going to school out of state when I applied.  Applied online, was called to set up a phone interview.  Interviewed with a large panel of about 6-8 people including HR, Nurse residency director, ED Nurse manager etc.  Was asked some basic interview questions- strengths/weaknesses, etc,", "Interview Questions": "Had to describe a time i had a difficult interaction with a patient or staff."}, {"date": "5 Oct 2013", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Middlesex Health (Middletown, CT) in May 2009", "Interview Descriptions": "They found my resume on a job site and contacted me. I had a phone interview and one on site. On site I was introduced to several members of the staff and management. The process did not take long and I found them professional and out going. (This was several years ago and I have heard that management has changed)", "Interview Questions": "Desired salary?"}]]