[[{"date": "7 Jun 2023", "title": "Writing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Road Scholar in May 2023", "Interview Descriptions": "I initially applied for the position and got a generic rejection email about a week later, saying the position had been filled. Then, shortly after that, I got an email from someone in their HR department saying that the candidate had fallen through and they were interested in speaking with me. I almost missed the email because that is highly unusual to send out rejections only to have to rescind them. Nevertheless, I spoke with the HR person a few days later, and she then said that she would like me to speak to the hiring manager. I interviewed with the hiring manager for about 45 mins about a week later. It was a fine conversation, and the interview questions were fairly standard. The hiring manager then said that she would like to move me to the writing assignment round and would send me the prompts by the end of the day. This is where the interview process went sour for me. I was sent the prompts as promised on a Monday afternoon, and she requested that I return the completed project by Wednesday. First of all, the prompt had a typo in it, which was confusing enough that I needed to follow up on it. This put me in an awkward position to have to call out my potential new supervisor. Second, the deadline absolutely did not fit with my schedule. I had a full day of meetings the next day and two sick kids at home. I have seen other employers ask candidates to give a 48-hour window that aligns with their schedule, and I find this to be both considerate and equitable. I sent in my completed assignment by the deadline, knowing it wasn't my best work, but it was all I could do given the time constraints. I never heard a word back from the hiring manager. Not even a thank you for completing the assignment. After two weeks, I received the same generic rejection email I had received in the beginning. The best part... there was a typo in the rejection letter! I found this to be in such poor taste. As a hiring manager, you should always connect directly with people who you have brought this far into the interview process. I can handle rejection, and I also know that I probably could've done a better writing assignment, but receiving a poorly written generic email is a pathetic way to treat candidates. In the Glassdoor reviews, someone mentioned, \"If you see red flags in the interview process, pay attention.\" The Glassdoor reviews were so bad from employees I almost didn't move forward in the search, and now I wish I hadn't. The one positive thing I will say is that I appreciated how swiftly they moved during the interview stage. You knew by the end of the conversation where you stood.", "Interview Questions": "Standard questions about experience and why your interest in position"}, {"date": "11 Apr 2023", "title": "Technical Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Road Scholar (Washington, DC) in Apr 2023", "Interview Descriptions": "First was reached out to by a recruiter who was assertive and supportive through the interview process. My resume was submitted and an interview scheduled. There was a miscommunication on timing so I was 30 minutes early and had to jump back on when the manager was available which started a bit off on the wrong foot but the hiring manager was very kind and clearly knowledgeable. She asked intense questions as she knows what she’s looking for and was honestly beyond my level of technical knowledge so I didn’t receive a second interview. I reached out two days later to the recruiter and was told I wouldn’t be moving forward.", "Interview Questions": "Tell me a time you found a technical issue in a business process and how did you solve it."}, {"date": "28 Feb 2023", "title": "Program Operations Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Road Scholar", "Interview Descriptions": "Straight forward process - I was contacted by a recruiter within a few days of submitting an application. Completed a 20min call with the recruiter who outlined the position responsibilities and asked me a few questions about my experience. She also outlined the compensation range which seemed relatively low, and stated there would be no room for negotiation (not sure if that's true or not). I was then scheduled for a panel interview with four people. Everyone seemed really genuine and down to earth, and there weren't any curveball questions. A week after the interview, I received an email from the recruiter who said the team thought the interview went really well and asked how I was feeling about the position. I replied letting her know that I, too, felt it went really well but despite this, I ended up receiving a rejection email about two weeks later. That was disappointing, but I had gotten the sense in the interview that the team may have felt I was a bit overqualified for the role, so that's my best guess as to why it didn't work out. Overall, it seemed like a strong team that really valued work/life balance, so I would still encourage others to apply!", "Interview Questions": "Why are you interested in this position?"}, {"date": "9 Feb 2023", "title": "HR Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Road Scholar in Jan 2023", "Interview Descriptions": "The recruiter didn't call me at our scheduled time. After reaching out, we rescheduled to a different day, and I gave them the benefit of the doubt. They then called me on the wrong day. Finally, on the day of the rescheduled interview, I was called half an hour late with no warning. The recruiter rambled on about the company and position for much of the 30 minutes, barely allowing me to get a word in.", "Interview Questions": "What are your salary expectations?"}, {"date": "23 Aug 2022", "title": "Community Engagement Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Road Scholar", "Interview Descriptions": "The interview process was very smooth. I felt very comfortable during the entire interview. Road Scholar has very responsive and friendly employees. Easy communication. They were very flexible with scheduling.", "Interview Questions": "Q: What would you define a community as in your own terms?"}, {"date": "10 Feb 2022", "title": "Call Center Agent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Road Scholar", "Interview Descriptions": "Disinterested manager.  I had more travel experience, including management experience, they did:  18 years both on an off the phone.  Heard after that Road Scholar does two things, which revolted me:  You have to high-pressure solicit (read:  beg) paying travelers on the phone for donations, and your calls are counted, and monitored, like you are a child.  Hence, micromanagement.", "Interview Questions": "They asked me nothing.  The manager went into the interview with preconceived notions...each one incorrect. "}, {"date": "26 Jan 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Road Scholar (Lowell, MA) in Jan 2020", "Interview Descriptions": "One hour spent reviewing my background and explaining the job.  Time spent listening in on actual calls. Introduction to managerial staff. Detailed explanations on my part about my responsibilities at previous jobs.", "Interview Questions": "Whether I had the mental stamina to do the job"}, {"date": "3 Jan 2020", "title": "Program Services Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Road Scholar (Boston, MA) in Dec 2019", "Interview Descriptions": "I applied online and was contacted for a brief phone screening followed by a phone interview and 12 page editing exercise. Next, I was asked to come in for an in person interview. On the day of the interview I was told that one out of the three people I was scheduled to meet with had called in sick and the interview would need to be rescheduled for later in the week. I was unable to come to Boston for a second time as I was coming from an hour and a half away and the interview was set to take place the week before Christmas, but suggested a video interview instead. I was told that someone would get back to me with a response as to whether this was a possibility. A week later I had not heard back and followed up, but was informed that the company had continued  interviews and selected another candidate.  I understand that companies often need to hire quickly, but would have appreciated the consideration of a response to my offer of a video interview after being told a response would be given. I wish they had approached the process with more consideration and professionalism after I had shown my commitment to the process through my completion of the previous required steps.", "Interview Questions": "Tell us about your writing experience."}, {"date": "19 Aug 2017", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Road Scholar (Lowell, MA)", "Interview Descriptions": "This was approximatly 10years ago. Applications are ONLINE ONLY. Applied in February.  Recieved an email with interview details in early April. Panel of 2-3 supervisors.  Asked several questions relating to my background in handling customer satisfaction, difficult customers, and problem solving.  Was given opportunity to \"sit with someone\" for about 15-20 minutes before leaving.  I was able to listen on a separate handset to an advisor recieving typical calls from customers.  This turned out to be accurate sampling of generic calls I recieved while working position.  I was accepted to position within 1 week of the interview.  I began preliminary training approximately 2 weeks later.  On the floor working the position within 5 weeks of the interview.", "Interview Questions": "If money were no object, would you go to school & what would you study?"}, {"date": "18 Sept 2017", "title": "Administrative Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Road Scholar (Boston, MA) in Jul 2017", "Interview Descriptions": "Had a 30 minute phone interview with the Talent Acquisition Manager. A few days later they asked me to come in for an in person interview with the hiring managers. I interviewed with the current Administrative Manager and the Vice President, Organizational Development & Human Resources. The all asked me several questions. The interview lasted about 1 1/2 hours. I left very confident and hoped I would hear back for a second interview to meet with the CEO. No one ever returned my emails.", "Interview Questions": "Why did you apply for the position?"}], [{"date": "28 Sept 2017", "title": "Participant Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Road Scholar (Lowell, MA) in Jul 2017", "Interview Descriptions": "I sat down with not one, but two members of upper management and was asked a lot of the \"basics\" - what do you know about Road Scholar, why do you want to work here, what have you heard about us, etc. They also showed specific interest in what some of my interests are and let me talk at length about my own hobbies and pursuits, as well as my prior job experience, and what I was looking for in an employer. They are looking for people who are educated, want to be educated, love the idea of learning and have strong customer service skills. They want people who want to excel in their given position and put their best foot forward. Like any office job, they expect you to perform to your best ability, so be honest and forthright about your positive traits and show them you have the room to grow if you have anything negative to say about yourself. Come prepared! Rehearse your interview style! You'll do great.", "Interview Questions": "I wasn't asked any questions I couldn't answer."}, {"date": "12 Jun 2017", "title": "Contact Center Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Road Scholar (Boston, MA)", "Interview Descriptions": "During the interview the senior management that interviews me was really very aggressive and throwing out certain situations which didn't really make sense looking back. They never gave me a chance to properly answer and before going into the next question. But then I met with a supervisor that was very nice. They also had you shadow someone to make sure you could do the job properly.", "Interview Questions": "What book did you read recently? "}, {"date": "26 Aug 2016", "title": "Contact Center Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Road Scholar (Beaverton, OR) in Aug 2016", "Interview Descriptions": "I applied online and within 2 days heard back from an HR person in their Boston office. We scheduled a 5-minute phone interview where she asked basic questions about my interest in the company, my salary expectations and my experience. The following week I had an in-person interview with two people where they told me a lot about the company and asked about me, my experience and my interests. I had a great time in the interview and really felt like they were trying to get to know me in an honest way to see if my personality would be a good fit for the company. I never felt like I was being tricked into answering in a particular way which was really refreshing! I had a 15-minute phone call with their sales director a few days later and a couple days later I was hired.", "Interview Questions": "What sets you apart from others?"}, {"date": "27 Sept 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Road Scholar (Boston, MA) in Aug 2016", "Interview Descriptions": "I originally applied for a call center position, then HR called me back asking whether I was interested in the program assistant position instead. I said yes, and they called me in for an interview that week.\r\n\r\nHowever, after what I thought was a great interview with 6 different people, I never heard anything ever again. Very poor form considering that I gave up my time and spent money attending the interview to not even get a 'no thank you'.", "Interview Questions": "Why Road Scholar?"}, {"date": "1 Mar 2019", "title": "Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Road Scholar (Lowell, MA) in Aug 2016", "Interview Descriptions": "Basic personal and work ethic questions. Asked about work experience and if I could sit in one place all day. Also asked about person to person skills and problem solving ability along with other basic stuff", "Interview Questions": "Can you talk on the phone all day"}, {"date": "4 Aug 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Road Scholar (Boston, MA) in Jan 2016", "Interview Descriptions": "I was called and asked a few questons. I waited a week and was asked to come in to the office. The actual interview was awkward. Two managers sat across from me and didn't really seem to know what to say. Unbeknownst to me, the women who asked zero questions was the person who would be my manager. It lasted around 20 minutes. They then told me they wanted me to meet someone. I waited for another 20 minutes and an employee walked in who didn't seem to understand why they asked him to meet me.", "Interview Questions": "How do you think your skills and experience will contribute to the Road Scholar team?"}, {"date": "26 Nov 2014", "title": "Operations Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Road Scholar (Clackamas, OR)", "Interview Descriptions": "I was not hired, but made it 2/3 of the way through the hiring process. It was pretty straight forward. First, you are contacted via human resources in Boston, but if they like you, you are contacted by the local office in Clackamas (NOT Portland proper). The questions were pre-per-paired, and each office person asks you one in a sort of round-table.", "Interview Questions": "none, all what you would expect. The interview is with the entire office though."}, {"date": "5 Jun 2014", "title": "Travel Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Road Scholar", "Interview Descriptions": "Applied via Craiglist, went in for an interview, they show you what the job is by listening in on an advisor. Then called back, got an offer, accepted. Good, honest people doing the interview. No trickery of any sort.", "Interview Questions": "Really were none. Standard questions. They just want to know you're personable and normal and sane."}, {"date": "25 May 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Road Scholar (Boston, MA) in Mar 2014", "Interview Descriptions": "Easy interview. Mostly resume and behavioral questions with a question about the company itself and what they do. They got back to me in 2-3 weeks after they asked for reference and checked with them.", "Interview Questions": "1. What is Road Scholar? 2. Why do you want to work here? 3. What can you offer to the team?"}, {"date": "26 Jan 2014", "title": "Call Center Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Road Scholar", "Interview Descriptions": "The position is always on Craigslist or on their website. Hiring process is quick.  You send email, if HR likes your resume asks for your salary range. They do not let you negotiate all individuals start at the same rate. You go in for an interview, lengthy sit with somebody then they called and made an offer after 3 days.", "Interview Questions": "N/A"}], [{"date": "8 Nov 2013", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Road Scholar (Boston, MA)", "Interview Descriptions": "2 interviews, first was one-on-one, second was with a group of 3.", "Interview Questions": "No difficult questions. Personality and fit with in the culture seemed to be valued more than expertise in skills."}, {"date": "27 Apr 2013", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at Road Scholar", "Interview Descriptions": "This process was tedious because as a former business owner the company refused to accept any references from my clients. They would only accept references from people I had worked with in a typical job setting as an employee. It was very insulting that they considered my decade plus experiences as a business owner worthless.", "Interview Questions": "N/A"}, {"date": "24 May 2010", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Road Scholar (Boston, MA) in Mar 2010", "Interview Descriptions": "Found the job description online and applied directly on the website. Got back the response and was soon called in for an interview. The manager was very nice and asked basic questions etc. good experience and industry overall.", "Interview Questions": "Why (your major)?"}]]