[[{"date": "27 Jun 2022", "title": "Assistant Visiting Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Haverford College", "Interview Descriptions": "Interviews with chair and several faculty members, students also attended lecture. Straight forward and fair questions all around. Ultimately I declined the position because the base salary offered was almost as low as a doctoral students wage.  There was also no negotiation after I gave them my initial terms.", "Interview Questions": "What type of courses would you like to teach?"}, {"date": "16 Mar 2022", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Haverford College (Philadelphia, PA) in Feb 2022", "Interview Descriptions": "I had a good experience. The interviewers asked me a few questions and there were discussions on how the education program can be improved. I had the opportunity to ask several questions.", "Interview Questions": "Questions related to how I would teach a class, how many classes I would be able to teach in a semester, how I would deal with specific situations, etc."}, {"date": "25 Jan 2022", "title": "Media Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Haverford College (Haverford, PA) in Sept 2021", "Interview Descriptions": "Very smooth. The interviewer is clear about what he wants and I provide as detailed answers as possible. It is a part time job in college so the stake is not that high.", "Interview Questions": "What previous  experience do you have with media production before coming here?"}, {"date": "15 Apr 2022", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Haverford College (Haverford, PA) in Feb 2021", "Interview Descriptions": "There were 2 rounds of interviews. 1st round was with the hiring manager. 2nd round was with development team. Between the interview rounds the hiring manager contacted my references. Once that was completed an offer was made via email.", "Interview Questions": "Interview questions were related to my background. Interview questions with the software team were mostly overviewing the software I would be working with and providing questions based on my previous experience."}, {"date": "19 Feb 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Haverford College", "Interview Descriptions": "Interested Students send an email to their instructor and they hear back in a couple weeks and then successful candidates are offered a brief interview of about 10 to 15 mins", "Interview Questions": "Why did you apply for this position"}, {"date": "8 Aug 2018", "title": "Post-Bac Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Haverford College", "Interview Descriptions": "First was phone interview, and then in-person interview that was half-day long with different committees. The in-person interview is long and you meet a bunch of people in and outside the office you will be working at. But the phone interview is just with the hiring committee.", "Interview Questions": "Describe your experience working on a difficult project collaborating with others"}, {"date": "16 May 2018", "title": "International Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Haverford College in Apr 2017", "Interview Descriptions": "its very casual. It was also very rewith only three interviewers. Theydidn't seem like they expected me to know everything at that moment, it was more of a learning interview. i talked about life in school and home.", "Interview Questions": "why I want the job"}, {"date": "7 Feb 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Haverford College", "Interview Descriptions": "The hiring process was very relaxed and unofficial. There wasn't much consistency in whether a job interviewed or not. The interview was not very difficult at all and did not require much preparation time.", "Interview Questions": "What is your availability?"}, {"date": "18 Mar 2014", "title": "Student Library Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Haverford College", "Interview Descriptions": "Filled out an application and left it at the circulation desk. Questions were pretty standard, mostly gauging experience and interests. Then they tried to fit you with the best position for you, and had an interview to get to know you better.", "Interview Questions": "They're generally LOOKING to hire you, so most questions were just to see how you would be as a coworker."}, {"date": "22 Jan 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Haverford College", "Interview Descriptions": "Initial communication took place via phone. Then I came in for an interview and met with 3 different groups - the deans I would be working with, folks from Campus Safety, and a group of students. Then I took a tour of the campus.", "Interview Questions": "There weren't any questions out of the ordinary, really."}]]