[[{"date": "7 Apr 2023", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at International Republican Institute", "Interview Descriptions": "Casual with straightforward questions about experiences and strengths. Be prepared to discuss organizations you have been involved in. Additionally, be prepared to discuss why you are interested in working in foreign policy/advocacy.", "Interview Questions": "Tell us about a time that you had to balance a number of different project. How were you able to handle it?"}, {"date": "25 Nov 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at International Republican Institute", "Interview Descriptions": "The interview process was very quite negative as they asked for references (I was told it was a two page document to fill-out) and I was asked me to do a writing assignment before my first official interview. I was not given any decision after my first interview, and it felt like the HR was just lazy and was not considerate of others times. The interview was really boring, nobody seem to be prepared to ask questions and it was very uncomfortable for that reason", "Interview Questions": "Tell me about yourself? What do you think about the political climate in specific regions?"}, {"date": "9 May 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at International Republican Institute", "Interview Descriptions": "Extremely friendly, very informative, and be prepared to ask relevant questions. Each interview will be different depending on the division, but the enthusiasm for world development within each person was evident. The drive for change and passion for democratization is present in the company.", "Interview Questions": "Explain my relevant experience?\r\nWhy do you want to work here?"}, {"date": "22 Aug 2022", "title": "External Affairs Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Republican Institute (Washington, DC) in Apr 2022", "Interview Descriptions": "The interview process goes over your experiences and how you could contribute to the work at the organization. The team is unbelievable nice, funny, and welcoming. Basically asks you what have you done so far in terms of writing, Microsoft suite, any use of CRMs. If you don’t have much experience don’t worry they are open to training you.", "Interview Questions": "Tell me about yourself? Tell me of a time you failed?"}, {"date": "16 May 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at International Republican Institute (Washington, DC) in Apr 2022", "Interview Descriptions": "Standard 1st round interview with basic interview questions. I was told I passed to the second round but never received an invite. I tried contacting the interviewer multiple times but never received a response. Months later, I got an email saying the position was filled. Disappointing process with zero feedback. I had multiple referrals, and my background was perfect for the position, but I guess someone else was just a better fit. I would have liked to at least get a chance to conduct a second interview or get replied to my emails.", "Interview Questions": "Why do you want to pursue a career with IRI?"}, {"date": "29 Mar 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute", "Interview Descriptions": "They send me email to set up a time for a phone screen.\r\n1st Round interview (HR phone screen)\r\nTakes them about two weeks to selected the candidates for the second round interview.", "Interview Questions": "Tell me about yourself.\r\nTell me a time you fail.\r\nAsk about work experience and day-to-day work."}, {"date": "10 Mar 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at International Republican Institute", "Interview Descriptions": "I had a short screening interview that went well. The person I talked to was friendly and it was not a high pressure interview. She said she would be in touch within the next week, and soon sent me an email to schedule a follow up interview (the real 1st interview). I replied within a few minutes, confirming the time she'd suggested. When I showed up to the (virtual) interview the following week, nobody was there. I emailed her, and she said that they hadn't heard back from me and had already hired someone. Rude and unprofessional, but as this was a backup option for me it ended up making no difference.", "Interview Questions": "It was general background information."}, {"date": "12 Apr 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute (Washington, DC) in Feb 2022", "Interview Descriptions": "Interview process was short. You can tell the panel interview asks standard questions about program management and general business development planning and programming. The interview was about an hour long with a panel of program staff and then leadership of the latin america office.", "Interview Questions": "Describe a time when you worked with a diverse group of peers?"}, {"date": "20 Jan 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute", "Interview Descriptions": "I interviewed with an associate and then with the two members on the region specific team. The first interview was over the phone and the second interview was over a video call. The interview was straightforward and conversational - get to know you and your experience (educational and professional) and how it relates to the region.", "Interview Questions": "Tell me about yourself\r\nWhat type of experience, projects, or research have you done that is relevant to this region?"}, {"date": "13 Jan 2022", "title": "Program Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at International Republican Institute", "Interview Descriptions": "I applied online and heard back after about two weeks. The first interview was a phone screener with a recruiter, which was very straightforward. A few days later I was contacted for a panel interview with four people from the country team I would've been working on. They had specific questions about my work style, experience, et cetera. A week afterwards I had an interview with the hiring manager, who shared his specific vision for the role. A week later I had my final interview with the associate director for the region, which was more of an informal discussion about my thoughts on the country context and current challenges. If I hadn't known the country/current events very well, it would've been obvious. After another week I got a call from the original recruiter and she made the offer.", "Interview Questions": "What do you think is the biggest challenge [country] is currently facing?"}], [{"date": "4 Apr 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute in Sept 2021", "Interview Descriptions": "Interviewer spent a lot of time going into details about why IRI is an unhealthy work environment, asked questions like how do I deal with problematic personalities, etc.. Very suspicious. Proceeded to completely ghost me after the interview, no updates, follow ups, or responses to email.", "Interview Questions": "Past experiences as it relates to current job, how do you deal with difficult personalities "}, {"date": "24 Oct 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Republican Institute (Washington, DC) in Aug 2021", "Interview Descriptions": "One of the worst if not the worst interviews  and/or recruitment processes  ever. They would contact  you and disappear !!! I asked for updates and  was completely ignored! That is all I have to say. I would not recommend.", "Interview Questions": "Tell us about yourself and experience "}, {"date": "28 Jan 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute in Jul 2021", "Interview Descriptions": "First the regional director came for a first round of interview, which was followed by the online interview. The interview lasted about 45 minutes and it seemed as a friendly atmosphere.", "Interview Questions": "Among all, they were asking for a country political sensitive questions, which is kind of tricky and lives a subjective interpretation. At the end they ask \"which book you would recommend for reading\"."}, {"date": "4 Apr 2021", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at International Republican Institute", "Interview Descriptions": "Quick phone call. She was not very friendly at all, and I have not heard back from them for over two months. It seemed like she was just going through the motions and trying to get the interview over with.", "Interview Questions": "Would you want to stay in business development or would you prefer to work in the field?"}, {"date": "8 Jun 2021", "title": "Junior Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at International Republican Institute in Apr 2021", "Interview Descriptions": "Very streamlined at first, but they totally left me hanging for 2+ weeks before sending a generic rejection that could have been for a screening interview. Really disappointed by that.", "Interview Questions": "Q: How do you research your pieces when you don't understand the subject?"}, {"date": "8 Mar 2021", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at International Republican Institute", "Interview Descriptions": "The interview process involves three different components, the first was an interview with HR recruiter to make sure the basic fit was right. The second interview was a panel interview with the portfolio team, delved into more substantive and technical questions. After this interview there was not a writing test and a verbal language test.", "Interview Questions": "Describe your experience with project management?"}, {"date": "3 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at International Republican Institute", "Interview Descriptions": "Great! Very transparent and organized. Two rounds of interviews with feedback after every round and they definitely talk to every candidate whether the results are negative or positive. They tell you either way which is appreciated.", "Interview Questions": "They asked me: Tell me about yourself"}, {"date": "16 Apr 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute in Dec 2020", "Interview Descriptions": "1st interview is a screening call with an HR rep. \r\n2nd interview is a group interview with your future team members. (I got cut at this point but I believe there is a third interview with the executive directors).", "Interview Questions": "Why do you want to work at IRI?\r\nWhat interests you about building democracy abroad? \r\nWhat is your experience with budgets and project management? \r\n\r\n"}, {"date": "19 Nov 2020", "title": "M&E Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Republican Institute (Kuala Lumpur)", "Interview Descriptions": "Its was very interactive and friendly. I had given time to speak about every question. Very helping interview panel was there. Questions was very relevent and to the point as per position applied.", "Interview Questions": "It was all about MEAL as per JDs"}, {"date": "29 Oct 2020", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute", "Interview Descriptions": "The interview process was fine, to be honest. I mentioned my own interests which I thought aligned well with what they were looking for, since I know the organization pretty well. The recruiter interview and then one with one of the main staff for the program go great. I thought I was a shoe-in for at least the next interview... They ended up hiring somebody internally, most likely someone who held a similar position to the one I had.  If you're going to hire somebody internally, please, do not bother interviewing people.", "Interview Questions": "What made you interested in working for IRI?"}], [{"date": "22 Jan 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute in Nov 2020", "Interview Descriptions": "The interviews themselves were good. One with HR, one with a hiring panel for the team. They gave me a quick timeline of when they would make a decision and assured me they would follow up. However, after the final interview, I never heard back a word for them, despite multiple emails on my end. Months later, still nothing. Very disappointing and not very respectful of the candidate.", "Interview Questions": "Tell me about your previous job experience.\n\nDo you have prior program management experience?\n\nHow much do you know about this particular country?"}, {"date": "23 Nov 2020", "title": "Senior Governance Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at International Republican Institute (Washington, DC) in Oct 2020", "Interview Descriptions": "There was a screening phone call and then a panel interview with the team.  During the screening call, they ask for your requested salary range. They also ask competency-based questions related to the position. The panel interview had difficult questions.", "Interview Questions": "Please describe an intervention that you would create with IRI. "}, {"date": "7 Jul 2020", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at International Republican Institute", "Interview Descriptions": "Application was quite rigorous for a largely/solely administrative position. The people I was interviewed by were unenthusiastic and did not at all engage with me beyond asking rudimentary questions. \r\nIn the span of time between my interview/phone screen and being completely ghosted, I noticed that another position was posted and hired for within days. Fishy.", "Interview Questions": "Detail your administrative experience."}, {"date": "16 Oct 2019", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at International Republican Institute in Sept 2019", "Interview Descriptions": "First interview with a small team, second interview with deputy director. The recruiter was terrible at communicating. After the second interview the organization asked for three references and then I was rejected (after inquiring by email). I doubt there were any red flags in my references. Would have be courteous for the organization to reject me before asking for references.", "Interview Questions": "Why do you want to work for IRI and what skills do you contribute?"}, {"date": "3 Aug 2019", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute", "Interview Descriptions": "Very informative, open minded and friendly management. Thorough and transparent. The process was a bit lengthy but given the nature of the work and the hectic schedules of the executives, it was appropriate.", "Interview Questions": "How does IRI fit with your career aspirations?"}, {"date": "23 Jul 2019", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Republican Institute", "Interview Descriptions": "Interview is directly done by country director.  It is conducted very kindly and respectfully for the interviewee. It is a long but not tense process, during which your employer asks you full of questions but always willing to do his/her best to recognize your work abilities well.", "Interview Questions": "What do you think about the overall situation of the country?"}, {"date": "10 Feb 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Republican Institute (Washington, DC) in Jul 2019", "Interview Descriptions": "Straight forward and low stress. The interviewer asked pretty basic questions -- what's your experience, why IRI, and then the interviewer detailed the job itself. Everyone who interviewed me was very friendly and easy to talk to.", "Interview Questions": "What makes you an ideal candidate for the position?"}, {"date": "18 Jun 2019", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Republican Institute (Washington, DC)", "Interview Descriptions": "The process took over two months and after multiple interviews they stopped replying to my emails. So I just assumed they went with another candidate. Really enjoyed my second interview. It was a Skpye conversation and the person was very easy to talk to and was super knowledgeable in their field. My only sour experience was with the HR person I was working with, but the organization does great work. Be sure to have up to date information about the area in which you are applying.", "Interview Questions": "Wanted to know if I had any knowledge/opinions of the state of democracy in the country to which I was applying. "}, {"date": "22 Apr 2019", "title": "Monitoring Evaluation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at International Republican Institute (Washington, DC) in Feb 2019", "Interview Descriptions": "Got in through a referral. At first a recruiter reached out via email to set up a phone conversation with the department manager. After a week and what was a positive interview, that same manager reached out a week later for a peer interview. This interview also seemingly went well. Throughout both interviews, it appeared I had developed a good rapport with them and they expressed urgency in filling the position soon. After 2 weeks, of no response, I reached out - no response. After another 2 weeks - no response. They altogether ghosted me and had no follow up whatsoever. Highly unprofessional.", "Interview Questions": "What is our MEL experience with US grants?"}, {"date": "17 Dec 2018", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at International Republican Institute (Washington, DC)", "Interview Descriptions": "Questions focused on subject matter expertise (relative to relevant grants) as well as country/regional knowledge. Additionally, interviewers were looking for how a diverse vocational and educational background could contribute to the specific work on which IRI focuses.", "Interview Questions": "Please share your take on the political implications of XXXX in XXXX context."}], [{"date": "25 Feb 2020", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Republican Institute (Washington, DC) in Nov 2018", "Interview Descriptions": "I had first a phone call and then a personal interview with the Deputy Director and the Director of the LAC team. They told me they would contact me after 1 week. But they didn't. Ir was a very nice and friendly interview.", "Interview Questions": "Where do you see yourself in 5 years?\r\nDo you speak Spanish?"}, {"date": "29 May 2019", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Republican Institute (Washington, DC) in Nov 2018", "Interview Descriptions": "I had the phone and personal interview.  I was interviewed by 2 people (the regional deputy director and the director). I consider that the interview went fine, they were very nice and welcoming.  I send an email after thanking the interview. However, never had a reply back.", "Interview Questions": "Standard questions to talk about yourself. "}, {"date": "28 Jun 2018", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Republican Institute", "Interview Descriptions": "No phone screening; called in for an in-person interview with two program managers. Called back for an interview with deputy program director. Final interview involved an informal peer-interview with team program officers followed by a more formal, one-on-one conversation with the division head. To finalize the process, I was asked to complete a brief writing and translation assignment.", "Interview Questions": "What attracts you to the field of democracy development, and more specifically to the division you've applied to?"}, {"date": "22 May 2018", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Republican Institute (Williamsport, PA) in Apr 2018", "Interview Descriptions": "Submitted my resume and cover letter and heard back within 2 weeks. HR set up a time for me to speak with program director I was working under. I spoke with the director for about 30 minutes and was offered the position. During the interview, all of the questions centered around experiences/skills I had cited in my cover letter. The director didn't ask any general interview questions. A strong cover letter worked wonders.", "Interview Questions": "Explain your exposure to polling methodology (referenced curriculum I cited  on my CL)."}, {"date": "15 Mar 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at International Republican Institute", "Interview Descriptions": "The Africa team is incredibly unprofessional. Despite countless efforts on my part to follow up, no one even bothered to get back to me following the interview. Even after I made it clear that I had other offers elsewhere that I needed to respond to. Dodged a bullet with this one!", "Interview Questions": "Why IRI?"}, {"date": "1 Mar 2020", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at International Republican Institute (Washington, DC) in Mar 2017", "Interview Descriptions": "I received a phone call two months after applying online. I heard nothing for another month until I was asked to come in for another interview. Both interviews were with the associate director. I never received an update on their decision.", "Interview Questions": "What do you know about the region the position focuses on? "}, {"date": "25 Aug 2017", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Republican Institute (Washington, DC) in Nov 2016", "Interview Descriptions": "Phone interview with hiring manager, first round in person interview with team lead, then a second round in person interview with senior management. Everyone was very friendly, asked about experience related to job posting", "Interview Questions": "Experience securing U.S. government funding requests"}, {"date": "13 Jul 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Republican Institute", "Interview Descriptions": "Interviewed on the phone. I never had to come in and meet with them. They did not care about quality of the candidate because this was a temporary 3 month position.", "Interview Questions": "\"The questions were pretty standard. The asked questions like why should I be hired over other applicants. \""}, {"date": "22 Jun 2016", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at International Republican Institute (Washington, DC)", "Interview Descriptions": "I applied online but didn't hear back. It wasn't until a very important political operative with ties to the organization placed a call recommending me that I heard from them, within a day.", "Interview Questions": "I don't remember specifically being asked questions. I had a conversation with the director and deputy director about my work experience, my personal background, why I wanted to work for the organization, and what value did I bring to the position. It wasn't very hard for me."}, {"date": "15 Sept 2016", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Republican Institute (Washington, DC) in Jun 2016", "Interview Descriptions": "First round phone interview, second round in person interview. Said they would get back to me a week afterward, but never heard anything at all. Make of that what you will, but I found it quite unprofessional, as I (like others probably) had been trying to push back on other opportunities as I awaited news on this position.", "Interview Questions": "Basic questions on interest in and qualifications for the position, understanding of what the organization does."}], [{"date": "11 Jun 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at International Republican Institute (Washington, DC)", "Interview Descriptions": "Very drawn out. It took months between interviews. Meeting with the Regional Director and the Deputy Regional Director was informative and interesting. They seemed sincere and interested in moving the process forward. The final \"interview\" was, as I recall, with the President and Vice President of the organization. They seemed capricious in their decision making and neither of them added much (positive) to the entire process, other than planning around their schedules meant that the organization waited weeks to hire me.", "Interview Questions": "Why do you have an interest in promoting democracy overseas? What in your background has prepared you for this? "}, {"date": "18 Dec 2014", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at International Republican Institute (Washington, DC)", "Interview Descriptions": "Email from HR about a week after submitting online application (of note: no cover letter required/accepted in application). First interview one week later - 20 minutes, easy questions. Second interview one week later with C-level staff - 30 minutes, easy questions. Offer extended (pending references) two days later. Friendly and casual interview atmosphere, but not very thorough vetting by hiring managers.", "Interview Questions": "Nothing was difficult, which in itself was unexpected."}, {"date": "11 Oct 2013", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at International Republican Institute", "Interview Descriptions": "This was absolutely the worst interview process I have ever gone through. After two phone interviews, I was flown to DC to meet with the President and Vice President, and the program manager. (They had me flight in and out of DC from Texas in the same day.) The program manager acted as though he had no idea who I was or why I was there. Clearly there was some internal miscommunication. After a very positive interview with the Pres and VP, the program manager basically made me an informal offer and said they would be in touch on Monday (it was Friday). Then I waited. And waited. And waited so long, another job offer I had on the table was withdrawn. My attempts to contact them were fruitless, they were clearly avoiding me. After several weeks, I was told they would be interviewing additional candidates. I inquired politely what I might have done better. No answer, and no further follow up.\r\n\r\nIt was a heart breaking experience. I thought I had the job, and the rug was pulled out from under me at the 11th hour and I was left unemployed. I lost all respect for this organization and the people interviewing me. The way I was treated is simply unprofessional and disrespectful. Personally, it was heartbreaking.", "Interview Questions": "None of the questions were difficult. "}, {"date": "9 Jul 2013", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Republican Institute", "Interview Descriptions": "Went in for an in person interview and it went well. Never heard any follow up.", "Interview Questions": "Why do you want to work here?"}, {"date": "25 Mar 2013", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Republican Institute (Washington, DC)", "Interview Descriptions": "1) Applied online 2) Had an informational interview with a friend in the organization 3) Interviewed with the deputy and director of the department I was going to work with 4) Interviewed with the President 5) Was made an offer\r\n\r\nThis is the usual process, best advice is to find someone from the inside you can network and have advocate on your behalf.  Also note that the time between initial interview and interview with the President or senior leadership can take some time as they travel often.  Even if you are a well liked candidate the final interview can sink you; it is a casual interview but they are looking to see if you are a good fit for the organization.", "Interview Questions": "Understand what the organization is.  Do not except to travel the world and be offered an oversea posting soon after you are hired.  Additionally, fully understanding their HR schedule for promotions and pay increases."}, {"date": "14 Mar 2014", "title": "Social Media Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at International Republican Institute (Islamabad, Islamabad) in Jan 2013", "Interview Descriptions": "The interview process was very quick; they had done their research, knew exactly what they were looking to do and what kind of person they needed. It involved a one on one meeting, followed by a basic qualifications check. Communication was prompt and regular and I was kept updated throughout the process with progress.", "Interview Questions": "Everything was as expected"}, {"date": "24 Apr 2016", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at International Republican Institute (Washington, DC) in Jan 2012", "Interview Descriptions": "First met with division heads, then with VP and President. Questions were typical behavioral type ones and none threw me for a loop. After the initial interview, I had to wait weeks for a follow-up interview with the VP/President, and then an additional two months before getting a starting date. All in all the interview process took almost four  months- much longer than I was told it would take.", "Interview Questions": "Give us an example of a time where you had to make a difficult decision."}, {"date": "2 Jan 2012", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Republican Institute (Washington, DC) in Dec 2011", "Interview Descriptions": "Took about 2 months to hear back from initial application.  First interview scheduled within the week contacted - took place over the phone as I live out of state, second interview scheduled at the conclusion of the first.  Second interview seemed like it would normally have been broken up into 2 rounds (met with increasing levels of seniority) but wasn't as I had traveled in.  Heard back following the second round within one week.  Interviewers were concerned with fit (asked why IRI & wanted to understand my philosophy about democracy promotion).", "Interview Questions": "Why IRI"}, {"date": "11 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at International Republican Institute (Washington, DC) in Jan 2011", "Interview Descriptions": "Put in touch with one of the directors through a university professor. I sent over my resume and cover letter and was invited for a phone screening and then phone interview. The offer was final within 1-2 weeks after the first call.", "Interview Questions": "Tell us about yourself. Why do you want to work for IRI? What languages do you speak? What did you study in undergrad? "}, {"date": "27 Jul 2010", "title": "International Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at International Republican Institute (Washington, DC) in Mar 2009", "Interview Descriptions": "Normal interview questions, environment. Fairly friendly atmosphere. Very structured and corporate feeling for a non-profit. You start by interviewing with lower level employees and advance up to the director. It is generally a fairly long process and you have to be proactive in communicating with those hiring.", "Interview Questions": "No questions were difficult or unexpected."}], [{"date": "17 Feb 2010", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at International Republican Institute in Jul 2008", "Interview Descriptions": "Very casual, with fit interviews starting at the middle management level, and finishing with the president and EVP of the organization.  It all comes down to fit and this organization has a heavy hand at the top.  The \"front office\" as they like to call themselves has to approve every hire and they have final veto without consultation from the junior or less senior staff.", "Interview Questions": "Why do you want to be here?"}]]