[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Nov 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Good day day day day", "cons": "Nothing bad to say that's all"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great Colleagues", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Aug 2022", "job_title": "Part Time Lecturer in London, England", "duration": "N/A", "pros": "Good Support from Module Leaders", "cons": "Students aren't fully committed in general"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Good people bad management!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Sept 2022", "job_title": "Library Assistant in London, England", "duration": "N/A", "pros": "Good location and some nice people…", "cons": "Toxic management, no student or staff care."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2022", "job_title": "Exams Manager in London, England", "duration": "N/A", "pros": "Best for weekend programs and customer focussed colleagues", "cons": "Closed but new educational organisation instituted: confusing governance and pro management"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "well they are administration", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Feb 2022", "job_title": "Student Engagement Coordinator in London, England", "duration": "N/A", "pros": "there really weren't any if i am honest", "cons": "a very weird company that is no more"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Terrible management", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Sept 2021", "job_title": "Human Resources Business Partner HRBP in London, England", "duration": "N/A", "pros": "Location and near to tube.", "cons": "Bullying\nToxic work environment and top team"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "interesting place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Nov 2020", "job_title": "Business Analyst in London, England", "duration": "N/A", "pros": "Great team who supported your development", "cons": "Progression opportunities hard to come by"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "My experience in GSM London", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Feb 2016", "job_title": "Senior International Admissions Officer in Greenwich, England", "duration": "N/A", "pros": "I started working in GSM in 2012. I had a pleasant experience. This was my first higher education sector job and I really enjoyed the learning and building my knowledge about higher education and also international students. \r\n\r\nPeople are very friendly and very approachable. very diverse bunch of colleagues and students. You will learn about different cultures and will meet great people with different experiences.\r\n\r\nI had many opportunities to participate in sector training sessions and seminars. Many teams are motivated and wanted to learn different skills and willing to change for the better opportunities. I was very fortunate to work with brilliant managers and learn different skills. I have to say I did enjoy my time in GSM. Overall If I had a better opportunity and recognition I would stay in this company.", "cons": "Not much opportunity to progress in your career. Benefits are not that great since compared to sector. Not many people wanted to make a real difference in student life journey."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2016", "job_title": "Student Advisory in Greenwich, England", "duration": "N/A", "pros": "The people - some really bright people across the company and teams are usually trying to make the student experience better\r\n\r\nLibrary - New library at Greenwich meets the students needs", "cons": "There's a lot....\r\n\r\nSalary and benefits - benefits are non existent and salary is below what other businesses in the same industry are paying.\r\n\r\nDevelopment and progression - Again pretty non existent unless your friends with people above. Rarely do vacancies go to people within the business and rarely are staff given the guidance or training needed to progress.\r\n\r\nStaff turnover - After the above two it's probably not a surprise that turnover is appalling. The majority stay for 1-2 years. It's good if you want a particular job title on your cv but don't come here looking for a career because you won't find one.\r\n\r\nManagement - Description not necessary - read the other reviews\r\n\r\nIn Decline - The business is in decline. Less students, more problems with immigration etc. If you're already in a job and looking for a new one surely you want to work somewhere that's expanding not just replacing people on the titanic."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay clear", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Feb 2016", "job_title": "Student Finance Officer in London, England", "duration": "N/A", "pros": "People. The people here make this place and most really work hard to try and make things better for the students. Training given within the team was also very good, however varies with each department.", "cons": "The place is a circus when looking at how senior management runs the place. Brown-nosing is rife as it appears to be the only way to progress so prepare to be stabbed in the back. Even potentially by your own manager if that makes him/her look better. Never seen \"office politics\" on this level before. Pay is awful, promise of bonuses which never materialised and the locations between the two campuses are very far apart if you are expected to travel between the two. The place is set up to bleed money from students so if you have some morality you will find it difficult to stomach this place."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrendous", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jun 2016", "job_title": "Maths Teacher in London, England", "duration": "N/A", "pros": "The rare opportunity to have so many self-obsessed, talentless, insecure, bullish, self-promoting ego-maniacal managers/senior managers/permanent teaching/academic/HR staff housed under one roof- It should be filmed as an interesting insight into nepotism, cronyism and the psyche of the desperate. Far more vacuous than the Kardashians.", "cons": "Everything and everyone associated with this organisation. A game of snakes and ladders. Complete disregard for the de-franchised . increasing numbers of students are receiving public funding in the form of loans and grants to study at this institution. Providing loans for these students means that public money is being allocated to GSM and the spiralling cost of this funding is seen as a cause for concern. Management are not fit and proper to run an educational establishment involving Higher education. It has been suggested that students at some private providers have wrongly been given access to student support; allegations have also been made about the authenticity of some students at private colleges and it has been suggested that some providers have given misleading information to the Student Loans Company. The list here is endless and the students who want to succeed suffer as this institution is about lining the pockets of the fat cats and their pathetic cronies."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful management and unqualified lecturers", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Aug 2019", "job_title": "Module Leader in London, England", "duration": "N/A", "pros": "Some very good lecturers who genuinely cared about the students and their progression. That is it.", "cons": "The management: very, very unqualified in every way which is a key reason why the business went into administration. Management was not appointed on credentials and experience, but more in relation to who they were related to; who they had previously worked with and who they were friends with. As a private business, the ethos behind renumeration and treatment shown through. No staff development; no perks; no praise - no nothing! There was differential treatment for staff depending on how much you brown nosed and a very much glass ceiling effect for the diverse employees, with the managing positions being given to under-qualified British lecturers. Overall, I observed 'lecturers' with barely a degree 'teaching' students and being able to award grades when they could barely achieve themselves. The Faulty Towers of HE - GSM London - farewell."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Joke", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jun 2016", "job_title": "Student Advisory in London, England", "duration": "N/A", "pros": "You are able to make some great friends with fellow staff members which make it bearable, closely located to a market with good food and easily accessible via DLR and train", "cons": "You will most likely be managed by people who are less qualified than you and really have no idea of what they're doing - the easiest way to get ahead is to suck up to managers and be horrible to your own staff who are putting in the real effort. Despite managers being less qualified they will speak to you in a condescending tone as if you are just a puppet and there isn't much real use for you but when you are sick and need a day off/to go home they will notice your absence. \r\n\r\nThis establishment does not appreciate their student body and despite half the students not even being able to speak English will take all the money they can from them before kicking them out for not progressing quick enough. It is hard not to feel terrible for students, who should not have been enrolled in the first place, who are being told they've been taken off the course. Students can also be incredibly rude and irrational - they'll insist they are correct despite being completely wrong a large portion of the time. Rather than your managers stepping in and assisting they'll shy away from the confrontation while the students yell 'GET YOUR MANAGER'. They'll slide out the door and wait for the chaos to be over, forbid they did any work.\r\n\r\nAny suggestions you make for the betterment of students will fall on deaf ears as they generally don't allow the 'university' to make a profit. \r\n\r\nIt was hard not to laugh at this place every moment you're there. There is absolutely no work-flow as you can email different departments 5 times within 2 weeks and they still won't get the work done. Managers will tell you to get off your mobile phones although they'll be on theirs doing absolutely nothing all day. The staff members who deserve credit aren't given any only people who suck up to management are appreciated."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great history, great place, exciting future", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Dec 2016", "job_title": "Department Head in London, England", "duration": "N/A", "pros": "As someone that has been at GSM London for a reasonable period, this is a great place to work if you are someone that is truly interested in making a real difference in the lives of students rather than just looking for a 'self-serving' academic job that gives you a decent salary. \r\n\r\nThe staff are amazing but just like any other place there are a few that may not be fully committed and you tend to see them leave relatively quickly. The academic staff are committed with a good balance between those with a long track record in HE and those with significant industry experience. Students recognise this strength in the yearly satisfaction survey and in the more regular module evaluation survey. In my opinion, the focus on personal development and graduate attributes is commendable and best-practice across the sector - you can attribute this to the leadership of the current Provost and Dean of Faculty and the commitment of the wider staff (both academic and non-academic). Many programmes have strong professional body links which demonstrates their high quality, workplace recognition. More recently, a personal tutoring and strength-based learning initiative are full of promises, although still in the 'baby' period.\r\n\r\nThe industry week for various subject areas are best-practice and something that other institutions should take notice of - entrepreneurship week, women in business, energy futures, and careers in finance, to name a few.\r\n\r\nThere are many other examples of great work being done at this institution. Generally, it is a place where you can get involved, develop yourself, develop others, and make a real difference.", "cons": "There are some issues that require attention such as the types of tailored support for students. This is a challenge that could do with innovative (not 'traditional') solutions. The biggest asset of this institution are the staff and there is a need to invest more in their development."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do NOT study here please - here is why", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Jan 2018", "job_title": "Manager in Greenford, England", "duration": "N/A", "pros": "nice students, nice staff (few only) nice vending machine for breaks nice bonus for work if you know right manager. library staff always nice.", "cons": "I'm a former manager here and my colleague informed me that the same rubbish that was occurring when I was there is now-colleague informed me of this page and is scared they will lose job. please can I beg you to stay away do not be fooled by the trees inside the building or the glass walls and the fancy attendance style machines. do not be fooled by the flags inside the building and do not be fooled to think that this place is worth to study at"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Students setup to fail; Staff are treated like animals; GSM London - aka. \"The Black Hole\"\r\nSTAY CLEAR!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Feb 2015", "job_title": "Senior Manager in London, England", "duration": "N/A", "pros": "1. A minority of very talented individuals (have been employed by sheer dumb luck)\r\n2. Senior management/Exec are highly paid, well above the average salary bands, if you’re a director you will be rolling in the cash, regardless of ability or experience\r\n3. Riots and fights often break out among students on Campus, this can be entertaining and helps to pass the time, police are often called onsite this only adds to the drama\r\n4. That is it! Seriously there are no other benefits…", "cons": "1. Students are cheated out of money, time and education, teaching is poor, facilities are poor, student pass rate is very very poor. There has been a major under investment in basic student facilities; this company is still stuck in the 1980’s, yet they charge in-line with top end Universities. I am amazed!!\r\n2. Entry requirements seem to be non-existent, the policy seems to be to recruit students regardless of qualification or ability, I witnessed a student applying for an undergraduate course, this student was barely able to read or write in English yet he was asked to complete a form and was accepted onto the course (later withdrawn). Of course GSM's entire income is from SLC funding so the calibre of the student was not a issue. \r\n3. Last summer when the air conditioning broke down (for weeks)  the Provost emailed all staff/students advising them to buy a mini fan and keep it at their desk to keep cool, all staff were also explicitly advised to wear ”loose and light clothing” Instead of paying to get the issue fixed, Loose clothing? is this even allowed?!  surely the answer is to install air conditioning or get it fixed? Instead the electricity company were held responsible, yet the incumbent had bought herself a £500 Dyson blade-less tower fan paid for by the students or SLC rather!!  Amazing!\r\n4. The Company seriously lacks leadership, there appears to be a constant power struggle internally particularly within the Executive team;  all want control, all have little or no experience in HE, in fact the current lacking leader has been running pubs and bowling alleys for the last x years, i'm sure this will be highly relevant as both industries are the same....NOT!  \r\n5. GSM London currently has no business strategy or vision, their sole objective is to make money by mass recruiting students – as opposed to producing advocates.\r\n6. All employees have to work a compulsory 40 hour week, regardless of salary band. Most often you are working extra hours due to lack of appropriate resourcing.\r\n7. Student experience is not valued by this institution; their philosophy is simply to take money from students or rather the Student loans company.\r\n8. Admin & support staff are at the bottom of the chain, undervalued, underpaid, overworked & often treated with lack of respect or consideration (worse than animals).\r\n9. HR is poor, they solely exist to look after the executive board and the company’s interests as opposed to the well-being of employees. Staff retention rate is a real issue. There is no staff training.\r\n10. No flex or benefits for staff. Extra hours demanded with no remuneration to staff.\r\n11. There are some very unsavory characters at GSM London, so be careful if you plan to study or work here. This includes students and staff. Very high probability of seeing a fight break out on campus, luckily the police station is across the road and they are often called - can be very comedic at times although very disturbing on the whole. \r\n12. There is no access for disabled students to floors above ground level, (at the main campus)  the current lift does not conform to regulatory standards, this is illegal.  Spend the money & sort it out. Why discriminate against disabled individuals?"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unethical Soul Destroyer", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Sept 2014", "job_title": "Assistant Bursar in London, England", "duration": "N/A", "pros": "You will quite often be able to watch fight between students, staff and sometimes a fight between student and staff.  In my four and a half years with the company, I witnessed them all.  Those were the best days.  Non-eventful days would usually consist of death threats, loss of student grades, incorrect qualifications being awarded, sexual harassment from heads of departments, fake qualifications, fake passports, visits from the police etc.", "cons": "I see the main issue with GSM as being their entry requirements.  They will scrape the barrel just to get numbers through the door and keep the investors happy.  This results in a very poor quality of student (academically and, in the main, personally) which has knock on effects when it comes to dealing with the problems inherent with that.  This wouldn't be too much of a problem if GSM had the policies in place to actually withdraw students who fail their first year, but with the three enrollment periods and various methods available to undertake a course (full time, part time, accelerated, extended, year zero etc.), GSM just aren't prepared.  I calculated that the first enrollment period I was involved with, only 10% of the student graduated on time.  I monitored it throughout my time there and, despite the huge sums of money pumped into the company, there was no improvement in that figure.  That's awful, and it can ruin students' lives.  They are encouraged to enroll and commit to a course that we all know they aren't going to be able to complete.  This results in students being out of pocket between £3K-£28000.  I've seen it first hand and this is why we have most of the problems I've mentioned above.\r\n\r\nTo try and counter the issue, GSM have put in about 20 layers of management.  There are, honestly, about 3 managers for every ten members of staff.  This means that you can work your bum off all year and the same benefits as someone who does the bare minimum because any form of praise has to go through about five lines of management before it gets to a genuine decision maker.  I feel sorry for a lot of the new staff who come in with hope and ambition because this really isn't the place for them.  I watched souls get destroyed in that place.  It's almost as if the directors have got it in for their staff.  Working here's a no-win situation for about 99% of staff.  Training? Forget it. Any form of staff development? What would be the point in that, ey?"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The ULTIMATE low-esteem workplace", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Sept 2014", "job_title": "First Semester Engagement Officer in London, England", "duration": "N/A", "pros": "At GSM, you can prematurely get promoted (as is the case with a lot of managers, the majority of whom are unable to manage adequately).  So its essentially a 'stepping-stone' workplace that, whilst seeking the stepping-stone will subject you to much abuse, disrespect and loss of credibility with both internal (students) and external stakeholders.... this pro is a con!\r\n\r\nThere are some decent people here - but isn't that true of every workplace!?", "cons": "Morale is low amongst the Student Experience and Finance teams.\r\nTraining will be promised, but hardly ever delivered.  An spattering of thrown-together slides by an inept manager is as excuse for training. \r\nLeadership is poor - they promote 'yes' people who will subject their juniors to late deadlines and poorly organised work priorities.\r\nLots of parties here; for which more emails go around in order to plan for that essential work such as giving students their timetables when they arrive.\r\nA lack of professional attitudes - come here if your every second word is a four-letter expletive starting with 'f' - you may fit right in.  Also, if you are keen to walk around exposing tattoos on your boob.\r\nMicro-management amongst many teams leaves staff feeling miserable.  The faces of the staff tell a story - people don't smile here or look worn down.\r\nThe place is split between two campuses and managers are unable to manage their teams well when working from different locations.  Greenwich is a hell-hole of chaos, and Greenford is boring and stuck-up.\r\nYou will have functioning air-conditioning when it is Winter, and functioning radiators in the Summer.  People faint here.  Also, the lights regularly shut out due to an agreement with the landlord."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I Wish I Could Give it ZERO Stars. (STAY AWAY!)", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2016", "job_title": "Adviser in Greenwich, England", "duration": "N/A", "pros": "The lower level staff are lovely and know how to have a laugh even when being beaten down by politics and lies. This is the only pro. there really is nothing else good about GSM", "cons": "1. Unsafe working environment - students are free to spit at you, throw chairs at you and threaten to hurt you and the company lets them return as if nothing happened! \r\n\r\n2. CEO is ignorant and doesn't care about the lower level staff\r\n\r\n3. no one actually knows what the company goal is.. (What happens when TDAP fails?! we all know it will...)\r\n\r\n4. Complete favouritism, if a senior manager likes you and you gossip with them they look after you\r\n\r\n5. Icing on the cake is they hire in managers on an interim basis who leave after 4 months or just bully employees.\r\n\r\n6. HR are useless and never help you - inexperienced and LAZY.\r\n\r\n7. No employee incentive programs.\r\n\r\n8. HR gossip about personal issues\r\n\r\n8. Average life of a good employee is max 3-4 month. (or they sack you)\r\n\r\n9. They recently restructured a similar department to mine – ended up losing a good manager (who always had  peoples backs and had managed to stay with the company a few years somehow) to redundancy and forcing the remaining staff to jump through hoops, yet 3 months later NOTHING has changed – (how is the restructure working for you now senior management? The service looks soooo much better (!)\r\n\r\n10.Pay is low, Hours are long and they encourage your co workers to spy on you – promoting a snitch culture.\r\n\r\n11. Yearly bonus was removed yet everyone  knows certain favourites got a bonus.\r\n\r\n12. they forced managers to  score their teams low in the  mid year ratings so that they wouldn’t qualify for a pay rise.\r\n\r\nI could go on but why bother. This place is hell. If you are looking for work GO ELSEWHERE."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not work or study at GSM", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Feb 2018", "job_title": "H R Operations Manager in London, England", "duration": "N/A", "pros": "For two years I was made to feel that I was worthless and I had no guts to write here. My former colleague sent me an email after the BBC investigation into this GSM scam. He is only pro for myself to be honest here.", "cons": "I have so many but I was heavily bullied by Greenford staff in business courses for making suggestions and the students were not happy with GSM and they took it out on myself. Please watch BBC investigation into GSM as shows you how bad it is and also I never knew it was this bad even after two years."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Passionate employees but lack of investment from the board", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jan 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Opportunity to get involved in various projects and learn.\r\nGenerous holiday allowance.\r\nSome good middle and senior managers with good experience and mentoring.", "cons": "Feeling that the business owners just sweep the profits with a minimum investment into students or employees. \r\nTerrible HR team in terms of communication. Need to sort out their remuneration strategy and offer an equal pay. \r\nMost of the staff are logged off their phones so impossible to get hold of"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Liars, Thieves, Bullies and Backstabbers", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Oct 2016", "job_title": "Departmental Administrator in London, England", "duration": "N/A", "pros": "Your teammates - The people who (directly) work alongside you will probably be very decent and upstanding. Considering the stress you will most likely be under, your teammates are the only people who will be able to understand what you are up against and give advice if ever you become overwhelmed.\r\n\r\nThe payout that you may receive from GSM London when they fire unjustifiably.\r\n\r\nLeaving GSM London and moving on with life gives one a euphoria which would never have been possible without being an employee of such a terrible organisation.", "cons": "GSM London is very aware that they continually receive negative reviews on Glassdoor from current/former employees. Instead of attempting to change how the institution is run, the management hold \"all-staff meetings\" in which they try their best to discredit all negative Glassdoor reviews. Any current staff member who implies that these negative Glassdoor reviews may be credible is made to feel as if they have committed high treason; HR then include this in your personal file to use against you whenever needed.\r\n\r\nGSM London has a lot of polices, which they expect all staff member to be aware of, however, these policies are rarely enforced; usually they are only enforced to protect GSM London against its staff and students when GSM London's reputation is at stake.\r\n\r\nLots of staff at GSM London say and do things openly which proves that the institution does not enforce policies relating to:\r\n- Discrimination (race; gender; sexuality; religion; class; age; physical appearance; intelligence; etc)\r\n- Bullying\r\n- Confidentiality\r\n- Dishonesty\r\n(In my experience, the management are the worst culprits.)\r\n\r\nManagement habitually hire their own unemployed relatives and uneducated childhood friends. Although the organisation is quite big, the number of employees who are related by blood is probably higher than you imagine. This is not necessarily a bad thing but can easily become a bad thing when abused, as it often is by some.\r\n\r\nPromotions are often given to staff members based on friendship statuses and most people who are lucky enough to be promoted are promised the promotion long before the job is advertised; if you are not invited to apply for a promotion, you are most likely not getting the job.\r\n\r\nThe organisation is extremely disorganised and your daily responsibilities are subject to change (and will do so, very often). HR are known for losing copies of important documents of GSM London staff (passports; contracts; qualifications; references) and never have a decent explanation as to how this is possible and why it happens so frequently.\r\n\r\nMembers of management appear to be in competition with some of their own members of staff and dedicate a lot of time spreading lies about said staff members, in order to publicly tarnish their reputations and force them out of the organisation.\r\n\r\nWhen confronted about particular issues, members of management have a very convenient ability of forgetting a lot of important things which were said or done which would present themselves in a negative light.\r\n\r\nGSM London pays its staff quite low salaries (except for the friends or family of management), despite experience or educational backgrounds. Although GSM London's staff are paid lower than they would be doing similar jobs in other London-based institutions, the most efficient members of staff will constantly be forced to take on an ever-growing list of extra responsibilities, whilst most likely receiving sheer disrespect from management. \r\n\r\nGSM London are known for tricking candidates throughout the job interviewing process into accepting lower salaries, as they often lie about how much work is really involved within some roles. This leads to GSM London (only sometimes) recruiting high-calibre staff, who then resign very quickly; only weeks later, in some cases.\r\n\r\nAlthough GSM London claim that their focus is on Widening Participations, this REALLY is not the case. GSM London (who still does not have university status and hopefully never will) typically enrols students who have little or no educational background, providing these students with a false hope that they will actually be able to graduate one day; the student retention rate is shockingly low at GSM London for a valid reason. Being an employee at GSM London may sometimes feel criminal for this reason alone.\r\n\r\nPerformance-related annual bonuses are virtually non-existent (unless you have the word \"manager\" in your job title). GSM London only ever rewards the exact same people continuously for their \"hard work and effort\" whilst at least 90% of their staff are never ever even mentioned.\r\n\r\nIf you join GSM London, be careful who you end up working for, as unfair treatment by managers is often swept under the rug by HR, despite how many complaints are made against them.\r\n\r\nLife at GSM London is slightly more bearable if you are able to accept being treated badly by your manager. If you are known for defending yourself, you will be labelled a troublemaker and GSM London will try to get rid of you by any means necessary, even going so far as recommending that you find another job elsewhere. Be prepared to see your teammates/colleagues in tears because of something a line manager did or said to them. \r\n\r\nGSM London gossip is rife and you must be careful picking the colleagues that you choose to confide in, as telling the wrong person anything about yourself will become common knowledge throughout the institution (once again, managers are the worst culprits). Even lies spread about you will most likely be treated as gospel. The only way to ensure that you are not at the centre of gossip at GSM London is to remain unknown; yes, even the most popular and most-adored members of staff will still suffer negative rumours attached to their names. \r\n\r\nIf you are fired from GSM London, HR will probably threaten you with a lawsuit if you so happen to ever tell anyone what was actually discussed in your disciplinary meeting or if you ever mention the fact that you received a substantial payout from GSM London for an undisclosed reason."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not bother wasting your time or energy at GSM", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Dec 2015", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The staff for the most part. Most teams get along and everyone is pretty sociable. This can lead to a laid back atmosphere in most teams which is quite good more often then not.", "cons": "Ermmm pretty much everything at this point to be honest. \r\nI've seen other reviews that say GSM is fast paced or not for the faint hearted. \r\nI prefer the term unorganised, nothing in this place is truly planned for other than not paying staff correctly or making excuses in not being able to pay bonuses. \r\n\r\nEverything in GSM is \"improving in phases\" according to senior management. \r\nThis is a company that at one point had one person as a HR department -_-. Following that a new head was put into place with an actual team and all they could do was apologise every time an issue was brought up to them rather than actually resolve them.\r\nMinutes were conveniently lost or misplaced so meetings never had factual back up’s. Now through to the latest incarnation of HR, you have a team that literally ignore claims and requests. \r\nI can appreciate that a HR department is there to protect the company as well as see employees are treated fairly (conflict of interest???) but surely there should be procedures or at the very least guidelines in places. It seems you can only get things resolved by putting serious pressure on every person involved, testimonies are not taken and rather than actually dealing with issues at hand you're constantly giving the run around. \r\n\r\nThe same goes for the majority of managers \"I'm looking into it give me some time\" for weeks/months on end. Nobody below senior management is actually respected or valued apart from the very few that are favourites of management. I quote \"You're all replaceable\" is something I've heard many times over the years. There's trying to motivate your team in different ways then completely demoralising them. \r\nThis place will literally will suck the energy and productivity out of you if you allow it too. You can work yourself to the bone, do everything asked and beyond but it’s never enough. You'll never do enough to get any more than a 2% rise if anything at all because the company don't want to pay anymore. Bear in mind the large majority in the company are underpaid and in some places criminally so in my opinion. \r\n\r\nStaff salaries were benchmarked by Hayes and apparently compared against roles everywhere else but nobody has ever seen the result of this and certainly haven't had any rises. \r\nYou will get screwed out of commission/bonuses constantly and having written agreements reneged on. But that's only if you're fortunate enough to get an actual contract at some point in your employment. \r\nIf you change roles within the company don't expect any type of formal change, at best you will be given an amendment letter and if you request your contract you will be met with a wall of silence. I've actually been asked for a copy of my contract when I haven't had one for TWO years. \r\n\r\nYou only get 5 sick days in a calendar year which to me is unheard of in most businesses. What happens if you happen to even have a bad cold a few times in a year god forbid anything more serious. Non-existent benefits 1% pension contribution that wasn't voluntary and when trying to opt out being told it wasn't possible. \r\n\r\nNot to mention if you're in a student facing role you will definitely get screamed at a few times. Some of these are definitely people with mental issues. But a large proportion of them are people that have been pushed to the absolute edge by GSM. Some of the stories I've heard from students have been horrific at times. Students have lost their homes because they've been told when to expect student finance and not received for another 3 months. Fair enough you shouldn't bank your life on student finance but its still terrible advice\r\nOnce people are in \"the system\" everything goes downhill, any online promotion gets tons of hateful comments by bitter current or ex-students. \r\n\r\nLast couple of points here (I could go allllll day long)\r\nNo bonuses were paid this year as the company didn't meet targets which could be a bit more understandable if we didn't withdraw tons of students in the first 2 weeks as we don't have satisfactory attendance tracking systems. Student's ID cards don't work or their timetables are wrong so they have no registered attendance and get withdrawn. \r\n\r\nNo bonuses were justified by saying \"at least we didn't have to make redundancies\" which they did 3 years ago with \"last in, first out\" policy dropping about 20 people across both campuses."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Enjoying the role and company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2017", "job_title": "Senior Manager in Greenwich, England", "duration": "N/A", "pros": "Good people, change management, salary, proactive CEO.  Lots of change is happening at GSM and I'm pleased to be part of it and have an input into it.", "cons": "I have been in the role less than one year but so far no major concerns."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "GSM London; Stay away Staff & Students", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Jun 2015", "job_title": "Senior Manager in Greenwich, England", "duration": "N/A", "pros": "Some good support & staff and lecturers. Most of the decent staff have either left or in the process of leaving. It’s been a downhill spiral since the new leader arrived who has very little respect for anyone below them.\r\n\r\nSenior managers and directors are paid a very high salary, if you can get a senior role, you will be super rich, they also give you shares in the company if the person who sits at the top likes you. \r\n\r\nThere are no other benefits, they offer 1% pension and reimburse travel between the 3 ghastly campuses\r\n\r\nYou are guaranteed to see fights/regular conflict between students and staff, students & students and amongst staff members, this can be amusing, it could easily be Greenwich Zoo Not College! I am certain that the College would make lots of extra cash if they started selling day tickets for day entry, there’s lots of fascinating things to see, mainly dirt and grime.", "cons": "GSM London has always had a chequered past, in the early days students could pay for higher grades and degree certificates, now the focus is on the student loans company and how much money they can siphon out from it. Money really talks in this organisation it is the whole driving force of this so called education provider. \r\n\r\nThe new leader is abhorrent, specialising in pubs & bowling alleys, this individual is a discredit to the entire organisation, and they have no respect for less senior members with zero experience of working within any sector of education. \r\n\r\nYou have to work a compulsory 40 hour week regardless of salary or position, this is minimum, generally you will be expected to work 40 – 50 hours per week on a standard contract & salary. This is mainly due to the company disorganisation.\r\n\r\nHR exist only to look out for the person who sits and the top, they are unable to do anything without there say so. Anything you share with HR goes straight to this person so there is no employee confidentiality.\r\n\r\nFalse student attendance monitoring, none of the IT systems work and the data is made up by the finance team for statutory reporting purposes\r\n\r\nCampuses are very unclean and smell fowl the locations are also very poor, I would never study here as a student."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A place built on lies and only making money", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 May 2015", "job_title": "Management in Greenford, England", "duration": "N/A", "pros": "Perfect place for brown nosers. It can be a fantastic place of education once it was before. they want to grow. ( but with an attitude of \"yesterday\" very quickly)", "cons": "This college has become a place of get out of here quick for students and working staff alike. Most of the picture portraited by marketing department is manufactured by top management. They lie all way just to make money and bring anyone with holding a Student Loan. Just to give a small tiny example;  back in 2013 they introduced new programmes called \"Events Management\" but this course was not designated by SLC yet, an internal email memo circulated by head management to all finance department staff members to what to say and answer any student whom wanted to study this programme. Students were told to lie SLC that they were studying someother programme after that school will validate their SLC to withdraw their fee funds and release their maintenance money.\r\nJust a tiny example what this college will do for money from taxpayers. \r\nThis college is for profit only and nothing else. \r\nIf you are working down the chain, you will have no value.. They will lie to your face blatantly that they care for you. \r\nPlace is full of high paid contractors and problem fixers.\r\nGSM London do not trust their own staff and no formal training given. You are expected to know it all otherwise exit door is pointed that is unless if you are close to someone from upper management and talking their voice.\r\nStudents are cheated out from their studies, Different levels of treatment to different types of student. For example; students from certain parts of the world (i.e Middleeast) are treated differently from others. They even manufacture attendance records for UKBA. They even print double Student ID cards to for them so that someother person will come and swipe instead. They (school) assign external people to do these students assignments and sit their exams. Management will go blind eye on all these just because they paid their fees in full. \r\n\r\nThese are only small examples that are only scratching the surface. \r\nHR department of GSM London is the biggest joke in entire UK. HR is there to defend the top management and directors. Nothing is confidential, they will tell anything and everthing about you even if you told them not to, they will even talk about as it was a funny joke and story. \r\nYou will not get promoted unless you are a brown noser. They will award your manager big bonuses but not to you."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Miserable, health hazard (mentally and physically) and politically toxic.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jun 2015", "job_title": "IT Operations in London, England", "duration": "N/A", "pros": "Working at GSM has made me an optimistic. ANYWHERE is a better place of employment. \r\nSome hidden gem employees. \r\nGreenwich is a great location. In summer especially.", "cons": "The foundation (HR team) here is rotten (no ethics and regard for employment law) and the structure (senior management team) was and is built having cut corners (avoiding appropriate recruitment and hiring unskilled interim directors permanently via a ‘it’s who you know’ process) along the way and thus the inhabitants (employees) will soon experience a collapse of the company. Sovereign the Holding Company cannot save this investment.  \r\nSkilled and knowledgeable staff have either disappeared (forced or enlightened and left) or remain in positions where they are being stripped of power demotion by demotion. \r\nJOIN A UNION! That’s the best advice you will be given. \r\nI think the only department worth working for is Careers. They have someone in charge looking out for the teams welfare.\r\nSales have a great commission rate. Especially in an environment where your target audience is… everyone. But you will be exposed and watched in ways you can’t imagine. \r\nStudent Experience… don’t throw yourself in to that black hole. If you manage to leave… it will be with scars. \r\nIf your looking at Director positions… take it. Be demanding and ask for a 6 figure salary. Believe me, the more arrogant and self-centred you are the higher your value in their eyes. They have a Fat Cats situation, where the top is smug and the bottom sits beaten with ‘WIP’s (no that’s not a spelling mistake – it’s an acronym and well placed too if you know what it stands for)\r\nIf you don’t have a degree or masters or PhD apply to be a faculty member. Your co-workers will be a mixed sample of the good the bad and the uneducated. Good luck.\r\nAll Staff Briefings will be a complex puzzles. Read between the lines. Ask questions if you don’t want them answered.\r\nMoney is a complex matter. They spend where they could save and they scrimp where they should invest for long term stability. There is no Financial sense and EVERYTHING breaks down."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "my staff and student experience, a journey from hell!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jul 2015", "job_title": "Student Advisor in Greenwich, England", "duration": "N/A", "pros": "--easy degree & Job – I started studying here in Sept 2011 and working in Sept 2013. I left College with one E for my AS- Level in business and this was the only place in the UK which would offer me a place on there business degree, I'm very weak at exams and stuff, i can barely spell sometimes!! and I failed all the entry requirements but was still accepted onto the two year accelerated programme; Business Management (with Travel and tourism) at GSM London\r\n--I struggled in my GCSE’s & AS Level scrapping through, but GSM give me a 2.2 degree and then a low paid job in student services. i don't remember doing any work during my course or work. (lets just say i got a lot of help)\r\n--You get away with doing little or no work I used to arrive in the morning (late), then surf the internet for most of the day looking for jobs (obviously i never got any), I’d try and sneak in a cigarette break every hour and sneak out early all the time. I also spent a good hour or so hiding in the toilets (even thou it smelled, i got used to it) just to  pass the time.\r\n--The fried Chicken shop across the road is the best fried chicken I have ever had!! I could eat it every day even thou its really dirty inside but the foods is brummy!\r\n-- Free leftover food - when they have external meetings, this was my fav day of the week, i love anything free, even thou it was always old and stale (i still ate it and even took it home sometimes)", "cons": "--They treat staffs badly, I was called a scab by a senior manager during my appraisal and on many other occasions, I was also asked to dress appropriately more than one time, I found this offensive, I was clearly hated by everyone there, students and staff. One times a senior manager commented on my face and in the end i just walked out and leave the company. Maybe if you had provided uniforms like (macs) I wouldn't have had to wear the same clothes everyday!!\r\n--no training; Training was the first thing I needed but denied, I only worked in fast foods and did not have any experience. I was thrown in the deep end without training or instructions, I also felt that I should have been leading my team but my manager thought I was weak, incompetent and untrustworthy so i never got promoted\r\n-- buildings are very old and dirty, nearly as bad as my own place! It’s also very dark and smells all the time,"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The vision  and operatonal  environment took a wrong turn. This can only be attributed to governance and leadership.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Aug 2020", "job_title": "Programmer Leader in London, England", "duration": "N/A", "pros": "A great educational insitution with a long history and sound inclusive values", "cons": "Governance and management took some wrong turns with devastating financial consequences. I mean that the financial risk analysis was not robust enough to keep the institution solvent."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Challenging but definitely rewarding", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 May 2016", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Some very good professionals work at GSM, dedicated to the vision of providing open access education, and upholding real social mobilityor", "cons": "Benefits package only \"middle of the pack\"  and only a workplace pension offering"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Well thats all folks", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Aug 2019", "job_title": "General Manager in Greenwich, England", "duration": "N/A", "pros": "Great students and great to see students succeed, though there were also challenges\r\nDemanding and challenging culture (in a good way)\r\nGreat delivery-focused colleagues\r\nGenuinely diverse faculty and workforce", "cons": "Well sometimes you cannot improve quickly enough / you cannot provide the data to show improvement quickly enough \r\n\r\nExternal factors"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Marketing Innovators in education space", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Mar 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Small company means you are part of a close community \r\n\r\nMake a difference to the lives of students \r\n\r\nHealthy marketing budget means you can explore the full marketing mix\r\n\r\nQuick decision making", "cons": "Systems and processes are not robust/ new which can be frustrating \r\n\r\nSales target driven environment which may not suit everyone"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great people, awful management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Nov 2016", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "People. That's it. But you can learn a lot from the good ones.", "cons": "Pay, management, not paying promised bonuses, progression limited unless you suck up and often expected to travel between sites."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Dedicated to creating opportunities for students", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Oct 2019", "job_title": "Lecturer in Greenford, England", "duration": "N/A", "pros": "- Invested and supportive academics who take pride in what they do\r\n- Dedicated and committed professional services team\r\n- Diverse body of students \r\n- staff development opportunities", "cons": "- facilities e.g. WCs and student zones\r\n- hot and cold temperatures in offices"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Work life", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jan 2017", "job_title": "Library Assistant in Greenford, England", "duration": "N/A", "pros": "Friendly helpful staff and motivated students", "cons": "Not cheap tp live in the area"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Very good atmosphere and excellent team work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jun 2020", "job_title": "Lecturer in London, England", "duration": "N/A", "pros": "Supportive manager\r\nTeam work\r\nCPD Training\r\nSalary not bad\r\nHighly inclusive", "cons": "Lecturers' timetable not always provided on time"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2017", "job_title": "Anonymous Employee in Greenford, England", "duration": "N/A", "pros": "Good company benefits, training opportunities and good team environment.", "cons": "Location not the easiest to get to."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great boss!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jul 2020", "job_title": "Careers in London, England", "duration": "N/A", "pros": "Director of careers was the best boss ever", "cons": "Some bureaucracy which led to challenges in approvals"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Transparent review", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "There are some pleasant students, faculty and staff", "cons": "Office politics and uncomfortable working environemnt"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't dare", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Aug 2019", "job_title": "Senior Lecturer in London, England", "duration": "N/A", "pros": "Students are the only pros.", "cons": "Everything else. But more of management."}]]