[[{"date": "17 May 2023", "title": "Housing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Home Group (London, England)", "Interview Descriptions": "Written assessment about block management, writing a letter to the residents. On line interview with two Operation Managers and Resident. The interview lasted 40 minutes, questions were scenario based (safeguarding issue)", "Interview Questions": "-Tell us about your self. -Scenario based (Safeguarding issue and how I resolved it) -Give an example of something non-compliant which can be dangerous for the company and the resident at the same time."}], [{"date": "5 May 2022", "title": "First Line Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Home Group (Newcastle, England) in May 2018", "Interview Descriptions": "Interview process was easy enough. It was arranged through an agency who basically told me where to go and who to ask for.\r\n\r\nAsked questions regarding the company principles which I gave real world examples for and got the job.\r\n\r\nGreat place to work", "Interview Questions": "Asked questions regarding the company principles which I gave real world examples for and got the job."}], [{"date": "28 Dec 2017", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Home Group in Feb 2013", "Interview Descriptions": "Contacted on LinkedIn by a Senior Manager asking if I was interested in applying for a role they had, attended a face to face interview a few days later with one excitable Manager and the Senior Manager who contacted me, who, to be honest, was more interested in what was going on in the office behind me. Completely uninterested in the interview. I was told I would receive a follow up phone call a few days later with any further questions, this did happen and I was offered the role and accepted. Hindsight is a fine thing....", "Interview Questions": "Can you build a server from a bit of tin"}]]