[[{"date": "6 Jan 2023", "title": "Advocacy Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ANCOR", "Interview Descriptions": "Multiple stages, a lot of transparency throughout the process, largely consistent communication. Included an initial screening interview, a writing exercise with ample time to complete, a panel interview, and then an interview with the CEO and another staffer", "Interview Questions": "Q. How did you prepare for this interview?"}, {"date": "25 Dec 2021", "title": "Director Level Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ANCOR (Washington, DC) in Dec 2021", "Interview Descriptions": "Initial Zoom interview with CEO and VP, and a follow-up, informal Zoom interview with potential team members. One round of written follow-up questions after second interview. Hiring manager kept me well informed about hiring timeline and when I could expect to hear back from them.", "Interview Questions": "What about this position draws you to the field and motivates you?\r\nWhat distinguishes you as a candidate for this position?\r\nCan you tell us about a successful campaign you have run in the past?"}, {"date": "1 Mar 2023", "title": "Auxiliar De Produção Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ANCOR in Mar 2019", "Interview Descriptions": "bom com poucas perguntas mais todas bem explicada separada para cada uma e objetiva para a função colocaram cada um uma sala explicou com seria a entrevista perguntou o quando queria ganhar e qual horai disponível nome dos pais experiencia profissional quando tempo na função", "Interview Questions": "o que espera da empresa"}, {"date": "1 Feb 2018", "title": "Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at ANCOR", "Interview Descriptions": "Official Interview Process never got off the ground, their immediate and insistent demand for salary requirement(s) prior to meeting - along with a woefully low and apparently non-negotiable salary range - made interviewing a non-starter.", "Interview Questions": "(correspondence #1)  Tell me, what are your salary needs?"}, {"date": "22 Jun 2017", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at ANCOR (Troy, MI) in Apr 2016", "Interview Descriptions": "You'll be in a conference room with several leaders from several teams. About 12-15 people were in the room.  They'll ask you some work history questions about your history, and some basic technical questions.  Afterward, if you pass that, they'll have you take a logic test.", "Interview Questions": "What are some of the details of some recent projects that you worked on?"}], [], []]