[[{"date": "25 Apr 2023", "title": "Underwriter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aviva (London, England) in Apr 2023", "Interview Descriptions": "Spoke to recruiter, about 2 weeks later was booked for an interview with team. Mostly talk about experience, motivations and I was provided with lots of detail on what the job involved and how the team was structured.", "Interview Questions": "How would your academic background help"}, {"date": "21 Sept 2022", "title": "Underwriter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Aviva", "Interview Descriptions": "Zoom first stage interview with basic strength based questions. Easy to answer and a very comfortable environment. Lasted around 30-40 minutes with the opportunity to ask questions at the end.", "Interview Questions": "Your basic daily routine and what an ideal day would look like"}, {"date": "3 Dec 2021", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aviva", "Interview Descriptions": "The interview was conducted online with pop up questions. Given some time to think about your answer and then five minutes to speak. A range of different questions were asked.", "Interview Questions": "Where do you see yourself in five years"}, {"date": "6 Sept 2022", "title": "Investment Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Aviva (Milan) in Nov 2020", "Interview Descriptions": "Il colloquio si è basato su una conoscenza generica del CV e dell'esperienza lavorativa. Dopodichè sono seguite alcune domande tecniche sulla posizione, in particolar modo sul mercato Fixed Income che era il focus della posizione. Infine sono state effettuate alcune domande sulle soft skills.", "Interview Questions": "Can you give an example of something you consider innovative? "}, {"date": "19 Jun 2019", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Aviva (Los Angeles, CA) in May 2019", "Interview Descriptions": "First was a call to schedule the interview from the HR personel,It is a Two-stage process, First Interview with the HR, second with the clinical director and another high ranking member of the agency.", "Interview Questions": "Why do you want to be a therapist"}, {"date": "20 Oct 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Aviva in Sept 2016", "Interview Descriptions": "Submit resume online. There are two rounds of interviews. HR Manager contacts and schedules you for interview. Interview with HR Manager is the first round. Interview with potential Supervisor. notification of second interview is via email", "Interview Questions": "How do you practice self care?"}, {"date": "14 Aug 2015", "title": "Outreach Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aviva (Los Angeles, CA) in Jun 2012", "Interview Descriptions": "Went for 2 interviews, the first one was very good. Second one was not that great. When it came to the second interview the person who interviewed me was very rushed and did not really acknowledge me. I felt that by the time I went for the second interview, the person had already picked another candidate, as she had no interest in what I had to say. I ended up not getting the job and then was called about a month later and offered another position, which i declined.", "Interview Questions": "Tell me about yourself."}], [], [], [], [], [], [], [], [], [], []]