[[{"date": "8 Jun 2023", "title": "Internal Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi)", "Interview Descriptions": "Video recorded pre-screen followed by an interview with an HR rep. Next, the interview with Director and HR Rep, then only Director, followed by a group interview with the Team", "Interview Questions": "What are your strengths? What are your weaknesses? Tell me about a time you handled a difficult situation or crisis?"}, {"date": "21 Feb 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York University Abu Dhabi", "Interview Descriptions": "Submit an application through inter-folio, heard back after a couple of weeks regarding an interview with the head of the lab where you discuss the nature of the work, your skillsets and your prior contributions.", "Interview Questions": "What was one challenge you previously encountered and how did you overcome it?"}, {"date": "29 Dec 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New York University Abu Dhabi in Oct 2022", "Interview Descriptions": "Very slow and inefficient interview process. Applied for several roles and did not receive a decision for 3-6 months. One I have yet to hear back at all. No response from HR to follow up emails. After interview received no application feedback despite requesting it multiple times, or information about what to expect for the next stage of the process. Again no response from HR", "Interview Questions": "-Why do you want to work here - What will you bring to the role -Discuss successful project -Discuss with international working -Discuss leadership and managing a team"}, {"date": "9 Jun 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 months. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Jul 2022", "Interview Descriptions": "Was very long, took almost 6 months and nearly 3 rounds including a video-recorded interview. And that comes after a job application. There was a long period of time after the interview time for security checks by the local authorities that took almost 6 weeks before the final reply.", "Interview Questions": "Previous experience. Type of challenges Ability to work for long seasons and on weekends."}, {"date": "7 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York University Abu Dhabi", "Interview Descriptions": "Although it was schedule very last minute, the interview process was smooth. It was Engaging, comfortable, gained a lot of insight about the university, environment, laboratories. The PI was a delight to engage in a conversation with.", "Interview Questions": "What do you hope to gain from your time at NYUAD"}, {"date": "7 Aug 2021", "title": "Design Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi)", "Interview Descriptions": "After applying online I was asked to go through an in-line interview stage. A link was sent that logged me into a website where I was asked questions (not by a person but by the computer) and it recorded my answers within a set period of time. About a week later I was invited for an in-person interview with the full team and to do two technical tests.", "Interview Questions": "After the initial recorded interview, I was invited to do two technical tests, an MS office one and a design oriented one. I was asked to edit and create executive summaries, and work on some excel sheets for the first. For the second I was asked to go through a sketch up model and modify things based on a plan. "}, {"date": "9 May 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Mar 2021", "Interview Descriptions": "The interview process consisted of a virtual interview with timed questions to answer. Before each question, you are given some time to prepare, then the recording is reviewed by the talent acquisition team.", "Interview Questions": "What makes you stand out from others?"}, {"date": "12 Feb 2021", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York University Abu Dhabi", "Interview Descriptions": "i do not know how to say this but the interview process is kinda cool. the process is fairly competitive because the school itself is very prestigious. but blu blu blu blu blu", "Interview Questions": "what is your  name?\nare you an asian?\n"}, {"date": "29 Sept 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York University Abu Dhabi", "Interview Descriptions": "questions about my previous experience with software engineering and if I am interested in the available project to work on. After considering the project, I accepted. This is the first assistantship I ever had", "Interview Questions": "What is my experience with soft dev"}, {"date": "8 Apr 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York University Abu Dhabi in Jul 2020", "Interview Descriptions": "interview  was  through zoom, first  they introduce the research and what they do and describe the job  to me then asked me basic  questions such as talk about my self and about my major and others.", "Interview Questions": "Talk about yourself?\r\nstrength and weakness"}], [{"date": "6 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Mar 2020", "Interview Descriptions": "Pretty average but they ask later on about the role specifically such as they area I'm looking forward getting into and what do I know. It's a good interview and the interviewers are quite nice and professional.", "Interview Questions": "Tell you about the reason you want to get into this field"}, {"date": "22 Nov 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Nov 2018", "Interview Descriptions": "I applied online through the Kawader Research Assistantship program. I emailed in my application and within three hours received an interview request for the next day with the principal investigators of the lab. It was a very casual interview and included a tour of the lab. Also had a chance to meet with the rest of the team and discuss some of the research currently happening. It was great because it was a chance to get a feel for the dynamics at the lab and see if it would be a good fit for me. Everyone was super friendly and helpful in answering any questions I had.", "Interview Questions": "What are your areas of interest?\r\nWhat qualities make you suitable for this position?"}, {"date": "24 Jan 2018", "title": "Assistant Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Mar 2017", "Interview Descriptions": "Submit CV,  in-person interview, online video module. The in-person interview included an external reviewer, a professor that was not part of the department but that might at some point be a collaborator. This was helpful as he had different questions and gave me a better idea about what the job might look like.,", "Interview Questions": "How would you deal with a particular issue relating to a student?"}, {"date": "29 Aug 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York University Abu Dhabi in Oct 2016", "Interview Descriptions": "I was interviewed by the principal investigator (PI) through Skype.  PI explained what is expected of me and asked for my experience with regard to certain research techniques. There was a minimum amount of tension.", "Interview Questions": "I was asked about my knowledge in particular research techniques. I was also asked how teaching experience could become useful when carrying out research.  PI did most of the talking during the interview."}, {"date": "21 Feb 2018", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Sept 2016", "Interview Descriptions": "I did the interview through Skype, as I was in China at the time of the interview, and I am not convenient to travel to UAE for an interview. previous work presentation using PPT. All lab member gathered together, ask you questions about your work. mainly focus on the work you have done, and maybe something about how it connects to the work you want to do if you get the offer.", "Interview Questions": "Many questions about the lab's research direction."}, {"date": "4 May 2016", "title": "Mod-Senior Management Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi)", "Interview Descriptions": "Recorded Video interview (no one on the other side just timed questions in a test like environment.. ).\nDidn't hear back for two weeks or so then after following up they set up a next face to face meeting with a committee. It went very well and got positive cues from HR. \n\nAfter the interview i had to follow up a couple of time for 6-7 weeks .. Some times without hearing back!! Or they would just tell me they will get back to me within same week and they wouldn't. Then Finally a template email of rejection,  which was good because An applicant needs to know where they stand. \n\nThe lack of feedback/communication after the interview, the team not having the courtesy to reply to a follow up even with a \"still in progress\" email, has killed my enthusiasm about the organization in general and role in specific.", "Interview Questions": "What do you think of our website?  What would you fix?"}, {"date": "14 Sept 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York University Abu Dhabi (Abu Dhabi, Abu Dhabi) in Jun 2015", "Interview Descriptions": "First a Skype meeting asking about some academic questions, which took about half an hour. While I was waiting for the feedback of the Skype meeting, I received an email and was asked to give a presentation on the NYUAD campus, for which they covered all the cost.", "Interview Questions": "Mostly about research. Some discussions about living in UAE and NYUAD, as well as the salary and the additional benefits ."}]]