[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Thank you", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Feb 2021", "job_title": "Employment Consultant in Brisbane", "duration": "N/A", "pros": "Supportive Management, good team environment", "cons": "Nothing, I had a very positive journey"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Forget it", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Apr 2023", "job_title": "Employment Consultant in Brisbane", "duration": "N/A", "pros": "Fabulous job ads. Great participants to support.", "cons": "Poor culture, pay and conditions. Bullying and favouritism happens. Extremely high staff turnover."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Room for Improvement", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Apr 2023", "job_title": "Employment Consultant in Brisbane", "duration": "N/A", "pros": "Good team environment and local leaders", "cons": "Senior leaders not visible at site level"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic workplace. Don’t work here.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jan 2021", "job_title": "Employment Consultant in Brisbane", "duration": "N/A", "pros": "Rostered day off a month\nOn paper looks great. (Values and behaviours)", "cons": "Micromanagement \nClicky groups and favourites \nReactive not proactive \nPoor leadership \nUnsupportive \nAll about money rather than client needs"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bad Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Employment Consultant in Melbourne", "duration": "N/A", "pros": "Attracts good people wanting to help people, so colleagues were like minded and great to work with.", "cons": "Culture from the top is poor, everyone talks about playing above the line on one hand while playing below the line on the other. Those who are underhanded continue to be recognised for their 'good work', while stonewalling others. Uniforms are to be worn and head office dictate rules and regulations and motivate with fear. There is not a lot of support for the staff in the field to help you fulfill your role, with only a few exceptions that are helpful at head office. Flexible working hours  requests to meet the demands of my family life were refused.  Pay isnt great, company cars are given, but you have to pay for the privilege."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor management and culture. Steer clear from this company!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Sept 2019", "job_title": "Employment Consultant in Brisbane", "duration": "N/A", "pros": "One of the main benefits of working with this company is working with like-minded people to help our client's reach their goals.", "cons": "Management- offers no actual support to issues or assists with any solutions that are needed, uses performance management as a tool to get rid of staff instead of giving them tools to help improve their performance, Epic's policies are monthly one on ones with managers however these meetings hardly occur and when they do it is more management telling rather than listening to the staff. Management have an unrealistic view on what they expect from staff however give no support when asked. HR is one of the rudest people to deal with, whenever there are issues they do not listen and only go off paperwork which most of the time it is forged.  Management use intimidation not only with staff but also with client's to get them to do job trials and will suspend their payments for any reason if it was justifiable. \r\n\r\nEpic's Behavior's- these are implemented by management however management do not follow these but enforce staff to adhere to these.  \r\n\r\nBottom line staff have little to no communication with Senior Leadership Team members yet they are the only staff that can give references when staff would like to leave. They do not base it off the work that you do and most of the Senior Leadership Team members do not know staff names or little about how the staff member works in a team etc. which would be beneficial for a new employer to know. The reference that they would provide is based of statistics which in the past have proved inconsistent with the database they use. \r\n\r\nThe client's that we service struggle with change yet whenever this feedback has been passed onto management they brush it under the carpet and advise they need to get use to change- while this has some sense to it when client's have 4 consultant changes in 4 months this is beyond the need for them to adapt to change. This feedback was not taken on board and clients are suffering the constant change of consultant and confusion on who their consultant is. \r\n\r\nOne of the main disappointments with working for this company was when female staff would bring to management being uncomfortable in an office due to a male client coming in and being verbally abusive as well as punching the office walls that management has not done anything to assist in making sure that females feel comfortable in this site- yet they are left to cover this site by themselves."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sinking ship!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Sept 2019", "job_title": "Employment Consultant in Brisbane", "duration": "N/A", "pros": "I have made some wonderful friends through my 4 years at this company.\r\nI realized my professional and personal strengths can't be broken by this company!", "cons": "Lowest paying DES in the industry.  Management promote core values - but don't adhere to them themselves, they lead with intimidation. There were always threats of losing our jobs if targets weren't met, they would say the site would end up closed down - again more threats.\r\n\r\n All types of abuse going on in my time there. Underhanded processes so that claims were able to be taken. The poor customers have more than 5 changes or so per year on EC caseloads - the customers scream for consistency and great customer service but upper management continually change staff's roles/sites and the staff are forever disconnecting from strong customer relationships they've built and apologizing to unhappy customers. \r\n\r\nThere is a narcissism in the air at times, a lot of trumpets being blurted instead of head down bum up hard work being done. Offices lack professionalism boundaries by managers and staff sometimes followed suit. This is a sinking ship in my opinion JUMP, don't come aboard!\r\n\r\nSenior Leadership are the only references available. Most staff members have never met one! The references available would lack every detail required by a new employer and is a direct stand over tactic by EPIC to attempt to reduce staff from applying for roles at other DES providers.\r\n\r\nEPIC is not about their customers. They are only about their bottom line $$$."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Save your mental health and avoid EPIC Assist!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Nov 2019", "job_title": "Business Development Manager in Brisbane", "duration": "N/A", "pros": "The people working here are  lovely.", "cons": "Nice people are where the positives stop. EPIC Assist is a company which takes nice people in, chews them up and spits them out. You’ll never have seen a company which has such a high staff turnover like this one. \r\n\r\nThe turnover is high because the management have high KPIs set for everyone. People are intimidated and ruled with an iron fist. Every conversation from management comes back to getting people into employment, 'placements'. Management will continually remind staff if they don't meet their placement targets, they'll lose their jobs. If you don't work 150% you'll lose your job. If you're late because you had a family emergency, that's right, you'll lose your job. \r\n\r\nThis means you'll be working in fear for your job, your financial security and your mental wellbeing. The dictatorship will see each minute of your day recorded and scrutinized. Your manager will be watching you from the corner of the office with one eye on you and their other eye watching Netflix. A good manager is one who leads their team by example, not one who sits back and micromanages. \r\n\r\nPeople join this company to help people with disability get sustainable employment. The pressure of management means people with disability are being placed into unsustainable employment and sometimes employment which sets them back in their journey. \r\n\r\nIf you work for this company, you'll know intimately what it means to have disability. That's because you'll likely develop anxiety and depression while working here!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working for EPIC Assist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Oct 2017", "job_title": "Corporate Account Manager in Gold Coast", "duration": "N/A", "pros": "Working with like minded companies to place people with disabilities into employment.", "cons": "I enjoy working for EPIC Assist and they are a suppotive employer"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing community", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2020", "job_title": "Employment Consultant in Launceston", "duration": "N/A", "pros": "Team team team and ten amazing values", "cons": "Nothing comes to mind at this point"}], [], []]