[[{"date": "15 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "3 rounds of interview consisting of questions about questions about educational background, past research experienced and a few questions related to the position I applied for. Should be able to explain past research really well.", "Interview Questions": "Most were about past research"}, {"date": "25 Jun 2021", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University of Singapore", "Interview Descriptions": "Email the research team or fill out their applications usually listed on the home page. It'd help to be specific about your research experience and how it relates to their team.", "Interview Questions": "Explain past/current projects, why you are interested in research, career plans."}, {"date": "28 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore in Nov 2018", "Interview Descriptions": "I emailed the prof. enquiring about a potential internship position. I was interested in machine learning based project. I got a reply within a month. As few of my seniors already worked for the same professor, the apping process was not that difficult.", "Interview Questions": "They asked me about my work experience in the field of ML. Discussed my projects."}, {"date": "25 Apr 2022", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at National University of Singapore (Chennai) in Aug 2018", "Interview Descriptions": "The interview consisted of two rounds: \r\nRound 1: To assess our written communication skill\r\nRound 2: Technical round about our education, work experience, research works,software skills, motivation to join a doctorate program and our knowledge about the research group that we applied to.", "Interview Questions": "About one of my past research paper publication"}, {"date": "1 Apr 2018", "title": "PhD Candidate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National University of Singapore (Vāranāsi) in Jan 2018", "Interview Descriptions": "I applied through their online application portal and was called for the interview after 2 months. The interview took place for about 10 minutes. There was a panel of 4 professors known as the postgraduate committee who interviewed me.", "Interview Questions": "They asked general questions like why NUS, current master's project, a few questions related to the current master's project, one good quality of me, and any questions."}, {"date": "1 Dec 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University of Singapore", "Interview Descriptions": "had two Skype Interviews. Was given a project for 3 months and based on the performance was given PhD position.  Skype interviews were based on profile and previous projects.", "Interview Questions": "Was asked to explain profile and previous projects"}, {"date": "20 Sept 2018", "title": "Ph D Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National University of Singapore (Bengaluru) in Oct 2015", "Interview Descriptions": "Pretty easy. Basic questions that regarding my interests and motivation to do research. Interviewer also asked about the reason to chose NUS. An exam testing basic knowledge was also conducted before the interview process.", "Interview Questions": "Why do you want to join NUS"}, {"date": "2 Mar 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National University of Singapore (Bengaluru) in Mar 2015", "Interview Descriptions": "Their interview was three stage\r\n First you apply via online ,\r\nWritten test at Venue about the basics of the subject\r\nInterview with professors\r\nThey were actually very chilled and helpful\r\nWhy Phd?\r\n- Previous work experience\r\n-Questions related the work experience\r\n-Subject knowledge", "Interview Questions": "-Why Phd?\r\n- Previous work experience\r\n-Questions related the work experience\r\n-Subject knowledge"}, {"date": "19 Nov 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National University of Singapore (New Delhi) in Mar 2013", "Interview Descriptions": "The process consists of an online application form followed by an interview panel. The interview is mostly a screen for cultural fit.The interviewers were very professional and a pleasure to talk to. I thoroughly enjoyed the interview. The questions were relevant and approachable. I accepted the offer.", "Interview Questions": "Why are you keen on a Ph.D.?"}, {"date": "6 Aug 2013", "title": "Research Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at National University of Singapore (New Delhi) in Sept 2009", "Interview Descriptions": "Of late NUS has become quite stringent in selecting students. However a good undergrad university or a good CGPA can easily propel you to the elite list. Still to quantify the criteria, for GRE: I would say, there is no magic score but 1300+ should be safe. As for TOEFL: 90+ should be fine. But most importantly a good Statement of Purpose and research oriented CV can do wonders. Actually, your research ideas and ambitions are your USP. And during the final interview the interviewer would be more interested in your Final year Project and internships rather than your scores and grades.", "Interview Questions": "There is no perfect recipe for the selection process. Admits vary each semester. As usual masters admit is easier to obtain than PhD for one thing, PhD admit is determined by the no. of scholarships available for the semester intake."}]]