[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Place To Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Mar 2023", "job_title": "Executive Assistant in Cromwell, CT", "duration": "N/A", "pros": "Great working environment. Friendly staff. Computer and technology staff excellent. Comparable wage for job duties. Great boss.", "cons": "I don’t have any cons at this time."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Fulfilling work, yet wanting more", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 May 2023", "job_title": "Job Coach in Middletown, CT", "duration": "N/A", "pros": "Friendly work environment, Overall supportive admin/coworkers, Health Insurance, 401k/Benefit plans, PTO/STO and paid Holidays", "cons": "Can be physically/emotionally demanding , Low pay compensation, May be injured, accumulation of PTO lacking, Not all of STO is covered by company"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Communication", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Sept 2021", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "Support staff Supervisors are amazing .", "cons": "Directors/CEO/ and other higher ups not understanding how to communicate important information properly."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Being lazy when trying hard never works", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Oct 2020", "job_title": "Behavior Technician in Cromwell, CT", "duration": "N/A", "pros": "Full-time Benefits \r\nHSA account \r\nexperience with ABA techniques", "cons": "lack of training \r\nlack of resources (staff, funding, buildings) \r\nlack of respect for staff \r\nstressful environment 24/7"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Turn to Channel 4", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Apr 2018", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "You can make a difference in a child’s life.\nMany staff members are nice people. \nFree meals (they try their best!)", "cons": "Very difficult kids to work with. \nYou will sit through a week of training; none of it will prepare you for what you’ll ultimately face.\nYou will get hit, kicked, screamed at and spit on. You will end up in a therapeutic hold and it will suck. \nJob burnout is frequent and HR does not care or do anything to help with that.  \nIf you’re lucky enough to have benefits, you will get very little PTO. \nTeachers are required to work 12 months as the school runs year round. \nIf you are seen with your cellphone on your person, you will be written up and fired if it happens again. \nThe company is not loyal to their best employees (ex: firing the most amazing director of Ed after 15 years of service with no warning/explanation to staff or students) \n\nI worked at the Learning Center in Cromwell for several years and saw a lot of stuff I’d rather forget. I met a lot of nice people, both staff and students, but overall the negativity of the environment is too toxic for anybody to manage in a healthy way. This job has the potential to leave you with some emotional damage that you may have not anticipated."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "...", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jan 2021", "job_title": "Licensed Practical Nurse (LPN) in Bristol, CT", "duration": "N/A", "pros": "Nurses, kids, schools, easy job", "cons": "Staff, short, pay, communication, favortism"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Please retrain everybody on the value of good ethics.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Dec 2016", "job_title": "Licensed Practical Nurse in Cromwell, CT", "duration": "N/A", "pros": "I like working with some of my fellow colleagues. I honestly believe they value the work they do and care very much about the clients. There would not be any other positives I can think of.", "cons": "Too many negatives come to mind while working at Adelbrook. The first is ethics, and some of the people working for this agency are very unethical. Breaching confidentiality is one issue, because several of the people working for Adelbrook need to be trained better on HIPPA regulations and what it covers. Sexual harassment by management is another negative, because some of them are really perverted and downright nasty, especially in their treatment of women which is very offensive. The worst negative about Adelbrook is how rough and abusive some of the agency's employees are with the clients! Please retrain everybody on how to provide a more therapeutic milieu for vulnerable clients, instead of allowing for them to be abused and mistreated. Thank you kindly for your attention to this."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A Good Company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Dec 2020", "job_title": "Counselor in Hartford, CT", "duration": "N/A", "pros": "It is A very Good company", "cons": "N/a i have no comment"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Ethics in your organization needs to improve substantially!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Nov 2016", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "I liked several of the relationships which I built with the people I worked directly with. They all cared very much about making the lives of the clients better.", "cons": "Constant sexual harassment from management entrusted to serve as positive role models was one con. Several of the management here was disgusting and very degrading to their subordinate employees! Another big con was how dishonest some of the management was and in several instances they gossiped about me and even shared confidential information from inside my personnel file with other people who should not have had access to this information! That is extremely unethical and some of the management in your agency needs to be taught the value of ethics. The biggest con for me was how out of touch the management was with reality. They were not very skilled in managing the programs and I feel like there was a lot of corruption occurring here on a daily basis."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Big Growth, Larger Impact for Kids in CT", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jun 2017", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "I left the company to pursue higher education.  I read the comments listed and feel that it is reflection of Adelbrook only keeping positive and effective staff on board.  Those who write nasty reviews are usually not of the majority.   As with any clinical behavioral company, there are ups and downs with treatment as each kid needs different therapies.  I believe that Adelbrook is making a difference with kids across the state of CT that would otherwise not be getting care at all.", "cons": "The company and services have grown expotentially across the state of CT in the last 5 years which allows services to reach more kids in the area.  It can also cause a bit of a lag with infrastructure but I believe that it will improve as the company adjusts to its growing size."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Zero morals and big time corruption!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Nov 2016", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "Most of my positive comments would be about the children. I miss all of them and hope they are doing their best to realize their full potential. Several of my colleagues were also grade A++", "cons": "There are actually too many to list! My management crew was extremely immoral and I left because of them. They were too busy gossiping about other their subordinates instead of helping them to realize their full potential. Perrsonnel files were not kept confidential and one of my colleagues on multiple occasions was allowed access to mine? Extremely immoral!! Some of the management within my particular department were also very disgusting and perverted!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Better job opportunities offered after working here", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Oct 2020", "job_title": "Behavioral Technician in Cromwell, CT", "duration": "N/A", "pros": "Plenty of overtime and money to be made", "cons": "High staff turnover rate, lack of support. Not much room for advancement, and plenty of situational prejudices occur."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Horrible!!! Only reason I lasted as long as I did because of the clients, (some) staff, & $$", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Aug 2016", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "Working with the kids, & money was ok at the time, & a handful of staff were great. Free dinner that was ok I guess, oh & off ground trips were fun as well", "cons": "I worked there for 6 yrs....... Horrible is how I can describe it,money seem to disappear by \r\n  administration, backstabbing coworkers who you think are your friends but are not, and people coming down to the units and telling you how the kids need to live their lives and what treatments they need or what we need to do with the kids but you would just wish that those same people would take a minute and work a shift in your shoes, Administration is all about themselves & not the staff, long hours, too many chiefs & not enough Indians, never enough money for the kids to enjoy off grounds activities, oh & bed bugs!!!!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Like every job, it has its +'s and a-'s", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Nov 2017", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "•Infinite chances to make even the smallest positive difference in the lives of often fostered, special needs children, whether educationally, personally, hygienically, life advice or just putting a smile on their face.\n*It is VERY personally gratifying*\n•Not all, but most staff, whether administration, teachers, behaviorists, social workers, OTs and support staff, are on the same page, wanting what's best for the kids, and are eager to help each other. \n•Behavioral plans catered to each individual child are usually spot on, offering specialized care these kids wouldn't get anywhere else. \n •Many fun activities for the kids and staff alike", "cons": "•Not all staff are in the same boat... to work together with co-workers with the kids' best interests at heart; particularly certain female staff. They have their own agenda, they are vindictive, spiteful, catty, petty, rude, and disrespectful, not only to students but fellow STAFF as well! \n•Aside from getting more college degrees, there is 0 room for growth in the company. \n•By far the biggest con is the pay which is extremely sub-par for what we do, considering we are expected to put our personal safety at risk every day, getting scratched, bit, punched, kicked, attacked etc. \nAnd there is no yearly cost of living salary increase, how can that be?!?\n•Despite poor pay and being under appreciated, ALL employees are extremely expendable. \nTwo-to-three DOZEN staff have been fired and/or quit since 2016, from the previous Principal who was fired after 15+ years, to the newly hired library technician, whom were both escorted out by police, to a support staff who was fired after winning Employee of the Year just a few weeks prior. 0 Loyalty to its employees."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Please read", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Jul 2020", "job_title": "Behavioral Technician in Cromwell, CT", "duration": "N/A", "pros": "Easy job to get hired for regardless of degree as long as you have a bachelors.", "cons": "Supervisors play favoritism, mandations are ridiculous, extremely under staffed, supervisors think it is ok to fill schedules with per diem staff. Pay is not significant especially with some of the work that is asked for you and the difficulty of some kids. Administrative staff act as though they are above residential staff. There’s not much room to grow in the company. They will hire someone who is not qualified for a position if they like them vs someone who is qualified and applying for that same position."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "good company low pay", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Apr 2014", "job_title": "Direct Care Counselor in North Haven, CT", "duration": "N/A", "pros": "The company is recently expanding and adding more locations, They are hiring a lot of people. The clientele are very challenging to work with but can help you learn and grow in the field. They offer a lot of training paid when you get hired before you start working. Some opportunity for growth. A lot of hours available.", "cons": "Low pay for the amount of work load. Challenging clientele can cause serious injuries. Low pay for the degree expectations. Very little to no pay increase. Terrible schedules offered to direct care staff to have a personal life outside of work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Dec 2018", "job_title": "Administrative in Cromwell, CT", "duration": "N/A", "pros": "There is not a single reason to work here.", "cons": "If I could give this place zero or negative stars, I would.  Toxic, corrupt, abusive and noncompliant.  No reviews in years - don't know why the DOL hasn't come after them.   \"Competitive\" pay is a joke - you can do better at the fast food places and big box stores.   Absolutely no opportunities for promotion or advancement unless you 'know' someone.  HR has the biggest bunch of entitled snobs I've ever seen.   Coworkers are all brown nosers or back stabbers.    Management doesn't tell the truth about anything.   It's basically a dictatorship - say one unfavorable word and there are repercussions."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Therapeutic interactions need to increase!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "10 Feb 2017", "job_title": " in Cromwell, CT", "duration": "N/A", "pros": "All the children I worked with in Adelbrook were real sweethearts!! I wonder how some of them are doing right now? Hopefully some of them went on to success and I know in my heart all of them would in some way. This was my favorite part of the job. Some of the benefits, especially the dental coverage were very affordable too.", "cons": "Some of the children had behavior issues so they would lash out of anger or frustration. That sometimes made the job a littlbe bit difficult. But once you remind yourself that the children have difficulty managing their emotions, its really not that bad."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work if you want to make a difference!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 May 2019", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "Meaningful work with students with autism. Ability to make a difference. New CEO is driving organization in a great direction.", "cons": "In the past, management has been a problem, but the new CEO is working hard to make positive changes and be more supportive of the employees."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Ädelbrook is bigger than any one person!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Aug 2017", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "The agency's mission and purpose is a worthy cause.  No two days are the same and it's exhilarating working side by side with such amazing people.", "cons": "Many people do not utilize the supports and services afforded to them by the agency...often being misled by less informed coworkers or taking\"tales\" of the past as fact."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Mar 2015", "job_title": "Administration in Cromwell, CT", "duration": "N/A", "pros": "The work being done here is truly remarkable. The President is a visionary...115 years and not slowing down!", "cons": "So many programs with little technology infrastructure makes communication difficult at times"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Very supportive of staff", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2015", "job_title": "Residential Lead in Waterbury, CT", "duration": "N/A", "pros": "Adelbrook is growing very fast and it's just a great feeling to be a part of that.", "cons": "Residential services is still new but we are growing and learning at the same time."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Poor overall management outside of nursing department", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "3 Jan 2017", "job_title": "Licensed Practical Nurse in Cromwell, CT", "duration": "N/A", "pros": "Nursing department is supportive of their nurses.", "cons": "A lot of overstepping with chain of command occurs outside nursing department"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Administration", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Aug 2015", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "Flexible hours, free lunches, some good people but not many.", "cons": "Low pay, unprofessional coworkers, managers who claim to be  too busy to sit down and talk to you, some of the computer software seems to be hopelessly outdated.  Terrible cliques.  One manager in particular is just plain nasty.  No place to park."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Jul 2018", "job_title": "Director of Marketing and Communications in Cromwell, CT", "duration": "N/A", "pros": "Flexible, growth opportunity, great HR department", "cons": "Some of the clients present with complex, challenging diagnoses"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "direct care", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Sept 2017", "job_title": "Direct Care Staff in Cromwell, CT", "duration": "N/A", "pros": "One good reason for me (its rewarding)", "cons": "Its too far from where I live"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Team oriented Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Mar 2018", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "Strong Training Programs\r\nSupportive Team\r\nLots of room for growth", "cons": "Nothing that I can come up with"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "RPI", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Mar 2018", "job_title": "RPI in Simsbury, CT", "duration": "N/A", "pros": "Great staff amazing clients offer a lot for the client", "cons": "No annual raises or bonuses"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unethical company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jan 2018", "job_title": "Anonymous Employee in Cromwell, CT", "duration": "N/A", "pros": "You get holidays off (unpaid)", "cons": "The company is corrupt, full of sexual harassment coming from the top down. Workers are undertrained and management has no experience. Overall the company is a disgrace to the mental health community."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Communication? Never head of her.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Oct 2020", "job_title": "IT Technician in Cromwell, CT", "duration": "N/A", "pros": "Direct Co Workers, flexible work schedule", "cons": "Pay, Poor Communication, dishonest, unorganized"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Manager", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Aug 2016", "job_title": "Crs Manager in Cromwell, CT", "duration": "N/A", "pros": "Tuition reimbursement. Short room for growth", "cons": "You can kiss your personal life good bye. No job security,  racist, corrupt!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Apr 2018", "job_title": "Supervisor in Cromwell, CT", "duration": "N/A", "pros": "Making a difference in someone's life.", "cons": "Management sucks!! Unprofessional and loyal, racist. Does agency need to be investigated. Not sure why they're still open"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Overworked, Underpaid, and Upper management doesn't care", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jun 2016", "job_title": "Administration in Cromwell, CT", "duration": "N/A", "pros": "Working with the kids everyday.", "cons": "Horrible place to work. Upper management is basically corrupt."}]]