[[{"date": "14 Jun 2023", "title": "Adjuct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bryant & Stratton College (Wauwatosa, WI)", "Interview Descriptions": "Quickly met to discuss possibilities, re: current openings and benefits and future opportunities. Initial onboarding and training was so-so. Did not get much training on BlackBoard and how to best utilize it.", "Interview Questions": "Tell me about a situation where you needed to give advice to a co-worker or student."}, {"date": "28 Jun 2022", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bryant & Stratton College (Orchard Park, NY) in Jun 2022", "Interview Descriptions": "Open Interview Process with Individual Interviews in a seperate Room. Single Interviewer and with my information reading from my resume. \nExplanantion of the Position, Bryant & stratton College and the general operations.", "Interview Questions": "They wanted to know about me which started a conversational interview. Wanted to know if I enjoyed working with people"}, {"date": "17 Nov 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bryant & Stratton College", "Interview Descriptions": "Very personable committee, everyone was very nice and down to earth, and questions were easy to answer. Questions were very specific to the job and spoke towards teamwork. There were 2 rounds of interviews. Both committees contained higher level administrators", "Interview Questions": "Tell me how you work well in a team?\r\n\r\nAre you available to work nights and weekends to accommodate students?\r\n\r\nAre you able to give tours to family's?"}, {"date": "19 Dec 2022", "title": "Success Coach Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bryant & Stratton College (Buffalo, NY) in Oct 2021", "Interview Descriptions": "During the phone screen they ask about your salary expectation for the role and if it is higher than what is posted you will not be moved onto the next round of interviews. The salary range is posted with the job posting and they do not negotiate.", "Interview Questions": "What is your greatest weakness?"}, {"date": "24 Jun 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College in Jun 2021", "Interview Descriptions": "Unique group interview for the first interview, which was actually a very positive and engaging experience.  Second interview with a small committee, and the experience was more of a conversation than a list of itemized interview questions.  Very thoughtful, respective, and positive experience overall.", "Interview Questions": "They asked me to identify one word that my colleagues would use to describe me."}, {"date": "20 Apr 2021", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bryant & Stratton College (Orchard Park, NY) in Mar 2021", "Interview Descriptions": "I got a call from HR and interviewed with them. I then interviewed with the admissions representative and was offered a in-person interview. Basically I feel like she only offered me to come in because I told her “When will I hear about next steps? Last time I applied nobody got back to me”. She then interviewed me in person and the FIRST thing she said was “A  concern I have is your lack of experience in a higher education job” like literally wtf?? I wanted to walk out and tell her why did you even interview me if you know you don’t want to hire me because of lack of experience?! I finished the interview knowing from the beginning I didn’t get the job, KNOWING I didn’t even get the job because she didn’t offer me a in-person interview until I asked. It’s really just so rude she had no intentions of hiring me from the start but wanted to waste my time anyways with a interview. \r\n\r\nFor the record I was a college student last month when I was interviewed. I have an associates in business and I’m a semester away from a bachelors. I also have sales/customer service experience with a internship from HR. It’s not like I didn’t have experience, but obviously a 20 year old isn’t going to have many years of experience on their hands! After this interview I am never even going to reapply to Bryant and Stratton...who starts the interview off with that? So unprofessional! Also, she said she would get back to me by “next week”. I knew she wouldn’t get back to me at all, got a rejection email a month later. Also, they changed it to where you now need a bachelors for this position after I applied, it was originally an associates that was needed.", "Interview Questions": "What are you motivated by?"}, {"date": "27 Aug 2021", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bryant & Stratton College in Jan 2021", "Interview Descriptions": "It was a very long process but helpful. A lot of information was given and they made sure you understand what was expected of you. Overall it was a okay experience", "Interview Questions": "What is your five year plan "}, {"date": "5 Sept 2020", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bryant & Stratton College", "Interview Descriptions": "Just prepare and research your position and you will be fine. Interview was very straightforward and easygoing. Me a positive mindset and be yourself and you should have no problems giving a great interview with this school", "Interview Questions": "Can you please describe yourself"}, {"date": "14 Feb 2020", "title": "Financial Aid Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bryant & Stratton College in Feb 2020", "Interview Descriptions": "Quick and simple. Questions reflecting abilities and characteristics. Met with a panel of the hiring managers and an advisor. no more than 30 minutes. nice and friendly staff members. very informal interview and casual.", "Interview Questions": "name 3 characteristics of yourself. "}, {"date": "17 Aug 2020", "title": "HealthCare Services Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Bryant & Stratton College (Virginia Beach, VA) in Dec 2019", "Interview Descriptions": "It was first a virtual interview with three different people!  It was timed and you were to answer questions within each person’s timeframe!  It a precept to the actual interview!", "Interview Questions": "Name a time when you had to step up and solve a problem without management’s help!"}], [{"date": "30 Jun 2019", "title": "Database Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Bryant & Stratton College (Orchard Park, NY) in Apr 2019", "Interview Descriptions": "A general walk-in interview process for anyone registering, followed up by more specific interviews according to the position you are most suited for.  As you continue in the process, you have a phone interview with a managing director.", "Interview Questions": "What do you know about this school?"}, {"date": "1 Feb 2019", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bryant & Stratton College (Hampton, VA) in Jan 2019", "Interview Descriptions": "Was told it’s a group interview assumed it would be a panel from college interviewing individual candidates .Well I was wrong instead a group of 20plus applicants had to stand up and answer three questions .\r\nExperience was daunting to say the least .\r\nOnly theee positions were open .i knew who would be chosen before my turn came about to speak .(and I am not expert panel) They should have done a better job screening applicants and spare ya the excruciating humiliating experience talking to people who did not want to hear about your expirience .", "Interview Questions": "Tell us about urself \r\nWhat makes fit for this position \r\nWhich position would you choose (type of advisors ) "}, {"date": "17 Nov 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College in Sept 2018", "Interview Descriptions": "Since the position is remote, my interview occurred on  Skype. It was a group interview because they were hiring a pool of instructors, and it lasted lasted about an hour.  The second part of the hiring process involved attending an online training workshop that lasted about 8 hours.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "28 Jul 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Bryant & Stratton College (Wauwatosa, WI) in Sept 2018", "Interview Descriptions": "I received a phone call from the hiring manager and after a breif conversation i was invited to interview on campus about a week later. The interview included the director of admissions and it was laid back and comfortable.", "Interview Questions": "What managerial style do you perfer?"}, {"date": "12 Jan 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Bryant & Stratton College (Virginia Beach, VA) in Aug 2018", "Interview Descriptions": "I was approved for a work study position, first. Then I showed my interest in working in the library and soon was called in for an interview. It was a panel interview and was made to feel very comfortable.", "Interview Questions": "What are my strengths?"}, {"date": "2 Aug 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College (Milwaukee, WI) in Jul 2018", "Interview Descriptions": "i taught a subject to current faculty . that i prepared using power point.  The interview was very laid back.  Not very many questions.  But i did have to prepare a 20 minute lesson plan and have guide to do after wards.", "Interview Questions": "no questions "}, {"date": "22 Feb 2019", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College in Jun 2018", "Interview Descriptions": "I applied for the job and two days later i heard back from the manager. they called me in for an interview and there were about five people in the interview.", "Interview Questions": "tell us about you"}, {"date": "28 Mar 2018", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Bryant & Stratton College (Richmond, VA)", "Interview Descriptions": "A very brief phone interview, a quick teaching demo, and the job was offered. There were questions after my presentation, but it was very informal. There were a lot of things spoken about here.", "Interview Questions": "What would you do if you found out a student could not attend due to family issues? "}, {"date": "1 Feb 2018", "title": "Academic Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College (Orchard Park, NY) in Jan 2018", "Interview Descriptions": "I received an email for a phone interview 1 week after applying. Had the phone interview, which lasted 15 minutes. Called back the next day for a face-to-face interview the following week.  Went in for the face-to-face interview and sat with 2 manager/directors from the department. \r\nThe interview was very relaxed and the ladies were incredibly nice. They made me feel comfortable right away. The questions were what you would expect for the position like how you would handle a student in a certain situation, how you would handle disagreeing with your boss, whether or not you are okay with the format, etc...they gave me a tour after and I can't get over how nice everyone was.", "Interview Questions": "If you had a student call you panicking that they need to drop their classes because they have work and their family taking up their time, what would you tell them?"}, {"date": "18 Feb 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bryant & Stratton College (Eastlake, OH) in Jan 2018", "Interview Descriptions": "Applied Online and then went for group interview. After the group interview commenced met with hiring manager one on one and had interview. I received an email inviting me for a group interview. I attended the group interview and was taken back at how the hiring manager was dressed. I know it was casual Friday but impressions are everything. The hiring manager was nice but it seemed like she was looking for the perfect employee. She seemed judgmental as far as work history and she made it known you would not be getting the job. The rudest part of the interview process is taking almost three hours and not even receiving a rejection letter.", "Interview Questions": "Tell me a little about yourself "}], [{"date": "15 Jan 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Bryant & Stratton College (Greece, NY) in Nov 2017", "Interview Descriptions": "Interviewed three times between the Greece and Henrietta campuses. A constant issue emerged regarding the response times from the interviewers: they all spent weeks or months before they updated you with your candidate status. It seems like if they reject you, then they do not tell you so at all. You have to send a request multiple times before someone may provide feedback.", "Interview Questions": "How do you handle constant pressure to meet sale quotas?"}, {"date": "18 Sept 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Bryant & Stratton College", "Interview Descriptions": "It was two three person panel interviews, people from the local campus. As well as the systems director of Hr. \n\nIt was a very good interview process they were very informative and forth coming with all information.", "Interview Questions": "What is your greatest strength?"}, {"date": "2 Aug 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bryant & Stratton College", "Interview Descriptions": "There was an interview panel for two interviews and then a final interview with a Campus Director.  Everyone was very friendly.  They want to know how you would work with faculty to help students struggling in the classroom", "Interview Questions": "How would you work with at-risk students"}, {"date": "2 Mar 2017", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College (Parma, OH)", "Interview Descriptions": "Relatively informal interviewing process (seven years ago), but they were encouraging and focused on ensuring that you had the minimum requirements for the job. The interview lasted about 45-minutes at the time.  There were no requirements for me to demonstrate my teaching skills.", "Interview Questions": "What experience do you have?"}, {"date": "31 Dec 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bryant & Stratton College (New York, NY)", "Interview Descriptions": "There are 3 people that interview you and possibly more... some come and go. Everyone is very friendly. KNOW your teaching philosophy. It was comfortable and a teaching presentation was requested. You could teach on any topic that you decided. This was the most comfortable part of the interview and really your opportunity to shine to them.", "Interview Questions": "What is your teaching philosophy"}, {"date": "8 Mar 2017", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bryant & Stratton College (Richmond, VA) in Aug 2016", "Interview Descriptions": "It was quick and painless. Interview and teaching demonstration. Clear communication and an offer right away. The process was quick and painless. I enjoyed it. It gave me a chance to show them how I teach.", "Interview Questions": "How would you handle a student who was having multiple problems at home and had a difficulty getting in to class. "}, {"date": "6 Jun 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College (Wauwatosa, WI)", "Interview Descriptions": "This was a panel interview where everyone had the same script.  They went around the table and each asked questions that were pre determined.  It was very systematic but also was conversational.  I suppose it would depend on who the interviewers were.", "Interview Questions": "What is your philosophy of Advising"}, {"date": "16 Jan 2017", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bryant & Stratton College (New York, NY) in May 2016", "Interview Descriptions": "Quick, efficient, enjoyable the peer review was fun and worth the effort.  All in all, the folks were helpful and it was a good work environment. Hiring was quick, the in-service meeting was too long-winded but a good overall experience that forced me to think on my feet.", "Interview Questions": "Explain in detail my experience."}, {"date": "19 Jan 2017", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bryant & Stratton College (Milwaukee, WI) in Jan 2016", "Interview Descriptions": "Meet with at least three members for the nursing program, which consists of the dean, clinical coordinator, and a staff member. There may be more as staff is available. I did not meet with the higher management until after I was hired.", "Interview Questions": "They asked about your reactions to common complaints or actions of students, want to know motivation in seeking employment here vs elsewhere, knowledge of area taught, experience, etc..."}, {"date": "15 Sept 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Bryant & Stratton College", "Interview Descriptions": "Interviewed with the Dean and then came back and interviewed with people from various departments. There were standard questions, but it was more of a conversation.  It was valuable to meet with people from other departments to help understand the campus culture.", "Interview Questions": "I do not remember"}], [{"date": "25 Aug 2015", "title": "Business Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bryant & Stratton College (Buffalo, NY) in Aug 2015", "Interview Descriptions": "First I was asked a series of questions, then I had to present a 15 minute lesson on one of 7 course outcomes. No other instructions were given.There were four people interviewing me, taking turns asking questions at random. Neither Dean for the school was present at the interview. During my presentation I could see that one or two of them were drifting in and out of paying attention. No questions were asked during the presentation and it felt that I was boring them. After I was done they asked if I had any questions and sent me on my way, guaranteeing that either way I'd hear back within the week (interview was on a Tuesday, the following Monday I finally heard back that I wasn't selected despite having \"impressive skills\", this from one of the Dean's who, as I mentioned previously, was not present during the interview). Considering that the Dean's are head of the college I thought they would want to be involved in who was going to be hired, but they did not.", "Interview Questions": "Why I applied for the position."}, {"date": "1 Jun 2015", "title": "Electronic Biller/Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bryant & Stratton College (Beachwood, OH) in Mar 2015", "Interview Descriptions": "I had to interview with five different doctors in a group panel process. Which they gave me the opportunity to express my skills, knowledge, experiences, critical thinking skills, problem solving, power-point, excel and customer services.  We talked about my 20 years plus experiences and knowledge of medical billing and why was I not working.  Due to downsizing with my last employer for over ten years.", "Interview Questions": "Did I have a criminal background.  We started off with my 30 second interview and why I felt I was the perfect candidate for the position.  I explained with my knowledge, experiences, diversity, innovative skills I would do a great job and they don't need to look any further.  they called me on Good Friday.  Made me an offer I accepted immediately because I really wanted to work for them at Behavioral Health Associates."}, {"date": "14 Mar 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bryant & Stratton College (Hampton, VA) in Dec 2014", "Interview Descriptions": "Did the typical teaching demo in front of current senior faculty.  Was seemless and a very pleasant experience.  I treated the interview panel as a class and did a 10 slide presentation.  The panel participated fuller and we even had a little fun in the process.  After the demo the panel asked typical interview and teaching questions and others based on my resume.", "Interview Questions": "What is your Teach Philosophy"}, {"date": "4 Jun 2015", "title": "High School Admissions Representative/Presenter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 months. I interviewed at Bryant & Stratton College (Greece, NY) in Sept 2014", "Interview Descriptions": "Very arduous process, would not get back to me when they said they would, went through 3 rounds of interviewing and was never told I didn't get the job and now it is posted again.  The entire process took over 5 months.  I called weekly.  Finally I got in touch with someone who got me an answer.", "Interview Questions": "I had to do a \"presentation\" on anything I wanted and a 10 second \"commercial\".  Worked on it for WEEKS as they kept pushing the date back of this 3rd and final interview."}, {"date": "4 Aug 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bryant & Stratton College", "Interview Descriptions": "I went in for initial interview. They asked very typical interview questions about my education and experience. I was asked to come back and perform a teaching demo for several faculty members. They discussed the demonstration and offered me the job.", "Interview Questions": "Can you come back in a few days from now and give a teaching demo in your field?"}, {"date": "24 Oct 2015", "title": "Bryant and Stratton Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bryant & Stratton College (Cleveland, OH) in Aug 2014", "Interview Descriptions": "Called as result of vacancy My applicaton was on file.My resume was customized to thier job needs. Ihad to submiit certified transcripts before contract was final.Spent about one hour talking with program Director.I dressed Business Formal which I learned was correct", "Interview Questions": "Can I teach course subjects Immeadiatly"}, {"date": "16 Sept 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Bryant & Stratton College (Rochester, NY) in May 2014", "Interview Descriptions": "Saw the ad posted and emailed.  The Program Director emailed me and we sat down and talked. The interview itself was more of just a conversation and getting to know each other. With each of us asking questions and talking about teaching and the study. I was given an option to teach a few classes and I picked one that started a week later.", "Interview Questions": "None, as I was prepared for anything."}, {"date": "9 Jun 2014", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bryant & Stratton College (Orchard Park, NY) in May 2014", "Interview Descriptions": "Applied online and 3 weeks later got a call for an interview during which the hiring manager also did a short phone screening. A few days later I walked into what turned out to be a 4-person panel interview. Questions were average \"difficulty,\" but as long as you review your relevant skills/experience/strengths/weaknesses the night before you'll be fine . Interview was great but I decided half-way through that the job/company was not a good fit for me-more of a sales atmosphere and didn't have growth opportunities I was looking for. At the end of the hour-long meeting the hiring manager said they would call early the following week in either case, job offer or not. Never received any call, but then again I didn't care for the position.", "Interview Questions": "Name something a previous manager would say you need to improve on"}, {"date": "4 Mar 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bryant & Stratton College", "Interview Descriptions": "Very simple process.  I had a short and informal discussion with the dean of instruction.  He asked about previous experience and interest in the position.  He also asked about my approach to classroom management.  He also spent time explaining how the college schedule worked and the types of classes available for me as an adjunct.", "Interview Questions": "Be prepared to discuss how you manage a classroom."}, {"date": "27 Feb 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bryant & Stratton College", "Interview Descriptions": "The interview process consisted of mostly behaviorally based questions, getting to know you questions and then the opportunity to shadow someone in the job you would have. I liked shadowing portion because it gave me a good idea of what my job would be in the future. During the behavioral questions expect multiple people to sit in the interview and also it may be hosted in a conference area.", "Interview Questions": "The Human Resources Professional asked me \"On a scale of 1-10 please rate how you are doing during this interview\" after I answered he asked me \"and why is this question so important\""}], [{"date": "4 Aug 2017", "title": "Campus Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Bryant & Stratton College (Richmond, VA) in Feb 2014", "Interview Descriptions": "Excessive. The company was and still is in disarray. Leadership is in dire need of absolute change. This is a classic example of Corporate literally stealing government funding. The employees at the front line are pretty much dedicated. Upper level Management are thieves.", "Interview Questions": "Behavioral Interview"}, {"date": "22 Jan 2014", "title": "Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Bryant & Stratton College", "Interview Descriptions": "Received several emails, had a phone conversation with the Dean, and then went in front of several peers at the campus to teach on a topic of my choosing.", "Interview Questions": "Pretty straight-forward interview questions, nothing surprising."}, {"date": "29 Aug 2016", "title": "Librarian's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Bryant & Stratton College (Virginia Beach, VA) in Dec 2013", "Interview Descriptions": "The interview process was very simple for me. The questions were geared more so toward my ability to get along with the current staff and outlined what would be expected of me as an employee. I felt very comfortable because the librarian took me into to her cozy office and, basically, just had a conversation with me.", "Interview Questions": "Why do you think you would be a good fit in the library?"}, {"date": "10 Sept 2012", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bryant & Stratton College (Virginia Beach, VA) in Aug 2012", "Interview Descriptions": "They asked me to come in for a panel interview, but when I arrived it was very different from what I expected.  About thirty applicants were gathered in a room, and we were first given a lecture on how great Bryant & Stratton College was.  Then we were given a tour of the college and it was explained to us how we could all benefit from attending the college.  At the end of the tour, the guide told us that there was a financial aid seminar with free food for us if anyone wanted to attend.  The guide actually forgot to even ask for our resumes at the end of the tour, and had to be reminded by one of the applicants.\r\n\r\nThis was NOT an interview, it was a scam.  They tricked people into coming in, and then forced them into a high-pressure sales pitch.  I am not sure that this was even a real job opening to begin with.", "Interview Questions": "They literally did not ask a single question to any of the applicants."}, {"date": "3 Dec 2014", "title": "Senior Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Bryant & Stratton College in Feb 2012", "Interview Descriptions": "Fairly extensive.  I was hired from within and still had to meet the challenges and interviews like any other applicant.  Promises were implied if I moved from one campus to another.", "Interview Questions": "How would you change the admissions process?"}, {"date": "9 Apr 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bryant & Stratton College (Milwaukee, WI) in Jan 2012", "Interview Descriptions": "Several interviews.  First a group interview with about 20 people, then a panel interview, then a one-on-one with the campus director.  The group interview was competitive, and your responses had to be concise.  The panel interview was with other advisors and representatives.", "Interview Questions": "Tell us what you know about Bryant & Stratton College and it's students and programs."}, {"date": "12 Mar 2013", "title": "Subject Area Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Bryant & Stratton College (Cleveland, OH) in Dec 2009", "Interview Descriptions": "Interview process was a three step process, panel,one on one and giving a lecture to the panel.", "Interview Questions": "I was actually asked to give a 15 minute lecture on the subject of my preference."}, {"date": "23 Jul 2013", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Bryant & Stratton College (Orchard Park, NY) in Nov 2009", "Interview Descriptions": "This process seemed good. The interview was thorough and there was several steps. However I was called for a second interview before I even got home after the 1st one. Knowing what I know now, I was misled to beleive this was a company that was out to make a difference and cared about its employees.", "Interview Questions": "What is your favorite cereal what would it be and why?"}]]