[[{"date": "3 Mar 2020", "title": "Human Resources & Recruitment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty in North Korea (Chicago, IL) in Jul 2019", "Interview Descriptions": "The interview process was very thorough. I was updated on each step of the interview process in details. The interview itself lasted about an hour. My interviewer asked a lot of great questions and I could feel the interviewer has genuine interest in my background and wanted to learn more about me.", "Interview Questions": "What is one of the best advice you've received from others?"}, {"date": "27 Jun 2019", "title": "Marketing and Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Liberty in North Korea (Long Beach, CA) in Feb 2019", "Interview Descriptions": "If you pass the screening process, you'll receive an invitation for a Skype interview. The interview is an hour long. It was conversational and fun! They genuinely want to get to know you.", "Interview Questions": "Why do you want to work for LiNK?"}, {"date": "18 May 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Liberty in North Korea", "Interview Descriptions": "I had a skype (phone) interview two weeks after I submitted an application online. They asked me to take a skills test the following week. I haven’t heard back yet since the exam one week ago.", "Interview Questions": "Why this position?"}, {"date": "2 Apr 2017", "title": "Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Liberty in North Korea", "Interview Descriptions": "submit application，heard in few days， schedule interview pretty soon. The skype interview didn't go well so we had phone interview. Very nice supervisor.... but I do not get the offer in the end.", "Interview Questions": "what is currently happening in North Korea"}, {"date": "17 Jul 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty in North Korea in Apr 2017", "Interview Descriptions": "They got back to me a few days after I submitted my application and set up a Skype interview. The interview was long but was a positive, fun experience. The HR from LiNK was very prompt in communication.", "Interview Questions": "Q. How do you work in teams? How do you respond in conflicts? (Mainly asking for how the candidate would fit in intern housing) "}, {"date": "30 Mar 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Liberty in North Korea in Mar 2017", "Interview Descriptions": "It took a while to schedule the interview, which was conducted via skype. They were very responsive to emails, however. And they requested an interview fairly quickly after I submitted my initial application. They let me know the very next day that they would not be continuing in the process.", "Interview Questions": "Tell me a little about yourself."}, {"date": "7 Nov 2017", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty in North Korea (Long Beach, CA) in Feb 2017", "Interview Descriptions": "I had to submit an application on the Liberty in North Korea website. I received an offer to have to Skype interview with the Director of Development. Shortly after the interview, I was told that my references will be contacted. After a 3 week process, I got the internship offer early April.", "Interview Questions": "Why Liberty in North Korea? "}, {"date": "3 Jul 2016", "title": "Donor Impact Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Liberty in North Korea (Torrance, CA)", "Interview Descriptions": "The interview will most likely be scheduled over Skype, unless you live in the area and woukd prefer to interview in person. The vibe is generally laid-back; feel free to wear something that reflects your personality, no need for frills. Be prepared to be yourself, above all - and be sure to do some background research on the general topics of North Korea,  North Korean refugees, and LiNK's work over the past decade. No need to be an expert though - they'll be looking for candidates who, above all else, are passionate, willing and driven. The training period of your internship will ensure you have a solid understanding of the topics.", "Interview Questions": "How did you hear about LiNK?"}, {"date": "16 Jun 2017", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Liberty in North Korea (Los Angeles, CA) in Jun 2016", "Interview Descriptions": "Applied online for an internship and got an interview within a week. The interview was on Skype and with 2 employees that were both very nice. Interview was fairly standard, got asked to give examples of many different skills such as leadership. Was also asked personality questions including my strengths and weaknesses. Was asked to give specific examples and pressed to give more on several instances.", "Interview Questions": "What criticism has your former supervisor given you?"}, {"date": "14 Nov 2017", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty in North Korea in Apr 2016", "Interview Descriptions": "Less than an hour but ask you general questions about your skill sets and portfolio and your interest in the cause. They ask you why you applied for this certain position and how you think you can make an impact through it. They also ask you how you heard about the cause and how you think you can contribute to it. It's very straight forward and they also ask you what you know about North Korea in general, which is for obvious reason very understandable as to why they do. Although they seem very casual, they are very passionate about the cause but they also highly consider anyone who is passionate about this internship.", "Interview Questions": "What inspires you?"}], [{"date": "27 Apr 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty in North Korea in Feb 2016", "Interview Descriptions": "The interview process was super fast. It was a one-to-one interview with my future supervisor over Skype. The supervisor was extremely nice, made me feel comfortable, and seemed to ask lots of behavioral questions to see if I would fit with the team and its needs. The HR manager is very responsive and makes things happen quickly.", "Interview Questions": "Behavioral"}, {"date": "25 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Liberty in North Korea", "Interview Descriptions": "If you get past the initial resume screening, they'll set you up with a Skype interview where you'll talk to your future supervisor. It'll be about an hour long interview. If they like you, they'll extend an offer.", "Interview Questions": "How did you hear about Liberty in North Korea?"}, {"date": "27 Sept 2015", "title": "Human Resources and Recruitment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Liberty in North Korea (Torrance, CA) in Mar 2015", "Interview Descriptions": "For HQ interns, when you apply, the HR manager will review your resume first, then you direct supervisor. If they both approve, you get one video interview (i.e., Skype), then the final round are reference checks. There are not too many surprise questions, and they usually gauge your personality (strengths, weaknesses), interest in the issue, and interest in the position.", "Interview Questions": "What would you tell your friends and family about Liberty in North Korea?"}]]