[[{"date": "7 Jun 2022", "title": "Summer Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oak Valley Health (Toronto, ON) in Apr 2022", "Interview Descriptions": "Zoom interview between myself and two of the hiring officers. Questions were pretty easy/shallow and asked a lot of about dealing with conflicts. Felt kind of rushed but overall pretty chill.", "Interview Questions": "What experiences do you have with presenting"}, {"date": "13 Jun 2022", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oak Valley Health (Oshawa, ON) in Mar 2022", "Interview Descriptions": "I applied online. The process took 1 week. I interviewed at Markham Stouffville Hospital in Mar 2022.\r\nI applied for the new grad position. After I applied for the job, I got a call from the recruiter to set up an interviewer. The interview was short. The interviewers were nice. Not much to say honestly, I mostly remember the questions not the interview itself.  After the interview, it took a long time (about a month) for them to get back to me asking for my references.", "Interview Questions": "These are the topics I was asked:\r\n Assessing a patient after surgery\r\n How do you handle feedback from colleague?\r\n How do you align with their mission statement\r\n What skills do you bring to this position, why would you be successful in this position?\r\n How would you go about doing something you have no experience in\r\n Complications after surgery, how do you assess and provide interventions for it."}, {"date": "4 May 2021", "title": "Prescreener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oak Valley Health", "Interview Descriptions": "It was done over zoom, and the interviewer was very nice and friendly. It felt like more of a genuine conversation versus a standard interview, and it's by far one of the most pleasant interviews I've had. They started by explaining the job and the responsibilities then proceeded to ask their questions.", "Interview Questions": "Why do you want to work at MSH?"}, {"date": "14 Dec 2021", "title": "Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Oak Valley Health (Markham, ON) in Apr 2021", "Interview Descriptions": "I waited about 1 week after I replied. I got a call and scheduled my interview with the manager. He then asked 3 behavioural questions... \"What would you do if...\"\nThe manager also asked a question about Markham Stouffville Hospital's values", "Interview Questions": "Why do you want to work at Markham Stouffville Hospital?\nWhat would you do if a patient came after the hours of visitation?"}, {"date": "20 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oak Valley Health", "Interview Descriptions": "Typical interview process, interviewed by the manager and the professional practice leader through a phone call because their video wasn't working. Very professional and kind, gave me an offer right at the end of the interview, altogether a good experience", "Interview Questions": "Tell me about the CNO Quality Assurance program"}, {"date": "31 Mar 2021", "title": "Prescreener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Oak Valley Health in Mar 2021", "Interview Descriptions": "The interview process was done through video call/Zoom because of COVID. The interview explained the job and what the daily tasks would be. The interviewer asked a lot of behavioural questions/what would you do questions. Markham Stouffville is a community hospital that looks for people with integrity and empathy. Read up on their values as they want to see if your qualities match theirs.", "Interview Questions": "Why do you want to work at Markham Stouffville?\r\nWhat would you do if someone lied about their age in front of you, but you knew their real age?\r\nWhat would you do if someone came in during closed hours because they wanted to see their mother (a patient) to give them breakfast? \r\n"}, {"date": "30 Jan 2021", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oak Valley Health in Jan 2021", "Interview Descriptions": "Easy process; HR  called for initial screen, panel of 2 members over a video call because of COVID. Declined the offer as they require you to go to the hospital even though  have systems in place to be able to work from home", "Interview Questions": "What motivates you at work?"}, {"date": "28 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oak Valley Health (Markham, ON) in Aug 2020", "Interview Descriptions": "Quick interview process. HR will call you to ask for availability first to see if your schedule will match what they are looking for then schedule you for a virtual interview with the unit manager. Usually a panel interview with 2 managers. They start with behavioural questions then more skill set questions.", "Interview Questions": "What have you been doing to keep your nursing knowledge up-to-date? \r\nIf you were to give a critical feedback to your coworkers, how will you do it? \r\nWhat have you learned as a nurse from working the last couple of years? \r\nIf a patient act inappropriately around you, what will you do? "}, {"date": "20 Aug 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Oak Valley Health in Jul 2020", "Interview Descriptions": "Applied online and heard back from HR after a week. Scheduled virtual interview with the patient care manager and the professional practice lead. Initial questions were behavioural, then proceeded to ask clinical scenarios as well as hard skills.", "Interview Questions": "What is family centered care?"}, {"date": "8 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Oak Valley Health", "Interview Descriptions": "Three interviewers - panel interview. The panel was friendly and made you feel comfortable. You're given the opportunity to ask questions in the end, so make sure you get them ready.", "Interview Questions": "What is your nursing philosophy?"}], [{"date": "1 Nov 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oak Valley Health (Markham, ON) in May 2019", "Interview Descriptions": "There were two rounds of interviews. One with two less senior individuals then one with two more senior individuals. A bit of back and forth with the contract agreement, though not much room/negotiation available.", "Interview Questions": "What do you value most in a job?"}, {"date": "11 Jul 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oak Valley Health (Markham, ON) in Mar 2019", "Interview Descriptions": "Very thorough and efficient two step process. First there was an HR screen interview, followed by a panel interview.", "Interview Questions": "How would you assure quality of the projects?"}, {"date": "13 Nov 2020", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Oak Valley Health (Markham, ON) in Oct 2018", "Interview Descriptions": "It was very well organized and the group panel was very informative and willing to know myself.  They asked variety of questions including testing my knowledge in rhythms as it was a Cardiac floor I was applying for.", "Interview Questions": "Why did you pick MSH?"}, {"date": "13 Mar 2018", "title": "Food Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oak Valley Health", "Interview Descriptions": "the online application selection process, once they sort, and call the real candidate then after I got a call for an interview, interviewed with food service manager and the coordinator more than half an hour", "Interview Questions": "behavioral question"}, {"date": "18 Sept 2019", "title": "MRT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oak Valley Health (Markham, ON) in Feb 2018", "Interview Descriptions": "30 min interview/ They call you and you go in for interview. 2 people interviewing. They run a through background check. 30 min interview/ They call you and you go in for interview. 2 people interviewing. They run a through background check.", "Interview Questions": "prioritizing workload "}, {"date": "6 Mar 2016", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oak Valley Health", "Interview Descriptions": "Applied via career fair \nWas called in to interview and afterwards someone else told me their interview was cancelled due to cancellation of job. I was not told about this and I called HR but they did not return my calls. I was then sent an email saying someone else was chosen for the job. This was extremely strange.", "Interview Questions": "Behavioral \nMany hospital setting case scenarios"}, {"date": "16 Sept 2015", "title": "Occupational Health Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Oak Valley Health (Markham, ON) in Jan 2013", "Interview Descriptions": "they ask a series of real situations - know arrest procedures, mental heath act, and tress pass to property act. they will ask you how you deal with difficult people and how you can contribute to the hospital", "Interview Questions": "Know mental health of canada act - how would you calm down someone receiving bad news"}]]