[[{"date": "15 Apr 2023", "title": "IT Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Benedictine University", "Interview Descriptions": "zoom, then in person interview, Rob and Andy are great and very knowledgable, also down to earth. questions are fair and relevant to the job. Nick is great too, really knows what he's doing and asks questions about infrastructure.", "Interview Questions": "Have you ever had two tasks that were high priority and needed to get done at the time. You need to get both done. What do you do to get both don't?"}, {"date": "25 Feb 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Benedictine University", "Interview Descriptions": "I had met with my prospective supervisor, and we chatted for about an hour. It was more of a conversation than an interview which allowed me to feel comfortable and relax from the stress of interviewing.", "Interview Questions": "Past experience in higher education and how its relevant to the role. "}, {"date": "5 Jul 2023", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Benedictine University (Lisle, IL) in Aug 2021", "Interview Descriptions": "Phone screen, then in person interview (2 rounds). Met with all key decision makers and people who would be colleagues. One round was via zoom and the other was in person.", "Interview Questions": "Name a time when you had to manage multiple projects/things and how did you handle it?"}, {"date": "23 Jun 2021", "title": "Dietetic Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Benedictine University", "Interview Descriptions": "classical, there was a group of people on the phone interview and they took turns asking questions. roundabout like. they allowed time for you to fully think about your response and didn't ask questions that had me too stumped which was refreshing.", "Interview Questions": "about how I got my start in nutrition"}, {"date": "8 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Benedictine University", "Interview Descriptions": "Very simple and easy, the interview was very nice. Would work here again if I could. The people were very nice and replied back to me very fast. 10/10 would recommend", "Interview Questions": "What’s your greatest accomplishment so far?"}, {"date": "6 Mar 2020", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Benedictine University (Lisle, IL) in Aug 2019", "Interview Descriptions": "I had an initial phone interview and then received a follow up for an in-person interview. I met with team members and management during the in-person interview. I was also given a tour of campus and was provided with a great amount of information about the campus. I was told they were still considering options a couple weeks later and then never heard back.", "Interview Questions": "What experience have you had in sales/recruiting?"}, {"date": "1 May 2018", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Benedictine University", "Interview Descriptions": "Overall my application was not considered for the job I would of wished that I was called in for an interview. Unfortunately, that is part of the hiring process and most institutions you apply will not get in contact until after someone has been hired for the position.", "Interview Questions": "My application was not considered as they said that the position had been fulfilled days after I submitted the application."}, {"date": "9 Jan 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Benedictine University (Lisle, IL) in May 2018", "Interview Descriptions": "Pretty simple. I sent my resume to the current employees and the supervisor. Questions were pretty simple. In person meeting.  Hardest part washearing about this job opening because it was not publicized well.", "Interview Questions": "How comfortable are you taking to new people "}, {"date": "16 Oct 2016", "title": "Library Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Benedictine University", "Interview Descriptions": "All day interview, which is standard in academics but not for the EXTREMELY low salary. The interview did not need to be so long as there was a lot of repetition and the same people repeating the same questions. I had to fill out a lot of paperwork at the HR department, well beyond the traditional application, references, and background check that other universities require - including a special disclosure if you are over 40 (I am not, but this opened up a lot of questions in my mind...) I think I knew right away the position was not a good fit, but I never received a phone call, email, or letter explaining the position had been offered to someone else. This is extremely unprofessional after I took the time to arrange travel and a vacation from my current position to attend the interview. (AND after I filled out all that extra paperwork at HR!)", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 Feb 2016", "title": "Sports Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Benedictine University (Lisle, IL) in Aug 2015", "Interview Descriptions": "I contacted the Sports Information Director inquiring about the availability of student roles within the Athletic Department. He invited me in to talk with him about a potential position. It was very casual, he was more interested in my exposure to sports and what I wanted to do and get out of it as opposed to his needs.", "Interview Questions": "Would you be willing to participate in work outside sports information in the athletic department?"}], [{"date": "22 Nov 2016", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Benedictine University (Lisle, IL) in Mar 2015", "Interview Descriptions": "My supervisors reached out to me and encouraged me to set up an interview. It was low pressure and included a short review of my portfolio. They asked questions related to my design experience, preferences, and challenges. They followed up in a timely manner and gave me time to consider before accepting the position.", "Interview Questions": "What project (from my portfolio) do I like the least?"}, {"date": "17 May 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benedictine University in Mar 2015", "Interview Descriptions": "Two interviews, the first over the phone and the second with several employees on a panel. Both interviews had similar questions and were situational in nature. Neither lasted more than forty-five minutes and I was contacted with an offer within two weeks after the second interview.", "Interview Questions": "Describe a challenging situation you faced and how you handled it."}, {"date": "15 Jan 2016", "title": "Assistant to the Dean Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benedictine University (Lisle, IL) in Nov 2014", "Interview Descriptions": "After a few weeks, I was called in for a face to face interview. Several weeks later, they informed me they went with another candidate. I was more then qualified for this position.", "Interview Questions": "Why should we hire you."}, {"date": "14 Oct 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Benedictine University in Sept 2014", "Interview Descriptions": "I applied for an Academic Advisor position online.  On Sept 9th,  I received a call from a recruiter, Bridget Cooper, to set up a phone interview for Sept 15th. I had a great first interview with the Director which was really just a screening.  She wanted someone right away and it was obvious when I asked what were the next steps in the process she joked to have someone hired the next day. I sent a thank you letter within hours.  I never heard back or received a rejection email.  I sent a follow up email two weeks later to Bridget, she sent a generic \"someone else was chosen\" email.  A week later, I see an advisor position is open again.", "Interview Questions": "Before the interview began the recruiter asked would I be satisfied with the low salary. "}, {"date": "26 Jul 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Benedictine University", "Interview Descriptions": "Two interviews, first by  phone, and 2nd face to face. Review LinkedIn profile in detail. Interview with Educational Designer.  Have to interview again the next semester. Be familiar with PBL teaching methods.", "Interview Questions": "Review LinkedIn Profile"}, {"date": "25 Jul 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Benedictine University", "Interview Descriptions": "Process was long; information was not fully shared up front regarding details \r\nAlso was surprised to have to take test to prove online and computer skills at first interview\r\nOnce through HR, the process smoothed out and many staffers were included in process\r\nFrom beginning to end the process took nearly 30 days despite the need to fill job ASAP", "Interview Questions": "What is your relationship with (the university I graduated from?)\r\n"}, {"date": "19 Mar 2014", "title": "Creative Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Benedictine University (Lisle, IL)", "Interview Descriptions": "Met with the Executive Vice President and the Executive Director of Special Projects.", "Interview Questions": "There weren't a lot of direct questions, it was more of a get to know you interview process."}, {"date": "12 Mar 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Benedictine University (Lisle, IL)", "Interview Descriptions": "I was referred by a friend.  We discussed my teaching experience as well as my expertise in business subject matter.", "Interview Questions": "N/A"}, {"date": "16 Jan 2014", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benedictine University", "Interview Descriptions": "The process is a very quick and easy interviews. There is only three rounds of interviews and they try to move you through the process within three or four weeks. If they truly like, the process can be completed as fast as two weeks.", "Interview Questions": "Most of the questions they ask are scenario questions like how you would respond to a certain situation or how you would handle certain situations."}, {"date": "22 Jan 2013", "title": "MSN Administrative/Course Support Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Benedictine University (Lisle, IL) in Feb 2011", "Interview Descriptions": "Spoke with director of the program and was asked to come in for a face to face. I was interviewed by five different nursing faculty members. They asked me the usual behavioral questions. How I dealt with stress, a time when I was asked to handle multiple tasks at once, I time when I showed leadership to complete a project, etc. Once the interview was over I emailed the faculty members to thank them for the opportunity and within a week I received a phone call from personnel saying that they were going to hire me.", "Interview Questions": "Since its a Catholic university there is a lot of openly religious aspects to working here. Daily  scripture emails. "}]]