[[{"date": "14 Jan 2023", "title": "Canvasser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Public Outreach Fundraising", "Interview Descriptions": "It was a group interview (around 10 other candidates being interviewed at the same time). Behavioral and situational-type questions made up the bulk of the questions asked. There may have been a second stage as well.", "Interview Questions": "How would you sell me this pen."}, {"date": "15 May 2023", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Dec 2022", "Interview Descriptions": "An interview day was selected to be done online. However, all participants were present on the video call, except the employer. The interview day was never rescheduled, and no one didn't really know why it couldn't be rescheduled.", "Interview Questions": "N/A"}, {"date": "25 Jul 2022", "title": "Telephone Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Jul 2022", "Interview Descriptions": "Brief phone interview to get to know you a bit, followed by an in person group interview, then a 1 on 1 phone call with role play if selected for the job.", "Interview Questions": "What is a world issue you are passionate about?"}, {"date": "14 May 2022", "title": "Phone Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Group interview was moderated well and everyone had a chance to contribute to the conversation. After you would be interviewed individually. Group interviews can be overwhelming when there’s lots of people, so if you’re usually shy and quiet be prepared to make yourself stand out and try to participate more than you usually would in a group setting.", "Interview Questions": "What charity, or social justice cause are you passionate about? Tell me about the issue, what the charity or group is doing to effect change. Why is this important to you?"}, {"date": "31 May 2023", "title": "Fundraiser Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Jan 2022", "Interview Descriptions": "Straightforward and fun, the interview is a good opportunity to show your communication skills that will be important at the job. They let you know what to expect and give you some resources to start learning.", "Interview Questions": "What would be a project you would be passionate to start and would make a difference in the world?"}, {"date": "24 Jan 2022", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Outreach Fundraising (Toronto, ON) in Nov 2021", "Interview Descriptions": "Incredible and informative.  They were very nice and accommodating.  Was very comfortable. Genuine interviewer. Shared similar interests and experiences. Seems like a nice place to work. Happy to have made this contact.", "Interview Questions": "Am I passionate about charity work?"}, {"date": "31 May 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Public Outreach Fundraising", "Interview Descriptions": "It was online, over google meets and it was a group interview. There were also survey's before and after. Then got  a call after saying whether you got in or not. Overall quite smooth interview process.", "Interview Questions": "Tell us something about yourself"}, {"date": "6 Oct 2021", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising in Jun 2021", "Interview Descriptions": "Very Nice, through text messaging a woman invited me to attend an online introduction and book an interview and i kindly declined in order to find another work opportunity in my field of study", "Interview Questions": "What made you interested in becoming a fundraiser"}, {"date": "22 Apr 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Public Outreach Fundraising (Toronto, ON) in Apr 2021", "Interview Descriptions": "Was not told it would be a group interview. Wasn’t told too much about the job process and was asked random questions and scenarios. The group applying did not all seem interested in the job or even qualified for it. They let everyone have a turn at speaking and took lots of notes about what we all said.", "Interview Questions": "What can we do to calm down in a stressful situation?"}, {"date": "14 Jan 2021", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Outreach Fundraising (Toronto, ON) in Oct 2020", "Interview Descriptions": "First, there was a phone screening where you're just asked some very basic questions. THen there was a group interview where you reviewed basic things about NGOs. Then we each picked 3 letters from a bowl and you needed to create an NGO with a mission based off those 3 letters and present it to the group. Then you had a short one-on-one interview which just asked about your work ethic, personality, how you would deal with people being rude to you, etc. It was very easy and I think the majority of people who showed up to the interview got hired. Once you get hired, though, you aren't really hired. You're on probation for a week or two until you raise enough donations, then you're actually hired and get the full 17 per hour. Most people don't make it past the first few weeks though. Unsurprisingly, there is a very high turn-over rate. A good job for students but difficult to make a career out of.", "Interview Questions": "How would you deal with rude people over the phone? \r\nWhat is the difference between sympathy and empathy? \r\nWhy do you want to do fundraising? "}], [{"date": "7 Feb 2020", "title": "canvasseur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Public Outreach Fundraising (Montreal, QC)", "Interview Descriptions": "Entrevue de groupe (environ 8 personnes). Il y avait 2 personnes pour faire les entrevues. C'était très dynamique, c'était vraiment un beau processus. C'était tranquille, personne n'était stressé, il y avait une ambiance très plaisante.", "Interview Questions": "Racontez-moi un moment où vous avez fait d'une grande autonomie ou d'une grande persévérance. "}, {"date": "24 Nov 2019", "title": "Professional Fundraiser Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Public Outreach Fundraising (Vancouver, BC) in Nov 2019", "Interview Descriptions": "Applied online, then received an email to schedule an interview. Mainly asked about my personal strengths and weaknesses, and discussed about the responsibilities of the role.  We would also follow a little script that introduces what we would say during our fundraising events.", "Interview Questions": "What is something you will encounter as a challenge in this position?"}, {"date": "18 Mar 2022", "title": "Charity Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Sept 2019", "Interview Descriptions": "Very casual questions to get to know more about yourself and then group activities that involve imagining a campaign with a cause and ways to fundraise for it. The interview process is really made to see how you handle challenges and quick thinking as well as oral skills.", "Interview Questions": "To recommend a movie or series to others and discuss why I did."}, {"date": "28 Jan 2023", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Toronto, ON) in Sept 2019", "Interview Descriptions": "Phone interview which was general asking about you and behavioural questions In person we were meant to pitch an NGO and how we would grow it. If they liked you they would send an email", "Interview Questions": "What is the name of your NGO and what do you do?"}, {"date": "17 May 2023", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Aug 2019", "Interview Descriptions": "The interview process was better than expected. It first started as a group interview, in which the interviewers were dynamic, friendly, and encouraged people to interact with one another. They clearly let you know what the job is, and then contact you further for training. Very accessible if it is the job for you. To not let fears get to you, and to just relax and be yourself would be my tip. Most importantly, don't try to brag or try to impress the interviewer by your previous achievements. They can see your CV already; what they want to see is how you interact and respond to the group questions.", "Interview Questions": "Q: Introduce yourself; what is a passion of yours? What made you apply for Public Outreach?"}, {"date": "3 Feb 2019", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Public Outreach Fundraising (Vancouver, BC) in Jan 2019", "Interview Descriptions": "It was a normal group jnterview and we had to do a survey also. Thier were some ice vreaking activities not really fun and also had a sketchy location", "Interview Questions": "Where woyld you visit for a full paid vacation "}, {"date": "10 Dec 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in Oct 2018", "Interview Descriptions": "Phone interview, then arrange for a group interview. You get to know what is this job like. You will be assigned to ask strangers to answer your questions. Interviewer will give you a score based on your performance.", "Interview Questions": "How you can develop you rap with strangers"}, {"date": "22 Aug 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON)", "Interview Descriptions": "Group interview, more games than questions. Go outside to survey people to sample the job. Asked some questions after in a 1:1 setting. It seemed like everyone in the group was hired, so the interview is more to explain the job than it is to learn about you specifically. There seems to be a high turn over rate", "Interview Questions": "Past experience"}, {"date": "29 Jul 2018", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "There was first a phone interview that was overall pleasant and the recruiter was easy going. I was then brought along to do a group interview which was over an hour and we had to solve a problem as a group. I was taken to another room for a quick solo interview, with some of your traditional interview questions and some unexpected.  I did not get the job but the atmosphere seemed great. The recruiter for the in-person interview seemed a little awkward and unprepared but this just makes you feel more relaxed.", "Interview Questions": "Sell me on something you're passionate about."}, {"date": "16 Jul 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Applied online. I received a call for a phone interview without warning.  Pretty simple, and at the end they asked me to come in for a group interview. Group interview consisted of a group activity followed by a one on one interview that was similar to the phone interview.", "Interview Questions": "Why do you think working at Public Outreach is a good fit for you?"}], [{"date": "18 Jun 2018", "title": "Street Canvasser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Group interview with 5-10 other people, all sat in a circle. Casual dress, no need to be formal. Casual interview as well. The interviewer went through the steps to make a successful pitch. Then had us each choose a silly thing and pitch it to the group.", "Interview Questions": "Tell us your favourite food and convince us it is the best food"}, {"date": "8 May 2018", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "The interview process was quite fun! It was an audition and in the audition you pretend like your a sales person and you greet customers help them with outfits. Its an amazing experiance!", "Interview Questions": "How did you demonstrate HIP?"}, {"date": "4 Feb 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in Feb 2018", "Interview Descriptions": "pretty good it went well basic questions just to see if you would be a good fit. they made you read from a script and asked which charity you would want to try", "Interview Questions": "why do you want to work for us"}, {"date": "20 Dec 2017", "title": "Telefundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in Nov 2017", "Interview Descriptions": "Super casual and laidback. It was nice not to have to dress formally. Played a few icebreaker games with other interviewees. Questions were pretty straightforward and they wanted to get to know you more. Afterwards they will ask you what you are comfortable with individually. Heard back quickly.", "Interview Questions": "Are you comfortable meeting targets? "}, {"date": "22 May 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in Nov 2017", "Interview Descriptions": "They made it seem like it's a very open-minded, innovative workplace filled with cool people. Survey, impromptu monologue to test your speaking skill. It started off with a personality quiz then get-to-know each other short talk then pick a random question to give  a mini presentation on.", "Interview Questions": "How you do define success?"}, {"date": "22 Aug 2017", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Aug 2017", "Interview Descriptions": "I applied online, and got a call back a few weeks later. The interview was of average difficulty, with basic the majority of questions being basic  interview questions.", "Interview Questions": "Convince me on an idea your passionate about"}, {"date": "19 Jul 2017", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Waterloo, ON) in May 2017", "Interview Descriptions": "They gave me an address in Kitchener for the interview which turned out to be the Toronto address of the company, so i drove all the way to the wrong address, then when i call them, they apologized for the mess up and then gave me the right address but the interviewer didn't ask anything and just hired me right there. Overall bad coordination and very little organization. You will be given 2 weeks to hit a fundraising goal otherwise you are fired.", "Interview Questions": "What sets you apart from other candidates?"}, {"date": "19 Jan 2018", "title": "Phone Operator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Outreach Fundraising (Toronto, ON) in Apr 2017", "Interview Descriptions": "They called, and the interviewer was quite pleasant, but the interview ended once she discovered I was under 18 (not once on Indeed was being of the age of majority listed as a requirement).", "Interview Questions": "Why do you want to work for Public Outreach?"}, {"date": "10 Dec 2017", "title": "Fundraising Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Mar 2017", "Interview Descriptions": "Pretty casual and straightforward. Was asked a series of standard interview questions, and I was quizzed on my knowledge of the role. The interview lasted approximately 30 minutes and I was given time to ask questions.", "Interview Questions": "Give me an example of how you would keep organized with tasks. "}, {"date": "31 Aug 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising (Vancouver, BC) in Mar 2017", "Interview Descriptions": "It was a lot of fun, pretty easy interview. They were focused on getting to know me instead of focusing on my previous employment. The interview was a group interview but it was very interactive and fun. I've never had a job interview like that before.", "Interview Questions": "What social justice issue are you passionate about? "}], [{"date": "31 Jan 2017", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Easy or at least relatively easy. First, a super short phone screen, then a group interview where they Just asked behavioral questions regarding role models, leadership skills, social issues we care about, our charity experience, fundraising experience, etc.", "Interview Questions": "asked us for our leadership experience."}, {"date": "14 Apr 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Public Outreach Fundraising (Ottawa, ON) in Jan 2017", "Interview Descriptions": "Group Interview, also have to go out on the street and get people to sign a petition. It doesnt matter how many really, just as long as you do get signatures. they are looking for how you interact with strangers on sensitive issues.", "Interview Questions": "If you could have a super power what would it be and why?"}, {"date": "26 Feb 2017", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jan 2017", "Interview Descriptions": "1)You apply via Public Outreach's website. \r\n\r\n2) You get a first phone interview where they pretty much test your skills and motivation for the job.\r\n\r\n3) If they like your performance during the phone interview, you might be invited to a group interview as fast as the next day. \r\n\r\n4) In the group interview, they will directly and indirectly test your ability to interact with people and communication skills.", "Interview Questions": "Phone Interview: \r\n\r\n- Tell as bit about yourself\r\n\r\n- How would you \"sell\" a passion of yours to someone in the streets? \r\n\r\n- Why do you want to work as face to face fundraiser?"}, {"date": "10 Aug 2016", "title": "Charitable Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "I applied online and went through an initial phone interview, with basic questions on my skills, personality, and the organization.  \r\n\r\nI was then invited to a group interview with 2 team leaders in Toronto, which was very informal with role playing, group games and personality tests.  We even had a “dry test” of face-to-face fundraising by interacting with people on the streets outside the office and trying to get answers to simple questions.  \r\n\r\nAfter that, I had a one-on-one with a team leader for two-way feedback and was eventually offered a position with an on-the-job training starting the very next day.", "Interview Questions": "How would you use your best strength to make the world a better place?"}, {"date": "6 Jul 2016", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Public Outreach Fundraising (Calgary, AB)", "Interview Descriptions": "Got a call for the interview after two days of application. Weird Group interview setting with a group of different people which I did not like. They set unrealistic targets to be achieved every week and you get kicked off if you don't achieve targets without remorse. They told me they kicked off a guy who worked for three years after he could not achieve target on few occasion.", "Interview Questions": "tell me about yourself."}, {"date": "24 Jun 2016", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Public Outreach Fundraising (Toronto, ON)", "Interview Descriptions": "SO FUN!! It didn't even feel like it was an interview. I applied on Indeed, then had a phone interview with a super laid back guy who acted like we were besties. I was then invited in for an interview the next day and we literally played games for it.", "Interview Questions": "What are you passionate about? "}, {"date": "30 Jul 2016", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Public Outreach Fundraising (Calgary, AB) in Jun 2016", "Interview Descriptions": "Applied and received a call for an interview about a month later. The lady on the phone asked some brief questions and asked when I would be able to come in for an interview. They had several interview times each week and I chose one. This turned out to be a group interview with myself and 3 other people. I received notice the Friday (I had my interview on the Thursday) that I did not get the position. She had mentioned in the interview that they only hired 2 people per team (there are 2 teams) per week.", "Interview Questions": "Why do you think you would make a good fundraiser?"}, {"date": "2 Jun 2016", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jun 2016", "Interview Descriptions": "Applied online in the morning and received a brief phone interview in the afternoon. The process must be very easy for an English speaker, but I am not fluent in English, that's why I failed.", "Interview Questions": "Q: Do you have any experience involving working with charities?\r\nQ: What is your favorite food and sell it to me"}, {"date": "11 Jul 2016", "title": "Door to Door Canvasser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jun 2016", "Interview Descriptions": "Group interview, if you had a heart beat you were hired. A lot of silly kid psychology games people didn't realize they implemented. I caught it reading the first page of the introduction manual they were handing out.", "Interview Questions": "1. Why us?\r\n2. What makes you passionate?\r\n3. What makes you think you're qualified to work here?"}, {"date": "24 Jun 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in May 2016", "Interview Descriptions": "Unlike any interview I have ever had! Super fun! Felt like summer camp! My interviewer was so welcoming and I felt like I got a great taste of public outreach just from the interview alone!", "Interview Questions": "What I was most passionate about in life"}], [{"date": "21 Apr 2017", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Public Outreach Fundraising (Hamilton, ON) in Apr 2016", "Interview Descriptions": "It was a group interview, make sure you get enough words in but do not steal the show. Prepare to have creative answers and do not be afraid to show them your true colours.", "Interview Questions": "Tell me something about yourself"}, {"date": "5 May 2016", "title": "Public Fundraiser Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Calgary, AB) in Apr 2016", "Interview Descriptions": "I applied online and was contacted within a week for a brief phone interview, it was a very relaxed casual interview and was not formal at all, after I admitted I was not able to come in for a second interview until next month she got very agitated and rude with me.", "Interview Questions": "What experience do you have with charities "}, {"date": "26 Feb 2018", "title": "Outreach Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Public Outreach Fundraising in Mar 2016", "Interview Descriptions": "Group interview process involves asking questions about your personality type which they discriminate based on. They have you go out on the street to ask questions as part of training.  Dirty office. Hiring Manager said I looked too skeptical.", "Interview Questions": "Why do I look so skeptical"}, {"date": "10 Aug 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Public Outreach Fundraising (Vancouver, BC) in Mar 2016", "Interview Descriptions": "There was only one group interview which consisted of roughly 10 people. The environment is relaxed and friendly and encouraging of conversation. Basically, they want to know how well you talk and get along with others.", "Interview Questions": "What are your hobbies?\r\nWhat are you passionate about?"}, {"date": "30 Oct 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Feb 2016", "Interview Descriptions": "They are doing a pre-screening phone interview first, one of the recruiter will call you and ask you some basic who you are question, it's very casual. After that they will call you to arrange an in person interview, in which they have some tasks for you to do, i.e. asking people on the street about their favorite movies, etc.", "Interview Questions": "Try to sell me something that you love"}, {"date": "3 Jan 2016", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Usually a group interview, very casual envirnoment. They're looking for personable personalities. Very fun and playful. They may ask for some public speaking. Their may be a skills review step.", "Interview Questions": "\"Pick an item in the room and sell it to us\" \"What do you love, why do you love it and why should I love it?\" \"If you were to live in a tree house for 3 months what 3 things would you bring with you?\""}, {"date": "7 Oct 2015", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "really really casual interview, asked for a resume but they didnt really need it, just want to know if you can talk and do the job as a professional fundraiser, regardless of how you perform, hopefully if not terribly bad you will be called in for an interview", "Interview Questions": "tell me about yourself? if you were going to live in the jungle and you could only take 3 things what would they be?"}, {"date": "18 Nov 2015", "title": "Fundraising Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Outreach Fundraising (Toronto, ON) in Oct 2015", "Interview Descriptions": "Hiring process is based on the profits you can give to the company, they \"hire you\" after a group and phone interview and make you go through an evaluation period which does not necessarily mean you have a job. It's a very stressful time because they can fire you at any moment. The initial group interview you do is great! They make it seem like a fantastic place to work and convince you that you'll have a great time.", "Interview Questions": "They ask you to get 5 sponsors in 5 days, don't challenge or question anything the coaches tell you- smile and nod, and be happy EVERY SINGLE DAY."}, {"date": "5 Sept 2019", "title": "Door to Door Sales Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Public Outreach Fundraising in Jul 2015", "Interview Descriptions": "It was a simple process. They didn't contact me directly for an interview but instead posted the time to attend a group interview. During the group interview they asked questions and anyone was free to answer. It was clear they wanted to see people with confidence and personality speak up and make their presence felt considering the nature of the job.", "Interview Questions": "They asked about previous customer service experience or roles where you interacted with people regularly"}, {"date": "1 Mar 2016", "title": "Canvasser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Public Outreach Fundraising (Montreal, QC) in Jun 2015", "Interview Descriptions": "It's a very casual group interview (I was with 4 other people), they asked us to talk about ourselves for a bit. I asked if they wanted a resume but they didn't. You need to research the organization you will be represented as they will ask you what you know about them. Dress casually and be yourself.", "Interview Questions": "Asked to make up an organization (the funnier and more random the better) and to pretend to be at the door and get a donation."}], [{"date": "20 Jun 2016", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Public Outreach Fundraising (Calgary, AB) in May 2015", "Interview Descriptions": "The Calgary Branch manager and the Vancouver manager both interviewed me. About 10 minutes of getting to know me, then I was required to do an on the spot pitch (rap) about fundraising for something that I cared deeply about. I felt that the interviewers were critical but patient, and they seemed glad that I was there.", "Interview Questions": "Why do you want to work for PO?"}, {"date": "6 Apr 2017", "title": "Professional Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Public Outreach Fundraising (Calgary, AB) in May 2015", "Interview Descriptions": "Th interviewer was over an hour late. Very casual. He did not ask me anything. I brought a resume, but the only other person in the \"group interview\" did not. We were both offered the job.", "Interview Questions": "There were no real questions, they just told me about the job and told me they would take basically anyone for the evaluation period."}, {"date": "24 Apr 2015", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising (Toronto, ON)", "Interview Descriptions": "The group interview was really casual. It was in a shoddy building on St Claire but the people were super friendly. Everyone working there was really young, I can't imagine anyone being older than 30. They took us into a room and we sat around a table where they asked us some questions. Afterwards they took us outside to \"give us a taste\" of what the job would be like, meaning they gave us a sheet with 3 questions on it and we had to get people on the street to talk to us. It was pretty awkward and the guy who was with me and another girl paid much more attention to her, which felt really unfair. Afterwards they thanked us individually and that was it.", "Interview Questions": "If you had a billion dollars to spend, what charity would you donate money to? What lavish item would you buy?"}, {"date": "4 Mar 2015", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Applied via email. Got a phone interview after one week. A phone interview asking why you are applying for the job, your previous experience. Then asked for an onsite interview next week. No need to dress up for the interview (they accepted casual style. But I suggest clean and simple clothes, like jeans, sweaters, T-shirts ) During face-to-face interview, discussing your background, your enthusiasm for the job, and your knowledge of the company.", "Interview Questions": "Describe your previous experience that is related to fundraising."}, {"date": "21 Jul 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jan 2015", "Interview Descriptions": "A group setting didn't really know what to expect we sat and did a personality test they had lights and music to show how relaxed they are , 20s-30s age range", "Interview Questions": "A award show and presenting to the others"}, {"date": "12 Nov 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Public Outreach Fundraising (Waterloo, ON) in Jan 2015", "Interview Descriptions": "It was very laid back except that you had to memorize a script that was one page long before the actual interview. I went for training after they have told me I was hired. I went for training for 4 hours and afterwards they told me they will schedule me in for next week. When I came for the first day they told me they don't need me today. So I went home and waited for my first day to start. They didn't call me back for a week and told me that they don't need me anymore. Extremely disappointed because they have wasted my time when I could be looking for new jobs but they gave me hope telling me I would start my first day and tell me to go home when I just arrived.. Very disorganized management and ran by teenagers ranging from 22-25.", "Interview Questions": "Tell me about yourself"}, {"date": "11 Apr 2015", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Public Outreach Fundraising (Edmonton, AB) in Dec 2014", "Interview Descriptions": "Manager didn't show up to interview after saying he could only make it on a certain day and caused me to miss half a day of work, got offered the job and decided I'd give it a chance. Had to take a \"love quiz\" on the orientation interview that described your personality.", "Interview Questions": "Have you supported a charity before?"}, {"date": "23 Jan 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Sept 2014", "Interview Descriptions": "The first was a group interview. The interviewers asked questions to see how social we were and to test our communication skills. We also had to do a few minutes of canvasing. We weren't really asked difficult questions. Things like where we were from, and we played a social game where we had to describe an object.", "Interview Questions": "They gave an object and asked us to describe it"}, {"date": "7 Jun 2014", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Applied online. I received a short phone interview and then a group interview. It was a very relaxed interview. Everyone was very friendly. The interviewer looked through everyone's resumes and asked questions based on what he or she wrote.", "Interview Questions": "If you could volunteer anywhere in the world, where would you be?"}, {"date": "25 May 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jun 2014", "Interview Descriptions": "It was just a group interview and ask you to perform some roles like say a dialogue. No specific job related questions were asked but everyone in the group was asked to show how they can sell a certain product, basically come up with a sales pitch. Interview was fairly simple. They hire everyone.", "Interview Questions": "Demonstrate how you can sell a certain item."}], [{"date": "23 May 2015", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in May 2014", "Interview Descriptions": "group interview, mainly to discuss your extracurricular achievements.  the screening process isn't very competitive, just remember to stress your sales and communications skills. \r\nwhat's more important is to test your liking for this job in the training period, not everyone enjoys asking people for money under 30 degree weather.", "Interview Questions": "What was your proudest achievement in the past year, in academia or extracurriculum  ."}, {"date": "14 May 2014", "title": "Street Canvasser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in May 2014", "Interview Descriptions": "Got a call and was invited to a group interview within days of sending them my resume. Got a phone call for training in less than 24 hours after doing the group interview.", "Interview Questions": "None. You just had to be yourself and say why you want to work for Public Outreach."}, {"date": "27 Oct 2018", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Outreach Fundraising (Calgary, AB) in Mar 2014", "Interview Descriptions": "Group interview about 4 other candidates lots of interaction and some very interesting questions i feel like they make selections based on how people interact with the other candidates", "Interview Questions": "One thing i am passionate about"}, {"date": "25 Jul 2016", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jan 2014", "Interview Descriptions": "The interviewer played music and turned on disco lights! They did an information session at first to tell us more about the job. We did some activities that were meant to showcase communication skills and teamwork, we went outside to do a survey with the public which was a good taste of what the job was all about. At the end they did a one-on-one part and let me ask any questions I had, then I got invited in for a training!", "Interview Questions": "To present something I was passionate about to the group for a few minutes in order to see how I spoke and worked in that kind of a setting."}, {"date": "12 Nov 2013", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Public Outreach Fundraising", "Interview Descriptions": "Interviewed people regarding sales skills and communication skills for fundraising positions in malls, door to door and on the street.", "Interview Questions": "Tell me about a time you were criticized by your boss."}, {"date": "4 Jun 2013", "title": "Canvasser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Public Outreach Fundraising (Hamilton, ON)", "Interview Descriptions": "Applied online through their website and got a phone interview asking why you wanted the job. Went for a group interview. The experience was really pleasant, the interviewees were not much older than I was (22) and they were all very very chill. All in all, it was a great experience with no pressure to say certain things.", "Interview Questions": "\"What would you do if you kept getting rejected?\""}, {"date": "21 Jun 2013", "title": "Marketing/Sales Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Public Outreach Fundraising (Vancouver, BC) in Jun 2013", "Interview Descriptions": "They had called me from their head office in Toronto (I'm from Vancouver) and offered me the interview after doing a phone interview with me. The woman on the phone was very pleasant and the phone interview was easy enough.\r\n I was unaware that it was going to be a group interview and only found out when I arrived and other people were there. I have had better group interviews; the questions started off with asking each person about their recent job on their resume and then ended with what each person's favourite thing to do was and why. I had to sit through some weird answers. At some points, for the questions that required a more thought out answer, they were forgotten because of people's elongated answers that would change the question basically and make you forget it. \r\nThe night of the interview I received a phone call from Public Outreach in Vancouver, but missed the call and called right back a few minutes later only to try to figure out which extension to call and leave a message at. I did this, and the next day I got around 4 or 5 phone calls that ended within seconds before I could pick up. I left a message again and got no call back that day. The next day I got another call from a different number, but missed the call. I called back and left a message. I got another phone call from a DIFFERENT number which again lasted about 2 seconds before they hung up. I called that number and FINALLY got a hold of the person who did my interview. \r\nI was offered the job, however I declined because the constant phone calling mishaps began to come off as extremely unorganized.", "Interview Questions": "What is the importance of monthly donations?"}, {"date": "21 Jul 2013", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Public Outreach Fundraising (Calgary, AB) in May 2013", "Interview Descriptions": "They want to see your personality, whether you are smooth, likable, able to deal with any situation\r\nYou need to have knowledge of why they do what they do. Read up on NGO`s, why face to face fundraising is applicable to your job description", "Interview Questions": "How do you build rapport with potential donors"}, {"date": "8 Mar 2017", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Apr 2013", "Interview Descriptions": "It was a group interview, it was very interactive and not your standard interview. I interviewed many years ago but the process has changed since then. It wasn't too long, there were some activities getting you to seek certain item. The main thing was making sure you were confirmed talking to people and understand what that job entails. You don't have to know about noon profits, but you should be eager to learn.", "Interview Questions": "N/A"}, {"date": "19 Sept 2013", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Public Outreach Fundraising (Calgary, AB) in Feb 2013", "Interview Descriptions": "It's not really that hard to get an interview or even pass the interview. This company is almost always desperate for new employees, as it is a very difficult job to keep. \r\n\r\nDoing the basics such as reading up on the company would be helpful, however. \r\n\r\nThe interview can be done one-on-one or as a group interview. The company is not really that interested in qualifications or background. They lost the resume I passed onto one of their recruiters and the interviewer did not bother reading the one I brought along to my interview.      \r\n\r\nThe interview is very informal. After the interviewer goes over the requirements for the job, he/she will get you to make an impromptu fundraising pitch about a random object in the room, or your favorite charity. I felt that this is where Public Outreach decides whom to hire.    \r\n\r\nOf the four people in my interview, three passed.\r\n\r\nAfter you get through a group interview, you will be put on an evaluation period for 1 - 2 weeks. During this period you will need to demonstrate that you can reach fundraising targets, or you will be fired. During this time you make close to minimum wage. \r\n\r\nAfter you are done evaluation, you will get hired on at full pay.    \r\n\r\nOf the three that passed the interview, I was the only person to pass evaluation. This is where they actually screen people out. \r\n\r\nIn the time I have been at the company, I have seen entire cohorts of fundraisers fail evaluation.", "Interview Questions": "What's your favorite charity? (you better be able to name one...)"}], [{"date": "2 May 2013", "title": "Fundraising Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Waterloo, ON) in Feb 2013", "Interview Descriptions": "Phone call, traditional phone interview right away", "Interview Questions": "N/A"}, {"date": "19 May 2014", "title": "Canvasser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Public Outreach Fundraising (Toronto, ON) in Nov 2012", "Interview Descriptions": "Ran into a street canvasser and asked her if I could do the job she was doing. She wrote down my #/name/email and gave me their details. I did a little research and I got the call within 3 days. I believe they interview everyone who does this (they ask the existing canvasser what their judgement is of you, once I worked as a canvasser for a while they asked me many times what I thought of people I met looking for a job so be talkative and confident). Interviews are done usually at their college st office. Group interview of 4 people, but each of us given a turn to answer so dont worry about having to be the loudest or anything. questions were standard, such as \"how would you deal with a disgruntled customer\" and questions relating to your previous experience or school/volunteer experience. remember to always relate every question back to why youre the best for the job. took about 15 min because all four of us were answering questions. Mostly the interview is to decide which style of canvassing youre going to try out (youre probably 70% guaranteed an eval period) being mall, street, door to door, or phone. If you prefer one of those, try to aim your answers to fit your desired position. The interview is basically just to make sure you're not crazy. You will be placed in one of these versions or i think you can request one, and you will be on eval. Evals are paid minimum wage for a week (i think) and if you get 5 sign ups in that time you are officially hired and paid 13.00/hour. so the eval period is really where you are judged.", "Interview Questions": "the only one i remember is which superpower would you want more: breathing underwater or flying"}, {"date": "18 Apr 2013", "title": "Public Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Public Outreach Fundraising (Toronto, ON) in Aug 2012", "Interview Descriptions": "The day I applied, they called me back. A few days later I went to a screening/group interview with about 10 other people that included a mock street exercise. Afterwards I was then emailed a script and some other info which I studied up on. A few days later I went into another group interview with a field manager. More screening and some rap practice. A few days later I was on turf for some on the job/at the door training.\r\n\r\nThe whole process took about 10 calender days.", "Interview Questions": "It wasn't a question, but they are looking at your ability to be quickly comfortable in  new situations/working with new people."}, {"date": "14 Jul 2012", "title": "Fundraising Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Public Outreach Fundraising (Toronto, ON) in Jul 2012", "Interview Descriptions": "Very easy - too easy. Interview also seemed very lax, and not all that professional.", "Interview Questions": "\"Explain why kites are awesome\""}, {"date": "20 May 2015", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Outreach Fundraising (Vancouver, BC) in Apr 2012", "Interview Descriptions": "It was supposed to be a group interview but no one else showed up. It was obvious that the interviewer was just looking for someone that can carry a conversation. We chatted about my job experience and video games.", "Interview Questions": "They didn't ask anything unusual. They were just looking for people that can easily carry on a conversation and were presentable"}, {"date": "26 Jun 2013", "title": "Private Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Public Outreach Fundraising in Jul 2009", "Interview Descriptions": "i was hired along time ago -  in 2003. The CEO interviewed me. It was very informal  - I felt completely at ease, and encouraged to try it out. I felt  confident I would be supported in learning my job", "Interview Questions": "Do you feel OK about asking donors for money?"}]]