[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great atmosphere and place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Apr 2016", "job_title": "Director in Chicago, IL", "duration": "N/A", "pros": "ABMS offers incredible benefits and fosters an atmosphere that is very employee centric. Generous vacation, healthcare and opportunity for flexible work hours. Leadership especially shows an interest in employee satisfaction and are personally and professionally invested in their teams.", "cons": "I truly cannot say I have any negative commentary about my role, management or the organization."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Commodifying Academic Achievement", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Aug 2014", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Casual office environment, mostly friendly, educated coworkers, convenient downtown location, lots of holidays, generous holiday banquet at upscale restaurant, generous summer outing, lots of free lunches and breakfasts, overall pleasant working environment.", "cons": "ABMS is contributing to and capitalizing on the unsettling nationwide trend of overemphasizing academic credentials. In addition to the many years of education that go into acquiring a medical degree, most hospitals and clinics now also require their doctors to be \"board certified,\" which means they have to pass -- and pay for -- additional testing to become certified in their medical specialty, of which there are 24 recognized by ABMS. In the past, it was enough for a physician to merely be board certified, but in recent years, ABMS has added an additional layer of credentialing called \"maintenance of certification.\" Under this new regime, board certifications must be maintained by taking -- and paying for -- additional tests, the frequency of which varies from specialty to specialty. The problem is that there is very little evidence supporting the notion that maintenance of certification leads to better health care outcomes for patients. What's more, this overemphasis on board certification has replaced traditional human resources approaches as hospitals and health services slash or eliminate their HR departments. A PriceWaterhouseCoopers study has shown that hospital turnover hovers around 30 percent, at least eight percent higher than other industries, and hospital HR departments spend less than half on employees that other industries' HR departments spend. This is because the outside hiring firms they rely on to fill vacancies depend solely on the applicants' board certification status as a hiring criterion, ignoring other considerations that might otherwise result in lower staff turnover. Resistance from medical professionals to these and other similar developments has inspired ABMS to greatly expand its sales and marketing departments in an effort to convince doubters that maintenance of certification positively affects medical outcomes for patients, despite the lack of evidence for that claim. Meanwhile, this explosion in staff turnover, combined with the growing resentment from the physicians themselves, has resulted in a backlog of work for the data entry portion of the ABMS staff, which has not grown at nearly the same rate as the sales and marketing departments. As a result of this work backlog, the data that credentialers and HR firms rely upon to make timely hiring decisions is often out of date or inaccurate, which in turn increases the resentment of physicians who have taken the trouble and expense to adhere to the new certification standards. All of this has resulted in unnecessary and avoidable conflict not only within the offices of ABMS itself, but also between ABMS and many of the individual specialty boards."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A fridge full of soda doesn't pay my bills.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Apr 2016", "job_title": "Support Staff in Chicago, IL", "duration": "N/A", "pros": "If I could give the 3.5 stars I would, but they really don't deserve 4.\r\n\r\nABMS is located in the all-glass Mesirow Financial building overlooking the river in the stunning River North neighborhood of Chicago, the building and its surroundings are beautiful!!! We have access to some of the best technology (laptops, cutting edge web conferencing tools, digital expense reporting, etc.), there is always a fridge full of free sodas, we have bi-monthly staff meetings where there is catered food, there is a yearly staff outing and holiday luncheon. During the summer its employees have the option of flexing their work hours to where they can either take Mondays or Fridays off, and there is a telecommuting policy which enables employees from certain departments to work from home. Externally, ABMS is very image conscious.  \r\n\r\nAll of this sounds wonderful, right?", "cons": "While the executives are paid EXTREMELY WELL for a non-profit (they have weekly company paid lunches at the finest restaurants River North has to offer, fly business class around the country, and stay in 5 star hotels and resorts just to note some of their perks); ABMS seems to think that paying its support staff in pizza, a constant fridge full of sodas, and top-of the-line laptops is acceptable. THEY DO DONT OFFER COMPETITIVE LIVABLE WAGES FOR BEING BASED IN A MAJOR U.S METROPOLIS, and consequently ABMS has one of the highest turn over rates of any organization I have ever worked for. If the stars are aligned and you are lucky to work for a manager who cares for your well-being, you MIGHT receive a 3% raise. Even the benefits aren't what you would expect from an organization whose mission is surrounded by quality improvement. \r\n\r\nABMS hosts a yearly staff conference for the Boards community (this year it's in NC), but you can bet your bottom dollar that if you aren't an executive or a member of the meetings team, ABMS isn't paying for you to attend. What's the point of hosting a staff conference that your own staff can't attend?\r\n\r\nI feel the operations department fiscally is wasteful when it comes to prioritizing the organization's needs."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "If only you could watch this eye roll!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Aug 2017", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Everyone is extremely smart, they all speak and carry themselves in way  you would expect from those who work in Medicine. Truly some of the greatest (and greediest) minds in the business. \r\n\r\nSituated in a great location, the office is easily accessible from every corner of Chicago. They offer a wonderful work/life balance; Summer hours, telecommuting, closed for two weeks during the winter holidays-really a great perk. They have a great operating budget, when you walk into an ABMS event, you can tell they have spared no expense (it's the nature of courting the world's best doctors).", "cons": "For a quality improvement driven organization, they  could care less about the quality of life they afford their staff (managers and below). The executives make WAY TOO  MUCH for a non-profit (check out their taxes online), and EVERYONE is dispensable-literally; no announcement, leadership just walking around like nothing has happened, it's disgusting! The list goes on and on with this one: Unsatisfactory compensation, employee discrimination, poor employee development opportunities, breech of confidentiality by HR, etc... I've seen fast food places ran better than this.\r\n\r\nFunny thing is that because it's such a small organization, there is no way the Member Boards (\"the clients\") don't see the turnover.  Even the CEO is leaving.\r\n\r\nMy advice if you aren't in management: accept the job if offered, but come in with a timeline and make sure that you hold them to it (If you plan on staying within this field, ABMS is a great name to have on your resume). I have seen too much talent waste away behind those walls simply because ABMS is so good at dangling carrots.  I left and found a similar job  which pays me a lot more!"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Small, rigid and hierarchical culture", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Sept 2019", "job_title": "Assistant Program Manager in Chicago, IL", "duration": "N/A", "pros": "Good benefits and an active HR dept, downtown location", "cons": "Staff is incredibly overworked. Senior leadership lacks ability to prioritize and thus creates impossible workload. Constant culture change initiatives but still hierarchical and small-minded. Completely closed to innovation. Not high EQ culture."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Manager", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jan 2010", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "nice offices and good location", "cons": "Poor management; not competive salaries"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Manager", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jun 2015", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "ZERO\r\nNADA\r\nCannot think of one nice thing to say about this place except don't work here.  Go someplace else.", "cons": "Revolving door. No one wants to work there.\r\nEveryone quit or got fired.\r\nHorrible place to work"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Elitist", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Sept 2019", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "There are no pros for this organization", "cons": "Everything you can think of...."}], []]