[[{"date": "6 Dec 2021", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnership HealthPlan of California", "Interview Descriptions": "Requires 3 online exams 1.typing/self assessment 2. descriptive 3. business writing. Overall online exams are easy. However, the descriptive portion was difficult. you have only 30 minutes to complete 18 questions. I got through only 4-5", "Interview Questions": "How would you contribute your abilities to help Partnership? "}, {"date": "7 Jun 2023", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partnership HealthPlan of California (Redding, CA) in Aug 2021", "Interview Descriptions": "Interview via phone for a screening and a few simple questions, then virtual interview with director and supervisor, then I received a call with an offer. After accepting the offer, I received details for onboarding and next steps in the process. Everything was well organized and thorough.", "Interview Questions": "Q: Why do you want to work for Partnership? Q: What makes you fit for this position?"}, {"date": "26 Jun 2021", "title": "Qi Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Mar 2021", "Interview Descriptions": "I had three interviews, two phones, and one-panel interview.  The process took about a month and a half. The HR department was very nice and welcoming. They did require you to do an assignment.  You need to make sure you have the skill sets to do the job.", "Interview Questions": "How do you manage conflicting priorities?"}, {"date": "25 Mar 2020", "title": "Senior Healthcare Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Partnership HealthPlan of California", "Interview Descriptions": "Multiple interviews, Resume based questions, no commuting/ interview travel reimbursement.\r\nThe interview process was extremely long approx 6 weeks. A staffing agency was hired to recruit for this position. I had one 30 minute phone interview, then a 1 hour video panel interview, then a 1 hour 45 minute on site interview in the Fairfield office. \r\nThe Panel interviews were not difficult but disorganized, and everyone on the team seemed to have different requirements for what a good fit on this position would be. \r\nThey specifically called me to come in for a panel interview on site, even though I had made it clear that I don't have a car and going to Fairfield would be very difficult for me. \r\n\r\nThe HR was completely unresponsive to me or the staffing agency who contacted me regarding the online application. after 4 weeks of interviews, they did not respond for 2 weeks. When I called the PHC office I was sent to voice mails repeatedly. I only received a response when I followed up on any travel reimbursement they could provide since its California. Which was a unhelpful response.", "Interview Questions": "What softwares are you familiar with"}, {"date": "27 Sept 2019", "title": "Provider Relations Education Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Partnership HealthPlan of California", "Interview Descriptions": "I submitted an online application. An automatic email was sent to show that they received it. A recruiter email followed that. It was all done via email and over the phone.", "Interview Questions": "Are you a people person?"}, {"date": "17 Jan 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Sept 2019", "Interview Descriptions": "The process consisted of four different interviews. One phone screening with the supervisor, two panel interviews that had four people each, and one phone interview with the regional director. I made it all the way to the end and then was never offered a position and I was told in a generic email from HR that I would not be given a offer. The whole process to over a month.", "Interview Questions": "All the questions were pretty generic.One that I remember was: What kind of supervisor motivates you?"}, {"date": "30 Jul 2019", "title": "Performance Improvement Clinical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partnership HealthPlan of California (Redding, CA) in May 2019", "Interview Descriptions": "My first was a phone interview and it was very comfortable. I received a call two weeks later for an in person interview. Approximately 1 week later I received a call for a panel interview. Everyone was very nice and professional.  They made me feel very welcomed and wanted.", "Interview Questions": "What made  you apply with our company?"}, {"date": "1 Oct 2021", "title": "Senior Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Apr 2019", "Interview Descriptions": "Phone Interview, in-person interview, and then an offer was made.  Interview questions were the standard interview questions.  The HR rep who walked me through the process was great and very helpful.  I would recommend working at this company.", "Interview Questions": "I don't remember any of the questions but they were the standard interview questions. "}, {"date": "13 Jan 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Mar 2019", "Interview Descriptions": "The HR team maintained great communication through the interview.  Initial screening was with HR on the phone. The interview day started with HR team to review general information and then with the potential team. After the first 2 meetings you interview with the hiring manager.  The whole process took about 2 weeks.", "Interview Questions": "Why are you leaving your job?"}, {"date": "30 Jan 2019", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Partnership HealthPlan of California (Fairfield, CA)", "Interview Descriptions": "I applied for the Communications Specialist position, first through Indeed which then directed me to their website, and then I received a call almost two weeks later. The first step is a phone interview. If one does well, then the next step is to produce a writing sample for them in which you create a blog post with specific instructions.\r\n\r\nI submitted mine, and then two weeks later, I was given the opportunity to have a face-to-face interview in Fairfield with the Communications staff and Public Relations Manager. Three individuals interviewed me at once. They were kind and professional. They started with questions about my background and writing abilities. However, they do require that candidates participate in a marketing brainstorming session with them in which you have to provide ideas (on the spot) about how to best publicize new healthcare programs that they will be revealing soon. Be prepared to be on your toes for that.\r\n\r\nI finally got feedback two weeks later that I didn't get the job. Overall, the Recruiter and Communications employees were welcoming. However, their hiring process takes a very long time, so it'd be wise to have backup employment options just in case Partnership HealthPlan takes a long time to make a hiring decision in the future.", "Interview Questions": "Out of all the ways that media content can be created and distributed, which skills are your best (such as writing, social media, audio/video, graphic design, etc.?)"}], [{"date": "8 Nov 2018", "title": "Full Stack Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Partnership HealthPlan of California", "Interview Descriptions": "Phone interview with three people in the panel. The interview went for an hour. Overall positive experience. They mainly asked about MVC, WEB API, C#, ASP.NET, SQL, HTML, JAVASCRIPT, JQUERY questions.", "Interview Questions": "C#, ASP.NET, MVC, WEB API, WCF, SQL questions"}, {"date": "15 Oct 2018", "title": "Education Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Sept 2018", "Interview Descriptions": "Phone interview, then in person interview with HR Representative asking basic interview questions and providing company HR information. Second part of interview was with Manager of the department the position was for. Provided information as tot the position and asked follow up interview questions.", "Interview Questions": "Describe a problem you had at your current employment and how you came up with the solution?"}, {"date": "10 Aug 2018", "title": "Legal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Partnership HealthPlan of California in Jul 2018", "Interview Descriptions": "They called to do a pre screening phone interview. After asking about my experience they describe the job requirements in more detail. The person was very nice and I did not feel any pressure.", "Interview Questions": "Educational Background?"}, {"date": "13 Nov 2017", "title": "Case Manager I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Nov 2017", "Interview Descriptions": "Met first with HR team(2 people) for 15 mins, then with the Health CC team (6 people).  Process was very comfortable.  They are a great group, made me feel very welcome.", "Interview Questions": "Give me an example of how you dealt with a complaining patient who insisted they were right (correct). "}, {"date": "13 Apr 2018", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Partnership HealthPlan of California (Redding, CA) in Nov 2017", "Interview Descriptions": "It was an amazing interview. They made it so comfortable and relaxing. They made you feel at home already, and kept it professional but fun as well. Best interview I have had.", "Interview Questions": "In your opinion what is a quality that you think you could bring to Partnership to benefit the company?"}, {"date": "20 Dec 2016", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Jan 2016", "Interview Descriptions": "Phone screening with Hiring Manager within 2 weeks of applying online. They had several openings, and the conversation discussed the various openings. Invited to an in-person interview within 2-3 weeks. In-person interview was layered, average difficulty, and required at some point a video conference interview (mildly awkward due to technical difficulties). I was very impressed with their flexibility and accommodations during the interview process, which I respect because this position would have meant relocating. Benefits package was strong. Location, for me, was also a plus. My only critiques are that a) they were not transparent with salary-- up until now, I still don't know the salary for that position, and b) they requested multiple at least 5 references --including present supervisor-- even before the final offer, which seems excessive considering an offer hadn't been made at that point.", "Interview Questions": "How would your current supervisor describe you? How did you past experience prepare you for this position?"}, {"date": "1 Dec 2015", "title": "IT Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Nov 2015", "Interview Descriptions": "I heard about a position that was open at PHC.  I applied online - the application process was fairly simple and easy to process.  The same day I received a phone call from their internal recruiter.  We spoke for approximately 30 minutes about my resume, the role and my future aspirations in my current career.  The next day I received a call for an in person interview for that week with the hiring manager and HR recruiter.  I interviewed with the person leaving the position for a new role and the hiring manager.  The interview was 1 full hour with a 15 minute interview also with the recruiter.  The building is very modern and welcoming.", "Interview Questions": "Where would you like to be in your career in five years?  Why do you want to leave your current position and work at PHC?  What is your ideal company?  What attracted you to PHC?  Tell me about yourself and your last position?  What were your responsibilities?"}, {"date": "1 Jun 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Partnership HealthPlan of California (Fairfield, CA) in Jun 2015", "Interview Descriptions": "I met with HR first and she reviewed the companies benefits package. I then met with three individuals for the interview. It was a comfortable setting, nothing intimidating like some. We discussed about the open position, my skills and background and some other questions they had. I was then given the opportunity to ask some of my own questions.", "Interview Questions": "Why did I want to work for their company?"}]]