[[{"date": "16 Dec 2022", "title": "Senior Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at JDC (The Joint) (Remote) in Oct 2022", "Interview Descriptions": "The interview process was seamless and efficient. The HR team and hiring managers asked great questions and provided honest and fulfilling answers. I feel fully supported by my team and the organization.", "Interview Questions": "About myself, dealing with working remotely, mock soliciation etc."}, {"date": "20 Nov 2022", "title": "Senior Development Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at JDC (The Joint) (New York, NY) in Sept 2022", "Interview Descriptions": "Had the first interview with someone from HR, and then a second interview with two development officers, and then HR again. To be honest, the questions were very basic and I doubt could really lead someone to tell who is the best candidate.", "Interview Questions": "How do you work with donors who want to \"see\" the impact of their donations when they are unlikely to see the work face-to-face?"}, {"date": "20 Dec 2022", "title": "Event Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at JDC (The Joint) (Remote) in Aug 2022", "Interview Descriptions": "I heard back from the hiring manager within a few days of applying. They were transparent about salary and remote/in-office work expectations from the start. The hiring manager asked really thoughtful questions, which made it clear he was trying to get to know me and my values in addition to my skills. They treated me with respect and kindness.", "Interview Questions": "Walk through the step by step process of how you would plan an event. Why are you interested in the JDC's mission?"}, {"date": "7 Jul 2022", "title": "Fundraising Events Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at JDC (The Joint) (New York, NY) in Jul 2022", "Interview Descriptions": "The interviews were enjoyable and thorough, the JDC staff were friendly and personable as well as professional and thorough. The interviews were good experiences and valuable learning processes. I was kept informed every step of the way and informed of the next step.", "Interview Questions": "I had three interviews with 6 different staff, there were many questions :) "}, {"date": "13 Jun 2022", "title": "Immersive Learning Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at JDC (The Joint) in May 2022", "Interview Descriptions": "The interview process had four steps: a phone screening, an initial interview with the hiring manager, a performance task with several JDC Entwine employees, and then a final interview with the Executive Director.", "Interview Questions": "Imagine you are on a trip. You are spending the day with children, and one of the JDC staff says to you, \"These kids are so cute I could take one home with me!\" This upsets many of the participants, some of whom are adopted. How would you handle the situation? (paraphrased to the best of my ability)"}, {"date": "27 Jan 2022", "title": "Internal Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at JDC (The Joint) (New York, NY) in Oct 2021", "Interview Descriptions": "It was a thoughtful and engaging interview process.  I went through 4 interviews and was provided a writing exercise to complete. The questions were both behavioral and on managing strategy, internal communications in collaboration with different departments, and working in a global organization. Everyone I met was  friendly and provided information on the role and organization that was very helpful throughout the interview process.", "Interview Questions": "1. Why JDC?\r\n2. Provide examples of your experience collaborating with HR on internal communications?"}, {"date": "9 Nov 2021", "title": "Director of Fundraising Events Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at JDC (The Joint) (New York, NY) in Jul 2021", "Interview Descriptions": "Step 1: I was invited to have a 30- minute phone screen with Talent Acquisition Expert\r\nStep 2: Invited to have a 1-hour virtual interview with the HR Director for the Development Department", "Interview Questions": "Describe an experience where you encountered differences of opinion from people in roles of influence and how you handled these conflicts. "}, {"date": "16 Aug 2021", "title": "Campaign Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at JDC (The Joint) (New York, NY) in Jun 2021", "Interview Descriptions": "The overall process was smooth, and was a good balance of thorough and not overburdening!  There was a great deal of care to make sure I had access to key colleagues and management (and vice-versa).", "Interview Questions": "Discuss experience in the realm of Major and Planned Gift fundraising, and how metrics and accountability played a role"}, {"date": "6 Jan 2021", "title": "Marketing Copywriter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JDC (The Joint) (New York, NY) in Dec 2020", "Interview Descriptions": "In short, I was impressed. JDC was warm, respectful, and communicative throughout this entire process. HR is committed to finding the best talent, and so they take interviews very seriously--there are four stages, from the intro to the final meeting with management. Be sure to develop detailed answers that illustrate your ability to handle pressure, produce sharp content, and work across a wide array of mediums. The most difficult, but rewarding, part of the interview process is the marketing assessment, which tests your ability to produce compelling, on-brand content. Put everything into this test: It's the \"hard\" evidence that proves you're a creative, hard-working individual.", "Interview Questions": "1) Tell us about yourself.\n\n2) What is it about marketing that attracts you to this field? \n\n3) Why JDC?\n\n4) Tell us about a time when you had to manage many different tasks.\n\n\n\n"}, {"date": "24 Dec 2020", "title": "Marketing Copywriter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at JDC (The Joint) (New York, NY) in Nov 2020", "Interview Descriptions": "The interviewing process was extremely lengthy and time consuming. It took two whole weeks from each point of contact until they let me know I was moving ahead, and then another week to actually schedule the next interview.  My first point of contact was in the beginning of November and now it’s already the end of December.  My last phase of the process was to do a writing assessment that was supposed to take “just a few hours” and was given 3 business days to complete it. The assessment was to write three social media posts (for different platforms), a 5 paragraph story, headline three ads, optimize two blog posts for SEO, come up with follow up questions, and explain my strategy behind all of it. I am used to working in a fast paced marketing agency, so I know that turnaround times for all of these projects together are approx 1.5-2 weeks.  I bent over backwards to finish it all on time. They told me 2 days after submitting the assessment that they don’t want to move forward. I enjoyed the people I met, but as you can see, there were many red flags about this interview process that lead me to think that I probably wouldn’t be happy working there.", "Interview Questions": "How did you get into copywriting and marketing?"}], [{"date": "23 Nov 2020", "title": "Sr. Development Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at JDC (The Joint) (Sharon, MA) in Oct 2020", "Interview Descriptions": "1st Round: HR\n2nd Round: Director Supervisor\n3rd Round: Heads of the Department\n\nThe process will clear and the time between rounds was less than a week.   Each of the interviewers were fair and asked questions that let me share my professional experiences.", "Interview Questions": "How would you create a fundraising plan?"}, {"date": "27 Jul 2020", "title": "Knowledge Management Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at JDC (The Joint) in Jul 2020", "Interview Descriptions": "Initial phone screen interview with HR followed by longer in depth interview with program director and head of HR. Very straight forward. Largely focused on my qualifications for the job, related experience, and explanation of the position itself.", "Interview Questions": "What experience do you have with knowledge management? "}, {"date": "6 Aug 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at JDC (The Joint)", "Interview Descriptions": "I applied to JDC back in December and received an invitation to interview after a couple of weeks. The first interview was over the phone with a recruiter. The recruiter was very friendly and helpful, however, the next time I heard back from JDC regarding the role was two months later. I had forgotten about the role/company as I got caught up in my current role and suddenly I received an email asking if I remember interviewing with them and if I'm still interested in continuing to the next step. I accepted to continue and had my second interview in person at the location (this was in February). \r\n\r\nAt the second interview, one of the interviewers couldn't make it so she scheduled another video interview a week apart from the second one. After about two weeks from the video interview I was asked to complete a written assignment which consisted of creating an itinerary, creating a powerpoint about the organization, sending a mock email to a potential donor, creating some excel report on budgets, and sending screen shots of multiple entries into Google or Outlook calendar, and one other task. Although the interview process was extremely disorganized until this point,I had already spent so much time with the company  so I decided to do the tasks to see where this was going. \r\n\r\nAfter submitting the tasks, I was invited for another in person interview at the location (this time with three of the higher level executives). I felt good about the interviews and the direction this was going and was convinced this would be my last step in the process. I took the day off of work at my current role and attended the interview which was about 1.5 hours. After the meeting, I was told I would hear a decision by the end of the week. The recruiter then asked me to submit references as they were doing reference checks on all final candidates. I went through and contacted all my references to ask if I could put them down, and then submitted my references. \r\n\r\nA week went by and I didn't receive any information. I asked one of my references if anyone from the organization had contacted her and she told me they didn't. I waited another week and around the last day of the second week I received an email stating that there was another internal candidate that applied and that they would have to explore the possibilities more. I was understanding because of course, things like that can happen and I let them know I'd be willing to wait. \r\n\r\nAbout two weeks later, I received another email from the internal recruiter stating that they MIGHT be closing the role and that they're not sure yet so they will keep me updated in a couple more weeks. I was pretty confused at that point, because I'm not sure how it went from having all these interviews, to another internal candidate applying, to then having the role about to be closed? Like there was no sign of this beforehand? \r\n\r\nAnyway, about two weeks later I received another email stating that they are sure the role would be closed and that they would contact me in the future if anything opens up. \r\n\r\nGot called a few weeks later for a contract/temp role and they asked me to come in to interview again. I really wanted to see where this was going and had nothing to lose so I attended. Funny enough I knew this would happen at the end they emailed me and said they decided to go with another candidate. \r\n\r\nEveryone I met was extremely nice but I feel like the organization really needs to work on its public relations and recruiting practices. I should have known not to go along in their interview process but it was a good lesson for me nonetheless to not allow companies/organization to take advantage.", "Interview Questions": "How do you deal with competing tasks? "}, {"date": "11 Jul 2019", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at JDC (The Joint)", "Interview Descriptions": "Long but pleasing. They asked very direct questions but weren't too up tight. It was a very inviting and comfortable environment. I met with 1 person from HR and 2 people from the department the role was in.", "Interview Questions": "What do you know about JDC's work and how can you contribute to it in this role?"}, {"date": "3 Jun 2022", "title": "SAP Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at JDC (The Joint) (Jerusalem, Jerusalem) in May 2019", "Interview Descriptions": "First interviewed by the IT Applications manger.\nSecond interview by the IT director\nThird interview by the HR manager\nAfter passing the interviews got an offer and after a few calls and discussions accepted the offer.", "Interview Questions": "Questions regarding SAP knowledge in finance, budget, procurement, BI and BPC modules.\nMy management style and how I resolve conflicts and motivate colleagues."}, {"date": "23 May 2019", "title": "Resource Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at JDC (The Joint) (New York, NY) in Apr 2019", "Interview Descriptions": "Applied for different role originally, email sent requesting a phone interview and to schedule utilizing scheduling website. After 2-3 weeks sent an email stating \"I believe this position is a better fit\" and completed yet another phone interview answering the exact same questions from the first phone call. A few days later received phone call and email stating I was selected for next round interview with the VP of Resource Development in NYC,  had interview followed the next week by a video interview with Talent Acquisition Specialist from the initial phone interviews for a cultural interview regarding supervisor expectations and the team one would be a part of. Interview tone was very casual and left in a positive manner of offer being extended within next 3 days. 3 days later received a few missed calls from JDC with no voicemails left (unprofessional in my opinion as there were multiple missed calls, not a singular call). Reached out next day to talent acquisition specialist regarding the missed calls and given the typical \"we have gone with another candidate and thank you for you time\" At time of this review, the posting for the position is still listed online which is indicative that A) Specialist was dishonest in saying they had offered another candidate, rather than professional declining due to other issues, or B) Role is actively available to which I'd graciously await a call making an offer after the positive tone and positioning the specialist made at conclusion of interviews that she was beyond excited and prepared to have offer to last of finalists in upcoming days.", "Interview Questions": "What type of management style do you work best under?"}, {"date": "30 Apr 2019", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at JDC (The Joint) (New York, NY) in Apr 2019", "Interview Descriptions": "The interview process was multi-layered, starting with intro recruiter call, a call with the deputy director + in person with recruiter, and culminated with a 4 hour in-person interview with a 30-60-90 day presentation and discussions with a few team members. Each step of the interview process encouraged you to think broadly and holistically about the role, and demanded one to think creatively, analytically, and experientially.  Ultimately, I didn't get an offer, despite what I felt was a very positive, engaging, and energetic final round, and I can't say that I'm not disappointed or a bit shocked, but ultimately the company chose to go in a different direction and that's ok. It doesn't change how I feel about the company or the interview process -- overall, it was incredibly pleasant and enjoyable, and one would be so lucky to receive an offer.", "Interview Questions": "The final stage will be an in-person interview where we would like you to present a 30/60/90 day plan highlighting what you would do in your first 30, 60, and 90 days in the Director of Marketing role with Entwine."}, {"date": "18 Mar 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at JDC (The Joint) (New York, NY) in Feb 2019", "Interview Descriptions": "I was contacted through LinkedIn and accepted a phone interview. After the initial interview with HR, I was invited for a 2-hour interview in the New York office, which consisted of 4 separate interviews. A week later, I was invited for additional video interviews with team leadership. This was followed by an operations test, with spreadsheet and correspondence activities. Finally, I interviewed with a partner nonprofit philanthropy group who would be funding part of my position. All in all, very professional and cordial relations with HR and the team.", "Interview Questions": "Please describe an ideal team environment you have experienced."}, {"date": "13 Dec 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at JDC (The Joint) in Feb 2019", "Interview Descriptions": "Extensive process that took over a month. Interviewed with multiple staff members as well as program funder. One pair of interviewers mentioned that if I am not hired, I could be a program participant, which I found inappropriate.", "Interview Questions": "What companies do you admire? "}, {"date": "16 Dec 2018", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at JDC (The Joint) (New York, NY)", "Interview Descriptions": "First: in-depth phone interview, second: two separate meetings in-person, third: three separate meetings in person. Overall, the process was really positive. Every person I spoke with and met with was warm, friendly, welcoming, supportive, and legitimately interested in me as a person.", "Interview Questions": "What is your organizational style? How do you keep organized? "}], [{"date": "31 Jul 2018", "title": "Communications Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at JDC (The Joint)", "Interview Descriptions": "I applied to the role online and got an email about a phone interview a week or so later. Three weeks or so after that, I found out I was not moving forward. While I agree that the role was not the bets fit for me, the HR rep who interviewed me sounded like a robot. The interview did not feel authentic at all and was uncomfortable at times because of how scripted the interviewer sounded.", "Interview Questions": "Describe a time when I had to manage a large project."}, {"date": "22 Aug 2018", "title": "Senior Writer/Publications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JDC (The Joint) (New York, NY) in Jul 2018", "Interview Descriptions": "Two preliminary phone interviews. Very pleasant. The interviewer did not take up much of my time and yet I had a clear idea of the job description and hiring process.  This position may have been below my qualifications level but I like what the committee and the organizations it supports stand for and I hope to reapply for another position.", "Interview Questions": "If I canI write dispassionate and balanced but compelling stories about sensitive world issues."}, {"date": "3 Aug 2014", "title": "Multi Week Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at JDC (The Joint) in May 2014", "Interview Descriptions": "Skype- getting an idea of background and interest in education and Jewish values. Asked me questions regarding academic background, travel experience. Spoke about managing expectations in my work, and the challenges of working abroad.", "Interview Questions": "Biggest challenge foreseen in work"}, {"date": "14 Mar 2015", "title": "Global Jewish Service Corps Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at JDC (The Joint) (San Diego, CA) in Mar 2013", "Interview Descriptions": "First there was an essay application, then a skype interview, then a group interview.  They flew everyone on the West Coast out to their office in San Diego, where we did a series of camp-like activities and presentations. Many questions were repeated over the various interviews. The entire process seemed very unorganized.", "Interview Questions": "Tell us about a challenge you faced in your workplace and how you were able to overcome it."}, {"date": "21 Feb 2014", "title": "Global Service Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at JDC (The Joint) (New York, NY) in May 2012", "Interview Descriptions": "First submitted application the day it was due. Then had a skype interview--with pretty straightforward, behavioral-type questions. Then was flown in for the group interview day--with around 30 or 40 people. That was somewhat hectic but fun. A lot of different, interesting people. I only had one in-person interview, which lasted half an hour. There were also a number of group exercises. After the group interview day, I had a couple of phone interviews. Then they thought of placing me elsewhere, so I interviewed a couple times with my potential supervisors. It was lengthy process but not difficult. Questions were straightforward, interviewers nice. And props to the NY office for reading my application and thoughtfully considering the best location to place me.", "Interview Questions": "Nothing unexpected. You talk about yourself and your previous experience. Prepare to explain how you deal with challenges--you confront a lot of challenges as a JSC Fellow."}, {"date": "12 Apr 2016", "title": "Global Service Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at JDC (The Joint) (New York, NY) in Apr 2012", "Interview Descriptions": "The interview process was comprehensive- a Skype interview, then an all-day in-person interview, and then another phone interview with a potential supervisor. The all-day interview was intense, but the phone conversation with the supervisor was most important in securing the position, because they wanted to know that I would really fit with my supervisor.", "Interview Questions": "How do you handle new situations?"}, {"date": "11 Jun 2015", "title": "Global Jewish Service Corps Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at JDC (The Joint) (New York, NY) in Mar 2012", "Interview Descriptions": "There was a written application with multiple questions. A short skype interview followed. Then there was a group interview where they brought all finalists to New York. Finally, there was a placement interview", "Interview Questions": "What is a verse or teaching that is very important to you?"}]]