[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "I love working here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jan 2022", "job_title": "Creative Copywriter in High Wycombe, England", "duration": "N/A", "pros": "CSSC offer a superb work-life balance and is by far and away one of the best, kindest and more caring employers I've ever worked for in over 30 years employment. The lovely people and leadership team really care about my wellbeing and it shows with the environment they foster.\r\n\r\nThey have great in-work benefits including a generous holiday entitlement and good final salary pension provision. They offer decent pay, terms and conditions including time off for family leave, wellbeing time, discounted sports and entertainment, a comfortable working environment with good blend of hybrid and WFH ability, with staff effectively choosing where they work and how they work.\r\n\r\nThe leadership and senior teams are caring and collaborative and i am empowered to stretch myself to learn new skills and find Interesting and varied work to increase my learning and keep the work varied.\r\n\r\nHead office is close to local amenities with on-site parking. With their well established community engagement, CSSC encourage participation in helping local schools and charities with volunteering opportunities and time off to spend on local and national projections and opportunities.\r\n\r\nAs a fairly small company, career progression is limited, but possible and actively encouraged. And training is funded and sourced through good contacts allowing tremendous personal development and growth.\r\n\r\nThe whole company and every individual is passionate about colleagues, staff and member health and wellbeing and they show it every day by leading by example. The recent pandemic has highlighted huge pressures on companies to look after their staff, which CSSC has risen to meet and more than exceed my expectations, choosing to retain and retrain staff.\r\n\r\nIt's a Cliché but CSSC truly has the feel of a small intimate, family company, with the huge reach and impact of a national institution. CSSC especially represents an excellent opportunity for first time employment out of school or university or those passionate about helping others and allows excellent collaborative working practices helping to learn new skills across a range of departments.", "cons": "Limited on-site parking. There is also limited internal career progression due to small number of vacancies, which is mainly because very few people leave as they're so happy here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A great company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Feb 2022", "job_title": "Head Of Customer Experience in High Wycombe, England", "duration": "N/A", "pros": "You have a good work-life balance, with the flexibility of hybrid working throughout the week. Over the past two years CSSC has risen to the challenge to ensure staff are able to have this flexibility and are constantly reviewing how this works for the benefit of the company and its staff.\r\nThe office has a fantastic atmosphere and the staff are very friendly and inclusive which gives a family feel across the company and makes you part of something unique. \r\nCSSC live and breathe wellbeing and this shows with the benefits included as part of your role and the values of the company. Even winning awards for Wellbeing initiatives for staff's wellbeing.\r\nThe whole company are passionate about the future of CSSC and it's members and volunteers, which has broken down siloed working across departments and teams are now collaborating together.", "cons": "Some areas are under resourced due to the growth and development of the company, which means work load can be intense. However, it doesn't go un-noticed and the Executive Team and Senior Leaders work to reduce this. \r\nBecause of this times lines on projects can be delayed and cause frustrations. \r\nIT is a bit of an issue. \r\nOnsite parking can be an issue on busy days, but there is parking in a close by carpark."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Mixed bag - best to avoid", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Dec 2021", "job_title": "Digital Marketing Analyst in High Wycombe, England", "duration": "N/A", "pros": "Staff are friendly and welcoming.\r\nCEO Simon Lee was friendly and fair.", "cons": "Senior management only look out for themselves.\r\nFavourites within the business get perks and leniency where others don't.\r\nAsked for a pay rise twice, with evidence to back up from the market and my performance, but didn't get it either time for either role.\r\nExecutive team will drive decisions even though they don't have expertise in that area (e.g. wasted a lot of time on a project all of Marketing said wasn't worthwhile but was forced through by a director etc.).\r\nSenior management don't seem to understand that staff are overworked and departments can't run properly with only 3/5 employees - you need to replace those that leave."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Aug 2021", "job_title": "Marketing in High Wycombe, England", "duration": "N/A", "pros": "Really friendly colleagues - everyone makes you feel very welcome.\r\nEveryone willing to help each other - a real team environment.\r\nA real work life balance understanding from Managers and above.\r\nGreat benefits.", "cons": "None at present - only 3 months in"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Poor leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Nov 2019", "job_title": "Part Time Sales Associate in London, England", "duration": "N/A", "pros": "Resources  Lots of money Team days", "cons": "Poor management\r\nPoor HR\r\nPoor resoyrce management"}], []]