[[{"date": "23 Oct 2021", "title": "Helpdesk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sunnyside Community Services", "Interview Descriptions": "Questions were pretty straight forward. What is dhcp and what is dns. Other questions on terminology was asked.the interview was about Thirty minutes long and the interviewer was straightforward.would recommend going in at least for one interview.", "Interview Questions": "N/A"}, {"date": "8 Mar 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sunnyside Community Services", "Interview Descriptions": "The interview was friendly and direct. They ask about your experiences, what makes you qualified for the job, your strengths and weaknesses, what you can bring to the table, etc.", "Interview Questions": "What makes you a qualified candidate? \r\nWhat are your strengths and weaknesses? "}, {"date": "29 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sunnyside Community Services", "Interview Descriptions": "It is good and conducive to be conducted and have friendly environment .the interview process is good stress free and supportive. The staff assist is good and very very helpful and very good gesture is followed", "Interview Questions": "About yourself"}, {"date": "28 Aug 2019", "title": "Full Time Social Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sunnyside Community Services (Sunnyside, NY)", "Interview Descriptions": "HR handled the interview process well and professionally. Once you have to be interviewed by the supervising manager of the position you are applying for you will start to see the red flags of this company . \r\nWhile being interviewed they are also scrambling to hire from within so it might just get pulled out from under you . \r\nSupervisor was texting during my interview and felt more like an interrogation of my abilities than an exploration . Another red flag is the attitude of the supervisors hiring you, if it’s poor it just leaves a poor first impression", "Interview Questions": "My previous experiences , skills "}, {"date": "26 Apr 2019", "title": "Budget Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sunnyside Community Services (Sunnyside, NY) in Mar 2019", "Interview Descriptions": "There were three steps - phone, initial interview and final interview. After the final interview they sent employment verification form to my current employer without giving me any offer letter. They did not offer anything, wasted my time, ruined my reputation with the current employer and then ghosted me.", "Interview Questions": "What kind of financial planning experience do you have and what is your idea of the budget analyst position."}, {"date": "18 Oct 2018", "title": "Group Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Sunnyside Community Services (Sunnyside, NY) in Jun 2016", "Interview Descriptions": "Easy cause they will hire anybody  or almost anybody  for the wages they are giving.  Maybe they have changed their ways and made it harder to get hired? Don't know.", "Interview Questions": "What's your favorite  super hero? Who do you know here? What do you like to eat?"}, {"date": "8 Nov 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Sunnyside Community Services (Long Island City, NY) in Mar 2013", "Interview Descriptions": "Pretty much basic; decent, overall. They asked me how what I like to do as in hobbies. Strange questions were funny; they kept me entertained. They didn't hassle me and they took their time with me. There was no problems at all.", "Interview Questions": "Who's your favorite superhero?"}], [], [], [], [], [], []]