[[{"date": "10 Feb 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at The New Jewish Home", "Interview Descriptions": "It was good and easy process. You come in interview it took 10 minutes went over resume, asked a few questions and that’s about it. Afterwards I went to hr and spoke to someone and she let me know anything that I needed to bring, also later on that day got a confirmation email about working there.", "Interview Questions": "I got asked vital signs questions "}, {"date": "4 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The New Jewish Home (New York, NY) in Jan 2021", "Interview Descriptions": "my interviewers were very warm and welcoming and I was even more eager to come and work. They were very well-versed on the topic at hand and i learned so much within 1-hour.", "Interview Questions": "tell me about yourself? \r\nWhat was a challenge that you had to overcome "}, {"date": "10 Feb 2021", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The New Jewish Home (New York, NY) in Oct 2020", "Interview Descriptions": "Was ghosted! After 5 rounds of interviews, all of which were hastily scheduled, the company ghosted me. I never heard back from neither the hiring manager, with whom I had had several conversations nor the HR coordinator. I wrote the HR coordinator once to follow up and the coordinator said they would let me know...it's been 3 months.", "Interview Questions": "They wanted to know detailed information about what tools I used."}, {"date": "13 Aug 2017", "title": "Program Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at The New Jewish Home (New York, NY) in Jun 2017", "Interview Descriptions": "Applied. 2 weeks later phone interview with HR. \nWeek later Interview with Regional Director \nWeek later interview with VP of QA\nSame day tour of site, interviewed by staff and another PD who pretty much let me know that I wasn't appropriate for the job (this was an all day process). \n\nIt's been 2 months since all of these interviews so I believe it's safe to say I didn't get the job. Attempted to follow-up with HR but no response.", "Interview Questions": "N/A"}, {"date": "15 Jan 2016", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The New Jewish Home (New York, NY)", "Interview Descriptions": "The interview was easy enough. I had to interview with both HR and Finance, luckily I was able to get both interviews scheduled together. \r\nI first met with HR then after the HR interview I was led to another building where I interviewed with 2 directors of finance. \r\nThe questions were generic, and not too challenging. Reading prep questions online helped me to prepare. \r\nA few days after I got a call from HR with an offer", "Interview Questions": "Why should we hire you "}, {"date": "5 Nov 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at The New Jewish Home (New York, NY) in Jun 2015", "Interview Descriptions": "was casual and very well put and straight to the point i was made to feel very comfortable. my entire resume was reviewed and specific details were asked about each employer. Another employee was there to chime in on specifics on job assignments", "Interview Questions": "typical questions"}, {"date": "27 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The New Jewish Home (New York, NY) in Aug 2014", "Interview Descriptions": "Pretty easy, behavioral interview. No technical questions asked. It was held at the Manhattan location. I was interviewed by two people who wanted to know my background. Nothing extraordinary. People are professional and welcoming. Overall was short and to the point.", "Interview Questions": "Tell me about your background? What did you study at school. Tell me about your previous professional experience."}, {"date": "30 Apr 2016", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The New Jewish Home (New York, NY) in Jun 2014", "Interview Descriptions": "I added my profile on their career page and was called shortly after by their HR representative, we I meet with and who gave me some additional information about the job I would be applying for. The same day I met with the coordinator of the program that I was applying for. The interview was about a half hour long. They let me know that day that I was offered the position.", "Interview Questions": "Describe a time when you were challenged in your work and how you mitigated that challenge."}, {"date": "27 Jan 2016", "title": "Hha Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The New Jewish Home (Bronx, NY) in Mar 2014", "Interview Descriptions": "The recruitment process is very professional and they treat you as a professional not just some number like some of these other agencies. The recruitment staff walks you through the process asking very detailed information, which I liked since they don't just hire any john doe from the street. itt seems like they really care about ensuring that they hire the right people for the job. I have been an aide for more than 5 years and I can say that they treated me with respect and made me feel very proud of being a \"hero\". that is what they consider us aides...heros! I am glad I joined them.", "Interview Questions": "why did you chose to become an HHA? what sort of person would you allow to take care of your parent?"}, {"date": "10 Aug 2015", "title": "NORC Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The New Jewish Home (Bronx, NY) in Jan 2013", "Interview Descriptions": "Met with HR director who was very nice and actually refer me to a different position after I didn't get the initially position I applied for. Met with the direct supervisor right after. Whole interview process was around 2-2 1/2 hours long. Second part of interview there was a nurse that was present for half of the interview to assess the clinical portion of my skills.", "Interview Questions": "What are your strengths?\r\nWhat are some challenges you have faced in the past?"}], [{"date": "26 Jan 2016", "title": "Case Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The New Jewish Home (New York, NY) in Apr 2012", "Interview Descriptions": "I was asked professional questions and explained my salary.  The interviewer was professional and did a good job, She did not rush the interview listened to me and gave me a chance to answer questions. She answered questions about the job and the mission.  I was given a chance to work in either the Bronx or Manhattan", "Interview Questions": "I was asked about my past experience"}, {"date": "3 Mar 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The New Jewish Home (New York, NY) in Jan 2009", "Interview Descriptions": "Applied online, called for interview about 2 weeks later, I should have have pulled the phone out of the wall!", "Interview Questions": "N/A"}]]