[[{"date": "19 Sept 2022", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NorQuest College (Edmonton, AB) in Jul 2022", "Interview Descriptions": "Submitted CV via website. One week turnaround after closing date for interview to be set up.  Standard Interview. Two interviewers via zoom. Two in Person. Interview felt like a formality. As if the job was already awarded to someone else. Very flat panel. Very little by way of follow up questions.", "Interview Questions": "What qualifies you to teach at the college level?  Walk through you education and experience and discuss how you would be a good fit for this position. "}, {"date": "2 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NorQuest College", "Interview Descriptions": "Three panel interview. Very friendly. Called to do an in person interview. 45 min. Team Lead. Two managers. Called references. Phone job offer before the written one. Two weeks process.", "Interview Questions": "Why you want to work at NorQuest College?"}, {"date": "9 Aug 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NorQuest College in Jan 2022", "Interview Descriptions": "Guiding and helping students meet or exceed their educational goals to optimize their college experiences is very rewarding to me, and I enjoy knowing that I played an important role in future professionals' fruitful careers.\"", "Interview Questions": "Guiding and helping students meet or exceed their educational goals to optimize their college experiences is very rewarding to me, and I enjoy knowing that I played an important role in future professionals' fruitful careers.\""}, {"date": "11 Dec 2021", "title": "Associate Registrar Student Records Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NorQuest College (Edmonton, AB) in Dec 2021", "Interview Descriptions": "Two interviewers, very easy going, seemed very personable. Questions were in a rotation, I was given opportunities to return to previous questions to add information, in the even I had recalled a new piece of pertinent information. Questions were application based, example: Describe a time when you were in a conflict situation, what was your reaction? If you could describe yourself in three words, what would those words be?", "Interview Questions": "Why am I interested in this position?\nDescribe a time when you were in a conflict situation, what was your reaction? \nIf you could describe yourself in three words, what would those words be?"}, {"date": "1 May 2022", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NorQuest College in Sept 2021", "Interview Descriptions": "Interview conducted online. They asked very in-depth questions and expected you to come prepared. Many questions were pretty standard for customer service interviews - previous experience, dealing with challenging customers, etc., but they wanted to hear specifics and hypotheticals as well in as much detail as possible.", "Interview Questions": "How did you hear about this position and why do you want to work for NorQuest?"}, {"date": "10 Jul 2021", "title": "Elcc Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at NorQuest College", "Interview Descriptions": "Lengthy, included 10 minute teaching demo. 3 interviewers. People were nice but it still felt daunting. Also had to fill out a pre-interview form to verify my education. The sooner the better.", "Interview Questions": "\"Describe a time that you encountered a new situation and how you handled it.\""}, {"date": "11 Aug 2021", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at NorQuest College (Edmonton, AB) in May 2021", "Interview Descriptions": "I had 2 interviews. One was over zoom.. Asked a couple of question that were technical and other behavioural questions. I had in the interview - the Program Manager and the Director or VP of Projects", "Interview Questions": "Tell us about your everyday as a Business Analyst?"}, {"date": "26 Oct 2021", "title": "HR Business Partner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NorQuest College (Edmonton, AB) in Jun 2020", "Interview Descriptions": "Interview process was not structured and did not seem professional.  When I received an offer, the letter and information provided had many errors. I did receive a phone call for an interview fairly quick.", "Interview Questions": "Why did you apply for this position?"}, {"date": "10 Feb 2021", "title": "Senior Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NorQuest College (Edmonton, AB) in Feb 2020", "Interview Descriptions": "Very lengthy panel style interview. Typical corporate questions. Very formal. Portfolio presentation describing 3 different projects in detail including design process. The interview was one hour in length and there was a prescreen.", "Interview Questions": "Describe a time you didn’t agree with a colleague on your team?"}, {"date": "17 Aug 2020", "title": "Junior Infrastructure Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NorQuest College (Edmonton, AB) in Apr 2017", "Interview Descriptions": "I was brought in for an interview for a summer student position. They asked me questions about the company, my previous job experience and my education. It was relatively quick, 45 - 60 min.", "Interview Questions": "When in a previous job or group project did you experience conflict with in your group and how did you solve this?"}], [{"date": "26 Jul 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NorQuest College (Edmonton, AB)", "Interview Descriptions": "Panel interview of 5 people total, including HR, the direct hiring manager in which I worked under, and the individual who I was replacing (she was moving on to another role within the department). They were very focused questions about leadership style, interacting with management, and process facilitation scenarios. Interview lasted about an hour total.", "Interview Questions": "What do you do if your boss told you 1+1 = 3? How would you handle this?"}, {"date": "27 Dec 2016", "title": "Manager, PMO Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NorQuest College (Edmonton, AB) in Jul 2015", "Interview Descriptions": "Interview in two parts: screening and then full interview. The screening was quite straightforward, mostly testing content knowledge. It was so easy that I thought the thing they were really looking for was an evaluation of my verbal communication skills and general suitability before taking the time to conduct the full interview.\r\n\r\nThe second interview was 60 minutes and used behavioural descriptive interviewing - looking for examples of how I had previously addressed situations and the outcomes.", "Interview Questions": "Screening interview focused entirely on content knowledge - what's the difference between a project and a program, etc. "}]]