[[{"date": "16 Nov 2022", "title": "MedicL assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow in Sept 2022", "Interview Descriptions": "Great interview. Manager very nice and seems like a great place to work and learn Showed me around the clinic as well as showed what task I would be performing if I got the job. Let me know could work a different clinics in the area and that was okay with me", "Interview Questions": "Tell me your greatest weakness"}, {"date": "23 Jun 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CareNow", "Interview Descriptions": "Lengthy process with background check but the job was easy going . Interview questions were basic questions. They asked about scenarios and asked how I would handle them. Asked about prior job experience.", "Interview Questions": "How I would handle a scenario of an angry customer "}, {"date": "23 Jun 2022", "title": "Patient Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CareNow (Fort Worth, TX) in Jun 2022", "Interview Descriptions": "Asked a few questions, I didn’t have the experience they were looking for, I did let her know I can be trained and learn fast. They chose other candidates. I was really wanting this job.", "Interview Questions": "How would you handle situations."}, {"date": "10 Feb 2023", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CareNow (Telephone, TX) in May 2022", "Interview Descriptions": "Interview was in depth. I was asked about my previous position and pass experiences, along with examples of how I handled difficult situations, and any questions I would have. She answered basic questions about what the position entails.", "Interview Questions": "What was my previous experience"}, {"date": "29 Jan 2022", "title": "Certified Medical Assistant (CMA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CareNow", "Interview Descriptions": "Spoke with the CM over the phone and was brought in for a formal in person session. Once the interview was complete I met the entire office staff working that day and was shown the different processes of the clinic.", "Interview Questions": "If you could have dinner with any person, dead or alive, who would it be?"}, {"date": "30 Jun 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow (Dallas, TX) in Jun 2021", "Interview Descriptions": "The interview process was very fast and on time. I was able to talk to recruiter first. Then I had an interview with the medical doctor. From the I was hired a few dAys later. I had orientation and shadowing.", "Interview Questions": "What skills I am capable of performing "}, {"date": "15 Apr 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CareNow", "Interview Descriptions": "Pretty easy process I applied online and a week later I got a call from the hiring manager I arrived at the location and waited like 10 mins, there was 2 interviewers the hiring manager and one of the managers from another location It was like a basic conversation no real questions were asked but 1 They were just going over my jobs I done and they went over the benefits,what scrubs and shoes I can wear, she showed me around the facility and told me to expect a call and that the process will take 3 weeks I got the call today a week and a half after the interview and I accepted.", "Interview Questions": "Name a time where you had a irate patient tell me how you handle it."}, {"date": "30 Mar 2022", "title": "Multi-tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow (Lewisville, TX) in Mar 2021", "Interview Descriptions": "The interview with the manager was good, it was recruiting that was a disappointment. I was informed a certain pay amount was submitted but rejected due to \"other techs\" not making that much. Only to get hired and find out that I'm not even making close to what a NCT makes. Im a NCT-Tech w/ MA Certification and don't even make $18hr. There are people here LESS qualified and are making more than me! Yet Multi-Techs get abused the most. I now understand why the turn over rate is so high.", "Interview Questions": "What makes you want to work at CareNow?"}, {"date": "25 Nov 2020", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CareNow", "Interview Descriptions": "It was quick and easy. Everyone was friendly. The process took over a month but once it got going I was good to go. Overall it’s a good starting place. But nowhere you’d want to settle long term.", "Interview Questions": "Why do you want to work here "}, {"date": "24 Oct 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CareNow (Rockwall, TX) in Sept 2020", "Interview Descriptions": "Applied and got phone interview one week later then in person interview a little over a week. Went really good. We ended up discussing pay and what my hours would be. I am still waiting to hear back.", "Interview Questions": "What do I look for when searching for a company to work for"}], [{"date": "7 Aug 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow", "Interview Descriptions": "I met with the manager in the clinic for a formal interview and a review of the daily responsibilities of the position. We went though some of my basic skills to ensure I would be able to efficiently perform some tasks. I was also able to speak with other staff individually to get an idea of what it was like to work in this clinic.", "Interview Questions": "How would you describe your work ethic?"}, {"date": "21 Dec 2019", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at CareNow (Dallas, TX) in Dec 2019", "Interview Descriptions": "The interview was easy but the peer to peer was something else. I thought it would be different but it was like a second interview to see if you fit in. You basically get two interviews and then they decide.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "16 Nov 2019", "title": "Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow (Fort Worth, TX)", "Interview Descriptions": "Great they were very pleasant. The staff all had great personalities and they were very helpful. I look forward to seeing the location in person.  They answered all my questions.", "Interview Questions": "Why do you want to work for Care Now "}, {"date": "24 Feb 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CareNow (Austin, TX) in Oct 2019", "Interview Descriptions": "Very informal. Really easy interview process. Standard for admin healthcare position. I was offered a job on the spot but declined due to low starting pay although i have over 10 years of direct experience.", "Interview Questions": "Tell me about a time you had to deal with a difficult patient."}, {"date": "15 Sept 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at CareNow (Dallas, TX) in Mar 2019", "Interview Descriptions": "Interviewed with management team and the medical director for about an hour.  We visited a clinic and had a tour, and this lasted about an hour.    There is an opportunity to meet an existing clinic physician.", "Interview Questions": "Where do you hope to work?"}, {"date": "25 Sept 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at CareNow", "Interview Descriptions": "Had initial 30 minute interview that answered my main question on the culture.  Reviews on here are pretty harsh and if the company was looking to change I would have been interested in the challenge. I got the impression the reviews here are accurate and management grinds out operations to hit the metrics, nothing more.", "Interview Questions": "Basic questions like tell me about your background."}, {"date": "14 Sept 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CareNow (San Jose, CA)", "Interview Descriptions": "The interviewing process was pretty straight forward. They ask basic medical questions such as experience, what your wage requirement is, why you want to work for them, etc. Everyone was very nice there and the interview included a tour of the facility. Make sure you know why you want to obtain the position.", "Interview Questions": "What do you know about CareNow?"}, {"date": "4 Jul 2018", "title": "Center Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CareNow (Las Vegas, NV) in Jun 2018", "Interview Descriptions": "Spoke with the area manager via phone and was given an initial interview with the area managers in town. After that I was contacted by Human Resources to have a second interview with the market manager. I was offered the position two days later. They were very timely in all communication and didn’t leave me in the dark at all.", "Interview Questions": "What are two issues you have had leading a team in the past?"}, {"date": "27 Mar 2018", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CareNow (Houston, TX)", "Interview Descriptions": "Very informal relaxed interview. Learned about the company and chatted with director. Overall extremely pleasant.  Not a formal interview. Just learned more about the company, working environment, etc. Followed up with assistant and signed contracts.", "Interview Questions": "None"}, {"date": "17 Apr 2018", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CareNow (Dallas, TX) in Mar 2018", "Interview Descriptions": "Interviewed with the Regional Medical Director and found him personable and likable.He had thoroughly reviewed my CV and asked questions about  my previous jobs. I asked questions about physician autonomy and bonuses and was satisfied with the answers.", "Interview Questions": "What shifts would I be interested in ?\r\nWould I be interested in being a Medical Director at some point.\r\nCould I handle a very fast pace?\r\nWhen could I begin?\r\n"}], [{"date": "2 May 2018", "title": "Center Manager In Training Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CareNow (Coppell, TX) in Mar 2018", "Interview Descriptions": "Application:\r\nI applied online for a center manger position. The process took about 6 weeks total. I interviewed at CareNow (Coppell, TX) in March 2017.\r\n\r\nInterview:\r\nThe process is ridiculously long and a complete was of time. I applied online and the following occurred over the course of 6 weeks.\r\n     1. A telephone call with a garbled message to call back to a different number than the one that called.\r\n      2.  I called and left a message on the voicemail of the number that called stating my name and position applied for and contact info for a return phone call from the original person who called me.\r\n3. The hiring area manager calls me and schedules an in-person interview. The interview was very casual. Hiring manger kept speed talking certain points.", "Interview Questions": "Tell me about an experience in which you or someone you know dealt with a difficult patient or family member."}, {"date": "11 Oct 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow", "Interview Descriptions": "It was a lengthy process, I waited about a hour once I arrived for the interview. When I entered the room there were two interviewers and they asked several questions lasting about a hour and told me I would hear something back within two weeks.", "Interview Questions": "My experience in the healthcare. "}, {"date": "27 Oct 2017", "title": "Front Desk Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CareNow (Denton, TX) in Oct 2017", "Interview Descriptions": "Asked questions from packet. Questions were easy things like talk about a time you went out of your way to help a patient. Was told I would need to meet with several other company employees. Scheduled my second interview with the area manager and marketing guy.", "Interview Questions": "Have you missed work in the last 6 months?"}, {"date": "29 Sept 2017", "title": "Center Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CareNow (Coppell, TX) in Feb 2017", "Interview Descriptions": "The process is ridiculous long and a complete was of time. I applied on-line and the following occurred over the course of 3 weeks.\r\n     1. phone interview\r\n     2. 2 days later in person interview with area manager\r\n     3. 1 week later in person interview with his boss and another area manager that was late ( she got an attitude because I didn't interrupt the interview to stand up and shake her hand).\r\n      4. Had an interview the same day with the Director and was told i would be contacted about employment.\r\n      5. Never head back 2 weeks later, I knew someone on the inside and they said I didn't get the job because I lived to far. What the Hell? Phone call would have been nice.\r\n\r\nThe pay was going to be 52,000, plus bonus potential up to 63,000. You have to work as a nurse/medic while managing the clinic.", "Interview Questions": "First interview is pretty in depth what are the 5 rights to administering drugs, what antibiotics do you know, do you know how to give a shot, what muscle, how many mls, plus all your standard HR questions ( what if so and so stole an apple....)"}, {"date": "9 Dec 2016", "title": "Patient Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CareNow (Coppell, TX) in Dec 2016", "Interview Descriptions": "Very smooth. The drive was very long and the directions was very confusing , but over time I found the location in Coppell , Tx. The interview was very tense and I didn't think the recruiter liked me at all. She would sometimes cut me off in my sentence but maybe that's just her personality. The recruiter is very very sweet just a straight to the point woman which I love! When the interview was over she informed me that the hiring process would take 2 weeks. But the next day TODAY I got an offer to start January 9th,2017", "Interview Questions": "How do you feel about being on call only 2 weekends in the year?"}, {"date": "11 Aug 2017", "title": "Medical Records Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CareNow in Sept 2016", "Interview Descriptions": "I applied for a medical records position and was offered a job in the billing department. I was transferring from the clinic so we mostly talked about that and my future plans. Easiest interview ever but that manager is no longer there.", "Interview Questions": "Why do you want to transfer?"}, {"date": "15 Aug 2016", "title": "PA Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at CareNow (Fort Worth, TX)", "Interview Descriptions": "Very laid back interview with Area and Regional Manager. Exec staff very up front  about what is expected from a part-time PA. There was a lengthy clinical skills test which I felt was very relevant to the position. Overall, a very positive experience.", "Interview Questions": "Are you willing to float to other clinics as needed? Are you willing to light a fire under the front desk and nursing staff to ensure prompt patient service?"}, {"date": "23 Apr 2016", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CareNow (Keller, TX) in Feb 2016", "Interview Descriptions": "I applied online to serveral different carenows, finally I gained aninterviewed with FDC and area manager at the same time. It was a pretty basic interview nothing to out of the ordinary. Then a few weeks later HR called me asking if I wanted to accept the job offer.", "Interview Questions": "How do you handle doing things outside of you job description?"}, {"date": "10 Nov 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at CareNow (Overland Park, KS) in Dec 2015", "Interview Descriptions": "She wasn't focused. She kept getting interuppted. She kept using her cell phone. It was very uncomfortable and rude to be honest.  I came prepared for a business interview and walked into a mess!", "Interview Questions": "Personal"}, {"date": "22 Aug 2015", "title": "PA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow", "Interview Descriptions": "phone interview with HR recruiter, then emailed with offer for an in person interview at headquarters with 2 managerial staff members.  did not offer traveling expenses for interview.", "Interview Questions": "Tell me about yourself.  Why do you want to work at this company?  What do you know about this company?  "}], [{"date": "22 Oct 2016", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CareNow (Duncanville, TX) in Jun 2015", "Interview Descriptions": "Interview itself was very easy, however I had to drive two hours to the corporate office to do the initial interview. The second interview is done at the clinic you'll be working at with the center manager, front desk coordinator, and area manager. If you're hired they do the drug screen and tb test on the spot.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Jul 2017", "title": "Center Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow in Feb 2015", "Interview Descriptions": "Panel interview. Lots of questions. They are nice and positive and make a lot of statements about what the centers are and it is misleading. They have the regular mantra of how great they are and how it's a family, etc", "Interview Questions": "How I dealt with employee correction"}, {"date": "30 Apr 2015", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CareNow (Coppell, TX) in Feb 2015", "Interview Descriptions": "It was pretty long process. Two in person interviews, an email interview and a over-the-phone interview. The job is worth it. Doctors have more of a lengthy process. i hear sometimes it can take more than a year. If you are a good worker they will be good to you.", "Interview Questions": "Why do you want to work here. Do you have car insurance? When are you able to work?"}, {"date": "31 Dec 2014", "title": "Patient Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareNow (Coppell, TX) in Dec 2014", "Interview Descriptions": "Professional 1st interview at Human Resources building.Formal 2nd Interview with Area Management at Hotel. Drug screening and TB testing at location of interview position. The overall process was easy to follow. Communication was short notice however. Upper Management seemed really nice and down to earth. The workers in the facility seemed really nice and professional. In house office management seemed hostile and bullyish. I would not have been a good fit.", "Interview Questions": "How would you handle a difficult client"}, {"date": "1 May 2015", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at CareNow (Coppell, TX) in Oct 2014", "Interview Descriptions": "Recruiter from the Home Office reached out to me about a interview. I took a few assessments first then afterwards I was interviewed by the recruiter. She was very friendly and just asked me questions about my past experience and situations where I had to deal with a angry customer, etc.\r\nNext I had a second interview with the area and center manager. Took a drug test and tb test. A week later I was offered the position. Took abt 3 weeks maybe.", "Interview Questions": "Describe your role and responsibilities in your last job?"}, {"date": "9 Oct 2013", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CareNow", "Interview Descriptions": "Awful,  that should have been a sign not to work here", "Interview Questions": "What do you expect from us, "}, {"date": "3 Mar 2013", "title": "Center Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at CareNow", "Interview Descriptions": "Two interviews. On the first one, they tell you the job description. On the second one they interview  you.", "Interview Questions": "\"What qualities can you bring to this position?\""}, {"date": "19 Feb 2016", "title": "Network Administer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at CareNow (Bedford, TX) in Aug 2012", "Interview Descriptions": "Spoke with IT Director for about an hour.  Very smart individual, and I told him some ideas to improve the IT department, and I made it happen.  They had a very good benefits program for family medical.  The 401K had a lot to be desired.  You had to be onboard for a year before you could start contributing, then the \"Matching\" was a freaking joke.  1/2 of 1%.", "Interview Questions": "Can you do the job?"}, {"date": "18 May 2015", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at CareNow (Coppell, TX) in Dec 2011", "Interview Descriptions": "You speak to a nice lady, she also interviews other people for the same position. She asks you where you live, if there is any reason you might quit in the upcoming year, and how dependable you are. You take a test to see how intelligent you are. You don't get a call back right away. They prefer you to apply to many clinics, you have a second interview with the clinic manager. First interview is at Coppell TX.", "Interview Questions": "How are you dependable?"}]]