[[{"date": "18 Feb 2023", "title": "Dining Services Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Puget Sound", "Interview Descriptions": "I Met with management and went through a fairly standard interview process. Nothing particularly sticks out about the process, it was not difficult. The management team at the time was kind.", "Interview Questions": "I Do not remember any"}, {"date": "9 Dec 2022", "title": "A Fundraising Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Puget Sound (Tacoma, WA)", "Interview Descriptions": "Phone screen followed by a 1/2 day in person interview with a variety of team members. Overall the process was straight forward and professional, until after the interview. After traveling to their campus and spending almost 5 hours interviewing there and following-up with the people I interviewed and the hiring manager to thank them, I did not even get an email saying I wasn't getting an offer. Really unprofessional. This has never happened to me after investing that much time in an interview at any company/organization.", "Interview Questions": "What it is about this role that interests you?"}, {"date": "23 Aug 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Puget Sound", "Interview Descriptions": "There was an initial virtual with a panel of individuals followed by and on campus multi-tiered interview process with various leadership and small groups. Each session lasted between 30 minutes to 1 hour.", "Interview Questions": "Describe how you would diffuse a situation with students who were not following instructions to participate in a program safely?"}, {"date": "9 Sept 2021", "title": "Doctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Puget Sound", "Interview Descriptions": "The interview was warm and collaborative! I could tell that they valued my individual experiences and what I might bring to the center. I made a mistake at one point and corrected myself later, and they were understanding and helpful.", "Interview Questions": "What is your working philosophy as a counselor? "}, {"date": "3 May 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Puget Sound in Sept 2021", "Interview Descriptions": "Was pretty straightforward: sat down for one interview, which consisted of a pretty natural conversation. I had heard back within a few days that I had been offered the position.", "Interview Questions": "How much experience I have with Excel"}, {"date": "18 Sept 2022", "title": "Assistant Director of Corporate Relations Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at University of Puget Sound (Tacoma, WA) in Jun 2021", "Interview Descriptions": "Included a four hour-long​ panel interview with various team members and the hiring manager​. Included a screening phone call before that and a review of written materials after the panel interview. ", "Interview Questions": "How long do you believe it will take for you to be full ​trained in this role?"}, {"date": "25 Mar 2019", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Puget Sound", "Interview Descriptions": "Pretty standard, the two managers asked me about why I wanted to work at Phonathon, as well as my previous work experience. Managers then went through some situational-based questions, which were varied in terms of difficulty. Finally, interview wrapped up by the managers asking what activities you were involved with on campus.", "Interview Questions": "Describe a time when you had to quickly think on your feet."}, {"date": "23 Apr 2018", "title": "Human Resources Benefits Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Puget Sound", "Interview Descriptions": "It was a pretty simple process. I filled out an application and completed one in person interview before being hired. The office is very friendly and they were really nice to me as I completed the process.", "Interview Questions": "They asked about a time when I had to deal with confidential information and how I went about it. "}, {"date": "12 Oct 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Puget Sound (Tacoma, WA) in Oct 2017", "Interview Descriptions": "Fairly typical. Met with the hiring manager and some other folks who work in the department. On the whole, they seemed enthusiastic to work at the University, but I wasn't a good fit and the university wouldn't have been a good fit for me.", "Interview Questions": "Do you work better as an individual or on teams."}, {"date": "28 Nov 2017", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Puget Sound (Tacoma, WA) in Apr 2017", "Interview Descriptions": "Group interview with 8 applicants conducted by five current employees. Subsequently,  a one-on-one interview with a director.  The group interview was heavy on behavioral questions while the interview with the director focused more on fit employer-employee fit.", "Interview Questions": "To teach something (anything) to my interviewer in less than three minutes"}], [{"date": "29 Mar 2017", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Puget Sound", "Interview Descriptions": "The interview process was straightforward and relatively simple as it was applying for a work study position. They will ask your interest about football and your time commitments durning the fall practice schedule.", "Interview Questions": "Time Commitments and Previous filming experience. "}, {"date": "29 Apr 2016", "title": "Phonathon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Puget Sound (Tacoma, WA)", "Interview Descriptions": "It is a short, basic interview with a couple of situational questions.  Normally it is two interviewers to one candidate.  I would say it is important to be on-time.  The questions are mostly pretty basic interview questions that you would expect to hear for this level of job.  You should dress at least in business casual.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "28 Mar 2017", "title": "Facilities Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Puget Sound (Tacoma, WA) in Apr 2015", "Interview Descriptions": "The interview was brief but Dawn was very friendly and approachable. It was held in an office and was casual. The whole process took about 20 minutes- it was a quick in and out. I got a phone call later in the week asking me to come in for a second interview and that interview was about 20 minutes as well", "Interview Questions": "They asked me about my ability to work with a team"}, {"date": "10 Dec 2015", "title": "Chapel Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Puget Sound (Tacoma, WA) in Apr 2014", "Interview Descriptions": "A panel interview with multiple interviewers and one interviewee - comprised of chapel assistants and the supervisor. The panel was very friendly, as since no experience is required for the job they are likely looking for a friendly individual who seems organized and will mesh with the rest of the group. I simply answered their questions, and was in and out in about 15 minutes. I received an email about a day later.", "Interview Questions": "What would you do if the microphone stopped working during a wedding?"}, {"date": "28 Jan 2013", "title": "Campus Security Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Puget Sound (Tacoma, WA)", "Interview Descriptions": "Applied online and was contacted within a few weeks. Scheduled for a initial screening interview which covered basic qualification and overview of the position. Then called back for a second and final interview more in depth.", "Interview Questions": "Why should we hire you?"}, {"date": "16 Jan 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Puget Sound (Tacoma, WA) in Apr 2009", "Interview Descriptions": "I was on campus for a single long day of interviews.  (This was quite late in the season compared to other institutions doing similar searches.)  I was not asked to teach a class, simply to give a presentation at the end of the day, followed by an open forum in which anyone could ask questions.  My hosts mismanaged the schedule and I missed an important visit with Human Resources due to the confusion.", "Interview Questions": "Lots of standard questions, but I was also asked what I would change about the curriculum.  I'd not been asked that before and, in retrospect, it was a clue that they were in some turmoil internally."}]]