[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "needs a new CEO", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Nov 2021", "job_title": "Research Associate in Toronto, ON", "duration": "N/A", "pros": "the staff are wonderful people, the office culture is great", "cons": "the CEO is not a good leader. The staff is underpaid and over worked."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Administrative Assistant, do not recommend", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Apr 2016", "job_title": "Administrative Assistant in Toronto, ON", "duration": "N/A", "pros": "Some of the people are great, a lot of free food", "cons": "Top heavy. They expect more than you are paid for, and the pay is not good as it is. No job security. Negative reinforcement seems to be the preferred method for \"encouraging\" admins. They will point out the bad and gloss over the good. They will expect you to pick up work from other positions or their changes in structure with no increase in pay and no care for how stressful they make your life. There is no potential for growth unless you keep your mouth shut, make the right connections, don't take time off, don't have health issues, gladly let them keep increasing your responsibilities and workload without any increase in pay, and never have any complaints or feedback or else it will get back to the higher ups and they will make you miserable. This is the worst place I have ever worked their treatment of administrative staff is disgusting. If you want a job in health care, management, or donations your experience will probably be great, but admins beware! Do not put yourself through it, they will treat you like you are a dime a dozen."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Administration", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Apr 2016", "job_title": "Administrator in Toronto, ON", "duration": "N/A", "pros": "Free food when they have meetings and they have some nice staff", "cons": "Horrible communication,  low pay for administrative staff and no opportunity to move up in the organization. High turn over rate in some department. Top heavy pay and horrible benefits."}], [], [], [], []]