[[{"date": "16 Feb 2022", "title": "Finance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Medical Mission Board", "Interview Descriptions": "The interview process is very cordial, professional and practical. Everything was skewed towards finding a practical candidate ready to meet the requirements for the job. The interview was very interactive and the panel tried to make me very comfortable", "Interview Questions": "Why do you want to join the Mission Board?"}, {"date": "15 Oct 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Medical Mission Board", "Interview Descriptions": "Pretty standard three-round interview with an exam. It was pretty basic.  Had an interview with the team I was going to work with and a screening and final interview.  The final interview was offered after passing an examination.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Jul 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Catholic Medical Mission Board", "Interview Descriptions": "Very systematic and well organized. The interviewers were very humane and very courteous. They give time to answer questions and are not condescending. They get back to you and give feedback.", "Interview Questions": "Describe how you fit in this role."}, {"date": "12 Apr 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Medical Mission Board", "Interview Descriptions": "friendly interviewer and general questions;\nNot quite difficult but prepared to know what you have contributed;                                  \nfriendly interviewer and general questions;\nNot quite difficult but prepared to know what you have contributed;", "Interview Questions": "Explain your previous job experience"}, {"date": "3 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Medical Mission Board (New York, NY) in May 2020", "Interview Descriptions": "It's pretty straightforward and efficient. You don't need to jump through a lot of hoops, which makes it awesome. I thought they would have me go through three or more rounds of cumbersome interviews (which seems to be the norm now), but the internship interview process was streamlined.", "Interview Questions": "Why do you want to work at CMMB? What strengths can you bring to the team?"}, {"date": "1 Jun 2022", "title": "Estagiário De Análise De Sistemas Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Medical Mission Board in Jan 2020", "Interview Descriptions": "Entrevistas com todos os participantes em geral. Como se comporta e oq fez de importante. Só participar para saber mesmo cada um é diferente do outro. Não sei oq mais falar", "Interview Questions": "Sobre a vida profissional e o dia dia vivido"}, {"date": "26 Nov 2018", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Catholic Medical Mission Board (New York, NY) in Nov 2018", "Interview Descriptions": "Typical process of a phone interview quickly elevated to an in-person interview with the hiring team, though was surprised to see one of the VPs attending this interview. Some of the questions felt inappropriate especially compared with how I've been treated interviewing with non-Catholic entities.", "Interview Questions": "I was coming from another Catholic charity so rather than asking about me and what I bring to the table, the interview devolved into what amounted to a \"fact-finding\" mission about another Catholic charity. "}, {"date": "12 Oct 2018", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Catholic Medical Mission Board", "Interview Descriptions": "CMMB had 5 interviews and a writing test as part of their staffing requirement.  Red flags along the way - e.g. executive leadership missed the one-on-one interview and forgot to call during the scheduled time.", "Interview Questions": "They failed to disclose key aspect about the job - traveling to dangerous and developing countries. "}, {"date": "24 Apr 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Medical Mission Board (Nairobi) in Mar 2014", "Interview Descriptions": "Poorly done and the director decides who to be hired, influences hiring process by asking human resources to include people who did not follow the appropriate hiring procedure such as making applications and some of them are her relatives", "Interview Questions": "My experience In the field, what skills I had that were in line with the job. They asked me to tell them about myself and how I saw myself fit within the organization. mentioned the organizations I have worked for and the kind of programs that were implemented"}]]