[[{"date": "9 Jul 2023", "title": "Provider Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Standard interview--everything was fair game. No unexpected curveballs. Appropriate length. This was done over Zoom due to pandemic. No inappropriate questions were asked. Met with multiple stakeholders in the department over a period of a few weeks.", "Interview Questions": "Tell me about yourself, why OSUWMC, interests and areas of specialty, etc."}, {"date": "6 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH)", "Interview Descriptions": "Group interview with 6 lab members at once. Pretty straightforward questions. Nothing too difficult, heard back within a week. A little intimidating to interview with so many people at once but felt more like a conversation than interview.", "Interview Questions": "Why do you want to do research?"}, {"date": "13 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Completed an online application, then was contacted by HR about one month later,  then interviewed in-person with unit manager, shadowed for 4 hours, and was then offered a position within a week of the interview", "Interview Questions": "Describe a time you had a conflict with a coworker and how did you handle it?"}, {"date": "31 Aug 2022", "title": "Exercise Physiology Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "The interview process was easy and as expected. We scheduled a time to meet the team and go over the interview process. I even had to take a quiz. It was a great overall experience.", "Interview Questions": "Describe a time when you failed. "}, {"date": "5 Aug 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "I submitted my application by May 22. it took them a month to be able to schedule an interview with me by Jun 22. The panel interview went great with 10 different people in the Department during 4 hours long. No response, phone call or email after interview. 2 months later, i received an email state the position has filled. It’s disappointed but i was loosing my interest in the job after 3 months of waiting without notice!", "Interview Questions": "Why are you interested in Ohio State University?"}, {"date": "12 Jul 2022", "title": "Clinical Engineering Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "The interview process was lengthy, the interview itself was overall a good experience.  It challenged my knowledge it also allowed me to give good feedback on what I think about how the position should be and how I would be able to grow in the position as well.", "Interview Questions": "Tell me how you would expand on this role make it your own?"}, {"date": "1 Apr 2022", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "I was interviewed by several managers from different floors. They would ask me what my goals were and what kind of environment I liked being in. It felt very natural to talk with all of them.", "Interview Questions": "What my future goals are."}, {"date": "31 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "A quick phone interview with a recruiter or someone from HR, then an in person interview with manager, team introductions, and tour of facility.  It was very welcoming and a relaxed environment.", "Interview Questions": "An issue with a coworker and how you solved it"}, {"date": "12 Feb 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH)", "Interview Descriptions": "You have to submit an Online resume and then phone call interview with the head of that specific department. The conversation is very friendly and easy going. They ask general interview questions for the most part.", "Interview Questions": "Tell me about your experiences in this field?"}, {"date": "3 Dec 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Transparent but long--interviewed three times but it took 4 months to get through the process only to never get a callback and no letter of response from them. I was very disappointed as the hiring manager seemed like I was a final candidate.", "Interview Questions": "Why do you want this job"}], [{"date": "30 Mar 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Nov 2021", "Interview Descriptions": "I applied in September/October of 2021 and interviewed in November 2021. The process was easy and clear. After the zoom interview with the nurse manager I was contacted by HR for my references. That was it for about three months. Then one day I got another email asking for my references again. After that it was about a week or two then they officially offered me the job. After a few missed phone appointments, not my fault, I finally called the office and got my official offer. I went for my drug screen and background about two weeks later and then started the week after that. It was a long painful process but I made it!", "Interview Questions": "What kind of experience do you have, if any?"}, {"date": "2 Nov 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Quick and easy two round interview. The first was a phone interview and the second was a panel version where you were able to meet many of the faculty you would be working with. Once everything was said and done they offered me the position within a week of the second interview.", "Interview Questions": "How do you handle deadlines?\r\nDescribe how you keep track of tasks."}, {"date": "12 Aug 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Very Simple And Understanding, calm , answered all questions, she gave me a tour and explained everything I would do on the shift I would work and also introduced me to other workers and their job titles.", "Interview Questions": "What were your strength and weakness"}, {"date": "11 May 2021", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Structured interview with multiple levels (Hr, hiring manager, department head). Typical behavioral interview questions, each interview lasting about 1 hour in duration. Fairly timely response in follow up after each level.", "Interview Questions": "Describe a situation where you were faced with conflict and how you worked to resolve."}, {"date": "7 Jul 2022", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in May 2021", "Interview Descriptions": "zoom interview. all questions refer to the STAR method. very easy and interviewer was very easy to talk to. recruiter was quick and followed up the same day as the interview.", "Interview Questions": "-conflict with coworker \r\n-time you felt that you were assigned too many tasks and how you handled it\r\n-why you want to work there "}, {"date": "27 Apr 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center in Apr 2021", "Interview Descriptions": "I heard back from HR within a week of submitting my application. They reached out to schedule an interview with HR, this interview just covered things like the job description, my experience/background, rate of pay, and a slight overview of some benefits. After this, it took a few days to hear back for HR to schedule a second interview with the pharmacy team. This interview was a bit more complex and took longer. During this interview they asked job-specific questions and scenario questions. After this it took about a week for HR to contact me in regards to a job offer.", "Interview Questions": "How do you handle completing multiple tasks at once"}, {"date": "6 Jul 2023", "title": "Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Mar 2021", "Interview Descriptions": "The interview was super easy and done over Zoom. There were two rounds and virtual recorded questions. Then, once you have accepted they have you come in for a background check, medical exam, and drug screening.", "Interview Questions": "Are you comfortable operating Workday?"}, {"date": "10 Feb 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Online HireVue interview after submitting the initial application.  Only one attempt at every question.  Basic behavioral questions.  Time you went above and beyond for a patient, describe a time you worked on a team, when you made a mistake, etc.", "Interview Questions": "Describe a time you went above and beyond for a patient?"}, {"date": "8 Aug 2021", "title": "Medical Records Coding Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Oct 2020", "Interview Descriptions": "You apply through the company website by submitting a Resume they have you take a coding assessment and then phones a interview if you pass the assessment. Must go on campus and complete physical and drug screening", "Interview Questions": "What areas of coding do you struggle with"}, {"date": "30 Aug 2020", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Was easy to use and very well explained. The communication was clear through the whole process. First interview was a recorded interview which was helpful due to Covid-19 safety concerns and precautions.", "Interview Questions": "Previous experience of customer service. "}], [{"date": "4 Sept 2020", "title": "Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Aug 2020", "Interview Descriptions": "Due to COVID-19, the interview process was done as a series of Zoom interviews with various members of the pharmacy care team. I spoke with a total of 9 people, including managers, staff pharmacists and clinical specialists. THe conversations were very natural and I did not have any questions regarding certain clinical scenarios. AFter that process I went to campus for a background check to continue the process with HR.", "Interview Questions": "What was some unexpected feedback you received during residency? "}, {"date": "8 Jul 2020", "title": "SNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "The process was online and after contacting for a follow up I was given an interview. The interview went well and soon a shadow day and interview with the unit manager was had leading to on boarding within the span of 2-4 weeks", "Interview Questions": "How will this experience allow you to further your career?"}, {"date": "25 Jun 2021", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University Wexner Medical Center in Apr 2020", "Interview Descriptions": "Over zoom, talked about the my resume and then got into technical questions. Honestly, it wasn't bad. They clearly didn't know what I was looking for and I didn't know what they were looking for from them. It would have benefitted us both if I was given a domain space to study prior to talking to them.", "Interview Questions": "Just general SQL, React, and Java questions. Nothing out of the ordinary. Really, it looked like the entire team didn't come prepared for what they wanted me to do. I blame that mainly on their HR practices. They sounded inexperienced in terms of managing new hires or what they wanted to do as a team. "}, {"date": "12 Feb 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH)", "Interview Descriptions": "Pretty standard overview of science classes that I had taken and what experience I had with previous research projects. I just talked about what I had learned from course work mainly.", "Interview Questions": "What kind of what lab protocols do you have experience with?"}, {"date": "23 Jun 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jan 2020", "Interview Descriptions": "panel interview with 5 senior leaders.  While this might have been intimidating,  I found that this work was critical for our return to the office  Returning will be challenging and important .  The interview followed discussion about salary and benefits.  Overall much better than the pier", "Interview Questions": "What is your interest in this position?"}, {"date": "25 Sept 2019", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH)", "Interview Descriptions": "Straight forward with questions and just had to interview once with the hiring manager after being called in for an interview. The hiring manager was very kind and energetic and made me feel welcomed even before being hired.", "Interview Questions": "Why would I like to work at the James Cancer Hospital "}, {"date": "23 Jan 2020", "title": "Student Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jul 2019", "Interview Descriptions": "The nurse manager interviewing me was very kind and warm, she created an environment for me where I felt comfortable. We talked a lot about nursing school together which consisted of reminiscing, mutual complaints, and things we have learned from it. Her and I were relational and conversation was natural.", "Interview Questions": "Why do you want to work at The Ohio State University Wexner Medical Center? Why should we hire you?"}, {"date": "3 Sept 2020", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jun 2019", "Interview Descriptions": "The same as any other typical interview.  Disappointed they didn't take the time to \" Sell\" the position and culture to me. Poor follow up as well which I find extremely unprofessional.", "Interview Questions": "Why do you want to work here? "}, {"date": "28 Jun 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in May 2019", "Interview Descriptions": "Entire process from application submission to job offer took 3months. Applied online, then received an email inviting me to partake in a digital interview (HireVue) about a month later. Then a month after that got another email to come in for a group interview with supervisors. Next day, they asked for my references to and had to come in for a background check. After that cleared, offered me the job. Also have to do physical and drug screen", "Interview Questions": "Standard Interview Questions"}, {"date": "19 Nov 2019", "title": "Human Resources Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in May 2019", "Interview Descriptions": "Had three different interviews. Phone interview, hiring managers and one with the staff. The process took about 2 weeks. They took a while to respond so I had to reach out to them.", "Interview Questions": "Why OSU? "}], [{"date": "24 Sept 2019", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2019", "Interview Descriptions": "great supervisors totally to, they make you feel welcome. I would do it all over again. Best interview ever. Would tell my friends to give it a try the interview.", "Interview Questions": " Basic knowledge and experience"}, {"date": "2 Mar 2019", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center in Feb 2019", "Interview Descriptions": "The process took about 2 and a half weeks. I had an initial phone interview with the PI. Then I was sent a small sample assignment. From there, I had another interview through skype and was offered the job on the spot.", "Interview Questions": "What is your experience with statistical analysis?"}, {"date": "23 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University Wexner Medical Center in Dec 2018", "Interview Descriptions": "I Interviewed with the Nurse manager and the assistant nurse manager. Once offered the position, the clearance process as far as background check and physical was pretty smooth & quick.", "Interview Questions": "where do you see yourself in 5 years career wise."}, {"date": "30 Nov 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center in Jul 2018", "Interview Descriptions": "I was contacted by HR approximately 3 weeks after I applied for several Student Intern positions. I was greeted by several managers who met me for a panel interview. They asked me a variety of situational questions and personality questions.", "Interview Questions": "Typical interview questions...Can you work on holidays? How long do you plan to work here? How many hours can you commit weekly?"}, {"date": "9 Sept 2020", "title": "Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jun 2018", "Interview Descriptions": "One on one interview. We just talked about my past work and a little about me. I brought in print work I had done in the past and we look through each piece together. It took about 20 minutes.", "Interview Questions": "Question were about specific work that I had done. Ask about inspiration and workflow."}, {"date": "2 Apr 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in May 2018", "Interview Descriptions": "A virtual interview where you record responses to predetermined questions is the first step for all OSUMC positions. This was followed by a phone interview, an on-site interview, and a final interview with a group of supervisors.", "Interview Questions": "How does your experience make you a good candidate for this role?"}, {"date": "26 Jun 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "I was interviewed by the pharmacy tech manager and then one of the many bosses above him.  Standard interview questions.  I was taken on a tour of the department as well and introduced to a few employees.", "Interview Questions": " I remember being asked to name 3 things that are necessary for success in the department. "}, {"date": "31 May 2017", "title": "Content Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in May 2017", "Interview Descriptions": "I was approached through LinkedIn and encouraged to apply for the position. I had two interviews,  the first was a one hour interview, the second was a series of interviews. My interview time was engaging and the conversation was reciprocal.  I was very prepared and presented hard copies of marketing materials, and I could tell it was appreciated.", "Interview Questions": "What CMS have you worked with in the past?"}, {"date": "28 Mar 2017", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "Phone first then Went in to meet manager for in person interview. Interviewing process took three months from application to hire. Hiring process seems to take a long time in some departments.", "Interview Questions": "What do you know about study software"}, {"date": "17 Mar 2017", "title": "Quality Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Mar 2017", "Interview Descriptions": "Hour-long phone interview followed by 2-hour in-person interview with process improvement staff, senior QI staff, service line administrator, nursing staff, and data manager. In-person interview was more conversational. Included background in the position and opportunities to ask questions.", "Interview Questions": "Describe how your experience qualifies you for this position. Describe your leadership style. What is your experience writing processes and protocols? What is your comfort level communicating with clinicians?"}], [{"date": "1 Feb 2017", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "The process took 3+ months.  I was emailed about an interview with hirevue, then a few weeks later contacted for a face to face interview with 2 hiring managers. A day later I was contacted to shadow, a week after shadowing I was offered a position, I accepted and was given a start date.", "Interview Questions": "Tell me about a time you had to think outside of the box"}, {"date": "16 Feb 2018", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2017", "Interview Descriptions": "Initial interview was with 2 managers.  I was invited back to interview with the team.  Very diverse team about 5-6.  Questions were simplex enough.  Lots of new individuals on the team.", "Interview Questions": "What are your 5 year career goals?"}, {"date": "12 Nov 2016", "title": "Food Service Manager III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH)", "Interview Descriptions": "Lady was nice and straight to the point. Very quick interview. It was quite average interview not very hard to prepare for. Make sure you have the education and the years of experience.", "Interview Questions": "Why did you apply for this job?\r\nAre you familiar with how to handle a staff that is unionized?\r\nWhat makes you qualified for this position?\r\nTell me a little bit about your work history?\r\nWhat is your annual range you're looking for?"}, {"date": "19 Jan 2017", "title": "Registration Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The Ohio State University Wexner Medical Center (Powell, OH) in Nov 2016", "Interview Descriptions": "They did an online video recorded interview and an in person interview if you passed. The recoded interview I felt was more nerve racking then the in person interview. It was easy to record and the instructions are easy to understand", "Interview Questions": "How would you handle a disagreement with work colleagues?"}, {"date": "11 Jun 2016", "title": "Marketing Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "I found the position on FisherConnect and applied on their website, along with sending an email to the contact person in the job posting. Several weeks later I get an email back saying that I have been added to the interview list. Another week or two later I schedule a phone interview and schedule an in-person interview three weeks after the phone interview. The interview was very laid back and comfortable, it was a group interview and everyone was really nice.  About two weeks after, I get a call from HR to schedule a background check and I received their benefits information.  About a week after the background check, I received an offer. I negotiated then later accepted.", "Interview Questions": "What made you apply for this position?"}, {"date": "10 Oct 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2016", "Interview Descriptions": "First is a Phone call interview.  If you pass that there is then an in person interview.  My interview was with the nurse manager and Assistant nurse manager.  The phone stuff was done via a recruiter.  The recruiter was very helpful through phone and email throughout the process.", "Interview Questions": "What do you like about OSU?"}, {"date": "29 Apr 2020", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2016", "Interview Descriptions": "The process can be long, and May require a few trips to different facilities. This lengthy wait time can be very normal, and don’t forget to ask them to validate parking.", "Interview Questions": "The type of imaging equipment I had been using"}, {"date": "11 Feb 2017", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2016", "Interview Descriptions": "An appointment date and time is agreed on and you are giving an email notice of place, time and the people you are going to interview with; at least two different set of interview panels who are all Pharmacy Technician managers. The last interview for the day is done by the supervising pharmacy manager, who is a pharmacist. Depending on what specific duty of the technician job you are being interviewed for, you will have different sets of interview panels. It roughly takes an hour and a half to go through the procedure. It's fun anyways because the hiring managers are very friendly.", "Interview Questions": "When was one time in your previous job did you go far and beyond? "}, {"date": "30 Mar 2016", "title": "Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Oct 2015", "Interview Descriptions": "It took several months to hear back after I applied. I had a phone interview first with an HR rep in the department. I then interviewed with several individuals, the COO of the department, the assistant to the Chair of the department, and the surgeons I would be working for. All were very considerate people, very informative about job duties, helped me get a sense of what working on tOSU medical campus and for their department would feel like. Asked me a lot about my work qualities and my experience in the work field. Once they gave me an offer the hiring process, orientation, etc all went very quickly and I started two weeks later.", "Interview Questions": "Q: Why do you think you are a good fit for this position?\r\nQ: What are your strengths and weaknesses as an employee?\r\nQ: What kind of work environment are you looking for?\r\nQ: Describe a work conflict you experienced and how you resolved it.\r\nQ: How do you handle stress?"}, {"date": "31 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Oct 2015", "Interview Descriptions": "It was a phone interview. My boss asked me about my research experience. I just went on explaining her my research projects I did from my Bachelors. Asked me questions about the requirements like- How much you rate yourself in a scale of 1-10 for Microsoft word, excel, photoshop, Image J(all are required to update and write papers).", "Interview Questions": "Where would you be in next 5 years?"}], [{"date": "7 Jan 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Oct 2015", "Interview Descriptions": "The entire interview process was quite simple. The PI for the lab I was interviewing for received my application from HR through the career website. The initial phone interview was pretty simple. I was asked general research questions i.e. describe your background, explain your familiarity with laboratory procedures, long and short term goals, etc. The in-person interview was a little more intimidating. I was a out of state candidate, so they flew me out to Columbus the night before and the following morning I was schedule to talk with current members of the lab, followed by an associate professor who collaborates frequently with the lab I was interviewing for. Afterwards, I met with the lab PI and he asked me again to explain my background, why I would like to work for his lab, what qualities and experiences can I contribute to the team and the more obvious question, how do I feel about relocating to Ohio? Overall, it was a good experience although I wasn't offered the position.", "Interview Questions": "Describe your strengths and weakness?\r\nWhat do you look for in a lab?\r\n5-year plan? Short and Long term goals?\r\nWhy are you interested in research? More specifically the work that we are conducting in this lab?"}, {"date": "24 Sept 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Sept 2015", "Interview Descriptions": "I applied for Research Assistant position and got an email after 1 month to attend in-person interview. Its just explaining your research experience with them. I was interviewed by three persons. They had shown me the lab, explained me the research going on..They told they have more persons to interview and will get in touch later..", "Interview Questions": "In what position you want to be in 3-5 years?\r\nWhat do u like and dislike about research?"}, {"date": "31 Mar 2015", "title": "Coding Apprentice Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Mar 2015", "Interview Descriptions": "You would have to submit a resume, schedule an interview, then interview with the coordinator.  After that, a coding examination would commence that would last about one hour.  It required coding knowledge and application using Epic software and 3M encoding software.  After the interview was complete, then you would wait for a response and evaluation, but then further wait for the other applicants to complete their process.", "Interview Questions": "What are your strengths?\r\n"}, {"date": "13 Apr 2016", "title": "Security Dispatcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jan 2015", "Interview Descriptions": "I went the first time driving from Ashtabula,Ohio willing to relocate to the area for the job and was lead on for weeks with out a response. Until I hounded them then I was denied the position at the time. I applied a second time after I moved to Columbus and got the job months later. I regret ever having taken the job it was pure torture from peers and staff.", "Interview Questions": "Asked me if I was a Buckeye fan?"}, {"date": "26 Apr 2015", "title": "Office Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jan 2015", "Interview Descriptions": "Submitted an application online, they called within a week or two and scheduled an interview. very straight forward asking about info on my resume and prior experience in healthcare. Submitted an application online, they called within a week or two and scheduled an interview. very straight forward asking about info on my resume and prior experience in healthcare. Submitted an application online, they called within a week or two and scheduled an interview. very straight forward asking about info on my resume and prior experience in healthcare.", "Interview Questions": "What software am i familiar with"}, {"date": "11 Feb 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Sept 2014", "Interview Descriptions": "The entire process, from submitting my online application to being offered the position, took about one month.  I was first notified by e-mail that I was selected to participate in a video interview through HireVue. Next, I was offered (again by e-mail) a face-to-face \"targeted selection\" interview with the hiring manager and a department supervisor.  The e-mail gave very specific interview tips and expectations, including what to expect in terms of behavioral interview questions.  Within a few days, a recruiter called me to set up the interview.  The hiring manager and supervisor I met with were friendly and started off the interview asking me to walk through my resume and discuss my work history.  Then, they took turns asking me questions about my accomplishments and challenges and the actions I took in each situation.  They asked about my availability and gave me a little information about the job.", "Interview Questions": "Can you give an example of a time on a job when you handled conflict?"}, {"date": "11 Mar 2015", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Sept 2014", "Interview Descriptions": "I submitted my resume via internet. I was contacted by phone within two days and asked to come in for an interview. I met with two different hiring managers, the office manager and the medical assistant supervisor.", "Interview Questions": "I was asked what made me the ideal candidate for the position?, What skills do you have to offer?, Describe a time when you had a disagreement with a co-worker/how did you handle it?, Give an example of a time you went above and beyond for a client."}, {"date": "1 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jan 2014", "Interview Descriptions": "3 separate interviews. One with the supervisor, one with HR, and a 3rd with more people from the department. I was brought back on 2 separate dates and interviewed with different people on each date. Once I got the offer, the hiring process was slower than anticipated. I waited a while before entering my 2 weeks notice at my previous job.", "Interview Questions": "Problem-solving skills. "}, {"date": "7 Jun 2017", "title": "Nutrition Services Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Aug 2013", "Interview Descriptions": "Face to face interview.  Pretty straight forward.  Job offered shortly after interview.  Had to pass a drug test.  The process was pretty fast, probably took about 3 weeks from my first interview to my first day of work.", "Interview Questions": "Are you okay with working on Christmas or Thanksgiving?"}, {"date": "17 Sept 2013", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jul 2013", "Interview Descriptions": "I submitted an application online in June and didn’t get an offer for an interview until mid to end of July. They contacted me through email and made plans for an in-person interview (I live about 2 ½ hours away from Columbus). I only had one interview – they informed me that they chose 9 out of 50 applicants and were narrowing it down to 2. Everyone in the department (department of surgery) was very friendly and accommodating. I interviewed with three different people and the first one was running late which caused my entire interview process to run behind schedule but other than that it was a relatively pleasant experience.", "Interview Questions": "Most questions they asked me were standard interview questions such as my biggest accomplishment to date, words to describe myself, etc. I have a background in public health and one interviewer saw that I knew a few statistical programs and asked me some specific tests that I’ve used but that was probably the most difficult question of the interview."}], [{"date": "26 Jun 2013", "title": "Research Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center", "Interview Descriptions": "The process was VERY long and drawn out.  I had difficulty getting responses from the recruiters in a timely manner.  They would promise to call or email within a certain time frame and never did - a promise of 2-3 days was more like a month.  During the interview, the head of recruiting was 20 minutes late so I only had a few minutes to speak to her before being rushed to speak with another manager, who was not expecting me and as he was getting ready for a meeting only gave me a few minutes of his time and it was obvious that I was not his top priority.  I did not feel like a valued candidate and did not think I got an opportunity to answer questions and give everyone an opportunity to fully evaluate my experience and skills.", "Interview Questions": "N/A"}, {"date": "22 Jul 2017", "title": "Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in May 2013", "Interview Descriptions": "It was as expected for the role. However, from the time I applied to the first interview was several months. There was an initial phone interview,  then manager interview,  leadership, then the team. The in person portion was done in 1 day", "Interview Questions": "What attracted me to the role?"}, {"date": "12 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Mar 2013", "Interview Descriptions": "The hiring and interview process was very simple.  However, I already knew the PI for this position as he was a current graduate professor.  So I simply met with him and discussed the position, then was formally offered.  I did have some trouble dealing with the ID process at the medical center.  They seemed a little bit unorganized, but in their defense they had just moved locations and were dealing with a massive hospital construction process.", "Interview Questions": "There were no real difficult or unexpected questions, but again the interview was with a professor who I already knew."}, {"date": "10 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jan 2013", "Interview Descriptions": "The interview process consisted of 1 phone interview and 1 in person interview. Phone interview was with HR asking general questions. In person interview was with hiring manager. He asked questions about my previous experiences and also about my schooling/major. The interview process was very straight forward and easy. It was very laid back.", "Interview Questions": "What challenges did you encounter in previous jobs and how did you overcome these challenges?"}, {"date": "25 Oct 2012", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH)", "Interview Descriptions": "This was the most detailed interview process I've ever had. After a phone screening by the hiring manager, I came in for an in-person interview that lasted 6 hours. By the end of it, I had met with over 25 people, some in groups of up to 4 people, some were individual interviews. Because my position works with so many different individuals/teams, they felt it was necessary to get a wide-range of input on my skills and abilities. I thought it was a fantastic screening process.", "Interview Questions": "N/A"}, {"date": "9 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jun 2012", "Interview Descriptions": "Initially applied to research assistant II job, but was not qualified, so HR referred me to another research assistant I job. I applied online using the HR rep as a referral. I quickly got an interview, which lasted 2 hours consisting of the PI telling me about his projects, and days later got the job.", "Interview Questions": "This may sounds unrealistic, but I don't remember any hard questions."}, {"date": "8 Nov 2016", "title": "Preoperative UNit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Mar 2012", "Interview Descriptions": "I had one phone interview with HR. I then was called a week or so later to interview. I then was brought into the manager's office and was interviewed with 5-6 different people in the room at once", "Interview Questions": "Describe a stressful situation and how it was handled"}, {"date": "5 Mar 2012", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2012", "Interview Descriptions": "Initial contact was through an email requesting the interview.\r\nThe interview was a phone interview and conducted at a high level with little discussion about real job qualifications.", "Interview Questions": "This position will require work frequently during third shift, 11:00pm-7:30am hours.  How do you feel about this?"}, {"date": "15 Jul 2015", "title": "Staff RN-B Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jun 2011", "Interview Descriptions": "Face to face by staff and management. I met with unit personnel. I cant remember 30 words worth of stuff to say. I did apply for one job who basically offered me a position and then just disappeared. She wouldnt respond to calls or emails, so i will never know what went wrong.", "Interview Questions": "personal goal and professional goals"}, {"date": "11 Sept 2015", "title": "Program Coordinatorr Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Feb 2011", "Interview Descriptions": "The first interview with approximately an hour long.  You first meet with the person who will be your direct manager and then you meet with a panel of people who will be your coworkers.  This however can vary from department to department.  The second round is just a follow up with your potential future manager.", "Interview Questions": "What about this job excites you?"}], [{"date": "18 Apr 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 7 months. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Mar 2010", "Interview Descriptions": "I applied here by email. I got reply perhaps after several months. I visited here and interviewed for 2 days. I met many faculties. They wanted me and my technologies at that time. A chairman hinted that he needed me. I got an official job offer a weeks later.", "Interview Questions": "N/A"}, {"date": "19 Dec 2012", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Dec 2009", "Interview Descriptions": "Phone interview with HR first, then interviewed with 3 people within hiring department. Took about 3 hours.", "Interview Questions": "General behaviorial type questions. I.e., \"what would you do in a certain situation\""}, {"date": "21 Apr 2010", "title": "Information Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jun 2009", "Interview Descriptions": "When the company first contacted me, they set up a phone interview for a date almost a week in the future. This phone interview was then rescheduled another week into the future. After the phone interview, it took ten days for them to call and set up an interview in person which was then scheduled another week in the future. After this interview in person, there was another week in which I had another phone interview and then the job offer was made three days after that. My advice is to be patient. The career and the benefits will be well worth it. The office culture, as well as the patient care atmosphere are both second to none.  The only negative thing is the experience they would like an employee to have is expected to be gotten elsewhere, and usually a promotion will not come to help you gain that experience with another career in the medical center.", "Interview Questions": "Define a time where you were confronted with both a personal and career issue and define which you picked and why."}, {"date": "17 Nov 2011", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Jan 2009", "Interview Descriptions": "Applied online after the director of the department sent an email to my professors asking for interested candidates.  Was called in for an interview.   It was informal with the Director and Assistant Director of the department.  Asked about the mission of the hospital as well as my strengths/ weaknesses, behavioral questions, and future career goals.", "Interview Questions": "What is the mission of the hospital?  Are you familiar with our service goals?"}, {"date": "10 Mar 2010", "title": "Analysis Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University Wexner Medical Center (Columbus, OH) in Aug 2008", "Interview Descriptions": "The one on one interview was very good.", "Interview Questions": "What is your one non-work related skill that would help the team?"}]]