[[{"date": "2 Jun 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "Very easy interview process, took about a month to hear back. 1 phone interview and 1 in person. Then once hired and i accepted the position there was shadowing for a day.", "Interview Questions": "How do you think you will be a great fit for this company?"}, {"date": "19 Jan 2023", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic", "Interview Descriptions": "Talked to a hiring recruiter then manager, both were super friendly and made the interview relaxed and easy. Asked basic personality questions as I didn’t have previous healthcare experience. As long as you’re honest and have common sense/drive to learn they seem willing to hire you.", "Interview Questions": "Describe a time you were put in a difficult situation and how you handled it. How do you work in a team/group setting"}, {"date": "17 Dec 2022", "title": "Technology Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "BDI questions, some technical depending on role. Most are panel interviews with senior team members. Also, long waiting period to hear back. Also, you should be prepared to ask the panel questions.", "Interview Questions": "Give me an example of a time when ……."}, {"date": "7 Jun 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Jun 2022", "Interview Descriptions": "Easy, around one week for email, pre screening. And set interview  . Friendly recluters, and directors.   Profile will be send to different units, so it could be different interviews,  and different recluters", "Interview Questions": "Talk about yourself,  qualities of a CNA"}, {"date": "17 Jan 2023", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Jun 2022", "Interview Descriptions": "Very friendly. Made the interviews seem like I was chatting with friends. Warm and inviting atmosphere. We discussed the role and potential for growth within the organization. I can definitely see a future here", "Interview Questions": "What I do to unwind when away from work."}, {"date": "20 May 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic", "Interview Descriptions": "Entry level position suddenly required years of experience when a hiring decision was being made. Either the managers aren't able to make their own hiring decisions or there is a serious communication breakdown in their recruiting process.", "Interview Questions": "Mostly basic SQL questions, nothing overly complicated. Supposed to be a new grad level job."}, {"date": "14 May 2022", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "Very easy, interviewer was very kind. I had two interviews, one being a video chat interview, and then a shadow interview to see if I was comfortable with the environment. The shadow interview lasted a little bit over an hour and then they gave me the job offer.", "Interview Questions": "What makes you want to work here?"}, {"date": "21 Mar 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Carilion Clinic in May 2022", "Interview Descriptions": "If I could give this employer 1000 more thumbs down, extremely negative reviews, then I would gladly do so. While interviews seemed to go well for me, I am pretty shockes with this corporation as they never make follow up contact after I have applied to jobs both in Christiansburg & Roanoke where registered nurses with BSN degrees are supposedly in demand. I am trying to get into a nursing residency with this group as a nurse returning to practice after requiring multiple surgeries over the past 4 years that I needed prior to returning to work. They tried to say I never responded to any further emails or phone calls foowing interviews for multiple positions, but absolutely NOBODY has contacted me in any shape or form other than an automated email as much as 8 months later saying I was not hired with zero explanation. They never specify what they are looking for in tetms of work experience and despite trying to be a blank slate ready to learn tons of new skills to help my community, many positions never mention any applicant needs 5 or more years of experience in any given specialty and imply that being unable to work due to physical disabilities that need corrective surgeries to return to full function to be able to work are acceptable. What is even more ridiculous is that I am not an unknown there: I did almost all my clinical training as a nurse at Carilion Clinic & frequently brought patients to their emetgency department as an EMT-B on a local rescue squad. I have called around to places I interviewed at after 1-2 weeks, but might as well left messages in dead end voicemail boxes. Beyond that, when I have gone to the human resources to follow up on job applications & make sure they have everything required, the staff was shockingly hostile & kicked me out, refusing to help me out with anything. I never threatened anyone & wanted to simply see if they needed anything else from me or my referral professional contacts who have seen my work. The blatant incompetency among staff // management responsible for hiring practices proves that many there should be fired & work in a totally different field. The main reason I applied to work there is that their health insurance plan lets you see any healthcare provider inside & outside of their own healthcare providers.", "Interview Questions": "Why are you wanting to change from unpaid volunteer employment as a nurse to a paid job?"}, {"date": "22 Mar 2023", "title": "SOAR Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carilion Clinic in Apr 2022", "Interview Descriptions": "The Unit Director was super nice and I appreciate everything she does for the SOAR program. The interview was very well thought out and encouraged my acceptance for the position.", "Interview Questions": "Describe a time when you went above and beyond for a patient?"}, {"date": "16 Mar 2022", "title": "Nursing Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "Presented  ethical scenarios  to gauge how I’d handle appropriateness of patient for trial. Explained work hours and basic gist of responsibilities. Told me about different trials and how I would be responsible to manage documentation and follow up patient interviews/visits.", "Interview Questions": "How I would handle a situation where patient didn’t really meet strict criteria for trial but doctor wanted patient in trial anyways. "}], [{"date": "14 Feb 2022", "title": "Certified Peer Recovery Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic", "Interview Descriptions": "Virtual interview through Microsoft teams. It was casual and friendly. There were two hiring supervisors attending my interview, both of which were dressed casual. It was about 30 minutes in length and I was scheduled for a second follow up interview the next week.", "Interview Questions": "What do you know about our company?"}, {"date": "9 Nov 2021", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carilion Clinic", "Interview Descriptions": "Carilion in general takes longer than you think they will with calling for an interview. If you want the job, be patient. For really appealing positions, often someone is hired within but they have to still post it (don't take it personal if you don't get a call, they may have someone in mind to advance--this is good for your future work there too.)", "Interview Questions": "Behavioral type. Tell me about a time when you dealt with a difficult patient and how you handled it. Tell me about yourself (hint they don't care about your kids or hobbies),, tell me a time when you witnessed a coworker make a mistake and how you handled it. Tell me about a time you made a mistake and how you made it right, etc. "}, {"date": "4 Jan 2022", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carilion Clinic (Christiansburg, VA) in Nov 2021", "Interview Descriptions": "Very straight forward. Easy to follow and centered on collaborative teamwork. Must have past experience where you problem solved issues.  The interview is the first part of many steps to get information for your start date.", "Interview Questions": "tell me about an experience… where you had to work with someone your views differed from? where you had to de escalate a situation? what are your last experiences? why do you want to work in health care? "}, {"date": "14 Oct 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "Easy and fast hiring process after interview. oddly particular on resume screening before interview request or HR follow-up. generic application questions saved on profile to make applying for multiple positions easier", "Interview Questions": "Tell me about a problem and how you solved it."}, {"date": "20 Oct 2021", "title": "Healthcare Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Carilion Clinic (Radford, VA) in Sept 2021", "Interview Descriptions": "I was called almost the following day after I applied by the manager of the clinic I applied to for a phone interview. Interviewed the next day. Manager was extremely nice and seemed to listen well", "Interview Questions": "Tell us about a time you had a difficult coworker and how you handled it"}, {"date": "31 Aug 2021", "title": "Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carilion Clinic (Roanoke, VA) in Aug 2021", "Interview Descriptions": "Phone interview only, because I declined in person. Polite, informative, answered all my questions, I think perfectly honestly.  Basic schedule discussion and the work environment, cross-coverage, etc. Some discussion about decrease in pediatric volume and plans to try to improve this.", "Interview Questions": "Why did you apply for the position?"}, {"date": "27 Aug 2021", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Aug 2021", "Interview Descriptions": "Pretty straightforward interview process.  The hiring team seems very supportive and welcoming.  Loved the \"Job Shadow\" part of the interview process.  I wish all companies would let potential employees shadow prospective jobs.  Give candidate idea of what the job actually details.", "Interview Questions": "How would you handle a patient who does not have the funds to pay a copay? "}, {"date": "22 Jun 2021", "title": "Billing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic", "Interview Descriptions": "I had one phone interview with a recruiter who asked me your basic behavioral questions and a second interview with three individuals from the department. The second interview consisted of providing me with more information on the position. I was offered the job a week later. Overall a pleasant experience.", "Interview Questions": "Why are you looking to leave your current position?"}, {"date": "11 Jun 2021", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic in Mar 2021", "Interview Descriptions": "Definitely get asked logical questions but overall the HR department was extremely nice and the interview was a bit nerve wrecking and anxious, however they did let me ask questions and had a great discussion", "Interview Questions": "Describe a time of multitasking "}, {"date": "23 Sept 2021", "title": "Class A Cdl Truck Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Feb 2021", "Interview Descriptions": "My interview was basically getting to know my supervisor getting to know me as a person what skill set I had for the position. Learned a lot about the company and what it had to offer what the job title carried and what were my responsibilities and duties at this facility and being part of a great team.", "Interview Questions": "Questions were asked that how many hours can I work would I take a full-time position would I take a flex position would I be open to working at night what did I like about the interview that would make me want to take an exact this job at this present time."}], [{"date": "26 Feb 2021", "title": "Billing Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Feb 2021", "Interview Descriptions": "Telecommunicated interview to provide with the social distancing. Very easy to hear, communicate, and see what was going on.  Both the first and second interviews were well done and they were able to get to know me both professionally and personally.", "Interview Questions": "What was time you had to deal with a difficult situation and how did you handle it?  "}, {"date": "27 Nov 2022", "title": "Physician Assistant, PA-C Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Carilion Clinic (Roanoke, VA) in Jan 2021", "Interview Descriptions": "It was incredibly easy no hardball questions. They knew me from when I was a student so that is a great way to get a job at this location in this group, or any group that is already familiar with you.", "Interview Questions": "They did not ask me many questions, they already knew me"}, {"date": "13 Jul 2020", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic", "Interview Descriptions": "I was called over the phone by a recruiter to set up the interview and given different available time slots. It was more of a causal conversation than an interview. Questions were very simple and manager was nice.", "Interview Questions": "What makes you a good fit for this job? "}, {"date": "13 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Carilion Clinic in Jun 2020", "Interview Descriptions": "Phone interview, in - person followed by 6 hour shadowing. Overall the interview was super relaxed and felt more just like speaking to a friend. Just come prepared to know about carilion values!", "Interview Questions": "How do your values align with carilion?"}, {"date": "27 May 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Jun 2020", "Interview Descriptions": "Easy questions, weighted heavily on previous experience. Not a transparent process and offers are not discussed thoroughly. Starts with phone interview, and then a second interview. Definitely have had better experiences.", "Interview Questions": "What is the hardest experience you have had at work"}, {"date": "4 May 2020", "title": "Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Carilion Clinic (Roanoke, VA) in Apr 2020", "Interview Descriptions": "Over the phone due to COVID-19. I was interviewed by the nurse manager who was very patient and kind to me. She had a very friendly and non-intimidating disposition. The interview lasted about 30 minutes. Make sure you are prepared for questions to ask her as I was asked this 2 times.", "Interview Questions": "Q: Describe a time during a job you've had where you were faced with an ethical dilemma. How did you respond? "}, {"date": "13 Nov 2020", "title": "Junior Biostatisticians Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Carilion Clinic (Charlottesville, VA) in Apr 2020", "Interview Descriptions": "The Interview moved quickly and completed in two weeks during the pandemic - scheduled a phone interview with the director, and one with the biostatistician team, and one final talk with the director", "Interview Questions": "what statistics/analytical courses I have taken in my undergraduate study, and some questions regarding experiences from the resume"}, {"date": "3 Jan 2023", "title": "House Keeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic in Jan 2020", "Interview Descriptions": "The interviewer was very friendly and welcoming from the start, which helped to put me at ease. They took the time to thoroughly review my resume and asked thoughtful questions about my past experiences and skills. It was clear that they had done their homework and were genuinely interested in learning more about me. One thing that really stood out to me was the company's commitment to diversity and inclusion. The interviewer spoke at length about their efforts in this area and it was clear that it was a top priority for the organization", "Interview Questions": "Are you comfortable with house keeping?"}, {"date": "8 Nov 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carilion Clinic", "Interview Descriptions": "Very laid back- all managers were willing to let me shadow during the interview, which was helpful in making an informed decision. The units were all very open and accepting to interviewees", "Interview Questions": "It was just an informal conversation- no real questions"}, {"date": "13 Jan 2021", "title": "Patient Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Oct 2019", "Interview Descriptions": "Interview process was very cut and dry. Management stayed in touch during the whole process.  The process went quickly after completing all the proper steps in order to advance (background check, drug screen etc)", "Interview Questions": "How do you handle if you spot an mistake by a coworker? Do you approach them? If so, what is the approach taken?"}], [{"date": "6 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carilion Clinic (Roanoke, VA) in Sept 2019", "Interview Descriptions": "They asked behavioral styled questions during the interview. They reviewed my resume, asked about my previous jobs and asked about my references. I interviewed for the neuro trauma ICU.", "Interview Questions": "describe a situation when you went above and beyond for your patient?\r\ndescribe a situation where you had a conflict with a coworker and how did you handle it? "}, {"date": "26 Aug 2019", "title": "Non Clinical Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "I applied online, received a call from the recruiter to interview with two of the current staff holding the same job for which I was applying. After that interview, about three days later, I interviewed with two members of leadership.", "Interview Questions": "Lots of behavioral questions"}, {"date": "26 Jan 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Aug 2019", "Interview Descriptions": "The process was pretty simple: apply online, have a phone interview, then an in person interview. Since I have experience within a Patient Access department I was able to answer the questions smoothly.", "Interview Questions": "*Interviewer hands me a pen* \"Can you describe how to  us how to use a pen? This will show us how you communicate and detailed you are.\""}, {"date": "17 Sept 2019", "title": "Clinical Associate Applicant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carilion Clinic (Roanoke, VA) in May 2019", "Interview Descriptions": "The interview at Carilion was great. The person I interviewed with didn't make me feel nervous and let me shadow a Paramedic in the Emergency Department and I enjoyed being able to see what my job would be like.", "Interview Questions": "What is one situation where you could've done better working with a group of people?"}, {"date": "23 May 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Carilion Clinic (New York, NY) in May 2019", "Interview Descriptions": "I had some issues with online portion (uploading files). Once beyond that very easy. Went to job shadow and had a \"interview\" while there.  Did not feel like an interview, manager was amazing.", "Interview Questions": "How does your personality fit into the unit?"}, {"date": "7 May 2019", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic in Mar 2019", "Interview Descriptions": "I really enjoyed the interview process for this position because I got to see first hand what would be expected of me on a day to day basis.  They sit you down with a current employee for job shadowing which most companies don't. Thank you, Carilion!", "Interview Questions": "How did you respond to and handle another employee that made your job difficult?"}, {"date": "21 Nov 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Carilion Clinic (Radford, VA) in Feb 2019", "Interview Descriptions": "Various members of leadership ask you a series of questions to determine what your interests/specialites are. They also asked about your knowledge of the healthcare industry - ie are you familiar with healthcare terminology, healthcare applications, etc.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Sept 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic (Lexington, VA) in Feb 2019", "Interview Descriptions": "As part of the screening process, I received a phone call from the recruiter and then my resume and cv was forwarded to the manager. The nurse manager called me and set a date for the interview. I went in and had a successful interview. It was not difficult plus she was really nice. She then oriented me to the floor on that day and a met some of the staff too.", "Interview Questions": "How years experience do you have"}, {"date": "12 Nov 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "Panel interview, everyone was friendly, they all went around the table and asked questions for about an hour. The panel included several managers and several current analysts.  It was in a conference room.  It was pretty comfortable.", "Interview Questions": "To describe how you handle stress, to describe a time when you didn't agree with managements decision, to describe a complex project you had worked on and the outcome."}], [{"date": "21 Nov 2018", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carilion Clinic (Roanoke, VA) in Nov 2018", "Interview Descriptions": "The process took about two months, I applied from out of state. I was called for an over the phone interview  then some weeks after I was scheduled for an in person interview. I met with one person for my interview. It was a RN1 position, I was mostly asked behavioural questions. I was called back 2 days after.", "Interview Questions": "Tell me about yourself"}, {"date": "22 Oct 2018", "title": "Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "The interview process started with a phone interview with the hiring manager. Next, I came in for an interview with the hiring manager and several other key people in the department. These were all 1:1, not a group panel. They were friendly and professional.", "Interview Questions": "Describe how your past skills apply to the skills needed for this position."}, {"date": "5 Oct 2018", "title": "Medical Office Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Carilion Clinic", "Interview Descriptions": "Average interview with the manager, about 20 minutes.  However, found out more after being hired than was told during interview.  Offered job within a few days. Negotiations on pay go nowhere", "Interview Questions": "What is your employment experience "}, {"date": "19 Mar 2022", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Carilion Clinic (Christiansburg, VA) in Mar 2018", "Interview Descriptions": "Interviewed with the director of Care Management. It was informal and casual. He described the job and what areas would need coverage. He also gave me a tour and I met most of the other social workers.", "Interview Questions": "How do I handle difficult ethical situations- this job involved making calls to CPS or APS when needed"}, {"date": "30 Dec 2017", "title": "Bed Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "Phone interview, then led to face to face interview. The interview was in an office with 3 other individuals all asking me questions about my past work history, and basic behavioral questions.", "Interview Questions": "Name a time that you went above and beyond to help a customer."}, {"date": "4 Apr 2021", "title": "Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic in Dec 2017", "Interview Descriptions": "-Know basic med term\n-Speak about yourself\n-Discuss coursework\n-Interactions with team members/collaboration\n-Discuss working in an inter-collaborative environment and your reasons for pursuing a job as a medical scribe \n-Discuss the hospital's mission or your desire for furthering your skills by working as a medical scribe and your future aspirations. \n-If you have previous experience with an electronic medical record system definitely discuss that.\n-If you have previous training with HIPPA also mention that or discuss that you are open to getting that training.", "Interview Questions": " What are some challenges you faced and how did you overcome them?"}, {"date": "19 Sept 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Aug 2017", "Interview Descriptions": "Set up interview with HR rep who was very helpful and pleasant. Did a group interview with 2 other ladies. We all took turns answering the same questions. Interviewer was extremely nice and didn't try to be intimidating - the interview was very conversational.", "Interview Questions": "What is one person or event that inspires you the most?"}, {"date": "7 Sept 2017", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Apr 2017", "Interview Descriptions": "Sat down with 2 supervisors. Was asked the normal interview questions that have nothing to do with the job I was applying for.  I was never asked about my skills or how I would help in this department.", "Interview Questions": "Describe a time when you had to rely on teamwork to get a job done. "}, {"date": "25 Mar 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Jan 2017", "Interview Descriptions": "Firstly had a phone interview where manager got to know you, next had a in person interview where they asked a bunch of \"tell me a time when\" interview questions, A few days later received a phone call with a job offer.", "Interview Questions": "Tell me a time when you had a difficult experience with a customer"}, {"date": "17 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carilion Clinic", "Interview Descriptions": "Applied online. Met with the manager and educator. They asked me to explain my background and experience and then proceeded with interview  questions. These questions were all based on scenarios and previous experiences I havie had and how I dealt with conflict etc. There were not any knowledge based questions. After I was hired I was required to complete some tests that proved my competency in areas, if I hadn't passed any of the sections I would've been assigned additional learning modules.", "Interview Questions": "Situation based. \"Tell me about a time...\" \" give me an example of situation where there was conflict\""}], [{"date": "1 Dec 2016", "title": "Patient Observation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Carilion Clinic (Roanoke, VA) in Jul 2016", "Interview Descriptions": "The hiring interview process is really nice! The will call you about 3 days before the interview to make sure you can make it or not. I really  like it, especially the Human Resources Dept.", "Interview Questions": "If a patient started yelling at you, what would you do?"}, {"date": "14 May 2016", "title": "Medical Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "Interview was probably one of the interviews I've had. Very lighthearted in nature, I love these type and if you are a \"personable, and relational person\" then you shouldn't have any issues. I felt like I was talking a bit too much in the interview as I've had a lot of great experience working with a multitude of companies with different business backgrounds.", "Interview Questions": "the normal job questions such as (Give me a time when \"________\""}, {"date": "9 Jan 2019", "title": "ED Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Apr 2016", "Interview Descriptions": "I applied online\r\nI was informed that I will be interviewed via phone\r\nI was interviewed at the office by the manager\r\nI was contacted by HR to be informed that I got the job\r\nWorking here has been great!", "Interview Questions": "How do you deal with stress"}, {"date": "1 Nov 2016", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carilion Clinic (Roanoke, VA) in Apr 2016", "Interview Descriptions": "They give you the typical questions in an interview.\r\nThey also asked your aspirations with the company.\r\nThey asked if you are interested in continuing education.\r\nThey also ask why should I select you for this position.", "Interview Questions": "Why should I select you for this position."}, {"date": "16 Mar 2016", "title": "Care Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic", "Interview Descriptions": "Brief, informal in-person interview. Standard questions about personal strengths/weaknesses, past resolution process for difficult/challenging work-related situations. Interviewing staff seemed nervous and unsure about what they wanted to ask me and appeared to be \"off the cuff\" and not at all prepared. This is concerning because each interviewee should be asked the same questions for equality and comparison of overall scoring.", "Interview Questions": "\"Why do you think you're right for this position?\""}, {"date": "21 Feb 2016", "title": "Registered Nurse - Emergency Department Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carilion Clinic in Feb 2016", "Interview Descriptions": "Thirty-minute interview for new grad position followed by 4-hour shadowing.  Two interviewers asking questions, they did not have my application or any information about me.  Questions were generic, not personal.", "Interview Questions": "What are your 1-year and 5-year goals?"}, {"date": "12 Jan 2017", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Jan 2016", "Interview Descriptions": "Telephone interview because I was moving long distance to the area. Met with supervisor on a Saturday because of inclement weather. Great experience! She made sure we didn't drive over 5 hours and go home without seeing her.", "Interview Questions": "Open ended, behavioral interview questions"}, {"date": "11 Jul 2017", "title": "Fitness Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Botetourt East, VA) in Jan 2016", "Interview Descriptions": "Conducted terrible, seemed as if they did not care about the employees wants or needs. Did not ask questions regarding job, just what I could offer them. Not so much as what we could do as a team.", "Interview Questions": "Are you a team player"}, {"date": "29 Jul 2017", "title": "Environmental Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Jan 2016", "Interview Descriptions": "2 person panel, asked a lot of scenario based questions , some of which were multiple part questions. Also asked about previous experiences. High emphasis on customer service related issues.", "Interview Questions": "Name a time you had to deal with a difficult customer. What was the situation, how did you resolve the customers concern, and what was the outcome?"}, {"date": "7 Jan 2016", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Dec 2015", "Interview Descriptions": "Called for Interview, director pleasant, informed they needed two rn's, then received a letter stating they weren't hiring anyone.  This director was more laid back, basically informed me about the unit, what they did. Myself and several people feel Carilion does not value their employees.  They have nothing to retain employees,  There is no matching 401k/403b.  Salary is low compared to surrounding hospitals.", "Interview Questions": "Experience? What equipment could I use?"}], [{"date": "3 Oct 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Carilion Clinic (Roanoke, VA) in Oct 2015", "Interview Descriptions": "hired through a job fair that was hosted by carilion. It was a panel interview where you get interviewed by one or a few unit directors according to the position you are interested in.", "Interview Questions": "healthcare experience, work history, education "}, {"date": "1 Aug 2015", "title": "Director Sales and Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "3 interviews.  Very nice people. Medium difficulty of interview. Panel interview after phone interview.  Then a second panel interview. The interview lasted about 45 minutes.  You can find most of the interview questions on various interview preparedness websites.  They do make you feel comfortable during the interview process.", "Interview Questions": "Why are you leaving your last job."}, {"date": "5 Jul 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carilion Clinic (Christiansburg, VA) in May 2015", "Interview Descriptions": "Behavioral interviews with several people reading preprinted questions. Not stressful. Calm atmosphere. They take time to answer your questions. Make sure you have some. Dress well. Think of scenarios that can fit multiple questions.", "Interview Questions": "Questions ask you to describe a time..."}, {"date": "16 Mar 2015", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Mar 2015", "Interview Descriptions": "The process took about 2 weeks from application submission to HR contacting me to schedule an interview. The actual interview was about two and a half hours in length with the first portion with the the department manager (behavioral/technical background) followed by a session with the team that I would be working with (purely technical interview). It was a good experience and the interviewers made me feel welcome.", "Interview Questions": "Tell me something positive your current manager might say about you and something negative they might say about you."}, {"date": "11 Jan 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Mar 2015", "Interview Descriptions": "HR called to set up an interview. The initial interview was canceled and rescheduled due to inclement weather. The interview was performed by two RN managers. They had a packet with questions to ask and fill in the answers. The interview took about 45min. They described what it was like on an average day and asked me if I had any questions.", "Interview Questions": "In the past, how have you handled a situation where you had multiple things to do at one time? \r\nWhat would you say is one of your strengths and weaknesses?\r\nWhat kind of experience do you have as a nurse that would be beneficial for this job? \r\nHow have you handled a conflict with a coworker in the past?"}, {"date": "7 Jun 2017", "title": "Video Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in Feb 2015", "Interview Descriptions": "It took 8 months after initial contact from HR before my interview. I was interview by 2 people from the group I would be working with along with my manager.", "Interview Questions": "Did I know how H.323 worked, and was I familiar with Polycom services. "}, {"date": "10 Nov 2014", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "They ask the typical interview questions in a group format with the hiring managers present. Brush up on the cliche interview questions and don't blurt out anything unprofessional and you're good.", "Interview Questions": "None. Just practice \"what is your biggest weakness\" and \"what is your greatest strength\" answers. Google common interview questions and practice the answers to those."}, {"date": "12 Dec 2017", "title": "Internal Medicine Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carilion Clinic (Roanoke, VA) in Nov 2014", "Interview Descriptions": "the staff makes a great effort to ensure the interview day runs smoothly. They give all the necessary information about the program and the benefits. They also provide a flash drive with all the information written down, which is very convenient. They have a lot of friendly attending which make the day go by smoother", "Interview Questions": "Why did you choose this program?"}, {"date": "3 Sept 2014", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Carilion Clinic", "Interview Descriptions": "Very lenghthy, takes a long time to hear from HR department to get initial interview. Then weeks to hear back from them if you have the job. Do not attempt to call HR, it is useless, they are not responsive to your calls.", "Interview Questions": "Typical behavioral interview."}, {"date": "3 Jul 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Carilion Clinic", "Interview Descriptions": "Two interviews.  One over phone which was nice.  Applied in March was not contacted till July for interview.  I thought job was given to someone else.   Hiring process was mostly computer based.  Not much interaction with employees.   Interviewed with manager and physician of department then had conference call with the open ended questions.", "Interview Questions": "One instance where you took a bad situation and made it better."}], [{"date": "2 May 2014", "title": "Leutinent/CCPT Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Carilion Clinic", "Interview Descriptions": "There wasn't much of an interview process, as it was obvious from the begining that it was just a formal process do get through; as they already had the candidate in mind. In fact, it was unprofessional and bored-lined sexual harassment. The presence of sexual innuendo was appalling and supported by the CTLs surfing on the internet during the process was absurd. The attendance of non-management personal to participate in the process was even more disgusting. There was an employee with no interview training, no leadership experience and was not certified to be able to know or understand the answers to the questions in which he/she was asking. Definitely reflected the lack of professionalism that runs rampant in the CCPT work place.", "Interview Questions": "how would you \"reward\" an employee for doing a job that is expected of them...with the emphasis of it being a female employee...disgusting innuendo"}, {"date": "6 May 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Carilion Clinic (Roanoke, VA) in May 2014", "Interview Descriptions": "It was a job fair, they had multiple stations offer different positions, they had interviews, drug screenings, applications. They had gifts at the end of the interviews, they were very nice.", "Interview Questions": "What is your interest in nursing?"}, {"date": "21 Oct 2014", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in May 2014", "Interview Descriptions": "Very limited interview with asking about my background, experience, and education. 90% of the interview was talking about the job duties which ended up being around 20% of my actual job.  I could tell in the interview that they didn't have anyone else in mind.  After the interview process they showed me around the building and introduced me to the team.", "Interview Questions": "None. Very few questions were asked. "}, {"date": "25 Nov 2015", "title": "Interviewee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Apr 2014", "Interview Descriptions": "I had a phone interview and then was invited to come in for an in-person review. I was treated very well and the experience was good overall. I felt right at home with the people interviewing me and wanted the position.", "Interview Questions": "What do you believe that you bring to the position that sets you apart from others that have applied?"}, {"date": "26 Mar 2014", "title": "Case Manager, RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Carilion Clinic", "Interview Descriptions": "First interview, group interview with supervisors and clinical team leaders", "Interview Questions": "How long has it been since you were a bedside nurse? We' ve found that RNs lose their time management skills as they move away from the bedside."}, {"date": "11 Feb 2016", "title": "RCM Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Carilion Clinic (Roanoke, VA) in Feb 2014", "Interview Descriptions": "They had printed questions with 3-4 people in room...very robotic and not something I had experienced before in an interview, All questions were scenerio;s and what if's. They each would take turns going around the room asking these questions they had printed out like it was a test for them, questions were like have you ever been in this situation and if you were how did you handle it or have you ever done this or what do you feel about this? If an employee was breaking these rules how would you handle this situation, how do you feel about this?", "Interview Questions": "If I was in this particular situation how would i handle myself?"}, {"date": "8 Dec 2015", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carilion Clinic (Roanoke, VA) in Jan 2014", "Interview Descriptions": "The interview process I felt was a typical interview. I had two directors ask me your typical interview questions: tell me about yourself, what are your strengths and weaknesses, describe a time when... etc.\r\nAfter the interview there was a 4 hour shadowing where you followed a staff member around the department. It was a good experience overall.", "Interview Questions": "Describe a time where you made a mistake at work and what you did to remedy that mistake."}, {"date": "6 Dec 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Carilion Clinic (Staunton, VA) in Dec 2013", "Interview Descriptions": "All the basic questions were asked & answered but no REAL Job description given. Every office operates differently & job title & description of responsibilities needs to be more clear.", "Interview Questions": "Did I want to work 5 days a week"}, {"date": "25 Jul 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Carilion Clinic (Roanoke, VA) in Oct 2013", "Interview Descriptions": "Was interview by lady I was taking place of. We talked about daily living and how we knew each other. We found out that I was the medic at the time of her child's demise.", "Interview Questions": "We talked about general life and her deceased son. I was the medic that responded at that time."}, {"date": "12 Sept 2013", "title": "Director, Financial Risk Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Carilion Clinic (Roanoke, VA)", "Interview Descriptions": "I had one telephone interview and one in person interview for this position.  I was interviewed by the VP, Finance and Director, Finance", "Interview Questions": "Why do you want to move from the Washington, DC area to a much smaller city?"}], [{"date": "13 Jun 2017", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic (Roanoke, VA) in May 2013", "Interview Descriptions": "The interview process was very positive.  The Unit Director that interviewed me asked me very pointed questions about my experience and how I could be a positive addition to Carilion with examples.  She offered me the opportunity to shadow an employee to see if I would be a good fit.  The employee shadowing experience allowed me to see if the job would be a good fit for me as well.", "Interview Questions": "Give an example of how I improved a patient's experience."}, {"date": "9 Aug 2014", "title": "Department Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at Carilion Clinic in Jan 2013", "Interview Descriptions": "Took over a month to be notified that I was a candidate. Then was not scheduled for first interview for several more weeks. Panel\nInterview. Waste of time. Second interview went quicker and included the physician who did not understand the process and was frustrated.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Dec 2014", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carilion Clinic in Jul 2012", "Interview Descriptions": "Telephone interview initially, then met in person for an interview with management team. Offer was made later the same day. On-boarding new hires happens once a month with general orientation on the first Monday of the month.", "Interview Questions": "Handling difficult situations at previous jobs."}, {"date": "15 Jun 2015", "title": "Clinical Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Carilion Clinic (Radford, VA) in Jul 2011", "Interview Descriptions": "Did not take too long. Manager was very friendly. I met with the manager a couple of times. I was given a possible scenario. Had to answer some questions. Over all great manager!", "Interview Questions": "What is my experience"}, {"date": "11 May 2014", "title": "Professional Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carilion Clinic in May 2011", "Interview Descriptions": "I applied online and was called a month later for a panel interview.  The application was standard and a personality/aptitude test was emailed to me after the application was submitted.  I was given a couple of dates and times for the interview.", "Interview Questions": "N/A"}, {"date": "11 Feb 2013", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carilion Clinic (Roanoke, VA) in Apr 2011", "Interview Descriptions": "A group of senior programmers and the team manager meet in a room with the interviewee and take turns going around the table asking about background and how you would handle certain instances", "Interview Questions": "If you happen to come across a time where you have nothing to do what you do?"}, {"date": "3 May 2014", "title": "Systems Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Sept 2010", "Interview Descriptions": "Easy process and good people", "Interview Questions": "N/A"}, {"date": "17 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Carilion Clinic (Roanoke, VA) in Aug 2010", "Interview Descriptions": "It was very laid-back and informal. I was hired within 2 weeks of application. Went for drug screen and physical. I dressed up and manager said I could have worn scrubs.", "Interview Questions": "There wasn't a difficult question just general stuff like why did you go into nursing? "}, {"date": "21 Sept 2013", "title": "Case Manager, RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carilion Clinic in Jun 2009", "Interview Descriptions": "One interview, response within a reasonable time, HR was very organized, people interviewing made the experience enjoyable, not intimidating.", "Interview Questions": "Sometimes difficult to think of examples of experience you had.\r\n"}]]