[[{"date": "24 Jan 2023", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at NCH Healthcare (Naples, FL) in Jan 2023", "Interview Descriptions": "Applied on their website, got a call the next day with phone interview, had an in person interview a few days later and was offered the job driving home from the interview.", "Interview Questions": "N/A"}, {"date": "10 May 2022", "title": "Cardiovascular Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at NCH Healthcare (Naples, FL) in Feb 2022", "Interview Descriptions": "I had 4 interviews total and met most of the staff.  I really felt wanted and was excited about this. When I got the call that they were hiring someone within with far less experience in business and the modality I was crushed.", "Interview Questions": "How do you handle tough employees?  How do you feel/welcome/implement change?  Weaknesses/strengths?"}, {"date": "24 May 2021", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at NCH Healthcare (Naples, FL) in May 2021", "Interview Descriptions": "Was phoned after submission of nurse resident application and had a brief 10 minute on the phone interview. Was told I would get a call back the following Monday (I spoke with them the Tuesday before) and had not heard back.", "Interview Questions": "Related to patient safety, how would I fit in?"}, {"date": "18 May 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NCH Healthcare (Naples, FL) in Apr 2021", "Interview Descriptions": "First interview was on the phone for 20 minutes. They then brought me in to interview for 3 hours with 13 people- 3 different panels all in the same day. They were disorganized. It was a hot mess. The company has no idea how to recruit & it has no idea how to keep candidates warm. It doesn’t send out rejection letters or respond to emails. Horrible experience. The recruiting team all has less than 4 years experience & extremely unprofessional. They don’t recruit. They forward resumes.", "Interview Questions": "All over the place but the one behavioral one asked repeatedly was tell me about a mistake you’ve made. "}, {"date": "10 Feb 2021", "title": "Registered Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at NCH Healthcare", "Interview Descriptions": "After applying I was contacted by the office manager and an interview was set up.  My interview was located in the office that I applied to and I met with the Office Manager, Registered Nurse and Medical Assistant.  My interview lasted about 30 minutes.", "Interview Questions": "Why did you leave your last employer?"}, {"date": "16 Mar 2021", "title": "IT Architect Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at NCH Healthcare in Dec 2020", "Interview Descriptions": "There was an initial interview with the director and then a panel interview with three others.  Questions on customer service, getting work completed on time, managing time and multiple tasks, handing difficult situations with customer, and making mistakes.", "Interview Questions": "Who is your customer and how do you keep them happy?"}, {"date": "20 Oct 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NCH Healthcare (Naples, FL) in Oct 2019", "Interview Descriptions": "It was a two step interview process that involved a phone interview with a nurse educator and then two days later I got a call back to interview in-person at the Downtown hospital. When I arrived I was told which units I was interviewing with and proceeded to be interviewed by the units Nurse Managers. They took turns asking me questions some of which were the same on the phone interview.", "Interview Questions": "Tell me a time when a patient was unhappy with your care?"}, {"date": "15 Mar 2021", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NCH Healthcare (Naples, FL) in Sept 2019", "Interview Descriptions": "Very easy. Generic IT questions were asked during the interview. Previous IT experience was explained. Position was explained on what I would be doing if hired. I was asked if I prefer Android or iOS.", "Interview Questions": "What applications did you use at you previous IT job?"}, {"date": "12 May 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NCH Healthcare in May 2018", "Interview Descriptions": "I was interviewed at NCH downtown. There were two nurse managers there who interviewed me in a room. They alternated turns asking questions from a pre-made list. One week after the interview, I received a phone call from the recruiter who asked if I would accept the job. Be warned that they will not match your hourly rate from your previous job. They are extremely cheap.", "Interview Questions": "Why are you applying for this position?"}, {"date": "9 Aug 2019", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NCH Healthcare (Naples, FL) in Mar 2018", "Interview Descriptions": "Pretty standard. Tell us about yourself type questions. A few troubleshooting questions. They seem to be mostly looking for customer service skills, how well you can handle stress. Nothing out of the ordinary or too difficult. Had a quick phone interview then a face to face shortly after.", "Interview Questions": "Say someone calls you and states their internet isn't working, What are the first steps you would take in resolving this issue?"}], [{"date": "21 Nov 2016", "title": "Rrt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NCH Healthcare (Philadelphia, PA) in Jan 2016", "Interview Descriptions": "I received a phone call from the director of the department and set up a Skype interview with him and the clinical coordinator. The interview was your typical interview questions and it went well. I then received a phone call from the recruiter and was offered the position. The overall process was less than a week until I was offered the position.", "Interview Questions": "The interview questions were typical: 1) Who are your customers in the hospital?, 2) What are your positive strengths?, 3) How did you handle a difficult situation?, 4) Where do you see yourself 5 years from now?, Etc... "}, {"date": "31 Mar 2017", "title": "CNA/HHA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NCH Healthcare (Naples, FL) in Jun 2015", "Interview Descriptions": "They were basic and needy.  They clearly were desperate for help, but paid a bit more at the time.   In hind site I should have noticed this.", "Interview Questions": "Honestly they had none.  They talked more about them self than asked questions"}, {"date": "24 Mar 2017", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NCH Healthcare (Naples, FL) in May 2015", "Interview Descriptions": "Initially contacted by human resources to setup interview.  Met with rehab director, speech language pathologist manager and onsite supervisor for interview.  Asked a series of standardized questions. Taken on a tour of facility and offered possibility of a position at several locations, of my choosing.", "Interview Questions": "Explain a time you were faced with an ethical dilemma and how you resolved it."}, {"date": "17 Apr 2017", "title": "Certified Surgical Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at NCH Healthcare (Naples, FL) in Oct 2014", "Interview Descriptions": "They make you take a test as the application process but I do not think it is a great assessment tool. Management even admitted that some people who scored high on the test ended up being not so great employees. Interview itself was very relaxed.", "Interview Questions": "How do you handle stressful situations with a surgeon?"}, {"date": "6 Jul 2014", "title": "Accountant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at NCH Healthcare (Naples, FL) in Mar 2010", "Interview Descriptions": "There was a phone interview followed by two face to face interviews. The process started with a lame phone interview and was followed by two face to face interviews. It was a little over kill since the position only paid $25K per year. I can see this deep a dive if the job was paying $75K plus.", "Interview Questions": "There are two types of questions, type A (the employer does not have a clue what to ask you about, and type B, the employer asks real questions, e.g. what are your goals and how can you use them to further the success of NCH. Both interviews contained type A questions."}, {"date": "16 Aug 2013", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at NCH Healthcare (Naples, FL) in Jan 2009", "Interview Descriptions": "I had done clinicals there ...was well received by the people currently working there  and the director ...if you want a job  impress them during clinicals", "Interview Questions": "salary expectations "}]]