[[{"date": "9 Jul 2023", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Prisma Health (Greenville, SC)", "Interview Descriptions": "Straight forward process. Speak with recruiter to find opportunities then with clinic staff. No negotiating regarding standardized contracts or other benefits. Pretty standard large healthcare system. Nice community with lots to do for families", "Interview Questions": "Future goals in career and life"}, {"date": "5 Jul 2023", "title": "Patient Support Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Columbia, SC) in Jun 2023", "Interview Descriptions": "Great, they were very nice and informative. Very laid back and easy to talk to. Loved the staff and work environment. Felt like I could ask questions and they had an answer", "Interview Questions": "what was a problem you have faced in the past and how did you overcome it"}, {"date": "31 May 2023", "title": "Special Project Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Columbia, SC)", "Interview Descriptions": "The process was not as easy as I expected, The online database did not autofill my resume, and then the team was not easy to work with for following my resume status.", "Interview Questions": "wanted to know what I saw as the biggest threat to healthcare"}, {"date": "11 May 2023", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health (Columbia, SC)", "Interview Descriptions": "interviewing with multiple nurse managers through out multiple service lines. nurse recruiter knowledgeable and helped with navigating process. new leaders with organization supported with leadership course designed to assist in success in role.", "Interview Questions": "Peer accountability, what does it look like?"}, {"date": "26 Apr 2023", "title": "EEG Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Columbia, SC)", "Interview Descriptions": "Three interviews: Phone Interview Interview with manager Interview with the supervisor and a peer Basic questions about yourself and background, then you get asked about scenarios and have to explain a time you experienced this, etc.", "Interview Questions": "Do you have any EEG experience?"}, {"date": "12 Apr 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "It was only one interview. It went well. I only interviewed with the nurse manager. It was my first healthcare job. I took the PCT class and that’s how I was introduced to the manager.", "Interview Questions": "How do you handle tough situations?"}, {"date": "31 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health (Greenville, SC)", "Interview Descriptions": "The man doing the interview was nice enough, but he was late to the interview, seemed to misunderstand/misinterpret everything I said, and just seemed like he was too busy to bother remembering anything. I didn't want the job after the interview, but I also didn't receive an email or call afterwards from their end (despite sending a thank-you email right after and a follow-up email a week after). I think if companies expect you to take your time to drive to them and complete an interview, they should at least give you the courtesy of a follow-up communication even if you aren't their choice.", "Interview Questions": "How my experience and education would inform my work their."}, {"date": "13 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Very straight forward, make sure you have good questions of your own prepped. Very nice staff and they answered all my questions. Prepare to answer why you think you’re more qualified than other candidates", "Interview Questions": "Tell us why we should hire you"}, {"date": "27 Feb 2023", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "One face to face interview with a team of leaders in the building. For staff positions it’s generally team based on the people you would be working with / for", "Interview Questions": "What are your strengths and how do they help you complete a job."}, {"date": "17 Feb 2023", "title": "Advanced Practice Provider (NP/PA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Prisma Health", "Interview Descriptions": "Interviewed with an MD and then some NPs on the team. The session with the MD was short. He asked predominantly about my CV and relevant experience. The time with the NPs was mainly for me to ask questions. I will say, the time from application to interview was long (about four months).", "Interview Questions": "What experience do you have as a hospitalist?"}], [{"date": "9 Feb 2023", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "They do a panel of your peers. The interview process was quick and easy. One was with thd supervisor, manager and coworker. I was contacted the next day and accepted the offer.", "Interview Questions": "What are two areas you can improve?"}, {"date": "6 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "HR responded to my application submission and performed a quick initial interview via a phone call. Just basic information about the job. They scheduled interview during phone call, which was within 2 weeks. Met a \"team\" which had various employee roles such as social worker, counselor, tech, nurse. They asked behavioral questions. Another interview with manager, which had a few behavioral questions but more laid back, included info about job. Offered job within 2 weeks of interview via phone call from HR.", "Interview Questions": "What is something you need to work or improve on?"}, {"date": "2 Feb 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "Interview was conducted via zoom with the department’s nurse manager. It was very pleasant and I was given time to ask questions at the end of it. I was told that HR would follow up with me in the next few days.", "Interview Questions": "I was asked behavioral questions"}, {"date": "13 Sept 2022", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "The interview process with Prisma Health organization in the Midlands was very prompt and organized. I love the entire Talent Acquisition team as they were able to answer all of my questions and concerns.", "Interview Questions": "Very general questions were asked."}, {"date": "13 Sept 2022", "title": "Estimate work and Notification of admission Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Prisma Health (Columbia, SC) in Sept 2022", "Interview Descriptions": "It was a video interview through Teams. The interviewers asked a lot of situational type questions. For example what is the most difficult situation that you have been in while in the workplace and what was the outcome. ", "Interview Questions": "Why do you think you are a good fit for this position/company?"}, {"date": "11 Aug 2022", "title": "Certified Surgical Technologist (CST) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Prisma Health (Greenville, SC)", "Interview Descriptions": "Not the easiest of questions. Lots of behavioral type questions and lots of “tell me about a time when you did xyz”. Make sure to ask them questions as well!", "Interview Questions": "Tell me about a time when you had to adapt. "}, {"date": "2 Aug 2022", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "the process was long,  but easy. Four interviews with  5 different management. standard question, such as how can I contribute to the company? The offer letter was presented after the 5 interviews. it took them two months to make an offer. background review was as well. that took 2 weeks. rejected the offer due to hybrid role.", "Interview Questions": "how do you see yourself in 5 years "}, {"date": "7 Jun 2022", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "The manager speaks with the person being interviewed and then about 3 other employees ask a few questions. I like it because it allows different people to give their input.", "Interview Questions": "N/A"}, {"date": "19 May 2022", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "The interview process began with an interview with the supervisor or hiring manager. After that process, I was then pushed along to a peer interview with other members of the staff that I would be working with.", "Interview Questions": "Did I Have Previous Job Experience "}, {"date": "21 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "The interview process was great. I was greeted by one of the managers and she gave me a tour. After I was interviewed by her and the charge nurse, there was a peer-interview. Everyone was kind and sweet.", "Interview Questions": "Why do you want to work in the ER?"}], [{"date": "16 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "I believe that Prisma Health's interview process was smooth, easy, and quick. In my opinion, their interview process was consistent with other interview processes from other facilities. They were very kind and accommodating.", "Interview Questions": "They asked a lot of questions but they were consistent with any other interview questions that you might expect."}, {"date": "7 Mar 2022", "title": "BMET I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "It was pretty easy. It involve multiple people asking me questions about fixing and PMing equipment. I just use my previous experience as a field service Biomed to answer those questions.", "Interview Questions": "What to do if you have a equipment you never see before."}, {"date": "9 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Prisma Health (Greenville, SC) in Jan 2022", "Interview Descriptions": "It was easy and welcoming. They asked generic interview questions over zoom. The managers were attentive during the interview and made sure to make me comfortable since I was nervous.", "Interview Questions": "Tell us a bit about yourself"}, {"date": "8 Dec 2021", "title": "Leadership Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Prisma Health (Greenville, SC)", "Interview Descriptions": "STAR process. Series of panel and peer interviews. Recruiter screens for Manager. Then peer interview for skills, then working peer interview:\r\n“Tell me a time” interview process. If anyone at any time does not like you or your answer you are removed from the hiring process. Hiring for nonclinical takes a long time, six-eight weeks. No negotiation on offer, PTO includes any related holidays. Not clear during the hiring process. Three weeks PTO will include the seven holidays observed.", "Interview Questions": "Tell me a time when you had to deal with a difficult co-worker? What did you do and how did you handle the situation."}, {"date": "8 Nov 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Prisma Health (Greenville, SC) in Nov 2021", "Interview Descriptions": "the interview process was very quick and easy! very nice nurse manager and very informative!  Be prepared to go in with at least three questions. Also be prepared to answer scenario questions about previous jobs and any medical experience", "Interview Questions": "Describe a time where you fixed a small problem before it developed into a big problem"}, {"date": "13 Nov 2021", "title": "New Grad Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prisma Health in Oct 2021", "Interview Descriptions": "Roughly 2 weeks after submitting my application via the prisma website, I got a phone call from the floor manager to schedule an interview. First, she asked me to tell her a little about myself, then asked when I was available for an interview over FaceTime. The interview lasted about 20 minutes, and basically there was a group of people (3) in a conference room asking questions and taking notes while I was answering the questions on FaceTime. At the end, they let me know that I would hear back by the end of the week.", "Interview Questions": "Tell us about yourself, why are you interested in xyz field of nursing? Where do you see yourself in 5 years? What things do you do for your patients that goes above and beyond? What is a time you had to communicate something difficult with someone (I.e. doctor, coworker)? Describe a time you had to work with a difficult coworker and how did you handle it."}, {"date": "24 Sept 2021", "title": "Director, Clinical Engineering & Engineering Plant Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Leader and Peer process with a focus on behavior and performance based questions.  Multiple interview sessions with multi disciplinary team members.  Participants take turns asking questions and recording response evaluation.", "Interview Questions": "Tell me about your experience?"}, {"date": "16 Sept 2021", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Standard interview. Spoke with the hiring manager and then did a group interview. Standard questions were asked about my experience. I felt comfortable. They followed up pretty quickly with an offer.", "Interview Questions": "Tell me about yourself and your experience."}, {"date": "6 Aug 2021", "title": "Ex Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Had the phone interview with recruiter and a week later had the in person Interview with manager and team members, they made it easy.  Great attitudes, and always willing to help.", "Interview Questions": "What are your 5 year goals? "}, {"date": "26 Jul 2021", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Greenville, SC) in Jul 2021", "Interview Descriptions": "I was emailed by the hiring manager to set up a time for a phone screen.  I promptly replied back with my availability and she never responded.  I followed up to see if she still wanted to connect regarding this position.  She responded back with a time for her to call me.  I never received the call.  I again followed up with an email to see if there was a reason and if she was still interested in speaking with me regarding the position. She profusely apologized and asked my availability for the next 2 days and that she would make whatever time I picked work.  I chose a time  and she replied with an alternate time that would work better for her.  I agreed to the proposed time.  Again, she never called as I waited.  I have not communicated again.", "Interview Questions": "N/A"}], [{"date": "13 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Greenville, SC) in Jul 2021", "Interview Descriptions": "Phone Interview then in person interview. Interviewed by nurse manager and ANM.  Then you will have a peer interview. Manager will.give you a tour of the units  Interviewed for a pediatric position at the Greenville Memorial campus.   They have 2 pediatric units both are 22 beds. Interview process to job offer was quick.  Asked behavioral based interview questions. Everyone was friendly. They decide what floor you work on by personality.", "Interview Questions": "Tell me about yourself?\nTell me about a time you went above and beyond for a patient?\nWhy are you leaving your current job?\nTell me how you would handle a.conflict with an employee?"}, {"date": "14 Jun 2021", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prisma Health (Greenville, SC) in May 2021", "Interview Descriptions": "At the interview, everything went well, and he was pleasant. The issue that they don't mention was in the food service position, Morision Company managers are rude and unfair to there epmloyees.", "Interview Questions": "how much would you like to get paid hourly ?"}, {"date": "1 Aug 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Greer, SC) in May 2021", "Interview Descriptions": "One informal phone call and a formal video call. It was a panel interview with the office supervisor, nurse manager, and one of the doctors. Interview process was very quick I had the phone call then the interview the next week and was offered the job 2 days later.", "Interview Questions": "Q: When was a time you had a conflict with a co worker and how did you resolve it?"}, {"date": "19 Apr 2021", "title": "Pharmacy Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Multiple panels, full of preceptors and other specialists. Ask detailed, but fair questions. Fun group of individuals who look for someone to match their atmosphere/culture. Panels can be structured very differently depending upon the schedule and COVID era differences, however overall a very positive experience.", "Interview Questions": "Name something, not on your CV, which you are proud of?"}, {"date": "19 Mar 2021", "title": "Rad Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "Friendly staff. i was asked questions about situations and how I would respond to the situation. First was a phone interview followed by an in-person interview. The in-person interview took approximately 30 min.", "Interview Questions": "Tell me about a time that you had to deal with a difficult team member. How did you handle that situation?"}, {"date": "10 Mar 2021", "title": "emergency dept. tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Generic interview process with traditional past experience interview questions that are corporate driven.  Talent & Acquistion seems more vested in hiring the people with the right personality traits than someone who has a glowing resume.  Makes for a better work environment and encourages longterm retainment.", "Interview Questions": "Please explain a time that you had an issue with a co-work and how did you resolve it?"}, {"date": "10 Mar 2023", "title": "Patient Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Prisma Health in Mar 2021", "Interview Descriptions": "This position prompted a thirty minute interview with the nurse manager. After that you then go on to the specific unit and have a shadow experience with one of the nurses.", "Interview Questions": "What are your weaknesses? How do you cope with a stressful environment?"}, {"date": "28 Feb 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Easy and real exciting to work here it really is a good place to work and be a part of. You should get a job here you will love it and you wont go wronv", "Interview Questions": "Yes and no and why\n"}, {"date": "21 Feb 2021", "title": "Senior HRIS Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Prisma Health", "Interview Descriptions": "Initial phone screen with recruiter.  Then had separate  calls with Manager and Director.  Finally, panel interview with 3-4 co workers.  All was done using phone calls/ video conferencing due to COVID", "Interview Questions": "Tell me about yourself and behavior based questions"}, {"date": "17 Feb 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Did a phone call interview to begin with where they asked basic questions. However, i believe it was only a phone call interview because of covid. If in person i believe my interview would have gone smoother.", "Interview Questions": "Weakness’s and strengths\nthe basic interview questions"}], [{"date": "27 Jan 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Phone interview (due to covid) floor manager was nice. Questions about \"what you would do if...\" \"when did you have to deal with a difficult patient/person, what did you do?\"", "Interview Questions": "How did you handle a difficult patient in the past?"}, {"date": "26 Jan 2021", "title": "Corporate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Three stages. Departments have latitude to do different things, however, depending on the role. First was phone interview, next was small group. Third is usually a panel of people you may work with.", "Interview Questions": "Normal questions in the first two rounds about your resume and interest. Panels usually behavioral questions that were pretty specific - tell us about a time you didn’t achieve what you wanted, etc. "}, {"date": "17 Jan 2021", "title": "Exercise Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Interview was over the phone due to COVID. I believe it was a third party hiring agency that conducts all of the interviews due to the lack of having answers about the company.", "Interview Questions": "Tell me about yourself, work experience. "}, {"date": "16 Jan 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Sumter, SC) in Jan 2021", "Interview Descriptions": "Due to covid it was a virtual interview. Interviewer was really nice she explained the functions/ role and a little bit about her self. What a typical day looks like", "Interview Questions": "Tell me about yourself.\r\nHow you anticipated a patient’s anxiety"}, {"date": "20 Jan 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Prisma Health (Greenville, SC) in Jan 2021", "Interview Descriptions": "Had two virtual interviews due to COVID.  I was offered the job the next week.  Had to go to employee health for a drug test. Went through Profile Advantage for a background check. Took 3 weeks to come back.", "Interview Questions": "Tell me about a time you dealt with a difficult co-worker?"}, {"date": "10 Dec 2020", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Greenville, SC) in Dec 2020", "Interview Descriptions": "Interviewer called me. Very nice. Described the position as far as responsibilities and shifts. Asked about my experience and then asked if I was interested in position. I said yes and they sent me an email to have an offer discussion.", "Interview Questions": "Are you interested in position?"}, {"date": "8 Dec 2020", "title": "Psychiatric Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health in Dec 2020", "Interview Descriptions": "Started with an initial telephone call followed by a site visit to meet the unit team.\nDue to covid, my site visit was virtual and involved interactive meetings with the lead nursing member, the current NP whom I would work opposite, and the other physicians on staff", "Interview Questions": "Why do you want to pursue a career in psychiatry"}, {"date": "15 Oct 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "Process went well had a phone interview then in person . Was hired within a week . They do ask a lot of what if questions and scenario questions .", "Interview Questions": "How do you deal with lazy coworkers "}, {"date": "10 Sept 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Greenville, SC) in Sept 2020", "Interview Descriptions": "Applied, one week later got call for Phone interview. Then set up face time for peer interview and to talk to manager and supervisor. Was told HR should contact me in a couple of days. Waiting to hear something  sometime next week hopefully", "Interview Questions": "Name a time when you had a miscommunication with a coworker"}, {"date": "11 Aug 2020", "title": "Nursing Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prisma Health", "Interview Descriptions": "Had a phone interview with screener from HR. Next was an in  person interview with department which consisted of short questions. Then HR called to provide job offer and inform about next steps", "Interview Questions": "Example question was what would you do in a certain situation? How would you respond?"}], [{"date": "8 Sept 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prisma Health in Aug 2020", "Interview Descriptions": "Straight forward but waiting to hear something back is taking a while and has me on edge given I would really love to work with this company and have a fresh start in a new area.", "Interview Questions": "What’s my long term and short term goals. "}, {"date": "18 Oct 2020", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Greenville, SC) in Jun 2020", "Interview Descriptions": "Phone Interview with 5 other Research Coordinators. The questions were standardized. Each team member asked a question and responded accordingly. I gave long responses, and I believe this was what they desired.", "Interview Questions": "Explain a time when you were under significant duress and you endured. "}, {"date": "18 Oct 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Prisma Health (Greenville, SC) in Feb 2020", "Interview Descriptions": "1. Phone interview\n2. Face to face interview with manager\n3. Peer interview .\n\nBehavior based questions were asked.  There were about 9 questions per interview. I asked questions also. The interview process took a couple weeks to complete.", "Interview Questions": "Tell of  me of time when you had a miscommunication with a co worker? What was the situation? What was the outcome"}, {"date": "13 Feb 2020", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Columbia, SC) in Jan 2020", "Interview Descriptions": "Very smooth and timely.   I applied online and received immediate feedback they received.   Within a week,  the recruiter called and did an initial screening. Then I was called for an in person interview.", "Interview Questions": "How I handle difficult people.  "}, {"date": "22 Jan 2020", "title": "Nurse Practitioner Hospitalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prisma Health (Greenville, SC) in Jan 2020", "Interview Descriptions": "I was very happy with the interview process. I was interviewed by the Medical Director, as well as 2 potential peers, who were currently working in the role I was applying for. They were open and honest about positives and negatives of working in the facility, which was owned by another company.", "Interview Questions": "How comfortable are you with admissions and discharged? "}, {"date": "10 Jul 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Greenville, SC) in Nov 2019", "Interview Descriptions": "Neutral Experience during the Interview Process with Staff  Members at Prisma Health Center \r\nMúltiple Interviews including with Future Co-Workers with Prisma Health Center Overall Experience is Neutral throughout entire Process", "Interview Questions": "N/A"}, {"date": "5 Dec 2019", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Prisma Health (Columbia, SC) in Oct 2019", "Interview Descriptions": "Phone interview that was called in. Spoke with one person from Human Resources and she conducted the interview. Did not speak with anyone from hiring department. Interview lasted for approximately thirty minutes.", "Interview Questions": "Why do you want the position?"}, {"date": "23 Feb 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Prisma Health (Seneca, SC) in Oct 2019", "Interview Descriptions": "Phone interview with the nurse manager. We discussed an appointment to meet in person. Then we had an in person interview with peers and another in person interview with nurse manager", "Interview Questions": "How did you find this position?\r\nHow would you handle an indiscretion with an employee or patient?\r\nWhat is your past experience?"}, {"date": "1 Sept 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prisma Health (Columbia, SC)", "Interview Descriptions": "Very smooth and straight forward scenario questions.  Got to know what each person does and how the clinic works. Process takes awhile to hear back from.  I had two interviews in one week.", "Interview Questions": "How do you handle conflict with patients? "}, {"date": "7 Sept 2019", "title": "Sanitation Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Columbia, SC) in Sept 2019", "Interview Descriptions": "It was scheduled for 3p.m.&the interviewer never showed up. I waited for an hour. No explanation from anyone. Employees there had no idea where my interviewer was at or when this person would be in.", "Interview Questions": "N/A"}], [{"date": "4 Sept 2019", "title": "Mlt Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prisma Health (Greenville, SC) in Aug 2019", "Interview Descriptions": "Asks a lot of behavioral / situational based interview questions. Research questions on Google and be prepared for sure. Interbiew process took about thirty to forty-five minutes in all. Just be prepared for the questions.", "Interview Questions": "Tell me about a time you had a conflict with a coworker, physician or patient and what was the outcome? "}, {"date": "7 Jul 2019", "title": "State/Nationally Certified Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Columbia, SC)", "Interview Descriptions": "There were 3 steps in the interview process: over the phone, in person, then in person with the staff you would be working with. It is a bit lengthy but I felt it was appropriate.", "Interview Questions": "They gave me a scenario about a hard situation that could come about while on the job and asked me how I would handle the situation. "}, {"date": "18 Apr 2019", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "I applied online to the Prisma Nurse Residency  program. I was emailed to take a phone interview soon after. Then I was contacted with panel interview  times to select. One panel interview was with peer nurses from each campus and the other was managers from each campus", "Interview Questions": "Nurse behavior questions like “Tell me about a time when ... “"}, {"date": "26 Apr 2019", "title": "IT Programmer/Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Prisma Health (Columbia, SC) in Apr 2019", "Interview Descriptions": "Went pretty quick once it actually started. Included a phone screening, a peer review group interview, and an interview with the hiring manager. Reviews were mostly personality based to see how you'd interact with the team, with a few technical questions. Very laid back and relaxed atmosphere, overall a good experience.", "Interview Questions": "Biggest weakness, greatest strength?"}, {"date": "29 Mar 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Prisma Health (Spartanburg, SC) in Mar 2019", "Interview Descriptions": "The interview was very descriptive with all questions answered in a professional and helpful manner. Interviewer was very polite and positive. Offered explanation as to why job was currently vacant.", "Interview Questions": "Availability, experience, level of skill experience "}, {"date": "26 Feb 2019", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Prisma Health", "Interview Descriptions": "I did an online interview and was scheduled to speak with somebody for a phone interview.. when the recruiter finally called she said she didn't have anything available for new graduates. I wasn't really impressed with that. She wasn't even aware that I had already completed the first portion of screening.", "Interview Questions": "N/A"}, {"date": "7 Feb 2019", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "The whole interview is them asking you questions on how you handled certain situations. They first call and do a phone interview which will be three questions, and then you have 2 in person interviews with a lot more questions of how you would act in a situation.", "Interview Questions": "Tell us about a time when you use great team work?"}, {"date": "18 Jan 2019", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "The first interview process involves a phone interview from a HR representative. There were some basic questions asked about your background, the potential salary based on your experience, and etc.", "Interview Questions": "What are some qualities that are needed to make an effective team?"}, {"date": "19 Jan 2019", "title": "Summer Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "When I arrived, a group of nurses or nursing directors (about 6) from various parts of the health system were there to conduct the interview. They each went around the table and asked me a question, most of them being behavioral type questions.", "Interview Questions": "Name a time you worked as a team to accomplish a goal, why do you want to work as a GHS extern, etc."}, {"date": "20 Dec 2019", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health (Greenville, SC) in Jan 2019", "Interview Descriptions": "It was a panel interview, and they were all really nice! Basically just be yourself. Make sure you think of patient experiences in advance. I started writing down like soft skills I learned and impactful / memorable patient experiences that affected why I wanted to be a nurse a few weeks before, and that really helped.", "Interview Questions": "Tell us about yourself."}], [{"date": "29 Mar 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prisma Health (Greenville, SC) in Jan 2019", "Interview Descriptions": "Call from recruiter with typical questions. The following weed I had a call with the hiring manager and then an onsite interview  with members of the department. No trick questions. Typical behavioral questions.", "Interview Questions": "How do you prioritize your work?"}, {"date": "5 Feb 2019", "title": "RN Nurse Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prisma Health (Greenville, SC) in Jan 2019", "Interview Descriptions": "Applied online and got an interview. Went to the interview, and it took them a couple days to get back with me. They pick your unit for you if you apply to a cohort for the Nurse Residency.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 May 2020", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Prisma Health (Greenville, SC) in Jan 2019", "Interview Descriptions": "Awesome process, hiring manager was very nice and talked to me about what other opportunities may work for me.  I would love to work here when I finish my training course, a very professional company focused on customer satisfaction. Overall the interview went very well.", "Interview Questions": "Describe a  time you delivered excellent customer service. "}, {"date": "10 Jan 2019", "title": "Certified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Prisma Health (Columbia, SC) in Jan 2019", "Interview Descriptions": "In Oct i applied. The next day did phone interview then I got the real interview Nov 9th. I just had my peer interview with 3 people.it went great and now I'm waiting for a start date.", "Interview Questions": "Questions to determine work ethic"}, {"date": "21 Dec 2018", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Prisma Health", "Interview Descriptions": "Absolutely terrible. I applied for a recent position casually. They jumped on my application and moved very fast. I interviewed with the recruiter, then the lead by phone, and then had a 2.5 hour facetime interview with the team. That interview was not supposed to last nearly as long. I felt like I was shoe in for the job and with years of experience in the specialty more than well enough qualified. I was led to believe I was a strong candidate. Then I heard nothing until the recruiter called me a couple weeks later telling me that they choose to go with someone else. However they liked me enough to still want me for an as needed job, and that there would likely be a second full-time role forthcoming. Over a month passed and I saw the second job and applied. Without any reason my application was immediately turned over. I tried to inquire and got cryptic messages that they choose to pursue other candidates and that if I still wanted the prn role to let them know. I reached out the lead to try to understand why they 1, seemed so interested intially, 2, turned away now twice despite the interest and qualification, and 3, being interested enough to have me in an as needed capacity but not full-time? My questions have gone unanswered. What they don't realized is that I wasted alot of time as they dangled the carrot in front of me, and they kinda led me along. For that I am disappointed and do not trust the way they do recruitment. Plus, just be honest and forthcoming. If they didn't like me, then just say so.", "Interview Questions": "What past experiences have I had? This is where I discussed how I function in my current ER, and probably where they had the issue, because I have far more autonomy in my current role then it seems like they have. Every patient needs to be seen by the Dr too? Then what is the point? I didn't say as much though, and would have adapted. I've had scenarios like that in the past. But, in  reality, I probably dodged a bullet. "}, {"date": "22 Feb 2019", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prisma Health (Greenville, SC) in Dec 2018", "Interview Descriptions": "Formal, panel-style interview with unit managers from several GHS hospitals and also another panel-style interview with nurse peers from the specific unit.  All questions were behavioral based. The hospitals represented were the the hospitals that were currently hiring nurse residents. Some were only hiring one person.", "Interview Questions": "Describe a situation in which a coworker (or fellow student) did not pull their weight and how you handled it."}, {"date": "21 Dec 2018", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Greenville, SC) in Dec 2018", "Interview Descriptions": "I applied for the job online. About a week later I was contacted by the nurse manager and did a short phone interview. She invited me in to do a formal interview with her and her nurse educator as well as a peer interview with staff.", "Interview Questions": "Tell me about a time where you had a miscommunication at work? "}, {"date": "30 Aug 2018", "title": "Unit Secertary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Prisma Health (Columbia, SC) in Aug 2018", "Interview Descriptions": "It was a phone interview with prerecorded question . I would like to have been able to speak with someone personally and the questions did not give me a chance to highlight my skills and why I would have been perfect for the position.", "Interview Questions": "What does perfect attendance means to you. "}, {"date": "25 Jul 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Prisma Health in Jul 2018", "Interview Descriptions": "I was contacted via email to schedule a phone screening with their third party company that handles hiring. The scheduling system online didn't work properly, so I had to call them to set up my meeting. Phone always went straight to an automated message saying sorry for missing the call. It took 5 days to get through. Scheduled a phone interview and the interviewer called me 15 minutes late. It was not a positive experience and did not make me want to pursue the position.", "Interview Questions": "What do you look for in a supervisor?"}, {"date": "25 Jun 2018", "title": "Business Analyst I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health in Jun 2018", "Interview Descriptions": "Was contacted by email 1 week after applying for position for a phone interview.  Used a link to set up a time and day for interview.  Was sent a confirmation for interview along with the name of the recruiter who would be calling me.  Recruiter called right on time.  Asked basic questions, went over work schedule and said he would submit his notes to hiring manager and would hear something within 2 weeks.  I received rejection email 2 weeks and 3 days  after interview.", "Interview Questions": "If I talked with your last supervisor what would they tell me about you?"}], [{"date": "26 Apr 2019", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Prisma Health (Columbia, SC) in Jun 2018", "Interview Descriptions": "There was an initial phone interview with a recruiter. Recruiter also tells you the salary/hiring range. \r\nIn person interview with the manager.\r\nLast is a group or panel interview with your (hopefully) future peers.", "Interview Questions": "Describe a time you had to navigate a difficult situation with a colleague "}, {"date": "27 May 2018", "title": "Physician Practice Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Prisma Health (Greenville, SC) in May 2018", "Interview Descriptions": "Applied for the job on a Friday and recieved an email from the supervisor of the department of which I applied, on Tuesday so just 4 days later. We scheduled the interview for Wednesday and by Thursday I got the call that I was hired! Friday HR contacted me about pay, orientation, new hire paperwork etc, so they moved pretty quickly! The interview was a peer interview so it included who would be my direct supervisor and her 2 peers that work with the department. They asked some behavioral based questions and went into more detail about the position. The interview lasted about 20 minutes or so.", "Interview Questions": "Give me a time where you provided great customer service? "}, {"date": "25 Mar 2018", "title": "BMET II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Prisma Health (New York, NY)", "Interview Descriptions": "Interviewed with 3 people. Interview questions were scripted. Was sure I got the job. The engineering manager even called me back a day later to let me know I didn't qualify for BMET II position but they would like to have me as a BMET I and told me if I applied he could get me an offer the following week. I applied for the 2 remaining BMET I positions. They got my hopes up and I was so excited only to be let down once I received an email saying the position had been filled and another stating they are looking at other candidates.", "Interview Questions": "customer service questions"}, {"date": "17 Jan 2018", "title": "PT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "First a phone interview then a peer interview. I’m awaiting the peer interview now. They said it should take anywhere between one and two weeks from time of phone interview to be contacted again.", "Interview Questions": "What are qualities that make you an ideal candidate?"}, {"date": "26 Jan 2018", "title": "Patient Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Prisma Health in Jan 2018", "Interview Descriptions": "Got a call for an interview in person. Got there and had a pretty pleasant interview. Questions were behavior based ie: when was a time you displayed excellent customer service. You have to give a DETAILED example. They want to know what you did, how you did it and the RESULT of what you did. Best advice to is to prepare some of these questions before going in. Overall, was a great experience.", "Interview Questions": "When was a time you displayed great customer service?"}, {"date": "18 Feb 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prisma Health in Jan 2018", "Interview Descriptions": "Phone interview, just background info. They gave me General information about the position and said they would give to the hiring manager and would contact me if interested in an interview in person.", "Interview Questions": "Do I have Microsoft experience and how many years?"}, {"date": "5 Feb 2022", "title": "Coding Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Prisma Health (Greenville, SC) in Jan 2018", "Interview Descriptions": "Full day of panel interviews with  groups including coding, quality, others.  Traveled for interview at company expense.  Was treated very well during the trip.  Questions about staffing, systems, interpersonal relationships, situations, and finance.", "Interview Questions": "Describe a difficult situation you faced that you created a unique solution for."}, {"date": "30 Dec 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Prisma Health", "Interview Descriptions": "Job specific questions, very professional interviewer. The interview was more like two professionals talking rather than an interviewer and interviewee. It lasted about an hour and I was ofdered the position within a day or two.", "Interview Questions": "Why do you want to leave your current position"}, {"date": "18 Mar 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Prisma Health (Greenville, SC) in Dec 2017", "Interview Descriptions": "I was called by the hiring manager. She proceeded with a phone interview and asked me to come in the following week for another interview. I met with 5 people for the interview and then had a 1:1 meeting with the hiring manager.", "Interview Questions": "Why should we select you over the other candidates? "}, {"date": "31 Jan 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Prisma Health (Greenville, SC) in Dec 2017", "Interview Descriptions": "It went pretty smooth. First you have a phone interview. Then you go and have a group interview..then a one on one interview with a peer. Overall a good experience", "Interview Questions": "How would you handle conflict on the floor between workers."}], [{"date": "28 Aug 2019", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Prisma Health (Greenville, SC) in Oct 2017", "Interview Descriptions": "Email from hiring manager to set up a phone interview. Phone interview to get a sense of personality. Then a three person interview at the hospital, where they asked behavioral questions. Typical interview nothing extreme.", "Interview Questions": "Give an example of a time when you had a disagreement at work and how it was resolved.\r\nWhat are your views on teamwork?"}, {"date": "8 Feb 2018", "title": "AP Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Prisma Health (Sumter, SC) in Jun 2015", "Interview Descriptions": "One of the leads suggestion I would be a great fit for the company. Went on lunch interview. I was interviewed by three people asking me questions about a p a r material management", "Interview Questions": "How was your accuracy"}, {"date": "14 Apr 2019", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Prisma Health (Greenville, SC) in Jan 2015", "Interview Descriptions": "Seven years ago applied for coding job was accepted.  Interview was more situational questions instead of questions about experience.  It was like they were doing a personality test instead of an interview.", "Interview Questions": "What experience do you have"}]]