[[{"date": "8 Mar 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Management University", "Interview Descriptions": "Panel of 4 persons who gave an interesting interview session. Panel was candid in sharing the current situation and listed the challenges. Location was very accessible. Was asked to describe current and previous job experiences.", "Interview Questions": "What was once challenge you faced?"}, {"date": "29 Mar 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Singapore Management University (Singapore) in Jan 2023", "Interview Descriptions": "behavioral questions to find out how you are as a person in general behavioral questions to find out how you are as a person how well can you work with the team, how do you fit in the team, how can you better help students", "Interview Questions": "describe your strengths and weaknesses"}, {"date": "15 Nov 2022", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Oct 2022", "Interview Descriptions": "First round with the HR, followed by some tests that lasts for 1.5 hrs. HR is a nice and soft spoken lady. Thereafter, 2nd round interview will only be called upon based on the tests given.", "Interview Questions": "1) Tell me about yourself. 2) Can you do OT?"}, {"date": "15 Jul 2022", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore Management University (Singapore) in Jul 2022", "Interview Descriptions": "Applied for job role (Senior Executive, Communications) at SMU website, was contacted by the SMU Lead 2 days later to schedule face-to-face 1st interview the following week with him and another manager.\r\n\r\nThe interview lasted about 30 mins, subsequently is a written assessment (very easy). The interview experience overall is quite casual and friendly. The hiring manager is a vr easy going person, mixed in abit mandarin and hokkien and chats with me normally, trying to know me more as a individual.\r\n\r\n2nd interview via Teams with Deputy Director & Executive Director. Asked about my experience in current company, what systems did I use at my company.", "Interview Questions": "What do you do during your past time/free time?"}, {"date": "25 Jun 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Singapore Management University (Singapore) in Apr 2022", "Interview Descriptions": "The interview required the completion of a mammoth performance task that mimics a task one might encounter in the actual job. If satisfied, they would proceed with a two-stage interview involved. The first stage would usually involve senior staff in the department, subsequently, in the second stage, there would be more people involved (likely those whom you have to work with). Actual ability to perform is being assessed (especially first interview), followed by skills and culture fit (especially second interview). On reflection, I think the difficulty lies with having to perform a skill without sufficient knowledge of the correct assumptions to make (which you would only know if you ALREADY work there). Chicken and egg issue? Hehe. But then, I see where it comes from as well.", "Interview Questions": "What do you think about SMU students?"}, {"date": "16 Sept 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Singapore Management University (Singapore) in Apr 2022", "Interview Descriptions": "Research Dean hosted the review. Everything is good. We discuss a lot about why I want to apply to PhD program and what I want to achieve. Not too many technical questions.", "Interview Questions": "Why do you want to apply to SMU "}, {"date": "2 May 2023", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Management University (Singapore) in Apr 2022", "Interview Descriptions": "Friendly and simple process, generally comfortable and related to job scope... there will be two rounds of interview. With different director. Just keep calm. As long as you are sincere, u can probably get the job.", "Interview Questions": "tell me why i should hire you for this position?"}, {"date": "13 Mar 2023", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Singapore Management University in Jan 2022", "Interview Descriptions": "It was a very fair interview process and the questions asked wasn’t too interrogating. It was a pleasant experience and the interviewers were attentive. It was overall an average experience which was not too bad", "Interview Questions": "Why do you wish to join our team?"}, {"date": "23 Dec 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore Management University (Singapore) in Jan 2022", "Interview Descriptions": "one round interview after application. afterwards, the manager will update you. interview took one hour. they asked you many basic questions about what you have learnt before. please be familiar with basic micro, macro and econometrics models and show your understandings", "Interview Questions": "what models have your learnt before?"}, {"date": "20 Oct 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University in Oct 2021", "Interview Descriptions": "I applied online. The process took 2 weeks.  I interviewed at Singapore Management University (Singapore). They are 4 interviewers and the interview took around 20 minutes. Waste of time and effort as the job actually different from its original description. They can't offer the work-life balance to the staffs.", "Interview Questions": "1. Mostly asked about the work done in the past.\n2. Asked situational questions to check how you would respond to the situations.\n3. Reason of leaving pervious job.\n4. Why are you a good fit to the job.\n"}], [{"date": "29 Sept 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore Management University (Singapore) in Sept 2021", "Interview Descriptions": "Awesome experience throughout. Applied through SMU website, arranged for an interview the following day. \n\nOn the day itself, interviewed with the Head of department and the Assistant Director. Both were lovely people, were nice to interviewees and made sure you feel comfortable. \n \nAsked about my past experiences and they shared with me some of the challengers new comers might face. \n\nAfter the interview, the head of department told me to amend some information regarding my cv and followed up with me throughout the entire application and hiring process. Absolute professional and thankful for the experience.", "Interview Questions": "Why did you leave your last job?"}, {"date": "9 Feb 2022", "title": "Research Assistant (Intern) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in May 2021", "Interview Descriptions": "Very friendly, mainly discuss about previous projects as well as what are your skills or knowledge in the respective domain. Interviewer is also very patient in explaining the purpose and goal of the project so that you will have a better understanding", "Interview Questions": "Past project and academic experience"}, {"date": "27 Feb 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Singapore Management University", "Interview Descriptions": "Sending in CV and short conversation with the professor, but you have to be a former student in his class or have no interest in taking the class in the future to be hired as a Teaching Assistant.", "Interview Questions": "Why do you want to be a Teaching Assistant"}, {"date": "11 Feb 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Management University in Feb 2021", "Interview Descriptions": "The interview was done via zoom. The interviewer kept it brief. He explained the job scope and why he needed to hire. I shared my working experience. It was over within 30 mins.", "Interview Questions": "Tell me about your current job scope."}, {"date": "31 Aug 2021", "title": "Adjunct Teaching Mentor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Management University (Singapore) in Nov 2020", "Interview Descriptions": "None to speak of - no interview; just admin stuff which is quite underwhelming. Would be good to have some sort of a process to get the best people involved.", "Interview Questions": "Purely administrative - send CV, latest University results etc "}, {"date": "3 Sept 2020", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Singapore Management University", "Interview Descriptions": "Interview was with direct supervisor over a Zoom call, asked about my background, education, research experience, and then HR followed up with the hiring process. Interview was scheduled quickly but HR took longer to reach out with an offer", "Interview Questions": "What are your research interests?"}, {"date": "22 Apr 2022", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore Management University (Singapore) in Jun 2020", "Interview Descriptions": "Interview was smooth with only one round. Interviewers were warm and open to sharing job nature and description, as well as job culture. It was a pleasant experience. The offer was also made very quickly within a matter of 1-2days and hiring process was efficient.", "Interview Questions": "What made me apply for this job ."}, {"date": "7 May 2020", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Management University in Mar 2020", "Interview Descriptions": "A panel of interviewers followed by a test with 3 questions. Usual corporate working style. Only looking for people who are willing to follow protocols. The vibe the hiring manager gave is that there's no way to voice opinions.", "Interview Questions": "They asked about the current company's culture that I was working at."}, {"date": "18 Mar 2020", "title": "Compensation and Benefits Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Mar 2020", "Interview Descriptions": "Received email on a Sunday at 1738 for an interview on Monday at 930. Coordinator and interviewer apologized for the short notice as they were busy. Accepted. Interview was conducted about 2 hours. It also sounded like a sharing and information gathering session. Interviewer was friendly and promised to revert by end of the same week or latest middle of next week for possibility of second interview, etc. However, no response was received for both timeline. Emailed to check on next steps and reinforce interest on the role and the company. Didn't receive any response either for more than one week. In my opinion, although the candidate is not selected, it will be good to respond to the email as part of professionalism.", "Interview Questions": "Do you have any experience in succession planning?"}, {"date": "28 Jul 2020", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Feb 2020", "Interview Descriptions": "I got interviewed for the Master of IT in Business course at the Singapore Management University. It was a skype interview that lasted for roughly 30 minutes.  I was interviewed by the program dean, she was a very pleasant lady. The interview process involved resume related questions basically, coupled with a few generic questions.", "Interview Questions": "Tell me about the analytics project that you did at your internship"}], [{"date": "15 Mar 2021", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Singapore Management University (Singapore) in Feb 2020", "Interview Descriptions": "I was interviewed by the program director for the Master of IT in Business Analytics Track, the interview was based on the past education and work experience. It was an online interview, lasted for about 30 mins.", "Interview Questions": "Asked me about my internship project."}, {"date": "9 Apr 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore Management University (Singapore) in Feb 2020", "Interview Descriptions": "online, interviewed with other applicants. asked about current affairs. tries to see if u are a good speaker and able to incorporate different ideas into your responses. also building on others' thoughts.", "Interview Questions": "a question on current affairs"}, {"date": "29 Jan 2020", "title": "Undergraduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Management University", "Interview Descriptions": "I skipped the interview process but my friends told me some of the questions they asked. The application is online but not everyone needs to come to an interview. SMU asked me to come for the discovery day which I did and really enjoyed myself.", "Interview Questions": "What do you know about accounting"}, {"date": "13 Apr 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Jan 2020", "Interview Descriptions": "Phone screen first to clarify details on resume, and to share about the job role. Followed by 1:1 interview with Hiring manager. Lastly,  a Panel Interview with the division director and another senior management staff.", "Interview Questions": "Why are you interested in this position, and how will you value add to the team?"}, {"date": "25 Sept 2019", "title": "Teaching Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Singapore Management University", "Interview Descriptions": "Panel interview with professors, case studies. Several rounds and talks about publications. Panel interview with professors, case studies. Several rounds and talks about publications. Manageable interviews at the end of the day.", "Interview Questions": "What is the hardest thing you’ve done as a PHD student?"}, {"date": "18 Sept 2019", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Management University", "Interview Descriptions": "introduce yourself, and the projects you have done. Also ask your understanding about the cybersecurity and the challenges you think you would meet. and how will you solve or tackle these challenges.", "Interview Questions": "how do you think the most critical thing in cybersecurity research"}, {"date": "19 Jul 2019", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore Management University (Singapore) in Jul 2019", "Interview Descriptions": "Entire process - from application to job offer took less than a month. Welcomed by the Director and Manager in the interview. \r\nQuestion always straight to the point and do not waste much of time.", "Interview Questions": "Introduce yourself, past work experiences, and what you can value add to the team or university."}, {"date": "10 Aug 2019", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Jun 2019", "Interview Descriptions": "First, they asked me to speak about myself. Then, they quickly moved onto discussing my most recent projects and what was my role if I had done them in a team/group. They then asked me if I had any questions for them. The total interview lasted for nearly 1.5 hours.", "Interview Questions": "Describe some Project X of yours... (They look through your resume for this.)"}, {"date": "2 Apr 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore Management University (Singapore) in Mar 2019", "Interview Descriptions": "I had to go through a group interview, discussing a case study which was provided to us 15 minutes before the interview. We discussed the topic casually, analysing different perspectives and opinions. It was enjoyable.", "Interview Questions": "What are your thoughts about the case study?"}, {"date": "19 Aug 2020", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Singapore Management University (Singapore) in Jan 2019", "Interview Descriptions": "- Emailed the Prof on being keen to be a TA for the module\r\n- Submitted unofficial transcript as per requirement\r\n- Waited about a week before a reply came back\r\n- Prof called and assess the abilities in relation to the course module.", "Interview Questions": "What was the biggest takeaway from the module?\r\nWhy do you want to be a TA for the module?"}], [{"date": "29 Jan 2019", "title": "IT Senior Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Singapore Management University (Singapore) in Jan 2019", "Interview Descriptions": "Hiring manager started off with self introduction followed by your job experience. Interview process is relatively fast and they are very accommodating to your timing of interview. Mine was during lunch hours.", "Interview Questions": "Share about yourself. Strength and weaknesses."}, {"date": "3 Aug 2019", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Singapore Management University (Singapore) in Nov 2018", "Interview Descriptions": "I was referred by a friend who's working closely with the position I was applying for. The managers that interviewed me are very honest and are keen when I was talking about my past experience. They asked about what kind of designer I  see myself as and if there's anything I'm not very good in. Then they continued by explaining to me what's expected of the role and whether I am keen to learn if certain aspects of it I'm not very good in. That made me feel very positive about what I will be facing if I were to join the organization.", "Interview Questions": "What kind of designer do I see myself as?"}, {"date": "16 Apr 2019", "title": "MITB Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Oct 2018", "Interview Descriptions": "One-on-one with the academic director to find out motivations behind taking the masters. Objective is to ensure that you are able to complete the program, especially coming from a non-tech background. There will be group work in the curriculum and you will have to demonstrate ability to work in a team.  Overall not too difficult.", "Interview Questions": "What makes you want to pursue data science?"}, {"date": "2 Nov 2021", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore Management University in Sept 2018", "Interview Descriptions": "First screening with the HR,  followed by the panel interview with the team. Usually there is direct supervisor involved and another 2 members from the team.   Final round of interview  with the director of the department.", "Interview Questions": "Questions related to relevant experience. "}, {"date": "16 Jun 2022", "title": "Technology Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Jun 2018", "Interview Descriptions": "During the time i got interviewed  online by a Panel(3 Director) was present. I was nervous at first but, its actually just a casual conversation, we only talked about my work background and what to expect from the company. Overall was a smooth process until my onboarding.", "Interview Questions": "its actually just a casual conversation, we only talked about my work background."}, {"date": "23 Feb 2019", "title": "Undergraduate Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at Singapore Management University (Singapore) in Apr 2018", "Interview Descriptions": "1. Finish all the English course required by teaching centre \r\n2. Prepare 30 mins of teaching samples \r\n3. Another round of interview for the behavioural and moral standard checking.\r\n4.Obtain the teaching certificate", "Interview Questions": "1.what are the most difficult tasks you have ever handled in your past teaching experiences?\r\n2. what will make you a good teacher? "}, {"date": "9 Apr 2021", "title": "Economics Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore Management University (Singapore) in Apr 2018", "Interview Descriptions": "Short and brief, took less than 10 minutes and it was conducted online. Felt like it was pretty long though. There were 3 interviewers, they got to know you briefly then proceeded to ask a game theory related question.", "Interview Questions": "I actually can't remember but it's a popular game theory question. The one about three doors I believe."}, {"date": "27 Mar 2018", "title": "Manager, Outreach and Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore Management University (Singapore) in Feb 2018", "Interview Descriptions": "I applied online. It took only 2 days to receive the first phone call from an admin manager instead of HR.  2. The admin manager helped to arrange a call with another 2 hiring managers as screening call.  3. After the phone screening, I went down twice for interview - the first was to meet with the hiring managers and the other one was to meet with the Dean. The interivew was rather easy, and they did not access much of my marketing skills.\r\n\r\nHowever, the interview process did not provide me a positive experience as the whole proces was not professionally handled. I would suggest getting a HR involved in the hiring process will be a solution to help with that. Firstly, the hiring managers did not provide any updates until I followed up with the admin manager with emails. Secondly, all the interviews were always arranged very last minute which is okay, and I tried accomodating their schedule. But after the so-called last interview, they did not even get back to me on the feedback as in the result of the interview. Well, if a candidate invested so much time and effort into an interview, an answer or feedback to the candidate is the least they need to provide. It's sad that I didnt see that in the interview process and I felt not being respected as a candidate.", "Interview Questions": "Tell me about yourself and your experience. "}, {"date": "10 Apr 2018", "title": "Research Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Feb 2018", "Interview Descriptions": "I applied job through a job portal and I received the email asking for interview. Attended the interview around 1 hour, and that's all. They were discussing whether they needed to do a test on the technical skill, but they gave the job offer without testing the technical skill.", "Interview Questions": "Mainly asks about skillsets, whether are you used to Linux and open source environment. Also whether you are used to dealing with large datasets."}, {"date": "2 Jan 2018", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Management University", "Interview Descriptions": "Warm and friendly process where interviewers were really interested to learn more about you and what you stand for. Professionally conducted and the process was enjoyable. Took about an hour and a half.", "Interview Questions": "The usual sharing about yourself before going deep into past experiences and achievements."}], [{"date": "10 Nov 2017", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore Management University (Singapore) in Oct 2017", "Interview Descriptions": "A genuine and open interview with reporting head and divisional heads present. The time from the 1st email for interview until job offer took 1 month. I had a total of 2 interviews.", "Interview Questions": "Your biggest challenge so far."}, {"date": "20 Sept 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Management University", "Interview Descriptions": "I applied through a referral from a fellow schoolmate. Interviewer was cordial, but serious when talking about the job scope. There were 2 rounds of interviews, one formal and one informal. Although it was not very structured, but I felt that the interviewer was adequately informed after my meetings.", "Interview Questions": "Are you able to manage high-paced work? How do you manage your time?"}, {"date": "9 Jul 2017", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Singapore Management University", "Interview Descriptions": "they are three interviewer and the interview took around one hour, and they want to know ur pervious experience whether match the position. most of the questions were basic and not hard to answer", "Interview Questions": "intro urself"}, {"date": "20 Dec 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Singapore Management University (Singapore)", "Interview Descriptions": "1. Mostly asked about the work done in the past. \r\n2. Asked situational questions to check how you would respond to the situations\r\n3. They want to see the right fit if the person will fit in the work culture.", "Interview Questions": "1.Tell us about the projects done in the past\r\n2. what were the challenges\r\n3. how did you overcome those challenges"}, {"date": "11 Aug 2016", "title": "Research Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Aug 2016", "Interview Descriptions": "I applied through JobStreet. Received an interview invitation after 4 days. Went for the interview. 2 deputy director interviewed, which made me think they respect the interviewee. They brief me about the job scopes, ask about my background and experience. After that was a programming test, I was too nervous, the test didn't go well and I don't get an offer.", "Interview Questions": "Programming test"}, {"date": "5 Jul 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University", "Interview Descriptions": "It was cordial. I wish I appeared friendlier, to match the interviewers' energies. Perhaps I was nervous on that day. I shared details of relevant experiences. However maybe they weren't enough or not specifically to what they were looking for. The hiring process seems quick.", "Interview Questions": "The research process, interests, other relevant experiences."}, {"date": "8 Jun 2017", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Management University (Singapore) in Apr 2016", "Interview Descriptions": "Sent in my resume, got a call for interview two days later. There were three interviewers. Was asked basic questions, mostly on past experience, leadership and co-curriculum activities, and strength and weaknesses. Quite a lot of emphasis is placed on grades, including those of national exams and CAP/GPA. Overall, it was a semi-casual interview, almost like a chat.", "Interview Questions": "Have you faced a difficult situation before and how did you deal with it?"}, {"date": "6 Oct 2016", "title": "Assitanr MAnager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Singapore Management University (Singapore) in Aug 2015", "Interview Descriptions": "Phone interview with HR followed by department head's one one one interview.. after discussing what i had done and what i would be doing in the new role I was told to write an essay (on the spot) on why i want to join the role.", "Interview Questions": "- past experience in general\r\n- specific subject matter questions on expertise area"}, {"date": "31 Mar 2015", "title": "Events Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Management University (Singapore)", "Interview Descriptions": "Went for interview twice at different alumni schools but was eventually rejected. Heard they hired an SMU graduate followed by an internal staff. They shouldn't shortlist external candidates if their intention is to hire someone of their own. Waste of time and effort.", "Interview Questions": "Why are you a good fit to the job?"}, {"date": "19 May 2015", "title": "Managerer, Global Office Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Management University in Apr 2015", "Interview Descriptions": "I had to exchange a pass at the security guard house, but as my interviewer was out of office, interviewing another candidate, the guard took a while trying to confirm that I was supposed to be there. My interview started late as well, as they were busy interviewing another candidate before me. \r\n\r\nInterview was held in a meeting room, interviewer was uncontactable until they came out of the meeting room with their previous candidate. It is difficult to even double check if I were at the right place. Though, on the bright side, the location isn't difficult to find. \r\n\r\nStandard interview questions such as, why should we hire you? Why do you want to join us etc? Nothing out of the ordinary.", "Interview Questions": "Why do you want this job?"}], [{"date": "28 Dec 2015", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Singapore Management University (Singapore) in Jan 2015", "Interview Descriptions": "The process was conducted in two rounds. First was applying directly to a school. Second was interviewing with two potential supervisors. They asked me some more detail about my CV, e.g. background, education. Some questions were about the complex of algorithms. The rest were a discussion about work in project and some more information about them.", "Interview Questions": "If you are not a coder, in what ways can you create a program ? (Actually the project is about Natural Language Processing to code and debug. I still have a clear idea why he asked me this. To test my problem-solving ability or an introduction to his project ?)"}, {"date": "9 Dec 2014", "title": "Deputy Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Singapore Management University (Bukit Merah Estate, )", "Interview Descriptions": "I did not have to be interviewed, and my supervisor secured this role for me.  I was the only applicant, and my Employment Pass was approved fairly quickly as my supervisor is influential at SMU.", "Interview Questions": "N/A"}, {"date": "16 Jul 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Singapore Management University (Singapore) in Oct 2014", "Interview Descriptions": "It was really Quick and swift. The interview process was straight forward and easy to understand. The interview is also very understanding. Overall it was a good and professional interview. It didn't take too long for them to accept either.", "Interview Questions": "How long I can commit"}, {"date": "14 Mar 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore Management University (Singapore) in Sept 2013", "Interview Descriptions": "A panel of 3 interviewers. 2 are my immediate team mates including my lead and the dept director.\r\nThe session was getting to know each other and to assess my fit and capability.", "Interview Questions": "Tell me about yourself"}, {"date": "12 Apr 2017", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Singapore Management University (Singapore) in Jan 2013", "Interview Descriptions": "Very informative and cut to the chase. The focus was on testing my skills and aptitude which it should be. We had a sample lecture and discuss how lessons would be conducted", "Interview Questions": "Conducting a sample lecture"}, {"date": "12 Sept 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Singapore Management University (Singapore) in Dec 2012", "Interview Descriptions": "It really varies depending on your Professor. Some will ask you to e-mail him/her the reason why you want to become a Teaching Assistant. Some will require you to come down for an interview and ask you many questions. Some will just look at your performance and his/her impression of you when you were a student taking the module. It really depends.", "Interview Questions": "Why do you want to become a TA?"}, {"date": "5 Jun 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Management University (Singapore) in Mar 2010", "Interview Descriptions": "It was fast. There are two rounds of interviews and an offer may be made within 3 weeks or less. However, do not expect designation and salary band to be directly correlated.", "Interview Questions": "They are looking for someone to fill in the gaps. If you know what they really need and you have good character (first impression), most likely you will get the job."}, {"date": "27 Jul 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Singapore Management University (Singapore) in Jan 2008", "Interview Descriptions": "The job opening was made available and I Submit an application. Shortly after, I was called for an interview. During the interview, it was a panel of admin staff and the Head administrative Director. It was good to know that the whole office works as a team. AFter that, I was interviewed a second time. 2 days later, I was offered the job.", "Interview Questions": "How to manage an unexpected situation and resolve it."}]]