[[{"date": "9 May 2023", "title": "Multi Skilled Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health System (Gulfport, MS) in May 2023", "Interview Descriptions": "The process did not take long. Once I completed the application I got a call. I was easy to talk to the interviewer and they explained the job duties very well.", "Interview Questions": "How would you deal with a difficult situation?"}, {"date": "5 Jun 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Memorial Health System", "Interview Descriptions": "I interviewed with Robert initially. He was very easy to talk to. He explained the job and the expectations very well. My second interview was with Michelle she to was very easy to interview with.", "Interview Questions": "What is my best quality?"}, {"date": "26 Feb 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Memorial Health System", "Interview Descriptions": "Setting up the interview was not difficult. The process was quick, and I was made to feel very comfortable. I actually enjoyed the interview because the interviewer was warm, inviting, and respectful.", "Interview Questions": "What made you want to be a social worker?"}, {"date": "28 May 2021", "title": "RN Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Memorial Health System (Gulfport, MS) in Feb 2021", "Interview Descriptions": "Short no consideration of skills: Previous work history not reviewed. Just wanted to know if I could start tomorrow. Do not recommend taking a job with not knowing salary. They wanting me to accept and would discuss salaries later", "Interview Questions": "Start date and no other "}, {"date": "8 Apr 2022", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Memorial Health System (Gulfport, MS) in Aug 2019", "Interview Descriptions": "The interview was very laid back. I talked about my experience related to the job. The interviewers discussed some of the responsibilities of the job. There was no set questionnaire involved.", "Interview Questions": "Give an example of when you went above and beyond for an employer."}, {"date": "4 Jan 2019", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Memorial Health System (Gulfport, MS) in Dec 2018", "Interview Descriptions": "Unorganized and unprofessional over all mood of the department seems depressed and very tense.  Current Manager seems very new to management and seems to be very demanding of staff.  She asked me over and over about how much time off I was going to need due to my family.    Demand weekend and holidays, no flexibility.", "Interview Questions": "How much time off do I except to take a year "}, {"date": "17 Nov 2017", "title": "Accounts Payable Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Memorial Health System (Biloxi, MS) in Nov 2017", "Interview Descriptions": "I applied online and submitted my resume. I received a call about a week later asking me to come in for an interview.  The interview went extremely well, we talked for about 45 minutes, but there was nothing hard about it. She was very friendly and informative about the job and the benefits that were included in the job. After the interview, she walked me around the office and introduced me to the other A/P clerks that I would be working with should I be offered the position.", "Interview Questions": "On question they asked, that most people ask, is what do you think makes a team function better? or something to that effect. She didn't really ask a whole lot of accounts payable questions like I expected her to."}, {"date": "4 Jan 2015", "title": "Contract Coder Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Memorial Health System (Gulfport, MS)", "Interview Descriptions": "I walked in, they looked at my resume and said, \"wow this is great! Can you start tomorrow?\" I was shocked by this and wondered why they were so desperate for my skills. In the end, they did not even use my skills and seemed \"put off\" by all of my education and experience.", "Interview Questions": "The manager stated, \"The new system is a nightmare and a complete mess\" during my interview."}, {"date": "27 Oct 2017", "title": "Business Office Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Memorial Health System (Gulfport, MS) in Oct 2014", "Interview Descriptions": "I was hired by the physician. He sent the request to HR, and I began the process. I met with an HR rep to review my work history and was then sent to get shots, do drug test and background check. Then took my id picture and waited for the call to start.", "Interview Questions": "Years experience "}, {"date": "24 Mar 2014", "title": "Professional Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Memorial Health System", "Interview Descriptions": "Application is online then interviews with recruiters, department managers and/ or directors. Important to provide good references and present self in a confident and friendly way.  Work ethic and willingness to be part of larger team crucial.", "Interview Questions": "How do you take care of yourself?"}], [{"date": "11 Sept 2015", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Memorial Health System (Gulfport, MS) in Dec 2011", "Interview Descriptions": "Refereed by a family member, interview was rather informal, and I was given the results in a matter of days. Met with the admin for the department, the same individual I would be working under. The Human Resources department was simply a logistical hub for the resume's and employee intake. The hiring decisions are made by the individual departments.", "Interview Questions": "Nothing as cliche as &#034;Where do you see yourself in five years.&#034; A tour of the ward, meet a few current employees, and a few questions specific to your work background."}]]