[[{"date": "9 Sept 2021", "title": "Field Missionary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at International Mission Board", "Interview Descriptions": "Fairly comprehensive application process. In depth interview addressed topics in statements of belief and biography. Good exchange of information. I believe they have improved the job matching process - which is a good thing!", "Interview Questions": "Describe your calling to missions."}, {"date": "20 Apr 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Mission Board (Richmond, VA) in Aug 2019", "Interview Descriptions": "Short, to the point. Asked questions mostly about religious beliefs to see if we were “aligned” spiritually. Unfortunately I’m not a Baptist, so we disagreed on quite a few topics.", "Interview Questions": "Are you an active member of a Southern Baptist Church?"}, {"date": "24 Mar 2017", "title": "Online Editor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Mission Board (Richmond, VA) in Jan 2017", "Interview Descriptions": "Took a few weeks after applying but I was invited for an initial Skype interview with a recruiter who seemed to know very little about the actual job responsibilities. Interview was scripted and the recruiter could not answer any technical questions.\r\n\r\nI had a follow up Skype interview with the hiring manager a couple of weeks later. The interview was relaxed and seemed to go well. Considering my background and experience, along with multiple positions to fill, I expected to receive a job offer. The hiring manager implied they were expecting to hire soon.\r\n\r\nI followed up with the hiring manager after a couple of weeks and was told interviews were on-going. Another week passed and I followed up with the recruiter who never responded to my email. After about a month, I received the generic rejection email from the application system.", "Interview Questions": "N/A"}, {"date": "12 Nov 2020", "title": "Missionary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Mission Board (Kansas City, MO) in Jan 2016", "Interview Descriptions": "Interview process is detailed and does take some time but was handled very well by the mission board.  The overall environment is friendly during the initial interview process.  They also were accommodating to my schedule.", "Interview Questions": "Q:  What is your church ministry background/experience?"}, {"date": "7 Jan 2014", "title": "Apprentice Missionary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 10 months. I interviewed at International Mission Board", "Interview Descriptions": "Hiring process is long and laborious but as expected for the investment their are making. The written theological views paper will be referred too in each interview, especially if there are differing opinions. Very formal attire is expected and you will do well to dress as formal as possible in all situations", "Interview Questions": "Explaining any theological differences in-depth. They are looking for key phrases, if yours don't match up be prepared to explain"}, {"date": "12 Jan 2016", "title": "Missionary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at International Mission Board (Arlington, VA) in Feb 2012", "Interview Descriptions": "extensive with written biography, interviews, Psychiatric exam, background checks, more interviews.  There were phone calls, essays written, group discussions, one-on-one interviews, meeting with medical team and psychiatrist.  There were two major site visits to the home office.  One for general qualification meetings and the second for job assignment and pre-orientation meetings with area teams and trustees.  The meetings are long and stressful as you are under constant observation and questions arise at any moment.", "Interview Questions": "Tell us your faith journey."}, {"date": "20 Jul 2015", "title": "Journeyman Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at International Mission Board (Richmond, VA) in Jan 2011", "Interview Descriptions": "Atleast 4-5 interviews with very little focused on your actual technical abilities. Most questions were based on deep and personal questions. Overall a difficult experience since I was applying for a support role outside of the actual volunteer work. Did very little screening on actual technical abilities. \r\nOverall something I wasn't familiar with, but a solid experience.", "Interview Questions": "What is your belief on the Baptist Faith and Message?"}, {"date": "13 Mar 2014", "title": "Missionary/Church Planter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at International Mission Board (Richmond, VA) in Jan 2010", "Interview Descriptions": "Very intense - they leave nothing out - - this is very thorough!  We went through phone interviews, personal interviews with staff from Richmond flying down to meet us, interviews with potential supervisors from overseas, many personality tests and the like.  I think they know what size underwear we have on - lol!", "Interview Questions": "What are your beliefs on the Spiritual Gifts.  "}], [], [], [], [], [], [], [], []]