[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company to deal with", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 May 2022", "job_title": "Project Manager in Edinburgh, Scotland", "duration": "N/A", "pros": "Fantastic culture that supports its staff with a strong corporate social responsibility", "cons": "Conservative business strategy with limited career growth opportunity"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Worst management in the history of all management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Jan 2023", "job_title": "Customer Experience Agent in Edinburgh, Scotland", "duration": "N/A", "pros": "Great benefits and bonuses, private health care, life assurance policy", "cons": "I would describe working here as being trapped in ‘golden handcuffs’. The benefits are outstanding however the management in the Customer Experience department are cliquey, have no communication skills and enforce toxic positivity. They will remove tasks to look like they are being nice only to bring them back under another name. For example, the department removed ‘retentions’ however they introduced ‘continue to play’ which was retaining the player and involved the same markdowns. Customer Experience department refuse to put some changes in to writing i.e. the change of working from home to hybrid as they do not want a written record of this. No explanation was ever given regarding the refusal of written communication, instead management removed the anonymity function of internal online feedback and turned a simple question against the agent (toxic positivity). Multiple complaints raised by multiple agents regarding managers go unheard and HR refuse to listen. Instead, managers will be given a spreadsheet to work on rather then their job however employees are let go if they don’t build rapport in calls. Changes to job roles /tasks with only a days notice. You will almost certainly work more weekends than advertised in the job role without explanation. Communication between departments is extremely poor and nothing is briefed until the day of. No scope for four day work week and the concept is never taken seriously."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "You will never work anywhere like this!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Feb 2023", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "Over everything else the mission is the biggest pro. Waking up to work knowing you're directly contributing to £1 billion pounds of money raised for charity and good causes is uncomparable. The people are lovely, the office is beautiful and the work is varied.", "cons": "It's just a quirky kind of business and that will work for some people and less so for others. Depending where you are in your career, progression can be limited. But if you do your research in interview you can make a call on whether these apply to you."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Ppl", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Feb 2023", "job_title": "Customer Experience in Edinburgh, Scotland", "duration": "N/A", "pros": "Good benefits, pay and hours", "cons": "Weekend work required, got more corporate when ceo changed"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Couldn't care less about their employees!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jun 2022", "job_title": "Customer Experience in Edinburgh, Scotland", "duration": "N/A", "pros": "Salary is good for what the job entails.\r\nLunches are provided free.", "cons": "Employees are forced to come into the office despite 1 in 20 people in Scotland having covid at the moment. Apparently it's more important to People's Postcode Lottery that the office appears full when board members are visiting than the health safety of it's employees. When I told my manager I didn't feel safe having to be in a full office for 3 days in a row (having had covid twice before) I was told that's \"not a good enough excuse\"!\r\nNo consideration has been given to transport costs that employees have to pay when forced to come into the office. (These costs are much higher not than before the pandemic).\r\nEveryday we are required to cold call former players to convince them to re-sign, this is despite the terrible economic situation and the fact that most of the players cancelled in the first place because they couldn't afford to play. Shame!\r\nOffice is very uncomfortable to work in as due to the air conditioning the interior environment is always very hot and stuffy.\r\nHaving a day off during the week never feels like a day off because I always have to work a late shift the day before and do an early shift the day after.\r\nNew system designed to allow us to listen to/analyse our own calls is nothing more than micro-management at it's worst."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "PPL", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jul 2022", "job_title": "Customer Service Representative in Edinburgh, Scotland", "duration": "N/A", "pros": "Great benefits and good salary.", "cons": "Having to go into the office when we have work perfectly fine from home for 2 years during the lock down."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2022", "job_title": "Administrative in Edinburgh, Scotland", "duration": "N/A", "pros": "good pay for role\r\ngood colleagues", "cons": "no cons to say about the job"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "7 Oct 2021", "job_title": "Customer Experience Team in Edinburgh, Scotland", "duration": "N/A", "pros": "Beautiful city centre offices, great career opportunites, excellent salary", "cons": "I cannot think of any"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Seen as an individual person", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Mar 2021", "job_title": "Manager in Edinburgh, Scotland", "duration": "N/A", "pros": "This company really embraces people - your ideas, and your ways of thinking are appreciated and your work are met with enthusiasm and faith. Its such a friendly place to work and it does have a family feel to it.\r\nIve worked here for over 5 years and I'm still learning new things, and am still impressed by what the company does for its employees. This last year has been hard for everyone, but the focus and care given to us has been outstanding.", "cons": "Every job has frustrations, but a good team environment helps to balance these out and the opportunity to talk to some one is always available, either you own manager, the MD, HR or the friends you have."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "It's a really nice place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Feb 2021", "job_title": "Lead Developer in Edinburgh, Scotland", "duration": "N/A", "pros": "The company takes it's social responsibility very, very seriously. We exist to raise a whole lot of money for charitable causes.\r\n\r\nThere are lots and lots of opportunities to develop professionally, with a really strong internal training arm. It's one of the things the company aims for, particularly for software/IT professionals.", "cons": "You are unlikely to reach the highest pay-check you've ever had."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Customer Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 May 2018", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "I find it unique, forward thinking, and courageous environment to work in, with a mission to be proud to work towards, not many companies have Fun as a core value! The purpose of why they exist and how it  all started really gives you a strong sense of purpose to the role you do. There is a lot of opportunities for various career paths as they invest in training really well.  There has been many opportunities advertised for new roles within the business which is great if you are ambitious.  They have flexible working, private health care, gym memberships and Friday massages, and an incredible building to work in. It has a unique culture.", "cons": "When comparing to other contact centres I’ve worked in, I really can’t think of negative points to raise. Especially after the recent changes they have made."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "What a brillant place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Sept 2017", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "There are a lot of pros to working at PPL.\r\n\r\nThey have an extensive range of benefits, some of which are, an outstanding pension, great private medical insurance provider, free massages and rolls on a Friday, brilliant \"Team Days\" and Christmas celebrations, the usual cycle to work and childcare vouchers. \r\n\r\nWork life balance is brilliant, they have flexi-time in place which allows for flexibility if you have any appointments. Senior management are all very approachable and the majority of them work in the open plan office. They really live by the values and don't try to do things \"on the cheap\" they will work until they find the best solution for everyone. \r\n\r\nI really loved my time working here and really did make some friends for life.", "cons": "I can't think of any cons off the top of my head."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Poor Mangment", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Jan 2018", "job_title": "Customer Experience Advisor in Edinburgh, Scotland", "duration": "N/A", "pros": "Great pay and Benfits. Excellent training \nChances to move around the business. Good bonus if you can get it. \nGeneral staff are very nice and great facilities", "cons": "Poor Structure\nsome of the Mangers have a hierarchy \nMangers deciding if they like you or not, which directly affects how they treat you. \nAbsolutely shocking bonus structure\nCold calling, As they called it “warm calling” basically calling people who didn’t want to speak to us.\n85% if the job is outbound calling. \nManagement do not follow correct probation procedures.\nFantastic company but if you work in customer experience (call centre)  it’s totally different.\nFirst week on the phones and long term team members expressed there disappointment with the job. \nAt the end of the day it’s a lottery for a good cause but they are missing the poor treatment of staff from management right under there nose."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A rare culture with strong vision and values-. A happy place", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jul 2019", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "There are good people at the heart of this organisation\r\nThey always put players and supported charities first. I've never worked somewhere that values their customers so highly. They are spoken about with respect and always striving to do the best by them and value them\r\nGood culture. A family feel. Staff are treated  well. \r\nLots of fun involved. Aligns with their marketing", "cons": "Hard to think of any. The working day is a longer than standard 9-5, but they offer flexibile working.\r\nYou're always at risk of one or two members of staff who aren't great over time, but all in all a strong, positive workforce"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A Good 12 months", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jul 2017", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "I've been at PPL a year, its been a enjoyable experience in a good environment.\r\n\r\nPeople from other departments are friendly and helpful and there are regular informal social gatherings which helps with getting to know people rather than their role.\r\n\r\nI'm part of a friendly team, have a great manager and work in a department where people are good at their job.  It's refreshing to be part of an expanding business where I'm giving the freedom to own my role.  Although, a very busy time at PPL, I look forward to going in to work everyday.\r\n\r\nI also like the free fruit and coffee.", "cons": "Expansion makes it hard to keep up with all of the new faces."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fun and fast paced", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 May 2018", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "Lovely people with lots of fun opportunities\r\nGreat autonomy to make a difference\r\nGreat opportunity to meet and get involved with charities\r\nLovely speaking to winners", "cons": "Changes are happening but still a bit to do to become a flexible work place that works for people with young children.\r\n\r\nA 5.30pm finish can be tricky for anyone picking up kids as most childcare finishes at 6pm and this can make evenings pretty frantic, most other employers are 5pm."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Aug 2019", "job_title": "Finance in Edinburgh, Scotland", "duration": "N/A", "pros": "PPL go out of their way to look after their staff and make it a fun and interesting workplace.\r\nIt's a great feeling to work somewhere that does so much good, and to work with colleagues that are excited and engaged in trying to do even more.", "cons": "There have been some really good changes to make hours and working practices more flexible but I think there is an opportunity to do more, and become a leader in this area, as PPL are in so many other areas."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best culture and good work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Sept 2020", "job_title": "Software Developer in Edinburgh, Scotland", "duration": "N/A", "pros": "Work was interesting with dedicated innovation and learning time to improve your skill set. \r\nWell compensated, good bonus scheme and 20 paid sick days a year\r\nGood holiday entitlement (35 days)\r\nCulture", "cons": "The sick policy can be a bit silly at times but for the most part its fine\r\nThere isn't much room for advancement in the Data Services department, at least not for developers with only 1 or 2 senior positions coming up a year and 40 developers in the department"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Soul destroying", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Apr 2018", "job_title": "Customer Experience Agent in Edinburgh, Scotland", "duration": "N/A", "pros": "Fruit baskets, free gym membership, volunteer opportunities, the pay is good for a call centre but not enough for how much stress we are under", "cons": "The mission of PPL is to help good causes. This would suggest that this is at the heart of the company and that they would do their upmost to treat staff fairly and like humans. Sadly this is not the case for most of those in Customer Experience. We sit with our headsets on and take cancellations, sales, complaints and admin requests. We try to give every single one of these calls 100 percent and are rewarded by having the dialler running in between these calls all day long. We are expected to beg past players to return and hound people who entered their email address on to the website. If we are told by someone on the phone that they are not interested we are expected to ‘objection handle’ until they join or hang up on us in anger. When they hang up on us we are expected to phone them back as this could have been an ‘accident’. A lot of staff have been signed off with stress and this is due to the fact that we are not robots. As a human myself i understand why they would need to be signed of with stress. I feel upset and ignored. By plonking us down on our seats and forcing us to anger strangers and take rejection constantly you batter our mental health. We are given no time to recover. \n\nI understand how important customer service is, the way the department is run currently is not focused on customer service. It is focused on sales and retention through any means possible. If you really want to retain players, allow us hardworking, exhausted and sad employees to focus on customer service. At the end of a long day of ‘warm’ calling, I can guarantee the people who have chosen to call are not receiving 100 percent service. \n\nIt is impossible to explain this to any management as we are told this is ‘our job’ and we have to get on with it. This is a terrible way to deal with staff feedback and makes no sense as there are other Customer Experience Agents with completely different job roles. A lucky selection of employees were selected from a hat to receive extra training and more responsibilities. They do not need to hit targets with retention calls and do not need to dial outbound anymore. Those of us still on the phone are rarely offered the opportunity to do emails, if we are offered we are told it is a treat. I speak to people who were selected from the hat and they are actually happy going to work and do not constantly feel down and depressed. They have said they will never return to just working on the phone again. \n\nMany of us on the phone exceed in hitting our targets, in-spite of how much we dislike our jobs we do our best. As soon as we have hit our target the month ends and we are back to square one. Nothing is rewarded and we try to climb back up to these demanding targets again for the next month. \n\nWe have recently been informed that there will no longer be the option to cancel subscriptions on the website and that this will all be done over the phone. Having listened to a huge number of complaints from players about how hard we make it to cancel and having read recent trust pilot reviews from customers who are deeply unhappy at needing to phone to do this, I know this will be extremely difficult for those of us who need to take these calls. \n\nI speak to past employees who have spoken to HR about how hard it is in Customer Experience but nothing ever changes. Looking at the comments here it would seem that this is because you do no want to hear negativity from staff."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Fun at the start", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Oct 2017", "job_title": "Customer Experience Agents in Edinburgh, Scotland", "duration": "N/A", "pros": "The bonus is brilliant, and if you’re in the call centre there are some nice people. Other than that I can’t really think of any.", "cons": "Place is so cliquey, unless you want to brown nose your way to the top then you won’t get anywhere. Most people there are very back stabbing. You spend most of your time badgering the elderly or people who don’t want to play. Although advertised as an “inbound call centre” it is non stop outbound calls to previous or potential players 7 out of the 8 hours of your day. Communication is shocking, constantly getting in trouble due to something you’ve not been made aware of. The amount of call centre agents that have been signed off due to stress is horrendous and the companies way of dealing with that is to make you feel even worse for being off with disciplinarys being chucked about willy nilly, instead of addressing the actual reason for them having been signed off. I have been called in for a meeting with only a manager before they have told me one thing off the record and then having an “official” meeting on the record where I was told the exact opposite and the manager from the previous meeting denied what they had said to me. There have been a few instances of this where managers say one thing to you whilst making sure no one is listening and then denying they said that in the first place. There is also a lot of work place bullying, one member of senior staff in particular has their favourites but will do anything to destroy the career of others purely because they don’t like the look of them. I received many warnings from this manager for my attitude and behaviour however no other member of management or staff had ever picked up on this? All breaks are timed and heavily monitored, one member of staff was fired due to taking too many toilet breaks. This place is like modern day slavery and I would avoid at all costs."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Very Poor company to work for", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Jul 2017", "job_title": "Customer Service Advisor in Edinburgh, Scotland", "duration": "N/A", "pros": "Postcode lottery the only good that come out of it is the ammount of money going to the Charity's they do allot in that aspect . Pay is ok", "cons": "Poor comunication between management get told one thing at a morning brief at 10Am by 12pm its changed. \r\n\r\nEven for important things like changes in call centre regarding your call qulity was just made up as they went and where always moving the goal posts to acheive you're bonus .\r\n\r\nJust in general for a company working in comunications ie call centre they could not actually comunicate between departments making sure that all info is briefed adequetly and not just send out in a email when this has'nt been done correctly it impacts the call centre agents majorly ."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Job of my career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Aug 2017", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": ">Good Pay\r\n>Brilliant Benefits\r\n>Friendliness and Professionalism \r\n>Management Team easily approachable\r\n>Regular feedback from managers\r\n>Training options for career development\r\n>Internal moves - Job opportunities\r\n>Fun Team Days\r\n>Gym Memberships and various other benefits \r\n>Knowledge transfers\r\n>Charity work\r\n>Health Insurance\r\nThere so much more....", "cons": "thought on this for about 5 mins but can't find any"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Dysfunctional Marketing Insight Team management makes it an unreliable job", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jul 2017", "job_title": "Team Member in Edinburgh, Scotland", "duration": "N/A", "pros": "General company benefits are quite good.", "cons": "I'm aware of at least four analysts who have been pushed out in at best questionable circumstances by the Insight Team manager to cover for their managerial incompetence.\r\n\r\nThe company you'd be working for don't actually give any more money to charity per new customer due to limits on fundraising. The company also participate in questionable tactics to maintain and gain customers."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Corrupt clueless management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Oct 2017", "job_title": "Middle Management in Edinburgh, Scotland", "duration": "N/A", "pros": "Easy to get a job, good bonuses, decent perks.", "cons": "Senior managers other than the head of centre promoted beyond their ability. Organisation run in a knee jerk reactive way. During my time there almost a whole department was sacked, two people sacked for taking a photo of themselves. One guy sacked for liking a Facebook post. I was a middle manager there and was also sacked in an arbitrary way, I now wish I’d taken legal advice. Avoid."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Customer journey agent", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Apr 2017", "job_title": "Customer Experience Agents in Edinburgh, Scotland", "duration": "N/A", "pros": "Hardly any... but I have to write a minimum of 20 words! Horrible people work for this company. They are unethical and nasty", "cons": "The management are inept, useless and childish. Easily the worst job I have ever had! Pressure from management to sell lottery tickets to elderly and unemployed people. Constant outbound calling, harassing previous players and persuading players to stay when they can't afford to."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2019", "job_title": "Customer Experience Agent in Edinburgh, Scotland", "duration": "N/A", "pros": "Good salary and bonus scheme\nGreat benefits\nWeekends off\nGreat training and further development", "cons": "Can be exhausting during cut-off week but all jobs are"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "good money at a cost", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2017", "job_title": "Customer Service Representative in Edinburgh, Scotland", "duration": "N/A", "pros": "great money for an entry level job in a call centre", "cons": "continuous cold calling everyday"}]]