[[{"date": "16 Nov 2021", "title": "Care Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Callen-Lorde Community Health Center (New York, NY) in Oct 2021", "Interview Descriptions": "First interview was a phone screening. Went rather smoothly and we made great conversation. Second interview was over Teams Video chat. The second one was a bit more difficult, and had two people on it. 1 was the HR rep from the initial phone screening, and another was the Care Coordinator you would be reporting to in the role.", "Interview Questions": "What would make you unhappy in this role?\nName a maginalized population and explain what restricts their access to healthcare."}, {"date": "17 Jan 2021", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Callen-Lorde Community Health Center (New York, NY)", "Interview Descriptions": "This was a standard three part interview process; one phone screen, an in-person interview with the director of the department, and an in-person interview with the employees that I would supervise. I am a former employee so there might have been steps that I was able to skip.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "28 Feb 2020", "title": "Patient Navigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Callen-Lorde Community Health Center (New York, NY) in Feb 2020", "Interview Descriptions": "I attended two separate interviews for the Health Homes Patient Navigator role. The interview was intense and scenario-based and they really want to know the specifics. I got a rejection call because they said they selected another candidate.  HR Associate was an excellent communicator and gave feedback and then suggested a different role and then set up an interview for a different position. HR called me within 1-day to tell me they were going to go with a different candidate again and will keep my resume on file if future opportunities become available. I thanked her for her time and look forward to keeping in touch.", "Interview Questions": "They asked me to tell them about a time when I had conflict and how I deal with it?"}, {"date": "27 Oct 2017", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Callen-Lorde Community Health Center", "Interview Descriptions": "A mini phone interview was first and then they email me to schedule the face to face group interview. Really nice and relax group interview.  Simple questions. Nothing to be worry about it!", "Interview Questions": "difficult situation with a co-worker?"}, {"date": "26 Sept 2017", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Callen-Lorde Community Health Center", "Interview Descriptions": "The interview process was positive - I met with several people at each interview (there were 2) plus a phone screening with an HR representative. The interviews were not easy but they also were not extremely challenging. There were a mix of front line staff and managers in the interview, so I got to meet most of the team.", "Interview Questions": "A lot of scenario questions about how I would handle various situations with staff and with clients."}, {"date": "25 Sept 2017", "title": "Lpn Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Callen-Lorde Community Health Center (New York, NY) in Mar 2016", "Interview Descriptions": "applied online. received an email a day or two later to set up phone interview with HR.  started with phone interview which was then followed by group interview at the center and then another interview after.  interview was pretty easy, just asking a bunch of questions related to your experience, their mission and your personality.", "Interview Questions": "why chose us"}, {"date": "24 Oct 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Callen-Lorde Community Health Center", "Interview Descriptions": "interview with the cfo, very easy going interview. not many technical questions for this type of position. walk through your current experience, how did you hear about us, what do you know that we do here,  what career goals are you looking to pursue. the interview is very simple because of the type of work one would expect to do in this role. the tasks are not difficult and can be performed by an individual who knows little to no accounting.", "Interview Questions": "N/A"}, {"date": "18 Mar 2015", "title": "HIV Patient Navigator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Callen-Lorde Community Health Center (New York, NY)", "Interview Descriptions": "The interview was pretty standard, nothing impressive or exciting. Previous job experience, interests, how you would handle the position. Sometimes the HR rep plays bad-cop. They did ask me about my goals, how I would handle the next level position (which made me think \"yay, a future here!), but never again in my position there did they ask me about my goals or help me reach them. Don't over prepare, they aren't stellar interviewers. They just want to hear you're committed to the mission and that you'll take a low salary because you're noble of heart.", "Interview Questions": "How would you coordinate the department if you were a care coordinator?"}, {"date": "11 Jun 2013", "title": "Facilitated Enroller Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Callen-Lorde Community Health Center (New York, NY) in Feb 2011", "Interview Descriptions": "I was called and interviewed over the phone by HR. It was quick, she went over what the requirements of the position was and the salary, once i understood the non negotiable salary i was scheduled for the interview. The actual interview was a group interview, three members of the organization interviewing four applicants.", "Interview Questions": "What ties do you have to the organization?"}, {"date": "8 Jan 2014", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Callen-Lorde Community Health Center (New York, NY) in Sept 2010", "Interview Descriptions": "Applied online with a resume and cover letter, was contacted over the phone by a member of HR about two weeks later, and was asked to come in for a group interview on site.  For people uncomfortable in a situation like that, this would probably be the most difficult part of the process. Ultimately, though, the interview felt very simple and friendly.", "Interview Questions": "There weren't many that I recall. Standard fare such as asking how one might deal with a difficult patient."}], [{"date": "25 May 2013", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Callen-Lorde Community Health Center (New York, NY) in May 2010", "Interview Descriptions": "My resume was submitted at a job fair, in which, I was called within 2 days for an interview.  I had 2 interviews.  One with my director and one with the CFO.  Position was offered within 24 hours.", "Interview Questions": "Am I part of the community?"}]]