[[{"date": "10 Apr 2019", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Interactive College of Technology (ICT) (Atlanta, GA)", "Interview Descriptions": "Easy questions and very nice welcoming people in general. I was offered the job the following week for an evening class but later I was switch to a morning class.", "Interview Questions": "N/A"}, {"date": "9 Oct 2018", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Interactive College of Technology (ICT) (Chamblee, GA) in Oct 2018", "Interview Descriptions": "It was great! The manager was very knowledgeable about ESL programs and very amicable.  There was an introduction, completion of paperwork and a tour. Lots of question about curriculum, teaching style, knowledge of TESOL, adult learning theories and presentations.", "Interview Questions": "Tell me about yourself."}, {"date": "16 Dec 2019", "title": "ESL Teacher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Interactive College of Technology (ICT) (Atlanta, GA) in Jan 2017", "Interview Descriptions": "The interview involved teaching a mock class followed by some pretty extensive information about the school. Also: it's worth noting that the application has to be filled out by hand and again online, followed by a quick personality/work skills test.", "Interview Questions": "How would you introduce the present perfect to ESL learners?"}, {"date": "1 Nov 2016", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Interactive College of Technology (ICT) (Chamblee, GA)", "Interview Descriptions": "Their was a panel (managers) they had a chance to ask questions about history and typical interview questions. They gave me 15 minutes to prepare a lesson about grammar, I gave the lesson they looked at each other and I was hired on the spot.", "Interview Questions": "The process varied, I asked a employer who had no experience teaching ESL what her interview was like and she said they ask interview questions. She did not have to do a lesson."}, {"date": "13 Aug 2015", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Interactive College of Technology (ICT) (Atlanta, GA) in May 2015", "Interview Descriptions": "I contacted the campus to see if they were hiring. I was called back by the DoE and we set up an interview. I was hired immediately upon the interview. The interview was somewhat perfunctory and quite conversational, as I had the needed qualifications and a space needed to be filled. My availability seemed to be the most important point. My experience and qualifications were not closely questioned, except to discuss them in a general sense.", "Interview Questions": "When are you available? Do you mind working split shifts?"}, {"date": "6 Nov 2015", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Interactive College of Technology (ICT) (Chamblee, GA) in May 2014", "Interview Descriptions": "They're desperate for instructors, so almost anyone has a chance of getting hired as long as you have a bachelor degree in any field. They ask you to do a mock lesson so they can judge what levels and courses you are qualified to teach. They give you very little time to prepare, and how they judge you is very subjective. I've seen many instructors teaching grammar, for example, and they have no idea what they're even talking about.", "Interview Questions": "Why should we hire you?"}, {"date": "13 Jun 2015", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Interactive College of Technology (ICT) (Houston, TX) in May 2014", "Interview Descriptions": "I was asked how I would explain the difference between present perfect and simple past verb tenses. This was a realistic question since it's something ESL teachers need to know. The director was patient though I was late (couldn't find the building; it's set back from road). The interviewer was relaxed, so the interview wasn't stressful.", "Interview Questions": "How would you explain the difference between present perfect and simple past verb tenses."}, {"date": "13 Apr 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Interactive College of Technology (ICT) in May 2014", "Interview Descriptions": "Very informal, seemed as though they were in dire need.  Compensation was discussed and the need for an unofficial transcript as well as a bit of history about the school and the kinds of students that are there as well as the kinds that would likely make up my class.", "Interview Questions": "Can you tell me about (previous job)?"}, {"date": "15 Apr 2016", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Interactive College of Technology (ICT) (Gainesville, GA) in Mar 2014", "Interview Descriptions": "Applied online and was called for a phone screen. Appeared on site for an in-person interview which was successfully completed. The next step was observing a class of an experienced faculty member. The interviewer got back to me a few days later to offer me the job. The whole process took less than 2 weeks.", "Interview Questions": "Normal IV questions. The interviewer wanted to know if I had the basic skills required to handle an ESL class. Other questions were geared towards testing what my future goals and expectations from the company were."}], [{"date": "6 Feb 2014", "title": "Senior Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Interactive College of Technology (ICT) (Chamblee, GA)", "Interview Descriptions": "I got called in for an interview. My contact went home and no one bothered to tell me. When I got to the school, I had to fill out a photocopy of a photocopy of a photocopy of a job application and while still working on it, I was it was time for the interview, leave the application at the front desk.\r\n\r\nI was next greeted by a ESL \"Manager\" who brought me upstairs to a cold (about 65℉) classroom, handed me a pae from a teacher's manual and old me to teach a lesson.  So, after a few minutes, I taught the lesson to her and another \"Manager\" who couldn't have made it more obvious that this was a formality to cover their behinds while they bid their time and could hire a friend. The one played on his cell phone and they both asked sarcastic questions, pretending to be students. They were NOT serious at all about finding an instructor.\r\n\r\nI was grilled about their \"everyone needs to pass at all costs\" (lack of) philosophy of education and not shown their facilities or told specifics about their program.", "Interview Questions": "Do you know ANYTHING about our program?"}, {"date": "9 Sept 2015", "title": "Eac Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Interactive College of Technology (ICT) (Newport, KY) in Jan 2014", "Interview Descriptions": "It was appropriately challenging while providing a insight into the inner workings of the company. i went through a number of interviews with multiple staff members. It made me really feel like they cared about the quality of employee they were about to hire.", "Interview Questions": "Who is your favorite author?"}, {"date": "16 Apr 2015", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Interactive College of Technology (ICT) (Chamblee, GA) in Aug 2013", "Interview Descriptions": "The correct building is a little difficult to find since they have two buildings and neither is labeled as the \"main\" building. Once someone comes to show you into a classroom, they give you a grammar book and tell you that you have about 5 minutes to prepare and then  explain a grammar point to the interviewers. From what I've heard, it's always past simple vs present perfect.", "Interview Questions": "Are you comfortable with being responsible for student retention?"}, {"date": "19 Mar 2013", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Interactive College of Technology (ICT)", "Interview Descriptions": "A friend told me she had been to classes there as an ESL student, so I looked it up online. I contacted the ESL Department Chair, and requested an interview. I was subsequently invited for one. The interview always involves a demo lesson, and some boilerplate questions. I was hired and offered the position subsequently. There's not a lot of negotiation at this company. You either take the terms you're offered or they'll hire the next person on the list.", "Interview Questions": "The presentation was the most nerve-wracking for me. "}, {"date": "3 Jun 2015", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Interactive College of Technology (ICT) (Houston, TX) in Mar 2013", "Interview Descriptions": "Assessed qualifications of to provide adjunct, or substituting services for classes in the evening. I was contacted first by phone, then asked to come in and do a face to face meeting. I was asked to present to a peer group on a specific topic.", "Interview Questions": "Describe your experience as it would relate to the position, including a mock presentation to a peer group to demonstrate teacher preparation and communication abilities."}, {"date": "15 Sept 2015", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Interactive College of Technology (ICT) (Chamblee, GA) in Aug 2011", "Interview Descriptions": "I was interview by two hiring managers. I was trained for a week then had my classroom to teach. I was offered a full time position in less than a month.", "Interview Questions": "About my teaching "}, {"date": "19 Aug 2015", "title": "Financial Aid Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Interactive College of Technology (ICT) (Gainesville, GA) in Jan 2011", "Interview Descriptions": "Met with Director after sending my resume. I am a graduate of ICT but I had to go through the process with other candidates. She tested my skills, asked questions about me and where I saw myself with in the company and she was very specific about what she was looking for in that position. Needless to say I got the job.", "Interview Questions": "Where do you see yourself in this company? Why?"}]]