[[{"date": "31 Jan 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Dec 2022", "Interview Descriptions": "About 30 minutes interview with the nurse manager. She ask why you are applying. You reason for your profession. And reflection about previous experience. Other locations you have worked at and reason for leaving.", "Interview Questions": "Why are you applying to this position. If there was other positions you were interested in. What is your long term goal."}, {"date": "21 Sept 2021", "title": "New Grad Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Sept 2021", "Interview Descriptions": "Speak with HR first, ask a few questions, about ten minutes. HR put in contact with unit manager of specific unit you interview with. They set up a zoom interview.", "Interview Questions": "how assertive are you? how honest are you? "}, {"date": "24 May 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Apr 2020", "Interview Descriptions": "Applied online, HR contacted me within a few days for a phone interview. I then received a skype link to discuss with the nurse manager. Had to follow up a week later after they failed to call back within their given time frame. Three references were required as well as a background check.", "Interview Questions": "When have you gone above and beyond for a patient?"}, {"date": "26 Aug 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bridgeport Hospital", "Interview Descriptions": "Applied online and received an email from a nurse recruiter about setting up a phone call. Had a brief phone call and set up an interview. 15-20 minute interview with employee in HR and another 15-20 minute interview with nurse manager on the floor followed by a quick tour of the floor.", "Interview Questions": "How do you handle people with different personalities? What are your strengths? A challenge? "}, {"date": "16 Nov 2021", "title": "SSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Aug 2019", "Interview Descriptions": "A normal 3 part interview . First step is \nOver the phone . An hr specialist will reach out to you. If selected ask to come in and interview with hr. Once passed hr interview with manger.", "Interview Questions": "How did you hear about us?"}, {"date": "26 Feb 2018", "title": "Business Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Feb 2018", "Interview Descriptions": "You apply online and have to wait to see if you are selected. You can check online the status other you are selected HR will call you in for an interview and if they feel you are a fit they will set up a appointment with a department head.", "Interview Questions": "Why do you feel you are qualified?"}, {"date": "7 Oct 2018", "title": "Dietary Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Jan 2018", "Interview Descriptions": "I’m hard worker and I have time management, I’m nice to people and I will give them food. I’m hard of hearing. I like working in the hospital and wear kind of dietary aid clothes. Make good money working in the hospital.", "Interview Questions": "Why you interested in dietary aid? "}, {"date": "26 Jul 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bridgeport Hospital (Bridgeport, CT)", "Interview Descriptions": "I applied online, got called for interview two days later. Initially met with someone from human resources, who asked about education, and experience. Then I met the nurse manager on the floor who explained the unit to me and introduced me to everyone. Then she had me meet the assistant nurse manager, who asked a few further questions.", "Interview Questions": "What are your strength and weaknesses?"}, {"date": "20 Oct 2016", "title": "Executive Director Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Jul 2016", "Interview Descriptions": "I applied online and was called in two weeks to interview for the ED Registrar position at Yale New Haven Hospital and Bridgeport Hospital. I was never sent an e-mail in regard to the position as they stated. The same person called me again to schedule me for another interview for the same position and I told her I went on an interview two days ago to both locations Bridgeport and Yale. She stated she was Sorry, and hung up the phone. Highly unprofessional would never recommend anyone to take the time to interview for either hospital. A follow-up e-mail would have been appreciated even if I did not get the position.", "Interview Questions": "What are your professional goals?"}, {"date": "5 Feb 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 weeks. I interviewed at Bridgeport Hospital", "Interview Descriptions": "applied online recived a phone call a couple weeks later.Went in for an interview a week later. recived a job offer a couple weeks later. the process went smoothly. managers were easy to talk to", "Interview Questions": "why do you want to work for this company"}], [{"date": "3 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bridgeport Hospital (Bridgeport, CT)", "Interview Descriptions": "The interview process was very straight forward.  Initially met with HR and discussed the position and what I was looking for out of the organization.  Then, I met personally with the Nursing Manager and a few staff members.  They were very open to my questions, opinions, and responding effectively.  Great interview!  Plus had a few laughs :)  Afterwards, they do drug test, skills review, etc.", "Interview Questions": "Patient safety, personal interests, future career goals"}, {"date": "3 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Dec 2015", "Interview Descriptions": "I was only asked a single question during my interview. I think I was pretty much hired going into it and I was a new grad. Easiest interview of my life.", "Interview Questions": "Do you want to work nights or days?"}, {"date": "17 Nov 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Oct 2015", "Interview Descriptions": "Received call 3 days after applying. Went in for an interview 1 week later. Met with HR briefly who brought me to the nurse manager who would conduct the interview. Felt very comfortable answering all of her questions. Received call 4 days later with offer. Started orientation 2 weeks later. Overall, everyone was super friendly, and professional. Enjoyable experience!", "Interview Questions": "What are some of your strengths/ weaknesses?"}, {"date": "24 Aug 2015", "title": "Business Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Aug 2015", "Interview Descriptions": "I applied online, received a call from HR about 2-3 days later, scheduled interview for a Monday and received an offer on that Thursday.  The process was very simple and straightforward.  Easy questions about work history and also to get know you as a person.  I found it to be a very relaxed interview.", "Interview Questions": "Why do you want to work here?  How would you describe yourself?"}, {"date": "4 Aug 2015", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bridgeport Hospital", "Interview Descriptions": "The process started with an HR screening and competency test. This was followed by an interview with the hiring manager. At this point I met with the entire marketing team and last with the Sr. VP for final approval.", "Interview Questions": "All questions were behavioral based. Asking to recall experiences from past jobs."}, {"date": "15 Oct 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Aug 2015", "Interview Descriptions": "Applied, received a phone call, scheduled an interview. It seemed to take forever to coordinate schedules. I was told I would be called on a certain day, but then was not called until 2 or 3 days later. I think the HR person was only part-time.", "Interview Questions": "What are your strengths?"}, {"date": "17 Jul 2014", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bridgeport Hospital", "Interview Descriptions": "Very thorough but painless.  No inappropriate or uncomfortable questions.  Overall process was thorough, fair and complete.  Everyone made me feel comfortable and welcome.  The in-person panel interviews consisted of 2 distinct visits;  one was with a panel of three, and the last was with a panel of more than a dozen (e.g. CEO, Sr VP COO, Nurse Directors, Dept Heads, etc.).  Plan on spending most of your day on campus as these interviews will require several hours to complete.", "Interview Questions": "Actually I don't remember any trick questions or difficult questions.  Just be yourself and be honest."}, {"date": "18 May 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Bridgeport Hospital", "Interview Descriptions": "The hiring process is a process. I had filled out many job applications both online and in person. I brought my resume to the hiring managers and was turned away. They do not know their job and keep putting you of to someone else. I had several interviews, all the red tape. I have been unhappy here for a while and am looking for a new job.", "Interview Questions": "They offered me a job. I took it. I did not realize what poor training, poor salary, poor hours, poor management. I should of turned the position down."}, {"date": "9 Aug 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Bridgeport Hospital (Bridgeport, CT) in Jul 2013", "Interview Descriptions": "The interview was very quick and easy. They made it very comforatble to be yourself and talk. Also showed the environment you woud be working in. ANd the employees were very welcoming", "Interview Questions": "What are you strengths and weaknesses?"}]]