[[{"date": "18 Apr 2018", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Centegra Health System", "Interview Descriptions": "Centegra's interview process required having 3 interviews. A phone interview, an 1-on-1 interview with someone in HR, and a panel interview. I don't remember being told there would be a panel interview, but I don't remember. Overall, it was certainly a learning experience.", "Interview Questions": "I see you don't have a medical background. Why should we hire you? "}, {"date": "17 Feb 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centegra Health System (McHenry, IL)", "Interview Descriptions": "Applied for this job and didn't get a call until a month after. When HR did call, they squeezed me in the next day and didn't bother emailing me the details of where I was supposed to go until I had to email them for information. Interviewed as a panel interview with 4 other nurse managers. I guess its OKAY for them to talk in front of the candidate and say they don't have room for me. I was called in the next day for a second step peer interview, which went horrifically wrong and wasn't even asked questions about my professional self. Very demeaning people who pick and choose who they want, not because you may be smart, but by how you look. I wouldn't want to work in an institution who asks unexperienced nurses & PCTs if they like a candidate or not.", "Interview Questions": "Why nursing?"}, {"date": "30 Nov 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Centegra Health System", "Interview Descriptions": "Nightmare. Got called in for two interviews. They forgot about them. Then got hired a month later for a different position that originally didn't apply for. They were on a hiring spree for Huntley and were completely clueless.", "Interview Questions": "What is your weakest attribute? "}, {"date": "27 Oct 2017", "title": "Guest Services Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centegra Health System (McHenry, IL)", "Interview Descriptions": "4 interviews over the course of a month and a half (phone interview, physical interview, peer interview, final interview) took a very long time to hear back from anyone or receive information on the progress of application", "Interview Questions": "skills, previous related experience, how i match centegra values, why i would fit this position.  There was an interview on the phone, one in person, one with peers from that department, and one with bosses from that department"}, {"date": "16 Mar 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centegra Health System", "Interview Descriptions": "I e-mailed the person in charge regarding volunteer hours I needed, and I described why I wanted to volunteer with this organization. Everybody was welcoming and accommodating! I am glad I was given the opportunity.", "Interview Questions": "They asked me about my previous experience/why I was interested. "}, {"date": "28 Feb 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centegra Health System", "Interview Descriptions": "3 in-depth interviews with the department manager, peers, and human resources. Employees were very professional, polite, and wise. toured the unit I would be working on and met other staff.", "Interview Questions": "Tell me about yourself?"}, {"date": "23 Aug 2016", "title": "Respiratory Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centegra Health System (McHenry, IL) in Jul 2016", "Interview Descriptions": "They didn't ask any questions they pretty much told me they wanted me to work there as soon as I walked in. They talked about which hospitals I would be working at and when. They have three different hospitals to choose from.", "Interview Questions": "What shift I prefer."}, {"date": "24 Jun 2016", "title": "Senior Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centegra Health System (McHenry, IL) in Jun 2016", "Interview Descriptions": "I was asked to come in three separate times to meet with various members of the team and other departments. I was offered a position about a week and a half after my third interview. I had a few standard questions about benefits before I accepted- how comp time works, starting schedule, etc., but instead of answering my questions, they immediately rescinded the offer. I was told that because I had questions they wondered if I was the best fit for the organization, so they were going with another candidate. Extremely disappointing considering that I would have accepted the position- but I'm now glad I didn't start a job at such a rigid and uncommunicative company.", "Interview Questions": "How would you be the best candidate to fit in with the mission of the company?"}, {"date": "11 Jul 2016", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Centegra Health System (McHenry, IL) in Jun 2016", "Interview Descriptions": "Applied online in March; received a call from HR in early May, interviewed, received a call-back mid June. Interviewed at one location, was invited to peer-interviews to both locations after that. Standard   questions at interview, but the interviews were all nice. This is just a nessessary thing to go thru.", "Interview Questions": "What do you do  to ensure patient satisfaction?"}, {"date": "20 Jul 2016", "title": "Physical Therapy Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centegra Health System (Crystal Lake, IL) in Mar 2016", "Interview Descriptions": "I met with the Director physical therapy for a job opening in a new clinic location in Dundee. It was simple and straightforward, she just wanted to get to know me. Dress well and answer eloquently. I didn't get the job, but you can ask about your competition. Sometimes they'll tell Ya how you did in comparison, or how others did in the interview.", "Interview Questions": "How well do you work on a team?"}], [{"date": "26 May 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Centegra Health System (New York, NY) in Mar 2016", "Interview Descriptions": "First I had a phone interview, one week later interview with unit manager and another pct. I toured the unit and waited for a call to have another interview with human resources. One week later I got a call from hr with an offer.", "Interview Questions": "Time when I've dealt with difficult patient"}, {"date": "9 May 2016", "title": "Wellness Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centegra Health System (Crystal Lake, IL) in Dec 2015", "Interview Descriptions": "Online then in person with manager then a peer interview with potential coworkers. The interviews went quick and then HR took forever to handle paperwork, drug test, background check, and I ended up needing to collect all information for my own background check which took a while and it was tedious.", "Interview Questions": "Name a time or place where you questioned or change the way things were done in a process."}, {"date": "26 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centegra Health System (New York, NY) in Nov 2015", "Interview Descriptions": "HR is slow to hire...there's an HR interview, then interview with manager, then a peer interview as well with standardized questions that don't really predict the way the person will perform on the job!!", "Interview Questions": "Tell me about a time you had a dissatisfied patient/customer...tell me about a time you encountered conflict with a coworker, how did you resolve this?"}, {"date": "5 Aug 2015", "title": "Scheduling Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centegra Health System", "Interview Descriptions": "Very nice, fun interview. Employees seemed like they enjoyed their jobs. I was surprised the total process was so fast. Centegra usually takes a long time with their interview and hiring process.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "6 Jul 2015", "title": "LCPC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centegra Health System in May 2015", "Interview Descriptions": "Phone interview, HR interview-Formal, Supervisor interview-Formal, and staff of 3 interview-laid back with formal question but comfortable.\r\nOverall experience was not stressful, welcoming, and appropriate. I was nervous going in, but did not prepare. I have interviewed plenty in very high stressed interview boards, and I knew there was no point in practicing, as I just went with my experience, knowledge, and being honest.", "Interview Questions": "What can you bring to the department? What made you decide on this position?"}, {"date": "26 Sept 2014", "title": "Hospital Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centegra Health System", "Interview Descriptions": "applied online and heard within two weeks. There is a phone interview with HR which determines whether the application moves forward. If the HR phone interview goes well,  then you have 2 in person interviews. The first interview is with management and the second is a peer interview. Both interviews consist of a lot of behavioral questions (what is a weakness, ask about your past jobs) and what you bring to the company.", "Interview Questions": "Have you ever had a conflict with a coworker and how did you resolve it?"}, {"date": "9 Jul 2014", "title": "Webmaster Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centegra Health System (Crystal Lake, IL)", "Interview Descriptions": "Very standard questions until the 2nd/3rd interviews.  Very informal rejection.  Simple email cop out after many hours spent invested in interviewing.  People were quite friendly during the process and receptionists were very accommodating.", "Interview Questions": "N/A"}, {"date": "11 Jun 2014", "title": "Patient Business Services Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Centegra Health System", "Interview Descriptions": "4 interviews - 1 with employees that you would be working with. After going through all the interviews I contacted them to be told they had chosen someone else. They should have notified me, not letting me hang on wondering if I would be offered the position. A few week later they did contact me to let me know the other person did not work out - so they then offered me a position. Was not good enough for them initially, but after the 1st person failed to do the job they then called me. Possible age thing - 1st person was younger, but when they did not work out Older person offered the job.", "Interview Questions": "N/A"}, {"date": "19 Sept 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centegra Health System in Jun 2014", "Interview Descriptions": "HR interview, nursing manager interview, peer interview.  They were all pretty straight forward and simple.  Nothing out of the ordinary. standard questions from HR regarding eligibility previous experience etc.  Questions from manager/peers about specifics relating to past experiences etc.", "Interview Questions": "standard questions from HR regarding eligibility previous experience etc.  Questions from manager/peers about specifics relating to past experiences etc."}, {"date": "19 Jan 2014", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Centegra Health System", "Interview Descriptions": "When I appplied it was back in the day of face to face. No online application. Much more personal.", "Interview Questions": "I had already worked with the manager at a previous Hospital. She contacted me when they had a need."}], [{"date": "19 Nov 2013", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Centegra Health System", "Interview Descriptions": "The interview process at Centegra Health System differs based on the role you apply. The company puts a lot of focus on finding the right individual that fits the culture. You will have a phone interview with HR, then an in person or phone with the department. After that you will meet with a number of individuals face to face and finally a peer review. This can be intimidating if you have never done it before but just remember to be yourself!", "Interview Questions": "I cannot remember a specific question, the difficulty was staying alert and focused after talking to three people."}, {"date": "19 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centegra Health System", "Interview Descriptions": "The Human Resources Department is very slow. Try to contact manager of specific department to make sure they receive your resume.", "Interview Questions": "Tell me about yourself."}, {"date": "22 Jul 2013", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Centegra Health System", "Interview Descriptions": "It went very smoothly", "Interview Questions": "There really wasn't anything difficult it required some thought but went well."}, {"date": "7 May 2013", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centegra Health System", "Interview Descriptions": "I submitted my resume for multiple Registrar positions. I received an immediate response that my application was successfully received. It took about 3 weeks to hear back, however I was able to log into my account and check the status of my application (which I did so every couple days). I completed a phone interview and then interviewed with HR, the manager and the team. It was a great process!", "Interview Questions": "Tell me about a time you handled a difficult customer/patient"}, {"date": "18 Dec 2013", "title": "Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centegra Health System in Aug 2012", "Interview Descriptions": "I filled out application and then we met and started immediately", "Interview Questions": "N/A"}, {"date": "23 Mar 2015", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Centegra Health System (McHenry, IL) in Aug 2011", "Interview Descriptions": "I had 3 different interviews..one with HR, manager, and peer interview. Felt very comfortable and welcomed. I felt it by quickly..staff seemed to be happy to work there. I did some people I went to school with competing for the same position..a little awkward.", "Interview Questions": "Teamwork?"}, {"date": "27 Nov 2013", "title": "Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Centegra Health System (McHenry, IL) in Apr 2011", "Interview Descriptions": "I applied online and was contacted about a month later about a Human Resources interview. I was told the compensation and basic job description. Two weeks later I was told to come back for a peer interview with two interpreters and a team lead. Lastly, I was asked to come in for a third and final interview with my manager. All three interviews were beneficial and informative of my expectations.", "Interview Questions": "To test my ability in interpreting I was asked to respond to the person asking the question in the opposite language during my peer interview. "}, {"date": "7 May 2013", "title": "Senior Public Relations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Centegra Health System (Crystal Lake, IL) in May 2009", "Interview Descriptions": "Once I got an interview, the process was very thorough and comprehensive. I had three interviews with three different groups; the HR team, the team I was applying to work with (peer interview) and leaders I would work closely with.", "Interview Questions": "Are you aware of Centegra's values?"}, {"date": "9 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centegra Health System in Mar 2009", "Interview Descriptions": "dont't really remember", "Interview Questions": "can't remember "}, {"date": "13 Dec 2010", "title": "Biller Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Centegra Health System (Woodstock, IL) in Feb 2009", "Interview Descriptions": "Positive at first, then I noticed some people who tried to appear businesslike but who ultimately exude negativity (and still do)", "Interview Questions": "N/A"}]]