[[{"date": "11 May 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Charlotte, NC)", "Interview Descriptions": "filled out the application and received an email. the first round of interviews were by phone. the second round of interviews were in a group setting with a tour of the location.", "Interview Questions": "what is your professional background and how can you contribute to the team?"}, {"date": "10 Dec 2022", "title": "Reference Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University in Dec 2022", "Interview Descriptions": "This was for the Charlotte, NC location. About a month after I applied, I received a phone call asking me if I would still like to schedule an interview. Once I agreed, the person then reviewed the position description with me. They added a lot of unnecessary details that would have been more appropriate for a second or final interview, like getting free lunch sometimes, etc. It felt like they were hesitating to tell me something. They then proceed to tell me what the salary for the position will be because it wasn't listed in the initial job posting. The figure they gave me was the lowest number I had heard since starting my job search. At that point I had applied to ~20 other places and was generally seeing salaries that were at least $10k higher. I then realized that they were calling people to schedule an interview because they wanted to weed out the people who wouldn't work for an extremely low salary in one of the fastest growing cities in the US and quickly declined the interview.", "Interview Questions": "Are you interested in scheduling an interview?"}, {"date": "11 Aug 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Johnson & Wales University", "Interview Descriptions": "Several rounds of interviews. One round by the existing RA's, the next round was hosted by the area coordinators. After that they will send an email of acceptance or rejection and attach an offer letter.", "Interview Questions": "If there was a resident that you knew was going through a tough time, what would you do?"}, {"date": "2 Mar 2022", "title": "Residence Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Johnson & Wales University", "Interview Descriptions": "Phone and in-person group interview with several departments.   Good communication as well throughout the entire process from original invite to interview and follow-up throughout process.   Meeting with VP was important step as well, since it showed dedication to including various offices.", "Interview Questions": "Leadership style, Strengths/areas of improvement, important needs to be successful in this role. "}, {"date": "2 Mar 2023", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Johnson & Wales University in Dec 2021", "Interview Descriptions": "The interview process is professional and well done. The university takes the hiring process seriously and is very inviting in the interviewing process. I felt very comfortable during the process", "Interview Questions": "What is your best quality?"}, {"date": "26 Aug 2020", "title": "Online Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Johnson & Wales University", "Interview Descriptions": "I felt compelled to write this review in hopes that others will be warned of the unprofessional circus act I endured during the hiring process. I received an email on a Wednesday from someone stating they were interested in interviewing me for that week Friday. It had been almost a full month since I had applied for the position. That same morning I emailed them back times I was available on Friday. I did not hear from them the rest of the day. Thursday rolls around and I am questioning why no one has informed me yet of the time of the interview. I decide on Thursday afternoon after not receiving an email to send an email myself. I stated how I had not received a time yet and how I felt scheduling an interview for tomorrow was too short notice for me. I also said they should notify me if they are no longer interested in interviewing me. Friday comes and goes with no communication. Days pass by and I no longer expect a reply back. After a whole seven days of no communication I receive an email. The person apologizes, says my emails were \"caught in (her) junk folder\", and she is still interested in interviewing me. I don't believe emails just end up unwillingly in junk folders but alas I decide to reply back my availability for the following week for an interview. We decide on Tuesday of the following week giving me enough time to prepare. At the designated time of the interview I await the interviewer to call my cell phone as they stated they would do. A few minutes pass by after the scheduled start time and I double check our emails to make sure I was not supposed to call them. Soon a few minutes turn into ten minutes and then twenty minutes. It's obvious no one is going to call. Today went by without any communication from the person. They have no excuse or apology to give.", "Interview Questions": "When are you available for a phone interview?"}, {"date": "28 Jan 2020", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Denver, CO) in Jan 2020", "Interview Descriptions": "A director contacted me by email and wanted to schedule a 30-minute phone interview the same day or the next day. I spoke with him on a Tuesday morning and he had a list of prepared questions for me. After each of my answers, he said \"That was a great answer. Thank you.\" At the end of the call, he said he would get back to me by the end of the week regardless of whether I was moving forward in the process or not, but I didn't hear from him. A month later, I received an automated email telling me that they selected another candidate.", "Interview Questions": "Why is diversity important, and what is your experience with diversity?"}, {"date": "23 Feb 2023", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johnson & Wales University in Nov 2019", "Interview Descriptions": "Very informal as a current employee, day in the life, expectations, strengths and weaknesses, behavior based questions. Comfortable atmosphere and pleasant interviewer. Met some of the team and they were wonderful.", "Interview Questions": "What do you bring to this role?"}, {"date": "24 Jan 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2019", "Interview Descriptions": "Very friendly interview. They were keen to know how adaptable and interested I am to work there. GPA counts and other rules are taken into account. They treat everyone like a family member.", "Interview Questions": "Strengths and Weaknesses"}, {"date": "30 Apr 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Johnson & Wales University", "Interview Descriptions": "Quick met with one person who would be my direct boss. Everyone was very nice and friendly made me felt  welcomed and comfortable. Series of email exchanged and in person interview.", "Interview Questions": "Do you feel comfortable speaking on the phone and asking for money?"}], [{"date": "8 Dec 2017", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johnson & Wales University (Fall River, MA) in Nov 2017", "Interview Descriptions": "After an initial phone interview, I had an person interview with 6 people asking me questions. Most of the questions had been asked in the phone interview, and non were related to the job I had applied for.", "Interview Questions": "Have you ever worked with a difficult person and how did you handle them?"}, {"date": "20 Jul 2017", "title": "Academic Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Denver, CO)", "Interview Descriptions": "Process was professional as was the interview panel. However, they provided no further correspondence or feedback. Would not respond to any requests for status after the panel interview; very unprofessional and rude.", "Interview Questions": "How would I handle non-performing faculty in the courses?"}, {"date": "3 Mar 2018", "title": "Dean's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2017", "Interview Descriptions": "Very friendly and easy going. They went over the basic questions of what skills I had then we talked about my interests and where I was from and a few specific things on my resume.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Jan 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Johnson & Wales University", "Interview Descriptions": "I applied online and was contacted three days later asking for a phone interview for the next day. I found it odd that the phone interview was taking place during a lunch hour. I was contacted five minutes late and one of the two interviewers had a somewhat arrogant attitude throughout the interview. She gave a sarcastic apology about calling late because according to her, that's what happens when you do phone interviews. Let's just say I knew the minute I heard her name, it was going to be a bogus interview because she knew a former co-worker at my last employer.\r\n\r\nShe kept talking down to me and saying things I felt were a way to insult or antagonize me. I thought it was funny how she said I would have to be taught a few things regarding technology even though I graduated from a college that specializes in it and I have 20 years of experience using it, but seeing as how I graduated so long ago, things have changed and she was sure I would need to be trained. She also said in a snotty tone I would be working w/people who had doctorates and such, as if to say I'd be working with people who were much smarter than me.\r\n\r\nShe told me they would be contacting people for a face to face the following week and having them come in the week after that and wanted someone to start immediately the beginning of February. Since she just told me what I wanted to know I didn't have any questions, but she kept asking if I had any questions. What else should I have asked in a preliminary phone interview? Aren't you supposed to ask the important questions during the face to face?\r\n\r\nI never heard back and trust me, I was fine with that. Not only did Miss Personality waste my time with her rude and bogus interview, I also read so many bad reviews on this site about what a terrible place it is to work.", "Interview Questions": "Can you tell us about a time when you worked with different personalities?"}, {"date": "29 Mar 2019", "title": "PA Schools Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2017", "Interview Descriptions": "First part was watching a video as a group (5-6 other applicants) and discussing the topic in front of two faculty members, followed by 2 other interviews with 2 other faculty in each interview", "Interview Questions": "Why a PA and not medical school?"}, {"date": "17 Jun 2016", "title": "Faculty - Associate Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Charlotte, NC) in Jun 2016", "Interview Descriptions": "Average process with a search panel. One thing I will say is that during my teaching demo, one of the search committee members was on their cellphone the ENTIRE time---literally from before I started to the end. At first I thought it was a practicum in classroom management but realized that person really was just being rude. How can that person give me a fair score let alone a good one? Ultimately the position was cancelled, but it just showed me that there are some unfair selection processes in the search committee.", "Interview Questions": "What was one time in your personal or professional life when things really went right? And a time things went really wrong? How do you use these experiences to related with your students?"}, {"date": "6 May 2016", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Johnson & Wales University (North Miami, FL) in May 2016", "Interview Descriptions": "They ask a lot about who you knew on campus as far as important people... How give directions if people were trying to get to another place. It was basic questions about my major and how that would help with giving tour around campus. Responsibilities of working in the wildcat center. The importance of having everyone sign in.", "Interview Questions": "Why did I want this job? Why would I be a good fit?"}, {"date": "23 Feb 2020", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johnson & Wales University (Miami, FL) in May 2016", "Interview Descriptions": "Phone interview first (this was before Skype) followed by a day-long in-person interview with several members of the Student Affairs, Residential Life, and Security teams. Met with a handful of students as well.", "Interview Questions": "What applicable experience do you bring to this position?"}, {"date": "30 Jul 2017", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Denver, CO) in Mar 2016", "Interview Descriptions": "Multi stage process including a campus colleague phone interview, search committee phone interview, and full day on campus. This process took place over the course of roughly one month with about 1 week in between each phase, overall it was a very positive interview experience and was well coordinated.", "Interview Questions": "Why are you interested in the position at johnson and Wales university denver?"}, {"date": "19 Jun 2016", "title": "Technical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Mar 2016", "Interview Descriptions": "Hiring process includes interview questions such as, telling about yourself. Other questions asked during interview are Audio Video troubleshooting/Knowledge, Network troubleshooting/Knowledge, Wireless internet and LAN . Other questions include about windows OS and Microsoft Office. Printer troubleshooting Printing knowledge and Computer hardware and software knowledge is a must. The person should be familiar with computer hardware.", "Interview Questions": "They ask about your strengths weakness and opportunities"}], [{"date": "3 Feb 2016", "title": "Financial Planning Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University (Charlotte, NC)", "Interview Descriptions": "Phone interview took several weeks, then the process went week to week thereafter. Met with director and staff interviewed as a panel. Took a personality quiz then met with Operations.", "Interview Questions": "why work for JWU?\r\ntell me a time...?"}, {"date": "11 Feb 2016", "title": "Graduate Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2016", "Interview Descriptions": "I applied online and was required to provide 1 letter of reference. Candidates are also required to write a personal statement. Approximately 2 weeks later, I received an email requesting an in-person interview. Three members of residential life (one current GA) conducted a panel interview. They asked several questions about experience and how you would handle xyz situation.", "Interview Questions": "What is student engagement to you? What role do you think a GA plays? How would you speak to a parent? How do you see yourself handling conflict? "}, {"date": "1 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2016", "Interview Descriptions": "It was easy and comfortable. The process started with the dean his assistant and an admin asking me about my school work and background. Then I was called back for a second interview . It was easy because I knew the people from seeing them around campus.", "Interview Questions": "Why would you be a good candidate for this job?"}, {"date": "1 Jun 2016", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Johnson & Wales University (Denver, CO) in Aug 2015", "Interview Descriptions": "I applied online, promptly interviewed over the phone, then was invited for an in office interview and presentation. The presentation was only 3-5 minutes, and then I had a meeting with the admissions director and the assistant director.", "Interview Questions": "Do you feel comfortable doing culinary demonstrations?"}, {"date": "12 Jan 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Jul 2015", "Interview Descriptions": "There were two professors interviewing me. Well, from the beginning, some basic personal information, and some behavior questions. Then some job-related questions later, brief introduction about this position. A little bit chatting actually. And talk about the work schedules in the end.", "Interview Questions": "Q: what are the difficulty you have been through in your life and how you encounter it?"}, {"date": "6 Mar 2015", "title": "Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University", "Interview Descriptions": "Asked a lot of good questions, stated they would call back but never did. The had more than one person in the room interviewing over the speaker phone so it made it very difficult to hear what each person was saying or to know exactly who you were talking to.", "Interview Questions": "What is the most challenging thing I've ever faced?"}, {"date": "21 May 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Johnson & Wales University (Denver, CO) in Aug 2014", "Interview Descriptions": "I met one of the interviewers on LinkedIn and requested an intevriew.  Met with him and another director once for about an hour; they were both lovely and personable.  I was offered a position; began 3 months later for a p/t job", "Interview Questions": "Why do you enjoy teaching"}, {"date": "10 Nov 2015", "title": "Experiential Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Johnson & Wales University (Miami, FL) in Jul 2014", "Interview Descriptions": "Came for 3 rounds of interviews, all of which lasted throughout 2.5 months. A bunch of different one on ones and also a few panel interviews. Long process, but worth the wait. The interviewees were all very friendly and helpful.", "Interview Questions": "Why do you want this job?"}, {"date": "13 May 2014", "title": "Social Media Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University", "Interview Descriptions": "Applied online through their portal, a few weeks later received an email about an initial screening call, did the screening call with 2 people - they asked good questions about my current work experience and told me more about the position. A day or two later got a call for an in person interview scheduled for a week or so out. It was a great interview experience, very professional everyone was very kind they gave good directions to the building etc. At the end of the interview I was told they were interviewing the first round of candidates and would let me know by the end of next week if I was going to come in for another interview, an online test, and a written test. That was almost a month and a half ago, never heard anything and the job posting is still up. Marketing admissions can be busy in April, their needs may have changed, who knows what happened. That's the way these things go sometimes.", "Interview Questions": "Wanted to hear about specific projects, and also about a time I had pitched a project that was rejected and what I learned from it etc."}, {"date": "25 Jun 2016", "title": "Technical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Johnson & Wales University (Providence, RI) in May 2014", "Interview Descriptions": "Three interviewers interviewed you. One asked questions and two watched your performances. Talked about your self (Why you here? Do you have a car? Where do you live? Can you come at 6:30 am on time or leave at 11:00 pm? What other jobs do you have?), checked if you meet the requirements(Have 3.0 minimum GPA or higher? Can you carry 40 lb staffs or heavier? ),tested your reflection on real situations,and finally asked your questions to themselves.", "Interview Questions": "What is your disadvantage?"}], [{"date": "18 Oct 2014", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Johnson & Wales University in Apr 2014", "Interview Descriptions": "I just asked my boss if I can work as a Student Assistant, he wanted to interview me again and then I for the job. The interview was stressful for me because my boss is a grumpy and intimidating loser", "Interview Questions": "Why do you think you'll benefit this gym more than anyone else?"}, {"date": "3 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2014", "Interview Descriptions": "Great. On the phone. There were 3 people who asked me questions and I answered thoroughly. It was great. I enjoyed the questions and the people were friendly. I got to use my thinking juices and they definitely listened and loved great examples.", "Interview Questions": "How would you handle a parent notification?"}, {"date": "9 May 2017", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2014", "Interview Descriptions": "Recieved call-back after early application; a mutual meeting was scheduled same week, and interview was with department director, and one other department staffer.  One interview, followed  by vaildating  education and references.", "Interview Questions": "Interview was informal. My portfolio was reveiwed, then I was given a writing sample, and asked to copy edit and evaluate. "}, {"date": "14 Jun 2013", "title": "MDP Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University", "Interview Descriptions": "Long process- about 6 months. One individual interview, one group interview. Must submit 2 rec. letters.", "Interview Questions": "How will you improve practicum training"}, {"date": "18 Apr 2013", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University (Providence, RI)", "Interview Descriptions": "First, you have to attend an orientation information session (which is offered several different times) at the end you received an application packet. After completing the application, drop it off before the deadline and attend a group interview night. At the group interview night you must make an impression, for us we did introductions in front of everyone and then broke into smaller groups to create a skit. At the end of the group interview night, you sign up for an individual interview time; however, you are sent an email to say if you moving on to the individual interviews. If you receive an email, you attend the interview at the time you signed-up for. After the individual interview, you are given a date in which all the interviews will be done and everyone will have an envelope to pick up. In the envelope you receive a letter stating where or not you received the job!", "Interview Questions": "What would you tell a room full of parents about coming to JWU and your major?"}, {"date": "21 Jan 2013", "title": "Field Service Techniccian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University", "Interview Descriptions": "Interview process consisted of :\r\napplied online through their career website and monitor the application through there.\r\nthen i got a first round interview and after almost a month i got a second interview.\r\nFive days later i got a call from them with a job offer.\r\n\r\nnot much room for negotiation...", "Interview Questions": "Questions were straight forward and easy to answer. prepare for behavioral questions as well as technicall."}, {"date": "23 Apr 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2013", "Interview Descriptions": "Group interview and individual interview. It is to see how well you play with others and it is also to see how your personality will mesh with others. I think that it is a very easy and simple process and it is nothing to be nervous about. It is also a good opportunity.", "Interview Questions": "what makes you want to be a RA?"}, {"date": "9 Mar 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Johnson & Wales University (Los Angeles, CA) in Sept 2012", "Interview Descriptions": "Phone interview, basic questions: Talk about yourself, where do you want to be in _ years _ years? Ultimate Goal. In person interview, 2 people in depth questions about strengths and experiences. Basic stuff. Nothing new. 1 week intensive training in Providence, RI.", "Interview Questions": "Weakness"}, {"date": "27 Jul 2016", "title": "Simple Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Mar 2012", "Interview Descriptions": "Simple all you have to do is be a student at the university. If you pay the high tuition cost, you'll be able to apply for any on campus student assistant job while also hoping that you'll get fair pay that's equal to minimum wage in whichever state that campus resides in", "Interview Questions": "Be a student"}, {"date": "17 Oct 2011", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Nov 2009", "Interview Descriptions": "I was asked to come in for the interview, They handed me the application and said fill this out, I wasn't asked any of the normal interview questions I would have been asked.", "Interview Questions": "Can you stay the summer"}], [{"date": "11 Oct 2011", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Mar 2009", "Interview Descriptions": "Informal Overview on qualifications", "Interview Questions": "Do you have experience in managing people?"}, {"date": "28 Jul 2010", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Dec 2008", "Interview Descriptions": "I was interviewed by the Manager of telecommunication where basically she described the job duties and explained what she did. The interview was pretty informal, which is expected for a student assistant position.   I was asked about my fufute goals and few questions about my technical skills with the computer and phone system. Next day I got the email saying I am hired and I started the next week.", "Interview Questions": "Do you have any experience with networking and VOiP phone system?"}]][[{"date": "11 May 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Charlotte, NC)", "Interview Descriptions": "filled out the application and received an email. the first round of interviews were by phone. the second round of interviews were in a group setting with a tour of the location.", "Interview Questions": "what is your professional background and how can you contribute to the team?"}, {"date": "10 Dec 2022", "title": "Reference Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University in Dec 2022", "Interview Descriptions": "This was for the Charlotte, NC location. About a month after I applied, I received a phone call asking me if I would still like to schedule an interview. Once I agreed, the person then reviewed the position description with me. They added a lot of unnecessary details that would have been more appropriate for a second or final interview, like getting free lunch sometimes, etc. It felt like they were hesitating to tell me something. They then proceed to tell me what the salary for the position will be because it wasn't listed in the initial job posting. The figure they gave me was the lowest number I had heard since starting my job search. At that point I had applied to ~20 other places and was generally seeing salaries that were at least $10k higher. I then realized that they were calling people to schedule an interview because they wanted to weed out the people who wouldn't work for an extremely low salary in one of the fastest growing cities in the US and quickly declined the interview.", "Interview Questions": "Are you interested in scheduling an interview?"}, {"date": "11 Aug 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Johnson & Wales University", "Interview Descriptions": "Several rounds of interviews. One round by the existing RA's, the next round was hosted by the area coordinators. After that they will send an email of acceptance or rejection and attach an offer letter.", "Interview Questions": "If there was a resident that you knew was going through a tough time, what would you do?"}, {"date": "2 Mar 2022", "title": "Residence Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Johnson & Wales University", "Interview Descriptions": "Phone and in-person group interview with several departments.   Good communication as well throughout the entire process from original invite to interview and follow-up throughout process.   Meeting with VP was important step as well, since it showed dedication to including various offices.", "Interview Questions": "Leadership style, Strengths/areas of improvement, important needs to be successful in this role. "}, {"date": "2 Mar 2023", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Johnson & Wales University in Dec 2021", "Interview Descriptions": "The interview process is professional and well done. The university takes the hiring process seriously and is very inviting in the interviewing process. I felt very comfortable during the process", "Interview Questions": "What is your best quality?"}, {"date": "26 Aug 2020", "title": "Online Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Johnson & Wales University", "Interview Descriptions": "I felt compelled to write this review in hopes that others will be warned of the unprofessional circus act I endured during the hiring process. I received an email on a Wednesday from someone stating they were interested in interviewing me for that week Friday. It had been almost a full month since I had applied for the position. That same morning I emailed them back times I was available on Friday. I did not hear from them the rest of the day. Thursday rolls around and I am questioning why no one has informed me yet of the time of the interview. I decide on Thursday afternoon after not receiving an email to send an email myself. I stated how I had not received a time yet and how I felt scheduling an interview for tomorrow was too short notice for me. I also said they should notify me if they are no longer interested in interviewing me. Friday comes and goes with no communication. Days pass by and I no longer expect a reply back. After a whole seven days of no communication I receive an email. The person apologizes, says my emails were \"caught in (her) junk folder\", and she is still interested in interviewing me. I don't believe emails just end up unwillingly in junk folders but alas I decide to reply back my availability for the following week for an interview. We decide on Tuesday of the following week giving me enough time to prepare. At the designated time of the interview I await the interviewer to call my cell phone as they stated they would do. A few minutes pass by after the scheduled start time and I double check our emails to make sure I was not supposed to call them. Soon a few minutes turn into ten minutes and then twenty minutes. It's obvious no one is going to call. Today went by without any communication from the person. They have no excuse or apology to give.", "Interview Questions": "When are you available for a phone interview?"}, {"date": "28 Jan 2020", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Denver, CO) in Jan 2020", "Interview Descriptions": "A director contacted me by email and wanted to schedule a 30-minute phone interview the same day or the next day. I spoke with him on a Tuesday morning and he had a list of prepared questions for me. After each of my answers, he said \"That was a great answer. Thank you.\" At the end of the call, he said he would get back to me by the end of the week regardless of whether I was moving forward in the process or not, but I didn't hear from him. A month later, I received an automated email telling me that they selected another candidate.", "Interview Questions": "Why is diversity important, and what is your experience with diversity?"}, {"date": "23 Feb 2023", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johnson & Wales University in Nov 2019", "Interview Descriptions": "Very informal as a current employee, day in the life, expectations, strengths and weaknesses, behavior based questions. Comfortable atmosphere and pleasant interviewer. Met some of the team and they were wonderful.", "Interview Questions": "What do you bring to this role?"}, {"date": "24 Jan 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2019", "Interview Descriptions": "Very friendly interview. They were keen to know how adaptable and interested I am to work there. GPA counts and other rules are taken into account. They treat everyone like a family member.", "Interview Questions": "Strengths and Weaknesses"}, {"date": "30 Apr 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Johnson & Wales University", "Interview Descriptions": "Quick met with one person who would be my direct boss. Everyone was very nice and friendly made me felt  welcomed and comfortable. Series of email exchanged and in person interview.", "Interview Questions": "Do you feel comfortable speaking on the phone and asking for money?"}], [{"date": "8 Dec 2017", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johnson & Wales University (Fall River, MA) in Nov 2017", "Interview Descriptions": "After an initial phone interview, I had an person interview with 6 people asking me questions. Most of the questions had been asked in the phone interview, and non were related to the job I had applied for.", "Interview Questions": "Have you ever worked with a difficult person and how did you handle them?"}, {"date": "20 Jul 2017", "title": "Academic Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Denver, CO)", "Interview Descriptions": "Process was professional as was the interview panel. However, they provided no further correspondence or feedback. Would not respond to any requests for status after the panel interview; very unprofessional and rude.", "Interview Questions": "How would I handle non-performing faculty in the courses?"}, {"date": "3 Mar 2018", "title": "Dean's Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2017", "Interview Descriptions": "Very friendly and easy going. They went over the basic questions of what skills I had then we talked about my interests and where I was from and a few specific things on my resume.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Jan 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Johnson & Wales University", "Interview Descriptions": "I applied online and was contacted three days later asking for a phone interview for the next day. I found it odd that the phone interview was taking place during a lunch hour. I was contacted five minutes late and one of the two interviewers had a somewhat arrogant attitude throughout the interview. She gave a sarcastic apology about calling late because according to her, that's what happens when you do phone interviews. Let's just say I knew the minute I heard her name, it was going to be a bogus interview because she knew a former co-worker at my last employer.\r\n\r\nShe kept talking down to me and saying things I felt were a way to insult or antagonize me. I thought it was funny how she said I would have to be taught a few things regarding technology even though I graduated from a college that specializes in it and I have 20 years of experience using it, but seeing as how I graduated so long ago, things have changed and she was sure I would need to be trained. She also said in a snotty tone I would be working w/people who had doctorates and such, as if to say I'd be working with people who were much smarter than me.\r\n\r\nShe told me they would be contacting people for a face to face the following week and having them come in the week after that and wanted someone to start immediately the beginning of February. Since she just told me what I wanted to know I didn't have any questions, but she kept asking if I had any questions. What else should I have asked in a preliminary phone interview? Aren't you supposed to ask the important questions during the face to face?\r\n\r\nI never heard back and trust me, I was fine with that. Not only did Miss Personality waste my time with her rude and bogus interview, I also read so many bad reviews on this site about what a terrible place it is to work.", "Interview Questions": "Can you tell us about a time when you worked with different personalities?"}, {"date": "29 Mar 2019", "title": "PA Schools Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2017", "Interview Descriptions": "First part was watching a video as a group (5-6 other applicants) and discussing the topic in front of two faculty members, followed by 2 other interviews with 2 other faculty in each interview", "Interview Questions": "Why a PA and not medical school?"}, {"date": "17 Jun 2016", "title": "Faculty - Associate Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Charlotte, NC) in Jun 2016", "Interview Descriptions": "Average process with a search panel. One thing I will say is that during my teaching demo, one of the search committee members was on their cellphone the ENTIRE time---literally from before I started to the end. At first I thought it was a practicum in classroom management but realized that person really was just being rude. How can that person give me a fair score let alone a good one? Ultimately the position was cancelled, but it just showed me that there are some unfair selection processes in the search committee.", "Interview Questions": "What was one time in your personal or professional life when things really went right? And a time things went really wrong? How do you use these experiences to related with your students?"}, {"date": "6 May 2016", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Johnson & Wales University (North Miami, FL) in May 2016", "Interview Descriptions": "They ask a lot about who you knew on campus as far as important people... How give directions if people were trying to get to another place. It was basic questions about my major and how that would help with giving tour around campus. Responsibilities of working in the wildcat center. The importance of having everyone sign in.", "Interview Questions": "Why did I want this job? Why would I be a good fit?"}, {"date": "23 Feb 2020", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johnson & Wales University (Miami, FL) in May 2016", "Interview Descriptions": "Phone interview first (this was before Skype) followed by a day-long in-person interview with several members of the Student Affairs, Residential Life, and Security teams. Met with a handful of students as well.", "Interview Questions": "What applicable experience do you bring to this position?"}, {"date": "30 Jul 2017", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Denver, CO) in Mar 2016", "Interview Descriptions": "Multi stage process including a campus colleague phone interview, search committee phone interview, and full day on campus. This process took place over the course of roughly one month with about 1 week in between each phase, overall it was a very positive interview experience and was well coordinated.", "Interview Questions": "Why are you interested in the position at johnson and Wales university denver?"}, {"date": "19 Jun 2016", "title": "Technical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Mar 2016", "Interview Descriptions": "Hiring process includes interview questions such as, telling about yourself. Other questions asked during interview are Audio Video troubleshooting/Knowledge, Network troubleshooting/Knowledge, Wireless internet and LAN . Other questions include about windows OS and Microsoft Office. Printer troubleshooting Printing knowledge and Computer hardware and software knowledge is a must. The person should be familiar with computer hardware.", "Interview Questions": "They ask about your strengths weakness and opportunities"}], [{"date": "3 Feb 2016", "title": "Financial Planning Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University (Charlotte, NC)", "Interview Descriptions": "Phone interview took several weeks, then the process went week to week thereafter. Met with director and staff interviewed as a panel. Took a personality quiz then met with Operations.", "Interview Questions": "why work for JWU?\r\ntell me a time...?"}, {"date": "11 Feb 2016", "title": "Graduate Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2016", "Interview Descriptions": "I applied online and was required to provide 1 letter of reference. Candidates are also required to write a personal statement. Approximately 2 weeks later, I received an email requesting an in-person interview. Three members of residential life (one current GA) conducted a panel interview. They asked several questions about experience and how you would handle xyz situation.", "Interview Questions": "What is student engagement to you? What role do you think a GA plays? How would you speak to a parent? How do you see yourself handling conflict? "}, {"date": "1 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2016", "Interview Descriptions": "It was easy and comfortable. The process started with the dean his assistant and an admin asking me about my school work and background. Then I was called back for a second interview . It was easy because I knew the people from seeing them around campus.", "Interview Questions": "Why would you be a good candidate for this job?"}, {"date": "1 Jun 2016", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Johnson & Wales University (Denver, CO) in Aug 2015", "Interview Descriptions": "I applied online, promptly interviewed over the phone, then was invited for an in office interview and presentation. The presentation was only 3-5 minutes, and then I had a meeting with the admissions director and the assistant director.", "Interview Questions": "Do you feel comfortable doing culinary demonstrations?"}, {"date": "12 Jan 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Jul 2015", "Interview Descriptions": "There were two professors interviewing me. Well, from the beginning, some basic personal information, and some behavior questions. Then some job-related questions later, brief introduction about this position. A little bit chatting actually. And talk about the work schedules in the end.", "Interview Questions": "Q: what are the difficulty you have been through in your life and how you encounter it?"}, {"date": "6 Mar 2015", "title": "Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University", "Interview Descriptions": "Asked a lot of good questions, stated they would call back but never did. The had more than one person in the room interviewing over the speaker phone so it made it very difficult to hear what each person was saying or to know exactly who you were talking to.", "Interview Questions": "What is the most challenging thing I've ever faced?"}, {"date": "21 May 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Johnson & Wales University (Denver, CO) in Aug 2014", "Interview Descriptions": "I met one of the interviewers on LinkedIn and requested an intevriew.  Met with him and another director once for about an hour; they were both lovely and personable.  I was offered a position; began 3 months later for a p/t job", "Interview Questions": "Why do you enjoy teaching"}, {"date": "10 Nov 2015", "title": "Experiential Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Johnson & Wales University (Miami, FL) in Jul 2014", "Interview Descriptions": "Came for 3 rounds of interviews, all of which lasted throughout 2.5 months. A bunch of different one on ones and also a few panel interviews. Long process, but worth the wait. The interviewees were all very friendly and helpful.", "Interview Questions": "Why do you want this job?"}, {"date": "13 May 2014", "title": "Social Media Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johnson & Wales University", "Interview Descriptions": "Applied online through their portal, a few weeks later received an email about an initial screening call, did the screening call with 2 people - they asked good questions about my current work experience and told me more about the position. A day or two later got a call for an in person interview scheduled for a week or so out. It was a great interview experience, very professional everyone was very kind they gave good directions to the building etc. At the end of the interview I was told they were interviewing the first round of candidates and would let me know by the end of next week if I was going to come in for another interview, an online test, and a written test. That was almost a month and a half ago, never heard anything and the job posting is still up. Marketing admissions can be busy in April, their needs may have changed, who knows what happened. That's the way these things go sometimes.", "Interview Questions": "Wanted to hear about specific projects, and also about a time I had pitched a project that was rejected and what I learned from it etc."}, {"date": "25 Jun 2016", "title": "Technical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Johnson & Wales University (Providence, RI) in May 2014", "Interview Descriptions": "Three interviewers interviewed you. One asked questions and two watched your performances. Talked about your self (Why you here? Do you have a car? Where do you live? Can you come at 6:30 am on time or leave at 11:00 pm? What other jobs do you have?), checked if you meet the requirements(Have 3.0 minimum GPA or higher? Can you carry 40 lb staffs or heavier? ),tested your reflection on real situations,and finally asked your questions to themselves.", "Interview Questions": "What is your disadvantage?"}], [{"date": "18 Oct 2014", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Johnson & Wales University in Apr 2014", "Interview Descriptions": "I just asked my boss if I can work as a Student Assistant, he wanted to interview me again and then I for the job. The interview was stressful for me because my boss is a grumpy and intimidating loser", "Interview Questions": "Why do you think you'll benefit this gym more than anyone else?"}, {"date": "3 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2014", "Interview Descriptions": "Great. On the phone. There were 3 people who asked me questions and I answered thoroughly. It was great. I enjoyed the questions and the people were friendly. I got to use my thinking juices and they definitely listened and loved great examples.", "Interview Questions": "How would you handle a parent notification?"}, {"date": "9 May 2017", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Johnson & Wales University (Providence, RI) in Feb 2014", "Interview Descriptions": "Recieved call-back after early application; a mutual meeting was scheduled same week, and interview was with department director, and one other department staffer.  One interview, followed  by vaildating  education and references.", "Interview Questions": "Interview was informal. My portfolio was reveiwed, then I was given a writing sample, and asked to copy edit and evaluate. "}, {"date": "14 Jun 2013", "title": "MDP Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University", "Interview Descriptions": "Long process- about 6 months. One individual interview, one group interview. Must submit 2 rec. letters.", "Interview Questions": "How will you improve practicum training"}, {"date": "18 Apr 2013", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University (Providence, RI)", "Interview Descriptions": "First, you have to attend an orientation information session (which is offered several different times) at the end you received an application packet. After completing the application, drop it off before the deadline and attend a group interview night. At the group interview night you must make an impression, for us we did introductions in front of everyone and then broke into smaller groups to create a skit. At the end of the group interview night, you sign up for an individual interview time; however, you are sent an email to say if you moving on to the individual interviews. If you receive an email, you attend the interview at the time you signed-up for. After the individual interview, you are given a date in which all the interviews will be done and everyone will have an envelope to pick up. In the envelope you receive a letter stating where or not you received the job!", "Interview Questions": "What would you tell a room full of parents about coming to JWU and your major?"}, {"date": "21 Jan 2013", "title": "Field Service Techniccian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Johnson & Wales University", "Interview Descriptions": "Interview process consisted of :\r\napplied online through their career website and monitor the application through there.\r\nthen i got a first round interview and after almost a month i got a second interview.\r\nFive days later i got a call from them with a job offer.\r\n\r\nnot much room for negotiation...", "Interview Questions": "Questions were straight forward and easy to answer. prepare for behavioral questions as well as technicall."}, {"date": "23 Apr 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Johnson & Wales University (Providence, RI) in Jan 2013", "Interview Descriptions": "Group interview and individual interview. It is to see how well you play with others and it is also to see how your personality will mesh with others. I think that it is a very easy and simple process and it is nothing to be nervous about. It is also a good opportunity.", "Interview Questions": "what makes you want to be a RA?"}, {"date": "9 Mar 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Johnson & Wales University (Los Angeles, CA) in Sept 2012", "Interview Descriptions": "Phone interview, basic questions: Talk about yourself, where do you want to be in _ years _ years? Ultimate Goal. In person interview, 2 people in depth questions about strengths and experiences. Basic stuff. Nothing new. 1 week intensive training in Providence, RI.", "Interview Questions": "Weakness"}, {"date": "27 Jul 2016", "title": "Simple Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Johnson & Wales University (Providence, RI) in Mar 2012", "Interview Descriptions": "Simple all you have to do is be a student at the university. If you pay the high tuition cost, you'll be able to apply for any on campus student assistant job while also hoping that you'll get fair pay that's equal to minimum wage in whichever state that campus resides in", "Interview Questions": "Be a student"}, {"date": "17 Oct 2011", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Nov 2009", "Interview Descriptions": "I was asked to come in for the interview, They handed me the application and said fill this out, I wasn't asked any of the normal interview questions I would have been asked.", "Interview Questions": "Can you stay the summer"}], [{"date": "11 Oct 2011", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Mar 2009", "Interview Descriptions": "Informal Overview on qualifications", "Interview Questions": "Do you have experience in managing people?"}, {"date": "28 Jul 2010", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Johnson & Wales University (Providence, RI) in Dec 2008", "Interview Descriptions": "I was interviewed by the Manager of telecommunication where basically she described the job duties and explained what she did. The interview was pretty informal, which is expected for a student assistant position.   I was asked about my fufute goals and few questions about my technical skills with the computer and phone system. Next day I got the email saying I am hired and I started the next week.", "Interview Questions": "Do you have any experience with networking and VOiP phone system?"}]]