[[{"date": "9 Mar 2022", "title": "Coordinateur trice plaidoyer junior Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ONE Campaign in Feb 2022", "Interview Descriptions": "Suite à ma candidature, j'ai passé un pré-entretien téléphonique à l'improviste, en anglais et français, au cours duquel j'ai dû exposer mes motivations et compétences.\r\nJ'ai ensuite dû passer un test écrit de 3h comprenant une épreuve de synthèse en anglais, une analyse de données en tableau, et la rédaction d'un courrier adressé aux candidats à l'élection présidentielle.\r\nTrois semaines après ce test, restant sans nouvelles, j'ai dû solliciter ONE France pour obtenir une réponse, négative, pour pouvoir obtenir un entretien final.\r\nLe processus de recrutement est long, difficile, et les recruteurs ont manqué d'égard pour les candidat.e.s à mon sens en ne les tenant pas informés rapidement.", "Interview Questions": "Quelles sont les compétences que vous pourriez apporter au poste (en anglais) ?"}, {"date": "7 Dec 2021", "title": "Teamleiter Digital Campaigning Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ONE Campaign", "Interview Descriptions": "Professional, friendly, rapid hiring process, interesting assignment.\r\nThe team Took longer than expected To provide \r\nFeedback\r\nOverall a pleasant experience with interesting questions\r\nInternational company with diversity and teams that speak multiple languages!", "Interview Questions": "What makes an online campaign successful"}, {"date": "24 Oct 2021", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ONE Campaign", "Interview Descriptions": "The interview process was extremely long. I applied almost 3 months ago before being contacted and the actually interview process took another 2 months. I met with a number of people which I thought was a bit overkill for the role.", "Interview Questions": "Tell us why you are interested in joining the ONE campaign?"}, {"date": "1 Nov 2021", "title": "Advocacy and Policy Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ONE Campaign (London, England) in Sept 2021", "Interview Descriptions": "- One phone interview with the HR manager, basic questions (tell me about yourself, a time you worked in a team, what is something you find challenging about advocacy and campaigns)\n- One written test (writing a series of emails promoting an initiative)\n- One panel interview (3 person interview, lasted roughly 30 mins)", "Interview Questions": "- What challenges do you think this organisation faces right now?\n- What is something that inspires you?\n- Describe a time you worked with young people "}, {"date": "28 Jul 2021", "title": "Campaigns Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ONE Campaign", "Interview Descriptions": "One interview with the Head of Campaigns and a short campaigns task. It was a relatively typical task/interview for this role. The second part of the interview included an informal conversation with other members of the teak", "Interview Questions": "- Describe a recent campaign you have seen and evaluate it's success"}, {"date": "7 Jan 2022", "title": "Undergraduate Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ONE Campaign in Jun 2021", "Interview Descriptions": "The HR contact seemed disorganized. It often took him a long time to respond and when he did, it seemed that he hadn't properly communicated with the staff conducting the interviews.", "Interview Questions": "Behavioral questions with some situational"}, {"date": "20 Apr 2021", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at ONE Campaign", "Interview Descriptions": "Every hire is different. For me, it was a 3 step interview process over the course of 3 months -- 1:1 with the hiring manager, 2 panel interviews on 1 day, 1 final 1:1 with the department head.", "Interview Questions": "Q: Why do you want to work at ONE? Are you comfortable working at a bipartisan organization that works with Democrats and Republicans? "}, {"date": "15 May 2023", "title": "Campaigner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ONE Campaign in Apr 2021", "Interview Descriptions": "I appreciate the transparency and clarity of the process, which was evident from the moment I was shortlisted up to the final interview stage. All my questions were answered and concerns were addressed.", "Interview Questions": "How my skills and experience prepared me for the role"}, {"date": "19 May 2023", "title": "Director, Digital Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ONE Campaign (Washington, DC) in Jan 2019", "Interview Descriptions": "Applied online. Met with HR. She was nice, but told me that they had an issue with some of the junior staff being indulged and difficult to manage. Follow-up meeting with 4 members of senior staff, and had a great conversation. They were all smart, sophisticated about policy and had high ambitions for me and the position. Then met with 2 of the junior staffers who would be under me. One of them was temporarily leading the team and couldn't be more of a brat. The other guy was overseas and dialed in on video. The bratty one had an actual tantrum and started telling me how I was wrong about everything (despite having 20 years experience and having managed 100 of her in my career). The other guy looked uncomfortable and embarrassed. I went home, mulled it over, and called the HR person to turn the job down. Later interviewed the poor sap who took the job at another org I was working at. He lasted 6 months.", "Interview Questions": "I honestly can't even remember. Talked a lot about mobile fundraising strategy though."}], [{"date": "27 Apr 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at ONE Campaign", "Interview Descriptions": "The interview process was fairly easy! I applied online, received an email requesting a phone interview, spoke with my future supervisor, and received an offer about 20 minutes after the call.", "Interview Questions": "The basics. Tell me about yourself"}, {"date": "20 Jun 2017", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at ONE Campaign (Brussels) in Mar 2017", "Interview Descriptions": "I was interviewed by two people who were simply reading questions off a 4 page document...it was very impersonal and the questions were not so easy to respond. There was no moment to introduce myself and \"break the ice\"", "Interview Questions": "Name three things your boss would say about you and three things your friends would say about you."}, {"date": "17 Dec 2016", "title": "Digital Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ONE Campaign", "Interview Descriptions": "2 months after applying for the position received phone interview invitation. Which went for 20 minutes. I was asked basic interview questions. After 3 weeks received an invitation for interview at office.", "Interview Questions": "Q: Tell me a little about your self\r\nQ: What would you bring to the position?"}, {"date": "19 May 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ONE Campaign", "Interview Descriptions": "Had an easy conversation with a lovely HR person and she wanted me to send her available dates for face to face interview. I did, it took several days for someone to respond...and when they did, my schedule had changed. Finally got one scheduled but was emailed the night before interview and was informed the position had been filled. I wonder what would have happened if I was interviewed when I was supposed to be interviewed. At least they didn't waste my time.", "Interview Questions": "If I ever heard of the One Campaign."}, {"date": "15 May 2015", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at ONE Campaign", "Interview Descriptions": "Contacted by HR admin to set up a phone interview shortly after applying online. \r\nPhone interview was very strange, 20 minutes late, the person I spoke with was very awkward and seemingly ill prepared - almost annoyed that she had to speak with me (they asked for the interview!) \r\n\r\nHer opening line was \"So this job is exactly as the job posting says it is - do you have any questions?\"  \r\n\r\nOur call was disconnected mid sentence toward the end of the phone interview and when I called back 1 minute later she was unavailable. The whole thing was bizarre. The best part was the hold music (U2)", "Interview Questions": "almost nothing."}, {"date": "17 Oct 2013", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at ONE Campaign (Washington, DC) in Jul 2013", "Interview Descriptions": "I applied online through the website. Had three people interview me over the phone. The phone interview went well and I was selected.", "Interview Questions": "Do you know database management?"}, {"date": "2 Jun 2014", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ONE Campaign (Washington, DC) in Apr 2013", "Interview Descriptions": "I submitted my application, which includes three short-answer questions regarding my experience and interest working with nonprofits. About a month later, I got a call from HR for an interview. I met with two directors- one in marketing and another in a different department, and the CMO. They asked basic questions about my experience, but also asked if I had any digital marketing experience, and if I have created surveys and basic programming language. They also asked if I had been involved or have experience with campaigning (I didn't). They wanted me to submit a previous writing sample too, but I got an offer call the next day, so that was moot.\r\n\r\nOverall, everyone I met and was interviewed by were very nice. They all have a lot of experience and passion for what they do.", "Interview Questions": "There wasn't really any, but I guess the one about campaigning experience caught me off guard. It shouldn't given it is a campaign organization."}, {"date": "11 Sept 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at ONE Campaign (Washington, DC) in Sept 2009", "Interview Descriptions": "The interview happened in multiple stages. Began as informal discussions about what direction I would take the organization and then evolved into more concrete conversations about results and what I was likely to achieve if hired. The final (and I guess real) interview took place in person, with senior management in the Washington office and was really enjoyable. More a conversation and exchange of ideas. Great experience", "Interview Questions": "There were no difficult or unexpected questions. "}]]