[[{"date": "4 May 2023", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Heritage Foundation", "Interview Descriptions": "There was a phone interview with the director followed by in-person interviews with the director, the rest of the team, and then VP. Took some time before receiving a final offer.", "Interview Questions": "What media outlets do you watch/read to get your news? What would be your media plan if a certain issue you tracked picked up in the news cycle? What makes you conservative?"}, {"date": "16 Dec 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Heritage Foundation (Washington, DC) in Oct 2022", "Interview Descriptions": "Met the policy center director on-site. There was only one interview. It in-person and about an hour long. It felt pretty laid back and was more about culture fit than anything else.", "Interview Questions": "Why the Heritage Foundation in specific?"}, {"date": "29 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "Extensive application and rigorous interview with hard-hitting philosophical questions. Began with questions about work style and organizational skills but quickly developed into intellectual conversation and probing questions. It was a test to see how you think on your feet.", "Interview Questions": "How would you describe your political philosophy?"}, {"date": "2 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heritage Foundation", "Interview Descriptions": "The interview was non confrontational and generally casual. I have had interviews in the past that have gone on for hours. Though the questions asked certainly enquired into one's understanding of policy and politics, they were overall reasonable.", "Interview Questions": "Q: In what direction do you see the policy of energy independence being pursued in congress?"}, {"date": "30 Mar 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heritage Foundation in Mar 2022", "Interview Descriptions": "Was very enjoyable! I loved talking to my interviewer. Every department is different in the way they conduct interviews, however I believe all are similar in principle. I interviewed for the Communications and Public Relations Department. Interview only lasted 25 minutes and was very straightforward and honestly fun. I enjoyed being able to talk about why I wanted this internship while also being able to discuss current policy topics.", "Interview Questions": "What current policy issues are you most interested in/passionate about? "}, {"date": "24 Nov 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "Takes a very long time to get through the interview process and seems very disorganized. I had other offers from other organizations by the time it took them to get me a second and third interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "16 Sept 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Heritage Foundation", "Interview Descriptions": "Phone interview followed by in person with people from multiple different teams.   The interview process was rigorous, bur fair and very professional.  I think it reflects the largely positive workplace culture.", "Interview Questions": "Tell me how would approach X, Y, and Z situations.  PLease get into specifics about your work on [specific project].  Can you share any work samples?"}, {"date": "19 Jul 2022", "title": "Digital Marketing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heritage Foundation (Needham, MA) in Sept 2021", "Interview Descriptions": "The people were very nice, easy to talk to and professional. \nUnfortunately, I went through three rounds of interviews, including speaking with the head of the department. And then I never heard back from them. After three rounds of time-consuming interviews, you would at least hope to receive an email with a rejection and some feedback if they ended up choosing a different candidate. \n\nWhile that aspect was pretty disappointing, I still enjoyed my conversations with each person I interviewed with and very much admire the mission at Heritage.", "Interview Questions": "Why do you want to work at Heritage?"}, {"date": "17 Jul 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "Very warm and welcoming.  They are knowledgeable about politics and policy. They look for good team members who agree with the mission. \r\n\r\nThey are very organized and respond after the interview very quickly", "Interview Questions": "Why are you interested in heritage. "}, {"date": "5 Apr 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Heritage Foundation (Washington, DC) in Mar 2021", "Interview Descriptions": "They clearly wanted applicant to politically align with all of their views or they weren't interested. Interview questions were aggressive,  inappropriate and uncomfortable.  Interview also was conducted in a small room with several other people doing other things. Unprofessional and uncomfortable for interviewee.", "Interview Questions": "Do you believe in the legal killing of children (abortion)?"}], [{"date": "22 Aug 2020", "title": "Senior Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heritage Foundation (Ban Som Phone) in Aug 2020", "Interview Descriptions": "Quick to schedule an interview after the application. The first interview was with marketing manager. General interview questions and asking about your experience with the organization's vision. After first interview there is a skill test, and then two more panel interviews", "Interview Questions": "Tell me about yourself, are you open to relocating, tell me about a time you were in conflict with a fellow team member, how do you like to receive feedback."}, {"date": "18 Feb 2020", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "I applied around early January, long application with ideology questions followed by phone interview asking about individual questions regarding work history and education. Offer came about two or three weeks later", "Interview Questions": "What Heritage? "}, {"date": "18 Nov 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heritage Foundation", "Interview Descriptions": "I was asked to walk through my resume, and elaborate on anything that interested me about my research field. I was then asked about the mission of the Heritage Foundation and to what degree I agreed with it as a whole as well as my department’s focus. There was only one phone interview.", "Interview Questions": "How would this internship impact or enrich your college education?"}, {"date": "12 Sept 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Heritage Foundation", "Interview Descriptions": "Phone Interview with 2 employees of the company-one in charge of the internship program and one employee with whom I would be working under. The phone call was quick and we went over my resume and job expectations.", "Interview Questions": "What are your strengths and weaknesses? Provide an example of how you are detail-oriented. "}, {"date": "18 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heritage Foundation", "Interview Descriptions": "They really just ask questions to see if you are conservative. As long as you are conservative or libertarian they will probably take you. There is room for intellectual diversity but you will not enjoy yourself if you are definitely liberal.", "Interview Questions": "What is one policy issue that you are passionate about."}, {"date": "8 Mar 2019", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Heritage Foundation (Washington, DC)", "Interview Descriptions": "The process itself moved quickly and effectively but the follow up lacked clear communication.  While the interview was interesting, the position they wanted filled based on what the Postion Description was did not align.", "Interview Questions": "How would you handle an internal conflict?"}, {"date": "26 Jan 2023", "title": "Education Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heritage Foundation (Washington, DC) in Feb 2019", "Interview Descriptions": "I had an initial phone interview with a department supervisor, and then a second round phone interview with the head of the department. I accepted another position before moving to the final stage of interview, which would have been in-person.", "Interview Questions": "We discussed my interest in education policy and my experience with research. We also talked about the role itself and the structure of the company."}, {"date": "12 Feb 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heritage Foundation (Washington, DC) in Dec 2018", "Interview Descriptions": "Originally was reached out to for a phone interview, conducted within a few days.  Passed on to the executive I'd be working for, literally interviewing the next day.  With such a quick turn around, was told I would receive notice as to whether or not I was selected within 1-2 weeks after all interviews we're completed. Despite sending a thank you email and then a follow up email 4 weeks after the in-person interview, was never given even remote consideration of a response.  Very very unprofessional organization.  Extremely disappointed.  Ultimately selected for a far better organization with nearly double the pay, so all things work out.  But truthfully the only organization that turned me down...but never had the guts to say, thank you, but we've moved on.  Common courtesy goes a long way.", "Interview Questions": "What do you think of the President?"}, {"date": "24 Nov 2018", "title": "YLP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "They gave me a call after reviewing my application.  It was a fairly straightforward process, asked me several questions.  Then I got the offer at the end of the call.  Overall streamlined process.", "Interview Questions": "Why do you want ot work for Heritage?"}, {"date": "12 Sept 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Heritage Foundation (Washington, DC) in Apr 2018", "Interview Descriptions": "The interview was fairly straightforward, with questions on my interest in the field, Heritage , experience in management etc. The issue was with HR, which took nearly 3 months to reach a decision.", "Interview Questions": "What drew you to this position?"}], [{"date": "27 Feb 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heritage Foundation", "Interview Descriptions": "Interview seemed to be mainly a formality. Asked general resume questions and about my educational background. I got to discuss which kind of policy I am most passionate about/ have the most interest in.", "Interview Questions": "On which issue are you least conservative on?"}, {"date": "23 Feb 2018", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Heritage Foundation", "Interview Descriptions": "You apply online to three programs, and the application goes through the departments in order, passing you along or selecting you. After selection, there's a short 20 minute phone interview, but if you get the interview, you've already been selected, so chances are you've already got the job if you don't screw up.", "Interview Questions": "Talk about your school projects"}, {"date": "17 Jan 2019", "title": "Economic Policy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Heritage Foundation in Feb 2018", "Interview Descriptions": "Intense application process (8+ essay questions) but short interviews. Make sure you know the basics of government and policy and be knowledgeable about the policy area you want to work in. If your application demonstrates that then the interview is brief.", "Interview Questions": "Can you start by the end of May?"}, {"date": "17 Nov 2017", "title": "Special Assistant and Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Heritage Foundation (Washington, DC) in Oct 2017", "Interview Descriptions": "Met with supervisor and department VP on different days. Spoke about my past experiences and my careers goals while learning about the position's duties. The interviewers often reminded me of the challenges associated with the role to prepare me and temper expectations.", "Interview Questions": "Where are you coming from?  (Pedigree)"}, {"date": "14 Sept 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heritage Foundation (Washington, DC) in Mar 2017", "Interview Descriptions": "Submit a very lengthy and robust online application. Lots of writing. Then you do a phone interview. Make sure you stick to your guns. If they call to interview, you have a great shot of being hired.", "Interview Questions": "When will you be available to begin work?"}, {"date": "10 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Heritage Foundation in Mar 2016", "Interview Descriptions": "After applying online, I was contacted about an interview about 6 weeks later. This period of time made me nervous, however, the interview was over an hour along and I received an offer via email immediately after hanging up the phone. I don't think an hour long interview is normal, but my interviewer and I just had a lot in common so the conversation was easy.", "Interview Questions": "They asked what pieces of conservative policy I cared about the most and why"}, {"date": "28 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heritage Foundation", "Interview Descriptions": "The interview process is thorough. They questioned me on all of my resume pieces and were eager to hear about my experiences. Additionally, they will pick at your application responses to their questions, so it is important to keep a record of them. Furthermore, they like to throw throw a couple curveball questions. After two interviews, one with a department member and then a department head, you are in.", "Interview Questions": "What are your future plans?"}, {"date": "15 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "Submit an application online (resume, 2 letters of recommendations and short responses). I was contacted for a phone interview which took under 30 minutes. There was a quick turn-around within a few days and had to accept the offer within a few days.", "Interview Questions": "What are 3 strengths and 3 weaknesses that you have?"}, {"date": "15 Dec 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Heritage Foundation in Jul 2015", "Interview Descriptions": "Got in touch with a supervisor to set up a phone interview. The interview was conversational and covered topics such as work experience and political beliefs. There were questions regarding specific policy issues. There was also time set aside for a q & a about what I was looking for in the internship and how the internship could help me reach goals.", "Interview Questions": "How would you best describe your political beliefs?"}, {"date": "31 May 2016", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Heritage Foundation in Jun 2015", "Interview Descriptions": "There is no set process because it is determined by your supervisor who may have you interview multiple times or just once. However, I was interviewed twice, first by my immediate supervisor than by the Membership Associate. Overall, the process was very casual and my interviewer was very engaging.", "Interview Questions": "-Tell me about yourself\r\n- What are your long term goals\r\n-Describe your organizational and stress management skills\r\n-Tell me about a time where you had a conflict and how you resolved it\r\n\r\n-Just a note: you should have at least 2 questions to ask at the end of the interview"}], [{"date": "20 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Heritage Foundation (Washington, DC) in May 2015", "Interview Descriptions": "Really quick turn around, between 2 weeks-1 month. I sent over cover letter, resume, and my writing sample and they emailed me that i got the interview and set it up two weeks away. The entire interview was very focused on personality/previous accomplishments. They didn't ask any knowledge-based questions. It's much easier for former interns/connections to get through this process. They very rarely hire blindly/from the pool of random people that apply online.", "Interview Questions": "How would you handle a situation where you didn't know what was expected of you"}, {"date": "11 Mar 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Heritage Foundation", "Interview Descriptions": "I don't think I have ever had a worse or more insulting interview process. I was contacted by the Heritage Foundation about interviewing for an internship position while I was out of the country. I explained that I was not in America at the moment, but would be very happy to either do the interview when I returned in a few days or to do a Skype or FaceTime interview. The interviewer asked if I would be available to skype the next day, and I said I was. I asked if 10 am would work, and after receiving no response, assumed that their silence was agreement to the interview time. I logged into Skype the next day 5 minutes before the time, and emailed that I was ready to begin whenever was most convenient. After waiting for 20 minutes, I received an email stating that they would have to postpone the interview. I responded telling them that it was no problem, and asked when would work better for them. My next contact with them was receiving an email thanking them for my application, but informing me that they had just filled the position that morning. I was very taken aback, as I felt they at least owed me the decency to interview with them, after leaving me waiting for 20 minutes and then being the ones to cancel/postpone the interview.", "Interview Questions": "They did not even bother to interview me"}, {"date": "19 Oct 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heritage Foundation in Mar 2015", "Interview Descriptions": "My interview was a phone interview, and I only interviewed once (with my supervisor) before being offered the job about two weeks later. Note that this is after filling out the extensive internship application and questionnaire. Also, several people in my group had a much longer, drawn out process, and several people had a much shorter process than me. I think it really depends on the division you're interviewing for.", "Interview Questions": "Can you describe your organizational method?"}, {"date": "21 Sept 2016", "title": "Center for Trade and Economics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Heritage Foundation in Feb 2015", "Interview Descriptions": "The interview was over the phone and extremely relaxed; it is clearly used as mostly just a screening process. The interview process varies across departments; some ask for names of leaders at Heritage who influenced you. Be sure to know your resume and the answers to questions from your application. I received an offer the next day.", "Interview Questions": "Why Heritage?\r\nMost important public policy issue to address?\r\nWhat are two of your strengths and two of your weaknesses?"}, {"date": "17 Sept 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Heritage Foundation (Washington, DC) in Oct 2014", "Interview Descriptions": "The interview begins with a phone call. The phone call takes 20 minutes and covers an array of questions which pertain to the specialty you are seeking. The hiring process is 1 month. You must prepare and felt back on the application questions and be up to date on current policy measures to know and understand what's going on.", "Interview Questions": "What is a book you have read that had an impact on your policy views?"}, {"date": "2 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Heritage Foundation in Oct 2014", "Interview Descriptions": "Application was rigorous through the university as it required letters of recommendation, a lengthy application process, coupled with an interview in front of a board. Had an advantage as a second time applicant and recent graduate. This was followed by a written application via the Heritage Foundation's website and a phone interview with the supervisor.", "Interview Questions": "The department I entered at the Heritage Foundation was with Marketing Technology. Generally most of the questions centered around computer proficiency and career goals."}, {"date": "6 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heritage Foundation (Washington, DC) in Jun 2014", "Interview Descriptions": "I was called and offered the position after applying through the online application. The application is very extensive but I was glad the interview wasn't that big of a deal.", "Interview Questions": "Can you be here for the whole three months? "}, {"date": "21 Feb 2014", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heritage Foundation", "Interview Descriptions": "Was contacted for one phone interview. Asked very basic questions about my research experience, preferred sources for research, and my background. It was really pleasant to speak with the staff member over the phone. I just talked about my life/professional experiences, there were not too many difficult questions.", "Interview Questions": "What sources do you most commonly look to for research?"}, {"date": "6 Jan 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Heritage Foundation (Washington, DC)", "Interview Descriptions": "I was not locally based, so I had an initial phone interview with the position's supervisor of about 30 minutes, a secondary vetting interview with HR representative of about 45 minutes, and was then flown in for a 30-minute face-to-face interview with the department director.\r\n\r\nIt took a substantial amount of time (several weeks to get an offer), and the reasoning for the delay was not apparent.", "Interview Questions": "How does this job help you achieve your long-term professional goal?"}, {"date": "5 Apr 2013", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Heritage Foundation (Washington, DC)", "Interview Descriptions": "Received an email asking for an interview.  Met with HR guy.  Extremely awkward interviewer who had a long list of questions, but never actually seemed to write anything down.  Gave me the expected timeline going forward, including next interview, etc.  He was very nice, the questions were not particularly difficult, but I have never had an interview with someone quite so awkward.  Never met anyone else in the organization, so my only experience was HR, which didn't really let me get a feeling of whether I was in for a bunch of awkward folks or just him.", "Interview Questions": "What kind of Conservative are you?"}], [{"date": "19 Mar 2010", "title": "Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heritage Foundation (Washington, DC) in Mar 2010", "Interview Descriptions": "Phone interviews with interest and skills questions. Standard stuff. In person interviews with all relevant staff...a couple random SBOs but nothing unusual. Heritage seems like a great place to work if you agree with their perspectives. I enjoyed my interview with their staff (peers, supervisor, and department head) and was treated kindly.", "Interview Questions": "Why do you want to work at Heritage?"}, {"date": "26 Jan 2011", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Heritage Foundation in Mar 2010", "Interview Descriptions": "Standard interview over the phone.", "Interview Questions": "Biggest weakness."}, {"date": "22 Dec 2010", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Heritage Foundation (Washington, DC) in Feb 2010", "Interview Descriptions": "Basically my interviewer wanted to know that I was a supporter of the conservative movement. Once I was able to regurgitate a few quotes and examples from history I was more or less \"in\". If you are qualified they will take you. Very strong internship program!", "Interview Questions": "How do you plan on helping the conservative movement?"}, {"date": "21 Jun 2010", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heritage Foundation in Jun 2009", "Interview Descriptions": "Applied online. Received phone call for interview. Accepted after 15 min phone interview", "Interview Questions": "What is your previos experience"}]]