[[{"date": "24 Jun 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Davidson College (Davidson, NC) in Jan 2022", "Interview Descriptions": "One round of interview with a professor. It was mostly behavioral. Nothing too hard. The professor is very personable and nice. Just prepping the normal behavioral interview stuff should be enough,", "Interview Questions": "What are some of your campus involvement>"}, {"date": "10 Aug 2021", "title": "Nana Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Davidson College (Davidson, NC) in Apr 2020", "Interview Descriptions": "Interview was fantastic, extremely well organized and the town has a quaint, small feel. It was a great opportunity to interview with such a prestigious university where the community is as beautiful as the campus and the town is surrounded by professionals", "Interview Questions": "What makes you want to work at Davidson?"}, {"date": "16 Oct 2019", "title": "Economics Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Davidson College", "Interview Descriptions": "I was asked a couple of questions about why I wanted to be a tutor and was given the job very quickly. They looked at my coursework and soon made a decision off my own academic experience and my interest in the job.", "Interview Questions": "Why do you want to tutor"}, {"date": "20 Sept 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Davidson College in Aug 2016", "Interview Descriptions": "I had a phone interview for a job I was SO excited for. The interview was the most formal phone interview I've ever had, and the most formal interview I've had in an educational institution in general. \r\n\r\nThe interviewer was late to the call, then rushed me through at the end because she had another call immediately following. Big pet peave when people think their time is worth more than mine. \r\n\r\nI thought I did well, and the interviewer said they would be in touch the following Monday with next steps for in-person interviews. That was about a month and a half ago. I sent a thank-you note immediately after the interview, then I followed up the following week since I never heard back as promised. Still nothing. I check my status online often and it still says \"in progress\". \r\n\r\nVery disappointing. But luckily I got a great job in the meantime and possibly dodged a bullet here!", "Interview Questions": "N/A"}, {"date": "29 Dec 2013", "title": "Intramural Employee Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Davidson College", "Interview Descriptions": "There was no interview. Basically you e-mail that you want a job and they give it to you. You have to sit through a one hour training session to learn how to do your job.", "Interview Questions": "Have you ever worked with kids before?"}, {"date": "9 Oct 2015", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Davidson College (Davidson, NC) in Mar 2013", "Interview Descriptions": "Fairly easy. Just had to go in and give a brief background of myself, explain how I had heard about the job, explain what my technical background was, give a few details about myself. They were just screening me and making sure I would be able to talk to people that came in and that I could work well with other people.", "Interview Questions": "Name a commonly used device in your home, and explain step by step the process you would use to fix it if it suddenly stopped working."}, {"date": "31 Jan 2013", "title": "Vice President of Strategic Affairs Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Davidson College", "Interview Descriptions": "A complete waste of time to apply for positions ast Davidson.  After letting people spend hours on their application process, they do this, \" Due to internal reorganization we have decided not to fill the position at this time. We will instead work with a consultant to further refine our understanding of our needs in this area.\"  \r\nI think this is the biggest insult to everyone who applied for the position.  Davidson must think our time is worth nothing.", "Interview Questions": "In this economy can we get much meaner to job applicants?"}, {"date": "8 May 2017", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Davidson College (Davidson, NC) in Jan 2013", "Interview Descriptions": "Relaxed environment, but it can be intimidating as they sit you in front of everybody else who works in the building. The interview questions were meant to understand my personality and to give other employees the chance to get to know me.", "Interview Questions": "Q: Who's your favorite superhero?"}, {"date": "4 Feb 2016", "title": "Director In Student Life Division Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Davidson College (Davidson, NC) in Oct 2012", "Interview Descriptions": "Online application, resume and cover letter to apply.  If your online applicTion does not show that you meet minimum qualifications the hiring manager will never see your resume.  \r\nPhone Screen\r\nPhone panel interview\r\n1-2 day on campus interview with key stakeholders including hiring manager, departmental colleagues, Deans and Directors, Dean of Students, students and possibly others.  Depending on the roll you may be asked to do a presentation.", "Interview Questions": "Tell us about a time that things did not work out as you planned.  How did you handle it."}, {"date": "30 Jul 2012", "title": "Student Computing Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Davidson College (Davidson, NC) in May 2012", "Interview Descriptions": "Initial contact was made through e-mail, approximately a week and a half later I had a two hour telephone conversation.  A week or so later I was invited to campus and went a few weeks later.  I stayed on-campus and had a day and a half interview.  Lots of time between interviews and had lunch with workers.", "Interview Questions": "How do you see online classes effecting college recruitment and attendance and the value of a liberal college education."}]]