[[{"date": "29 Jan 2023", "title": "Fundraising Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Médecins Sans Frontières (Toronto, ON) in Aug 2022", "Interview Descriptions": "Very standard, initial HR call, and then if you move forward you have an assessment and if you move pass this another interview which is again very standard. This is a entry-level position, so its very basic questions.", "Interview Questions": "Tell me about yourself. What experience do you have in fundraising"}, {"date": "29 Dec 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Médecins Sans Frontières", "Interview Descriptions": "After initial application, screening interview, then lengthy 1:1 interview via Zoom with HR. Then this was followed by a French language test and the reference check. Overall, the interview was the most challenging.", "Interview Questions": "please describe your experience working abroad. "}, {"date": "3 Aug 2022", "title": "Digital Fundraising Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières in Nov 2021", "Interview Descriptions": "It was very positive. They sounded very friendly and nice. From the very first moment, I felt good and my stress was mainly gone. Even though this was a phone interview, I could feel the smile and overall very positive attitude towards the candidates.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "11 Nov 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières (Ottawa, ON) in Nov 2021", "Interview Descriptions": "It was very casual and chill. The interviewer made me feel comfortable and clearly explained how the hiring process would look like. It showed that the culture of the organization was great", "Interview Questions": "How would I describe MSF to others?\nHow do I work on a team?\nWhat is my experience writing and presenting?"}, {"date": "21 Apr 2021", "title": "Fundraising Content Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Médecins Sans Frontières (Toronto, ON) in Apr 2021", "Interview Descriptions": "Short half hour interview on the phone. Positive response but not moved forward to next round. When asked for more information why via email, received no response from recruiter which was disappointing as I thought I was a great fit for the position.", "Interview Questions": "How will your experience contribute to you being successful in this role? "}, {"date": "4 Mar 2022", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 months. I interviewed at Médecins Sans Frontières (Toronto, ON) in Mar 2021", "Interview Descriptions": "It was thorough, and extremely long. The interview process lasted 4 months, only to not get the job. Unless you really love the company, and only want to work for them, I wouldn't recommend investing that much time on them, unless you have time to spare", "Interview Questions": "What would you do if two directors have you conflicting instructions?"}, {"date": "21 Mar 2021", "title": "Acquisition Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Médecins Sans Frontières in Feb 2021", "Interview Descriptions": "Long process (2+ months). Initial screening interview with basic questions. Next stage was a technical assessment (Excel spreadsheet) with three questions regarding technical data. Third stage was a panel interview (HR rep, Manager, Third-Party).", "Interview Questions": "What experience do you have with Donor Relations?"}, {"date": "31 Aug 2020", "title": "Field Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Médecins Sans Frontières (Toronto, ON) in Aug 2020", "Interview Descriptions": "so far I am only at the phone interview phase, but wanted to share how the HR screening went. I applied in English but was tested on my French language skills (but not spanish).", "Interview Questions": "Why MSF?\r\n\r\nHow do you imagine this position being on the ground? Expectations of living conditions?\r\n\r\nWhy are you interested in doing humanitarian work?\r\n\r\nWhich field positions do you think you would qualify for?\r\n\r\nCan we ask you questions in french?\r\n\r\nhow did you learn your french (in french)?\r\n\r\nWould you be comfortable managing teams, teaching students, working in teams in French?"}, {"date": "14 Jan 2022", "title": "Public Engagement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Médecins Sans Frontières (Toronto, ON) in Jul 2019", "Interview Descriptions": "They have a well organized and friendly HR department. They were clear and transparent throughout the interview processes. It included a timed written assignment with 3 scenarios, 2 in english 1 in french.", "Interview Questions": "They described an upcoming event and asked me to please prepare:\r\n- the critical path for this event, including your reasons for choosing this timeline,\r\n- the details of the event roll out\r\n- the budget for this event \r\n- Recommendations on how to capitalize/maximize visibility of this event \r\n"}, {"date": "4 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Médecins Sans Frontières (Montreal, QC)", "Interview Descriptions": "They were very nice, interview lasted around 30 mins. They asked general questions on what I could offer and how my previous experience would help me in this role.", "Interview Questions": "What is your greatest weakness?"}], [{"date": "24 Aug 2017", "title": "Digital Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières", "Interview Descriptions": "Very brief interview with behaviour-based questions as well as questions directly associated with the posting. The interview was supposed to last one hour, but only ended up taking 30 mins. Interviewers were really personable, kind and respectful. Looks great if you've researched the company a lot beforehand.", "Interview Questions": "How did you first hear about MSF?"}, {"date": "3 Mar 2017", "title": "Field Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Médecins Sans Frontières (Vancouver, BC) in Feb 2017", "Interview Descriptions": "Submitted application and received an email requesting a short 15 min phone interview 9 days later. Phone interview lasted 17 min. As my French was not good enough \"to lead a team\", their need for someone with my qualifications dropped by 50%. Next step included being forwarded some online tests which I have ~10 days to complete (not submitted yet). Depending on the results, I may be asked to participate in a longer, Skype interview.", "Interview Questions": "Why MSF? What are your expectations in the field? Is your French good enough to manage a team? What's your availability?"}, {"date": "22 Oct 2020", "title": "Corporate Fundraising Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Médecins Sans Frontières (Toronto, ON) in May 2016", "Interview Descriptions": "The interview process was very pleasant. The interviewer asked some very relevant and professional questions. The interviewer was late and a bit frantic when she arrived to the interview. The MSF office was surprisingly extremely quiet and empty.", "Interview Questions": "Share one professional accomplishment you are most proud of."}, {"date": "12 Dec 2017", "title": "Logistician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Médecins Sans Frontières (Toronto, ON) in Jan 2016", "Interview Descriptions": "Application online with a CV and cover letter, plus about 15 questions. CVs for MSF Canada must use their CV template.\r\n\r\nAbout 2 weeks later I had a 20 minute phone interview to determine my suitability. Questions included my availability, motivation, willingness to be away from family and work in insecure environments. There was also a short discussion on the roles that best fit my skill set.\r\n\r\nI was then sent 2 online tests. One for Technical Logisticians and one for administrators. Each took 1 hour.  Questions were multiple choice with 4 possible answers. Each test was 75 questions I believe. The technical test was broken down into 6 competencies, -- Fleet management, supply chain, electric, construction and water & sanitation. I was also sent a skill self declaration for where you had to go through your 6 competencies and identify your ability with examples. This took 1 hour to complete. I was also sent the MSF abortion policy for me to read.\r\n\r\n2 weeks later I had a Skype interview that lasted 1 hour and 45 minutes. The questions focused on  how you have and would handled different situations. As well as how you  work and fit into a team. The interview was relaxed, friendly and open.\r\n\r\n10 days later I received a call telling me I was recruited and they would send me to the Welcome Days event in Toronto for 2 days and to the PPD (Preparation for Primary Departure) training course for 10 days in Germany. After that I would receive my first mission. The training was 2 weeks later and I received my offer to go to Iraq during the training. \r\n\r\nThe entire process took 5 months from application to field.  It would have been shorter but they recruit in cycles and I was bumped back a cycle as they already had enough monolingual logisticians for the first round. Recruiters are very open, honest and responsive. They were communicative with me during all parts of the process.", "Interview Questions": "Tell me about a time you have failed."}, {"date": "17 Feb 2016", "title": "Communication Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Médecins Sans Frontières (Toronto, ON) in Oct 2014", "Interview Descriptions": "pretty straight forward and asked about what I learnt in university. what kind of skills do i have. how many days i could contribute. Some brief self-introduction. Why apply for this intern and why do i chose a NGO.", "Interview Questions": "What skill do you acquired in university"}]]