[[{"date": "10 Jun 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Simple and Straightforward. It felt like more of an introduction rather a challenging interview. I had to go through 2 rounds of interview, first with the hiring manager, then the next round with 2 of his peers. They all seemed very nice.", "Interview Questions": "Describe why you applied here. Describe the risks you took"}, {"date": "19 May 2023", "title": "Scheduler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Normal for this position. Virtual interview that lasted about an hour. Leaves plenty of room at the end to ask any questions that you may have. They will always be on time so make sure you are.", "Interview Questions": "Describe a difficult situation and what you did to handle it."}, {"date": "15 May 2023", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health (Madison, WI)", "Interview Descriptions": "Phone screen followed by an in person STAR format interview. Questions similar to “tell us about a time when you had to solve conflict with a coworker” about 15 questions total. Process took about a month.", "Interview Questions": "“tell us about a time when you had to solve conflict with a coworker”"}, {"date": "19 Apr 2023", "title": "Pharmacy Technician Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "The process was very tedious than what was anticipated for this role. Thorough but very time consuming and didn't think was necessary for this position considering it wasn't even a managerial or supervisory position.", "Interview Questions": "Why are you looking for a new job?"}, {"date": "29 Mar 2023", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health (Madison, WI)", "Interview Descriptions": "The process was very long and tedious, it took awhile to get an interview and to finally go in for one. After that, the process went faster and went well.", "Interview Questions": "Why do you want this job?"}, {"date": "13 Jan 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at UW Health", "Interview Descriptions": "It is fairly easy, not a ton of questions, recruiter is first interview if they like you, passed to the manager then hired from there if they like you, it's all fast though.", "Interview Questions": "What are positive/negatives about your work Why are you leaving your current position What makes you an ideal candidate"}, {"date": "1 Nov 2022", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Phone screening first, recruiter was super nice and helpful! Then you describe your top 3 unit picks. The recruiter moves your screening notes onto the unit manager of the unit you want to apply for.", "Interview Questions": "A time you went above and beyond for a patient."}, {"date": "18 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health (Madison, WI) in Oct 2022", "Interview Descriptions": "You first apply with your application, resume, goal statement, and current unofficial transcript of grades. Then they send you an email and you have to enter 4 references and they send an email to them and they have to fill out a survey and rate you. Then there is a phone interview where they discuss the program, ask 5 interview questions, and the units you want to work on. They then schedule you a interview with a certain unit", "Interview Questions": "Describe a situation where you went above and beyond in a situation to do something for someone?"}, {"date": "14 Sept 2022", "title": "Quality Assurance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "I applied on Monday night.  I woke up to an email requesting my availability for a phone interview within the next 2 weeks. We set a date for Wednesday at 12:15PM CST. Wednesday comes, 12:15PM passes and I call the recruiter to ask if the interview is still on, I get no answer. After 20 mins I get a call from my interviewer, she starts off by saying the wrong name of the hospital and refers to her old job. Then we start the interview, she says I see you are requesting 65K a year for this position and states that the starting pay for the quality assurance position is 39k. I inform her I would not be able to take a pay cut that substantial and we concluded the interview.", "Interview Questions": "Hello, Tell me about yourself?"}, {"date": "7 Sept 2022", "title": "HR Service Center Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health in Sept 2022", "Interview Descriptions": "Applied on their careers website and was contacted to set up a phone interview via email. The initial phone interview was confirmed and they sent over their benefits information. The actual interview was 45 minutes long and went over 5 questions related to UW Health's values. After answering the questions, I was then informed about the working environment, benefits, and salary. Once we got to the salary portion, the recruiter informed me that the midrange pay is about $9 less an hour than I currently make. I withdrew after I was informed of that. 45 minutes of my time could have been saved had the salary been posted in the job description or discussed in the beginning of the interview.", "Interview Questions": "Tell me about a time you had a difficult customer or supervisor/manager. What did you do?"}], [{"date": "18 Aug 2022", "title": "CyberSecurity Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Jul 2022", "Interview Descriptions": "I had a phone interview with the recruiter, hiring manager, and panel of three security engineers. It took about a month. The biggest problem is not that they didn't pick me. It is that they wasted my time with the 3rd interview. There is a huge disconnect between the hiring manager/recruiter and the panel of three for the 3rd interview. The reason I wasn't hired was that I wasn't technical enough according to the recruiter. Well. the problem with that is the panel of 3 asked me a total of two technical questions and one of the three didn't ask me a single question. I gave the correct answer for one of the technical questions and a decent answer for the other. They mainly asked questions about my experience and my opinion on working with people. I wondered why it was such an easy interview. The problem is I never had a chance with the panel of three. They obviously were just going through the motions. They had a completely different view of my qualifications than the hiring manager and recruiter. This position has been open for 5 months. It is obvious that the recruiter and hiring manager have not worked  \n through guidelines or the process with the panel. Which they give a blanket veto to. I don't understand why they just don't allow the panel to just say someone is not qualified by looking at their resume. Instead of wasting people's time with a third interview. Since they put no guidelines on panel for the third interview. Anybody reading this who decide to interview with IT there, should be aware of their process and lack of consideration of people's time. If you are interviewing somewhere else, don't worry about letting them know or dropping out of the process if you are leaning towards the other company. Since there is a chance they may do the same to you.", "Interview Questions": "What is the process for NPS servers and MFA for Azure? "}, {"date": "7 Sept 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in Jul 2022", "Interview Descriptions": "First interview was over the phone, very basic simple question, mostly about pay. Next interview was with the Charge Nurse of the unit, zoom interview, more complicated questions about your experience, what you learned from them, etc.", "Interview Questions": "What was one time someone was inspired by you?"}, {"date": "13 Jun 2022", "title": "Education, Optimization and Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "Interview with HR. Interview with hiring manager. Interview with Director of area. Interview with whole team. Conducted via phone and zoom. Took place over a three month period. Made it to last round. No more comments at this time.", "Interview Questions": "Walk through resume.\nManagement style"}, {"date": "19 May 2022", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Just a phone interview. Overall went pretty well. Just behavioral questions. No technical questions were asked. I had another offer elsewhere so I didn’t accept, but I think the atmosphere is pretty good.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "16 Jun 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 6 weeks. I interviewed at UW Health in May 2022", "Interview Descriptions": "I did a phone interview and they seemed very interested. It’s been over a month now and I haven’t heard anything. I’ve reached out multiple times and have got no response. Very unprofessional.", "Interview Questions": "How did you hear about UW health?"}, {"date": "14 Apr 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "The recruiter emailed me for a screening. After passing this, I spoke to the manager and then to the medical director. From there, an in- person interview was arranged with the manager and medical director.", "Interview Questions": "Tell me about yourself and why you're interested in this position."}, {"date": "13 Apr 2022", "title": "Pharmacy Technician Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "It was a 3 hour long interview for a technician supervisor position. Meeting the team was nice, however, was the 3 hours necessary? No, it should've just been a 1 hour interview between the interviewee and hiring leader. And they only hire internally too.", "Interview Questions": "If I asked your supervisor to describe you in one word, what would it be?"}, {"date": "24 May 2022", "title": "Advanced Practice Provider (PA/NP) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health (Madison, WI) in Apr 2022", "Interview Descriptions": "Three interviews over the course of a month. One with HR - very brief, one with the lead of department - also very brief,  and one with actual team. The team interview was multiple interviews with multiple team members. It took about 4 hours.", "Interview Questions": "What is your communication Style?"}, {"date": "19 Feb 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UW Health (Madison, WI) in Feb 2022", "Interview Descriptions": "The process with very streamlined and easy to follow along on their website.  Phone calls, emails and text messages were all made prior too and post interview as a means of communication.", "Interview Questions": "How do you deescalate an angry patient? "}, {"date": "31 Jan 2022", "title": "Medical Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "I first had an interview with the recruiter and then I had one with the Director. The process was easy and I would do it again. A fast process as well.", "Interview Questions": "Tell us why you are interested in this position?"}], [{"date": "27 Oct 2021", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Sept 2021", "Interview Descriptions": "I learned about the position from a contact who knew the hiring manager. I was fully qualified per the job description, so I applied. The process moved quickly. I had a screening call within a week, and then a remote interview with 6 members of the team about a week after that. The offer came in two weeks after the team interview.", "Interview Questions": "Describe your favorite pizza?\nTalk about how your decision making when handling multiple projects.\n"}, {"date": "17 May 2021", "title": "Systems Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Between the first screening with HR, to my first interview with the two supervisors and director of the department to my second interview with team members it was so seamless.", "Interview Questions": "What 3 strengths would you bring to our work team?"}, {"date": "31 Mar 2021", "title": "Student Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "Describe a time when you disagreed with a coworker \r\n\r\nTell me about a clinical experience where you provided exceptional care \r\n\r\nWhat are you looking to get out of this experience", "Interview Questions": "What do you value in a work culture? "}, {"date": "5 Mar 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "You begin with a standard phone interview followed by an in-person interview if you pass the phone interview. If you are offered the position, HR will contact you in a timely manner afterwards. Pretty straight forward hiring process.", "Interview Questions": "Asked standard scenario-based interview questions"}, {"date": "15 May 2021", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Mar 2021", "Interview Descriptions": "Short phone interview. Asked 5 questions, reviewed work history and school. Reviewed expectations for pay and training. Reviewed work experience. Discussed benefits. Reviewed software used. Wanted to know why I wanted to work there.", "Interview Questions": "How do you handle conflicts with coworkers "}, {"date": "7 Feb 2021", "title": "Nurse Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "In person interview with unit manager.  Basic questions regarding experience.  Unit tour and explanation of the role given.  Behavioral type questions asked as well. \"How do you handle stress, example of time when you dealt with conflict.\"", "Interview Questions": "How do you handle stress"}, {"date": "21 Jan 2021", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "Started with a phone screening and then did three more interviews with different people. I felt there could have been more communication on their end so I wasn't answering exactly the same questions every time. Towards the end I felt confident but I wasn't offered the job after 4 interviews.", "Interview Questions": "Describe how you handled a conflict with a coworker "}, {"date": "19 Feb 2023", "title": "Inpatient Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Jan 2021", "Interview Descriptions": "It is long and time consuming for no reason. They drag out the interviews and then the onboarding process is a few weeks later for no reason, after you have been accepted.", "Interview Questions": "Tell you about a time you worked on a team"}, {"date": "14 Dec 2021", "title": "SNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health (Madison, WI) in Jan 2021", "Interview Descriptions": "Recruiter Phone Interview- asked you four questions specific to your nursing care experience, then told you about what units had openings, then they placed you on the waiting list for a position to open", "Interview Questions": "A mistake you made in inpatient care? "}, {"date": "5 Nov 2020", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Apolied online on webdite  First was Telephonic got a call within s week and was asked  general questions about the background  education why intrested in job ...later got a call for  person interview  process was easy but coudnt take the job", "Interview Questions": "Where do you see yourself  in 5years"}], [{"date": "2 Dec 2020", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UW Health in Nov 2020", "Interview Descriptions": "The process took many months. I applied in early August, had a phone interview in September, then had to get references, then had a virtual interview with hiring managers in late November.", "Interview Questions": "Tell us about a time when you provided exceptional patient care. "}, {"date": "5 Feb 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UW Health (Madison, WI) in Oct 2020", "Interview Descriptions": "Interviewed for a Project Manager position in 2020.  From the first interview to the end of the process it was over 10 weeks.  I interviewed with 6 different teams/people including a presentation.  I found out I did not get the position through a standard rejection email from a HR System.  This was very disappointing after all the time and effort I put into my interview.  I did end up receiving a call about 2 weeks after the rejection email from the Hiring Manger who explained the reasoning.  I wish I had received the call prior to the email as I think this would have been a better experience.  \n\nAlso, I was lucky that I was interviewing while already having a job.  I could not have waited 10 weeks to find out if I got a job if I were unemployed.", "Interview Questions": "What do people who do not like you say about you?"}, {"date": "22 Sept 2020", "title": "Ambulatory RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "There were two interviews. The first was with HR and the second was with the hiring manager. They were both straight forward interviews, and I enjoyed the whole process.", "Interview Questions": "I cannot remember the questions but they were not bad"}, {"date": "14 Jul 2020", "title": "Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "Process was simple, had to do a phone interview first before i could actually get a interview. After this phone interview if you pass this, you get called in. the process honestly was quite simple", "Interview Questions": "N/A"}, {"date": "12 Aug 2020", "title": "Patient Services Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UW Health in May 2020", "Interview Descriptions": "It was a phone interview after I applied online. Took about 20 minutes and asked very normal questions, but the recruiter seemed very uninterested in what I had to say, I'm not sure if that was because my answers weren't great or because she knew due to the COVID19 situation that there would be a hiring freeze anyways. In about a week I had received an email stating that they were not hiring for anyone anymore.", "Interview Questions": "What does diversity mean to you?"}, {"date": "21 Sept 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health (Madison, WI) in May 2020", "Interview Descriptions": "Phone screen, then virtual interview, followed by in person interview. Over all the process was informative and comprehensive. I got an answer for every question and felt very comfortable. I didnt have to sit and wait for anyone to get a hold of me.", "Interview Questions": "Why do you want to work at UW health?"}, {"date": "11 Apr 2020", "title": "Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health in Apr 2020", "Interview Descriptions": "Very kind nurse recruiter, and very thorough.  He made me feel comfortable and confident in my answers.  The questions were somewhat standard interview questions.  It was important that I know my background with various patient conflicts, and interactions prior to my interview.  He was very honest in that I might not get the specialty that is my top preference, but I am hopeful.", "Interview Questions": "Tell me about a time that you provided exceptional care."}, {"date": "27 Feb 2020", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UW Health", "Interview Descriptions": "I applied on Jan 9th. About a month later, I received an email asking to schedule a phone interview with a recruiter. This phone call happened on a Tuesday. I was asked to come in for an in-person interview with the hiring manager and a HR rep the following Friday. I was contacted by the hiring manager a few hours after my in person to be brought in for a team interview. The team interview took place the following Tuesday. I was contacted the following Monday for a list of references through their survey system. I was contacted the following day with a job offer. \r\nOverall, the experience went very quickly. The recruiters and the hiring manager were very quick to respond to my questions and I felt as though the process went smoothly, aside from waiting the initial month to first hear back.", "Interview Questions": "What kind of overall health experience do you have that would help do your job in the most effective way?"}, {"date": "21 Feb 2020", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 3 months. I interviewed at UW Health", "Interview Descriptions": "Do not even bother applying to this program if you are from an out-of-state school. I had all the qualifications possible and graduated from a top 5 program in the country and couldn't get an in-person interview. Found out I got denied LESS THAN A WEEK before the in-person interviews were held. Followed up with recruiters as to why I wasn't considered and how I could improve on the application process, and have not gotten a single response.", "Interview Questions": "N/A"}, {"date": "24 Mar 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UW Health (Madison, WI) in Feb 2020", "Interview Descriptions": "First a phone interview giving basics about the job and asking basic questions about experience, strengths and weaknesses. Then a in person interview with the nurse manager and clinical nurse specialist.", "Interview Questions": "What was a time you made a mistake and what did you learn from it?"}], [{"date": "21 Jan 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "This was an intense interview  process. There were many questions that were asked quite fast over the phone with no warning after initial call. Hiring after was much more easy.", "Interview Questions": "What was a time in the past you had to work as a group to solve a problem?"}, {"date": "22 Aug 2020", "title": "Health Information Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at UW Health in Dec 2019", "Interview Descriptions": "Applied online and process took more than 8 months. Then recruiter reached out to set up a phone interview. Next was an interview with the supervisor. It took 1 week to get an offer.", "Interview Questions": "How would your current co-workers describe you personality wise?"}, {"date": "24 Jan 2020", "title": "Student Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Middleton, WI) in Sept 2019", "Interview Descriptions": "Sat down with manager and was asked behavioral questions. Also went over the role I would be in and got a tour of the building. It was very informal and relaxed.", "Interview Questions": "Talk about a time you made an impact"}, {"date": "27 Feb 2023", "title": "Associate Marketing Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Sept 2019", "Interview Descriptions": "The interview process went smoothly. Good questions by the entire marketing team. Nothing out of the ordinary. There were two additional interviews by the marketing leadership and the clinical leadership.", "Interview Questions": "Give examples of projects you've managed."}, {"date": "4 Jul 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health", "Interview Descriptions": "Initial phone screening interview with a recruiter.   Was sent a take home assignment to do. Met with the hiring manager, and two other staff in the department. Asked about my experience with statistical software and working with healthcare data.  One question about the assignment.  Follow up call with a member of HR to provide references.  Was made an offer shortly after references were checked. Took about 3 weeks.", "Interview Questions": "What experience do you have with working with health care data (especially medical coding)?"}, {"date": "3 Mar 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Jul 2019", "Interview Descriptions": "Interviewed for the clinic manager position.   The process includes a phone screen, interview with the director, followed by an interview with the team of physicians at the specific clinic. The last interview was the most stressful because of the number of interviewers.", "Interview Questions": "How to increase morale amongst the MA’s.  "}, {"date": "14 May 2019", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health", "Interview Descriptions": "2 interviews, one phone, one in-person. First interview was with HR person, second with my supervisor. Felt they really cared about what I had to say and felt very relaxed the whole time.", "Interview Questions": "What I would do in certain emergency/urgent situations"}, {"date": "11 Apr 2019", "title": "Employee Wellness Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health", "Interview Descriptions": "Very quick! Weekly interviews (including phone screening with HR) up to the 3rd interview. Final step was reference check - HR reported back that my references were \"great\" and they'd be in touch - 2 wks later was told no offer being made - Overall really enjoyed how quickly I moved along - disappointed I didn't get an offer as the org and dept seemed like a great fit and a fun place to work!", "Interview Questions": "Tell me about a time your active listening skills paid off for you"}, {"date": "3 Apr 2019", "title": "Specimen Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI)", "Interview Descriptions": "There were two rounds of interview. The first was a HR interview which provided general information and ask general questions. The second round interview was with hiring manager and was more informative.", "Interview Questions": "Many questions were related to dealing with coworkers and potential conflicts at work."}, {"date": "19 Mar 2019", "title": "Document Integrity Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health in Mar 2019", "Interview Descriptions": "Submitted application online.  It took just two weeks to get an email asking for times for a phone interview.  Phone interview took less than 30 minutes.  Waiting the next step in process.", "Interview Questions": "Tell me about the work you have been doing."}], [{"date": "23 Sept 2021", "title": "Corporate Strategy Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health in Mar 2019", "Interview Descriptions": "Submitted my resume through their online portal, and was contacted by HR. There was a preliminary 20 minute phone interview with an HR representative, then a one hour interview with hiring manager.", "Interview Questions": "Experience with data analysis and software"}, {"date": "29 May 2019", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UW Health in Mar 2019", "Interview Descriptions": "I was interviewed for a position in UWHealth's Nurse Residency Program and had a positive experience. You start off in one room with other interviewees and nurse managers for the unit you're being considered for come in and walk you to their unit, give you a tour and proceed with the interview.", "Interview Questions": "Tell me about a time when you've seen dishonesty in the workplace and what did you do about it?"}, {"date": "23 Feb 2019", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UW Health (Madison, WI)", "Interview Descriptions": "Interview process was well organized and professional. I applied via the UW website and got an email for a phone interview within a week. Phone interview asked \"easier\" level interview questions but was a full interview. Have an \"elevator pitch\" ready for both interviews because both did ask.  I was told at the end of the phone call that I would have an in person interview and set that up via email within a few days. The in person interview was with the nurse manager of the unit I was chosen for (my first choice) and another nurse. She was very professional and answered all of my questions and showed me around the unit. The interview questions were difficult but nothing too crazy, just come prepared. The nurse told me at the end of the interview that I had the job.", "Interview Questions": "What are the top 3 units you are interested in and why? "}, {"date": "1 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UW Health (Madison, WI) in Feb 2019", "Interview Descriptions": "It was quite professional they were ready for me when I arrived. The interviewer was kind and understanding about my circumstances for working at UW Hospital. My only critique is that some of the questions seemed a little intrusive.", "Interview Questions": "How would you see yourself at UW Hospital"}, {"date": "27 Feb 2019", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Jan 2019", "Interview Descriptions": "Took quite a while from application submission to interview to job offer, but staff was very polite and nice and helpful if needed. Went through phone interview, an assessment test, an in person interview, submitting references, and waiting for a call.  Was very happy when recruiter called just to give me an update on what the hold up was.", "Interview Questions": "Why I was looking for other employment?"}, {"date": "15 Oct 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "Very inviting atmosphere comfortable conversations and informative. Interviewers made the session less stressful by being very personable. Interview process only took a couple weeks. Interview or were very open about the position and what some of the difficulties in the position might look like.", "Interview Questions": "Why would you be a good fit for this job?"}, {"date": "7 Sept 2018", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health", "Interview Descriptions": "I received a call within 48 hours after applying online by HR person with asked basic screening questions, and then set up an in-person interview. The interview was held in a room where I sat around one round table across from the clinical nutrition manager and his supervisor. There were some get to know you questions and clinical based questions that weren't too difficult for an entry level position, but they also asked several behavioral based questions that were tough on the spot. I prepared beforehand and still felt thrown for a loop. Nonetheless, I was offered the job within the next 48 hours or so and I did accept.", "Interview Questions": "Tell us about a time when you broke company policy."}, {"date": "12 Feb 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UW Health (Madison, WI) in Sept 2018", "Interview Descriptions": "A bit cumbersome, but we got there. The entire team interviewed me and then I met with the VP. Then, I met with the department heads for the clinical department I'd be working with.", "Interview Questions": "Explain a time where you listened well."}, {"date": "19 Jul 2018", "title": "Specimen Control and Receiving Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Jul 2018", "Interview Descriptions": "I had a 1 hour phone interview with HR. Then I was scheduled for an in person interview scheduled for day after the phone interview. It was a behavior based interview. Describe a situation when...", "Interview Questions": "Describe scenarios where you have met all of UW Health's values and missions: Excellence, Compassion, Diversity, Accountability, Integrity, Etc."}, {"date": "21 Sept 2018", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UW Health (Madison, WI) in Nov 2017", "Interview Descriptions": "They were very professional but did not make you feel nervous. They were very responsive to any concerns you have. They let you know pretty soon after the interview if you are offered the job.", "Interview Questions": "What types of systems do you have training with?"}], [{"date": "24 Oct 2017", "title": "SNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "Phone interview first and then in person interview with the unit manager. It's pretty straight forward. Basic interview questions.  Personally I thought the phone interview was much more in depth than the actual one in person.", "Interview Questions": "What is one weakness that you may have?"}, {"date": "18 Nov 2021", "title": "Senior Histotechnologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 9 months. I interviewed at UW Health in Sept 2017", "Interview Descriptions": "Took a long time from application to interview.  Held up in HR.  Once the paperwork was delivered to supervisor, immediate interview.  Professional interview process.  Human resources was a bottle neck throughout my employment there.", "Interview Questions": "Describe an example of interpersonal adversity in the workplace, and how did you overcome it?"}, {"date": "10 Sept 2017", "title": "Emergency Room Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Aug 2017", "Interview Descriptions": "I applied on August 18th.  I was contacted on the 20th to set up a phone interview with HR. The phone interview was on the 23rd and lasted about 45 minutes to an hour. I was contacted to schedule an in person interview  on the 28th. It was scheduled for the 30th. I had the ER tech hiring manager and a nurse interview me for about an hour. I was contacted by HR for references the next day. My references were complete on the 5th of September and am still waiting to hear, but they will contact me either way.", "Interview Questions": "What is one thing your experience on the ambulance service brings to the ER that you think is very important for an ER tech to be able to do?"}, {"date": "8 Nov 2017", "title": "Purchasing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UW Health (Madison, WI) in Jul 2017", "Interview Descriptions": "HR screening first interview. They essentially recite everything off of your resume. Not a very effective use of time. Seemed extremely interested in my skill set and experience and promised followup, but refused to respond in a timely manner.", "Interview Questions": "Tell me about a challenge in your career ? "}, {"date": "19 Jun 2017", "title": "Nursing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at UW Health", "Interview Descriptions": "Invited to attend a job fair for nurses in the Spring. Submitted a resume online for review. Several nurses were having interviews with other recruiters in the conference room at once.", "Interview Questions": "What was the most rewarding experience you have had as a nurse?"}, {"date": "22 Aug 2017", "title": "Emergency Department Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in May 2017", "Interview Descriptions": "The interview was short-only about 25 minutes with a tour at the end. If your education meets the requirements of the job, the rest of this position can be learned.", "Interview Questions": "Do you struggle to work in environments where multitasking is a must?"}, {"date": "27 Nov 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in May 2017", "Interview Descriptions": "Initial phone screen followed by a 1:1 interview with nurse manager. Relatively straight-forward interview, no curve balls. Typical interview questions, professional yet comfortable setting. References were checked after the interview and asked to complete a brief online survey.", "Interview Questions": "Describe a time you had a conflict with another employee and how did you handle it?\r\n\r\n\r\n"}, {"date": "9 Apr 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UW Health", "Interview Descriptions": "Phone interview with a member of HR, followed by two face to face interviews, one with the hiring manager and another with a few team members that you will work with on a daily basis.  A skills test was also included in the interview process during the first face to face interview with the hiring manager.", "Interview Questions": "How do you work with other people"}, {"date": "8 Mar 2017", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "First phone interview was done 2 weeks prior to second interview. The second interview was an in-person interview with the Nurse manager and a panel. Everyone was very friendly and accommodating with scheduling the interview to work around college class schedule.", "Interview Questions": "Why UW Hospital?"}, {"date": "21 Jan 2017", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "I applied online. The interview was lovely, they were so kind. They explain the work process very well, but I did not do my best. They send me a negative respond after 3 weeks.", "Interview Questions": "what do you do when two coworkers have a conflict?"}], [{"date": "21 Dec 2016", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UW Health (New York, NY)", "Interview Descriptions": "Everything went smoothly and fairly quickly until after I had my phone and in person interview. It has been 5 1/2 weeks and I'm still waiting to see if I got accepted.", "Interview Questions": "What is something you can improve on?"}, {"date": "10 May 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Dec 2016", "Interview Descriptions": "I applied online and provided several references. After my references had responded they went ahead and scheduled a phone interview. The phone interview included many structured questions and was conducted by someone in HR. I was then contacted and went in for an interview with the Nurse Manager. She was very friendly and more casual than the phone interview.", "Interview Questions": "What is one way you innovated in your former workplace? "}, {"date": "19 Nov 2016", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at UW Health (Madison, WI) in Nov 2016", "Interview Descriptions": "Applied online, contacted by HR to set up phone interview, phone interview with Nurse Recruiter, in-person interview with Nurse Manager. Offered position 2 days later. The only part that surprised me was that they asked that I give them a decision in 24 hours--a little too soon to make such a big decision.", "Interview Questions": "Name a time that you have experienced dishonesty in the nursing profession"}, {"date": "4 Apr 2017", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at UW Health (Madison, WI) in Sept 2016", "Interview Descriptions": "Four individuals interviewing. Seemed pleasant and friendly. None of the questions were too surprising or difficult. I don't think they would have been a very fun group of people to work with. I was also turned off by the poor appearance of the building, poor location, bad parking.", "Interview Questions": "D you have experience developing marketing plans? "}, {"date": "15 May 2016", "title": "Learning Technologies Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in May 2016", "Interview Descriptions": "First phone interview, then 1:1 with hiring manager, then interview with a group and a 20 minute presentation. Everybody was very kind and professional even though I had a technical error during my presentation. I am still waiting to hear back as to whether I got the job more than two weeks later. I would really like to work with this group of people.", "Interview Questions": "What special talents do you bring to this role?"}, {"date": "7 Apr 2016", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UW Health (Madison, WI) in Mar 2016", "Interview Descriptions": "People were friendly and welcoming, and the interview process was fairly standard – screening with HR, followed by an interview with the manager, followed by a presentation to selected members of the team.", "Interview Questions": "What is your definition of patient-centered care?"}, {"date": "3 May 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at UW Health (Madison, WI) in Mar 2016", "Interview Descriptions": "The interview was very easy, already was an NA, I already knew the nurse manager and CNS (who were both in the interview with me) more like a formality than an interview", "Interview Questions": "Conflict resolution"}, {"date": "19 Apr 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UW Health (Madison, WI) in Feb 2016", "Interview Descriptions": "The interview went well.  I met with the unit manager and two CNS's.  They asked basic questions and nothing too difficult.  I ended up not getting a position, which was dissappointing, but what was more frustrating was the fact that HR took way longer than expected.  I ended up having to call them a ton of times before anyone got back to me.  They had no constructuve feedback and all they could say was \"we loved you and there was nothing you could do better we just dont have the number of positions\".", "Interview Questions": "Tell me about your self"}, {"date": "15 May 2018", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Feb 2016", "Interview Descriptions": "It took about 45 minutes. It was conversational and not too intimidating. I went in for 1 interview and was hired the same day.  She was very open and the questions were stereotypical interview questions. Be prepared to park in the parking garage but they compensate you with a parking pass for the interview day.", "Interview Questions": "How do you respond to authority? "}, {"date": "24 Feb 2016", "title": "Data Warehouse Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UW Health (Madison, WI) in Feb 2016", "Interview Descriptions": "I talked on the phone with an HR rep for a half hour. I talked on the phone with a director, for a half hour. I then had a 4 hour interview with 9 different people, including the director I talked to on the phone. At one point in the interview, I discovered that they are starting an interview process for the manager position I would be reporting to had I got the job.", "Interview Questions": "Do you have Informatica experience? "}], [{"date": "27 Jan 2016", "title": "Preventionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health (Madison, WI) in Jan 2016", "Interview Descriptions": "Applied online, response from HR to set up on site interview took 1-2 weeks. Had 3 hour interview with 3 different groups, the hiring manager, the directors, and the people I would work with. Very informative, and relaxed. Sadly, it appears that although everyone was supportive and encouraging, I was an interviewee needed to meet a quota or invited under other pretenses. It is strange to have all interviewers support you, invite you because of your qualifications that they want, and have great interactions with them, only to be rejected very quickly. Very disappointing they wasted my time, very unprofessional. Likely my last application with this company.", "Interview Questions": "Describe an accomplishment you are most proud of. "}, {"date": "10 Jan 2018", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in Jan 2016", "Interview Descriptions": "One phone interview, and one in-person interview which was very straightforward. The phone interviewer just asked a few basic questions and made things very easy and comfortable, they asked preferences and other types of hours/experiences that you would be interested in", "Interview Questions": "What do you look for in a manager"}, {"date": "26 Nov 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at UW Health", "Interview Descriptions": "Phone interview with recruiter, in-person interview with direct team, 2nd in-person interview with direct supervisor and introduced to senior management. All interviews were held within three weeks and an offer was made within a week after final interview.", "Interview Questions": "Various of open ended questions."}, {"date": "10 Dec 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health (Madison, WI) in Oct 2015", "Interview Descriptions": "Their first interview is a phone interview, set up in advance via email. The HR person was simply a gatekeeper for a plethora of hiring managers. The position was still posted (and remained posted for at least a month after this interview).", "Interview Questions": "Q: Have you ever been asked to leave a job? (meaning, I suppose, have you ever been fired without being fired)."}, {"date": "2 Sept 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health (Madison, WI) in Aug 2015", "Interview Descriptions": "I applied for the general Nursing Assistant position via their career website. A few weeks later, I received an email asking me to call them within 10 days if I was still interested in the position. I called and answered a few questions regarding how many hours I wanted to work per week, etc. During that phone call, I was scheduled for a phone interview with a recruiter for the next day. That phone interview went into a bit more depth about why I applied for the position, strengths, weaknesses, how I deal with conflict, preferred areas to work in, etc. I was able to ask questions as well. At the close of the phone interview I was told I would now be put into a pool that hiring managers from the specific departments could access. I was told I would hear back from a hiring manager within a few weeks, and that I would set up interviews with hiring managers directly. Later that day, I got a call from a hiring manager to set up a face to face interview in a specific unit at the hospital. That interview/unit tour lasted about an hour, and I was able to meet NA's and RN's that worked on the unit. Later that day, I was contacted via phone and email for a reference check. I was able to enter all of my references (you need at least 4) electronically, and they were all able to submit their references online. A week later, I was offered the job.", "Interview Questions": "How many hours do you want to work per week?\r\nGreatest strength?\r\nGreatest weakness?\r\nTell me about a specific time you had to deal with conflict with a co-worker/patient/customer."}, {"date": "13 Jun 2017", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Aug 2015", "Interview Descriptions": "It was very quick. I applied, interviewed, and received the job within 1 week. However my start date was almost 2 months later. New hires are required to go through 1 week of orientation where you learn the scheduling system and processes and well as other typical new hire orientation things", "Interview Questions": "Why did you choose to apply at the UW?"}, {"date": "20 Jul 2015", "title": "Clinical Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health in Jul 2015", "Interview Descriptions": "Got a phone interview call within 3 days of submitting an online application. HR interview for about 45 minutes. It was fairly easy and smooth. I was scheduled for one hour phone interview but it was fast paced. I was given the opportunity to ask questions at the end of the interview but the answers I got were not very clear. Overall a good experience.", "Interview Questions": "Standard HR questions about strengths, difficult situations at work etc."}, {"date": "6 Jul 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in Jun 2015", "Interview Descriptions": "Applications all go through their online database. I had filled out about 50 online applications for different CNA positions. Then about a month later they posted a rolling general CNA application, and I received an email invitation for a phone interview about a week after applying to that. Getting in contact with the phone interviewer for scheduling was difficult. I received her voicemail twice a day for an entire week, before getting fed up and calling the general HR line. I told them that I was struggling to get ahold of her and they transferred me to another person to schedule it. The phone interview was pleasant. They have a few situation interview questions, but also are very interested in what you are looking for. At the end of the interview she asked what departments I was interested in and matched me with a department I liked that had a spot open for an in person interview. That department was very prompt in contacting me, and the interview was also very pleasant. It was mostly informational, with a few situational questions and questions about my personality. After that is over they ask for 4 references by way of an online survey. It is very easy to do, and you can even see a copy of the survey that they send. Less than a week after submitting the references I was offered the job!", "Interview Questions": "Was there ever a time when you experienced a conflict with a coworker? What was it? and how did you handle it? "}, {"date": "9 Apr 2015", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at UW Health", "Interview Descriptions": "I've been employed as a Nursing Assistant with UW for the past 2 years and they didn't even offer me a face to face interview.  I had a phone interview, but that's it. They provided me with tuition reimbursement for nursing school, yet made no effort to retain me as an RN.  I had good reviews from my fellow staff and the registered nurses I worked with.  They never provided me with a valid reason as to why i didn't receive a unit interview.", "Interview Questions": "Explain a conflct you've had with a co-worker, how did you respond?"}, {"date": "29 Jun 2015", "title": "Administrative Assistant - Employee Health/Infection Control Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in Apr 2015", "Interview Descriptions": "I applied online, and had a very general phone interview with an HR person, who simply covered what the company does and asked questions about my background. This was basically a phone screen. \r\n\r\nAfter that, I moved onto a phone interview with the hiring manager, who asked me (somewhat repetitive of former questions) about my background, what I liked/disliked about my previous experiences, etc. It was a pretty laid-back interview. Afterwards, I got a voicemail asking to call back about scheduling an interview, but the position ended up being filled before I scheduled anything. \r\n\r\nOverall, it seemed like a nice place to work (from the benefits packet and job description they sent me by e-mail), and the hiring manager made me feel relaxed and comfortable on the phone.", "Interview Questions": "Tell me about a time that you and another co-worker disagreed - how did you solve the issue? What was your favorite and least favorite responsibility from your last position? Etc."}], [{"date": "7 Nov 2016", "title": "IT Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at UW Health (Madison, WI) in Aug 2014", "Interview Descriptions": "Phone and panel interview.  CIO had no clue what technology is used for, very surprising to me.  The CTO was more in touch with management and reality but he was let go when I joined the organization.", "Interview Questions": "Non-work related.  Mostly concerned if I ever fired anyone."}, {"date": "19 Apr 2017", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Jun 2014", "Interview Descriptions": "Online test at time of online application, Phone interview, in person interview. The process as a whole took about two months. After all the interviews it took approximately 2 weeks to receive an offer in which I accepted.", "Interview Questions": "Describe a time that you had a conflict with another employee. How did you resolve the situation and what did you gain from it?"}, {"date": "24 Apr 2014", "title": "Clinical Applications Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UW Health (Madison, WI)", "Interview Descriptions": "Met with the manager and supervisor of the department. Was asked about my qualifications for this position, why I felt I was a good candidate for this job. Then met with several members of the staff that made up the team. They each read from a script of questions on my qualities, what did I like about Epic, what project did I implement at my current job, whether I had any questions for them regarding the job.", "Interview Questions": "What policy or project did I implement at my current position"}, {"date": "10 Feb 2014", "title": "Network Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UW Health", "Interview Descriptions": "One phone interview.  An in person interview with a group.", "Interview Questions": "Diagram an usual part of your current network."}, {"date": "9 Feb 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health", "Interview Descriptions": "First received phone interview that lasted over 45 minutes.  Was told of multiple openings and asked where I could see myself fitting best.  Next day received call for interview at current clinic, interviewed with clinic manager and returned for two additional times to meet with various staff and the Dr. whom I would be primarily working with.  Within one week of my first interview, was told that I was being offered the position, played some phone tag and eventually received the paperwork with the formal offer.", "Interview Questions": "Standard interview fare, no unexpected questions - a lot of asking for examples of work experience which was difficult because this was my first job in this field of work.  I was able to draw on life experience and prior work and volunteer examples."}, {"date": "23 Jan 2014", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UW Health", "Interview Descriptions": "Extremely long interview/hiring process. Multiple interviews with many different groups and individuals. Took a long time from initial phone interview, in person interview process, and actual job offer.", "Interview Questions": "Personality test-online. Very difficult. "}, {"date": "23 Mar 2018", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UW Health in Jan 2014", "Interview Descriptions": "Met with the Supervisor and Manager, they asked questions about past employment and qualities and situational questions...what would you do if you had a problem with a co-worker...how do you handle tense situations...etc. They are just trying to gauge if you would make a good fit. They already know what qualifications you have from your application and phone interview. You just have to impress them with your professionalism.", "Interview Questions": "What qualities do you possess that would make you a good candidate for this position"}, {"date": "20 Jan 2016", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UW Health (Madison, WI) in Nov 2013", "Interview Descriptions": "HR Phone Screening - Initial call from HR to get my background and see if I would be a possible match for the qualifications.\r\nPhone Interview with Supervisor and Manager - more in-depth conversation with supervisor and manager. Specifics of job were shared.\r\nIn Person Interview with Supervisor, Manager and Team- met with 10 member team plus manager and supervisor. Interview consisted of each person asking questions around the table until no more questions were left to ask. I then was allowed 15 minutes to pose my own questions.", "Interview Questions": "What do you do to raise the bar for others?"}, {"date": "12 Sept 2013", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UW Health", "Interview Descriptions": "I was hired into the Nurse Residency program after working as a nursing assistant. Moving from NA to RN was easy - they like to grow their ow. Getting the NA position on the first place was very difficult. It took several weeks to hear back from HR after my interview.", "Interview Questions": "How would you respond if you foud you had made a mistake with a patient's medication?"}, {"date": "27 Mar 2014", "title": "Finance Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at UW Health in Apr 2013", "Interview Descriptions": "Only one round of interview but interviewed by 2 people separately. Interviewers are really friendly. Ensure you are willing to commit till summer semester before you apply for the job. They require at least a year of commitment to the job. They basically asked questions about yourself and your skills. They would also like to know how you can contribute to the department with the skills described.", "Interview Questions": "They asked about what my previous employee will praise about me"}], [{"date": "28 Jun 2014", "title": "Specimen Receiving & Control Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in Apr 2013", "Interview Descriptions": "Resume/CV required, plus a short application regarding work and education experience.  Two online tests also come with the application- a personality test and a data entry test (typing people's names, DOB, phone number, ect).  \r\n\r\nShort phone interview mostly asking why you're interested in the position and making sure you can physically and logistically meet the requirements of the job (can you work these hours, can you be on a weekend rotation, can you lift 50 pounds, ect).  \r\n\r\nIn person interview is next- mostly behavior based questions \"tell me about a time you were frustrated with a coworker\", \"what would you do if you saw someone violating hospital policy\".  \r\n\r\nFinally, they do ask for a lot of references to check (and they do check them all).  I was asked for 4-5.  However, you are allowed to use peers at previous jobs as references.  They only require 1-2 supervisory or academic references.\r\n\r\nWhen accepted, they require a background check, drug test, TB test, and a checkup with Employee Health.", "Interview Questions": "A question was asked regarding customer service- \"tell me about a time a customer was not happy with your service and what you did\".  While this question applies to the job (interacting with physicians and nurses looking for results), as someone with mostly lab-related experience, I was lost for an example."}, {"date": "24 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at UW Health (Macon, GA) in Jan 2013", "Interview Descriptions": "The interview process was very normal. The coordinator gave me a call to set up an interview and the interview  was a good and very relaxing. I got a call for an offer about 2 to 3 days later.", "Interview Questions": "Just typical questions: why do you want to work for us? What are your strengths and weaknesses?"}, {"date": "27 Jul 2012", "title": "Human Capital Development Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UW Health (Middleton, WI) in Jul 2012", "Interview Descriptions": "1. Phone screening with hiring manager.  About 20 minutes.  Asked about how I would typically develop a training course.\r\n2. Asked to develop a 25-minute training presentation and come in for interview.\r\n3. Training presentation to about 15 people followed immediately by in-person interviews with hiring manager and 6 other people (mostly one-on-one, but some group as well).\r\n4. Phone message about 2 weeks after interview -- not selected for position.\r\n\r\nFriendly and relaxed approach by all interviewers.  No behavioral interview questions.", "Interview Questions": "What is your philosophy on Organizational Development?"}, {"date": "13 Jun 2012", "title": "Telehealth Program Special Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in May 2012", "Interview Descriptions": "I faced 2 rounds of interviews for 2 positions I had applied to. First was Human resource recruiter and second one with hiring manager. They asked me about my background, why i wanted to work there, how was I a good fit for their company, what would your previous supervisors tell us about you if I called them, What do you consider positive work environment behavioural questions like tell me one challenging situation you faced and how you handled it, tell us about characteristics of good and bad teams that you have worked on and how have you handled the bad team  performance based questions, tell us about an idea that was implemented etc.\r\nthey were friendly to talk to, giving positive reinforcements.", "Interview Questions": "tell us about an analysis that you did and the end result of that analysis"}, {"date": "20 May 2012", "title": "Workstation Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at UW Health (Madison, WI) in May 2012", "Interview Descriptions": "Long process, phone interview was typical HR questions lasted 1 hour. Group interview with Manager and Lead 1 hour with minor tech questions. 1 group interview with team and managers. The HR process requires electronic reference verification with 5 references. I feel like there is too much red tape.", "Interview Questions": "Why do you want to leave?"}, {"date": "17 Apr 2012", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UW Health (Madison, WI) in Oct 2011", "Interview Descriptions": "I applied there like 3 times and didn't get response. I decided to called HR and was told to keep continue to apply because there are just too many applicants out there. Finally, got a called from HR and did a phone interview, then went in for a face to face interview.  It was two hours long and it took about 2 months from the initial interview to the hiring date.", "Interview Questions": "What does accountability means to you?"}, {"date": "6 Nov 2011", "title": "Diabetes Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UW Health (Madison, WI) in Aug 2011", "Interview Descriptions": "I applied online and received an email to set up a phone interview. The company also asked for email addresses of several references so that they could email on online reference tool to them. I was told by a few of my references that the form was not easy to complete. The phone interviewer seemed unfamiliar with my resume. She asked me questions that referred to degrees or jobs that I never claimed to have, so I had to correct her repeatedly (to avoid being in an unethical situation). It was uncomfortable.", "Interview Questions": "What attributes are you looking for in an organization or a job?"}, {"date": "21 Jul 2011", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UW Health (Madison, WI) in Jul 2011", "Interview Descriptions": "I first had an hour phone interview with HR . Typical  questions: strengths/weaknesses, what would your current manager describe you, tell me about a time you ...\r\nThen hour team interview with directors/supervisors.\r\nFinally hour interview with the team.", "Interview Questions": "tell me how you solve problems"}, {"date": "28 Mar 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UW Health (Madison, WI) in May 2011", "Interview Descriptions": "Easy on line application process. HR does initial interview and then a manager calls to interview.", "Interview Questions": "They do behavioral interviewing. Typical questions."}, {"date": "30 Jun 2010", "title": "Senior Marketing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UW Health (Madison, WI) in Jun 2010", "Interview Descriptions": "Received call back two days after applying. Phone interview took place less than a week later. Typical HR interview with \"tell me about a time you...\" Rejection email sent less than one week later.", "Interview Questions": "Tell me about a time you worked on a team with someone who was difficult to work with."}], [{"date": "1 Jul 2014", "title": "Server Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UW Health (Madison, WI) in Jan 2010", "Interview Descriptions": ".Not bad, easy, quick.  Applying can be a waste of time due to hiring internally.    Positive interview experience.  Positive bennies and ok salary.  Job security is only ok because there is no true security.", "Interview Questions": "N/A"}, {"date": "20 May 2011", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UW Health (Madison, WI) in Jan 2010", "Interview Descriptions": "1h presentation, 1:1 interview", "Interview Questions": "what is your career goal"}, {"date": "28 Apr 2013", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UW Health (Madison, WI) in May 2009", "Interview Descriptions": "I applied online and immediately had to take an online test regarding basic nursing aide skills.  (Ridiculously easy, seriously basic common sense)  A couple of weeks later, I was contact by HR for a phone interview.  This was also very easy, mainly just asking what I was looking for and telling me what position are available.  At the end of the interview, she informed me that my name would be passed along to the hiring manager for the specific department in which I wanted to work.  I was called back days later to set up an in-person interview with this person  That interview was also easy.  Very basic questions, like slow-speed softballs.  That was it.  A week later I was notified that I got the position provided I could pass a drug/2-step TB test and provide copies of my certification.  It was all very basic and easy.", "Interview Questions": "None.  Everything was expected."}]]