[[{"date": "3 Oct 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC)", "Interview Descriptions": "Very long. Took a long time to get feedback along the way and I found it frustrating. There should be more follow-up along the way for candidates in the process.", "Interview Questions": "Describe your experience managing projects and teams."}, {"date": "25 Jul 2022", "title": "Senior Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pact (Washington DC)", "Interview Descriptions": "It took 3 to 4 months to go through the whole interview process, which involved three separate interviews. All the people involved were nice, respectful and polite, and it has been an overall pleasant experience.", "Interview Questions": "Interview questions were not hard and mostly focused on how the previous experience would apply to the new role, how would I impact Pact, etc. "}, {"date": "21 Feb 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 7 weeks. I interviewed at Pact (Washington DC)", "Interview Descriptions": "The interview process was straight forward. Mainly techincal questions. For example, describe how you \tcontributed to substantive designs of new programs and contributed to the development of new program ideas.", "Interview Questions": "Describe how you contributed to substantive designs of new programs and contributed to the development of new program ideas."}, {"date": "12 Jan 2022", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Pact (Washington DC)", "Interview Descriptions": "The interview process was clear and took place quickly. I had three rounds of interviews and received an offer within one month. Dealing with HR was the most complicated part, and HR is still my biggest complaint with the organization.", "Interview Questions": "Questions relevant to the position"}, {"date": "20 Feb 2022", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC) (Washington, DC) in Jan 2022", "Interview Descriptions": "They were straight to the point, asked very good questions about previous experience and how my experience would add value to new role. Two stages of interview, waiting on final results.", "Interview Questions": "How would you describe yourself in a team?"}, {"date": "24 Aug 2021", "title": "Monitoring and Evaluation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pact (Washington DC)", "Interview Descriptions": "It was great although feedback was delayed a little bit but eventually it was provided. The interview process was systematic and was conductes virtually except for written paper which was required to attend physically.", "Interview Questions": "Just concepts of M&E and about the project."}, {"date": "8 Jan 2021", "title": "Senior HR Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pact (Washington DC)", "Interview Descriptions": "Great objective process and good learning experience. Interviews included discussion with country leadership that were very practically relevant to role. This was a commendable and objective process clearly aimed at identifying the best candidate", "Interview Questions": "How my experience would improve the role "}, {"date": "31 Jan 2022", "title": "Contracts Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pact (Washington DC) in Dec 2020", "Interview Descriptions": "The interview process was fine. I didn’t hear anything about the outcome at all. There was a complete silence. I followed up multiple times with the recruiter but no response so I moved on.", "Interview Questions": "Normal and hypothetical interview Questions "}, {"date": "21 Jul 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Pact (Washington DC) (Washington, DC)", "Interview Descriptions": "Long process - 7 rounds. Multiples of one on ones and group interviews. One of the regional VPs was not interested and found the whole thing to be a chore. Granted the process was too long.", "Interview Questions": "What experience do you have with USAID proposals?"}, {"date": "13 Feb 2021", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC) in Nov 2018", "Interview Descriptions": "I was called in for the interview.  First, there was a written test on practical and technical knowledge. Directly after the written test, I was interviewed by three senior staff.", "Interview Questions": "When last did you experience stakeholder conflict and how did you resolve it?"}], [{"date": "23 Oct 2018", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC)", "Interview Descriptions": "Deplorable process. I spent hours preparing for a practice interview and then, a video interview and received no feedback \"at all\", not even a \"thank you for submitting your interview, but we're considering other candidates\" bot e-mail. This made me never want to even consider this organization for anything, ever again. I was extremely disappointed that they didn't treat my time as even worthy for a simple, brief e-mail letting me know that I'm no longer being considered.", "Interview Questions": "Tell me about why you're interest in Pact. "}, {"date": "8 Jul 2018", "title": "BD Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pact (Washington DC)", "Interview Descriptions": "Phone screen followed by in-person interview. Met with a potential reportee and a peer from the foundation side. They had 2 sheets of paper, double sided with questions; I believe they asked me all of them. I followed up with thank you notes and then with HR a few weeks later and haven't heard back.", "Interview Questions": "Talk about a difficult proposal and what you did. "}, {"date": "11 Jan 2018", "title": "Technical Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Pact (Washington DC)", "Interview Descriptions": "Very long, six interviews, \"it takes a village\" -- Some in person, panel. Some on Skype. Confusion about who would be the position's supervisor, that person unknown due to restructuring. When identified, not interested in interviewing me though an offer was made.", "Interview Questions": "Would you be comfortable traveling 40+%?"}, {"date": "18 Feb 2018", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pact (Washington DC) (Washington, DC) in Jan 2018", "Interview Descriptions": "I applied online and received response from HR expressing interest about a week later. Was then told that I would be sent a link to an online video screening tool, but link was not sent. I had to follow-up to get the link. I then submitted my video interview, which was quite frankly a very poor way to assess my character or abilities. They give you less than a minute to answer questions about your experience and some more obscure questions (to test if you are able to think on your feet?) \r\n\r\nI heard nothing, received no confirmation of receipt of this video submission. I had to follow-up, the HR person said they would check that day, but never responded. I had to follow-up yet again asking flat out if I was still being considered or if they moved on. The HR person responded saying they \"went a different direction.\" I moved on, but then oddly received a message weeks later again saying that I was not selected for further interview.\r\n\r\nDuring this process, I asked the HR person when I would get a chance to talk to a person to learn more about the role and ask questions, and he said it would be on the phone but not much due to proximity to the holidays. Long-story-short, that short  ineffective video screening tool is the only interaction I was able to have, and it was only one-sided. So I did not get to talk to anyone or converse like a human to learn about the role and get a good feeling of cultural fit.", "Interview Questions": "How would you describe the color yellow to a blind person?"}, {"date": "4 Oct 2017", "title": "Supply Chain Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC) (Johannesburg) in Sept 2017", "Interview Descriptions": "first it was telephonic interview, and after five days i was invited for hiring day that's where we did presentation and face to face interview , now I'm waiting for their response", "Interview Questions": "leadership roles "}, {"date": "27 Jan 2017", "title": "Senior Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC) (Washington, DC) in Nov 2016", "Interview Descriptions": "I had an interview with 3 current staff members, two based in Washington, D.C. and one in a field office. The interview lasted less than 1 hour and was conducted over Skype audio.", "Interview Questions": "I was asked about my language proficiency and asked to speak in this language to demonstrate my skill."}, {"date": "15 Nov 2016", "title": "Pricing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Pact (Washington DC) (Washington, DC) in Jul 2016", "Interview Descriptions": "It was a Skype interview with regular questions about strengths, weaknesses, professional career, etc. It was efficient because it was with the whole team. After two weeks they send me an excercise to create a budget and answer some questions regarding cut costing and project finance. Unfortunately I never heard back even if I wasn't selected a short e-mail can help close the process.", "Interview Questions": "What was the biggest conflict I ever had and how did I solve it?"}, {"date": "14 May 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC)", "Interview Descriptions": "Interview was very simple. No complicated behavioral questions just asking about prior relevant experience. Hiring process was very quick. From applying to hired was probably 3 weeks. I heard two days after sending in application, interviewed just a few days following.", "Interview Questions": "How comfortable are you with writing a budget or proposal?"}, {"date": "3 Dec 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Pact (Washington DC)", "Interview Descriptions": "At that time it took only about 3 weeks. Now much longer process. I interviewed in person and with managers overseas by Skype. Very engaging and passionate. They were interested in the way I do this as well as what I do.", "Interview Questions": "Interesting and engaging, not the usual predictable questions."}, {"date": "4 Feb 2018", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pact (Washington DC) (Washington, DC) in Dec 2015", "Interview Descriptions": "Phone screen with hiring manager + 2 interviews with difference panels, including team that I would be working with. Fairly straightforward questions on both interviews - standard \"tell us about you\" and \"why are you interested\" questions. Nothing special to prepare for. Interview room was very hot! Workplace dress is business casual and would be fine to wear slacks + blazer instead of suit. First interview will be with relatively junior staff regardless of position you are going for.", "Interview Questions": "How do you show passion in your work?"}], [{"date": "13 Nov 2015", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pact (Washington DC) (Washington, DC)", "Interview Descriptions": "Interviewed by several people related to my position. The interview process was very normal with nothing unusual. I was expecting more updates from their recruitment staff on the status along the way.", "Interview Questions": "Experience, education, fundraising capacity, passion, network, reporting. The usual questions."}, {"date": "5 Jul 2018", "title": "Capacity Development Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Pact (Washington DC) (Saint Mary of Wd, IN) in Aug 2015", "Interview Descriptions": "It was simple and last about  more than 45 minutes online.  Panel group was very  nice and kind. However, it was totally in english and I am a francophone person. Then, they did their best to be not too much fluent and to adjust the rythm and their speech. \r\nCorrespondence inviting me to interview-Interview with the HQ-Request of personnal information like Biodata and salary history-Reference", "Interview Questions": "What do you know about Capacity development approach"}, {"date": "22 May 2014", "title": "Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Pact (Washington DC)", "Interview Descriptions": "Hiring process is LONG. This could be much more efficient. This is commonly referred to as the \"Pact gauntlet\" --- there are way too many people involved and this takes too long to be competitive.", "Interview Questions": "predictable questions"}, {"date": "28 Aug 2013", "title": "Technical Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pact (Washington DC)", "Interview Descriptions": "This was a rather frustrating process, however I did apply during a season of sequestration. The interviewing process is not very streamlined, I went through 6 interviews only to be notified of a hiring freeze.", "Interview Questions": "The questions were pretty standard behavioral questions (strengths/weaknesses, tell me about yourself)"}, {"date": "12 Mar 2013", "title": "Health Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pact (Washington DC)", "Interview Descriptions": "I applied through the online system and was contacted by a recruiter. I interviewed with the recruiter, with a field team, and with the HQ health person. It was a very friendly process. The recruiter went out of her way to be nice, and all the people I talked to were nice.", "Interview Questions": "They asked a lot of very specific questions about how I handled problems in the past, the \"tell us about a time when you...\" type questions. "}, {"date": "1 Oct 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Pact (Washington DC) (Pretoria, Gauteng) in Feb 2013", "Interview Descriptions": "Called in for interview at the local country office.  Simply sat with interviewer who reviewed CV and asked fairly general questions.  Overall, not a bad experience, very informal.", "Interview Questions": "What will you bring to the table?"}, {"date": "5 Jan 2014", "title": "Resource Development Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pact (Washington DC) (Washington, DC) in Jan 2013", "Interview Descriptions": "Interviewed with six different people, including Skype interviews with the field. I was one of two candidates to make it to the final round, and though they had given a deadline for decision, suddenly said they were opening it up to new candidates and dragged the process out further. Everyone I spoke to was great, and the work culture and atmosphere seemed appealing, but I thought the end game was in poor form. I didn't get a personal note from the hiring manager and had to be the one to follow up to learn they'd gone in a \"different direction\".", "Interview Questions": "What would you do if I asked you to raise a million dollars this year?"}]]