[[{"date": "12 Jan 2023", "title": "Communications Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "Was offered a virtual interview but it was a slow process - took a long time to get it organised and to hear anything back. Interview itself had a small task followed by questions. The interviewers weren’t great - they didn’t ask any follow up questions to what I said, and all spent a lot of the interview taking notes.", "Interview Questions": "How would you describe the World Food Programme to someone who hadn’t heard of us?"}, {"date": "2 Sept 2022", "title": "Junior Research Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at World Food Programme in Aug 2022", "Interview Descriptions": "Whole processes included some short answer questions and a written exam; followed by a panel interview. Most questions were hypothetical ways of working. Emphasis on being able to think and react quickly with little info.", "Interview Questions": "How would you resolve a situation where your co-workers was not assisting with an assignment you share? \r\nHow do you prioritise busy and demanding workloads?"}, {"date": "4 Jun 2022", "title": "Communications and Advocacy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "CV and cover letter was submitted a few months before I was offered an interview. Interview asking relevant questions to the job role. Then I needed to complete a written test again relevant to the role and social media.", "Interview Questions": "Name your favourite advocacy campaign and why?"}, {"date": "11 Feb 2022", "title": "Roster - Programmer Policy Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "Five rounds of interviews followed by a cross-check of references and the like. First interviews are exams or automated with video recording, the final one in person. The interview varies sensibly every year, there is no specific content to be prepared. Internal people have a clear advantage as they know the details of the operations", "Interview Questions": "How would you structure Programme Cycle?"}, {"date": "15 Nov 2021", "title": "Government Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Food Programme", "Interview Descriptions": "Short 30 minute interview, mixture of usual experience/ competency based questions with the addition of current affairs questions (e.g. mine was to do with UK aid funding cuts). Followed immediately by an hour written work-based scenario test.", "Interview Questions": "The WFP is not that known in the UK. Therefore how would you describe the WFP mission to people in the UK?"}, {"date": "29 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "Applied and got an invite 2 months later. Was a panel interview and each member asked a question . Questions mainly technical and not about who I am and my experience.", "Interview Questions": "Why are you suited for this role? \r\n"}, {"date": "19 Oct 2020", "title": "Government Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "Even though the application was made on time, the organisation never picked any interns; the online webpage states 'reviewing all applications' for 2 months after the suggested start date for the position. The office is reachable by neither phone or email.", "Interview Questions": "N/A"}, {"date": "24 Nov 2020", "title": "FIT Talent Pool - Partnerships (P2) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme in May 2020", "Interview Descriptions": "I had to submit a recorded video interview as a second stage of the application process (first stage was a multiple choice and essay one month prior to video interview). The video interview was about 40 minutes' long during which time I had to have my video switched on and answers were automatically submitted according to a timer. I had about 5 minutes per question. Questions I was asked are below.", "Interview Questions": "Would you accept a position in a hardship location? Please say Yes or No and explain why. "}, {"date": "29 Aug 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at World Food Programme in Apr 2019", "Interview Descriptions": "Short phone call. Network to get your CV flagged as they interview 3 people per post and do not look at most CVs. To that end, do not intern with WFP until you conclude your studies if you return to school and afterwards it is far more difficult to get your foot back in the door even with amazing performance bc of HR rules.", "Interview Questions": "Why do you want to work at WFP?"}, {"date": "6 Mar 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Food Programme (London, England)", "Interview Descriptions": "I applied online, then an interview, they asked about my personality and enthusiasm to work with the World food Programme, the process was not too long, the interview lasted 1 h I also had a practical test", "Interview Questions": "what motivates you to work with WFP"}], [{"date": "10 Mar 2018", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Food Programme (London, England) in Jul 2017", "Interview Descriptions": "Three rounds of interviews: a one-on-one interview, a panel interview and a timed online test. The interviewers were based in Rome, Italy (where the internship was based.)  They took more than a week after each stage to respond, and the final response was three weeks after the last round of interviews.", "Interview Questions": "What interests you about the World Food Programme?"}, {"date": "10 Sept 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at World Food Programme", "Interview Descriptions": "I was called by the HR manager since I was recommended she only had to take my details. After that had an interview via skype with the department head he asked me work related question regarding logistics.", "Interview Questions": "No difficult question just talking and looking for a proper connection"}, {"date": "14 Aug 2014", "title": "Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme in Jul 2014", "Interview Descriptions": "I applied online and was invited to do a phone interview 3 weeks later. The interview was pleasant but challenging. I was asked questions about my relevant knowledge and experience, but then also more difficult ones relating to the department and the aid process. Afterwards I had to write a page piece on current affairs and send it back within 45 minutes.", "Interview Questions": "I was asked to give 3 reasons why it is beneficial for the WFP to receive in kind food from the US"}]]