[[{"date": "1 Jul 2023", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Duarte, CA) in Jun 2023", "Interview Descriptions": "The interview process was very smooth and the staff made it a welcoming and friendly experience. I had a pleasure speaking to the healthcare staff during my interview. The recruiter is very helpful for any questions I have.", "Interview Questions": "Clinical-based questions, behavioral questions, tell me about yourself."}, {"date": "9 Jun 2023", "title": "ER Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Los Angeles, CA) in May 2023", "Interview Descriptions": "The interview was in person, and the ED director and ED manager interviewed me. Overall it was a very easy interview consisting of generic questions about my overall experience in the ED.", "Interview Questions": "Tell me about yourself. Why are you interested in working at PIH? Tell me a time you had a difficult patient. What did you do to de-escalate the situation? Name a time you had an issue with a coworker. How did you communicate the issue?"}, {"date": "27 May 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA) in May 2023", "Interview Descriptions": "The interview process was pretty fast. I did a quick phone screen with the office manager followed by in person interview. I interviewed with the office manager and two RNs. The whole process was vey pleasant.", "Interview Questions": "Tell me something about yourself?"}, {"date": "12 Apr 2023", "title": "Emergency Medical Technician (EMT) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Downey, CA) in Apr 2023", "Interview Descriptions": "The interview process was amazing! They were very friendly and professional. they made me feel welcomed and very comfortable. They answered all my questions and concerns regarding the job that I was applying for.", "Interview Questions": "Tell me about yourself and your qualifications for this position"}, {"date": "20 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "I was in an interview panel among several nurse leaders from various departments. It was nice, asked questions about myself, why did I become a nurse, and what what I do in certain medical scenarios.", "Interview Questions": "What are signs and symptoms of septic shock?"}, {"date": "19 Apr 2023", "title": "Registered Nurse (New Graduate) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA) in Mar 2023", "Interview Descriptions": "It starts off with pretty standard interview questions about your previous work/school experiences and things like where you see yourself in the next 5 years. They do ask you what your strengths and weaknesses are and what you would bring to the hospital.", "Interview Questions": "My friend applied to a different unit and got the same questions. Know your rights of medication and signs and symptoms of sepsis. How would you treat sepsis? You will also get specific questions for your unit. I applied to post surgical, and one I got was what would you do if your patient had labored breathing? That's it. There's no context or anything else. It's a very broad question."}, {"date": "25 Jan 2023", "title": "Back Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at PIH Health", "Interview Descriptions": "You meet with the manager of that department. It will most likely start with a tour of the facility and then you will have an interview with the manager with other colleagues or doctors in the room.", "Interview Questions": "Why should we choose you for the job?"}, {"date": "2 Feb 2023", "title": "Liason Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health in Jan 2023", "Interview Descriptions": "The interview was straightforward and not stressful. It consisted of all 20-30 mins. Interviewed with the Director, she was very nice and made what she was looking for very clear.", "Interview Questions": "How would you deal with a colleague you do not see eye to eye with?"}, {"date": "17 Jan 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "The first in-person job interview is typically a one-on-one interview between the applicant and a hiring manage Information about the company Questions: personal information, education, experience, previous jobs Job description Location Shifts", "Interview Questions": "Question: Tell me about yourself"}, {"date": "6 Jan 2023", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "The interview process went a lot better than I expected! I was interviewed by the Nurse Manager and three other nurses for a position in the NICU, and they were all very easy to talk to and super nice. At the end of my interview, they even gave me a tour of the unit and introduced me to the Nurse Director. Overall, not intimidating and was a great experience.", "Interview Questions": "Tell us about yourself and what interested you in working with babies."}], [{"date": "13 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PIH Health (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "interview was for a new grad position but I was discouraged to hear that the pay was going to be minimal for a nurse's salary. The nurse to patient ratio was also going to be 1:7, so I left the interview feeling discouraged.", "Interview Questions": "tell me about yourself. what do you look for when giving beta blockers? what labs do you monitor for when giving ACE inhibitors? behavioral questions: time when you used listening skills to improve communication."}, {"date": "30 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "The interview was on site in the conference room. Staff interview of 4-5 people, followed Covid-19 protocols. Meeting was about an hour and staff took turns asking questions. They validated parking.", "Interview Questions": "Experience with clinical care, education background, availability"}, {"date": "10 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "It was a very informal meeting with both managers. Offered the job in the same day. Hires new grad RNs. 3 month training process. Overall decent place to start your first RN job", "Interview Questions": "What are the 5 rights?"}, {"date": "27 Sept 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health", "Interview Descriptions": "Very quick process! Applied online, received an email to schedule day and time for a phone interview on their website.  Basic interview questions were asked during the interview, and they got back to me within the week. ", "Interview Questions": "Why do you want to volunteer?"}, {"date": "18 Jan 2023", "title": "Cerified Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at PIH Health (Whittier, CA) in Sept 2022", "Interview Descriptions": "I applied online. First, HR called me for prescreening interview. Second, HR called me to schedule an in-person interview. They asked about my work experience. They asked me why I wanted to work at PIH Hospital.", "Interview Questions": "Order of Draw, tests that are included in common Lab Panel, management of workload"}, {"date": "8 Aug 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at PIH Health (Whittier, CA) in Aug 2022", "Interview Descriptions": "The interview process was via zoom. I was first called and asked if I was still interested in the position and it was followed up with an interview through zoom by the clinical director and her assistant. It was no more than a 30 minute interview and my interviewer answered the questions I also had in regards to the position.", "Interview Questions": "One thing that was asked was the ranges for temperature, blood pressure, heart rate, and respirations."}, {"date": "18 Jul 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PIH Health (Whittier, CA) in Jul 2022", "Interview Descriptions": "1st interview with rehabilitation manager. 2nd interview with rehab manager and 2 occupational therapist. Was approx 45 minutes. Asked for feedback after. Need to email references after 2nd interview. It went well. Manager pleasant and made you feel comfortable during interview.", "Interview Questions": "What diagnosis do you commonly see "}, {"date": "24 May 2022", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at PIH Health (Whittier, CA) in May 2022", "Interview Descriptions": "I submitted an online application and was contacted by the supervisor. A telephone interview was conducted followed up with an in-person interview. I was notified by HR and was offered the position in which I accepted.", "Interview Questions": "How my set of skills aligned with the job opportunity in which I was applying for. "}, {"date": "18 Jun 2022", "title": "CDIS Clinical Documentation Integrity Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at PIH Health (Los Angeles, CA) in May 2022", "Interview Descriptions": "The interview was warm and friendly video chat. They had a panel of 5 people ask me questions about my experience in CDI. \nThat’s one of my best interviews. I’m lucky that I was selected after the interview.", "Interview Questions": "Tell us about yourself and how you know about us?"}, {"date": "8 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "My interview process was comfortable and it wasn't scary as I thought it would be! The nurses and the director was really nice and the vibe was more relaxed than other interviews that I had.", "Interview Questions": "Tell me about yourself and why you want to be a nurse."}], [{"date": "28 Apr 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at PIH Health (Los Angeles, CA) in Apr 2022", "Interview Descriptions": "The interview process was super quick and simple. Got a call the next morning after applying, set and appointment for an interview with a few days. The interview was short, and simple. Took about 30 minutes.", "Interview Questions": "Why did you choose PIH Health?"}, {"date": "28 Mar 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at PIH Health (Whittier, CA) in Mar 2022", "Interview Descriptions": "Applied online and received a call to interview in person at Whittier Hospital.  It was a 3 panel interview and they where all very friendly.  Interview took about 25 minutes.", "Interview Questions": "What would you do if your patient is SOB. "}, {"date": "25 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at PIH Health (Whittier, CA) in Mar 2022", "Interview Descriptions": "Welcoming, well prepared, and professional. I came early to not fear being late. I got checked in and was escorted into a waiting room. At three I was seen and interviewed. The questions were formed in personal, clinical, and past experiences.", "Interview Questions": "What unit would you work on if you could work on any?"}, {"date": "5 Feb 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "Received a Phone call by the manager was then advised the director would join the line. I was then asked a few questions. I was given a Interview then was scheduled with lab manager and lab director.", "Interview Questions": "Tell me about your experience."}, {"date": "8 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PIH Health (Whittier, CA) in Feb 2022", "Interview Descriptions": "Panel Interview, questions were based on education and experience, with behavioral and clinical scenario questions as well. Everyone was extremely friendly, and the facility is beautiful. The staff were all prompt and very accommodating and overall had a very professional and pleasant environment and workplace.", "Interview Questions": "You enter the room of a patient who has a sudden onset of shortness of breath, what would you do?"}, {"date": "11 Mar 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at PIH Health (Downey, CA) in Feb 2022", "Interview Descriptions": "It was very disorganized and there was a lack of communication between the PIH staff and the woman that interviewed me. She asked me a lot of questions and gave me a case study but it was very vague. We conducted the interview in a different location than where I was instructed to go when I scheduled the interview.", "Interview Questions": "If your patient complained of numbness, what would you do? "}, {"date": "21 Feb 2022", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA) in Feb 2022", "Interview Descriptions": "I will have the interview with 6 people on next Tuesday.\r\nThey are working at Los Angeles, Whittier and Downey as Educators and supervisors. The interview will be held for 1 hour.", "Interview Questions": "What is your theological perspective on the field of chaplaincy?"}, {"date": "28 Jan 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "it went well. I had a panel interview. they were approachable throughout process and made me comfortable. they took turn asking questions after taking turns they asked me if I had a questions for them. whole interview lasted for 20 min", "Interview Questions": "tell me about yourself\r\nwhy do you want to work in PIH health\r\ntell us about the time you had difficult pt\r\nsepsis scenario. sepsis VS change. MD Sbar communication"}, {"date": "13 Jan 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at PIH Health (Whittier, CA) in Jan 2022", "Interview Descriptions": "I Feel so comfortable, the nurse in charge was so nice and polite.  They ask you easy questions just to make sure if you know what they talking about, questions that you have to know as a Cna", "Interview Questions": "What is I & o  mean ?"}, {"date": "17 Dec 2021", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PIH Health (Downey, CA) in Dec 2021", "Interview Descriptions": "It went well and was pretty fair. I received a call got the interview two business days later. I reached out to them seven days later by phone. Sent out an email, the manager was responsive very professional. Got an offer for the position with 10 days. I really liked the machine we used for the scanning portion, they have new equipment. The staff seemed approachable and knowledgeable and a good environment to learn and grow in.", "Interview Questions": "What is you're five year goal/plan?"}], [{"date": "22 Nov 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "It was really a good experience, quick, and friendly. The  interview process and on boarding was efficient and was offered a position the next day.  I would definitely recommend and I enjoy working here.", "Interview Questions": "Describe a time you had a difficult encounter with a patient "}, {"date": "18 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at PIH Health (Los Angeles, CA) in Nov 2021", "Interview Descriptions": "There was about 40 mins of behavioral questions with 2 case scenarios. Case scenario focused on sepsis and provide an SBAR to the doctor. What do you expect the doctor to order?", "Interview Questions": "How do you handle a stressful situation?"}, {"date": "11 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "First had an initial phone screening with the manager and had an in-person interview with assistant director and director. It was for a new grad position so the questions were very general.", "Interview Questions": "Q. Tell me about yourself. "}, {"date": "6 Jan 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PIH Health (Los Angeles, CA) in Aug 2021", "Interview Descriptions": "scheduling the interview was easy and it happened really quick even during, the office manager made the interview easy and not intimidating! she made me feel comfortable. there was another staff member during the interview as well both asked general questions it was a total of less than 30 mins", "Interview Questions": "they asked about my experience, weaknesses and strengths"}, {"date": "23 Jan 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PIH Health in Apr 2021", "Interview Descriptions": "Had a phone interview which  last about 15 minutes. It was last minute and since I did not prepare, I was extremely nervous. Luckily I had some time to review their website which was helpful when asked what I knew about the company. At the end of the call, I was accepted and given an overview of the onboarding process.", "Interview Questions": "Tell me about yourself.\r\nWhat makes you special?\r\nWhat do you know about PIH Health?\r\nDo you have volunteer experience?"}, {"date": "16 Feb 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PIH Health (Chicago, IL) in Feb 2021", "Interview Descriptions": "It was quick and straight forward. The hiring manager was friendly and helpful. I was explained the pay rate, duties, training, and equipment needed. Questions were easy to answer. The hiring manager was very active to answer my questions.", "Interview Questions": "How would you supervisor describe you in 5 words?"}, {"date": "25 Jan 2021", "title": "Decision Support Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PIH Health", "Interview Descriptions": "Online Application and then got an email to set up call in a week. Standard behavioral interview with some SQL questions peppered in.  Had to cut the interview short because of bad network. Received rejection email 3 weeks after the interview.", "Interview Questions": "SQL Join questions - How would you join these two tables? Is it necessary to join these two tables?"}, {"date": "27 Jan 2022", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at PIH Health (Los Angeles, CA) in Jan 2021", "Interview Descriptions": "I had a face to face interview. There were two interviewers at the time of my interview. Scheduling an appointment for Interview and all the before and after processes were quick and smooth.  I think the company has very well organized system. It was easy to communicate with them and they had friendly environment.", "Interview Questions": "One question was regarding strengths and weaknesses "}, {"date": "6 Oct 2020", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "Basic questions. Group interview with manager and human resources. They have list of questions ready. Mostly clinical scenario based questions, education, years of experience, and why you want to work there. Takes about two weeks for response after interview.", "Interview Questions": "Please tell me about yourself"}, {"date": "18 Aug 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "The interview was laid back and very stress free. It was done over the phone and the interviewer was very pleasant to talk to.  The questions were not difficult. The recruiter genuinely wanted to know about me and was open and honest with what they were looking for.", "Interview Questions": "Tell me about a time a customer/patient was demanding"}], [{"date": "5 Oct 2020", "title": "Relief Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health in Aug 2020", "Interview Descriptions": "very easy process, welcome by nurse, very good COVID precaution, did not wait more than 10 min, straight forward question, received job, all question was based on patient safety, some scenario was given, very easy process.", "Interview Questions": "tell me about your self"}, {"date": "6 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PIH Health (Downey, CA) in Aug 2020", "Interview Descriptions": "Interview questions are pretty relaxed and they don't ask too many. I was only interview by clinical director and her assistant, so no panel interview. Interview lasted about 30 minuets.", "Interview Questions": "Q: What would you do if you patient is having sob? what orders would you anticipate? "}, {"date": "17 Aug 2020", "title": "Hospital Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Los Angeles, CA) in Aug 2020", "Interview Descriptions": "The interview process was very straight forward. I initially found the job position on Indeed.com and within 3-4 days I was contacted. First they interviewed me over the phone then they invited me for an in-person interview.", "Interview Questions": "Why this specific position and or this hospital?"}, {"date": "28 Jul 2020", "title": "RN Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "It was a good experience. My interviewers were really nice and interview started on time.  The interview consisted of many interview questions but the time flew by. Overall, it was a good interview.", "Interview Questions": "Why do you want to work at this hospital? "}, {"date": "13 Oct 2020", "title": "Registered Nurse (BSN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at PIH Health (Downey, CA) in Jul 2020", "Interview Descriptions": "I was called for an interview within 24hrs of my application. I applied for an ICU position and Interviewed with the ICU director and the director of education.  I was offered the position the next day", "Interview Questions": "I was mostly asked about my nursing clinical rotation and how many patients were under my care as a nursing preceptee. I was also asked what I knew about PIH and why I chose PIH"}, {"date": "4 Feb 2021", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at PIH Health (Los Angeles, CA) in Jun 2020", "Interview Descriptions": "Easy, over the phone due to Covid. Interviewed with a recruiter first, then the manager. Discussed personal background, patient population, culture on unit, etc. Manager was extremely bright and personable which made the interview go smoothly.", "Interview Questions": "Please tell me about yourself. "}, {"date": "20 Mar 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "Online application, phone call from manager to schedule interview, clinical director and charge nurse present during interview, phone call to offer employment, follow up email from HR with all the information about position, job offer, and orientation/other requirements", "Interview Questions": "What goals do you have for yourself that would help you in your career?"}, {"date": "3 Jul 2020", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA) in Feb 2020", "Interview Descriptions": "Staff was friendly and reassuring.   They seemed welcoming which put my nerves at ease.   They are new graduate friendly and will take non-related experience into consideration.", "Interview Questions": "How have you dealt with a difficult patient in the past?"}, {"date": "5 Jul 2023", "title": "Licensed Vocational Nurse (LVN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Los Angeles, CA) in Jan 2020", "Interview Descriptions": "I've been working as an LVN at PIH. Good Samaritan for 4 years. I've worked all throughout COVID and there have been many changes. There have been lots of changes at this hospital such as management and protocols. We are the only PIH hospital with union and it's been a fight to keep it that way.", "Interview Questions": "Do you know your scope as an LVN?"}, {"date": "22 Oct 2019", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "Interviewed with Nurse Manager and Charge Nurse. Only the Nurse Manager asked questions. She broke down the sections that she was looking for: behavioral, situational. She specifically wanted to know situation, action, and outcome.", "Interview Questions": "Tell me about a time when you had a conflict with upper management. How did you handle it and what was the outcome?"}], [{"date": "13 Oct 2019", "title": "Student Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "Really nice individuals. There was some clinical application questions along with questions asking about ourselves.  Applied the day before, and I got a call back offering an interview the next day. Really quick process. They took a couple of days to get back to me on whether I was offered a position or not.", "Interview Questions": "Why you want to volunteer in the unit. "}, {"date": "7 Oct 2019", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "First  had phone interview with HUman Resources department.  And the. A few weeks later I had interview with three panels in person. After interview with the hiring team, i was offered about in two to three weeks.", "Interview Questions": "What kind of experiences and when I can start working. "}, {"date": "31 Mar 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Los Angeles, CA) in May 2019", "Interview Descriptions": "Group interview that had us sat around a table with a few interviewers asking us questions. Not a long process everyone was asked the same questions and would sometimes have to elaborate on their answers.", "Interview Questions": "Why do you want to volunteer here?"}, {"date": "18 Apr 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "Interviewed with unit clinical director and assistant clinical director in their office; interview was about 30 minutes long; met potential coworkers including other certified nursing assistants and registered nurses; toured the unit.", "Interview Questions": "Describe a time when you had difficulty with a coworker and how you resolved it."}, {"date": "15 Feb 2022", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PIH Health (Los Angeles, CA) in Apr 2019", "Interview Descriptions": "the interview process was good. they asked a lot of questions and were very friendly and overall were great interviewees. just a lot of questions but it was overall pretty quick so i hope whoever is looking for one gets the job and good luck!", "Interview Questions": "why should we hire you "}, {"date": "12 Feb 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "I applied online and was called in for a panel interview with two clinical directors and the HR recruiter. The interview was around 30 minutes and everyone was very friendly and welcoming. I thought the interview went well, but did not receive an offer.", "Interview Questions": "Are you interviewing with any other hospitals?"}, {"date": "13 Feb 2019", "title": "New Grad RN (Cardiac Tele & Med/Surg) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PIH Health (Whittier, CA) in Feb 2019", "Interview Descriptions": "I applied for this position on January 17th, 2019 and received a phone call on January 24th to set up an interview. The interview was set for February 4th at 1pm. I received an email confirming the appointment and the names of who I was meeting with, as well as details on how to get to the conference room. This was my first ever New Grad RN interview so I was super excited, hopeful, and nervous at the same time. The 3 panelists made me feel comfortable and they were easy to talk to. However, there were A LOT of questions and they were pretty difficult compared to some other New Grad RN interviews I’ve done. I thought the interview went really well and I felt positive that I was going to get the job. Four days later I received a generic rejection email letting me know I wasn’t selected for this position.", "Interview Questions": "What would you do if your patient had SOB? Which labs would you tell the doctor to run?"}, {"date": "26 Mar 2019", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at PIH Health (Whittier, CA) in Feb 2019", "Interview Descriptions": "Friendly but the process was rather slow. I applied 6 weeks ago and then received a call for my phone interview. I didn't think I passed because it took 2 weeks to hear back for an in person interview. Then about 2 .5 wks to receive a written offer.", "Interview Questions": "Why do you want to work for PIH"}, {"date": "23 Jan 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "Basic behavioral/situational questions.  Tell me about yourself? Why did you leave your last job? Why do you want to work here? Name a time you went above and beyond your call of duty?", "Interview Questions": " Tell me about yourself? Why did you leave your last job? Why do you want to work here? Name a time you went above and beyond your call of duty?"}, {"date": "5 Dec 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health", "Interview Descriptions": "I applied online on the company website. A couple of weeks passed by and then I interviewed over the phone. After the interview we scheduled an in person interview, after the interview, they called with offer a couple of days later", "Interview Questions": "how would you handle a difficult patient?"}], [{"date": "11 Oct 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA)", "Interview Descriptions": "Applied online and got an initial phone interview 2-3 weeks after. Hiring manager asked me a few questions regarding my clinical experiences, why did I choose nursing, what departments I was interested in working at etc.. A few days later got an interview with the Nursing Director.", "Interview Questions": "How was my clinical experience at a certain facility I went to and what did I learn from it. "}, {"date": "11 May 2018", "title": "Office Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Downey, CA)", "Interview Descriptions": "Long and full of nonsense. This company is not as helpful or understandimg as they claim to be. Definitely not family oriented because management is nothing but drinking buddies. Good luck to anyone applying:)", "Interview Questions": "Experience "}, {"date": "19 Apr 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at PIH Health (Whittier, CA)", "Interview Descriptions": "Applied online. Received a call from the Clinical Director of the floor about 24 hours later. Ended up speaking about my experience and basic questions for about 15 minutes while on the phone. (Why do you want to be a nurse? Why did you choose PIH? Etc) \r\n\r\nScheduled an In-Person interview 2 days later. I interviewed with the Clinical Director, Hiring Reciter, and Charge nurse.  They ask a combination of personality and clinical judgement questions. \r\n\r\nOverall, the process was very pleasant. The environment was very relaxed, professional, even fun.", "Interview Questions": "How do you manage stress?"}, {"date": "28 Mar 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "They treat you with respect, and pretty much treat you as a friend when you walk into the interview. I felt so comfortable with the managers. It was a little less informal, but it felt less intimidating.", "Interview Questions": "They asked more personality based questions"}, {"date": "11 Jan 2018", "title": "Optometrist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at PIH Health", "Interview Descriptions": "Took place at clinic during lunch time.  Took time to schedule due to difficulties assembling members of interview panel at the same time.  In front of panel of clinical directors, ophthalmologists and optometrist.  Each person asked a question.", "Interview Questions": "Clinical cases will be presented to assess how you think.  Will be presented verbally with CC and findings.  Based off of this, will be asked for differential diagnosis and treatment."}, {"date": "26 Dec 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PIH Health", "Interview Descriptions": "applied online and waited 3 months for an interview. mini interview on the phone followed by in person with the supervisor then another interview with the manager that same day. received a job offer 2 to 2 .1/2 weeks later", "Interview Questions": "How well do I know  lab tests and type of specimens "}, {"date": "17 Jan 2018", "title": "Registration Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (New York, NY) in Dec 2017", "Interview Descriptions": "I was interviewed at the Downey Medical Center by the Manager and Lead. I haven't made it past that process so I have no further details. I was informed that I would be contacted after the interview wether or not I was hired which did not occur despite sending an email thanking her for the opportunity. It would have been easy to just reply and express that the position was filled.", "Interview Questions": "Where do you want to be in 10 years."}, {"date": "7 Nov 2017", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PIH Health (Whittier, CA) in Oct 2017", "Interview Descriptions": "It was relaxed and intimate with only two persons conducting the interview. They were each from their respective department because I was interviewing for two possible positions at the same time. There was no time limit and the process was very painless for an interview.", "Interview Questions": "How would you safely administer medication to a patient?"}, {"date": "22 Sept 2017", "title": "Leadership Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health", "Interview Descriptions": "Initial phone screen with hiring manager then scheduled for in person meeting. The hiring manager did not ask for a time preference and arbitrarily picked the middle of the day for the interview. Was told it would be 2 hours but once on site, asked if I could stay longer but I had plans based on the time that was scheduled. The second interviewer was almost a bully. She would ask another question before the first question was answered. She started drawing on my resume and just made it obvious that she wasn't interested. I just found the whole process to be off-putting and a waste of time. It changed my view of the entire organization and I question how those two even got into their positions.", "Interview Questions": "Why do you want to work here"}, {"date": "15 Jul 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA)", "Interview Descriptions": "I applied online during my senior year of college - I received a phone call approximately a month after I graduated to set up an interview - Interviewed with the Nurse Recruiter and Unit Director. It was a great experience! They were both so kind and it was such a comfortable environment that I felt like I really got a feel for the unit's environment and the heart of the hospital - really excited to begin my nursing career here!", "Interview Questions": "What made you take in interest in, and apply to this hospital?\r\n"}], [{"date": "12 Oct 2017", "title": "Housekeeper (On-call) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at PIH Health in Jun 2017", "Interview Descriptions": "I had a phone interview. She was not very interested in my lack of employment history and my months of trying to actually find a job. She was a little rude and unprofessional, basically rushing the whole call. I think she wants someone who goes to school or has strong work experience. But it was an on-call job and I was fully available and capable of doing the job, but I guess you have to have a degree in cleaning. She asked me too many questions about my life instead of the job and my transportation or if I could actually handle it. She also neglected to tell me more about what they would have me do if I was hired. It literally took months to get an actual response if I was going to get the job. I'm guessing that they were still interviewing people and finally found the perfect guy and later emailed everyone they interviewed that they would not be accepted.", "Interview Questions": "Can you explain your gap of unemployment?"}, {"date": "8 Jan 2017", "title": "Medical Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at PIH Health (Los Angeles, CA)", "Interview Descriptions": "I had no sense they did any pre-work in reviewing my background or thoroughly reading my resume'. Also after some probing questions about the tasks and responsibilities it became apparent they were not fully transparent in the advertising of the position as some tasks are very challenging in the work environment and dynamic", "Interview Questions": "Experience related to the tasks and responsibilities"}, {"date": "9 Apr 2017", "title": "Physician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at PIH Health (Whittier, CA) in Jan 2017", "Interview Descriptions": "I had high hopes for this organization, but the recruitment process changed my mind. The recruiter and organization presented as unprofessional, disorganized and will take a very long time to get anything accomplished.", "Interview Questions": "General questions about my work experience. "}, {"date": "7 Jul 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA) in Jan 2017", "Interview Descriptions": "Process was easy, just takes time for them to call you back. Interviewed by a panel of 5. They give you scenarios and ask what you would do in this scenarios what are your long term goals.", "Interview Questions": "They asked to tell them about myself. "}, {"date": "7 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PIH Health (New York, NY)", "Interview Descriptions": "The interview process was fair and structured. Be prepared to answer some basic interview questions (strength and weakness, what would you do in a respiratory emergency, how do work in a team, how well do you communicate with others).", "Interview Questions": "Why should we hire you (new grad) and not a nurse with years of experience?"}, {"date": "9 Dec 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PIH Health (Downey, CA) in Dec 2016", "Interview Descriptions": "There was a 15 min phone screen by the HR staffs and 1 week later, there was  a  1hour in person interview done by the manager.  They communicated mostly via email", "Interview Questions": "what would you do when you have challenging patients"}, {"date": "3 Jan 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Whittier, CA) in Oct 2016", "Interview Descriptions": "1 hour interview with the unit clinical director and assistant clinical director who are both RNs; first half consisted of typical interview questions (i.e, your strengths/weaknesses, facts about yourself), second half was more situational questions (specifying moments  and actions taken from clinicals/work/school).", "Interview Questions": "Name a time during clinicals or in the hospital where you saw someone take shortcuts or did something wrong, and what did you do about it?"}, {"date": "8 Sept 2016", "title": "RN New Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Whittier, CA) in Aug 2016", "Interview Descriptions": "I applied online twice in July and twice in August. Three days after submitting my application in August, I was called for an interview. Did a brief interview on the phone then was asked to also come in. Everyone was super friendly, even the patients I walked by. Interview was about 40 minutes with the nurse mgr and a charge RN.Mostly behavioral questions. Be sure to go through their why work here section on their website to help prep for your interview. I was extended an offer a week later.", "Interview Questions": "Tell us about a time when you saw another RN take a shortcut on a procedure. What did you do in that situation?"}, {"date": "23 May 2016", "title": "RN New Graduate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PIH Health (Whittier, CA)", "Interview Descriptions": "I submitted my application online and got a call two weeks later to come in for an interview. It was a panel interview with the director from 5 different med/surg floors. Everyone was very kind! The interview started out with simple questions, then to questions about various clinical experiences, and ended with a case study.", "Interview Questions": "Tell me about a time you went above and beyond for a patient"}, {"date": "9 Jul 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at PIH Health in Apr 2016", "Interview Descriptions": "Had an interview w unit manager and assist and director. Then had to wait for remaining candidates to be interviewed. Provided referral contacts, then for a call w job offer. They use an outside company for background checks.", "Interview Questions": "What makes you the best candidate for this position?"}], [{"date": "24 Oct 2016", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PIH Health (Whittier, CA) in Apr 2016", "Interview Descriptions": "Was interviewed one on one interview that went pretty chill, i was asked bout my experience overall\r\nIf i had worked at a cafe before?Do i know how make espresso drinks \r\nFood handling safety with my card\r\nPast jobs and why i left\r\nhow well i handle cash and money for closing and opening", "Interview Questions": "basic interview questions \r\ntell me about yourself\r\nprevious experience\r\npast jobs and why i left \r\nsituational questions like what would you in this situation pretty much just follow policies"}, {"date": "9 Mar 2016", "title": "Rrt Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PIH Health", "Interview Descriptions": "Applied online got a call for interview in a couple of weeks. Came in for interview and interview lasted for ten minutes. Got a call from HR in a couple of weeks staying I got the job.", "Interview Questions": "Do you have NICU experience?"}, {"date": "15 Oct 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Whittier, CA) in Mar 2016", "Interview Descriptions": "Was given an interview over the phone and an in person interview. There was two interviewers. After my interview was complete they called me a few hours later to tell me that I had obtained the position.", "Interview Questions": "Tell  me about yourself. "}, {"date": "29 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Downey, CA)", "Interview Descriptions": "New grad interview at Downey PIH.  One interviewer, was very nice.  Asked what I would do in certain scenarios with patients, why I wanted to work at PIH, where do I see myself in five years, asked about challenges in nursing school and previous jobs.  Overall good experience and staff seems friendly.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "29 May 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at PIH Health (Whittier, CA) in Jan 2016", "Interview Descriptions": "Very simply to the point asked questions about what I would do in certain scenarios. \r\nDirector was very nice and friendly\r\nOver was a good experience \r\nI highly recommend applying to this hospital it’s a very good hospital", "Interview Questions": "What would you do if patients blood pressure is high "}, {"date": "11 Nov 2015", "title": "RN New Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PIH Health (Downey, CA) in Aug 2015", "Interview Descriptions": "This is regarding the interview process at Downey PIH. I applied online in early to mid-August. About 1 week later I received a call for an interview. I went to the interview a few days later. I received a call about 4 days after the interview with a job offer. I accepted and have been working there since September 21.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "30 Apr 2015", "title": "Rehab Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "I was taken through a one on one interview and asked a series of questions pertaining to my experience and ability to solve problems and serve as a leader. I was also given the opportunity to ask any questions I had at the end of the interview.", "Interview Questions": "Tell me about a time you dealt with a difficult patient..."}, {"date": "16 Sept 2017", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PIH Health (Whittier, CA) in Feb 2015", "Interview Descriptions": "I applied online. They called me within a week. They called me to set up an appointment. I sat outside of a room. They called me in. There were 5 unit managers and the human resources lady asking me questions. They called me the week after to offer me the job.", "Interview Questions": "Situational questions involving the nursing process.\r\nEducational goals"}, {"date": "26 Jan 2015", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "Very tough. Recently changed the process and now everthing is done online. They ask situation questions and you need to come up with real examples. Not easy to do on the spot. Be preparied.", "Interview Questions": "What is the best comtribution you have givien at any job."}, {"date": "12 Dec 2014", "title": "Employee Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at PIH Health", "Interview Descriptions": "One should always speak truthfully. You should clarify all and any possible misunderstandings in what you may have or might not have stated.  Understanding each other is very important during this process.  Understanding will help eliminate any and all possible future problems that may surface.", "Interview Questions": "long term goals"}], [{"date": "13 Oct 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at PIH Health", "Interview Descriptions": "It used to be easier at DRMC, now that it is PIH... Process is long, many qualified people never gets calls that application was even received and orientation takes too long to get new employee to their department to start work.", "Interview Questions": "Cannot offer specifics for PIH, was hired when it was DRMC."}, {"date": "8 Oct 2014", "title": "Director of Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at PIH Health", "Interview Descriptions": "The interview was well organized. A series of questions were asked from a form that was clearly used to compare me with other candidates. I was allowed time to ask my questions at the end.", "Interview Questions": "Have you ever dealt with a process or action that was ethically wrong. "}, {"date": "6 May 2014", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at PIH Health", "Interview Descriptions": "I was introduced to the position through a referral. I submitted my application through Human Resources on the second floor. The manager promptly contacted me for an interview that week. I met with the manager of Jazzman's Cafe, engaged in a standard interview. i.e. Why do you want to work here? Tell me about a time you provided excellent customer service? etc. The manager looks to hire individuals with prior barista experience. The interview is a general overview of minimum qualifications and necessities, the work experience is most important, it is fairly easy to obtain the position.", "Interview Questions": "Why did you leave your last position?"}, {"date": "18 Mar 2014", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at PIH Health", "Interview Descriptions": "I got an panel Interview but I did not get the job offer. There was 4 manager and 1 Nurse Recruiter that did the panel interview, they were all nice and the questions were basic questions about why you wanted to work at the hospital, strengths and weakness, some situational questions with specific examples. Overall the interview process wasn't that bad but did not get the offer.", "Interview Questions": "what did you do to handle conflict?"}, {"date": "2 Sept 2013", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at PIH Health (Whittier, CA) in Dec 2012", "Interview Descriptions": "i applied online and called to double check that it went through. the hiring manager for technicians is linda and she works crazy hours. she's salary so she doesn't clock in, if you want to reach her the best time is 11pm. seriously.", "Interview Questions": "you'll be asked about your previous relationship to coworkers, how you handle conflict, do you go to management or human resources, etc. This is for a reason--it's a terrible work environment and they want people that either keep to themselves or don't go to human resources to resolve conflicts."}, {"date": "29 Oct 2014", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at PIH Health (Downey, CA) in Jun 2010", "Interview Descriptions": "Attended orientstion and got called in for an interview. After i was accepted in to program, i went through new volunteer orientation. The overall experience was fast and easy. I gained a lot of experience in the Healthcare field and really enjoyed all of the nurses and staff I worked with.", "Interview Questions": "Asked what I would do in different scenarios when interacting with patients of the hospital."}]]