[[{"date": "26 May 2023", "title": "Administration Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shelter (London, England) in May 2023", "Interview Descriptions": "During the interview, I found myself facing an interview panel that appeared amicable at first glance. However, I couldn't help but notice subtle judgments exchanged through glances as I answered their competency-based questions. This created a highly uncomfortable atmosphere throughout the interview. Additionally, I was surprised to be presented with tasks that seemed unrelated to the administrative position I was interviewing for. These tasks included arranging 12 multiple priorities in order of importance and most bewildering of all, proofreading a literary text. The mismatch between the tasks and the position left me confused, as I had expected the focus to be on administrative skills rather than editing proficiency. \r\n\r\nDespite being informed that I would receive a response regarding the outcome of the interview by the end of the day, I never received a phone call or email. This experience was extremely disheartening and left me questioning my abilities. However, most importantly, it served as a revealing demonstration of the company's systemic cultural issues in how they interact with people. Undoubtedly, this ranks among the worst interview experiences I have encountered. In hindsight, I can't help but feel fortunate to have avoided a potentially detrimental situation.", "Interview Questions": "How would you handle a situation where you are faced with two priorities that require immediate attention simultaneously?"}, {"date": "24 Apr 2023", "title": "Ui\\Ux Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Shelter (London, England) in Apr 2023", "Interview Descriptions": "Great interview process this was an amazing opportunity to present to the team! Very intense interview process but still necessary nonetheless! A-bit tricky at time and very detailed questions the panel wanted to fully understand my process and how I worked.", "Interview Questions": "Where do you see yourself in your career"}, {"date": "29 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Shelter (London, England) in Nov 2022", "Interview Descriptions": "Interviewed but never contacted again. By anyone. Shocking treatment. Especially after you put in time to prepare, spend the interview being genuine, and then wait to hear when they say it will be a quick process. Emailed twice afterwards to two different people. Nothing.", "Interview Questions": "What would you do if you are constantly being met by obstacles from other departments when you've been tasked with getting something done from your own department."}, {"date": "16 Dec 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Shelter (London, England) in Nov 2022", "Interview Descriptions": "Interview was set up via HR. Interviewed with two panelists who said they would make a quick decision. No response from HR at all following interview No response from panelists. Emailed HR directly for update after interview to zero response. Emailed one of the panelists directly to zero response also. Worst interview experience of a charitable organisation ever. Unprofessional and simply rude and impersonal.", "Interview Questions": "How do you deal with competing priorities"}, {"date": "28 Sept 2022", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shelter", "Interview Descriptions": "There was a panel of interviewers who took turns asking questions. I was quite nervous but they were all really friendly. They offered feedback through email or call when I was unsuccessful.", "Interview Questions": "An instance where I helped resolve a problem."}, {"date": "12 Sept 2022", "title": "Community Events Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Shelter", "Interview Descriptions": "Questions are sent before the  interview. \r\n\r\nA short task is sent before the interview, which you have 15 minutes to complete. \r\n\r\nInterview is around 45 minutes long and was virtual and asking the questions they provided before the interview.", "Interview Questions": "Experience or knowledge of working within customer service"}, {"date": "30 Jun 2023", "title": "Retail Store/Shop Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shelter (London, England) in Aug 2022", "Interview Descriptions": "Good charity and general good environment where you can be supported if needed and team work os essential, recruitment and training volunteers etc. Individual imput on your shop and creating new ideas", "Interview Questions": "Lidership, targets, recruitment,volunteers, on line shop, displays"}, {"date": "19 Apr 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shelter", "Interview Descriptions": "Great interview process, the manager was nice and helpful in explaining what my role would entail. Short response time, I was called 8 days after I submitted my application, the interview was conducted over the phone !", "Interview Questions": "what was your past experience?"}, {"date": "28 Feb 2022", "title": "HR Operations Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shelter (London, England) in Dec 2021", "Interview Descriptions": "Had to complete an application form online and answer some questions.\r\n\r\nFirst stage of interview process was required to complete a test on mail merge.\r\n\r\nWas done virtually with the managed / assessor.", "Interview Questions": "Why do you want to work for Shelter?"}, {"date": "16 Nov 2021", "title": "Community Fundraising Assistant (Midlands, North and Scotland) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shelter", "Interview Descriptions": "Very friendly interviewers. Two panel interview at London office in Old Street. Interview process dealt with by HR. Words words words words words words words words words words words words words words", "Interview Questions": "Describe a time something went wrong and how you handled it"}], [{"date": "28 Jan 2022", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shelter (Bristol, England) in Aug 2021", "Interview Descriptions": "The interview questions were very much based on my own experiences of handling difficult/sensitive situations and a test of my integrity and ability to empathise, which was really refreshing for an interview and certainly tells me that Shelter appear to value integrity over what people can regurgitate from their CV.\r\n\r\nHowever, the reason why I am rating the experience down is because they didn't have the common curtesy of letting me know the outcome of my interview (obviously it was not successful). \r\nHowever, taking into consideration the hours spent filling out a job application, writing a cover letter, preparing for and taking time out of work to interview...its really the least they can do.", "Interview Questions": "Can you tell me about a time when someone has been treated unfairly and how you reacted to that situation"}, {"date": "18 Jun 2022", "title": "Research Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Shelter (London, England) in Jun 2021", "Interview Descriptions": "Completed online application.\r\nIssued set task before interview combining excel & data analysis.  \r\nStandard interview questions lasting 40 mins, 2 person panel. \r\nProvided swift & fair feedback shortly after interview", "Interview Questions": "Q. Why would you like to work at Shelter "}, {"date": "14 Feb 2022", "title": "Assistant Research Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Shelter (London, England) in Jan 2021", "Interview Descriptions": "There were three Shelter team members on my remote interview, one of which kept leaving his desk for periods of time while I was answering the panel’s questions. He assured me he was still listening despite not being on screen, but I found it very off putting and it made me feel as though my interview was not taken seriously.  \r\n\r\nI was actually glad not to be offered the role, but asked for feedback on my interview to help me improve. I never received any, even after chasing the HR contact, which I think is pretty unprofessional considering the entire application and interview process I had been through.", "Interview Questions": "Several behavioural questions similar to the application and also asked to prepare a 15 minute presentation (delivered at the start of the interview) outlining a research problem and recommendations to evidence the problem outlined in the pre-task. After the interview I was also asked to complete a short, timed excel test, which was not particularly difficult but only given 5 minutes to complete and return via email."}, {"date": "17 Nov 2020", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Shelter (London, England) in Nov 2020", "Interview Descriptions": "The interview process was in two sections, a panel interview and a \"meet the team\" session, which I found to be a great approach. The questions were relatively straight forward, in keeping with interviews for similar roles in other organisations and was a comfortable experience (overlooking the fact the interviewing director was dressed in his gym kit). I was informed that I would hear back early the following week (my interview was on a Thursday). I had heard nothing by late the following week, when I decided to email the recruitment team and ask for an update, the only response I got was 36 hours later when an automated email landed in my inbox inviting me to interview and to book my interview online. I thought this was strange as it was not in keeping with the personal emails I had received to date, but as a second stage of interviews had been mentioned as a possibility it wasn't completely out of the blue. I followed the link but wasn't offered any options for booking an interview slot. I tried to call the HR number and there was no answer, so I left a voicemail. I followed up with an email and confirmed some additional information requested in the invitation email. 30 minutes later I received another automated email informing me that I was not being offered the role and thanking me for my time, with no offering of feedback or the opportunity to ask for any. This automated rejection email was sent at 17:20 on a Friday evening, meaning I had no way of clarifying the situation until at least the Monday. I have sent a follow up email to clarify, that has again gone unanswered. I think if this is the way Shelter treat people who are applying to join their organisation, then I have had a lucky escape, as from my experience they do not value or appreciate people or the time they take to complete their recruitment processes. One of the worst recruitment processes I have experienced to date. A disgusting way to treat applicants, ironic considering the charities work is focused on helping and supporting vulnerable people.", "Interview Questions": "Tell us about your experience and what attracted you to this role at Shelter?"}, {"date": "14 Oct 2020", "title": "Part-time Assistant Shop Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Shelter", "Interview Descriptions": "A long time after I applied, I was sent an invitation to interview (with a lot of notice which was good). The interview was with 2 people, who asked a lot of questions from what seemed to be a set list (not really a flowing conversation).  I felt like I was asked about things that were above and beyond the job description - implying a lot more responsibility for important things than the job description detailed. Lots of 2-part questions. I still answered the questions well, despite feeling interrogated. They said they would get back to me in a week's time and never did.", "Interview Questions": "What would you do about the problem of theft? "}, {"date": "2 Oct 2020", "title": "Research Assistant Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Shelter", "Interview Descriptions": "There were two interviewers, who were both very welcoming. It was a fairly informal though professional process. They asked I think three main questions then a couple of follow ups on what I said.", "Interview Questions": "What do you think Shelter does? What research experience have you had? Why do I want the role? "}, {"date": "8 Jan 2020", "title": "Charity Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Shelter (Manchester, England) in Jan 2020", "Interview Descriptions": "The interview was ok, the interviewer however was very judgemental in my case, I could tell her favouritism was on the other girl, who was lovely. I was myself like I was told to be but got a call saying im not what they’re looking for, bit disappointing and ridiculous. Ah well, never again!", "Interview Questions": "What would you do if you were prime minister for a year?"}, {"date": "16 Sept 2019", "title": "Service Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shelter", "Interview Descriptions": "I had a 45 minute assessment including a typing test, Excel task and an In-Tray Exercise. This was followed by a behaviour based panel interview.\r\n\r\nAll members of staff I encountered were lovely and welcoming. However 5 minutes into my assessment I could hear somebody next door talking very loudly about how good the previous candidate in before me had been. Maybe I got the wrong end of the stick, but safe to say I found it off putting and a bit disrespectful.  Despite this my interview seemed to go quite well.\r\n\r\nI was also told that I’d hear back in a few days, regardless of whether it was good or bad news, so as ‘not to keep me in anticipation’. I’d heard nothing so I attempted to chase it up. 2 weeks later and still nothing.", "Interview Questions": "Name a time you worked well under pressure"}, {"date": "28 Aug 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shelter (Liverpool, England) in May 2019", "Interview Descriptions": "Interview process was pretty fast, was interviewed on the Wednesday and then I began works the start of the following week on the Monday. Would recommend this job for others", "Interview Questions": "Who would you cook dinner for"}, {"date": "17 Feb 2020", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Shelter (Leeds, England) in Sept 2018", "Interview Descriptions": "Inspired people contacted me to organise an interview. This was a group interview which we answered questions on who to save in an emergency from a list of people with short descriptions followed by a one to one.", "Interview Questions": "What’s one of your biggest weaknesses"}], [{"date": "4 Jul 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Shelter (London, England) in Sept 2018", "Interview Descriptions": "Casual, Friendly. I went into the shop to apply for a position, in order to gain experience and and to boost my CV.  There were many positions available so I had no problem finding a convenient day to help out. I had to fill out a basic info form ad then I started working the next week.", "Interview Questions": "When are you available"}, {"date": "10 Aug 2018", "title": "Street Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Shelter (Manchester City Centre, England) in Aug 2018", "Interview Descriptions": "The interview process was very daunting it's basically set up to see how confident and loud you are in a group setting, what your personality is like. So if you're an enthusiastic and prentenious individual they will definitely pick you.  Also felt very intimidated by the interviewer Ben, he  made no effort to break the ice, I felt as though he made the atmosphere as tense as possible by making fun of any awkward things that happened, Didn't like him at all, please do not use him again Shelter", "Interview Questions": "Tell me about yourself "}, {"date": "6 Apr 2018", "title": "Community-based Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Shelter (Manchester, England)", "Interview Descriptions": "Two interviews; the first began with a 30min written exercise where a scenario was given and you were then asked to outline your plan for moving forward/towards a given goal. First 10min of interview given to explain your answer to a panel of three mid-senior members of staff that the role would work with directly or alongside. \r\nSecond interview with staff from the same department as the vacancy position, including one staff member from the first interview panel, as well as the head of the department who would be managing the role, if I'm not mistaken.", "Interview Questions": "Tell us about yourself, your background, why do you want this position... Throughout both interviews the questions asked felt very relevant and directly related to what the role would require, and what sort of experience and temperament they felt would be necessary to succeed in it. "}, {"date": "11 Dec 2017", "title": "Business Development Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shelter (London, England) in Dec 2017", "Interview Descriptions": "Test, followed by very straightforward and brief competency based interview. \r\nThe test involved analysing 3 government tenders and outlining whether Shelter should bid for any of them and why", "Interview Questions": "Why do you want this role? Tell us about a time you have acted on feedback (good or bad)? When and how have you had to prioritise workload? Where do you see yourself in 5 years? Describe yourself in 3 words"}, {"date": "9 Nov 2017", "title": "Finance Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Shelter (London, England) in Nov 2017", "Interview Descriptions": "15 min Excel test, followed by a number of competency questions - lasted approximately 1 hour. People were nice, just be prepared to have a number of behavioural qs backed up with strong and concise examples.", "Interview Questions": "Why Shelter\r\nExample of when you changed the way you work to meet a target\r\nExample of meeting a challenging deadline\r\n"}, {"date": "7 Dec 2017", "title": "Fund Raiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Shelter (Birmingham, England) in Oct 2017", "Interview Descriptions": "Relaxed, had a laugh, felt at ease however after getting the job, found out I had been massively misled and was out of work entirely. So don’t fall for the easy, well going nature of it all like I did", "Interview Questions": "If you were stuck on a desert island, what film and book would you take? "}], [{"date": "31 Mar 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Shelter (London, England) in Jan 2016", "Interview Descriptions": "Contacted the agency through a referral by a friend, quick interview with minimal fuss and found myself on the rota the next week. Overall friendly, positive, low-pressure. I only had one interviewer and the whole process was pretty informal and open.", "Interview Questions": "What unique skills do you bring to the team?"}]]