[[{"date": "12 Apr 2023", "title": "Gym Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ensign College (Salt Lake City, UT)", "Interview Descriptions": "Tough questions but worth the wait. Love the staff and everyone in love and support them in their journey of success in this new project in a way they deserve to see in person as a whole in a new world and in the world and a whole world that they have created for themselves.", "Interview Questions": "The first time you were able and you had to do something about the situation you had with your family."}, {"date": "3 May 2023", "title": "Financial Aid Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Ensign College (Salt Lake City, UT) in May 2021", "Interview Descriptions": "It's easiest to get an interview if you know someone who already works in the financial aid office or in the cashier's office. The interview included a supervisor and the financial aid director. It was 15 minutes long.", "Interview Questions": "It was about 15 minutes long and they asked usual questions about why you want the position and what strengths and weaknesses you might bring to the position. They also ask questions about what you're interested in and hobbies to get a sense of who you are."}, {"date": "7 Sept 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ensign College in Aug 2018", "Interview Descriptions": "I applied for the position online and received an email for a phone interview a week later. I had a great phone interview and was certain that I'd get another. I did, and it was very unimpressive.\r\nWhen I arrived for the interview, there was a very disheveled looking woman on her cell phone waiting for me. I was early, so I don't understand what the panic was about. She offered me a bottle of water and took me upstairs.\r\nWhen we got upstairs, she handed me a packet and asked me to fill it out. It asked me to hand-write SQL, which I did. The queries were easy, and I wrote with Oracle syntax, which I specified.\r\nThe next sheet was a dashboard with proprietary data on it. I was given about two minutes to look it over and identify any errors in the data. It was a very large dashboard with unfamiliar data, so naturally I was at a loss, but tried anyway.\r\nThe manager came out and hurriedly asked if I was finished. What was the rush? I had arrived early, so why was everyone rushing so much?\r\nThe interview itself was mostly okay with bland, generic questions.\r\nAfter the interview, I sent a follow-up email to the manager thanking her and expressing my continued interest in the position. I never heard back. Very unprofessional.", "Interview Questions": "If you have three tasks to complete, and they're all the same priority level, how do you decide which one to complete first?"}, {"date": "4 Mar 2019", "title": "LDS Business College Housing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Ensign College (Salt Lake City, UT) in Aug 2018", "Interview Descriptions": "It was pretty good. The process was a little long, it took me like a couple of weeks to be ready to go, but the experience was good. The interview was like an hour because the manager was trying to get to know me. However, they are pretty strict with being flexible enough to stay for the orientation days.", "Interview Questions": "Introduce yourself"}, {"date": "13 Dec 2017", "title": "Creative Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Ensign College (Salt Lake City, UT) in Nov 2017", "Interview Descriptions": "Scheduled with Executive Assistant to the President. Originally I was scheduled to meet for 1 hr. with the President of the College, later the E.A. called and reduced my time to 30 minutes. Which was for the better.", "Interview Questions": "Why would you like to work here?"}, {"date": "11 Sept 2017", "title": "Collection Management Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ensign College (Salt Lake City, UT)", "Interview Descriptions": "I was interviewed by three employees, one of whom didn't show up to the interview on time.  Questions and interaction were positive and professional.  I was promised to be informed of the outcome but never received any notification whatsoever.", "Interview Questions": "Tell us about your experience managing electronic content."}, {"date": "19 Apr 2018", "title": "Associate Registar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ensign College (Salt Lake City, UT) in Apr 2014", "Interview Descriptions": "I experienced a panel interview made up of those department heads that would interact with that position's responsibilities. Each panelist asked a question about my skills that would be used in carrying out the outlined responsibilities.", "Interview Questions": "I had to give an accounting example of what I would do in a certain transaction. Also, I had to give and example of how I would handle a difficult situation with a coeworker"}, {"date": "23 Jun 2015", "title": "Accountant Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Ensign College (Salt Lake City, UT) in Apr 2014", "Interview Descriptions": "I dropped off a resume in person, was called a few days later to set up an interview appointment, and then was interviewed a few days after that. The interview was casual and fairly short, as it was just held in one of the accountant's offices, but still professional. I was called a few days after that to be told I was hired.", "Interview Questions": "How long do I plan to stay at LDS Business College?"}, {"date": "13 Oct 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Ensign College (Salt Lake City, UT) in Aug 2013", "Interview Descriptions": "The college had me teach a sample lesson for a subject.  I had about a week to prepare the lesson and then give the sample to a panel of full-time administrators.  It wasn't a difficult interview process.", "Interview Questions": "N/A"}, {"date": "11 Aug 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Ensign College (Salt Lake City, UT) in Aug 2012", "Interview Descriptions": "Demonstrate knowledge and understanding on subject area.  Teach principles and concepts of subject matter and show how you'll use aspects of learning pattern in teaching to college-age students.  Create power point and present information in a teaching format to a panel.", "Interview Questions": "What aspects of the Learning Pattern will you use in teaching?"}]]