[[{"date": "29 Jun 2020", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Methodist Hospital in Jun 2020", "Interview Descriptions": "Decided to review because I didnt see many recent reviews of the process. Note: I have had the interview recently and am waiting to hear back on offer.\n\nI applied online and they emailed me 2 days later to do an online screening questionnaire. Then a few days later, HR     recruiter emailed to set up two interviews and asked for availability. Two weeks later, I had the interviews. First one was a nurse recruiter, she was sweet but did ask a lot of questions, lasted about 45min. Second interview was with nursing manager which was intense as she spoke a lot about the unit and asked assessment question (tell me how you would do head to toe) and other scenario based questions. This lasted about an hour! Overall, the interviews were great, some redundant questions yet quite intense. I was exhausted after the meetings!", "Interview Questions": "How do you do a head to toe assessment"}, {"date": "26 Jun 2019", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Methodist Hospital (Brooklyn, NY)", "Interview Descriptions": "The interview was pretty straight forward, no trick questions are asked just availability and team work questions. They really just want a grasp of if you will be reliable and if you will be consistent. Also, they ask how you work with others.", "Interview Questions": "If you have a personal issue with an employee how do you address the issue. "}, {"date": "8 Mar 2018", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at New York Methodist Hospital", "Interview Descriptions": "Rejected application through automated response saying requirements not met for a new graduate position. Was not told as there were no other extra requirements listed. Will be calling back for to get insight into why and will change here.", "Interview Questions": "N/A"}, {"date": "19 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Jul 2017", "Interview Descriptions": "Applied online. Got an interview 2 weeks later. Got an offer another 2 weeks later. Started 2 weeks after that. They did blood for titers, did urinalysis through the lab. Very easy", "Interview Questions": "Why are you interested in this job"}, {"date": "6 Apr 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Methodist Hospital", "Interview Descriptions": "NYM is now New York Presbyterian Brooklyn Methodist Hospital. Interview process was relaxing and fun. They ask basic interview questions like why do you want to volunteer at Methodist? Tell me about yourself. Why are you interested in healthcare?\r\nName an experience when you were moved and made you want to enter healthcare", "Interview Questions": "why do you want to volunteer at Methodist?"}, {"date": "31 Jan 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Methodist Hospital", "Interview Descriptions": "Met with recruiter to interview for a position and then met with Nurse Manager on floor 2 weeks later. HR at this hospital seems haphhazard. They sent me emails with incorrect information. HR never returns calls or emails, and was curt and dismissive when I called to follow up.", "Interview Questions": "Why Methodist?"}, {"date": "2 Nov 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Methodist Hospital", "Interview Descriptions": "I applied to a few openings on the Methodist website.  A few weeks later I got a call to schedule an interview for the following week.  First, I interviewed with HR.  There they ask typical questions like why Methodist, why did you choose a career in nursing etc.  Then I was sent to interview with the Director of Nursing.  There, I was interviewed by two people who asked the typical questions (some were the same Qs asked by HR) and in addition to that, they ask some clinical scenario questions.  Good Luck!", "Interview Questions": "Why did you choose to become a nurse?"}, {"date": "21 Nov 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Methodist Hospital (New York, NY) in Oct 2016", "Interview Descriptions": "The interview process was very quick. The atmostphere was welcoming and the process took a month because you had to go to the doctor and get blood work. Getting the blood work took about 2 weeks. Then you had too email them, bring you stuff in. Take a drug test and then boom. your done! Your medical cleared..", "Interview Questions": "Basic stuff. Why do you want to volunteer here?"}, {"date": "17 Jun 2016", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at New York Methodist Hospital in Jun 2016", "Interview Descriptions": "It was a positive interview and fast process. I interviewed online was a couple days later was sent an online assessment. I then received a data typing assessment and was then called in for an interview a week later. The day of the interview I first met with HR, such a sweet woman and then she sent me right over to the nurse manager that same day. The nurse manager and I interviewed on the floor where I had applied to and she was amazing. It didn't even feel like an interview. It felt more like a conversation just getting to know me. That same day I was given an offer.", "Interview Questions": "Why did you become a nurse?"}, {"date": "9 Jul 2016", "title": "Research Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Methodist Hospital (New York, NY) in Jun 2016", "Interview Descriptions": "I applied online and got a phone call for an interview after 2 weeks. The interview was with 3 attending physicians, senior researcher and the research nurse practitioner. After the interview by one week I got a phone call from the HR with the offer. I accepted with salary adjustment and they agreed after 2 days. I went for physical and my first day of work end of july", "Interview Questions": "What is my clinical research experience?\r\nWhat is my experience with patients? \r\nWhere did I get my medical degree?"}], [{"date": "5 May 2016", "title": "Certified Nurses Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at New York Methodist Hospital (Brooklyn, NY)", "Interview Descriptions": "Reverse Rascism!!! If you are white don't waste your time . They will overlook you no matter how qualified you are. Extremely rude and an uptight son of a gun. She didn't even interview me she just saw I was white and told me she is interviewing other candidates who were not even of this country that's right they were immigrants. You can thank Hilary Clinton for that but that's ok trump will be president and put an end to this liberal garbage. I got an offer at another facility making way more . I will be in touch with my lawyer regarding this racial situation and will be phoning on your side channel 7. They only hire African Americans . And who cares they pay like crap hahah better off working in a nursing home . If you are a liberal yuppy  you would for right in !", "Interview Questions": "Nothing . She seen I was white and sent me out with in 2 minutes"}, {"date": "27 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New York Methodist Hospital (New York, NY)", "Interview Descriptions": "I went for new grad open house. The interview went real well, then they emailed me to move on to the next step of the interview process which was an online assessment. A few days later they asked me to come in and meet the nurse manager, and the interview went great with them as well! Very friendly people.", "Interview Questions": "How do you feel about a nursing council and being a member of it?"}, {"date": "16 Feb 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at New York Methodist Hospital (Brooklyn, NY)", "Interview Descriptions": "You go through HR and then meet with VP of nursing and ADON. If they like you, you go meet with the nurse manager for whatever unit it is you are applying for. VP didn't seem very friendly. Waited over an hour to be called in to interview. I assume they were running late, because they took another girl in to interview before me, during my scheduled slot. Interview seemed rushed.", "Interview Questions": "Why nursing?"}, {"date": "21 Dec 2015", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Dec 2015", "Interview Descriptions": "I interviewed with HR who was very friendly and that part went great. Then I met with VP and AVP of Nursing in main building. Everything went downhill from there. Interview was simple basic questions such as \"Why NYM?\" and \"what can you bring to unit?\" She was very snappy which intimidated me. I felt like I looked at like scum. I coughed and choked on my words, sweating bullets and that was the end of that. I shook both their hands didn't even ask about next step, collected my belongings and ran out of their. I know I did not get the position but OMG! For my first official interview, I was pretty stoked. I left so discouraged.", "Interview Questions": "What Can you bring to our unit?"}, {"date": "22 Nov 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Methodist Hospital (Brooklyn, NY)", "Interview Descriptions": "Applied online and email an HR rep. Met with HR and it was pleasant, but when I met with the two VP nurses, it was extremely uncomfortable. I was asked several more clinical questions than my peers and felt like every questions I was put on the spot. Even the question, \"what do you like about Brooklyn\" seemed judge-y. I went in very excited to interview and felt doomed throughout the entire experience.", "Interview Questions": "Give head to toe assessment, why nursing, name two of your best qualities"}, {"date": "30 Jul 2015", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Jul 2015", "Interview Descriptions": "talent acquisition person asked few simple personal questions such as which school I graduated from, do I have any experience, why I would like to work in this hospital, etc. simple, to the point.", "Interview Questions": "which school I graduated from\r\nWhy I would like to work in this particular hospital"}, {"date": "21 Feb 2015", "title": "Healthcare Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Methodist Hospital", "Interview Descriptions": "Two step process:\r\n\r\nI met with HR (not at the main building) - pretty straight forward interview. The recruiter asked about my work history and explained the job description. \r\nThe second step was  to meet with the department managers that were located at the main hospital. It was hard to navigate the main building due to the elevators not working at one of the wings. The second panel interview was much harder. it was a real time skills pressure test.", "Interview Questions": "1. Describe an incident of conflict and how you resolved it. \r\n\r\n2. How do you stay organized?"}, {"date": "25 Nov 2014", "title": "Anonymous Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at New York Methodist Hospital", "Interview Descriptions": "Went in for interview with HR then inteviewed with manager/ director of department, one of who treated like scum on shoe. HR gave their card with personal extension and I was told they will call . Weeks later no response . After calling 3 weeks later and sending an email, HR did not even have the courtesy to respond. Overall Extremely unprofessional.", "Interview Questions": "The overall rudeness- seemed more like an interrogation"}, {"date": "7 Apr 2016", "title": "Transfer Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Jan 2014", "Interview Descriptions": "The interview process was easy going.  I was asked questions about specific situations I would encounter on the job and how I would handle each situation.  Explained my background.  Very nursing specific questions.  Interviewer was very nice.", "Interview Questions": "What floors would you place specific patients on."}, {"date": "18 Sept 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Oct 2013", "Interview Descriptions": "Must come in to meet with HR first. They don't know much about the position. After this, you will get called in to meet with the hiring manager and anyone else that you would have to report to.", "Interview Questions": "Tell me more about yourself"}], [{"date": "11 Sept 2015", "title": "IR Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Mar 2013", "Interview Descriptions": "Very relaxed. Met with both managers of the department as well as Senior Staff Nurse. Total interview process was completed in one day. I was notified of job offer within three weeks. Screening at employee health was arranged within ten days of job acceptance.", "Interview Questions": "What can you bring to this position if hired?"}, {"date": "31 Jan 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Jan 2013", "Interview Descriptions": "I sent in an application to volunteer, and received a response in two days. After a week i had an interview. I was accepted and had to perform a drug test, and attend an orientation, which was like an hr and a half long, but it was easy going and fun. They take your picture to get and id, and you also get a fod voucher to use in the cafeteria every day yoou volunteer.", "Interview Questions": "Why do i want to volunteer? What am i expected from the experience?"}, {"date": "5 Feb 2016", "title": "Access Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Sept 2012", "Interview Descriptions": "It was one on one. the interviewer was on time not much of a long wait. Very professional and i received a call within a week. that i got the job", "Interview Questions": "tell me about yourself"}, {"date": "30 Aug 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Methodist Hospital in Jun 2012", "Interview Descriptions": "It was not organized and HR did not have paperwork together. Was told different things by different ppl and made the hiring process confusing. Then interview that's was scheduled was about 10 minutes and I was asked questions as if I was a new graduate nurse, but I've been a nurse for 15 years.", "Interview Questions": "Why am I a nurse"}, {"date": "11 Jul 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Nov 2011", "Interview Descriptions": "You come in meet with a nice lady and she ask's several questions. The whole process took about a week and some. The lady just has several questions about your personally.", "Interview Questions": "What are your hobbies?"}, {"date": "17 Jan 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at New York Methodist Hospital (Brooklyn, NY) in Jan 2011", "Interview Descriptions": "Yoour are interviewed by the nurse manager of the unit your applying for. After being given a tour of the unit they will sit you down ask a few generic questions. after this your are contacted by the nursing recruiter and offered a position.", "Interview Questions": "all generic questions"}]]