[[{"date": "25 Apr 2023", "title": "Guest Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Holy Cross Health (Silver Spring, MD) in Apr 2023", "Interview Descriptions": "Once I sent my application, they called me back quickly. They asked a series of questions. I answered and they wanted to know my availability to speak with another interviewer. I went to the physical interview and it went well. I am very pleased!", "Interview Questions": "Why was i interested in the job"}, {"date": "28 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Holy Cross Health (Silver Spring, MD) in Nov 2022", "Interview Descriptions": "My overall interview with Holy Cross Health would rate 3.8 out of 5 stars. First part of the interview was a virtual interview were my general questions about the open positions, shifts availability, and orientation process. After my virtual interview I was scheduled a shadow shift on unit that lasted about two hours where I saw the process of shift change and morning huddle.", "Interview Questions": "There was no true interview question. The I just asked questions about the unit."}, {"date": "4 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Holy Cross Health", "Interview Descriptions": "the interview process was relaxed and the staff (manager, educator, and charge nurse) were very friendly. They asked about my work experience and how I would handle situations in within the department.", "Interview Questions": "asked about work experience and school?"}, {"date": "24 May 2022", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Apr 2022", "Interview Descriptions": "Facility was beautiful.  However, getting into the hospital was a hassle. Interviewed with two higher ups that were pleasant to speak with. Very organized and welcoming atmosphere. Gave me a tour of the lab and introduced the staff.  A few days later interviewed with HR.", "Interview Questions": "What analyzers were you familiar with. \r\nAsked about previous work experience. \r\n"}, {"date": "18 Jun 2022", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Holy Cross Health (Fort Lauderdale, FL) in Jan 2022", "Interview Descriptions": "Interview required answer a few basic questions , very unformal and pleasant. Process for hiring a bit long due many documentation and background check, drug test and a week of orientation.", "Interview Questions": "Tell a reason why would you have to miss a day of work.   "}, {"date": "13 Nov 2021", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Holy Cross Health", "Interview Descriptions": "The director was very nice and I really liked that person and thus, the department. The manager didn’t give me the time of day and actually left about halfway through the interview.  Even the director was caught off guard by the manager’s departure. It was clear a candidate selection had been made  by the manager prior to my interview. It was a disappointing experience.", "Interview Questions": "Education, training, experience/skill set. Example of difficulty experienced, etc."}, {"date": "7 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health", "Interview Descriptions": "Met with two program managers and 1 hour interview. Pretty easy follow up and in person interview. I got an email and a time was set up. Week later interview conducted and internship offered", "Interview Questions": "Five year plan? And behavioral questions "}, {"date": "20 May 2021", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Holy Cross Health", "Interview Descriptions": "The interview process at Holy Cross was incredible and straight forward. It provided a sense of growth for the company and the hiring team was eager to answer questions. Highly recommended.", "Interview Questions": "What is your career path for the next 5 years?"}, {"date": "25 Sept 2020", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Holy Cross Health", "Interview Descriptions": "My interview process was very easy. There really wasn't a process. I got the interview through my phlebotomy program. I would recommend asking to train at Holy Cross when you are still going through the program.", "Interview Questions": "Why do you want to work at Holy Cross?"}, {"date": "22 Apr 2020", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Holy Cross Health", "Interview Descriptions": "Phone interview took about 5-10 minutes. Spoke with HR recruiter first. Very basic first interview questions. HR manager didn't explain the after process after the interview was done. Was left out on a loop.", "Interview Questions": "What mistake have you made at clinical and what did you learn from it?"}], [{"date": "7 Jan 2020", "title": "Telecommunications Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health", "Interview Descriptions": "Experience in communication, high school diploma or above, Scheduled meetings, overview of what the work entails, experience in past jobs that relates to the position your applying to, dress professionally", "Interview Questions": "Tell me more about yourself?"}, {"date": "12 Mar 2021", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Holy Cross Health (Miami, FL) in Jan 2020", "Interview Descriptions": "Simple, direct and to the point. Asked some searching questions and asked how you manage in a team or f you prefer to work alone. Asked about what resources do you consult the most.", "Interview Questions": "If you had to jump off a ship, what were the 3 things you would take?"}, {"date": "9 Sept 2019", "title": "Residential Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Holy Cross Health (Bay City, MI)", "Interview Descriptions": "Lengthy interview,  very informative,  made me feel comfortable  and welcome,  positive environment, explained job duties, expectations,  and benefits in detail. Gave thorough background on company including locations and different services offered.  Introduced me to several staff members.  Welcomed my questions and concerns about the position as well as staffing process.  Explainer next steps in interview and hiring process.  Honest about qualifications and salary / pay scale.", "Interview Questions": "What do I consider to be my greatest achievement?"}, {"date": "3 Aug 2019", "title": "ER Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Holy Cross Health", "Interview Descriptions": "It was ok, I was only asked easy questions. After talking to the manager, if they like you you will shadow for a few hours in the Emergency room. Not all who works there will tell you work in there because they are themselves tired and overwhelmed.", "Interview Questions": "How many years have you worked as an ER nurse. How many patients did you have. How do you overcome stress. How did you hear about us."}, {"date": "17 Jul 2019", "title": "Aide/Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health", "Interview Descriptions": "It was very easy. It didn't take long. Maybe about 15 minutes for the interview. Was asked simple questions about past job experiences and quality of work. What are your likes and dislikes? Just simple question.", "Interview Questions": "What are your strengths? "}, {"date": "19 Jun 2019", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Mar 2019", "Interview Descriptions": "Very easy & straightforward interview process.  It was almost like I had the job before speaking to anyone.  \r\n\r\nI spoke to the recruiter for a phone screen.  She asked me a few basic (and typical) RN interview questions and scheduled a 1:1 interview with the assistant director of the unit I applied to.  She also prepped me on key factors that the assistant director would be looking for.  \r\n\r\nMy interviewed was scheduled for a little less than 2 weeks after the phone screen.  It was extremely short...maybe 15 minutes.  The assistant director mainly talked about the unit, not too many questions for me.  When the interview was over, I was asked to schedule a shadow day in the near future.\r\n\r\nMy shadow day was one week later.  I stayed for about 5 hours and shadowed one of the more experienced nurses on the unit.  The nurse told me that after the shadow she has to \"recommend\" me for the position and I'll most likely be hired.  I got an offer letter email and phone call the next week.  \r\n\r\nThere is no room for negotiation of pay as a new grad nurse, they  start all ADN prepared nurses at one rate and BSN prepared nurses at a higher (maybe $1-2) rate.   \r\n\r\nThey need transcripts (at least a 3.0 for ADN), 5 references, and a background check (which takes a ridiculously long time to complete through HireRight).  \r\n\r\nOverall the process took about a month.", "Interview Questions": "Explain how you handled a difficult patient in the past..."}, {"date": "2 Mar 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health", "Interview Descriptions": "Included a shadow day on the unit, as well as a one-to-one interview with the Nurse Manager. The process lasted about 4-6 hours. It was a very pleasant experience, but did not give me the opportunity to truly see the unit.", "Interview Questions": "Name a time you dealt with a difficult patient or family member. "}, {"date": "7 Jul 2018", "title": "New Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Holy Cross Health", "Interview Descriptions": "I had a phone interview and was then referred to the manager of my unit. She had me come into the hospital and was very flexible with dates and times. The following week I shadowed on the unit and got to meet other nurses.", "Interview Questions": "They asked me for strengths and weaknesses, why I wanted to be a nurse, and why I liked intensive care"}, {"date": "21 May 2018", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Holy Cross Health (Silver Spring, MD) in Apr 2018", "Interview Descriptions": "I was contacted about two months after applying to the position by a recruiter. We were playing phone tag so I requested an e-mail with a time to connect. I then received an e-mail with a specified date for an interview to come to an in-person interview for the role, which I thought was strange since we had not spoken at all yet. I decided to attend and waited for 15 minutes past my scheduled interview time. Turned out my name was not on the list. The interview went ok, but to my surprise I was offered the position about a month later for significantly less than the salary noted on my application. It's always good to get out and meet new people, but I truly felt like the interview process was a messy waste of time.", "Interview Questions": "Do you prefer to complete different tasks one by one or at the same time?"}, {"date": "1 Feb 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Holy Cross Health", "Interview Descriptions": "Pleasant general interview with an HR associate, who schedule a phone interview with department head for the following week. The contact didn’t call until 20 minutes past our scheduled time, and only asked two questions before ending the conversation. Not professional, and not respectful of my time.", "Interview Questions": "Why do you want this job. What is your current role. "}], [{"date": "5 Jan 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Holy Cross Health (Silver Spring, MD)", "Interview Descriptions": "I interviewed with the wonderful director, shadowed on the unit with another nurse, took a few online personality assessments, interviewed with a nurse recruiter and received a job offer shortly after", "Interview Questions": "Asked about any poor patient encounters and how they were handled"}, {"date": "27 Sept 2017", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health (Fort Lauderdale, FL)", "Interview Descriptions": "It was very professional. The peer interview was friendly and the employees were nice and accommodating. Everything was very convenient. The hospital is impressive, looks like a hotel. Security was really a priority.", "Interview Questions": "Why Holy Cross?"}, {"date": "30 Jul 2017", "title": "HR Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health (Silver Spring, MD) in Jul 2017", "Interview Descriptions": "Interview process was very concise. The questions were realistic. The interviewer was very personable. I was contacted shortly after I submitted my resume and was asked for an in person interview.", "Interview Questions": "Could I provide a situation in which I went over and beyond to resolve it? "}, {"date": "17 Apr 2017", "title": "Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Holy Cross Health (Silver Spring, MD)", "Interview Descriptions": "Basic interview. Nothing out of the ordinary. One-on-One with manager of department and didn't meet with anyone else. Did not have a phone interview first. I emailed back and forth with the manager to create a time and date to meet.", "Interview Questions": "Past experience - why you think this job is right for you?"}, {"date": "23 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Apr 2017", "Interview Descriptions": "Took about two weeks to hear back after I applied.  Pretty generic process, I emailed one of the managers and a time was set to meet.  The interview was 2/3 behavioral  questions.  If you knew Spanish it was a plus.", "Interview Questions": "Tell me about yourself?"}, {"date": "28 Jan 2017", "title": "CNA PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Aug 2016", "Interview Descriptions": "I had a phone interview first. Then a week later I had a one on one interview but durung the interview I was pretty much told I had the job but hr took almost a week to call me back to formally accept the position. From then on it was the usual paperwork and health screening which did include a drug test.", "Interview Questions": "How do you handle difficult assignments."}, {"date": "13 Aug 2016", "title": "Insurance Verification Process Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Jul 2016", "Interview Descriptions": "The interview process wasn't really intense. It took a few weeks to hear something back after it was over. I was in the running for two different employers and took the other job. I sat down with the director and manager who gave very specific information regarding the position.", "Interview Questions": "Questions upon my experience and fit for the position"}, {"date": "3 Aug 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Holy Cross Health (Silver Spring, MD) in Mar 2016", "Interview Descriptions": "Hiring Event so you brought your resume and stood in the line of the department with whom you wanted to interview with.  Had to apply online beforehand.  Then you got to interview with a person designated to that dept, for example either the supervisor or the manager.", "Interview Questions": "Why do you want to work in the NEURO ICU?"}, {"date": "11 Sept 2015", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Holy Cross Health", "Interview Descriptions": "Friendly and fast. Check in at desk and the department is called from. Someone from department will come and greet you and take you there and you will have interview in the department.", "Interview Questions": "experience and situational"}, {"date": "13 Aug 2015", "title": "Registered Nurse (Emergency Department) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Jul 2015", "Interview Descriptions": "I first had a phone interview with one of the HR recruiters which took about 20 minutes.  General questions about experience, schooling, and lots of \"what would you do if...\" scenarios.  They called back the next day to schedule an interview with the head of the ED.  The face to face interview was with just the head RN of the ED and took about 10-15 minutes only.  Then a shadow day was scheduled where I followed an experienced RN on the floor for about 4 hours.  Spoke with the head RN of the ED that day and she said I essentially had the job as long as my background check didn't reveal anything.  I got a call back shortly after saying I had the job.", "Interview Questions": "Tell me about a time during your previous nursing experience where you had to advocate for a patient to a superior?"}], [{"date": "7 Dec 2014", "title": "RN Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Holy Cross Health", "Interview Descriptions": "recruiter contact you and manager usually sets up date for interview or shadow day, friendly at the beggining. if not friendly at the beginning, don't even bother, because it only gets worse.", "Interview Questions": "usual expected questions, no surprisese for me."}, {"date": "18 Jul 2017", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health (Silver Spring, MD) in Dec 2014", "Interview Descriptions": "I met with the medical director and associate medical director and shadowed another employee. He gave me information regarding the details of salary/benefits which was non-negotiable. Overall it was casual and friendly.", "Interview Questions": "Why ER?"}, {"date": "23 Oct 2015", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health (Silver Spring, MD) in Oct 2014", "Interview Descriptions": "Applied online and waited 5 months. I received a call to schedule interview. Interview went pretty standard . I waited for 2 weeks and no word from them. I called the operations manager and she said , i will be contacted by human resources. Then i got a call from human resource with a job offer.", "Interview Questions": "How do you deal with stress,"}, {"date": "9 Jun 2016", "title": "Supply Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Holy Cross Health (Silver Spring, MD) in Sept 2014", "Interview Descriptions": "quick interview process, quick tour of the work area, and simple rundown of job expectations, and safety requirements, informed of needed health requirements such as proper vaccines, and flu shots, and I was to show the documentation for each", "Interview Questions": "What have you done similar to this job?"}, {"date": "1 Jul 2014", "title": "Pyxis Systems Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Holy Cross Health (Silver Spring, MD) in Jun 2014", "Interview Descriptions": "I got a call to come in for an interview and met with the pharmacy manager. The interview was for 10am. The interviewer and her assistant did not show up until 10:15 and cut the interview short due to a meeting. Two weeks later, no response. I emailed the manager and she never responded to my email. I finally decided to call the main hospital number and ask for HR. I spoke to a recruiter there who had no record of an interview. She then promised to check into it and call me back. 5 days later I received a call that I needed to do a phone interview, I informed the gentleman that I had already come in for an interview. The gentleman transferred me to the recruiter who set a phone screen up for 9am for the next day. WEll the next day arrived and no phone call., or email. NOTHING! These people have no regards for time and communication does not seem to be huge here.", "Interview Questions": "No communication"}, {"date": "21 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Health in Feb 2014", "Interview Descriptions": "I submitted my application online and received a call from recruitment several weeks later. I was then scheduled to interview with the unit manager, who asked questions that were generated from the personality survey I completed with my online application. She then scheduled me to shadow on the unit for 4 hours. I completed the 4 hours of shadowing, then the unit manager sent me to HR where I was offered the position.", "Interview Questions": "Pretty standard questions for a nursing interview."}, {"date": "8 Sept 2015", "title": "Respiratory Therapy Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Holy Cross Health (Silver Spring, MD) in Jan 2011", "Interview Descriptions": "phone interview with director of respiratory. It took 2 months  for HR to contact me. Then it took another month for the in person interview. About a month later I received an offer which I accepted. Over all I had 3 in person interviews, all in the same day. overall experience was good. just a very lengthy process.", "Interview Questions": "What was one patient situation where I went above and beyond to take care of a patient?"}, {"date": "11 Nov 2013", "title": "Executive Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Holy Cross Health (Silver Spring, MD) in Jul 2009", "Interview Descriptions": "One interview with manager and executive assistant to the President; interview went pretty smoothly. My perception of the organization was and is that the company was somewhat not progressive with the times in terms of cultural attitudes and computer technology. (As of Aug. 2013, they have finally upgraded from Microsoft 2000 to Microsoft 2010)", "Interview Questions": "N/A"}]]