[[{"date": "13 Jun 2023", "title": "Clinical Research Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Interview was straight forward, however the manager told me that they still had a few interviews to go through before making a final decision. Never heard anything back & received an email saying they moved on with another candidate 4 months later. If I took time out of my day to interview, the least you can do is tell me I am no longer in the running in a timely manner.", "Interview Questions": "Tell me how you prioritize tasks"}, {"date": "22 May 2023", "title": "Med Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Thorough, but unclear about specific responsibilities in specific position applied for. Benefits were made very clear and are definitely a huge incentive to work for this company. Were very accommodating when a tour of the lab was requested (this was not necessarily included as part of the interview).", "Interview Questions": "How do you resolve conflict with other colleagues?"}, {"date": "9 Mar 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "quickly after applying received email from a recruiter to set up a phone interview. Interviewer was very nice and polite and asked all the basic interview questions. Thoroughly explained what to expect with the job, the training and the hours expectations.", "Interview Questions": "How have I been a team player in a past job"}, {"date": "15 Feb 2023", "title": "Certified Medical Assistant (CMA) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare", "Interview Descriptions": "The interviews were over the phone and over zoom. There were a total of 3 interviews. i didn't end up getting the job but did good me good experience interviewing for other jobs.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "I applied for a position, and then received a call from a recruiter. I answered a few questions from the recruiter and had an interview set up for a week later. Interviewed by multiple panel and this was through zoom. Then received an offer of employment.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "25 Jan 2023", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Jan 2023", "Interview Descriptions": "Had a phone interview first. Had a zoom call with a completely different person that was not who I was suppose to interview with. I didn’t really like the vibe of the person I interviewed with the person was very bland and made it seem like I was taking to much of their time the interview was very rushed. It lasted maybe 15 minutes. Manger gave me a run down of the position asked me 2 questions and that was it. I read the reviews and they weren’t very positive about management so I would say I dodged a bullet! People feed off of energy and the manager did not give off a good vibe at all.", "Interview Questions": "Describe a time where you had a conflict and you had to solve it"}, {"date": "9 Jan 2023", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Dec 2022", "Interview Descriptions": "Applied online for OBgyn receptionist. Was sent a email a couple hours later to schedule phone interview with recruiter and that went well. Was then moved on to a panel interview. During the panel interview only 1 of 3 of the managers showed up and the lady interviewing me was sick. It’s been 2 weeks since and have been ghosted completely by this company.", "Interview Questions": "How do you deal with a difficult situation?"}, {"date": "17 Nov 2022", "title": "Patient Care Associate (PCA) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "It was on the phone, questions…typical. Asked about work experience, schooling and then questions about my last job and how I handled things, I am suppose to hear back from them soon but the process takes about 3-4 weeks.", "Interview Questions": "Q: Describe a situation where you went above and beyond for your job"}, {"date": "8 Nov 2022", "title": "Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Initially had a recruiter phone interview, then had an interview via zoom with 3 people panel (a couple peers and manager). Both lasted 30-45 minutes. The entire process lasted about 3 weeks from first interview to offer.", "Interview Questions": "Tell me about a difficult interaction, when you went above and beyond"}, {"date": "22 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Interview with the hiring personnel then a second interview with the charge nurse. There could be multiple nurses on your second interview depending on how many positions you apply for. Process takes 2-4 weeks.", "Interview Questions": "Normal interview questions, be confident when you answer questions."}], [{"date": "13 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Norton Healthcare (Louisville, KY) in Oct 2022", "Interview Descriptions": "I went to an open house interview and the managers were fantastic. The interview went great and was offered a job on the spot. They were very truthful and honest with me about the position and expectations.", "Interview Questions": "Why I chose Nortons. They also asked about difficult situations that I have been in and asked how I handled the situations. Lots of questions about experience."}, {"date": "9 Dec 2022", "title": "Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Oct 2022", "Interview Descriptions": "I had a couple interviews via zoom and I had to reschedule my last interview, which was in person when I got to my interview I didn't feel like the interview went completely great. I just had a weird feeling which I will say that every interview ever been to for aid position I have always gotten an offer, I waited about 3 1/2 weeks and instead of them sending an email declining a offer they called me to decline me and kind of giggled as they were letting me go. I feel like it was very unprofessional.", "Interview Questions": "They asked my experience asked me if I was a current employee which I was a former ask me why I wanted to be a nurse what was my biggest weakness and then also asked me a difficult time or time that I felt like I went above and beyond for my patients"}, {"date": "21 Jun 2022", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "First there was an interview with a recruiter, then there was a  Zoom interview with hiring manager, then there was an in person interview with clinic employees where you could have a tour of the facility.", "Interview Questions": "Tell me about a challenging project and how you came up with a solution"}, {"date": "25 Apr 2023", "title": "Nurse Clinician (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Jun 2022", "Interview Descriptions": "You are contacted by a recruiter who screens you. If they move forward, you do a somewhat peer interview, where you go tour the office/work environment and meet people. I was told during that process they would like to move forward with me. The recruiter then does all the background checks, and they submit the information to determine your salary. It took about 2 weeks, and then I received a text from the recruiter with the pay per hour. Once I said I was interested after seeing salary, you accepted the job in writing. They paid me based upon my degree and my years as a nurse.", "Interview Questions": "They asked about relevant work experience"}, {"date": "25 Jun 2022", "title": "Patient Access Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in May 2022", "Interview Descriptions": "I applied for a position on a Thursday had and interview on a Monday and it took about 3 weeks for the recruiter to tell me they moved on to another candidate. They had my hopes up on getting the job because I kept getting a generic response stating how the company valued my time… so I was like maybe I have a chance && the BOOOM I wasn’t selected.", "Interview Questions": "How would you handle a difficult situation? "}, {"date": "30 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in May 2022", "Interview Descriptions": "Recruiters are very helpful and the process was very easy. They do a good job pairing you with units that your are interested in. Managers are very nice and the questions are straightforward.", "Interview Questions": "Tell me about some of your work experience?"}, {"date": "8 Apr 2022", "title": "Community Health Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Feb 2022", "Interview Descriptions": "The interview was good and the manager made me feel comfortable while doing the interview. All my questions were answered and the manager was open about their vision and goals with the person holding the role.", "Interview Questions": "How will you engage the individuals to follow with their medical appointments?"}, {"date": "19 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (New Albany, IN) in Feb 2022", "Interview Descriptions": "it went through recruiters and through panel interview and after a few days they will get back to you to talk about offers. the recruiter will ask you first the job position that you want and will bring in panel from those departments", "Interview Questions": "how i handle challenges in previous work experience"}, {"date": "14 Apr 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Norton Healthcare in Feb 2022", "Interview Descriptions": "Very confusing and disappointing experience. Immediately received a rejection, but then was called 2 hours later for an interview. First interview was fine. I hadn't heard anything for 2 weeks so I reached back out and found that they \"forgot\" to send me a second round interview. That went well. Third went well. I hadn't heard anything for 2 weeks so I checked in again.  I was told I would be getting a follow up call in the next day or two. Emailed after a week, no response. Emailed again two weeks later, no response. Finally rejected 6 weeks after my 3rd interview. When I interviewed, they said that they provide feedback for no hires. When I asked for feedback, I was ghosted. Called a higher up in recruiting for", "Interview Questions": "Why do you want to work here? "}, {"date": "3 Jan 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "I was a nursing student at clinical and the former manager pulled me into her office and asked if I would like to work there after graduation. Very informal and easy.", "Interview Questions": "How comfortable i was handling 6-7:1 patient ratio?"}], [{"date": "5 Jan 2022", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare in Dec 2021", "Interview Descriptions": "The process began with an interview on the phone with human resources for basic information about myself. Next, there was a zoom interview with someone from the therapy department. The last step would have included an in-person panel interview with therapy department.", "Interview Questions": "I was asked for an example of how I handled a difficult patient or a difficult situation in school. "}, {"date": "18 Dec 2021", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Norton Healthcare (Louisville, KY) in Nov 2021", "Interview Descriptions": "I interviewed for a PRN position; simple phone interview with HR, basic interview questions and not many of them. Lasted less than 10 minutes. I asked for an in-person interview versus Zoom for the second interview and that was happily accommodated.", "Interview Questions": "What are your hourly pay expectations?"}, {"date": "31 Dec 2021", "title": "Patient Care Associate (PCA) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Norton Healthcare (Louisville, KY) in Nov 2021", "Interview Descriptions": "The interview was pretty simple and straightforward to answer lightly I suppose. Put in an application and was contacted by a recruiter the following week for an interview.  I was told Norton healthcare was very much student friendly, especially those who are on the track for healthcare. Well, that didn’t seem like the case with my recruiter. I felt more attacked about the job being too hard for me while being a student. Constantly being reminded that the job was very hard and it’s nothing like long term care (I mentioned that I had successfully completed a nurses assistant training course and was waiting to take my state test), and maybe I should consider doing part time because many students get in there and realize that it’s not for them. I felt like she had something against me being a student and showed LITTLE interest in me and my dedication to serving others. I also felt attacked as a student. My ultimate goals is to be an RN, and someday a midwife. So, the PCA position was to get my foot in the door and get a kick off to my career in healthcare as I see myself doing nothing other than helping to change lives. I never felt so belittled in my life by a recruiter.  I saw Norton Healthcare as an opportunity to grow. To start as a PCA, move up to RN, and finish as a midwife.\r\n\r\nNot only did I feel belittled, I don’t feel like the “interview” reflected on my desires and qualifications. The recruiter knew I was a student when she pulled my resume and contacted me, therefore I felt it was unprofessional to even keep pointing it out as a “flaw.” Nor compare me to other students with a passion for healthcare. She also talked over me and talked extremely fast that I was ready to just end the interview right then and there but remained professional.", "Interview Questions": "Why do you want to work here?\r\n\r\nWhere do you see yourself in 5 years?\r\n\r\nWhat do you think a PCA does? "}, {"date": "26 Oct 2021", "title": "RN, Nights Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "So far I have just interviewed with the recruiter, but it’s been 3 weeks and I haven’t heard anything back even though he said I’d hear back in a week at most. I even emailed a week ago and have still not heard anything back…", "Interview Questions": "Why do you want to work at Norton? "}, {"date": "20 Oct 2021", "title": "Pre Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Phone interview.  It was quick. She asked questions that were not that hari at all. I actually enjoyed the conversation. This interview process was very nice. The interviewer made it very nice.", "Interview Questions": "How are you with people?"}, {"date": "2 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Oct 2021", "Interview Descriptions": "The interview process started with a call from the recruiter. Told them about myself. Then moved on to a three person interview over zoom. Then a call from the interviewer with a job offer.", "Interview Questions": "Where do you see yourself in 5 years?\r\n\r\nHow would you handle a mother who just lost her child?\r\n\r\nHow did you handle a difficult patient?"}, {"date": "1 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Norton Healthcare (Louisville, KY) in Oct 2021", "Interview Descriptions": "It went well, asked a bunch of questions and went through two interviews. Contacted by recruiter and set up a good time to interview. Professional and comfortable when speaking to them.", "Interview Questions": "Where do you see your self in 5 years?"}, {"date": "25 Dec 2021", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Jul 2021", "Interview Descriptions": "It was a general phone interview, then standard onsite interview. It took about 30 minutes for the phone interview and about an hour for the onsite interview. After that, the HR personnel contacted me for the following steps of the hiring process.", "Interview Questions": "What are your strengths and weakness?"}, {"date": "22 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Was full of compassion and the interview questions guided a path for me to find the best facility for me. The interview process helped me guarantee that leaving my previous job was the right choice.", "Interview Questions": "“What would make you a great candidate for this position?” "}, {"date": "24 Jan 2021", "title": "Quality Management Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare", "Interview Descriptions": "I had 4 rounds of interview. This comprise of 2 telephonic and 2 video. The interview  overall experience was good. First 2 rounds were behavior related questions and remaining 2 were technical.", "Interview Questions": "how you deal conflict with your co-worker?\nhow you deal with bottleneck process?"}], [{"date": "8 Dec 2020", "title": "Staff RN II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "The company interviews outside candidates for positions that they already know they are going to hire internally for. I have actually been told this during an interview. I believe that this is unfair practice if they already know they are going to hire from within.", "Interview Questions": "Why do you want to work for Norton Healthcare?"}, {"date": "16 Jan 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare in Dec 2020", "Interview Descriptions": "Started with a recruiter interview, was then interviewed by the director and manager for the position and was then scheduled for a peer interview. There was a huge gap between being told I qualify for a recruiter interview and actually getting there (2 weeks), but things moved pretty quickly after that", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "12 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Norton Healthcare", "Interview Descriptions": "Easy, hiring event. Got to interview with units you were interested in.  Accepted job after offer at my unit of choice and signed papers that day! The managers were at the event and it was a smooth process.", "Interview Questions": "How do you deal with conflict? "}, {"date": "25 Aug 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Aug 2020", "Interview Descriptions": "I was contacted by a recruiter for Norton Healthcare and had an interview over the phone with her. Then I had an interview over zoom a few days later with the Regional Practice Manager and Practice Manager. Next, I am going to shadow a doctor as a candidate.", "Interview Questions": "Where do you see your self in 5 years?"}, {"date": "19 Jun 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Aug 2020", "Interview Descriptions": "Easy. All recruiters are very nice. I had 2 interviews, one with a recruiter and then the practice manager. Mostly just chit chatted to get an understanding of eachother. Overall a good experience", "Interview Questions": "Are you comfortable working with a high demographic of I’ve drug users and homeless"}, {"date": "7 Aug 2020", "title": "Medical Assistant Trainee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Norton Healthcare (Louisville, KY) in Aug 2020", "Interview Descriptions": "I submitted my application and a few days later received an email to schedule a phone interview. I had the phone interview and he asked me about a previous phone interview I had with them about two months ago.  It was noted that I never had it although I actually did have that interview and never heard back from anyone on whether or not I was selected. He then goes to tell me about the training program, asks me why I want to be a medical assistant. He states the program requires little to no experience even though I do have a background in healthcare. Interview then ends. Next following day I receive the email that “they are moving forward with other candidates...” Wait what how... a class that selects 8-10 ppl. Makes no sense and with how fast it happened as to not even consider me. Why review my application and have me do a phone interview to not continue in the interview process. Highly disappointed. The hiring process here is not fair.", "Interview Questions": "Why do you want to be a medical assistant?"}, {"date": "28 Jul 2020", "title": "PCA/Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Jul 2020", "Interview Descriptions": "Applied online and heard back a few days later. Had a phone interview (due to Covid) with a recruiter and had a phone interview with the manager 2 days later. Was offered the position the next day. Lots of \"tell me about a time when you...\" questions.", "Interview Questions": "Tell me about a time you had to deal with an overly demanding patient. Tell me about a time when you had to work with someone who wasn't pulling their weight on the job. Tell me about how you would handle a hostile work environment with a coworker."}, {"date": "10 Jul 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Norton Healthcare (Louisville, KY) in Jul 2020", "Interview Descriptions": "Applied online 07/02/2020, was emailed the same afternoon to schedule interview with hiring manager for 07/09/2020. Was phone interview due to COVID19. Lasted about 35 minutes. Was called back within 2 hours with an offer. Received my offer letter that afternoon. Process was very quick and easy. Prior to this, I did have some issues with applying and being immediately rejected for several other positions.", "Interview Questions": "What do you expect to gain from your first year as a nurse?"}, {"date": "3 Jun 2020", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Received a call to set up an interview a week after applying, Then had a phone call with a recruiter, And finally had a phone call with a recruitment coordinator.", "Interview Questions": "What is one mistake you’ve made with a patient?"}, {"date": "1 Jun 2020", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Norton Healthcare in May 2020", "Interview Descriptions": "I applied online and was contacted about a phone interview. The interview was with a recruiter. She spoke extremely fast and I felt a little rushed the entire time. The whole interview was over in 10 minutes, after which I was still a little confused about the whole process. She sent my application to the floor manager where I was applying then it was up to them to decide on another interview.", "Interview Questions": "Tell us a time you went above and beyond ."}], [{"date": "1 Mar 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "2 interviews one via phone with the HR recruiter and then with the office manager. The questions were simple and expected. Everyone was friendly and I never felt intimidated. I would say overall the process was easy.", "Interview Questions": "Tell us a time when you went over and beyond "}, {"date": "12 Nov 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Oct 2019", "Interview Descriptions": "I applied online and got an email from an HR Recruiter the next day requesting a phone interview. After I completed the phone interview,  I received and email from a different recruiter to set up an interview with the hiring manager. Was interviewed by the ANM, who was very friendly. She gave me a tour of the unit and asked if I would like to come in and shadow a nurse for a few hours, which I thought was a great idea. I loved shadowing the nurse, it really gave me a sense of the unit environment. A few days after that I received a phone call from the recruiter with an offer.", "Interview Questions": "Describe a time when you had a difficult patient. "}, {"date": "3 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "was contacted via email by a recruiter and scheduled interview for a couple of days later, interview was with 2 managers, was pretty laid back, they described the position and hours needed, they asked me about my past experience, interview lasted about 30-40 minutes", "Interview Questions": "Do you have any pediatric experience?"}, {"date": "28 Aug 2019", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare", "Interview Descriptions": "Organized and flexible process but not very quick.  Worked around my schedule. Very pleasant and interviewer. Two interview process. Prior to interview being scheduled I was contacted by phone to discuss job I applied for and about any questions I might have.", "Interview Questions": "What was one conflict that you have come across and how did you deal with that? "}, {"date": "6 May 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Norton Healthcare in Apr 2019", "Interview Descriptions": "Phone screen was completed nearly three weeks after application was submitted, and I was told that I would hear back by end of the following week. That was five weeks ago, and despite reaching out via email and phone to follow-up, I have received no response and the online candidate space still reflects that I am \"under review with manager\". This is a common issue that multiple friends of mine have had with their interview process.", "Interview Questions": "N/A"}, {"date": "25 Apr 2019", "title": "Technical Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Norton Healthcare (Louisville, KY) in Feb 2019", "Interview Descriptions": "The hiring process seemed about average. Slow and communication was lacking.  3 interviews which all went very well.  It went so far as to having a director meeting and welcome. Now its up to HR and you will hear from them soon.  Multiple emails to recruiter and no response for 8 weeks.   Its supposed to be a good place to work but I am unsure if I would consider an offer at this point.", "Interview Questions": "Very few technical questions and more about fit with the team"}, {"date": "9 May 2020", "title": "Assistant Nurse Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Norton Healthcare in Feb 2019", "Interview Descriptions": "Quick interview with managers and ANMs. Also peer interview with staff. Met with manager one day, anms the next, and also did a peer interview with staff. \r\nThe interview was a quick process and was not asked any difficult questions. Manager was not familiar with interview techniques and asked some person questions that should not be asked during an interview.", "Interview Questions": "Why do you want this positon?"}, {"date": "27 Mar 2019", "title": "Senior Recruiter Norton Physician Group Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Norton Healthcare (Louisville, KY) in Jan 2019", "Interview Descriptions": "The interview process began with a phone interview with the recruiter. A few days later I was invited to an in person interview with the Recruiter and the Director of Recruiting. The interview was at a coffee shop and was extremely positive. Shortly after the first in-person interview I was invited back for an all day interview to meet with the recruiting team, hiring managers and Norton Physician Group leadership. I took off work and interviewed with 15 people, it was exhausting but I felt great about the interview. My experience began to go down hill after that. I was advised that a decision would be made about 3 weeks after my interview and I would be informed either way. After three weeks I followed up with Recruiter who told me they scheduled additional interviews and that they will keep in touch. Every other week I would hear from the recruiter and she would give a similar excuse, we have additional interviews, you’re still in the running please keep in touch. After two months of this the recruiter stopped communicating and I was never informed of the outcome.", "Interview Questions": "What interests you about this position? "}, {"date": "26 Oct 2021", "title": "Quality Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Norton Healthcare (Louisville, KY) in Jan 2019", "Interview Descriptions": "I had one short phone interview and then one interview over zoom with two of the fellows running the internship. I felt very welcomed and comfortable the whole time! They made me feel very wanted and valuable.", "Interview Questions": "How do you see yourself fitting in the Norton Healthcare culture?"}, {"date": "5 Sept 2018", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Sept 2018", "Interview Descriptions": "Short, uninformative, obvious disinterest in personal appearance of tattoos. Didn’t ask any questions, took me longer to get to the office than it didn’t for me to interview. I waited longer in the waiting room than the interview.", "Interview Questions": "I wasn’t as asked any. She asked me if I had any questions. I asked all my questions and literally had to ask her twice if she’s had any for me..."}], [{"date": "16 Aug 2021", "title": "Kitchen Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Jul 2018", "Interview Descriptions": "Questions are all about overtime and nothing else. Didn’t even talk about my resume or work history. I got the feeling they just wanted anyone to feel the position and I should’ve just ran for the door.", "Interview Questions": "Can you work all shifts and times"}, {"date": "14 Jun 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Norton Healthcare (Louisville, KY)", "Interview Descriptions": "Had two different jobs I 2nd interviewed for and then shadowed for a few hours. 1st job they hired someone else after I was told I had the job. But then they set me up with a different clinic where I interviewed twice then shadowed. I waited 4 weeks with out hearing anything back. I’ve emailed and called and still haven’t heard anything from them. Checked my status the other day and it was changed from interviewing to no longer in process. Now when ever I apply it is always auto declined it seems. My references where also never checked. It was a complete waste of my time. This was over 3 months. Recruiter never called back or emailed.\nTerrible.", "Interview Questions": "Mainly if you get along well with other people. They don’t care about your education or back ground. Just as long as you don’t gossip."}, {"date": "17 Dec 2019", "title": "PCA/Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare in Apr 2018", "Interview Descriptions": "The staff was easy to talk to. They made you feel like you were already part of the team. My first interview was with someone from HR and my final interview was with my current manager.", "Interview Questions": "What are your strengths?"}, {"date": "10 Oct 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Apr 2018", "Interview Descriptions": "There is an initial phone interview with the recruiter, and then you may be moved on to an interview with the hiring manager. Those interviews are done in the department for which you are applying.", "Interview Questions": "Why do you want to work for Norton Healthcare?"}, {"date": "1 Dec 2017", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Nov 2017", "Interview Descriptions": "Interview process was done through my college, questions was asked about myself and what nursing field was interested to me. They told me about the position and asked where I see myself in 5 years. The interviewers was very pleasant and seemed to really enjoy working for Nortons.", "Interview Questions": "Why Norton?"}, {"date": "6 Jul 2017", "title": "ER Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Jul 2017", "Interview Descriptions": "The manager asked me a few questions. Then told me about the specific facility. Told me what I should expect.  Then he explained what the training process was like. Lastly he expressed his philosophy about being kind to people.", "Interview Questions": "What do you know about our specific hospital?"}, {"date": "2 Apr 2018", "title": "CMA/LMR Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Norton Healthcare (Louisville, KY) in Jun 2017", "Interview Descriptions": "You meet with the center manager and assistant to discuss work history, years of experiences, any license or certifications that you may hold. They take you around the facility to meet potential coworkers.", "Interview Questions": "Do you work well under pressure? How is your time and attendance with current employer? What are 3 strength and weaknesses about yourself?"}, {"date": "9 Apr 2017", "title": "Admits Restive Clericsl Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare", "Interview Descriptions": "I completed an application online and attended an open interview. I arrived early but the several people were ahead of me and I waited with a large group to go upstairs to Doran to recruiter. They were very helpful and I was able to speak to several recruiters.", "Interview Questions": "What position did I feel I was best suited fir"}, {"date": "13 Apr 2017", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Feb 2017", "Interview Descriptions": "Emailed me for an interview after filing out several applications for over a year. I have learned from employees that work there that they are notorious for wasting people's time. They will interview far more candidates than necessary and turn down educated people with experience. Never even asked about my education, experience, my strengths; nothing that would have showcased my skills. Instead I was asked questions about arguing with co-workers. Waste of time.", "Interview Questions": "Tell me about arguing with your co-workers?"}, {"date": "28 Oct 2016", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Norton Healthcare (New York, NY)", "Interview Descriptions": "The Interview process was pretty casual. Reviewed resume and went over basic job responsibilities. Asked questions like why you should get the job, what is your availability like...etc. pretty standard interview questions.", "Interview Questions": "Why would you be a good fit for this position?"}], [{"date": "11 Sept 2016", "title": "PCA/UC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (New York, NY)", "Interview Descriptions": "I applied online to several positions received two phone calls within a week for two interviews awesome departments. I met with a recruiter then the unit manager. Everyone was friendly and it was a nice experience.", "Interview Questions": "Why do you want to work at Nortons/this unit? "}, {"date": "14 Jun 2017", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Aug 2016", "Interview Descriptions": "phone interview and them a in-person interview. main questions in regarding to team work and customer service scenarios. They usually go through the core things they are looking for in the position that you are apply for. in my case my manager explain the role for me and then asked if I would make a good fit with the information that she provided me.", "Interview Questions": "Am I able to multi-task "}, {"date": "9 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare in Jul 2016", "Interview Descriptions": "Phone interview with human resources, then in person interview  with management, also peer interview with those working at the location.  A tour of the area was given.  Ultimate job offer is done through human resources.", "Interview Questions": "Tell me a time when there was a disagreement between you and and a co-worker and how did you handle it?"}, {"date": "7 Mar 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Mar 2016", "Interview Descriptions": "Wasted a lot of my time. Took only 2 days for 1st phone call from HR recruiter. After brief conversation she scheduled me for a 2nd interview with a 2nd HR recruiter a week later. When the 2nd recruiter interviewed me I was told the position had already been filled! WTH? Wasted weeks my time completely.", "Interview Questions": "Basic questions + How did you deal with a difficult manager? "}, {"date": "14 Jan 2016", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Norton Healthcare", "Interview Descriptions": "I applied online and the next day I received an email from a recruiter to contact her if I was interested. I had an over the phone discussion with the recruiter and an HR interview was set up for the following week. HR interview was quick and mostly a chat about what I wanted from a career, my goals, and a couple tell me a time questions. An interview was scheduled for the next day with actual department.  The interviewer told me the questions she asked were based on my answers to the assessment. My recommendation would be to be honest on the assessment so the questions go hand in hand with who you are. Very laid back and interviewer made me feel comfortable.", "Interview Questions": "Tell me a time you made a mistake. What happened? What did you do to resolve the mistake? What was the outcome?"}, {"date": "4 Mar 2016", "title": "Practice Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Jan 2016", "Interview Descriptions": "The 1st interview via phone, second with Chief of Clinical Services, and a follow up with fellow practice managers. Telephone interviewer was less professional than she should have been. She directly told me that the clinic staff has major team structure issues.", "Interview Questions": "What is your greatest weakness."}, {"date": "22 Jun 2015", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Norton Healthcare", "Interview Descriptions": "Applied around midnight. Got a call next day. Went to interview with HR 5 days later. And interviewed with the unit manager the same day. Got an offer 2 days later.", "Interview Questions": "Tell me about yourself?"}, {"date": "12 Oct 2015", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Jun 2015", "Interview Descriptions": "Norton human resources is a joke. First you get an email asking for you to call to discuss your resume. I called and left a voicemail, waited 24 hours with no return call. Called the following day 3 times and finally got an answer. Human resources completed a fast phone interview then requested to come in for an in person interview. Went to the in person interview then sent to the site manager. Was told I would hear something back within a week or two. No call no email. I proceeded to call to follow up left voicemail with no call back or never an email and now it is 4 months later. If the job was offered I would decline due to unprofessionalism of there human resources department and of how the attire and attitude of the human resources clerk. This girl looked at you very rude and irritated if you couldn't answer a question fast or well enough. Oh and also dressed very unprofessional and looked way to young for her current role/job.", "Interview Questions": "Give an example of a time you made a mistake and how you fixed it and who you reported to."}, {"date": "27 Apr 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Norton Healthcare", "Interview Descriptions": "Submitted application online. Received an email approximately 2 weeks later requesting a phone interview with HR. Approx. 1 week after phone interview set up interview with unit manager. Received offer 3 weeks later. All pretty standard as far as questions related to nursing background and experience. Toured unit with manager and given run down of how unit operated.", "Interview Questions": "How do you handle constructive criticism?"}, {"date": "4 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Philadelphia, PA) in Mar 2015", "Interview Descriptions": "I had to go through three rounds: two phone interviews (one screening with HR and other with the manager) and last was skype interview with a panel of three members.", "Interview Questions": "general behavioral questions."}], [{"date": "7 Jul 2015", "title": "Security Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Dec 2014", "Interview Descriptions": "Contacted via phone, short interview, set up actual interview a week later. Completed interview w/ recruiter and director, set a up a walk though and meet peers a week later. completed walk though offer came a couple days later and accepted. Process took roughly 3 weeks.", "Interview Questions": "N/A"}, {"date": "17 Sept 2016", "title": "Nurse Navigator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Norton Healthcare (Louisville, KY) in Nov 2014", "Interview Descriptions": "Had NINE interviews prior to being hired from November-January with everyone from Corporate HR to hospital specific COO, to unit managers as well as having to create a presentation on a program I would implement to create positive culture change. The offer was made in mid January and I started in the role in February.", "Interview Questions": "What strengths do you have that our patients will benefit from?"}, {"date": "4 Sept 2014", "title": "PCA and RN-BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY)", "Interview Descriptions": "While Norton is a really popular job choice for the region, it also makes it quite difficult to secure an interview (even with a great resume).  There are just so many applicants that it can be difficult to get noticed.  If you happen to know someone who can put in a good word with a manger to draw attention to your application, that is a huge plus.  It's a big company so there are a lot of steps and hoops to get hired.  I think the two keys are to A. know someone (maybe volunteer just to get your foot in the door) and to B. be vigilant about contacting HR once an application has been submitted.  Obviously don't harass them, but if you don't hear something when you think you should (use good judgement) contact someone.  They need to know you really want a job with Norton.  That's just been my experience and the experience of others I have spoken to.", "Interview Questions": "The most challenging interview question I got was regarding time management.  This particular manager wanted a specific example of when I had needed more time, what I did to get/not get my responsibilities completed, and how it turned out.  She asked the question and I had to recall something on the spot.  It was really challenging because when does a PCA/nurse NOT have a time crunch and require some rearranging to get every thing done?  That's like, a requirement of the job.  So the request to recall one specific incident really threw me off."}, {"date": "23 Apr 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Aug 2014", "Interview Descriptions": "This is interesting.  Since so many people apply for employment at Norton Healthcare, you had better know a manager.  The manager will then \"pull\" your application.  Otherwise, for reasons that cannot be fathomed, you will receive an automatic rejection letter.  HR staff is distracted, make errors; some serious and some not so serious.  The interview itself is the usual tell me about a time when...and you showcase how awesome you are about dealing with the difficult patient or family member etc.  You then have an interview with the manager of the floor followed by a peer interview.  The peer interview is essentially to see if you will be a good fit for the floor, for the other staff, the workload etc.", "Interview Questions": "Tell me about a time you had to deal with a difficult patient or family member.  What did you do.  How did it work out."}, {"date": "4 Aug 2014", "title": "Receptionist/PCA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare in Jul 2014", "Interview Descriptions": "After 2 years of putting in applications, I finally got a phone call to set up an interview. I set up my interview for the following week. Once there, it took 20 minutes for the recruiter to call me back. She opened the door rudely, and began to try to walk me back to her office in shoes that she clearly does not know how to walk in. Once there, she asked me the same generic questions they all ask. Then kept asking me if I had any questions for her, and seemed annoyed that I did not have that many. This was the worst interview I have ever had, and I do great at interviews. She made me feel very uncomfortable, and she was quite rude to me. I don't know if she was being so short because she had a lot of people to talk to and she was running behind, but she said she would pass my resume along and someone will email me to set up the second interview. That was almost a week ago and I am still waiting for that email.", "Interview Questions": "The same questions you are always asked at interviews"}, {"date": "20 Jul 2016", "title": "Environmental Services Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Jun 2014", "Interview Descriptions": "The interview process was handled very professionally. The interviewees were very thorough in explaining the position and details of the job as well as the benefits of working for the company.", "Interview Questions": "How can you use your customer service and management experience to help build our department?"}, {"date": "27 May 2014", "title": "HVAC Mechanic Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Norton Healthcare", "Interview Descriptions": "Phone call from the recruiter = Interview with the recruiter = Interview with the Supervisor and the Director = Phone call offering me the job. I accepted the job, and was told when to report for orientation", "Interview Questions": "Have I ever been shocked by high voltage (277v or 480v)"}, {"date": "25 Apr 2014", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Norton Healthcare (Louisville, KY)", "Interview Descriptions": "Initial communication directly from hiring manager for clinical research coordinators. Asked very thorough questions about clinical research and my previous duties.", "Interview Questions": "N/A"}, {"date": "14 Feb 2018", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Apr 2014", "Interview Descriptions": "I did three interviews overall, and they all went pretty well. The interviewers were really nice which made the interview process more comfortable. It took them a bit time to get back to me, but eventually the offered me a position and I accepted it.", "Interview Questions": "How did you confront someone when you realized they were doing something wrong? "}, {"date": "7 Mar 2014", "title": "Anm Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Norton Healthcare", "Interview Descriptions": "Great process once you make it through Human Resources.", "Interview Questions": "Describing personal faults."}], [{"date": "19 Apr 2016", "title": "Weekend RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Mar 2014", "Interview Descriptions": "Waited a long time for HR to call. Interview with Nurse Manager and peers. Hiring process was in a reasonable time. On-Board process was excellent and very organized. Good amount of information was provided. Friendly interviewers.", "Interview Questions": "Describe a situation where you had to deal with a difficult patient."}, {"date": "20 Mar 2017", "title": "Authorization Management Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Feb 2014", "Interview Descriptions": "Not too bad; I had two interview and then they made their decision.  The interview was conversational and that made it a little less intimidating.  I enjoyed the process and was very excited to work for Norton Healthcare.", "Interview Questions": "What are your strengths and weaknesses."}, {"date": "27 Jan 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Norton Healthcare", "Interview Descriptions": "I applied online for several jobs.  After checking my email I came across an email that says\" You have been selected for an interview with Norton healthcare\".  All the scheduling was done online via email.  After you contact them by email you feel out your pre employment screening before the interview date.  First interview was with a recruiter then interviewed at a later date with nurse manager and DON.  Very positive experience and received the best treatment during all interviews.  I saw staff all smiling and welcoming.  Over 90 percent made eye contact and made some sort of conversation.", "Interview Questions": "The most difficult thing was being selected for the first interview.  The whole process is very organized and they help you every step.  "}, {"date": "21 Feb 2014", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Norton Healthcare (Louisville, KY) in Jan 2014", "Interview Descriptions": "Generic questions about \"Name a time when you...\" Interview was fast paced however the interviewer seems too young for the position. Just went through the script with no detail into my background. The company does have a great benefit package for full-time help which is the main reason to apply if you like the Louisville area. Pay comes second.", "Interview Questions": "Basic questions to get a detailed response. The same 5 HR has used for 10 years."}, {"date": "15 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Norton Healthcare (Louisville, KY) in Sept 2013", "Interview Descriptions": "Screened by recruiter, contacted and interviewed by Nurse manager. Called back to meet with ANM's and other staff for peer interview. Kept me well informed throughout the process, everyone was very helpful and kind.", "Interview Questions": "How do you deal with an employee argument or conflict?"}, {"date": "10 Jan 2014", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Norton Healthcare (Louisville, KY) in Aug 2013", "Interview Descriptions": "online application, face to face interview", "Interview Questions": "Describe a difficult client you had and how you addressed the issue."}, {"date": "9 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Norton Healthcare (Louisville, KY) in Feb 2013", "Interview Descriptions": "I was approached at a career fair at my high school. There was a back and forth between myself and the recruiter. I later submitted the application online (which took half an hour) and send a cover letter to the recruiter I talked to at the job fair. I had a phone screen about a week later. Three weeks after that I came in for a full interview with 4 different people.", "Interview Questions": "What has been your biggest challenge to day?"}, {"date": "29 Aug 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Norton Healthcare (Louisville, KY) in Nov 2012", "Interview Descriptions": "The interview process was pretty straight forward.  There were questions about past experience, situation questions, education, and past job experience.  There was also a discussion about schedule availability.", "Interview Questions": "What have you done recently to ensure patient safety?"}, {"date": "15 Jul 2012", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Norton Healthcare (Louisville, KY)", "Interview Descriptions": "It took a while to get an actual interview. Continue to submit applications even after you receive the standard \"While your credentials are impressive, we have decided to move on wit other applicants...\" because that will keep you in the system. After about 3 months I received an email telling me there would be a job fair and to submit an application for review.", "Interview Questions": "I always find the most difficult question with these types of positions is \"Why do you want to be a [housekeeper] with our company?\" Come up with something creative or original, because we all know the answer is \"Because I need the money\" rather than \"I love to clean dirty rooms!\""}, {"date": "27 Sept 2012", "title": "Medical Transcriptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Norton Healthcare (Louisville, KY) in Jul 2012", "Interview Descriptions": "The initial communication and the interview process were great.  It was hearing from them after the interview that was horrible.", "Interview Questions": "Describe a time when you overcame conflict."}], [{"date": "1 May 2012", "title": "Supervisor Network Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Norton Healthcare (Louisville, KY) in Apr 2012", "Interview Descriptions": "The interview went great, but still have not heard from them about the position.  They said that they would let me know something within the next week or so, and still have not heard from them. \r\n\r\nI felt like it was a great match.", "Interview Questions": "Where do you see yourself in 5  years."}, {"date": "3 Jun 2012", "title": "ICU/OHU At Norton Audubon Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Norton Healthcare (Louisville, KY) in Apr 2012", "Interview Descriptions": "I applied for multiple positions online. I was emailed an offer to interview with nurse manager directly. When meeting with the nurse manager, she asked basic questions such as \"Why do you want to work on ICU?\" and \"Why did you choose Norton Healthcare or choose Nursing?\" At the end of the interview, she stated I would be contacted regarding completion of a peer interview. Within two weeks, I was called and offered a range of times to interview. At the peer interview, I met two employees and was asked questions such as \"How do you work in a fast-paced environment?\" or \"Why did you choose critical care?\" and \"How do you deal with stress?\" Though I was not offered a position on this unit, I later accepted a position at Norton Healthcare.", "Interview Questions": "How do you feel about working in a fast-paced environment?"}, {"date": "19 Sept 2012", "title": "HRIS Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Norton Healthcare (Louisville, KY) in Mar 2011", "Interview Descriptions": "1st, phone interview with recruiter; then a face to face with supervisor and coworker.", "Interview Questions": "The typical questions, why are you looking to leave your current employer? Can you tell me how you handled a difficult situation? How did you  handle a problem?"}]]