[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Teaching at Dubai Men's College", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Apr 2017", "job_title": "Faculty in Dubai", "duration": "N/A", "pros": "Financial package includes travel and educational expenses", "cons": "Long lecture hours\r\nTextbook are imposed by management"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "A roller coaster ride over 10+ years of ups and mostly downs seeing 5 director changes in 4 years, lowering th standards", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "28 Jun 2014", "job_title": "Faculty in Dubai", "duration": "N/A", "pros": "The location is fine with opportunities to develop and improve yourself. Still considered to be one of the better employees in the UAE, but there are better opportunities these days in smaller organizations.", "cons": "In an effort to justify cuts and a massive increase in work-load the amount of tracking and written justification needed to fail a student has gone through the roof. Whereas class sizes were under under 20 and contact hours were a maximum of 20, these are distant memories. Back-stabbing is rife and you really have to be careful of your p's and q's if being critical."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Review of Abu Dhabi Men's College", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 May 2016", "job_title": "English Faculty in Abu Dhabi, Abu Dhabi", "duration": "N/A", "pros": "Good IT support, well-equipped classrooms with Interactive white boards, teacher computers; all students either have laptops or ipads. Good professional development opportunities, onsite training and training at conferences; educational software freely available on college licence: Soft Chalk, Study Mate", "cons": "Salaries have been frozen for some years now, no longer keep pace with inflation; school fees paid, but fees have gone up; accommodation provided, but rents are going up every year and accommodation allowance does not. Some teachers are forced to top up school fees and rent from their salaries. The Higher Colleges are under pressure from the U.A.E. government to cut spending, many expat teachers' contracts haven't been renewed. New salaries will be around half of what they were."}]]