[[{"date": "11 Sept 2022", "title": "Events Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Junior Acheivement", "Interview Descriptions": "Good I liked it the environment was nice and they gave me  time to ask  answer questions about the job and how intense it is. They also were very understanding of the remote availability of the job", "Interview Questions": "How would you be able to handle the day to day activities of this organisation and meeting its demanding tasks "}, {"date": "21 Jul 2022", "title": "Education Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Junior Acheivement", "Interview Descriptions": "Key people in charge were very nice and polite. My last interview with a board member was rather the cliche of an old corporate male, expressing his discomfort at my assertiveness. It was rather awkward.", "Interview Questions": "What role had the private sector on educational equity?"}, {"date": "24 Feb 2022", "title": "ESTÁGIO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Junior Acheivement", "Interview Descriptions": "Online rapido e objetivo\r\nRecrutador calmo. Me deixou tranquilo e confiante para explicar todo o meu perfil profissional\r\nDepois do rh tee entrevista com supervisor que tambem foi tranquilo\r\nSem mais o que complementar sobre a entrevista", "Interview Questions": "Pontos fracos e fortes\r\nPlanos para 5 anos"}, {"date": "17 May 2022", "title": "Estudiante Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Junior Acheivement (Buenos Aires) in Feb 2022", "Interview Descriptions": "Fue una entrevista grupal, con una psicologa muy amable y respetuosa, que nos hizo preguntas personales y juegos grupales, para acceder a una de las becas que llevan adelante junto a Google.", "Interview Questions": "nos pidieron que nos presentáramos en unos pocos minutos. \r\nnos contaron sobre el programa, nos preguntaron algunas cosas sobre nosotros y nos hicieron hace r una actividad en grupo "}, {"date": "18 Apr 2022", "title": "Outreach Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Junior Acheivement (Elizabeth, NJ) in Feb 2022", "Interview Descriptions": "Had a great interview, followed up a few times on the status and no one responded.  I understand if someone does get the position, but it would have been nice to get a responds from the interview team", "Interview Questions": "Basically they asked background questions about my experience and teams I have worked with"}, {"date": "31 May 2022", "title": "Becario Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Junior Acheivement in Jan 2022", "Interview Descriptions": "Fue muy buena experiencia la entrevista para acceder a una beca, me sentí cómoda, tuvimos un espacio de presentación y luego desafíos de integración grupal. La entrevistadora supo manejar al grupo y llevar tranquilidad a quienes atravesaban su primer entrevista.", "Interview Questions": "Definirme en una palabra y explicar - Breve presentación"}, {"date": "2 Jul 2021", "title": "Alumno aprendiz Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Junior Acheivement (Buenos Aires) in Feb 2021", "Interview Descriptions": "la verdad que me gusto mucho paciente, cálido y buen servicio muy recomendado para todo aquel que quiera entrar en el soporte it de google\r\n\r\nPor otro lado, estaba nervioso y me hicieron sentir tan comodo que se no se me noto", "Interview Questions": "Por que elegiste esta beca?"}, {"date": "11 Feb 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Junior Acheivement (Mendoza) in Nov 2020", "Interview Descriptions": "Fue postulacion interntet, contacto telefonico. Todo muy cordial y notificado paso a paso. El trato fue muy profesional y adaptado al puesto.  Aun el proceso sigue abierto y esta por definirse.", "Interview Questions": "Porqué me interesa la posición? Que puedo aportar? Cual es mi experiencia?"}, {"date": "11 Jan 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Junior Acheivement (Las Vegas, NV) in Jan 2020", "Interview Descriptions": "No respect for my time or person \r\nThey only interviewed me because I’m a person of color but had no intentions of hiring me. I received the decline for job half an hour after the interview.", "Interview Questions": " None relating to the position "}, {"date": "11 Dec 2019", "title": "Interpreter/Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Junior Acheivement (Tallinn)", "Interview Descriptions": "They just asked me several Questions and this was all. To be honest it was just a friendly meeting  and it was perfectly done .and i am very proud of this company and myslef as well,becouse the company was very well known in the world", "Interview Questions": "what was your last job"}], [{"date": "12 Mar 2017", "title": "Database Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Junior Acheivement", "Interview Descriptions": "I completed a phone interview with HR, online testing, and one in-person interview with a team member of the department I was interviewing for. They were very interested in making sure that not only would I have the necessary skills for the job, but that I would be a good fit for the position in terms of personality and culture. They wanted to make sure I would be happy there in the long term and they had several staff members that had been there for years. They told me the person who had been in the position previously had left for because she was wanting more face-to-face interactions with donors, which this position did not really have at all. The next step in the interview would've been a panel interview, I think, but I opted not the move forward.", "Interview Questions": "Tell me about a time when you had a job to complete and your priorities conflicted with the priorities of another department or employee."}, {"date": "6 Oct 2016", "title": "Special Events Volunteer Liaison Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Junior Acheivement (Tempe, AZ) in Sept 2016", "Interview Descriptions": "The interview was with the CEO and the project mgr that was low key and relaxed. The interview lasted 30 minutes. They gave me a general description of what they thought the job requirements would be since this was a new position. Then they asked how I felt I could meet their needs.", "Interview Questions": "Under what circumstances would you to leave this position if you are hired?"}, {"date": "3 Dec 2018", "title": "Special Events Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Junior Acheivement (Chicago, IL) in Mar 2016", "Interview Descriptions": "First you had a phone interview, then they sent you a personality test. After that they emailed you a presentation you were asked to make changes and then present the project via powerpoint after your face to face interview.", "Interview Questions": "Experience"}, {"date": "12 Aug 2018", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Junior Acheivement (Lima, Lima Region) in Apr 2015", "Interview Descriptions": "is really simple, you only need to be on time,have your cv printed just in case. i only had 1 interview,attitude is a plus. cant remember more about it, since it was a long time ago.", "Interview Questions": "why i wanted the position?, what was my job experience?"}, {"date": "13 Jun 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Junior Acheivement", "Interview Descriptions": "I had one interview in person. In order to prepare for this interview, I had to create a presentation and pretend I was presenting to teachers at a school. For this I created a powerpoint, although just a verbal presentation was all that was required. I also had a behavioral-based test that was online.", "Interview Questions": "I don't remember anything being difficult or unexpected."}, {"date": "8 Apr 2014", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Junior Acheivement (Tempe, AZ)", "Interview Descriptions": "4 Interviews, 1 Phone, 1 Direct w Manager, 1 Panel, 1 w the President", "Interview Questions": "They asked a lot of questions about negative qualities. "}]]