[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An amazing, inclusive charity who cares for their staff like family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Nov 2020", "job_title": "Fundraising Manager in London, England", "duration": "N/A", "pros": "Forward thinking organisation achieving amazing results\r\nPositive, inclusive workplace culture\r\nA creative, progressive charity who embrace change and development\r\nYou feel valued\r\nMany opportunities for career development and to gain experience in other areas of the charity\r\nAn organisation where you are really making a difference in the world\r\nAll employees' opinions and ideas are valued and taken on board\r\nFlexibility\r\nOpportunity to work across a global platform\r\nAnimals Asia is a thought leader in animal welfare as well as fundraising\r\nSense of fulfilment as you make a difference every day\r\nWorking with like-minded people", "cons": "Must be comfortable working remotely\r\nNaturally, if you are based in the UK, you cannot often physically see the achievements made by the charity in Asia. However, frequent, daily updates are provided through a variety of communication mediums. As a result, you feel included in all developments, achievements and progress made which are celebrated globally"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A dream organisation to work for if you're passionate about animal welfare", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Oct 2020", "job_title": "Digital Fundraising Executive in Reading, England", "duration": "N/A", "pros": "A 'family' atmosphere with a real buzz about the cause\r\nFlexible working \r\nNo commuting (unless for the occasional meeting)\r\nInternational experience\r\nGenuinely friendly and kind colleagues\r\nSupportive and understanding colleagues\r\nFun and challenging \r\nFulfilling \r\nYour input is valued and listened to\r\nYou feel close to the rescued bears through updates from the sanctuary teams\r\nYou feel close to the programs teams through excellent online communications\r\nPossibility of visiting the sanctuary (I was lucky enough to)\r\nAnnual get-togethers \r\nPossibility of moving roles and progressing within the organisation", "cons": "If you're not strict with yourself, working remotely can be difficult. It can also be quite isolating. But this can be managed and other Animals Asia employees are supportive and can help you."}], []]