[[{"date": "6 Apr 2023", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at AAMC", "Interview Descriptions": "They emailed me for a phone screening then didn’t get back to me until almost two weeks later to set up the phone screening. After the call, I never heard back. The recruiter didn’t ask any job related questions. They seemed super unprepared and unprofessional.", "Interview Questions": "What is your writing style?"}, {"date": "12 Jan 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAMC", "Interview Descriptions": "I had a standard whiteboard interview, was asked Object Oriented Programming questions. No leetcode style questions were asked of me. Had a phone screen prior. Interview was in-person and was only one round.", "Interview Questions": "How would you design the architecture for a website?"}, {"date": "7 Nov 2022", "title": "Accounting Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAMC in Oct 2022", "Interview Descriptions": "Applied online, HR reached out a few days later to set up an initial screening call. That only lasted about 10-15 minutes, they had very few questions. I thought the call went very well and was told I would be contacted in a few days about next steps. Then I was ghosted. Learned I likely wasn't moving forward when I logged into my Workday account and saw my application had been changed to 'inactive'. From reading other reviews this seems to be common practice here.", "Interview Questions": "What is the size of your current annual budget?"}, {"date": "30 Aug 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AAMC (Washington, DC)", "Interview Descriptions": "One-round interview, with the team that you would be working on. Very friendly and straightforward. I heard back quickly after the interview with an offer, though it was very shortly before the start date.  Overall good experience.", "Interview Questions": "Why do you want to work at AAMC?"}, {"date": "3 Oct 2022", "title": "Health Equity Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at AAMC in Aug 2022", "Interview Descriptions": "There were three interviews for the entire process: (1) phone screen with HR, (2) 1:1 with the hiring manager/supervisor, (3) panel interview with the hiring manager/supervisor and two others. I completed the first two interviews and was waiting for the third. It took three weeks for them to get back to me after the second interview and another week after that to schedule me for one week later. I originally accepted the third interview but ended up canceling because I received another offer during this waiting period. The interviews itself weren't bad but the entire process from when I submitted my application to my third interview was 9 weeks. Very long and slow interview process.", "Interview Questions": "Describe your experiences with data analysis and how they relate to the current position."}, {"date": "16 Jul 2022", "title": "Administrative Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AAMC (Washington, DC) in Jul 2022", "Interview Descriptions": "The first round was a phone screen that lasted 30mins. Was asked to provide overview of my work experience and why I choose AAMC. Was provided with an overview of the company and the role. Informed about manager’s personality and next steps to interview with the manager and the final stage was an interview with 4 panelists. At the end of the interview I was told I would be advanced to the next level as I was a perfect fit. Never heard back.", "Interview Questions": "Do you have project and administrative experience?"}, {"date": "2 Jul 2022", "title": "Summer Las Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AAMC", "Interview Descriptions": "Pretty chill. Be yourself and show the attorneys who you are. They are receptive to your perspective and welcome it. Come with questions to ask because the website isn't clear on what type of work they do.", "Interview Questions": "What was my favorite part of law school? "}, {"date": "15 Jun 2022", "title": "Constituent Engagement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAMC", "Interview Descriptions": "Received an immediate request for screening interview. Was  told I had all the qualification to fit the position and would be recommended to move on. Received an email that I was no moved to the next step, then a few days later received a request for a interview with hiring manager.  Verified which email was the error. \r\nOn the interview with the hiring manager, I was told that I had come highly requested and they were excited about my application, by the end of a very odd interview I was told they typically hire from within the organization. I have not heard from the organization since. The entire process felt very unprofessional.  When I asked questions at the end of the second interview the tone of the interviewer changed and could tell they were annoyed by the questions.", "Interview Questions": "Asked very basic questions about my skills in different programs and asked about my administrative skills. "}, {"date": "25 May 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC in May 2022", "Interview Descriptions": "Applied online. Had a phone screen where the recruiter said she would passing my information along and I would hear from her that day or the next day. She ghosted and never responded again.", "Interview Questions": "Q: Tell me about yourself."}, {"date": "4 May 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AAMC in Apr 2022", "Interview Descriptions": "-Applied online\n-Received email asking for available times\n-They missed my reply and didn’t respond until more than a week later\n-Set up phone screen\n-I called in and they were a no-show!\n-Apology sent, mtg rescheduled\n-Had interview; they were inflexible about a piece of software not specified at all as a dealbreaker in the description \n-Said they’d let me know within 24 hours\n-I sent thank you note\n-No response weeks later, the end.", "Interview Questions": "Why are you interested in this position"}], [{"date": "24 Feb 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAMC", "Interview Descriptions": "I applied and had a phone screen with their recruiter. They said they would get back to me the next day...never heard from them again and they stopped responding to my emails.", "Interview Questions": "Q: Tell me about yourself and your background."}, {"date": "21 Feb 2022", "title": "Public Affairs Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAMC", "Interview Descriptions": "The first step in the hiring process was a phone interview with human resources. Afterwards, I did an interview with the hiring manager. After that was a panel interview with about five different people. The chief of the department, government affairs, the junior team member, and the hiring manager again. After the panel interview is a writing test where you have to create a press statement and a strategy from a document. They make the decision after that.", "Interview Questions": "Tell me about a time you made a mistake at work. What happened and what did you learn?"}, {"date": "20 Jan 2022", "title": "Database Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAMC", "Interview Descriptions": "The interview process was quite lengthy, it took up a whole day (if I remember correctly it was from 9 am to 4 or 5 pm) - meeting many different people from various teams. The process is a bit tedious and doesn't allow demonstration of actual skills.", "Interview Questions": "Typical HR questions, plus some low level programming questions."}, {"date": "14 Jan 2022", "title": "Legislative Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AAMC (Woodridge VI, AZ) in Jan 2022", "Interview Descriptions": "Went through six touch points before being rejected to advance to a writing sample round. Rejected on the basis of my policy passions (gender equity in healthcare). Supervisor seemed very anti-woman.", "Interview Questions": "What are your policy passions? "}, {"date": "14 Dec 2021", "title": "Gender Equity Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAMC", "Interview Descriptions": "There was first a phone call screening, which followed by a video interview with supervisors I will be working with. And got the decision the second day after my interview", "Interview Questions": "How do you deal with conflicts in the workplace?"}, {"date": "15 Sept 2022", "title": "Vice President Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AAMC in Oct 2021", "Interview Descriptions": "There was an initial recruiter screening, then an interview with the division leader. Then a full day of 5 interviews with 8 people. The questions were situational. They did not allow much time for me to ask questions. If interviewing with this organization, ask at the start of the interviews for time to ask questions and/or strive to insert your questions during the conversation. ", "Interview Questions": "Explain a time where you had to negotiate something with a leader. "}, {"date": "28 Jul 2021", "title": "Research and Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AAMC", "Interview Descriptions": "Lengthy but straightforward—interviewed with eight to ten other data analysts and senior data analysts, three managers, and the director over about 5-6 hours of interviews. Most interviews were very pleasant. However, in my one-on-one with the director, he made a point of calling out what he thought was a grammatical error in my cover letter at the end of my interview, condescendingly saying that even though I was an impressive candidate \"this grammatical error is a good example that we can always do better\". What grinded my gears was that it wasn't truly a grammatical error, either—just a difference in writing styles—but I did not feel like debating considering the power differential.", "Interview Questions": "Tell us about a time you had to juggle multiple competing priorities."}, {"date": "9 Jun 2021", "title": "Temp Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at AAMC in Jun 2021", "Interview Descriptions": "First interview with person currently in the role, second with the hiring manager. Both were very conversational. They didn't actually ask me much about myself so I had to make sure to make my points in other ways.", "Interview Questions": "How do you keep yourself organized?"}, {"date": "13 Mar 2021", "title": "Graduate Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at AAMC", "Interview Descriptions": "It was a multi-step process. I had two interviews, expecting a follow-up regarding my application. The hiring contact and the recruiter did not follow up, after I reached out to them multiple times.", "Interview Questions": "How do you manage your tasks?"}, {"date": "17 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC (Washington, DC) in Mar 2021", "Interview Descriptions": "It was a very positive experience. Everyone was very supportive and wanted me to succeed in my academic and professional endeavors. The interview process was very relaxed, and I did not feel pressured at all throughout the entire process.", "Interview Questions": "Tell me about yourself. and tell me about your background."}], [{"date": "10 Aug 2022", "title": "Operations Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AAMC (Fairfax, VA) in Mar 2020", "Interview Descriptions": "The interview process was wonderful! The interviewers were friendly and made one feel calm and less nervous.\nOnce can easily discuss their skills, expertise and job description without feeling they are on the hot seat.", "Interview Questions": "How would you prioritize an urgent client request?"}, {"date": "14 Dec 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at AAMC", "Interview Descriptions": "Panel interview setup. Interviewed with a group of people, at various times, with many of them currently working on the team.  Panel interview setup. Interviewed with a group of people, at various times, with many of them currently working on the team.", "Interview Questions": "Why are you interested in the job? Tell us how you found the job and what led you to apply? What can you offer us?"}, {"date": "12 Sept 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AAMC (Annapolis, MD)", "Interview Descriptions": "The first interview  is on the  phone  second one face to face with recruiter and supervisor  and typing test to check how fast you can type. You have to pass in 40 wpm if you don't pass you have to retake it again.", "Interview Questions": "What are your greatest professional strength?"}, {"date": "3 Oct 2020", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AAMC in Jul 2019", "Interview Descriptions": "It was very direct, they were professional, expressed interest in what I had to say and gave great feedback\r\nThey informed me that they would respond with a certain timeline and they did", "Interview Questions": "Tell us about your research experience "}, {"date": "7 Feb 2020", "title": "Meeting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC in Jun 2019", "Interview Descriptions": "It was a standard interview process where I first received a call from their talent acquisition team and then had 3 rounds of an in-person interview. \r\n\r\nFor each of the in-person interviews, I had to miss work. After two weeks, I reached out to see if they had made their decision. Only to be disappointed that I did not receive a courtesy email after the last interview that I did not get a job offer.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Jan 2019", "title": "Program Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAMC (Washington, DC) in Jan 2019", "Interview Descriptions": "I interviewed with AAMC during Dec 2018 and Jan 2019.  I submitted an online application and was promptly contacted by a recruiter,  who I later spoke on the phone with for about 30 minutes. I then spoke with the director of the team by phone as well. Following that conversation, I was brought in for an in-person interview with 4 members from the team.  I promptly heard from the recruiter with an offer several days later. \r\n\r\nThis was one of the smoothest interview processes I have ever participated in. The recruiter was constantly in communication with me, providing clear expectations of next steps and what the timeline looked like. It was great to have a dedicated point of contact, and the recruiter was always quick to answer any questions and to receive feedback. My interactions with the recruiter were just one example of the positive and welcoming culture that I experienced at AAMC throughout the interview process.", "Interview Questions": "What was the toughest or most significant piece of professional feedback you have received from a supervisor?"}, {"date": "24 Jan 2019", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at AAMC (Washington, DC) in Dec 2018", "Interview Descriptions": "Phone interview followed by an in-person interview. I met with three people from various groups who I would be working with. A quick process that wasn't dragged out unnecessarily.", "Interview Questions": "They asked for a writing sample"}, {"date": "3 Feb 2019", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at AAMC in Nov 2018", "Interview Descriptions": "A phone interview with HR and then hiring manager.  Came in for in-person interview with 3 people. Good questions were asked. But definitely got the feeling that there is a lot of communication and collaboration issues across depts. Also the job description had changed or was being reworked by the time I came in for the in-person interview. The time between interviews was quite long and HR was slow in getting back.", "Interview Questions": "How do you work with people that are very intelligent/doctors who might want to get involved with your job?"}, {"date": "8 Aug 2018", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at AAMC", "Interview Descriptions": "There were multiple rounds of interviews with multiple people for a low level position. It is a complete waste of time. It shows how decisions are made - they need 10 people to weigh in on everything, everything at the AAMC has lots of extra unnecessary steps, no respect of people's time. It also took 6 months. 6 months to find an admin+. A normal organization could make a decision.", "Interview Questions": "Do you like to collaborate?"}], [{"date": "7 Aug 2018", "title": "Government Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAMC in Jun 2018", "Interview Descriptions": "Applied via web, contacted within a few days. Had a phone interview asking for more elaboration on resume.  Interviewer was very pleasant and said I'd be contacted soon to set up another interview. Never heard back.", "Interview Questions": "Tell me about yourself. "}, {"date": "4 May 2018", "title": "Research and Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AAMC in Apr 2018", "Interview Descriptions": "It is super intense. You will have to apply online and there are several steps after that. They will ask you to send writing and code samples. They did a video interview, which is stupid. I want to see your actual office. They rejected me but I wouldn't have accepted if I was offered based on my interview experience. Then they will make you meet 12 people on WebEx. It's like they can't make a hiring decision. Other companies just do one phone interview and then on-site. Well, not at AAMC.", "Interview Questions": "What would you do if you made a mistake?"}, {"date": "8 Feb 2018", "title": "Meeting Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at AAMC (Washington, DC)", "Interview Descriptions": "I interviewed with 3 people, I thought it went well. It's been three weeks since I've heard anything back from them. I emailed the recruiter and received no response. I think it's very unprofessional. I'm assuming that I didn't get the job since I have not heard back but at least have the decency to let me know.", "Interview Questions": "Tell me about yourself?"}, {"date": "24 May 2018", "title": "Lead Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at AAMC (Washington, DC) in Jan 2018", "Interview Descriptions": "The phone screen went well but the phone interview felt weirdly hostile and aggressive. There was also no feedback and I had to follow up twice just to figure out what was going on. At the end of the phone interview, I was asked about my availability to come into the office (dates,etc.) Then it was just crickets. It is very unprofessional to not follow up at all. Even a generic email goes a long way.", "Interview Questions": "Tell us about your experience at your last job and how it applies to this current position."}, {"date": "6 Apr 2018", "title": "Architect Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at AAMC (Washington, DC) in Jan 2018", "Interview Descriptions": "I applied for the position in December 2017, I got call from the HR after a week or so. Initial interview process started off very well.  The first round was with the HR and subsequent interview was with the hiring manager.  After that, I was asked to meet their team in DC  for a face to face with 6 member panel.  Overall, the interview went well  and the interviewing team was very enthusiastic and gave very positive remarks about my knowledge and background. I answered all their questions to the best of my knowledge and my experience. \r\n\r\nSurprisingly, till this date, I haven't received any communication or interview result or even a canned thank you note that I wasn't selected :(\r\n\r\nLate January, I received a call from the AAMC HR  and left me a voice mail. I called them back and sent several emails to AAMC HR team.  To my surprise, so far, I never received any update or call from them.  \r\n\r\nFolks please stay away from this organization, their laid back culture is very evident from this interview process. Whoever want to work with a company with a strong culture, AAMC is not the place to be in. \r\n\r\nI need to tell about this HR person who works for AAMC, this HR person used to call me after every round of interview and ask me very sarcastic questions about the interview process and will probe in a very unprofessional manner to check if I am still interested in their organization and the position.", "Interview Questions": "They just look for your background and what you have put in your resume. How it matches to their requirement."}, {"date": "13 Nov 2016", "title": "Technical Implementation Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at AAMC (Washington, DC) in Nov 2016", "Interview Descriptions": "I had an initial phone screen with a staff recruiter, followed by a call with the position's direct supervisor a week and a half later. Then another week and a half later, I had an in-person interview at their offices with numerous team members, where I spoke to six people over three hours. Most of the interview coordination was done with a recruiting support staff member.", "Interview Questions": "Describe a situation where you had to say \"no\" to a request."}, {"date": "27 Oct 2017", "title": "MCAT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at AAMC (Washington, DC) in Jan 2016", "Interview Descriptions": "There were two phone screenings (1 with HR and then 1 with your the director), then one in person interview at the office for a panel of supervisors and directors from the department.", "Interview Questions": "What was your greatest failure professionally and how are you still working to overcome that?"}, {"date": "5 Jan 2016", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AAMC (Washington, DC) in Oct 2015", "Interview Descriptions": "I had a series of telephone calls. 1st with the recruiter, than 2 department members. Finally, there was a full day interview - 6 different meetings over the course of approximately 7 hours. Prior to the all day interview, I was required to submit a power point presentation. The entire process was very thorough and while the day seemed unnecessarily long, I appreciated the investment. The decision making follow-up could have been more timely.", "Interview Questions": "What are your current partner relationships?"}, {"date": "10 Aug 2015", "title": "Meeting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at AAMC", "Interview Descriptions": "interviewed with two people very nice almost a conversation. Went very well. I appreciated that they read and prepared for the interview as I did. Made me feel like they genuinely were interested in me as a person.", "Interview Questions": "N/A"}, {"date": "31 Jul 2015", "title": "Upper Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at AAMC (Washington, DC) in Jun 2015", "Interview Descriptions": "Phone screen with the recruiter that covered about an hour, very comprehensive meeting with senior director and operations team as a panel interview with other senior directors, executive leadership  corporate risk officers.  Most of the interview centered around approaches and scenarios.", "Interview Questions": "Describe your approach to rewarding employees for good work.  Describe a time when you had to mentor a staff member and discuss the outcomes and approaches"}], [{"date": "30 Apr 2015", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at AAMC (Washington, DC)", "Interview Descriptions": "I had two interviews with HR and one interview with the department's team. The HR interviews were on the phone. I also had follow-up emails with those I interviewed with on-site.", "Interview Questions": "How would you gather research for a paper if you did not have access to a reference center."}, {"date": "22 Feb 2015", "title": "Program Logistics and Management Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC (Washington, DC) in Jan 2015", "Interview Descriptions": "I applied online through the company website over the weekend. At the beginning of the week, I was contacted by HR for an initial phone screening interview. That interview was set up quickly and I was asked general questions about my experience, education and skills. Following the HR interview, I was asked to come in for an in-person interview with 2 of the team members (30 minute interview). The interview consisted of behavioral and experience questions. After the interview, I was immediately contacted that afternoon to move on to the next step in the interview process: background and references check. After a week and a few days later, I received a call with an offer.", "Interview Questions": "Walk me through your resume."}, {"date": "6 Feb 2019", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AAMC (Washington, DC) in Jan 2015", "Interview Descriptions": "The interview was very brief.  All they wanted to know was what my capabilities were. And since I had various amounts of experience, I was able to get the position with ease. I even provide information about my past experiences that made me even more suitable for the position without them even asking questions regarding those experiences.", "Interview Questions": "Are you familiar with CoreMedia?"}, {"date": "29 Oct 2014", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AAMC", "Interview Descriptions": "I saw a job post on Washington Post Jobs but applied via their website. The recruiter got back with me quickly and scheduled an interview. The interview with the recruiter went exceedingly well (in my opinion) and she said she had a few more interviews but I would be contacted about moving to the next phase. After a little under a week passed, I began to call and email the recruiter about the next step. No response. Was someone else hired? Did she just lie to get me off the phone? I was in limbo. HR departments rarely seem to send declination letters recently; I'm used to it. This one was different because I was given verbal confirmation that I was moving to the next phase then absolutely nothing. It would take seconds to send and email (or reply to one of the multiple I sent) saying \"We've decided to go with another applicant.\" I mean, she could have lied and say the job post was cancelled. I'd be none-the-wiser. Just don't abruptly end communication. Closure is important, especially if you're unemployed versus changing jobs.", "Interview Questions": "What software packages have you used?"}, {"date": "13 Sept 2014", "title": "Compliance and Administration Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC in Jul 2014", "Interview Descriptions": "I had three phone interviews. First one with the HR rep, 2nd with one business manager who works in security and another on the compliance side because this position is uniquely placed in two departments.  Things were going very smoothly and moving quickly until correspondence suddenly stopped.  I had to check in to discover they had decided on another applicant.", "Interview Questions": "The questions were very well tailored for the position responsibilities."}, {"date": "18 Sept 2015", "title": "MedEdPORTAL Administrative Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at AAMC (Washington, DC) in Jul 2014", "Interview Descriptions": "Q/A, friendly. There were two interviewers.  Began with an office tour.  Very nice office.  Typical interview questions. Described the position extensively, there was some 'selling' of the position.  Overall an easy/good experience even though I did not take the offer.", "Interview Questions": "Are you comfortable scheduling for a fast paced individual?"}, {"date": "12 Jun 2014", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at AAMC (Washington, DC)", "Interview Descriptions": "Most candidates come from headhunters or temp-to-perm situations and a manager reviews resumes looking for a good match. A developer calls the candidate and assesses candidates skills. Then we bring in the candidate to be interviewed by peers. Then one more more managers interviews the candidate. After that HR gets involved, and salary is negotiated.", "Interview Questions": "Candidates are asked detailed questions about unit testing, a practice that not too many of them are very familiar with."}, {"date": "27 Aug 2015", "title": "Conference Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at AAMC (Washington, DC) in Apr 2014", "Interview Descriptions": "I met with three different employees. I met with my \"would be\" boss, the department head, and a \"would be\" colleague. They each asked me different questions and I met them all in one day. Everyone seemed nice and approachable.", "Interview Questions": "They asked a lot of scenario questions."}, {"date": "25 Oct 2013", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC", "Interview Descriptions": "I participated in two phone interviews (one with HR and the other with my prospective supervisor). The phone interviews were a breeze. Both people with whom I spoke had a  pleasant tone and the feeling in general was low pressure. I was then invited to an in-person interview, where I rotated around the office to have 20-30 minute one-on-one conversations with my prospective supervisor, her boss, plus two additional staff members. I learned a lot about the culture of the office and the type of projects that I would be working on. The main question that they had for me was whether I thought it was a good fit for my career goals.", "Interview Questions": "I received a question about how I could possibly be a good fit for the position despite having no healthcare research experience. "}, {"date": "15 Jun 2013", "title": "QA Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at AAMC", "Interview Descriptions": "1 Telephone\r\n1 F2F", "Interview Questions": "Situational based questions"}], [{"date": "3 Oct 2013", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAMC (Washington, DC) in Jun 2013", "Interview Descriptions": "Interviewed with a panel of 5 people.  Was allowed to present my overall qualifications to open.  Questions were standard behavioral questions.   At the end, was asked why I wanted the job. Process was slower than average.  The culture is very academic and they are not very willing to go outside the box of medical education experience.", "Interview Questions": "Tell us about recent innovations you attempted or achieved. "}, {"date": "30 Mar 2014", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AAMC (Washington, DC) in Feb 2013", "Interview Descriptions": "I had a phone interview first with an HR recruiter, then was set up with a round of interviews with my boss and future colleagues, as well as tests in PowerPoint, Word, and Excel.   The upside was that everyone loved working there and was very positive. The downside was that the company was very, very slow. From first hearing from them to the interview it was almost 2 months.", "Interview Questions": "They seemed most interested to know why I wanted to work there.  Mission was more important than at other interviews I've been on."}, {"date": "30 Jan 2013", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AAMC", "Interview Descriptions": "They were the most Unprofessional people that I have ever interacted with. My Interview actually went very well and I was in fact expecting an offer from them. But even after so many emails and calls I have never heard back from them.They should have at least had the courtesy to let me know their decision.", "Interview Questions": "It was not difficult. Easy technical questions."}, {"date": "25 Sept 2015", "title": "Senior Writer/Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at AAMC (Washington, DC) in Feb 2013", "Interview Descriptions": "First I was contacted by HR and interviewed briefly by phone. Then, HR arranged an interview for me by phone with the hiring manager.I was then invited to the office for a personal interview. In addition to the hiring manager, I met with two other senior staff members who I would be working closely with. Following those discussions, I was invited to lunch with the hiring manager and the chief of the department. Two or three weeks later, I received an offer. Two of my three references said they had been contacted.", "Interview Questions": "How do you respond when your copy is heavily edited?"}, {"date": "4 Feb 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AAMC (Washington, DC) in Sept 2012", "Interview Descriptions": "Initial communications took place via email, followed by several phone calls and a full day of round robin interviews. The Talent Manager reached out to me by phone and was able to gather most information necessary for screening prior to scheduling my interview.  While it was exhausting and a bit of a challenge to sit through a full day of interviews, I was thankful to complete the process in a single day.", "Interview Questions": "There were no difficult or unexpected questions asked. The hardest was the 8 hours of back to back interviews. I was asked repetitive information and felt that a group/panel interview may have been more successful. "}, {"date": "18 May 2012", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AAMC (Washington, DC) in May 2012", "Interview Descriptions": "I applied online. I received a list of questions from the HR rep a week later. They were basic questions like why are you applying to this jobs, what is your knowledge of quantitative research methods, what is your experience with SAS/SPSS etc. Sent the answers to my questions the same day. Received a response from the HR rep saying they would call me for a phone interview the following week. The questions asked during the interview were basic situational questions like describe a time you had to work as a team. The HR rep said they would forward my answers to the hiring manager and if they were interested they would contact me within a week. Never heard anything back", "Interview Questions": "Name a time you failed at something and how did you fix it?"}, {"date": "23 Dec 2010", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at AAMC (Washington, DC) in Nov 2010", "Interview Descriptions": "Applied via monster.com. Recruiter called and setup a personal interview very quickly. There were supposed to be 3 people interviewing (2 analysts and a project manager). Only analysts were able to make it. the project manager had a conflict. In my opinion and based on the feedback from the analysts the interview went great. Since the manager wasn't able to make it, I was asked to get in touch with the recruiter and schedule another slot with the manager. The recruiter did not return multiple calls and emails.\r\nVery unprofessional.", "Interview Questions": "Talk about your previous experience"}, {"date": "10 Dec 2009", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AAMC (Washington, DC) in Oct 2009", "Interview Descriptions": "Applied online and got a call from HR to set up phone interview.  Phone interview was one-on-one and involved talking about past experience and not very technical.  A week later, the onsite interview was scheduled and a couple of friendly developers did a purely technical interview (simple to medium complexity) followed by an interview by the project/hiring manager.  I had a fairly good feeling after the interview, and I was told I will hear from them after a week, but they did not call, email, or communicate in any way.  They did not have the common courtesy to let me know their decision.  I probably did not get the job because there was a better candidate for the job.  But what disappointed me was that they did not have the common decency to let me know.", "Interview Questions": "something heavy about C++ "}, {"date": "5 Oct 2009", "title": "IT Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at AAMC (Washington, DC) in Sept 2009", "Interview Descriptions": "Had a call with the HR and then a phone interview for 25 mins with a senior guy. Soon after a day got a call for face - face interview. Interview with HR, manager and team. Team asked some technical questions. could answer most of them. manager did a sort of behavioural interview and asked for specific experiences. Overall was good but no call and status after the face-face.", "Interview Questions": "dealing with customers"}, {"date": "28 Apr 2009", "title": "IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 week. I interviewed at AAMC (Washington, DC) in Jun 2007", "Interview Descriptions": "Initial discussion was a phonecall with HR, then onsite was another round with HR, then a 1:1 and then a team interview. The team interview was the worth with inconsistent approach to questions (rapid fire trying to answer them all) and people coming in and out during the process. Other interviews that were scheduled didn't take place for scheduling issues.\r\n\r\nAll in all an efficient and rapid experience (as compared to some other companies which drag things out) but I feel like the inefficiency of the group interview didn't allow me to accurately portray myself. E.g. In one situation someone asked me why they hadn't sent me to discuss a position in Engineering and then asked me questions about a topic I'd discussed wasn't in my experience (as though it was something I should interview for). In retrospect I believe it was meant as a \"how would you deal with this\" question but it was unclear whether I should explain my approach or if I was trying to explain why I wasn't looking for that position.", "Interview Questions": "There really weren't any \"brain teaser\" questions. \"Why do you want this job\", etc."}]]