[[{"date": "N/A", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Autism Speaks", "Interview Descriptions": "I had a preliminary phone interview with HR, then three Zoom interviews (2 directors and department VP). I believe the entire interview process took about three weeks. I was made an offer at the end of the process.", "Interview Questions": "Questions about my background and skill; what I thought would make me a good fit for the position."}, {"date": "13 May 2023", "title": "Area Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Autism Speaks", "Interview Descriptions": "Fantastic process! The HR team is great! The timing was given at the start, and they stayed pretty true to it. HR benefits were shared as well as other company benefits. Salary range was also provided at the start.", "Interview Questions": "What experience do you have weaving mission into a sponsorship or sponsor relationship?"}, {"date": "21 Jun 2022", "title": "Data Stewardship Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Autism Speaks in Apr 2022", "Interview Descriptions": "Process took about a month.\n-Applied online\n-HR contacted me about 3-4 days after applying\n-Set up 15 minute screening with HR. This was super low key and I felt very comfortable.\n-About 10 days later I was asked to schedule a second interview with the person who would be my immediate supervisor\n-This interview went over very well, it was relaxed and I felt no pressure. I didn't feel the answers to my questions were the phony ones you usually hear in interviews\n-About a week after this I was asked to complete my final interview with the person my supervisor reports up to\n-Again, this was very relaxed. Felt more like a conversation. I was very nervous going into it because I badly wanted the job but my nerves quickly dissapated.\n-About a week after that, I was asked to submit 3 references. \n-I received the job offer a little after a week after providing my references, in part because one of my references was difficult getting ahold of. Even with that, HR had reached out to me to see if I could find out anything. \n\nI was actively interviewing during this process and this was by far the most prepared but also most relaxed interview process I went through. Whenever I emailed the HR rep, she responded very quickly. This is hard to find today. ", "Interview Questions": "Tell me your background\n\nHave you ever had a situation where you didn't get along with a coworker or customer? How did you handle this?\n\nHave you ever worked with a CRM before?"}, {"date": "6 Jul 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Autism Speaks", "Interview Descriptions": "Interviewed with several members of the team. Very quick turnaround with positive affirmations on next steps each time. But then heard nothing for over a month and no response back.", "Interview Questions": "What type of worker are you and how will that translate into the position?"}, {"date": "15 Mar 2021", "title": "Field Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Autism Speaks", "Interview Descriptions": "One on one Phone calls with supervisors to see what the interests are and how roll aligns with previous experience. It’s a much more relaxed environment because they really want to get to know you and what you can bring to the org", "Interview Questions": "Experience to talking with others and teams. "}, {"date": "17 Feb 2021", "title": "Digital Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Autism Speaks", "Interview Descriptions": "After applying, I had several phone interviews with various staff members. Each was a general conversation about background and skills. During the last interview, I was told someone would follow up, but I never hear back from anyone.", "Interview Questions": "Have you developed social media campaigns?"}, {"date": "1 May 2019", "title": "Director of Public Policy Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Autism Speaks", "Interview Descriptions": "Had a good phone interview with the HR person. Then went for an in-person interview with the hiring director. He spent the whole time talking about himself, and I felt like I was there to learn about him not the other way around. Did not receive another call from them.", "Interview Questions": "what are your connections on Capitol Hill and with NIH?"}, {"date": "14 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Speaks (Washington, DC) in Apr 2019", "Interview Descriptions": "Was contacted through email about interest in the program and why I decided to apply. Talked about experience in the field and reasoning for decision to submit an application. Asked to come into the office for a brief meeting and interview with the immediate advisor.", "Interview Questions": "Interest in the field, why "}, {"date": "21 Mar 2019", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 6 weeks. I interviewed at Autism Speaks", "Interview Descriptions": "Had three very, very lengthy interviews, one in person. Spent countless hours preparing. Sent follow up email after being told I’d be notified of next steps after the last interview. No response. Nothing. For a charity that’s supposed to make people feel better, I felt lousy and thought this was extremely unprofessional. Heard this is common behavior for this organization.", "Interview Questions": "Why do you want this job?"}], [{"date": "13 Apr 2022", "title": "Director, Corporate Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Autism Speaks (New York, NY) in Jan 2019", "Interview Descriptions": "I met with Marketing, Mission and the CEO in NYC at their location downtown.  I met with HR separately and then a phone interview.   Everyone was super nice and cordial during the process", "Interview Questions": "What was your biggest challenge?\r\nWhat motivates you? \r\n\r\n\r\n"}, {"date": "11 Jun 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Autism Speaks", "Interview Descriptions": "Amy and Katy were so sweet and took their time to meet with me. They looked at your overall personality, connection to Autism and what you could personally do to help create exposure for Autism Speaks.", "Interview Questions": "What is your connection to Autism?"}, {"date": "21 Jan 2017", "title": "Field Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Autism Speaks (Indianapolis, IN)", "Interview Descriptions": "Phone interview with Human Resources, mostly general questions & experience; and then 2nd phone interview with direct report of position, more specific discussion of job responsibilities/details of work history;  next step would be panel interview.", "Interview Questions": "How would you build volunteer committee?"}, {"date": "11 Nov 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Autism Speaks (New York, NY)", "Interview Descriptions": "First i spoke with HR, then I did two calls, over the phone, even though I could have easily come into the office. then HR finalized all the paperwork and sent me a huge packet to review, sign and send back. Interviews were easy and just went over my resume and skills. nothing too technical", "Interview Questions": "How would I improve donations totals? what was the biggest event i had handled?"}, {"date": "24 Oct 2015", "title": "Major Gifts Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Autism Speaks (Denver, CO)", "Interview Descriptions": "I was asked about my skils and experience for the position. i was asked several times about prior compensation and answered the best that I could. As my work was consulting and fee based, my fees varied.  The recruiter was very suspicious about my answers.", "Interview Questions": "Recruiter told me that she would require my personal tax return to verify my prior compensation"}, {"date": "14 Dec 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Autism Speaks (New York, NY) in May 2015", "Interview Descriptions": "Brief and basic and was not very hard. Met at the headquarters and she asked me a couple of questions. I was given a spot very quickly. She asked me to come in a couple of times a week to do work.", "Interview Questions": "Why do you want to intern here?"}, {"date": "29 Mar 2016", "title": "Field Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Autism Speaks (Chicago, IL) in Mar 2015", "Interview Descriptions": "-One initial 10-15 minute phone screen interview which was simple and really basic. The HR person just went over my resume and asked very 'get to know you' questions just to make sure you can communicate.\r\n\r\n-Followed up with an in-person 30-45 minute interview with the Executive Director. Very conversational and not intimidating at all.", "Interview Questions": "How has your previous work experience prepared you for this role?\r\nTell me about a difficult time you had with an employer/co-worker."}, {"date": "31 Mar 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Autism Speaks (New York, NY) in May 2013", "Interview Descriptions": "There was a phone interview with HR and two in person interviews. There was several meetings with my supervisor. All were pleasant and comfortable. There was a skills review. It took several months for the process to complete.", "Interview Questions": "If I had experience working with individuals on the spectrum."}, {"date": "27 Jul 2012", "title": "Event Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Autism Speaks (Watertown, MA)", "Interview Descriptions": "It was wonderful and just like any other company i worked for", "Interview Questions": "there reall wasn't anything i unexpected"}]]