[[{"date": "28 Feb 2022", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Endicott College", "Interview Descriptions": "The process was super simple and easy. I applied online and had an interview a week later. There was constant communication throughout the process. One of the best interview processes I’ve been through.", "Interview Questions": "Give us an example of you being a leader on Campus?"}, {"date": "2 Feb 2021", "title": "Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Endicott College (Beverly, MA)", "Interview Descriptions": "easy and fast. Very predictable leadership questions. Everyone was friendly. \nAfter the interview it became apparent that they planned to hire from within and I think external interviews were a formality.", "Interview Questions": "Describe your leadership style and how you react to subpar work from one of your direct reports. "}, {"date": "2 Jul 2019", "title": "Director of Digital and Web Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Endicott College (Salem, MA) in Jun 2019", "Interview Descriptions": "I had a very positive phone interview with the head of marketing and he let me know he’d like to bring me in for an in person interview. His assistant contacted me, only via email, to schedule the in person interview. I unfortunately had a mandatory business trip and an important meeting on the 2 days offered. Assistant wrote me back (never picked up phone) and told me I was no longer a candidate because I couldn’t make the two dates offered. Scheduling issues could have been resolved with a simple phone call. Clearly they don’t care that candidates must protect their current job and can’t drop everything with very short notice. It’s good to find out about negative company cultures before you get excited about a role. I’m grateful their true colors showed before I wasted my time.", "Interview Questions": "What is my management approach?"}, {"date": "7 Nov 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Endicott College (Beverly, MA) in Oct 2017", "Interview Descriptions": "Interview process was very standard, beginning with phone screening, coming in to interview with the team, and then a final round where you meet with HR and the President. The longest point in the process was just trying to schedule something with the President as he was traveling. Like someone said previously, however, just because you have a final interview with the President, does not mean that you have the job. Even though I was offered the job, I know that the other candidate met with him, as well. Overall, positive experience with a beautiful campus and really happy people that genuinely love working there.", "Interview Questions": "Why Endicott?"}, {"date": "14 Feb 2018", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Endicott College in Apr 2017", "Interview Descriptions": "There is a initial phone interview that lasts no more than 10 minutes. If they decide to move forward, there will be a 60 minute Skype interview. If you pass that round there are several more interviews; one with several employees of the department, one with the Vice President, and finally with the President.", "Interview Questions": "Why Endicott College?"}, {"date": "29 Jul 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Endicott College", "Interview Descriptions": "I was emailed first, then had an initial phone interview, and later an in person interview was scheduled. The people were friendly and the interview questions were standard. Initially I was told I would be called back for a second interview, but it was never scheduled. As another reviewer stated being led to HR led me to believe I might get an offer, and there was a long wait to hear back that I did not receive the offer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Jul 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Endicott College (Beverly, MA) in Jun 2016", "Interview Descriptions": "Lengthy interview process. Step 1 was a phone conversation. Step 2 was an interview with a team of people. Step 3 was an interview with the head of the department. Step 4 was an interview with the President of the university. Following that interview, I was brought down to HR to review benefits and sign off on a background check. \n\nReferences were called just prior to Step 3. \n\nEveryone was especially nice and a pleasure to deal with. The interviews itself were not difficult. I had to follow up to see if a decision had been made as I had not heard anything after almost a week following the meeting with the president. Meeting with HR immediately following the meeting with the president did lead me to believe I was likely to be offered the position, as was the fact that my references were contacted so early in the process.", "Interview Questions": "What questions do you have for us?"}, {"date": "18 Nov 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Endicott College (Beverly, MA) in Jun 2016", "Interview Descriptions": "The interview process took four weeks. I had a phone interview, then a panel interview with members of the department, then an interview with the Vice President of the department, and finally one with the President himself. This is standard procedure here. An interview with the President does not guarantee you the position.", "Interview Questions": "What strategies will you bring to aid in student retention and recruitment?"}, {"date": "21 Jul 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Endicott College (Beverly, MA) in May 2016", "Interview Descriptions": "The interview process engaging and collegial. Equal sharing of information to determine fit for the position. Met with HR, Dean, VP of Academic Affairs, and the President of the College and all were welcoming and spoke highly of the environment. I also walked around the campus and found the grounds absolutely beautiful. There is room for advancement.", "Interview Questions": "Why Endicott?"}, {"date": "4 Apr 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Endicott College", "Interview Descriptions": "The interview process was the strangest that I have ever had. Had an introductory phone interview with hiring manager. Then 2 in-person interviews with search committee and Dean. Then they checked my references and I was moved on to an interview with the President. After the interview with the President, I was sent to HR to review benefits.", "Interview Questions": "Why did I want to work at Endicott College?"}], [{"date": "11 Jun 2015", "title": "Web Content Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Endicott College (Beverly, MA) in May 2014", "Interview Descriptions": "It was very simple and not too formal. Most of the interview was centered around my resume and skills. I applied from the schools website and received an email from IT management that I had an interview for the position.", "Interview Questions": "What my most relevant IT skills were"}, {"date": "22 Aug 2014", "title": "Corporate Event Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Endicott College (Beverly, MA) in Jun 2012", "Interview Descriptions": "I found the position around the end of May 2012 online and applied through their website. From there I was contacted by the Director for a brief interview and was asked when was a good time in the next couple of days for another phone interview. The next interview was held by the director again and another person from the department. They called back a couple days later to set up an in-person interview. My first interview was in the middle of June. ( I was living out of state therefore I could not interview right away.) I did two in person interviews, the first one with three people and the next one with just the director but then met the Vice President and President of the College. I was \"officially\" offered the position a couple days later over the phone and a letter was faxed to me. I accepted the offer a few days later. I started the position in the beginning of July.", "Interview Questions": "A lot of questions come from your resume to make sure you know your resume well."}]]