[[{"date": "6 Jun 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Project HOPE (Washington, DC) in Sept 2022", "Interview Descriptions": "The position was announced through the school office. After sending the resume and cover letter, there was a short phone call screening and then the interview (Microsoft Teams) was set. After interview, the background check was done.", "Interview Questions": "What is your experience with handling data collection and data analysis?"}, {"date": "1 Aug 2022", "title": "Social Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Project HOPE (Washington, DC) in Jan 2022", "Interview Descriptions": "The interview process was great: quick, direct, and thorough. I had a phone screening, 1:1 interview, and group interview before receiving my offer all within less than 2 weeks. All of the interviews felt important, but casual, which made me feel comfortable.", "Interview Questions": "Q: What is your social media philosophy?"}, {"date": "8 Sept 2020", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Project HOPE", "Interview Descriptions": "There were interviews with about 10 behavioral questions. If you know your basic behavioral interview questions, you should be just fine. Good luck with your future interview. I wish you the best.", "Interview Questions": "Please tell me about yourself"}, {"date": "15 Feb 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Project HOPE (Bethesda, MD) in Nov 2019", "Interview Descriptions": "The interview process was lengthy, thorough and detailed. It gave both me and those interviewing me to explore whether or not it would be a good fit. While it was a little intense to have so many interviews (4 total) and meet so many members of the team, it was worth it in the end. It made the matching process so much better!", "Interview Questions": "They asked in detail about my leadership and communication style. "}, {"date": "20 May 2015", "title": "Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Project HOPE (Washington, DC) in Mar 2015", "Interview Descriptions": "Went led to believe I was interviewing for an open position and I was not. Went through 2 phone interviews, a written assignment and then face to face interview.  Didn't hear anything for 30 days after following up.", "Interview Questions": "Interviewer asked basic questions not in line with my experience.  It was if he knew there wasn't a position available yet wasted my time, expense, and a day off from my job to go to DC."}, {"date": "23 Jan 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Project HOPE (Winchester, VA) in Jan 2015", "Interview Descriptions": "The interview process was fairly basic.  The interviewer was enthusiastic and friendly. Initially, I had to submit a cover letter stating my interest in applying as an intern, which was to gain experience working at a non-profit organization. I was then asked to come in for a brief 1:1 interview.", "Interview Questions": "Why did you choose Project HOPE?"}], [], [], [], []]