[[{"date": "23 Nov 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at California Lutheran University", "Interview Descriptions": "From what I remember, the interview process was pretty simple. Multiple interviews- one with HR, one with the supervisor and panel interview. The interview questions were standard. Nothing tricky or overly complicated.", "Interview Questions": "I don't recall, it's been a while since I interviewed."}, {"date": "14 Jun 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at California Lutheran University", "Interview Descriptions": "Phone call then on-campus interview. You will meet with a range of faculty and administration, in addition to teaching a class on a topic of choice within your field and a research talk on your agenda.", "Interview Questions": "Tell us about your contributions to diversity, equity, and inclusion."}, {"date": "14 Jul 2022", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at California Lutheran University in Jun 2022", "Interview Descriptions": "The interview process itself was straightforward. I had one virtual panel interview with HR, the dean and the manager. This was followed by an in person panel interview with faculty. However, based on my initial interview, I got the impression they had not read my resume. Following my second interview, I did not hear from them at all. I followed up with a thank you note after my interview, and again two weeks later. Never heard from them again at all.", "Interview Questions": "Behavioral questions (describe a time when you….)."}, {"date": "7 Feb 2022", "title": "Athletic Office Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at California Lutheran University", "Interview Descriptions": "I’m person interview with a couple of other coaches in the room and they asked me questions about why I wanted to work there and why I thought I would be a good fit", "Interview Questions": "N/A"}, {"date": "13 Apr 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California Lutheran University (Thousand Oaks, CA) in Nov 2021", "Interview Descriptions": "Prompt, professional, and thorough. The communication was respectful and I felt comfortable asking questions. The first interview was a panel interview and the second was a 1-1 meeting with my future supervisor. Overall, no complaints!", "Interview Questions": "Describe your experience multitasking and prioritizing tasks. "}, {"date": "16 Aug 2020", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at California Lutheran University", "Interview Descriptions": "The HR process took longer than the interviewing process. Once you've been hired, HR will need to contact references and complete a background check. This process takes a few weeks before you officially start.", "Interview Questions": "I honestly don't remember the exact questions, but many are situational. "}, {"date": "20 May 2019", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at California Lutheran University", "Interview Descriptions": "The process was very easy. They are very warm and welcoming office. The office has a waiting room with a front desk, and a side room where he interview was conducted. There is parking on the side of the building as well as right in front of the office.", "Interview Questions": "They asked about phone etiquette, and running through example of upset families"}, {"date": "20 Mar 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at California Lutheran University (Thousand Oaks, CA)", "Interview Descriptions": "Friendly interview, with friendly people. Having connections with the faculty, there was not an extensive process with the interview. You could say that the interview had taken place over the years.", "Interview Questions": "Nothing surprising really."}, {"date": "26 Aug 2020", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California Lutheran University in May 2016", "Interview Descriptions": "It was in person interview with panel of professor and current assistant. Questions were related to knowledge, experience and qualification. Also, there were some questions on current current academic performance.", "Interview Questions": "Questions were related to statistics and economics "}, {"date": "12 Oct 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at California Lutheran University (Thousand Oaks, CA) in Nov 2015", "Interview Descriptions": "It was a short interview with the two supervisors that I worked with during my stay. They were very friendly and seemed like they had done enough research prior to meeting. which was demonstrated by them picking questions from my resume.", "Interview Questions": "Asked about particular previous experiences on resume? "}], [{"date": "26 Jul 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at California Lutheran University (Lake Elsinore, CA) in Jun 2014", "Interview Descriptions": "This was a very easy process, I applied on online over the summer & got an email the next day asking when I was free for a phone interview. She asked some basic questions you would find in any interview along with some sales specific questions. She liked me & hired me over the phone.", "Interview Questions": "What would you tell someone who is hesitant to donate to the university?"}, {"date": "2 Apr 2014", "title": "Manager Do Collection Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California Lutheran University in Mar 2014", "Interview Descriptions": "I was contacted by email after sending in my resume and cover letter. My video interview was with direct supervisor and department head. The interview was friendly and straight forward. They were happy to answer all my questions about the culture and management style of the department. I was told that candidates would be called in for face to face interviews, but I did not get to that level.", "Interview Questions": "There were not any difficult or unexpected questions. "}, {"date": "29 Nov 2017", "title": "Study Abroad Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at California Lutheran University (Thousand Oaks, CA) in Aug 2013", "Interview Descriptions": "It was a skype interview with basic questions about qualifications and why I wanted the job. They were very friendly and the questions were not hard to answer. It went very quickly. it helped that I studied abroad twice and knew everyone so we already had a good rapport.", "Interview Questions": "Why are you interested in working here?"}]]