[[{"date": "27 Jan 2023", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mental Health Systems (San Diego, CA) in May 2021", "Interview Descriptions": "Overall good interview process, multiple layers including over the phone and zoom. Easy and honest process, includes verbal interviews and physical screening/drug test since it is a federally funded company.", "Interview Questions": "Past experience, own person experience with mental health, why you desire to be in this field, what about this population draws you in, difficult clients you have dealt with in the past."}, {"date": "3 Mar 2021", "title": "Program Finance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mental Health Systems", "Interview Descriptions": "Interviewer was incredibly rude, kept asking if I had been fired from all of my previous positions, didn't bother to ask many questions about my background. Didn't bother to mention pay or any benefits associated with the position.", "Interview Questions": "What is the reason for this gap in your employment history? Were you fired?"}, {"date": "30 Jun 2021", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mental Health Systems in Feb 2021", "Interview Descriptions": "Very quick via zoom call. I applied online, they called me back within a total of 3 days and interviewed that Monday. I was asked for references after that. They called most of them and I think a couple didn’t answer. But overall very quick process", "Interview Questions": "The usual , tell us your experience ."}, {"date": "29 Mar 2019", "title": "Primary Counselor, Substance Abuse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mental Health Systems (Santee, CA) in Mar 2019", "Interview Descriptions": "One on one interview with program manager. Followed up with second interview with senior counselor and another manager. Pretty standard questions about difficult client and management conflict situations. Some ethical dilemna questions.", "Interview Questions": "Describe a situation where you disagreed with management  and how you handled it."}, {"date": "26 Aug 2021", "title": "Housing Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mental Health Systems in Jun 2017", "Interview Descriptions": "Online-  two people. The housing coordinator and program manager. Basic questions. Hc didn't care for interview. They just want the person who seems willing and will accept being paid the lowest.", "Interview Questions": "How do you organize your self and prioritize task."}, {"date": "26 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mental Health Systems (San Diego, CA) in Mar 2017", "Interview Descriptions": "Thorough, typical interview questions. Relaxed feel. Personable staff. Felt comfortable and not nervous. Impressed with the cohesion of current staff. Given a skill's test to assess capability of given tasks.", "Interview Questions": "Tell me about a time you were given conflicting direction from 2 different supervisor's"}, {"date": "31 Jul 2016", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mental Health Systems (Fresno, CA)", "Interview Descriptions": "Awesome very nice,. Interviewers were polite, it really didnt seem like an interview. More relaxed at an interview than ever before. I was interviewed by program director and another employee both asked me questions. At the end of the interview I was offered the job. That was 10 months ago and I can actually say I still love my job!! Overall experience of the interview was pleasant non threatening.", "Interview Questions": "Question about back ground experience.  Liked AOD \r\n(alcohol and other drugs) back ground."}, {"date": "5 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Mental Health Systems in Oct 2015", "Interview Descriptions": "Quick and easy.  I was interviewed by the Program Manager and The Case Manager.  They were very professional and I felt very relaxed.  The questions were straight forward.  The were no roll plays.", "Interview Questions": "Why I wanted to be involved in Social Work"}, {"date": "9 Jan 2015", "title": "Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at Mental Health Systems in Dec 2014", "Interview Descriptions": "emailed resume and application. received  a call for an interview days later. Loved the environment. the interview was very brief. I was not asked about my experience or what i could offer, or my desire to work there. i was very disappointed. i felt that their decision was made to not hire me before the interview even began.", "Interview Questions": "how important is a home"}, {"date": "5 May 2012", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Mental Health Systems (San Diego, CA) in Aug 2011", "Interview Descriptions": "There was a face to face group interview with the program manager and the office manager.  A skills test was sent to me via e-mail the afternoon after the interview.  Upon completing the skills test, I was called for a second one on one interview that was conducted by the division VP.  I was notified a few days later that I had the job and needed to go sign paperwork.  While signing paperwork, I was told to go a TB test, drug test and background check and was given a list of locations.  It took 5 days for all of the results to come in and I started work on a Monday.", "Interview Questions": "N/A"}]]