[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Never Again", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Aug 2018", "job_title": "Damage Prevention Associate in Burnaby, BC", "duration": "N/A", "pros": "The pay is decent enough.", "cons": "If you like daily micro managing, being treated like numbers, having to jump through hoops in order to get ONE day off for your partner's surgery, being constantly monitored on EVERYTHING, only having 4 minutes to use the washroom every day, being scheduled 4 hours straight on phone calls with no break, working for a managers that don't want to help you or AREN'T THERE to help you (then get mad at you for making a mistake), and constantly worrying that they may lay you off or decrease your pay as punishment... THEN THIS IS THE JOB FOR YOU!!!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Bad work environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Sept 2014", "job_title": "Call Taker/Data Entry in Burnaby, BC", "duration": "N/A", "pros": "The company has a decent benefit package. There isn't really anything else about the job that makes it worth recommending.", "cons": "5-8 staff members to 3 managers/supervisors definitely makes this an unnecessarily stressful job. It's very simple work - filing out the same form over and over all day long but the extremely high degree of micro-management and conflicting styles makes this a job that is simply not worth having. Customer service standards and management skill levels are at least 20 years out of date. Callers are treating like the enemy and staff are treated like children who can't be trusted to stray from the script by even a single word."}], []]