[[{"date": "20 Sept 2021", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Evangelical Lutheran Church in America (Chicago, IL) in Sept 2021", "Interview Descriptions": "I applied to this job, stating in no uncertain terms that I reside in Canada. A few weeks later, I received an e-mail from an HR person for a brief phone interview \"to share a bit about the position, including salary and benefits.\" \r\n\r\nDuring the 15-minute call, she discussed the base salary as well as the generous medical insurance benefits that ELCA offers. However, when asked about the specifics of the position, she did not know anything other than what the website listing includes.\r\n\r\nA few weeks later, I was notified that \"after some research ... and in conversation with our legal counsel, we are unable to be compliant with necessary tax and employment laws in Canada at this time so we will not be able to move forward with your application.\" \r\n\r\nI feel this research could've been done before they contacted me for that initial screening call.", "Interview Questions": "Our base salary for this position is USD $55,000. Is this acceptable to you?\r\n\r\nWe offer a rather generous medical plan in which the employee would not have to contribute. Is this acceptable to you?"}, {"date": "11 Feb 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Evangelical Lutheran Church in America (Chicago, IL)", "Interview Descriptions": "Several weeks after I had applied for the job, was given a phone screening. A week later was called in for an in-person interview with the HR team and the team I would be working with. Was given an offer a few days later—a very quick process overall.", "Interview Questions": "Give us an example of how your prioritized during your last project."}, {"date": "27 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Evangelical Lutheran Church in America", "Interview Descriptions": "Very easy. Got  a phone interview with HR. After the initial screening, a hiring manager and a hiring manager's assistant contacted me.  The questions were very easy, i.e why this role, where do you see yourself in 5 years, what are your strengths and weaknesses and etc.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Jun 2019", "title": "Strategic Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Evangelical Lutheran Church in America in Apr 2018", "Interview Descriptions": "It was fairly simple. I applied online and got an email 2 weeks later to do a phone interview with the manager. It took about 20 minutes. 1 week later HR called to let me know I was offered the position.", "Interview Questions": "Describe a time you had to deal with conflict at work?"}, {"date": "29 Apr 2017", "title": "Strategic Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Evangelical Lutheran Church in America", "Interview Descriptions": "Overall, enjoyable. The people that interviewed me were so nice and actually interested in getting to know me. Their questions enabled me to talk comfortably. The interview went to well that they offered me the position within a day and I was happy to success. One of the best interviews I've had.", "Interview Questions": "Why are you interested in working for the ELCA?"}, {"date": "12 Feb 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Evangelical Lutheran Church in America (Chicago, IL) in Mar 2017", "Interview Descriptions": "I interviewed with the ELCA once over the phone. While the internship program is company wide, I was interviewed directly by members of the department to which I applied (as opposed to an HR rep). There was also a background check.", "Interview Questions": "Why do you want to work for the ELCA?"}, {"date": "7 Sept 2016", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Evangelical Lutheran Church in America (Chicago, IL)", "Interview Descriptions": "After an initial skills test and Skype interview, I received an in person interview. The first half I spent interviewing with the possible Director, along with an HR representative. The second half was spent in an informal interview with who my possible team would be. Very straight forward and very conversation based. All were very welcoming and easy to converse with.", "Interview Questions": "They basically asked how my past experiences correlated with the job I was applying for, what I would change about what they already do,etc"}, {"date": "29 Oct 2016", "title": "Junior Sharepoint Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Evangelical Lutheran Church in America (Rosemont, IL) in Sept 2016", "Interview Descriptions": "The interview took approximately 3 weeks through directly working through the staffing agency. I received instant feedback after 2 rounds and of phone interviews and 1 1/2 face-to-face interviews.  The experience overall unsatisfactory as the interviews could have could have been better streamlined. I was strongly considered for the role initially.  In my final interview I was instructed to complete a skills test and meet the Director of IT. However, I failed the test and quickly escorted out by the IT Manager without so much of an meeting with Director or we'll be in contact. By far the worst interview experience ever.", "Interview Questions": "How much SharePoint experience do I have? I made sure I told the IT Manager that my VB.net skills were very limited but willing to learn more in my initial phone interview. He assured me that it perfectly ok and great that I'm open to learning the language."}, {"date": "31 Jul 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Evangelical Lutheran Church in America (Chicago, IL)", "Interview Descriptions": "I found the job on the ELCA career site and applied online. I heard back via email about six weeks later, asking for an in-person interview. They flew me into Chicago, and I had an in-person interview with the team and an HR person that lasted about 90 minutes. I heard back a few days later and was offered the job!", "Interview Questions": "Describe yourself in three words."}]]