[[{"date": "3 May 2023", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Otis College of Art and Design", "Interview Descriptions": "After an introduction, there were my ltiple email rounds and zoom calls. administrators rescheduled quite a bit but then a very professional and organized campus meeting/interview round was arranged. Next steps will be panel review for considered positions.", "Interview Questions": "Why does teaching at Otis appeal to you?"}, {"date": "19 Sept 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Otis College of Art and Design", "Interview Descriptions": "1st round: Screening with HR, was a month+ after my initial interview\n2nd: Panel Interview with 3 staff attendees\n\nThere were only two steps and a month waiting process before the offer", "Interview Questions": "What are your salary expectations?"}, {"date": "22 Mar 2023", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Otis College of Art and Design in Aug 2022", "Interview Descriptions": "Really great experience and had comprehensive conversation. Make sure to have a strong portfolio that shows your skill sets. Entire process was smooth from beginning to end. Be sure to have questions at the end of the interview.", "Interview Questions": "What are you looking to do after you graduate?"}, {"date": "9 Sept 2022", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Otis College of Art and Design (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "HR introduced me to the company and the position, and they saw my current work. We talked about some topics related to the work, and she asked me what I thought about the company", "Interview Questions": "what can I learn to from this job"}, {"date": "29 Oct 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Otis College of Art and Design", "Interview Descriptions": "Four interviews over three months and inappropriate due to being made a verbal offer as well as given reassurance by those above the person I would be reporting to. It was his final decision to pass. No hard feelings as everyone should feel it is a great fit.\r\n\r\nMost of the staff was friendly except for one fishing comment regarding my age. I would describe the work environment itself as cold, dark and dreary. Very small campus, but everyone seemed in good spirits- team atmosphere.", "Interview Questions": "Asked for proposals, ideas and contacts of mine. It will be interesting to note if they use them."}, {"date": "4 Jun 2021", "title": "Operations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Otis College of Art and Design (Los Angeles, CA) in Apr 2021", "Interview Descriptions": "E-mailed to set up preliminary phone interview with HR, lasted about 15 minutes.  Second interview was a zoom call (due to the pandemic) with the manager for the position and department head which lasted about a half hour.  Was told I would be contacted within a week but was never contacted at all.", "Interview Questions": "How do you go about checking for errors when performing data entry?"}, {"date": "6 Sept 2019", "title": "Fashion Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Otis College of Art and Design", "Interview Descriptions": "I was approached by someone associated with the school. After communicating by email, filling out the application and providing quite a bit of specialized documentation, a phone interview was scheduled. This phone interview was rescheduled, then the rescheduled time was just blown off, and then they called me without warning while I was at work. This call was about a month after they first received my resume.\r\nOver the course of this interview it became clear that what they wanted was exactly the opposite of my experience, and the interviewer told me that they had another applicant they preferred and spoke of that person's work experience admiringly. I'm not sure why they wasted my time but I didn't appreciate it.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "9 Aug 2019", "title": "Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Otis College of Art and Design (Los Angeles, CA)", "Interview Descriptions": "I met for one interview to advance from part- to full-time, and I was an internal hire and former student. My interviewers and I had worked together previously. We met informally in the wood shop to talk to each other.", "Interview Questions": "I was asked by a Manager about previously taking sick days as a part-time employee."}, {"date": "9 Jan 2018", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Otis College of Art and Design", "Interview Descriptions": "Had a phone interview then came in for an in person interview. Everyone was really friendly and the process seemed quick. I applied for the job in September and heard back in October", "Interview Questions": "What can you bring to the college?"}, {"date": "3 Aug 2016", "title": "Academic Records Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Otis College of Art and Design (Los Angeles, CA) in Aug 2016", "Interview Descriptions": "I applied online and a couple of days later, HR called me to speak briefly about the position and we set-up an interview for me to come in to meet with the Registrar.  The Registrar lady seemed to be laughing during the interview and at that moment I wanted to walk out, but I kept my cool.\r\n\r\nWhy are you interested in the Academic Records Specialist position and how this position fits into your future professional goals?\r\nAsked how I liked working in my previous job.\r\nAsked about the skills in my last position and how I felt that they would transition into the role of an Academic Records Specialist.\r\nWas I responsible for data entry, student files, and scanning in my last position?\r\nWhat was the most challenging and complex project you handled at work? What part of the project required you to go above and beyond your usual resources?\r\nWhat is diversity to you and how would you incorporate that to create that environment that is inclusive to our school?\r\nIn your last job, what was the population of the student body like?\r\nWhat advice would you give someone working in a Customer Service role for the first time?\r\nWhat's your ideal learning environment at work?\r\nIn terms of supervision, do you like to work independently or do you like someone to check in a lot?\r\nWhat's the best compliment you've received for your work style? And a criticism you have received for your work style?\r\nWhat qualities do you value most in co-workers and what qualities do you find challenging?\r\nHave you had a work experience where you've found a co-worker somewhat challenging and if you did, how'd you overcome that?\r\nHow do you handle multiple task and projects?\r\nDo you have any tools that you use to keep yourself on track?\r\nCould you describe an issue you've had to handle at work and how did you react to that?\r\nHow comfortable are you with technology?", "Interview Questions": "What experience have you had with student information?"}], [{"date": "19 May 2017", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Otis College of Art and Design (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "The interview went very well. They asked me questions which were geared towards getting to know me, rather than my past experience. We spoke about my resume and my brief employment gap but they were very understanding and cooperative.", "Interview Questions": "What was your reason for leaving your last job?"}, {"date": "9 Oct 2015", "title": "Program Review Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Otis College of Art and Design (Los Angeles, CA) in Aug 2014", "Interview Descriptions": "I was first called by HR asking simple questions. Especially about my former work. After a week, we made an appointment to set up an interview with the supervisor. It was by Skype interview, starting with casual question. And at the end, asking a few questions asking how the interviewee will resolve conflictual situations.", "Interview Questions": "Are you an working artist?"}, {"date": "30 Jul 2013", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Otis College of Art and Design (Los Angeles, CA)", "Interview Descriptions": "The hiring process is exactly that, so be sure to give yourself a couple of months in any institutional setting.  I applied to OTIS and received a call a few weeks later where they brought me in to interview with HR.  On the same day, I met with the Assistant Department Chair.  I was notified a couple of weeks later that I had been hired and would be started in several weeks from there.", "Interview Questions": "Usually it's \"where do you see yourself in five years from now?\"."}, {"date": "17 Sept 2016", "title": "Art Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Otis College of Art and Design (Los Angeles, CA) in Apr 2012", "Interview Descriptions": "The interview process consisted of a phone interview with an appointment for an in-person interview. A portfolio of one's artwork was required, as well as a verbal description of my studio practice and my philosophy on art teaching.", "Interview Questions": "Questions on teaching methods and experience were prominent, but also evidence as a working artist experience with exhibiting and public art commissions. My approach to individual students' needs. I was asked to describe if critiques were a part of my class instruction"}]]