[[{"date": "9 Jul 2023", "title": "Warehouse Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fenway Health (Dedham, MA)", "Interview Descriptions": "A Zoom interview with two managers, they asked questions to get to know me and about whether I could do the functions of the job, basic ones such as teamwork or staying organized and on task", "Interview Questions": "Tell me about yourself; What do you know about Fenway Health/AIDS action?"}, {"date": "15 Nov 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fenway Health (Boston, MA) in Nov 2022", "Interview Descriptions": "I had a really nice first interview - 30-minutes long with the position's manager, and we had a good connection. I was given a second interview. The morning of the second interview I was informed that the interview would be over the phone instead of Zoom, which I accepted. When I was called for my interview, it turned out the interviewer was commuting on the train. This felt a bit odd and it was somewhat distracting to have train noises in the background. It's also more difficult to answer in-depth interview questions over the phone. Despite my attempts to reach out after the second interview, I did not hear back from the organization. It felt very unprofessional to have a second interview over the phone and then be ghosted. If you aren't serious about a candidate, don't offer them another interview. Weird and frustrating experience.", "Interview Questions": "How would you handle our virtual training program?"}, {"date": "4 Sept 2022", "title": "Senior Grants Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fenway Health (Washington, DC) in Sept 2022", "Interview Descriptions": "The interview was more conversation and j felt that there was no direction in the questions . I kept expecting to get questions but felt scrutinized. When i said i had not federal grants accountant experience but only local and state grants experience.  The interview went left and i was told i was disqualified . I was wished good luck and the Video call ended abruptly.  Within 3 seconds I got a message saying i was not selected for job. I did not waste your time because you reached out to me designating that time to interview. This was totally unprofessional and downright unstable. I never in my life had such a terrible experience and interview.  Yes thats fine that i didn’t qualify but you dont dismoralize people and make them fee like a criminal. Even if my interview went terrible everything should be done professionally. He even mentioned that he fell into that  job and wasnt there because he really believed in the mission. I was just gonna let this go, but this interview was so unprofessional i could not. Treat people with respect and i think you would know how it feels to be a minority. Maybe he forgot know with his high paying job and title. I am thankful to not ever work with such a disrespectful and unprofessional person!", "Interview Questions": "Questions regarding my experience in resume"}, {"date": "18 Jan 2022", "title": "Research Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fenway Health", "Interview Descriptions": "I was invited for an initial phone interview with the project director about two weeks after I applied, followed by a Zoom meeting with principal investigator. Received rejection email 2 days after interview.", "Interview Questions": "What is your experience with engaging community members in research projects?"}, {"date": "28 Dec 2020", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fenway Health (Boston, MA) in Dec 2020", "Interview Descriptions": "The interview was over zoom with a panel of professionals cue to current COVID regulation. Very casual and not intimidating at all. More of a conversation with them all then a big interview which I enjoyed.", "Interview Questions": "What made me stand out from other candidates. "}, {"date": "17 Jul 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fenway Health (Boston, MA) in Jul 2019", "Interview Descriptions": "Institute reached out via email after online resume/CV submission. Screen interview of thirty minutes over the phone followed. Basic information about the working conditions, staff environment, and culture of the workplace where discussed.", "Interview Questions": "What do you know about Fenway Health and the Fenway Institute? "}, {"date": "9 Jan 2018", "title": "Clinical Research Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fenway Health", "Interview Descriptions": "Was initially contacted to say I was not qualified for the job via an automated email, but was then re-contacted by phone for a ~30 minute phone interview, followed by a in person interview without about 6 different individuals.", "Interview Questions": "What is PrEP?"}, {"date": "14 Mar 2015", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fenway Health (Boston, MA)", "Interview Descriptions": "Two rounds of interviews. 1st with mid level supervisors then 2nd with director level. Straight forward casual interview. They were really friendly and we seemed to click. Ultimately didn't give it to me due to amount of experience but were nice enough to offer a good word if I applied to the company again.", "Interview Questions": "5 year plan"}, {"date": "3 Dec 2014", "title": "Recruitment and Outreach Specialist- Fenway Institute Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fenway Health in Nov 2014", "Interview Descriptions": "I think Fenway is a great place, but I think like most companies (non-profit and corporate) there are problems that deserve attention. I was stoked for this opportunity, and the recruiter seemed like an awesome person.  \r\n\r\nI applied over the weekend for the position, and was contacted the following week for a phone interview. I emailed the interviewer a reply and explicitly stated that I would be available on the day they wanted to speak to me at X. No reply. The time came on that day for the interview to happen, and there was no phone call. I let it go, because I know that's not all that unusual.\r\n\r\nThe next week, I was contacted again by the same recruiter, who explained that they had not seen my email, and we scheduled a phone interview. This interview actually did take place, and it went extremely well. I was told that my credentials and cover letter were both impressive, and that I was being seriously considered for the position. At the end of the interview, the recruiter told me that I would hear about my status on X day. That day came and went and nothing was said, so I decided that I wouldn't hear back at all.\r\n\r\nBut the following week (there is a pattern here), I was notified by the recruiter that I would be moving forward in the selection process. They emailed me asking when I would be available to schedule another interview, this time either in person or over Skype, and that this would be discussed in a phone call. I let the recruiter know when I was available that week immediately. At the end of the week, I left a polite voicemail on their office phone about the matter. \r\n\r\nThis was over two weeks ago, and I have received no reply at all. I was in such shock that this kind of behavior was coming from this kind of place that I chose to believe, at first, that some kind of medical or personal emergency was going on in the recruiter's life that was preventing them from getting back to me. Although the job is still up on the site I found it on, I have come to the conclusion that the position must be filled by now. Every other company that has interviewed me for a position but has chosen not to select me for employment has sent me a timely email about my status. And most of them have been both corporate and considerably larger than Fenway. \r\n\r\nI know that things get busy, and that it is sometimes hard to deal with rejection, but I refuse to accept the idea that this kind of behavior is acceptable for any company. There is a difference between not hearing back from a company after you've applied and not hearing back after you've been explicitly told that you are moving forward in the hiring process. I had an opportunity to interview, and possibly to be employed here, dangled in my face. And then I had it taken away without so much as a polite email saying that they had found a better candidate. I have absolutely no faith at all that they will even email me at all about my status. \r\n\r\nI've worked at non-profits before, and I know that most people who work at them are overwhelmed. I am sure that my recruiter was and is still likely overwhelmed. But it takes literally seconds to send out an email.  It's just not that difficult, and it's not professional behavior.\r\n\r\nYou owe your candidates better than this. I deserved closure, and I deserved to be notified. It was hard to let completely go of this opportunity. I was excited to interview with Fenway, and I will always admire the work that they do.", "Interview Questions": "The interview itself was one of the most pleasant interviews I've ever had. Nothing difficult or unexpected was asked."}, {"date": "15 Apr 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Fenway Health (Boston, MA)", "Interview Descriptions": "I was hired at the end of an internship. I had two interviews for the internship. Fenway likes to hire its interns in many departments. People there are very interested in folks who have extensive experience within the LGBT and HIV positive communities in particular. I was interviewed by a team of administrative staff from a variety of disciplines. The interviews were in a group with three to four interviewers and myself all together. They asked for narrative examples of my work including things that went poorly in my work in the past and things that went well. It is very helpful to know a little about this organization and their mission prior to interviewing or even applying. They give employees a finder's bounty if someone you refer is hired and works for at least six months.", "Interview Questions": "Are you willing to be publicly out in this position?"}]]