[[{"date": "30 May 2023", "title": "IT Contractor/Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellesley College (Boston, MA) in Mar 2023", "Interview Descriptions": "It was an interesting experience as I was interviewed by a panel who were more concerned with the community at work than they were about the technical aspects, as those had been covered in my application and I had already provided references. It was really refreshing to be considered as a person rather than as a function", "Interview Questions": "How important is it for you to feel part of a community?"}, {"date": "5 Feb 2023", "title": "Assistant Professor, Computer Science Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellesley College", "Interview Descriptions": "The initial interview discusses research, teaching, collaboration, and DEI. It was conducted over Zoom with the search committee for about 25 to 30 minutes. The department is overall welcoming and supportive.", "Interview Questions": "1. What course can you teach? 2. What new courses could you bring to the department? 3. Tell me about your research? 4. How could you contribute to DEI within our school?"}, {"date": "6 Oct 2022", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Wellesley College", "Interview Descriptions": "Don't bother applying here unless you're an alumnae. That's pretty clearly stated in most of their job ads, but sometimes it takes 2-3 times to accept that they really mean that: they prioritize their grads.", "Interview Questions": "They didn't ask me any questions because I never had an interview. I didn't graduate from Wellesley so I wasn't even a serious candidate."}, {"date": "11 Aug 2022", "title": "Associate Dean of Students Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Wellesley College in Mar 2022", "Interview Descriptions": "Attended three virtual interviews with various candidates across campus at three different times.  No response or follow-up on the position even after following up with HR to check on the candidacy status.", "Interview Questions": "What attracted you to this role?"}, {"date": "5 Jan 2022", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Wellesley College", "Interview Descriptions": "Intensive interview process, involving multiple stakeholders - faculty, staff, and students - over the course of an entire day. Interviews included individual and panel/group conversations (search committee, stakeholders, colleagues, etc.) and a brief presentation.", "Interview Questions": "Why do you want to work at Wellesley?"}, {"date": "9 Jul 2021", "title": "El Table Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Wellesley College (Wellesley, MA) in Feb 2019", "Interview Descriptions": "It was a collaborative effort between all the members of the co-op, a very relaxed environment where I learned more about the organization and what I could offer. I appreciated it being in the setting where the work could be because it's a very comforting space.", "Interview Questions": "They asked if I had any prior experience with working in a similar position"}, {"date": "30 May 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Wellesley College", "Interview Descriptions": "I was brought in for an interview after submitting an application. I went in for the interview, and received word that I had been hired a few days after. Overall, a positive experience for me. I enjoyed meeting those who work in the library.", "Interview Questions": "What is your availability for the school year?"}, {"date": "6 Jan 2017", "title": "Senior Management Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Wellesley College (Wellesley, MA) in Nov 2016", "Interview Descriptions": "They led me down a long dark hallway in a building that can best be described as Dickensian. Very gothic, and not in a cool way but more like in a depressing, dark way. The weirdest thing is that throughout the interview I swear I heard screams echoing down the long hallway. As if staff or someone were being tortured.", "Interview Questions": "They must have taken \"how to interview\" classes from Kim Jong un. They lined up in a row and when the master laughed, they laughed. When the master was serious, they were serious. It was surreal. One by one the panel would fire off standard interview questions, and after I answered they all looked fearfully at their leader for approval."}, {"date": "11 Feb 2017", "title": "Preschool Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Wellesley College (Wellesley, MA) in Aug 2016", "Interview Descriptions": "Online application, followed by a background check and in-person interview.  Following the interview with a senior staff member, they place you in one of the classrooms to observe how you interact with children.", "Interview Questions": "Why do you like working with children?"}, {"date": "3 Mar 2016", "title": "Assistant to Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellesley College (Wellesley, MA) in Feb 2016", "Interview Descriptions": "phone interview first with two people, then interview on campus with two direct reports, then a panel interview, then two admins, then HR to over over benefits. No decision made yet waiting to hear.", "Interview Questions": "What past skills can you use in this role"}], [{"date": "12 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Wellesley College (Wellesley, MA)", "Interview Descriptions": "Applied online and heard back immediately\r\nmet with the administrative assistant and discussed my qualifications with her\r\npretty easy interview\r\nthe hardest part is getting hired because there is a high demand for student jobs on campus", "Interview Questions": "can you commit to a certain set of hours?\r\nwhat are your computer skills?\r\nWhat are you office skills?"}, {"date": "5 Dec 2015", "title": "Senior Records Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Wellesley College (Boston, MA) in Nov 2015", "Interview Descriptions": "I applied online and was called by an HR representative to come in for an interview with three separate people from the department, one who would be the supervisor. The interview took about an hour. A week later, the same HR rep called again to schedule a second interview, this time with the head of the department as well as three more people in the department.", "Interview Questions": "How do you approach a large workload? Do you panic when you can't get everything done in a day?"}, {"date": "16 Nov 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Wellesley College", "Interview Descriptions": "The person who interviewed me was very nice, but also rather direct in what she was looking for - she wanted to know that I had experience with handling confidential information and that I could handle juggling many projects and problems at the same time.", "Interview Questions": "Basic questions: What makes you different from all the other applicants? How will this job help you in your future career search? "}, {"date": "28 May 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6+ months. I interviewed at Wellesley College (Wellesley, MA) in Jan 2012", "Interview Descriptions": "Submit a short paragraph explaining why you want the job and why you should have it. Also bring some portfolio to show your skills to prove that you are most suitable person for the job than any others.", "Interview Questions": "Nothing unexpected was asked (not for me at least)"}]]