[[{"date": "22 Dec 2019", "title": "GET Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Aimfill International (Visakhapatnam) in Dec 2019", "Interview Descriptions": "basic questions were asked on the core and interviewer was friendly. i prepared a lot but most of the questions were basic and industry related. be confident and all the best", "Interview Questions": "tell me about yourself"}, {"date": "20 Aug 2019", "title": "Associate Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Aimfill International (Visakhapatnam) in Aug 2019", "Interview Descriptions": "Conduct TNQT and the results were announced later.  After the results they called up for an interview in which TECHNICAL,  MANAGERIAL AND HR ROUNDS WERE CONDUCTED.  AND THEY RELEASED THE TEDULTS AFTER 1 WEEK.", "Interview Questions": "one programming question, basics on c,  java, cpp and the project work"}, {"date": "25 Jun 2018", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Aimfill International (Cochin)", "Interview Descriptions": "applied online, get a offer call for interview in the location where the company is situated,face to face interview with HR administrator of the company, ask some questions related with the industry", "Interview Questions": "how you handle a struggle in the organisation?"}, {"date": "4 May 2018", "title": "Java Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Aimfill International", "Interview Descriptions": "I appiled in 2016 it takens 4days  processing  one telephonice interviwe and two techinical interview  and hr interview very basic quesations asking very easy interview", "Interview Questions": "wt is jdbc spring alla those things"}, {"date": "25 Feb 2018", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Aimfill International (Mumbai) in Jan 2018", "Interview Descriptions": "Very simple and straight forward questions. Interviewer knew what she was talking about even though she was not tech savvy. I was told to wait along with others in a long queue but it did not feel uncomfortable at any point given that the office is self sufficient with all facilities.", "Interview Questions": "Show me a website which you have designed or have been a part of the team who designed it."}, {"date": "12 Jul 2017", "title": "Voice Process Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Aimfill International", "Interview Descriptions": "there will be personal  round,Group discussion and hr round and the interview process will be 4 to 5 hours,Company is with placenta Surrounding with good communication and nice support from the management and seniors", "Interview Questions": "say about your self"}, {"date": "12 Jul 2017", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Aimfill International (Chennai) in Jul 2017", "Interview Descriptions": "when i attent the interview first i wished my interviewer then she told to introduce myself then i spoke about past career life. she gave me a pen and told me to convience her to buy that product. finally here my skill was tested and I've been selected.", "Interview Questions": "tell me about yourself"}, {"date": "12 Jul 2017", "title": "Team Member Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Aimfill International (Chennai) in Jul 2017", "Interview Descriptions": "When I atten the interview first I wished my interviewer the she told me to introduce myself then I spoked about my past carreer life. After that she gave me a pen and told me to convience her to buy that product. Finally here my skills was tested and i've been selected as an employee.", "Interview Questions": "Compare the difference between two model mobiles(android & ios)"}, {"date": "24 Jul 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Aimfill International (Chennai) in Jun 2017", "Interview Descriptions": "It's very important interview in my Life , and i very prepared to the interview. They are asking general knowledge questions and \r\n questions  about aviation industry . And a personal interview group discussion . They check our database and verified it.", "Interview Questions": "Major questions about aviation industry"}, {"date": "5 Dec 2017", "title": "Software Test Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Aimfill International (Bengaluru) in Jan 2015", "Interview Descriptions": "It took forever just to get the interview. I'm sure it happens all the time though. You get a phon interview first then a few weeks later you get an in person interview", "Interview Questions": "Bug life cycle"}], [{"date": "23 Jan 2018", "title": "Management Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Aimfill International (Bengaluru) in Aug 2014", "Interview Descriptions": "I Step to this company as an fresher . Then i had interview with HR Executive and then she had  given me for online  test and IQ test. then i got selected for 2nd round  and then 3rd round and then final round.", "Interview Questions": "How will you react in  difficult  situation."}, {"date": "14 Jun 2014", "title": "Business Development Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Aimfill International (Bengaluru) in May 2014", "Interview Descriptions": "1)Aimfill is primarily an \"Air hostess Academy\" but no one over there has the basic courtesy to pick up a ringing phone...and they are into hospitality...hilarious\r\n2)20th of may 2014 I got a mail from Aimfill, Bangalore saying that they have an opening for BDE. Went there and gave the interview. Was selected for the first round and they told me that they would call me for the final interview later (a telephonic round).\r\n3) But that didn't happen. After several days when I asked them about the interview dates, they mailed me saying that I have not been selected because they need a candidate who speaks Kannada. \r\n4) Is that not strange that you get selected through the first round and then later informed that you have been rejected. \r\n5)Did they mention it to you before- NO. On mail before calling the candidates for interview- NO. \r\n6) When I complained about the same to there HR, they panicked and told me that they will conduct the last round for me but Did that happen -NO", "Interview Questions": "N/A"}, {"date": "27 Jun 2016", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Aimfill International (Hyderābād) in May 2014", "Interview Descriptions": "questions irrevelant to the job, questions about personal life, general questions, skype interview with the manager, company dont know why r they hiring someone, they hide the correct picture and give fake words, good for nothing long interview sessions, long waiting time, bad environment, all female staff, flirtatious employer and his favourite employees are all the same.good riddaemce", "Interview Questions": "tell me something about yourself"}, {"date": "7 Dec 2015", "title": "Branch Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Aimfill International (Cochin) in Sept 2013", "Interview Descriptions": "Great Experience, Since I had Entrepreneurial experience before I joined, my Interview went awesome, CEO Mr. Fazil Muhammed appreciates the skill of the candidate irrespective of their age. For youngsters its a start for a great career, and future ahead. It was indeed a great experience and moreover the complete procedure was smooth. Its all about how best you can perform with all the support from the management and team, with all plans set and your career ready to boost .", "Interview Questions": "Experience, Skills, Art of getting things done through others"}, {"date": "29 Dec 2017", "title": "HR-Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Aimfill International (Thiruvananthapuram) in Jul 2013", "Interview Descriptions": "Grooming Standards - 1st Priority\r\nCommunication Skills \r\nLanguage Skills\r\nBasic Experience for Ms Office, Job portals, Power point presentation\r\nA brief on the dress code acceptance and travelling for review meeting would be first basic question", "Interview Questions": "Are you good at valuing your time? Will you value the company's time and opportunity"}, {"date": "7 Dec 2015", "title": "RM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Aimfill International (Bengaluru) in Apr 2012", "Interview Descriptions": "It Was With Aimfill CEO Mr. FAZIL MOHAMMED BASHEER He is the Man with power full mind to achieve the mind... it was excellent \r\n\r\nMultiple rounds of job interviews  other candidates are Not selected \r\ni dont know i have seen many candidate  where there are many candidates \r\nthe job is particularly challenging the employer typically selects the most desirable candidate(s) and begins the negotiation of a job offer", "Interview Questions": "typical questions From Mathematics, electronics and Aviation."}]]