[[{"date": "7 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaRS Discovery District in Feb 2022", "Interview Descriptions": "Straight forward - 1)Initial screening (one-way interview) then if you are selected yo move to 2) Interview with the hiring manager. (30 min). The entire process took one month. They got back fairly quickly after the interview.", "Interview Questions": "Please tell me about yourself."}, {"date": "19 Nov 2021", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaRS Discovery District", "Interview Descriptions": "There was a phone screen with the Talent Acquisition individual, that was very straight-forwarded. \nFrom there I had one interview with the team, that involved general behavioural question, why I wanted the job and my experience in my sector. It is a very cross-sector workforce, so that piece was key.", "Interview Questions": "Why do you want to work for this organization?"}, {"date": "10 Nov 2021", "title": "Product Manager, Talent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaRS Discovery District", "Interview Descriptions": "1) initial prescreen call with a recruiter. asked job-relevant questions and general questions around my interest in working at MaRS. Was a pleasant call. \n\n2)  second-round video interview with 3 person panel. asked quite odd questions, like what is my origin story. \n\nAs someone with 10+ years of recruitment experience, the second round interview questions felt irrelevant to the job requirements and strange.  It felt like they were trying too hard to mimic big tech companies. \n\nI just find it funny that this role was part of their HR division with the aim to consult start-ups on their hiring and HR functions.  All interviews are a performance to some degree, but the type of questions made me feel like some tap-dancing circus animal. It'd been nice to be treated as an adult and professional, rather than needing to do jazz hands. \n\nI was declined from the role, which ultimately was for the best for me - so who knows, maybe these questions weed out people who aren't a \"cultural\" fit.", "Interview Questions": "What is your origin story "}, {"date": "12 Sept 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MaRS Discovery District (Toronto, ON)", "Interview Descriptions": "The process is five or six steps. First is an online application, then a call interview with HR, then another call with the line manager then exercise.  It takes from 1 to 2 months to complete the process.", "Interview Questions": "Question about experience and background."}, {"date": "12 Jun 2021", "title": "Market Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at MaRS Discovery District (Toronto, ON) in May 2021", "Interview Descriptions": "I had first applied in March.  I received an email confirmation of my application almost immediately after submitting on their application portal.  \r\n\r\nWithin this email confirmation I was: \r\n- Informed that \"Whilst we normally schedule any contact with you in advance, we may call you without prior notice. We only call from a telephone number originating in Canada and we do not use automated dialling or robo calling systems.\"\r\n- an update should be expected within 10 business days\r\nI didn't hear anything back until 2 months later, when I received another email.  \r\n\r\nThis second email entailed: \r\n- “We are excited to advise you that you are within the top 9, out of 140 applicants that we would like to move forward onto the next step of our recruitment process, a phone screen.”\r\n- “We invite you to provide your availability based WITHIN the attached schedule by indicating the time(s) and day(s) that you would be available for a Zoom call lasting about 20 minutes.”\r\nThere was a link at the bottom of this email that went to another site where one can enter their availability within calendar blocks.  I was not cold-called by phone as the first email mentioned may happen. After confirming the time I would be available for a zoom call, I received a third email with a calendar invite and Zoom link for the earliest time slot I had requested.  \r\n\r\nOn the day of the Zoom screening, a few minutes into what should have been the screening I received an email stating that they would be late, but are not longer than 10 minutes behind.  After roughly that long, the screening call commenced.  This consisted of fairly standard, rapid-fire screening questions that the interviewer was entering into a sort of survey (which is also where they were selecting the questions from).  They ranged from the normal screening questions answered initially in your application (e.g. Are you legally entitled to work in Canada?) to questions about your interest in the topic of the job.  I was also asked a personality-gauging question: “How many golf balls can you fit inside a school bus?” \r\n\r\nI was asked if I was interviewing with any other companies at this time, which companies they were, and at what point in the interview process I was with them, as the interviewer explained that they were interested in moving forward with the applicants most committed to vying for this job.   I was told this time that I was in the top 4 of 191 applicants.  I was informed that the interview could run a bit longer since it was running late, but that we would need to pause around the time that the interview was originally scheduled to end so that they could email the next interviewee that they were going to be running late for their interview.  Within this screening interview, I was asked if I was interested in having an interview with the hiring manager, which I said yes, and a date and time was offered to me that was agreeable.  I was sent a confirmation email with the calendar invite for the date and time agreed upon.  The interview was rescheduled later via email as the hiring manger was out of office on the original date.\r\n\r\nThis was another Zoom interview, scheduled to last about 45 minutes.  This interview was similar, with some of the questions from the first screening interview repeated at first, before delving into more questions about my background and fit to the role.  This was also done as a sort of survey-like format, with the interviewer selecting questions to ask, and then typing in notes about my answers to the form.  In both the screening interview and the hiring-manager interview, I was given the opportunity to ask lots of questions.  Within the screening interview, most of the answers to my questions were along the lines of “the hiring manager would know more about that than me,” so I opted to ask the majority of my questions during the hiring manager interview.  I was informed that I would be told of further steps at the beginning of the next week.  \r\n\r\nI did not hear from them from that point until the next month, when I received an email informing me that they had selected someone else for the role.  This email noted “From an initial pool of over 200 applicants […]” (in contrast to the initial 140 that grew to 191 over the course of the process). In total, the process took about 3 months and seemed to have a massive number of applicants that continued to grow over the course of the interview process.  The interviewers were both very nice to speak with, but the lack of communication during the interview process made it difficult as an applicant to gauge whether or not the lack of contact was an outright ghosting or if it was just due to a slow process.", "Interview Questions": "How many golf balls can you fit inside a school bus?"}, {"date": "5 May 2021", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaRS Discovery District", "Interview Descriptions": "First you have to do a video interview with only a few seconds in between receiving the question and the answer, it's a recording you send of yourself and if you advance this round you are asked for an in person interview with 3 people from the company.", "Interview Questions": "How do you deal with a difficult or tough workload / tasks you are unsure about?"}, {"date": "30 Jan 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MaRS Discovery District in May 2021", "Interview Descriptions": "They reached out about 10 days after the job posting closed, and I did the usual screening call with HR, followed by an interview with the person that would be my Manager, and two of my future team members. I received an offer about 3 weeks later.", "Interview Questions": "What are some key challenges entrepreneurs face?"}, {"date": "14 Apr 2022", "title": "Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District in Apr 2021", "Interview Descriptions": "applied through job portal with cover letter and resume. got contacted for a phone screening with MaRs hr for 30 minutes. then got invited to a 30-45 minute interview with the managers of the startup.", "Interview Questions": "tell me about yourself. \r\n\r\nCan you describe what mars discovery district is with your own words. \r\n\r\ndescribe what your personal superpower is.\r\n\r\nwhat are issues that you think are prominent within the engineering student community?"}, {"date": "6 Apr 2021", "title": "Senior Market Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Mar 2021", "Interview Descriptions": "a. Phone Round - Recruiter called to get the basic details\r\nb. Hiring Manager panel round - Really offensive questions were asked during the interview. From a personal level. I visibly felt uncomfortable.\r\n\r\nAm glad that I was not selected. But, please do not spend your time in this place. This is a pathetic place. This pandemic has caused massive damage to them.", "Interview Questions": "Q-What are the personal reasons that made you change your last job?"}], [{"date": "25 Feb 2021", "title": "Manager Strategic Accounts Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District", "Interview Descriptions": "I received an email reply for a telephone screening interview.  I tried to set up a time with their automatic meeting tool but it was not working. So I emailed the hiring manager to ask for a date and time. \r\n\r\nThe hiring manager suggested a date.  After I confirmed and inquired for a time, I did not hear back. I followed up three times throughout the weeks. I did not hear back so I gave up.\r\n\r\nA few days later, I received an automated email , thanking me for the telephone interview and it was a pleasure to speak but they weren't selecting me. Unfortunately I did not have an phone interview, I did not speak with anyone or receive a reply.\r\n\r\nIt seems as though they are having internal issues with their HR hiring processes. Unfortunately this was unprofessional.", "Interview Questions": "This is not applicable "}, {"date": "20 Feb 2021", "title": "Senior Associate, Content Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District", "Interview Descriptions": "Average interview questions. \r\n\r\nHowever after the interview and being told that they would get back to me and following up with my application, I was ghosted without any further correspondence.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Nov 2020", "title": "Junior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District", "Interview Descriptions": "The phone interview was easy and after, I was invited for an in person interview for a final round. There were standard questions about my current role and responsibilities. The interview went a little downhill when I was explaining my international experience. For whatever reason, they assumed I lived in Canada my whole life and purposely went abroad to gain experience - perhaps it was my lack of foreign accent. So when I explained I went home for an internship, it threw them off and they asked if I was legally allowed to work in Canada. Cue my life story about being born in Canada but grew up overseas. At the end of the interview, they wanted to confirm again that I was legally allowed to work in Canada, which made no sense to me. Maybe I should have brought my Canadian birth certificate along to the interview? At the time of the interview, I had also been employed with another large Canadian employer for 1.5 years. This part of the interview threw me off because I'm not sure why there were assumptions in the first place and a lack of trust in my responses.", "Interview Questions": "Tell me about your current role and responsibilities. "}, {"date": "8 Dec 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Oct 2020", "Interview Descriptions": "I heard back a week after the deadline to apply for the role. I had an initial 20 minute screening video call with the Hiring Manager, then two 30 minute video interviews with other members of the team that same week.  The whole process moved really quickly, which I appreciated. Everyone I interacted with was very nice, and supportive, even though I didn’t receive an offer. They were also happy to answer the many questions I had, and even offered to refer me for other positions!", "Interview Questions": "Tell me a bit about yourself"}, {"date": "2 Dec 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Oct 2020", "Interview Descriptions": "I applied online, had a call with the hiring manager, bypassing the HR screening call and then 2 panel interviews with the team. Overall the hiring and interview process was simple and relatively fast. For the amount of work they expected for this role, the salary provided was significantly below the industry average.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "21 Aug 2020", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MaRS Discovery District", "Interview Descriptions": "Efficient and questions were fair. Although rather competitive, interviewers were all extremely nice and tried to make me feel at ease. The phone screening was done with HR and I met the team, my manager and senior HR associate for the in person interview.", "Interview Questions": "Why did you choose MaRS?\r\nTalk about one challenge that you faced in the past and how you over came it.\r\nWhat objectives do you hope to achieve by the end of this  project"}, {"date": "25 Jan 2020", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District", "Interview Descriptions": "Introductory Phone Call Interview with Talent Acquisition, they were great and begun the call by providing a bit about their background and how long they had worked at MaRSDD and detail on what MaRSDD does and the verticals of enterprise, clean tech, AI and fintech.", "Interview Questions": "Describe what MaRSDD does?"}, {"date": "3 Jul 2019", "title": "Summer, Investment Accelerator Fund Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Jun 2019", "Interview Descriptions": "Applied online, heard back 3 weeks later by email from HR to set up a one way video interview where I was asked 6 questions. One week later I was contacted to come in for an interview with two managers. An hour long, 45 minutes of questions from them and about 15 minutes left for me to ask questions.  A lot of questions about past experiences and how I overcame difficult situations.", "Interview Questions": "Tell me about yourself. Tell me about a time where you felt overwhelmed? "}, {"date": "12 Apr 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District (Toronto, ON)", "Interview Descriptions": "I had a phone interview with the Director and an associate. They asked general questions about my experience and invited me in for an in-person interview. This interview had most of their team present (~5 people). The questions were more typical interview type questions.", "Interview Questions": "If you had to coordinate an event without any prior knowledge, what steps would you take? "}, {"date": "11 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Mar 2019", "Interview Descriptions": "My first interview was a series of 5 automated questions delivered via prerecorded videos on a computer. I answered to a time-limited recording. My second interview was then carried out over a video call (could have been in person but I was not in Toronto) and they asked yet another series of questions to get to know me better. Very typical and characteristic interview questions.", "Interview Questions": "What do you know about MaRS?"}], [{"date": "22 Dec 2020", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Dec 2018", "Interview Descriptions": "Two-phase: 1.) phone interview was done by an HR manager, 2.) the second interview was with a panel of 3 people - with HR, program director & enterprise partner. The panel interview was very straightforward and asked questions in relation to the job and work experience. Elaboration of skills on how entrepreneurial skills were utilized during the current position. Lessons from the current job that might be relevant to the position that I was applying. Asked why that position was interest as well.", "Interview Questions": "How have you shown entrepreneurial initiatives? "}, {"date": "27 Jun 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District", "Interview Descriptions": "Video interview followed by in person interview, both interviews were casual, and the manager/HR personal were very nice. However, they do take a long time to give you a reply on your status. I was interviewing for a coordinator position but they questioned my motives because my educational background was different from the department they operated.", "Interview Questions": "What do you know about MaRS, Tell me about yourself, what is your process"}, {"date": "19 Jun 2018", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MaRS Discovery District (Toronto, ON) in May 2018", "Interview Descriptions": "Highly unorganized process, low transparency, and lack of respect for the interviewee. I am unlikely to apply for another job at MaRS. The process included a short phone interview and an in person hour and a half interview with a role playing exercise.", "Interview Questions": "what are some future trends in one of MaRS's four area of focus? "}, {"date": "1 Oct 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Apr 2018", "Interview Descriptions": "About two weeks after I submitted the online application I was contacted by for an hour long in-person interview. There were no HR present during the interview, only the immediate supervisor and manager.", "Interview Questions": "Tell me about yourself"}, {"date": "23 Sept 2020", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Mar 2018", "Interview Descriptions": "First had a 15 minute screening call with the hiring manager, and then an in-person 30 minute interview at their location in Toronto with the hiring manager and the lead executive of that team.", "Interview Questions": "The usual; tell me about yourself, why do you think you'll be a good fit, explain how your past experience make you a good candidate, what personality traits will help you succeed in this role, etc."}, {"date": "16 Nov 2017", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Nov 2017", "Interview Descriptions": "I had a pre-screening phone interview for 15 minutes and then was invited to an in-person interview that lasted 1 hour. The pre-screen asked very basic questions: what do you know about MaRS? why did you apply for this job? etc. The in-person interview with the Manager and HR partner was more in-depth, and I was allotted 15 minutes  of the time to ask my own questions.", "Interview Questions": "What do you know about MaRS?"}, {"date": "22 Jun 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District (Toronto, ON) in May 2017", "Interview Descriptions": "I applied by email and received a reply about 2 weeks later. They asked to set up a phone interview that was about 15 minutes long. After the phone interview, they planned on doing two in-person interviews with candidates who proceeded, though I was not one of those. The interviewer was from their HR department and very friendly, although she said she would contact all applicants regardless of whether or not they passed the first round of phone interviews, but I did not hear from her again.", "Interview Questions": "What do you know about the MaRS Discover District and about the MaRS Solutions lab specifically? "}, {"date": "16 Jan 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Jan 2017", "Interview Descriptions": "Video interview is nerve-wracking; you 1 minute to record your responses to pre-recorded questions (one at a time) in front of a webcam. In-person interview had a lot of questions focusing on negative past experiences. Make sure you have lots of different examples of negative experiences prepared.", "Interview Questions": "What do you do when your project fails?"}, {"date": "7 Feb 2020", "title": "Associate, Advanced Energy Centre Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District (Toronto, ON) in Aug 2016", "Interview Descriptions": "Phone interview first, then two rounds of  in-person interviews (staff level first than HR and director). Friendly and professional. Asked the basic interview questions - tell us about yourself, why are you interested in the position, name a weakness etc.", "Interview Questions": "what do you think is the biggest (most important) energy innovation recently?"}, {"date": "4 Aug 2016", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Jul 2016", "Interview Descriptions": "First and second round interviews. Interviews were with a Senior HR manager and the person I'd be reporting to in the role. The interview process was pretty free-flowing. The impression I got was that they were looking for a fit in terms of personality and skills, but most importantly, for someone who could pick up on the key aspects of the job without too much direction. I didn't get the role, but the senior HR person on the interview did agree to have a short follow up phone call with me to discuss why they chose someone else and areas where I could have provided better responses.", "Interview Questions": "Usual stuff like \"What interested you in the role\", and \"What would describe as your strengths?\" as well as questions about your educational background. It was a position working with life sciences startups, and my degree was not in that particular area. One of the tough questions they did ask was \"Tell me about a time when you and your team were trying to complete several concurrent objectives and it wasn't possible to achieve them all\". "}], [{"date": "9 May 2016", "title": "Fintech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MaRS Discovery District (Toronto, ON) in Apr 2016", "Interview Descriptions": "Informal and great discussion. Interviewer laid the business and operating, the key drivers of the division in a very articulate but accessible manner. This in effect gave a very good outline of what the nature of the job, the culture and the objectives as a group.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Apr 2016", "title": "Talent/Recruitment Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at MaRS Discovery District (Toronto, ON) in Jul 2015", "Interview Descriptions": "I was brought in on 2 separate occasions to discuss partnering with MaRS talent.  It was obvious the recruiter did not have an abundance of experience, instead was working to 'text book' methods of recruitment.  I was very disappointed that there would not have been someone leading the daily recruitment activity that was more progressive and new age recruitment.  Half way through the interview it was evident to me the interviewer was trying to 'learn' on the job by asking me 'how I recruit' in detail.   Very disappointing.", "Interview Questions": "Exactly how do you do a search for a hard to fill technical position?  Detail step by step exactly what you do?  How do you do it?  Where do you search - detail all sources you go for candidates."}, {"date": "17 Aug 2013", "title": "Manager, Youth Leadership, Innovation, and Impact Program Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaRS Discovery District (Toronto, ON) in Jul 2013", "Interview Descriptions": "The application and interview processes differed a lot from the usual ones. Instead of cover letter, an applicant might make a video, a website or write a three-pages essay on why he/she would like this position. The director contacted me very quickly for an interview and said it would be a behav/tech one-on-one interview. It turned out to be a meeting of five applicants in the same room. For one hour we were supposed to work in a team coming up with our common vision on the program one of us was supposed to manage when chosen.", "Interview Questions": "Within 10 minutes give a detailed feedback to your own participation, the participation of 4 other applicants and the entire interview process. "}, {"date": "12 Nov 2015", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaRS Discovery District (Toronto, ON) in Jan 2012", "Interview Descriptions": "I was a massive fan of MaRS for years and made it a point to go to events hosted there and kept up with the ongoing development. I was, of course, pleased to get an interview and even more happy to get a second and a third. \n\nThe first interview was HR + Hiring Manager and was a very standard verification of my experience. The second interview was with the Hiring Manager and was about fit and vision. The third interview was a senior HR director (?). A friend of mine interviewed with this person a few months earlier and described them as tough but good. \n\nGenerally I felt I did well in all three rounds. So I was very surprised when all communication stopped. After not hearing for more than two weeks after the third interview I sent a follow up email. No response. I waited another week and placed a call, left message. No response. I tried one more follow up email after a month. Nothing. \n\nThis experience has drastically diminished my respect and interest in MaRS. \n\nEven worse, I found out that a mentor of mine had the exact same experience more than a year later. And, then met two more people who had a similar experience. Test all happened 2012-2014. \n\nSo, if you interview for MaRS and they suddenly ghost you, it's not you, it's them. \n\nAs for MaRS HR and community relations I have some four letter words I'd like to share with you. But instead I will simply encourage you to change your practices.", "Interview Questions": "I don't remember the specific questions."}]]