[[{"date": "27 Jun 2022", "title": "Magazziniere Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CMP", "Interview Descriptions": "è stato svolto in sede centrale con il capo reparto e l'addetto alle risorse umane, io avevo già inviato per mail il mio curriculum vitae e mi hanno fatto alcune domande", "Interview Questions": "hai delle esperienze lavorative precedenti"}, {"date": "5 Aug 2022", "title": "Planner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CMP in Dec 2021", "Interview Descriptions": "Professional and responsible.\r\n\r\nThe first round is an hr interview and 2nd round is the meeting with the manager. They ask behavior questions and background.  \r\n\r\nI kindly decline the offer because I have another one more close to my home.", "Interview Questions": "Why do you want to work in CMP?"}, {"date": "3 Apr 2018", "title": "ESL Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at CMP (New York, NY)", "Interview Descriptions": "Introduce the academic background and relevant work experience. I was also asked some questions regarding how to teach different levels of students and how to make it a student-centered classroom setting.", "Interview Questions": "Introduce yourself. "}, {"date": "25 Mar 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CMP (Barcelona)", "Interview Descriptions": "Called me after a few days for the first interview. They asked me a few questions about myself and they told me a few things about the company. After the first interview they sent me a test to complete it within a week.", "Interview Questions": "What I know about the company"}, {"date": "14 Jun 2016", "title": "Electrical Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at CMP (Houston, TX) in Jan 2016", "Interview Descriptions": "Great time there it was fascinating how well i was treated thank you for the maintained equipment i would work here if it was located in a better place. I feel like the company has a lot of potential wasted in silly projects. I want to see this company successful. I hope this will help you.I need someone to look forward in your reasearch but if you dont have much option this is a good start of a company", "Interview Questions": "Whats your goals ?"}, {"date": "10 Oct 2013", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CMP (New York, NY) in Oct 2013", "Interview Descriptions": "I originally applied for another position at CMP, but my resume got transferred to a different department which they thought would be a better fit for my skills. The time from me applying for the first position to them contacting me for a second position was about 2 months. \r\n\r\nThey told me my experience wasn't what they're looking for in the original position I applied to, and asked me to consider another position possibility. I gladly set up an interview with the director and had a wonderful conversation with him. He pretty much offered me the position on the spot and I was introduced to people working at the organization.", "Interview Questions": "Nothing really unexpected, the director (interviewer) and I talked for about an hour, about the position, the organization, and how I will be able to help them."}, {"date": "22 Oct 2011", "title": "LABOUR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at CMP (Calgary, AB) in Oct 2011", "Interview Descriptions": "People were very friendly at Manpower. My only reservation was I was never told who my employer would be until I was accepted making it difficult to even know if it was a job that I could see myself doing. The bright side was inturn the recruiter. Of of jobs that they felt best suited meended up offering 3 choices", "Interview Questions": "What was the most challenging job you ever had?"}], [], [], []]