[[{"date": "18 Apr 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "Fairly easy interview with standard questions. Also completed a simple assignment. I felt welcomed and encouraged. They asked about relevant experience and several scenario questions. I had an interview with a recruiter first as I was approached to apply. Then a formal interview. I think they went to a third round I was not offered a third round. I did ask for feedback and was disappointed that I did not receive any.", "Interview Questions": "Tell us about why you’re interested in working here?"}, {"date": "23 Feb 2023", "title": "Market Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Heart and Stroke Foundation of Canada (Brampton, ON) in Dec 2022", "Interview Descriptions": "The interview process was very professional and technical and the interviewer was pleasant. Questions were mostly based on fundraising experience and your experience with digital marketing, understanding consumer behavior, and developing marketing strategy plans. In addition, it involved having basic analytical knowledge like experience with advanced excel, and data visualization tools like Microsoft Power BI.", "Interview Questions": "Q. Tell us about yourself. Q. How would you approach analyzing our audience? Q. How does your experience qualify you for this job? Q. What is the biggest challenge in understanding consumer behavior?"}, {"date": "17 Mar 2022", "title": "Canvasser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "Began with a brief telephone conversation lasting about 20-minutes to review skills and knowledge of the organization. This was followed by an in-person meeting with the manager of the department to discuss the role, expectations and scheduling.", "Interview Questions": "Why are you interested in the organization?"}, {"date": "13 Jun 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada (Calgary, AB) in Jan 2022", "Interview Descriptions": "Smooth fast and easy interview process. They were kind and not interrogative. Felt more like a conversation than an interview. The interviewer gave me time to think and i was not rushed to give an answer", "Interview Questions": "What kind of things do you do outside of work?"}, {"date": "23 Jun 2021", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "Interview was fairly straight forward. It was with the Accounting Manager and Senior Accounting Manager. Generic accounting questions, such as how would you explain an accrual, etc. A formal interview where they asked questions and stuff.", "Interview Questions": "How would you explain an accrual?"}, {"date": "9 Feb 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Heart and Stroke Foundation of Canada in Feb 2020", "Interview Descriptions": "The initial interview was over the phone. It seemed like a normal, phone screening interview. Only spoke with one person. They asked about yourself, what makes you qualified for the position etc. Education and experience and why you applied and want to work at the organization.", "Interview Questions": "Tell us about yourself (experience and education)."}, {"date": "24 Jan 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON)", "Interview Descriptions": "I was contacted by an HR rep and we scheduled a phone interview - the interview time came and went and she didn't call me. I followed up that same day, expecting that maybe she forgot or her day got super busy, etc. Never heard back. I also send a second email the following day or two in an attempt to reschedule and also heard nothing back. Essentially, I was 'ghosted' by the HR team, seemingly out of the blue and without explanation. Overall, a very unprofessional HR team to work with. The experience was a huge disappointment.", "Interview Questions": "I was ghosted by the HR team, so I didn't have a chance to ask any questions about the role. "}, {"date": "3 Nov 2019", "title": "Finance Analyst Co-op Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Oct 2019", "Interview Descriptions": "The interviewer is so nice. the interview is like a casual conversation but some behavioral questions have been asked as well. The interview is only 20 mins long and just relax.", "Interview Questions": "What's your biggest accomplishment?"}, {"date": "19 Oct 2019", "title": "Community Fundraising Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada (Calgary, AB) in Sept 2019", "Interview Descriptions": "The process included a brief phone screen , a phone interview, a video interview, and an in person interview. The in person interview included a presentation, so I conducted academic research to  make a power point. I was told I did well in the presentation so was surprised that I did not get a follow up call to my interview. My attempts to follow up went unanswered. Overall, I had a positive experience interviewing, but I do think that organizations should call candidates to follow up if they are several interviews deep.", "Interview Questions": "Where is the biggest opportunity for community fundraising?"}, {"date": "17 May 2019", "title": "Coordinator, Donor Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON)", "Interview Descriptions": "The interview process took about an hour . I got interview by two people, seem very nice, easy to talk to. They had about 10 -12 questions , some straight forward questions, and behavioural questions.  I didn’t get an offer yet .", "Interview Questions": "What would like to work here?"}], [{"date": "6 May 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "Very quick just asked why I was volunteering and if I had any personal connection and what I wanted to be doing. Very friendly and willing to chat. wants to know your capabilities to see what you can do for them.", "Interview Questions": "Do you have any personal connection to the Heart and Stroke Foundation "}, {"date": "15 Feb 2019", "title": "Assistant Content Editor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON)", "Interview Descriptions": "They called me about four months after I submitted the application asking to set a phone interview with me the next day. I thought it was strange that it took them so long to review applications but didn't comment. I had a one-hour phone interview, It was so annoying I felt like cutting the conversation short. The recruiter put me on the speaker phone and I could barely hear her and I had to repeatedly ask her to speak up.  I could hear her typing  what I was saying and she couldn't keep up and had to interrupt me many times. Moreover, she clearly didn't have my resume in front of her because she kept asking me to spell the names of my previous employers, spell the names of the applications, projects, etc.\r\nWhat annoyed me even more was that they advertised it as contract position but in fact that was not the case.", "Interview Questions": "How did you hear about our company? Why do you want to work for us? What did you do in your previous job (describe responsibilities)?   What is your salary expectation?"}, {"date": "9 Jul 2019", "title": "Events & Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Jan 2019", "Interview Descriptions": "I was scheduled for a phone interview by the Administrator. I was interviewed by the Administrator on the scheduled interview. Subsequently, I was called for a panel interview with the 2 Coordinators. Afterwards, I did the Microsoft Office Word and Excel test and some basic math test (manual addition of 3-4 digits).", "Interview Questions": "Why do you want to work for Heart & Stroke Foundation"}, {"date": "1 Oct 2019", "title": "Coordinator Community Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Nov 2018", "Interview Descriptions": "Long. Fair questions. They ask you to prepare a presentation for the final interview about the different ways to acquire new fundraisers, foster relationships. Ask about what kind of manager you want to work with. Customer service and sales experience.", "Interview Questions": "How would you generate revenue through new fundraisers? Find new fundraisers?"}, {"date": "19 May 2019", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Mar 2018", "Interview Descriptions": "Applied online, had telephone pre-screening interview followed by an in-person interview. They expect a lot of skills, don't post the salary range they can pay which is super-annoying. People were friendly and positive, however, I ended up feeling used. They knew my salary expectations based on my answer during the telephone screen, invited me in for an in-person interview after that so I figured they were ok with my salary expectations. Turns out they just wanted to use me for a free consultation - after the first interview they explained the process for the 2nd interview, that I'd receive a homework assignment and then have to defend it during the 2nd interview. I received the homework assignment but didn't receive a date/booking for the 2nd interview which is unusual and had me wondering. The homework  was \"tell us step by step what you would do...\" for basically what the main job was going to be. After submitting my homework, I was told they were not moving my application forward with my application because they were looking for someone \"more junior\" (=cheaper).  It was then that I realized they'd had no intention of doing the 2nd interview all along, they just wanted me to give them the step-by-step instructions they could give to someone \"more junior\" they'd hire at a lower salary. Left me with a negative impression of the organization.", "Interview Questions": "What are your salary expectations, what is your experience/knowledge about heart and stroke, tell me about a mistake you made in a project and how did you rectify it/what did you learn"}, {"date": "8 Jan 2018", "title": "Regional Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Heart and Stroke Foundation of Canada (Vancouver, BC)", "Interview Descriptions": "Phone screening interview before interview. Very personable HR Rep.  Want a lot of experience for a lower salary position. Seems like they have way too many high paid executives.", "Interview Questions": "level of skill in different categories that were relative to the position"}, {"date": "16 Aug 2018", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Jan 2018", "Interview Descriptions": "Great, it was really insightful about the organization. the recruiter was nice and welcoming. I learned a lot and gained more interview skills . She asked me a lot of questions and i was able to provide detailed answers", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Oct 2017", "title": "Community Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "The interview was friendly and informative.  The questions were appropriate for the position. There was an opportunity to draw from your previous experience to answer situational questions also.\r\nThe overall process was organized, professional, and very positive.", "Interview Questions": "What is an example of a skill you possess that aided you in succeeding at a previous work project, and please include a weakness that may have hindered the progress of that same work project?"}, {"date": "2 Mar 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "Went through an agency, had a quick interview, was given the job the next day, didn't really have a series of questions to answer, just asked basic Qs, the Director that joined in didn't even have my resume.", "Interview Questions": "What kind of music do I like?"}, {"date": "12 Mar 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Heart and Stroke Foundation of Canada in Feb 2017", "Interview Descriptions": "job was advertised as a maternity leave cover and during interview found out it was only 3 months and part time.  Felt from the beginning of interview I was not getting the position.", "Interview Questions": "Sell me something"}], [{"date": "14 Jan 2017", "title": "Campaign Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Heart and Stroke Foundation of Canada (Brampton, ON) in Oct 2016", "Interview Descriptions": "Fairly easy process, basic questions, easy interview if you practice beforehand* Make sure to practice your behavioral questions. Average interview overall. I got interviewed by the area manager in the office.", "Interview Questions": "You may be placed in a situation where you've placed 50-100 calls and all of the answers have been no, how would you deal with that?"}, {"date": "26 Jul 2016", "title": "Telerecruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heart and Stroke Foundation of Canada (Ottawa, ON)", "Interview Descriptions": "I applied on indeed, they called me within a couple days. They asked me a few questions and asked me to come in the next day to meet the supervisor. It turns out the phone interview was the only interview and the next day I was starting the position. I filled out the paper work and the I was an employee at the Heart and Stroke Foundation.", "Interview Questions": "This is a very repetitive job, what will keep you motivated?"}, {"date": "16 Mar 2017", "title": "Community Engagement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heart and Stroke Foundation of Canada (Regina, SK) in Jun 2016", "Interview Descriptions": "There were two separate interviews; both in-person, in a 1 on 2 format (1 interviewee, 2 interviewers). The interviewers were both incredibly friendly and fun to talk to. It was both pleasant and telling of the type of corporate culture that HSF has. The questions revolved around both my experience(s) as well as hypothetical scenarios, but the whole process was generally lighthearted.", "Interview Questions": "I was provided with a hypothetical situation in which a major partner had withdrawn their support/sponsorship for an event and asked to provide a workaround."}, {"date": "30 Mar 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "The process took a month and a half with 3 interviews: 1 phone interview, and 2 in-person interviews. The questions in the 2 in person interviews were behavioral and situational questions.", "Interview Questions": "Questions regarding past experience pertaining to the position"}, {"date": "20 Jul 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Feb 2016", "Interview Descriptions": "3 rounds. The first one is phone screening call and then with hr, final one is with the hiring manager. The hr one is more about the background check and your education and hiring manager will give a case study, technical testing and presentation on site.", "Interview Questions": "Do you know stats software?"}, {"date": "10 Jan 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heart and Stroke Foundation of Canada", "Interview Descriptions": "I got a call from them promptly after applying. They wanted a phone interview. It took 30 minutes overall and got hired on the spot. Questions about Foundation, campaigning, experience and skillsets.", "Interview Questions": "Standard"}, {"date": "24 May 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Heart and Stroke Foundation of Canada (Toronto, ON) in Aug 2015", "Interview Descriptions": "Group Interview followed by an email confirming if we have been selected. The process was not long at all. It was a pleasant environment there was no pressure during the interview process.", "Interview Questions": "How would you calm a angry caller?"}, {"date": "4 Sept 2015", "title": "Student Placement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Heart and Stroke Foundation of Canada (Kitchener, ON) in Mar 2015", "Interview Descriptions": "I was met by the manager in the reception area and escorted  into manager's office and had a sit down interview for about 1 hour.The area manager was very friendly and took a few minutes to chat before we started the formal aspects of the interview.Questions about my experience were brought up. I was encouraged to discuss my past roles in other organizations. The manager asked a series of questions that related to past experience and many were behaviour based questions.", "Interview Questions": "What I hoped to accomplish during my placement."}, {"date": "5 Jan 2018", "title": "Warehouse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Heart and Stroke Foundation of Canada (Calgary, AB) in Feb 2015", "Interview Descriptions": "Basic and standard personal and behavior questions. Interviewed over the phone. Knew an employee very well who recommended the position. Friendly staff made questions very clear and easy to ask for clarification.", "Interview Questions": "What is your greatest weakness"}, {"date": "6 Apr 2015", "title": "Strategy Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Heart and Stroke Foundation of Canada (Mount Pearl, NL) in Oct 2014", "Interview Descriptions": "CEO seemed very dedicated to the cause & very encouraging as a supervisor to the role. Salary expectation was asked for the job application but I didn't specify and salary range was discussed vaguely. If I had time back I would have presented my salary expectation.", "Interview Questions": "How would your previous experience in healthcare promotion & not-for-profit benefit you to transition easily into the role."}], [{"date": "20 Aug 2015", "title": "Area Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Heart and Stroke Foundation of Canada in Dec 2013", "Interview Descriptions": "It was pretty relaxed - typical interview stuff. You will likely go through one phone interview and two in person interviews. The first in person interview will be with the Area Manager, and the second will be with the Area Manager and Regional Manager. I also had to complete a personality quiz, I'm not sure if they still do this though. I was an internal candidate, so it may have been easier for me. However, I would say almost every time they hire an Area Coordinator, you will be up against an internal candidate.", "Interview Questions": "Tell me about a time you challenged the status quo."}, {"date": "16 Jan 2013", "title": "Telemarking Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Heart and Stroke Foundation of Canada (Owen Sound, ON) in Aug 2011", "Interview Descriptions": "internal interview with previous work experience", "Interview Questions": "expectation of employment"}]]