[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Aug 2021", "job_title": "Direct Support Professional in York, PA", "duration": "N/A", "pros": "You actively make a difference in people’s lives.", "cons": "You may work long hours and may work with challenging individuals"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "You can do better.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Feb 2023", "job_title": "DPS Team Member in York, PA", "duration": "N/A", "pros": "The clients are a blessing work with. The pay is good and there is room for advancement. Overtime is there to take advantage of.", "cons": "The downside of TLC is that often supervisors are discouraging. Culture is very toxic, depending upon which area of service you are placed in. Supervisors often plot against others that are not within the group click."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay away! You deserve better. Listen to the reviews.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Oct 2021", "job_title": "Director of Residential Services in York, PA", "duration": "N/A", "pros": "There are minimal pros about this organization.", "cons": "This place and its current management is a joke. I would not recommend this place for employment or to place your loved one. They DO NOT care for their staff or individuals. From the day you sign the 100 plus pages of policies, to their training, and the lack of communication and professionalism, you will be in for a roller coaster ride of negative experiences - one after another. The training WILL NOT prepare you for anything. If you work in direct care you WILL get suspended for not being perfect and missing things. They will investigate you in a minute. Of course you are going to make mistakes when you are undertrained and overworked. I watched them on many occasions mandate staff right at the end of their shifts because they could not find coverage, causing them to pay more for day care because they were unable to get their child on-time, lose other jobs, miss out on appointments, and more. What I mean is that TLC's staffing is 30% down and that means someone has to work overtime. They typically have 30 to 50 unfilled shifts per week that YOU will fill if they do not find coverage, and they will NOT find coverage. If you are salary (even if you are not), you WILL work way over your 40 hours and will not get compensated (DO NOT LET THEM TELL YOU THAT YOU WILL ONLY WORK 40 HOURS/ WK. THAT'S A LIE). Most staff who are salaried step down to an hourly position because they are overworked and underpaid. A typical work week for anyone is 50 to 60 hours, easily. When they cannot find staff to work with the clients, not only will YOU be stuck with them, they will uproot the clients and place them in different homes in an attempt to consolidate. This is traumatizing and unfair. Can you imagine being told at a moments notice that you have to sleep in a stranger's house and not know when you will return to your own home? Yes, this is really happening. When I began working there I met a staff who worked 72 hours straight and found out that this was normal. I have met many staff who have worked days on end because there was no relief. You have people in HR running an organization who don't even have a proper education commensurate with their jobs , but you wonder the organization is a failure, and will continue to be a failure. You run a hostile organization, with retaliatory tactics to get your way! The organization is on a provisional license and has over 300 citations, all of which I was not made aware of when I interviewed. They have failed their State inspection 3 times in the past year and fail on a regular basis when the County does their random inspections. You got rid of the Executive Director because he was a joke and put 3 people in charge who are an even bigger joke - these are 3 of the most incompetent people you'll meet whose credentials, or lack thereof, will surely make you question their ability to perform their jobs. One was given their position because they didn't want to let her go, but she knows she incompetent and knows that she was given a gift. The other has no formal education in finance and has no budgets in place for any department - you may as well be using money for kindling to start a fire, she wouldn't know, she does not know what's coming or going. And Oh, the last one thinks she's a real COO and is getting paid less than most people in the organization. She's just a glorified secretary whose resume' shows nothing impressive - no leadership experience, no budget or finance experience, no clinical experience or anything worthy of being a COO or CEO - Please, sit down. It takes people 15 plus years to get there. You will not find any person of color in leadership. I will say that again, YOU WILL NOT FIND A PERSON OF COLOR IN LEADERSHIP! And if you do, it will be short-lived. They are intimidated by educated people of color. And be careful, because if you are not on THEIR side, they will target you. This place practices discriminatory and hostile practices, and does not deserve to be in a position to work with people who truly needs an organization who will care for them. You will not change the culture until you get rid of the garbage. Do not think that YOU will come to work here and have a different experience. The reviews are accurate and by employees who have experience the horror that exist at this place."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Oct 2021", "job_title": "Direct Support Professional (DSP) in York, PA", "duration": "N/A", "pros": "Good pay and benefits and ability to work overtime", "cons": "Lack of staff in residential"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "RUN VERY FAR AWAY!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Aug 2021", "job_title": "Direct Support Professional (DSP) in York, PA", "duration": "N/A", "pros": "Nothing, absolutely nothing. NOTHING NOTHING.", "cons": "Behaviors- they are not truthful about how aggressive individuals can be. \nDrama, toxic work environment. \nExecutive Director- he needs to step off of his high horse and take a real good hard look at himself\nOverworked, underpaid… need I go on?"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Run", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jul 2021", "job_title": "Program Manager in York, PA", "duration": "N/A", "pros": "Cool staff and memorable clients", "cons": "Lack of organization and unpredictable hours"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Mar 2021", "job_title": "Direct Support Professional (DSP) in York, PA", "duration": "N/A", "pros": "Lower management is great, they are down to earth and really care about their employees.", "cons": "Upper management , and administration. They will screw people over if they don't fit the \"clique\". They will use people until they get want. They'll throw employees jobs away like it was meaningless. There is no job security what so ever!! If they don't like you they will only keep you at the bottom, so they don't have to worry about unemployment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 May 2021", "job_title": "Payroll and Benefits Specialist in York, PA", "duration": "N/A", "pros": "Free Covid vaccine, partial remote work.", "cons": "Horrendous management from top to bottom, bad pay, toxic people, biased, abusive to staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Upper Management is abusive", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Nov 2020", "job_title": "Direct Support Professional in York, PA", "duration": "N/A", "pros": "The individuals supported are absolutely amazing. Middle management like Program Manager's and ADOS's are very supportive.", "cons": "Expensive benefits, abusive leadership from the higher level, bad work culture due to poor upper management. HR department that is not supportive and unresponsive"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Rough...", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Feb 2021", "job_title": "Direct Support Professional in York, PA", "duration": "N/A", "pros": "Direct support staff is amazing\r\nInformative training", "cons": "Not truthful about levels of aggression in clients \r\nUnclear about whether or not hazard pay is in effect\r\nHigh expectations from supervisors who are never in the houses\r\nLack of communication between higher ups and direct support staff\r\nYou need to be mentally and physically very strong for this job/company. It just wasn’t Right for me!"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Tlc", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Mar 2021", "job_title": "Direct Support Professional (DSP) in York, PA", "duration": "N/A", "pros": "Clients, 401k, benefits, nothing else good to say", "cons": "Terrible management wouldn’t recommend anybody to work here"}]]