[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 1, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "A Great Step on the Conservation Career Ladder", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 May 2021", "job_title": "Individual Giving Officer in Chippenham, South West England, England", "duration": "N/A", "pros": "Pro's are everyone is lovely. Once I started, I was personally introduced to everyone in the office, people treat people like people here, regardless of position which is very humanistic and inclusive. The work life balance is very manageable, I felt as though I could talk to my managers about personal things easily. Obviously this job is very rewarding if you are passionate about the subject matter, protecting whales and dolphins. Departments do their best to keep people up to date with the work each department are doing and how we can all help each other going forward.", "cons": "WDC can sometimes be stuck in their old ways, as a very successful charity that has been active for 30+ years, changes can sometimes be difficult to implement and new ideas can sometimes be pushed to the back burner but I don't believe this is anything that persistence and research cant change over time. I'm not saying that ideas don't get recognised or implemented, it just takes a bit of talking, connection and perseverance. Communication between departments can sometimes falter but WDC are aware of the issues and working to bridge any gaps in understanding."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A passionate organisation with lovely colleagues.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Apr 2022", "job_title": "Communications Officer in Chippenham, South West England, England", "duration": "N/A", "pros": "Lovely people, amazing cause and lots of support from staff. Everybody cares a lot about their work and the common goal of protecting whales, dolphins and porpoises.", "cons": "Limited opportunities for promotions/career growth within WDC. Quite a lot of politics between senior members of staff/between offices. Low salaries in comparison to other organisations/companies due to being a small charity."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great cause and hard working, passionate  team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jan 2021", "job_title": "Corporate Partnerships Manager in Chippenham, South West England, England", "duration": "N/A", "pros": "I have worked at WDC for several years, progressing from officer to management level as our team has expanded. \r\n\r\nPassionate staff - From the Scottish Dolphin Centre to our international offices in Germany, Australia and the US and across all of our teams everyone is incredibly passionate about the cause and achieving our goal of protecting whales and dolphins. I've never worked anywhere else where this genuine passion is so prevalent - people work here because they love the cause. Everyone at WDC, whatever their job, always goes the extra mile. Sometimes that passion can spill into debate - but that's a good thing, and helps us learn, navigate a way through things and improve!\r\n\r\nTeam spirit - We are a small charity working on major global issues. Both within my team and organisationally the senior management team have worked hard over the last few years to build a great culture and team spirit - acting on regularly-requested feedback from the HR Director on staff satisfaction and areas for improvement (something that other employers could learn a lot from!). We share in and celebrate each other successes and I'm proud to be a member of the team, and to have colleagues who bust their arses for a good cause day in, day out.\r\n\r\nFlexible working and genuine commitment to well-being - I can say with hand on heart that WDC as an organisation genuinely cares about its staff and making sure people have flexible working arrangements, and support. SMT have really strongly focused on well-being over the last few years with regular opportunities to access support and training, take time for health (like office yoga) and training mental health champions. During the COVID crisis, WDC have been supportive and adaptable.\r\n\r\nFreedom to innovate and try new things - My favourite thing about WDC and our team is that we have freedom to rip up the rule book and try new things - something I know peers at other charities could only dream of! We have an incredibly supportive Director and SMT are open to taking a risk if it's well thought through. I love this and hope it never changes! Within my team and the others I interact with regularly, I know that ideas are always considered - whoever they come from - and we regularly get sent ideas for our area of work from colleagues.\r\n\r\nGlobally renowned expertise and reputation - Quite simply, our science and policy team are some of the best in the world at what they do with decades of experience.\r\n\r\nHighly supportive senior management team - I regularly deal with our SMT (and ISMT) and have never felt anything other than fully supported. I've been able to make a business case to successfully expand our team and am given freedom to determine our strategy and priorities. That's not to say I don't get asked some difficult and pertinent questions - but the aim is always to understand and enable.", "cons": "Our Wiltshire office location and comparatively lower salaries (being a small charity) has made employing and retaining great staff challenging."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Negative and political", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Aug 2019", "job_title": "Officer in Chippenham, South West England, England", "duration": "N/A", "pros": "Flexible working is generally offered. A few colleagues at officer level very supportive and friendly.", "cons": "The organisation is controlled by a few managers who have a management style that is detrimental to the wellbeing and development of staff, with an ability to  manipulate the senior management team for their own goals. There is a culture to create nigh on imaginary projects to attract financial support that are not making any real impact and misleading supporters. There is a lack of strategic direction which leads to a free-for-all conducive to internal conflict."}]]