[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best job and benefits I’ve ever had", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Apr 2023", "job_title": "Visual Content Producer in Chicago, IL", "duration": "N/A", "pros": "-remote -free health insurance -401k match -a VERY generous amount of PTO (it’s like 4 weeks or something like that) -company really cares about it’s employees", "cons": "I have no negative things to say about this company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Mar 2023", "job_title": "Software Engineer in Washington, DC", "duration": "N/A", "pros": "Great values -- do something meaningful for the country. Effective organization. They have been remote since 1999, so a lot of good remote cultural practices are built-in.", "cons": "Stress is cyclical with the election cycle but there is a lot of work to be supportive of staff and plan for contingencies."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work and an amazing department", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Jun 2022", "job_title": "Director of Analytics", "duration": "N/A", "pros": "The analytics team is a group of incredibly talented, dedicated, passionate, and low ego individuals. They are very supportive of each other and provide feedback or skill sharing to support each other's work and professional growth. \n\nMoveOn as an organization gives a lot of autonomy and leadership opportunities to employees at every level. It takes great care of its employees in terms of benefits, salaries, and really promoting a work-life balance. They provide staff with money and time for professional development and have regular internal trainings on management, conflict resolution, equity, and other topics.", "cons": "You may not make as much as you could in the private sector but you'll be doing work that you really believe in.\n\nBecause MoveOn's analytics department is small (6 people to date) there are limited opportunities for advancement in terms of job title or role. However there are ample opportunities to develop and utilize new skills through self driven projects and professional development budgets."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One of the best places to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Sept 2022", "job_title": "Political Director in Washington, DC", "duration": "N/A", "pros": "Generous pay and benefits. Great work life balance.", "cons": "I don't have any cons from my time at MoveOn."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Amazing!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Aug 2022", "job_title": "Community Manager in Chicago, IL", "duration": "N/A", "pros": "- great benefits\n- remote\n- good work/life balance\n- meaningful work with lots of resources", "cons": "- no process of promotion"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good and bad", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Teamwork could be really strong", "cons": "It was hard not to be able to spend much quality time with coworkers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Healthiest organization in progressive politics", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Dec 2021", "job_title": "Campaign Director in Washington, DC", "duration": "N/A", "pros": "Great values and culture. Strong focus on mission and impact, as well as real attention, not just lip service, to healthy and sustainable workplace.", "cons": "Honestly I think MoveOn is the healthiest and best place I've ever worked. Caring but also bad-ass."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Remote Working Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jan 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Home office benefits, nice virtual workplace, cool community, and nice insurance", "cons": "Remote working is always so difficult"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Dec 2020", "job_title": "Digital Fundraiser", "duration": "N/A", "pros": "Flexibility\r\nBenefits\r\nMentorship\r\nProvide proper equipment to work remotely", "cons": "Need for consistency in work schedule and plan"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One of the best places to work in the progressive movement", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 May 2019", "job_title": "Election Mobilization Director in Chicago, IL", "duration": "N/A", "pros": "MoveOn is a fantastic place to work. \r\n\r\nYou have the ability to leverage immense resources - people, funding, technology, allies, and more to create real change on every issue and election in the country. \r\n\r\nThe work culture is constructive and welcoming. Everyone is able to add their input on everything from email drafts, to plans to the overall organizational direction. The encourage internal growth and most people who work there stay for much longer than is typical in the progressive movement. \r\n\r\nAnd they offer very competitive salary levels and benefits. Including home office stipends, phone and internet reimbursements, health and wellness benefits, and paternity/maternity leave, and much more. The hours are reasonable and not 'campaign hours' so it's usually a 40 hours week and weekends off (with some exceptions for super busy times). The virtual work environment lets you live anywhere and gives lots of flexibility. \r\n\r\nAnd when you're ready to 'moveon' yourself it's been a great stepping stone for future opportunities for dozens of staff that worked there and went on to do other great things.", "cons": "Campaigns can sometimes be stressful and intense at the national level. Need to always bring your A game since MoveOn is the big leagues. A virtual work environment isn't for everyone and can take some getting used to."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An organization that lives its progressive values", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Apr 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great pay and the best benefits I've ever had. The work culture is collaborative, respectful, and productive. In past jobs, I've been frustrated with bureaucracy and that is not the case at MoveOn—be prepared for forward-thinking and fast action, an essential mode for the type of real-time campaigns MoveOn leads.\r\n\r\nI never felt confined in the job I was hired to do. Leadership is intentional about finding the best role for you and allows staff to grow and take on new roles and responsibilities.  MoveOn is a rare place that really trusts its staff and fosters creativity.", "cons": "By design, MoveOn is digital-first and a virtual office. This makes it a very email dependent place and I missed more traditional human interaction on a daily basis. \r\n\r\nThey have a consensus-building model and that led to a bit of information overload. The participatory culture can be distracting because you want to weigh in and read about campaign planning and strategies even if it's not in your job description."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Interesting remote work for a large progressive organization", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Apr 2017", "job_title": "Engineer", "duration": "N/A", "pros": "TL;DR: 100% remote, solid pay / excellent benefits, super nice coworkers, interesting scaled work.\r\n\r\nOverall, I had a great time working at MoveOn during the 2016 election season and beyond, coming as a former tech/data director at a similar, but smaller organization. It was exciting to work with a talented tech team working on software and data problems at the scale MoveOn does. I personally learned a ton, and do believe the work we're doing has an impact on members' lives. I also got the chance to interface with nearly every staff member on some level, and have to say that I never had any problems with anyone; quite the contrary.\r\n\r\nAs with any workplace, your experience will largely be determined by which department / team you are a member of.  I was a member of the relatively new and well-managed tech team, so I can't speak to working as an organizer (though I would argue that working as an organizer anywhere is tough job, and the 100% remote environment could potentially exacerbate the inherent challenges associated with organizing).\r\n\r\nThat said, the remote working style was perfect for me. I was able to travel all around the U.S. (NOTE: you will not be allowed to work outside of the U.S. for 527 org legal compliance reasons!), so long as I was able to attend our daily team meetings and other pre-scheduled cross-team meetings / trainings. These are all conducted via video, which actually works better than you might expect. The rest of the work is conducted largely real-time via Slack, though there is still a significant amount of internal communication via email. \r\n\r\nMy supervisor was very respectful of our time (and differing time-zones), and didn't require any team member to work longer than 8 hours and never on weekends. Of course, the team certainly did come together a few long days/evenings when there were outages, etc. but that's to be expected in any software engineering role.", "cons": "As another reviewer pointed out, the average MoveOn staffer might find themselves challenged by the tech/tools employed by the organization. Under the leadership of an awesome CTO, Ann Lewis, and hard work of a talented and lean team of engineers, the org is making serious strides in this area to alleviate these challenges and ensure less time spent by staff on tech headaches and more on impactful work, while also building and maintaining cutting-edge member facing tech.\r\n\r\nI don't know if this is necessarily a bad thing because there aren't really any junior-level positions, but due to the flat nature of the org chart there aren't clear-cut paths for advancement; I observed new positions are usually hired via external applicants rather than existing staff members (though I did see a few folks get promotions with different titles).  Certainly different from other organizations I've worked where hiring is almost 100% internal, however this is a good thing for you, the potential applicant reading this review!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Can't wait to go back to MoveOn!!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Feb 2017", "job_title": "Campaign Organizer in Las Vegas, NV", "duration": "N/A", "pros": "Great pay, benefits, home office stipend, reimbursement, health and wellness benefit, health insurance, life insurance, all office equipment supplied. I loved working for MoveOn. It was a month before election day, so the hours were long, but well worth it! We achieved our goals for Nevada, defeat Trump and elect the first Latina Senator! I found MoveOn to be a fabulous company, committed to progressive values and definitely took care of their employees. My coworkers were fabulous. I take great pride in the work I did with MoveOn. I don't understand the super negative review and wish the author would have provided examples. It seems that person worked there two months before me. I can't imagine things changed THAT much.\r\nI met some amazing people when recruiting volunteers that I am still friends with. The passion of the volunteers was so uplifting! I had people drive from out of state and rent hotel rooms just to do volunteer canvassing for me during GOTV! Amazing people!", "cons": "Long hours, video meetings scheduled in the morning for eastern time but final meeting at night is local, so Pacific time. I worked many 16, even 18 hour days. But if I wanted to do a mediocre job, I could have worked less. It's a remote position, so you work from a home office and have to be able to manage your time well. \r\nAlso, this job was temporary. I have applied to every open position since then. Can't wait to get back with MoveOn!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent job; Excellent benefits", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "*An extremely smart and dedicated group of leaders and coworkers.\r\n*A workplace culture that emphasizes self care and fully respects work/life balance.\r\n*Remote working is nailed down with technology needs.\r\n*Excellent benefits package.", "cons": "*On-boarding process, especially if you've never worked on an all-remote team before, can be an adjustment.\r\n*Depending on the employee, may be difficult to manage scheduling and cross-departmental collaboration as both a remote workplace spread across time zones and an organization working on shifting priorities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great culture!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Nov 2018", "job_title": "Data Analyst", "duration": "N/A", "pros": "I loved my time at MoveOn. Everyone is very welcoming and dedicated to doing a good job. The process took a couple of weeks. First, initial phone call with HR. Then, a coding challenge, next a team fit interview, and finally I got a call saying I got the position. Would love to go back if a full time permanent position opened up.", "cons": "Everything is remote, so half of your coworkers are in a different time zone."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Campaign Organizer", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Dec 2016", "job_title": "Campaign Organizer in Toledo, OH", "duration": "N/A", "pros": "AWESOME pay, great benefits, wonderful culture, virtual office = work from home most of the time", "cons": "virtual office = you are ALWAYS working, typical work week was about 7 days each week, at least 10 hours each day"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "The professional taint & personal misery of working for MoveOn not worth it", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Aug 2016", "job_title": "Organizer in UC Berkeley, CA", "duration": "N/A", "pros": "You get to work from home, although that also means your work day usually gets extended to from when the east coast staff are awake to when the west coast people go to sleep. That means round the clock. It has a decent work expenses reimbursement policy. If you are personal friends or family of senior staff, you're golden.", "cons": "My rating: 2/10. My personal recommendation is work for MoveOn only if you're deeply financially desperate and then leave as soon as you can to minimize the taint.\r\n\r\nHave you ever worked for an incompetent, disreputable, and fading organization whose senior executives, policies, and work responsibilities make you miserable, then brands you a bad \"poor fit\" employee for being unhappy about that and for not quietly putting up with workplace abuse like racist pay? That was working for this employer.  I've had progressive and Democratic elders warn me not to work for MoveOn if I ever wanted to be taken seriously later in my career, and they were right about how much it'd take to overcome the taint. I would also personally warn people of color not to work for MoveOn.\r\n\r\nVery high staff turnover. In my personal opinion, MoveOn does not make long term commitments to progressive goals either. Instead it seems to flail around and chase after whatever shiny object gets them the most fundraising dollars and press attention. I personally consider MoveOn in general to be a politically incompetent and morally hypocritical organization, although many outsiders with superficial knowledge of this group won't believe it. Its incessant emails, leeching off other organizations' organizing efforts, delusional self-promotion, and diversion of progressive donations from better causes & smarter groups are controversial, if not a cancer on the progressive movement. \r\n\r\nOnce in a while MoveOn does good things for progressives (a broken clock…), but all too often it wastes its members' money on insipid, unhelpful, or irrelevant projects that have zero or even detrimental impact. Increasingly fading and irrelevant, although according to its narcissistic self-portrayals, it's somehow still the most important progressive grassroots organization out there. MoveOn does still however raise enough money from its members to try to throw its weight around. Its naive understanding of how politics works also allows it to take credit for developments in which it had a marginal role (if any). MoveOn also tends to swoop in on ongoing progressive campaigns in seemingly well-meaning but actually empty and purely selfish gestures and take credit for others' achievements. Alliances are common and good, but the way MoveOn does it generates more resentment than it realizes.\r\n\r\nIn terms of working conditions, I was lucky to have a few great coworkers, but overall, I saw a lot of mediocrity and incompetence. At this organization, you have to put up with too much false forced intimacy in the workplace and thoughtless, self-righteous crusading. MoveOn was also extremely disrespectful of staffers' time, forcing ridiculously long working hours and requiring dumb meetings that are irrelevant, unnecessary, and sometimes invasive of personal privacy. You will be forced into handling most technical and programming tasks yourself – even if you're an academic, prepare to learn SQL and spend hours fixing bugs– which they justify as an egalitarian policy but instead is a money-saving, inconsistently enforced HR disaster that squanders everyone's time and energy and creates other problems. (Do they not understand basic staffing principles and Economics 101?) \r\n\r\nHow I will always remember senior management is how much they lied, misled, and betrayed. They also loved to talk about \"work life balance\" to put on a show about caring, but I've found their actual responses in practice to be disastrously incompetent, inhumane, racist, and tone-deaf. To some outsiders and its funding recipients, MoveOn probably still maintains a positive image, but I've had plenty of similar conversations with former employees of this organization. The common theme is that they're relieved to have left. Maybe the internal situation there has changed recently, but I still think the frustrations and professional taint of working for this employer aren't worth it.\r\n\r\nAfter writing your 100th email imploring members to sign this petition or pitch in $3 for that vanity campaign you know will have no impact, you wonder what are you doing with your life, wasting your career and education like that. Dealing with the group's most active grassroots members also made me want to set my hair on fire (think customer service); some are wonderful, but many many are awful.\r\n\r\nMy experience with MoveOn proved for me that long hours on pointless and ineffective projects in that kind of churn-and-burn, high turnover, stressful work environment is destructive for personal and professional well-being. I felt a lot of anxiety and despair while I was there."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unprofessional, thoughtless, over-funded, chaos.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Feb 2017", "job_title": "Organizer", "duration": "N/A", "pros": "For what it's worth, they seem to be trying to make a positive impact in the realm of political action and there are some (few) good individuals.", "cons": "Unfortunately, it's utter chaos - not in a good way. Very unprofessional \"shoot from the hip\" work style and a dumpster fire of a hiring process which leaves people in the dark for months as to their status."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Campaign Organizer", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Apr 2017", "job_title": "Field Organizer in Phoenix, AZ", "duration": "N/A", "pros": "Great Benefits. Great working Environment. Very open conversation. Very helpful and their hearts are in the right place.", "cons": "Too free of a job. Need help reaching out to struggling organizers and figure out the reason why"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work. High impact with virtual office flexibility.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Aug 2019", "job_title": "Campaign Manager in Portland, ME", "duration": "N/A", "pros": "Talented coworkers, virtual office geographic flexibility, principled policy stances, innovative work culture.", "cons": "Some people struggle with virtual office. I didn't, but if you're not good at managing yourself or working alone, it can be less of a good fit."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Average community action Org.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The pay was higher than most  organizer jobs", "cons": "The hours were insanely high even for a campaign."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Collaborative atmosphere\r\nSmart Colleagues\r\nCaring executive directors", "cons": "It's unclear what coworkers are focused on\r\nCan be too politically correct"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Deputy State Director", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Strong mission, flexibility, amazing team", "cons": "Some unrealistic goals, and know that short term jobs will likely not result in future employment with the organization"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "My experience with MoveOn", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Aug 2018", "job_title": "STaff Registered Nurse", "duration": "N/A", "pros": "MoveOn provides daily lists of job applications.", "cons": "I can’t really find anything negative to say!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Wonderful company, wonderful people.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Feb 2013", "job_title": "Director", "duration": "N/A", "pros": "Work from home, great benefits, competitive salary.", "cons": "No centralized office, must get used to working by yourself."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Regional Organizer", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "They treat their employees very well. Lots of benefits too.", "cons": "The hours can be long"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "recommended", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2020", "job_title": "Product Manager", "duration": "N/A", "pros": "there is potential to do anything", "cons": "the work is very intense"}]]