[[{"date": "1 May 2023", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Child Mind Institute (New York, NY)", "Interview Descriptions": "first-round phone interview, second-round assignments, and the last round is a group interview for you to ask questions. no hard questions all very basicfirst-round phone interview, second-round assignments, and the last round is a group interview for you to ask questions. no hard questions all very basic", "Interview Questions": "a Python code and r code for you to debug"}, {"date": "15 May 2023", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Child Mind Institute (New York, NY) in May 2023", "Interview Descriptions": "Child Mind Institute partnered with Stone Alliance Group to help recruit for candidates. I was unaware of this even though I applied directly on Child Mind's careers website. I interviewed with the recruiter.", "Interview Questions": "Tell me about yourself. What is the most challenging employee relations issue you faced? Why are you making a move to a new role? Why do you want to work for Child Mind Institute?"}, {"date": "25 Apr 2023", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Child Mind Institute (New York, NY) in Mar 2023", "Interview Descriptions": "We had an initial call going over my qualifications and interest in the role, as well as the project the role would be focused on and the team they are building out. I'm still waiting for the next interview round and hope to hear back soon.", "Interview Questions": "Tell me about your background as a software developer; what are some projects you worked on that are relevant to this role?"}, {"date": "15 Feb 2023", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Child Mind Institute (New York, NY) in Feb 2023", "Interview Descriptions": "Brief, pleasant. Nice experience in general. They asked me why am I switching jobs, what is my desired salary, and things like that. Nothing too difficult. They also asked about my schedule, which was considerate.", "Interview Questions": "Why did you leave your previous job"}, {"date": "15 Sept 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Child Mind Institute", "Interview Descriptions": "The interview process is very straightforward. The interviewers are kind and seem very knowledgable about the various roles company wide. They are open to questions throughout the hiring process and offer timely responses.", "Interview Questions": "How do I foster community within my work and personal life?"}, {"date": "2 Apr 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Child Mind Institute (New York, NY)", "Interview Descriptions": "Screener call a few weeks after sending in my application and then an in-person interview with research coordinator and lead clinician. The screening call was mostly talking about my research experience and what I think of the position. The interview had more behavioral questions and scenarios about working with children. Decisions were released a few days after.", "Interview Questions": "Tell me about your experience working with children? "}, {"date": "30 Mar 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Child Mind Institute", "Interview Descriptions": "over the phone\nvery simple questions\nI however could not make a 2 year commitment and therefore was not taken on for another interview\nfriendly interviewer great time !\nwould recommend applying to work here if you are interested in doing psychology research centered around adolescents", "Interview Questions": "Why are you interested in working here?\n"}, {"date": "12 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Child Mind Institute (New York, NY) in Sept 2020", "Interview Descriptions": "I knew someone who previously worked there and helped  me get a phone interview. The interviewer was very formal, and asked a list of questions. Overall, it was fine and I felt like I connected. I was very well prepared. Despite telling me she'd be in touch, she NEVER reconnected or gave me feedback, even though I reached out multiple times. I found this very disrespectful. They did not consider the time and effort that went into the interview and prep.", "Interview Questions": "Why do you want this job?\nWhat do you know about CMI?"}, {"date": "19 Aug 2020", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Child Mind Institute", "Interview Descriptions": "Three rounds of interviews, two video calls and an in-person round. Was able to speak with both the supervisor and the current person in the role. Mostly behavioral interview questions, focused on seeing if you would be able to handle multi-tasking/time pressure and quickly-changing situations.", "Interview Questions": "What skills do you have that would help you succeed in this fast-paced role? "}, {"date": "24 Jan 2020", "title": "Clinical Psychologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Child Mind Institute", "Interview Descriptions": "Met with whole team individually. Full day of interviews. Then met with team from other site. Many solo interviews, one group interview. They provided lunch, though it was a working lunch while meeting with other people.", "Interview Questions": "Where do you see yourself in 5 years"}], [{"date": "29 May 2019", "title": "Staff Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Child Mind Institute (Ann Arbor, MI) in Feb 2019", "Interview Descriptions": "First I had a phone screen and then set up a Skype interview. The Skype interview took around 30 mins, there was a long series of behavioral type questions, many were similar and being a student I did not have a wide range of response.", "Interview Questions": "Tell us something someone has described you as that you were surprised about. "}, {"date": "20 Jan 2020", "title": "Summer Program Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Child Mind Institute (New York, NY) in Feb 2019", "Interview Descriptions": "A Skype interview and did not feel very stressful or rigorous. The person interviewing me was very friendly and was very understanding when the camera on my computer stopped working and we had to do a phone interview. Asked about previous experience, what age group most comfortable with, etc.", "Interview Questions": "What would you do if a child was too nervous to come into camp?"}, {"date": "9 Apr 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Child Mind Institute (New York, NY) in Feb 2019", "Interview Descriptions": "Skype interview, approached for interview around 1 week after application due date, 2 on 1 interview. The interviewers couldn't have been nicer. Really let me know how much they appreciated my time.", "Interview Questions": "Strengths and weaknesses"}, {"date": "17 Apr 2018", "title": "Staff Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Child Mind Institute (New York, NY) in Mar 2018", "Interview Descriptions": "Was a comfortable atmosphere and felt more like a conversation than an interview. Was interviewed by the hiring manager and two Senior Staff Associates. Had me come all the way to NYC for a 30 minute interview which was a long process, but learned a lot and overall enjoyed myself.", "Interview Questions": "How do you work with multiple supervisors with different needs? "}, {"date": "20 Oct 2017", "title": "Staff Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Child Mind Institute", "Interview Descriptions": "Applied online, got a call a couple weeks later, went in for the interview.  They were super friendly and welcoming, much more like a chat than an interview.  The whole process lasted about thirty minutes.  Pretty typical interview questions.", "Interview Questions": "What was your least favorite work experience?"}, {"date": "17 Aug 2017", "title": "Major Gifts Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Child Mind Institute (New York, NY) in Jun 2017", "Interview Descriptions": "First I met with the Director of Development. At that same first meeting I met with the longest-tenured person in the department (2.5 years) and the consultant they hired to work on Direct Mail. Many weeks passed before they emailed to have me come back to meet with the Executive Director and HR - but surprised me by also having me meet the President. I was there for an hour and a half. HR responded to my questions and concerns about the work environment with answers that, according to the most recent glassdoor reviews, may have been lies. When I emailed follow-up questions to HR and the folks I met with after having been told to email them with any questions, the Director of Development called me to answer my questions and essentially told me to not bother them anymore (don't bother HR?) and direct all questions to her.\r\n\r\nCMI then requested writing samples, salary information, and references before rejecting me. I told them who my most thorough reference would be (my most recent manager and the person for whom I worked the longest) but my reference said they never connected. They did call my manager from my first job ever, seven years ago. I am not sure if they reached out to any of my more recent references, who were all listed along with titles and organizations so it could be compared to my resume to note career timing. I am not sure why they would bother my references if they weren't going to hire me, and if they got a bad reference (which would surprise me) I am surprised they would not call my most recent and longest-tenured manager to get her take.\r\n\r\nI was disappointed by the decision. When I asked what influenced their decision to decline me so I could improve my candidacy, they refused to answer.", "Interview Questions": "What is the most important thing I need to know about you?"}, {"date": "15 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Child Mind Institute in Feb 2017", "Interview Descriptions": "Applied online and had a phone call screening the same week. Met in the office a few weeks after and then eventually heard back from them with a decision within the following weeks. Overall very straightforward and quick.", "Interview Questions": "Name a challenge you faced in the workplace and how you overcame it."}, {"date": "3 Feb 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Child Mind Institute (New York, NY) in Jan 2017", "Interview Descriptions": "Applied online, got an emailed response asking for a phone interview. After the phone screener, I was invited for an in person interview. Very straightforward but thorough questions. Interviewers were very nice.", "Interview Questions": "What are your career goals?"}, {"date": "17 Feb 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Child Mind Institute in Dec 2016", "Interview Descriptions": "The interview process consisted of an initial phone conversation, followed by an in person interview. The initial conversation included a variety of questions about me, and about the specific role that we were discussing.", "Interview Questions": "How are your skills working in a collaborative setting?"}, {"date": "12 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Child Mind Institute (New York, NY)", "Interview Descriptions": "I got a phone call within a few days of applying online. After a brief phone interview, I was asked to come in to the office. I met some researchers and they were very nice and asked good questions.", "Interview Questions": "Asked about experience with children"}], [{"date": "15 Oct 2015", "title": "Child Care Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Child Mind Institute (Davis, CA) in Dec 2014", "Interview Descriptions": "I was hired through HRI which is a lottery system via UC Davis. You apply and are given a random date when you can apply for a selected number of internships. They are given as first come, first serve so luck plays a factor.", "Interview Questions": "N/A"}, {"date": "21 Aug 2018", "title": "Staff Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Child Mind Institute (New York, NY) in Jan 2014", "Interview Descriptions": "Great to meet with potential colleagues including clinical managers and other staff associates. The interview was a two step process; first meeting with clinical and HR managers, and then met with staff associates and the director of the center for the role.", "Interview Questions": "Why Child Mind Institute?"}]]