[[{"date": "10 Mar 2022", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital in Mar 2022", "Interview Descriptions": "Interview with nurse manager panel via zoom. I spoke to each of the nurse managers for about 5-6 minutes with the total interview being about 35 minutes in length. While I was talking to one manager, the others were listening and able to take notes/make marks.", "Interview Questions": "What is a quality you have that is not always perceived well by others?"}, {"date": "20 Apr 2020", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital", "Interview Descriptions": "I was interviewed over the phone by two people that worked in the office. I was asked mainly behavioral questions. It was quick and easy and i was emailed the following day asking if I would like to accept the position.", "Interview Questions": "Why would you like to work for us?"}, {"date": "11 Dec 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital in Nov 2018", "Interview Descriptions": "Applied on the medical center website. After two weeks someone contacted me saying they passed my resume to the hiring team in JCC. Two more weeks someone contacted me to schedule a panel interview. Very friendly the interviewers. Most of them are behavioral questions. Still waiting to hear back.", "Interview Questions": "How much do you know about Excel? What function do you know?"}, {"date": "25 Jun 2018", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH) in Jun 2018", "Interview Descriptions": "Applied online to a bunch of CRC positions on their website. after about 2weeks of submitting my application, got an email to schedule Phone interview since I was out of town candidate.  After the Initial Phone interview, was invited the next day to meet with the research team and the head of the research team ( a physician).", "Interview Questions": "\r\nQuestions about my research background, Big emphasis on behavioral questions and working on a team. What motivates you, what are your career goals in 5years?, Experience working in a team and how I resolved a problem I encountered while working with a fellow teammate? How do I manage my time, Why do I want to work at OSU, How do you handle stress and stressful situations. What makes you an ideal candidate? How well do you communicate with your supervisor when you are faced with a difficult situation."}, {"date": "16 Mar 2018", "title": "Grants Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH)", "Interview Descriptions": "Interview with director then with management team, enjoyable and non stressful environment with both director and team.  After got offer they gave me 1000 dollars to relocate and a couple weeks to get affairs in order and was very professional, had orientation, went over benefits, culture and perks of being employee.", "Interview Questions": "Why I wanted to work at Ohio State"}, {"date": "26 Feb 2018", "title": "SNA/PCA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH) in Aug 2017", "Interview Descriptions": "I applied online. I emailed human resources recruiters. Was emailed an online interview. Scheduled a phone interview with the assistant manager and head nurse manager for float pool.", "Interview Questions": "Past experience "}, {"date": "14 May 2016", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH) in May 2016", "Interview Descriptions": "first send in CV, and then get contact with employer. then a interview is scheduled. after interview, there is a long time waiting. then salary negociation, after that paper work is going to take at least 2 weeks. then human resource person will interview you again and explain the benefit.", "Interview Questions": "what is your goal."}, {"date": "3 Nov 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH) in Apr 2016", "Interview Descriptions": "Pretty typical interview that focused on past experiences and anything unique about your personal background. Hiring process was straight forward and fast. Be honest about your microsoft office skills and any other if asked", "Interview Questions": "What do you hope to achieve?"}, {"date": "28 Jan 2016", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH)", "Interview Descriptions": "Got a call for the first interview, short and not very difficult or intense questions, pretty basic. Second interview was with the director of the department who explained the project to me as well ask asked a few questions, I asked a lot of questions about the project. Was offered the position by the end of the interview", "Interview Questions": "How would you deal with conflict with someone who worked above you (i.e doctors or nurses in clinic)"}, {"date": "30 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital (Columbus, OH) in Apr 2015", "Interview Descriptions": "A recruiter will contact you and do brief phone screen, Then you meet with the program manager for an interview. if that goes well, you may go to a 3rd round interview with the managers of actual department. Behavioral based interview questions", "Interview Questions": "Behavioral based interview questions"}], [{"date": "20 Feb 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Ohio State University Comprehensive Cancer Center - Arthur G. James Cancer Hospital", "Interview Descriptions": "Interview with IT team asking about previous experience and knowledge of computers. Asked about how I would deal with certain situations such as tough users and delayed projects. Then got a background check and had to go through HR for more questions. Process took about a couple months. Found the job on the university student jobs site.", "Interview Questions": "Do you know how to build a computer?"}]]