[[{"date": "28 Apr 2023", "title": "Digital Communications Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Food Bank For New York City in Mar 2023", "Interview Descriptions": "I applied on Linkedin and their salary range was much higher than what was presented to me via email to schedule an interview. The position was open on that site for more than a few weeks. I also noticed that this position has been open for nearly a year in other sites and the salary ranges 35-30k less than what I applied for. They really need to figure out the true value of this position instead of the bait and switch tactic for applicants..", "Interview Questions": "I didn't want to proceed with the interview because the offer was  less than what I applied for online."}, {"date": "16 Mar 2022", "title": "Finance Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Food Bank For New York City (New York, NY)", "Interview Descriptions": "Avoid Food Bank NY at all costs. \n\n6 months out this place still haunts me.\n\nWildy unprofessional and disrespectful staff. Unorganized and haphazard interview process. Way too many rounds. Bad communication from start to finish. Interviewers were changed out last minute and replaced with unprepared interviewers who were constantly late for scheduled times and unclear what job they were interviewing for.\n\nThey wasted my time with 5+ rounds and then ghosted me entirely.  They can't be bothered to respectfully close the loop with candidates which should tell you exactly how this workplace functions.", "Interview Questions": "How do you describe yourself in 3 words?"}, {"date": "4 Feb 2022", "title": "Grants Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Food Bank For New York City", "Interview Descriptions": "Applied via their Online application, had an initial phone interview with recruiter for a basic overview of my resume and what the position would be. I  then moved onto  video interview with 3 person panel.", "Interview Questions": "What are some improvements I want at my current position"}, {"date": "18 Dec 2021", "title": "Truck Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Food Bank For New York City", "Interview Descriptions": "Very casual, professional environment. Basic questions of work history and experience for specified job. Reasons why you want to work for Food Bank for New York. If you do well first interview, expect more same day", "Interview Questions": "Why do you want to work for Food Bank for New York"}, {"date": "25 May 2021", "title": "GRANT ACCOUNTANT II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Food Bank For New York City in Sept 2019", "Interview Descriptions": "Phase 1-Tele screening . One person called and asked about my basics and existing work experience Then as par my and their convenience an in person interview was scheduled in their office.\n\nPhase 2-in person interview", "Interview Questions": "Excellence in Excel and efficiency level."}, {"date": "3 Apr 2017", "title": "Manager, Corporate Service and Engagement Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Food Bank For New York City (New York, NY) in Mar 2017", "Interview Descriptions": "I did a phone interview to screeen for the position. A week later I went in for two panel interviews- back-to-back. The first panel was with would be colleagues. The second panel was with the supervisor and VP of the department.", "Interview Questions": "what is you life's motto? "}, {"date": "11 Feb 2017", "title": "Tax Preparer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Food Bank For New York City", "Interview Descriptions": "Walk through the resume. Tell me about yourself. Pretty easy questions. Just relax and be yourself. I had only one round interview. Did not prepare a lot. They were very nice.", "Interview Questions": "Do you have any experience with preparing From 1040?"}, {"date": "24 Dec 2016", "title": "VITA Tax Preparer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Food Bank For New York City (New York, NY) in Dec 2016", "Interview Descriptions": "One of the biggest time wasting job interviews by far.\r\n\r\nI applied through Bond Street group in person and was required to take a grueling online test and was finally called for \"training\" 1 month later which consisted of 2 consecutive non paid day of about 8 hours, learning how to use their tax program TAX SLAYER.\r\n\r\nThe head female staff member 1st of all made an effort to let the 50+ of us know that we were late being the last group for training even though they literally emailed us the training days schedule 1 day before the 1st of 3 options available. In my case forcing me to call out sick from work because of such late notice.\r\n\r\nThe classes essentially consisted of filing taxes as we would during the job but the staff members failed spectacularly on actually doing anything to help us besides telling us about the various situations.\r\n\r\nFor starters there were around 4 employees at the site but 80%of the time there was only 1 person aka the instructor to go around answering everyone's questions, which were a lot.\r\n\r\nWhich brings me now to the truth of this so called \"training\" that is really nothing more than a Hunger Games event in disguise as on the 2nd day we were all given what was to be a \"simple\" test that proved to be far from it.\r\n\r\nYou had 3 chances to call the staff to check your answer who would then give you hints to the correct ones, and after that OR 1 1/2 hour later you were done and thus excused PERMANENTLY from the  VITA Tax Preparer position. \r\n\r\nEven though I had done nearly perfectly on the practice tests I struggled to input all the information. Some it being stuff that wasnt even covered in the class, but in the end i failed (and apparently was nowhere near as close as I thought) \r\n\r\nDuring the test the staff once again completely failed, as only 2/4 went around checking answers and besides the instructor barely made any effort to guide us like they said they would. \r\n\r\nTo add insult to injury, to pass the test you had correctly match the state and federal return numbers, which was something in the 7+ examples that was NEVER emphasized as the instructor never bothered to tell us the correct amount for any of them.  \r\n\r\nIn end only around 40% of the class actually passed which given the terrible way we were prepared is no surprise.", "Interview Questions": "no questions"}, {"date": "22 Mar 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Food Bank For New York City (New York, NY) in Feb 2016", "Interview Descriptions": "face-to-face interview with department manager. Friendly working environment and nice staffs. Interview cover all questions which employer expect from an employee. They explain clearly about the requirement for the current position, about the company's mission and their target group of people who are in need. There is a sincere connection to community and doing what's right for those we have the privilege to serve. Staff are smart and committed. Leadership is shared and expected within all levels of the organization. If you appreciate a challenge, are passionate about hunger, you should definitely try this.", "Interview Questions": "Why you apply for this position? What qualification do you think will fit for this position? What is your expectation for this position?"}, {"date": "26 Mar 2016", "title": "Intake Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Food Bank For New York City (New York, NY) in Dec 2015", "Interview Descriptions": "they called me to to go into the office and speak to the hiring manager, than i had to take a test so i could get a certification. the test took no more than an hour .", "Interview Questions": "they asked me how comfortable i felt speaking in spanish to clients . how i feel working with different types of people."}], [{"date": "31 Jul 2015", "title": "Monitoring and Evaluation Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Food Bank For New York City (New York, NY) in Aug 2014", "Interview Descriptions": "A blessing in disguise to discover the bureaucratical inefficiencies instead of taking a position. I was very well qualified for this in my opinion of course. It started with an interview with a recruiter, followed by a panel interview over Skype. I was asked to come to NYC for in person interviews. I was very excited about the position so I decided it was best to pay for the travel expenses to NYC because they refused to pay. I waited in the lobby for close to an hour for my interview. In addition, only 1 employee of the 2 was able to attend. I had to have a follow up phone interview with the missing manager later. I felt very confident that I would be offered a position soon. After weeks of no news I started trying to contact the recruiter that I had been instructed to direct all contact through. Despite multiple emails, calls and messages, he never got back to me. I know you are supposed to be patient etc, which I was. Finally, after it had been a month after my interview and no contact what so ever, I got a hold of the recruiter and he said that due to a new chief marketing officer there was a freeze on new hires. \r\n\r\nOverall my experience with the recruiter was poor. He often forgot my name, what I was applying for, things that a few notes would have covered. In addition, he often forgot and got confused about interview dates and times, eye.", "Interview Questions": "Why do you think you're a good fit for third position?"}, {"date": "11 Sept 2016", "title": "VITA Tax Preparer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Food Bank For New York City (New York, NY) in Dec 2013", "Interview Descriptions": "no formal interview, pass the test as interview, review the materials online before take the test, after you pass the test, contact coordinator and let her know you are interested in the position", "Interview Questions": "no interview"}, {"date": "14 Jul 2013", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Food Bank For New York City (New York, NY)", "Interview Descriptions": "Phone screen, 1 interview with Director, Manager and HR", "Interview Questions": "What do you expect to be the most challenging part of this job for you? "}, {"date": "14 Mar 2013", "title": "Institutional Giving Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Food Bank For New York City", "Interview Descriptions": "Initial phone interview with recruiter (an internal consultant) lasted approx 30 mins. Questions included: 'what's your salary floor','what are 3 things you will do on day one', 'Explain what we do', 'explain what the position entails'.\r\n\r\nSecond round interviews was a 2:1 panel with the my positions direct report and the positions counterpart on the program side. It last roughly an hour and consisted of a walkthrough of my resume, a drilling down on my understanding of the position and how it interacts with the program side. Submitted an application, which was sent to me by the recruiter in anticipation of the interview, and a writing sample.", "Interview Questions": "The most difficult question was the 'floor' question as I included a salary history in my cover letter and I wasn't expecting to have to define my salary floor at the screener stage of the hiring process. "}, {"date": "11 Aug 2015", "title": "Nutrition & Health Education Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Food Bank For New York City (New York, NY) in Jan 2013", "Interview Descriptions": "The interview process was disorganized, repetitive, and very long. I initially had a phone interview with a recruiter, I was offered an in-person interview but I had to follow-up several times to schedule it. When I went in for the in-person interview, they did not know we had an interview scheduled so they pulled random people from the team who were available at the time to ask me questions. I had to come in later for another interview so that the manager and director of the department could interview me.", "Interview Questions": "Basic questions about my experience."}]]