[[{"date": "14 Jul 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mencap (Gateshead, England)", "Interview Descriptions": "two people in a meeting - face to face in an office -offered a job on the the the spot not a very good process -could have had better exercise to do during the interview", "Interview Questions": "How to handle money for the venerable"}, {"date": "20 Jul 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mencap (Bangor, Northern Ireland) in Jul 2023", "Interview Descriptions": "Interview was relaxed, six questions were asked. Some of them were scenario based, and others were based on getting to know your character. Very good experience, the two guys interviewing me were lovely and friendly.", "Interview Questions": "Q: Give an example of a time you worked as part of a team."}, {"date": "23 Feb 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mencap", "Interview Descriptions": "During covid times it was zoom, usual questions easy process to go through, after dbs check is quite quick the process of hiring. The outfit can be casual and also the interview is quite casual too", "Interview Questions": "Why would you want to work in care ?"}, {"date": "5 Mar 2023", "title": "Caseworker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap in Feb 2023", "Interview Descriptions": "One stage interview Asked about engaging employers, safeguarding, progress of service users, not a hard interview. Interview lasted about 45 minutes over teams. Brush up on prevent and safeguarding, asked about working as a team to deliver a piece of work.", "Interview Questions": "Why did you apply for this role Understanding of safeguarding and prevent Examples of relationships you have built external to your organisation"}, {"date": "15 Jan 2023", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mencap", "Interview Descriptions": "Poor . Bad communication . Changed interview location . Interviewer was late . Disinterested in the process. Avoid this company . Many other companies to work for Poor . Bad communication . Changed interview location . Interviewer was late . Disinterested in the process. Avoid this company . Many other companies to work for", "Interview Questions": "Question on previous experience . What you understand about their work practice"}, {"date": "1 Nov 2022", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Mencap (Selby, England)", "Interview Descriptions": "Was put at ease and most questions are specific to the role in hand. Nothing complicated. Just gathering what knowledge you have in relation to the role. Quite methodical and asked for a few examples on how my experience would be beneficial in certain situations.", "Interview Questions": "The process on handling finances."}, {"date": "16 Jan 2023", "title": "Caseworker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mencap (Bradford, Yorkshire and the Humber, England) in Aug 2022", "Interview Descriptions": "Initial conversation with the recruitment team checking suitability. I then had a 45/60min Ms teams interview with 2 members of the team. Following the interview I was contacted via email and the recurtment team letting me know about the role.", "Interview Questions": "How would you manage a group of 5 learners who need different levels of support?"}, {"date": "25 Jul 2022", "title": "Pre -Employment Caseworker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mencap (London, England)", "Interview Descriptions": "It was pleasant, can't complain. I got an email before the interview about things they will ask of me, one being my Maths and English grades (I need to show proof of passing them), and to understand their values as they will ask me about them. \r\n\r\nThey did not ask me about either of these things that were listed in the email.\r\n\r\nI also asked them questions about the role and what day-to-day activities I would be expected to carry out, and other questions relating to their answers. They were not able to answer my questions to the standard that I expected.", "Interview Questions": "2 Situational questions and questions about semi-political things pertaining funding for special schools"}, {"date": "12 Aug 2022", "title": "Learning Disability Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mencap (Hull, England) in Jul 2022", "Interview Descriptions": "Overall this was a positive experience as the interviewers made sure to build rapport and create a friendly atmosphere; asked a range of competency questions; and the interview process required delivering a 3-5 minute presentation.", "Interview Questions": "What's your understanding of our company values? "}, {"date": "18 Jan 2023", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mencap (Herne Bay, England) in Oct 2021", "Interview Descriptions": "Formal interview with a panel of staff and service users asking about 10 questions about safeguarding, health and safety and social care legislation. Then had a look around the service and meet some of the other staff and service users", "Interview Questions": "What interested you in working for EKM?"}], [{"date": "25 Sept 2021", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mencap", "Interview Descriptions": "Invited to the service where  I would work, interviewed by manager and one of the clients I would support. The clients asked more personal questions to see if I am the right fit for them (e.g. my interests, if I like to cook, etc.)", "Interview Questions": "How would you promote independence?"}, {"date": "17 Sept 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mencap", "Interview Descriptions": "It was really fast to the interview and offer stage. \r\nInterview questions fairly simple. Common sense questions really.  \r\nIt did take quite a while for them to process dbs checks and get references.", "Interview Questions": "Safeguarding questions were the main ones "}, {"date": "16 Apr 2023", "title": "Legacy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mencap (London, England) in Sept 2021", "Interview Descriptions": "Decent process including service user panel. Standard length and panel relevant to job. Attended second interview but possibly did not fit team culture. Would suggest do as much research as possible on which team you could be working for.", "Interview Questions": "Why do you want to work here"}, {"date": "25 Jun 2021", "title": "Disability Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mencap (Stockport, England)", "Interview Descriptions": "It was a while ago but held in a hotel cafe next to Stockport train station. No privacy whatsoever and gave a very bad first impression of the company. When offered the job I declined it.", "Interview Questions": "None were unexpected."}, {"date": "9 Feb 2021", "title": "Data Quality Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mencap", "Interview Descriptions": "I have applied this role online and received an interview call from HR. There was just one round of interview for almost an hour.  It all went well and received a call same day with the positive feedback and got an offer.", "Interview Questions": "Tell me about the recent experience around Data Operations?"}, {"date": "10 Jan 2021", "title": "Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap (London, England) in Oct 2020", "Interview Descriptions": "Applied online, was called the day after to offer me an interview for the following week. I interviewed and received a job offer 30 minutes after. \r\nQuite a long interview but interviewers were very friendly.", "Interview Questions": "What is the importance of record keeping? "}, {"date": "27 Aug 2020", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mencap (Grimsby, England) in Aug 2020", "Interview Descriptions": "Contained of two people doing interview. Very friendly and made to feel comfortable although I was so nervous I think I let myself down. I am yet to hear something so still waiting.", "Interview Questions": "What would you bring to the company? \r\n"}, {"date": "23 Jul 2020", "title": "Housing Income Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mencap in Jul 2020", "Interview Descriptions": "Submitted my cv through the online portal. Received a call from recruitment about my application a couple of days after submitting. 2 weeks later I got an email asking me to book my interview for the next week. Received a job offer the day after the interview.", "Interview Questions": "What are my best qualities and how would they be beneficial in the role?"}, {"date": "6 Feb 2022", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mencap (Magherafelt, Northern Ireland) in Mar 2020", "Interview Descriptions": "Unpleasant experience. Had to take part in two panel interviews straight after each other and also complete a timed admin exercise, all for a part-time administration job. Very time consuming and ended up getting extremely negative and discouraging feedback, one point of which was that my internet kept breaking up (it was a Zoom interview or something similar). Not sure how this is productive given I have no control over my internet as it is an issue with my location. Overall negative experience, I ended up getting an administrative job the following week with a different company who obviously didn't find the same micro flaws in my interview as this company did.", "Interview Questions": "Why do you want to work for Mencap?"}, {"date": "14 Dec 2021", "title": "Policy Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mencap (London, England) in Jan 2020", "Interview Descriptions": "Chaotic, really messed me about. Kept rescheduling the date and then ghosted me, and couldn't get hold of the recruiter. When I finally did she was really rude and ghosted again", "Interview Questions": "Basic over the phone information checking plus application form and cover letter"}], [{"date": "9 Nov 2019", "title": "Employability Support Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mencap", "Interview Descriptions": "Friendly, professional staff. Really took time to discuss the role with me. Had a sercice user interview me as well, which waw nice. I could not accept position due to distance, but seemed a great place to work.", "Interview Questions": "How I would deal with challenging behaviour in a class?"}, {"date": "23 Jan 2020", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mencap (Derry, Northern Ireland) in Sept 2019", "Interview Descriptions": "Applied online. Was offered interview within 1 week. Interviewed with panel of 2 people and then was invited back a few days later for an interview with a service user.", "Interview Questions": "If you were working in an environment where one individual required a lot of attention and was very lively and loud, and the other person was sensitive to noise and enjoyed spending time alone. How would you support both individuals? "}, {"date": "31 Dec 2018", "title": "Senior Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mencap (London, England) in Nov 2018", "Interview Descriptions": "First interview was conducted via phone with HR. Second interview was a face to face one, with two panels - one  panel was formed of people with learning disabilities, and the other was of the hiring manager and other staff. I find the panels very well prepared and asked me appropriate questions. The entire process was pleasant. However, there was no further contact after the second interview, which was off-putting. At least have the professional courtesy to say thanks but no thanks!", "Interview Questions": "How would you go about designing the survey? What could be the challenges of this research project? Tell me about a time when you are trusted and relied on by your colleagues."}, {"date": "29 Mar 2019", "title": "Education and Employment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap (London, England) in Oct 2018", "Interview Descriptions": "I had a positive experience, they allowed me to take my time, I did not feel rushed at all.  The team also helped me by asking different quetsions in order for em to give the answers they were looking for.", "Interview Questions": "To give an example of a situation when I had to take decisions by myself. "}, {"date": "28 Aug 2018", "title": "Digital Learning Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mencap (Peterborough, England) in Aug 2018", "Interview Descriptions": "A phone call with the [in-house] recruiter that lasted around 30 minutes, followed by a Skype video call with the hiring manager, followed by a face-to-face interview at the Peterborough office. Excellent contact throughout. The face to face interview consisted of a role-play presentation followed by competency based questions.", "Interview Questions": "There were questions around managing change from a cultural perspective. "}, {"date": "9 Nov 2019", "title": "Monitoring and Evaluation Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mencap (London, England) in Jun 2018", "Interview Descriptions": "The online application (cv and cover letter) fairly standard. There was meant to be a task given to me to prepare, but no one told me about it and when I showed up on the day of the panel interview, they were surprised no one had mentioned anything. The panel interview was a mix of staff and ex-service users.\r\nWhen I wasn´t offered the job, I was provided with zero feedback after having asked several times", "Interview Questions": "How would you feel working with disabled people?"}, {"date": "13 Apr 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mencap", "Interview Descriptions": "fairly simple. I was interviewed by two managers and asked about previous jobs. I had never done support work before. I was contacted a few hours later asking to come into the office again a week later and then was offered the job. The full process took a long time as I had to wait for dbs and references", "Interview Questions": "N/A"}, {"date": "3 Apr 2018", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mencap (Basingstoke, England) in Apr 2018", "Interview Descriptions": "I had to take a math and written test. The math test was really difficult on the last page. The written test/essay was rather easy though. Very nice interview person as well.", "Interview Questions": "Are you okay with £8.50/hr?"}, {"date": "18 Jan 2020", "title": "Health Care Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mencap (Llanelli, Wales) in Jan 2018", "Interview Descriptions": "Standard interview process. 30 minutes in duration with 2 members on a panel. They asked me several questions and I answered as best as possible. The interview process was fairly comfortable to be fair. Job offered and accepted. I have since left after approximately 18 months of service.", "Interview Questions": "What can you bring to the company? "}, {"date": "12 Nov 2018", "title": "PA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mencap (London, England) in Jan 2018", "Interview Descriptions": "Tiny room forgot my name what else should have know then. Had no knowledge on care or specialist care for autism. Had no knowledge on learning disabilities makaton or picture symbols basic knowledge.", "Interview Questions": "Knowledge "}], [{"date": "20 Nov 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mencap (Nottingham, England) in Oct 2017", "Interview Descriptions": "Brief run threw of CV and role and position applied for. Was I happy with personal care and do I work as a team and on my own initiative and if I didn't mind working nights", "Interview Questions": "How to use skills from previous role to role applied for "}, {"date": "27 Jan 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mencap in Sept 2017", "Interview Descriptions": "very simple asking a few competency based questions then asked what days I am available and where I would be coming from or too. More interested in if I had a car that had business insurance than my qualifications", "Interview Questions": "Do you have any previous care experience?\r\nDo you have your own vehicle?\r\nDo you have a full license?\r\nDo you have business insurance?\r\nWhen can you come and do a shadow shift?\r\n"}, {"date": "15 Oct 2018", "title": "Data Exchanges / Central Services Assistant / In House Photographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mencap (Belfast, Northern Ireland) in May 2017", "Interview Descriptions": "Applied online and then was invited to interview. 2 interviews, 1 with line managers, 1 with service user panel. If yo passed the first interview you were invited to interview again with the service useer panel.", "Interview Questions": "vHow do you reflect Mencaps values in your work?"}, {"date": "21 Feb 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap in Jan 2017", "Interview Descriptions": "Applied online then got an email for an interview. Was then interviewed by the manager and assistant manager. Took roughly 40 minutes.  Waited a couple of days and was then told I had the job if I wanted to. All training received on the job so no prior experience neccesairy", "Interview Questions": "Why this job? etc"}, {"date": "9 Dec 2017", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap (Peterborough, England) in Dec 2016", "Interview Descriptions": "I was interviewed by a panel of two people. I was then offered a position by a phone call from my new manager and we agreed to meet for an informal conversation because I had further questions about the rota.", "Interview Questions": "About Mencap values and how I meet them. The values are:\r\nWe are Inclusive. People with a learning disability are at the heart of everything we do.\r\nWe are Trustworthy. When we promise something, we don’t let people down.\r\nWe are Caring. We treat everyone with respect and kindness.\r\nWe are Challenging. When we see things that aren’t fair we will campaign until we see real change.\r\nWe are Positive. We never stop believing in a better future and we celebrate what we are proud of now."}, {"date": "27 Jul 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mencap (Bristol, England)", "Interview Descriptions": "Nice and simple interview, manger and assistant kept me very at ease thought out the whole process. Had a 45 min interview, more based on experience, personality, and checking I am happy too and able to do the job asked.", "Interview Questions": "Define what is meant by abuse to you? And how you'd deal with it if you seen this happening."}, {"date": "18 Jun 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mencap", "Interview Descriptions": "Seemed to vary a lot. Applied to two locations. One did 45 minute skills/experience based interview and then called me back in to meet service users then offered the job. Other did 15 minute interview basically checking I could/would do the job and that was it.", "Interview Questions": "What is an occasion where you've been aware of your own prejudice?"}, {"date": "28 Aug 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mencap (York, England) in May 2016", "Interview Descriptions": "I applied for the job and didn't hear back for many weeks so had assumed I hadn't secured an interview, however I was then contacted with an interview offer. I attended and was interviewed by a panel of two staff, who were both pretty friendly and seemed to want you to do well in the interview. It was a difficult interview for me as I had no prior experience with support work, however I put across how keen I was to get involved in this line of work and how I am a quick learner, and ended up securing a job offer.", "Interview Questions": "Predominantly scenario questions, so read up on the expectations of the support worker role and plan what you would do in these situations. "}, {"date": "3 May 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mencap in Feb 2016", "Interview Descriptions": "easy going very direct made to feel very comfortable. this was done with a panel of 2 interviews who where were brilliant and listened to what i had to say. one of the best interviews i have had . i had a one to one interview first then i had the easiest IQ test ever after that the interview was finished and they seemed impressed.", "Interview Questions": "why choose this career and why now"}, {"date": "26 Jul 2019", "title": "Community Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mencap (Long Eaton, England) in Jan 2016", "Interview Descriptions": "Very easy, I got the feeling they were so desperate for staff that anyone that turned up would get a job offer. It's really sad that this is the state of British social care!", "Interview Questions": "How would you provide personal care to a service user to ensure their dignity is maintained "}], [{"date": "1 May 2017", "title": "Customer Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap (Bourne, England) in Dec 2015", "Interview Descriptions": "Interview with two senior managers. I was had to answer a series of questions relating to the role and based on my experience and prior roles. The interview was very inform and I felt at ease by the managers that conducted the interview. I had the opportunity to ask questions too which was good.", "Interview Questions": "Personal experience of working with adults with a learning disability"}, {"date": "11 Jan 2016", "title": "Relief Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mencap (Southport, England) in Jun 2015", "Interview Descriptions": "Very good, the interview was very in depth, and involved one of the people I now support in the interview, which I found really helpful, as it allowed me to get an insight into the job role through meeting somebody that I now know to be a very strong character in the service,", "Interview Questions": "If somebody you were supporting wanted to make a trip to the town centre unaccompanied, how would you support them to do this?"}, {"date": "8 Apr 2015", "title": "Business Support Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mencap", "Interview Descriptions": "Simple to follow interview process that consisted of the following: Telephone pre screen , Personality Profile, Presentation, Panel Interview X 3, Qualifying questions - undertook Learning Disabilities panel interview as one of the standard processes which is excellent as it places the people that are supported central to employing decisions. Over all , enjoyable process which made me feel as if I had been rewarded with the job offered.", "Interview Questions": "N/A"}, {"date": "10 Apr 2017", "title": "Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Mencap (London, England) in Apr 2015", "Interview Descriptions": "Thorough, panel of interviewers, focussed questions shared amongst all interviewing.  TYpical in that examples were sought to a range of scenarios.  Other than that cannot remember much as it was a few years ago.", "Interview Questions": "N/A"}, {"date": "30 Jan 2018", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mencap (Ipswich, England) in Jan 2015", "Interview Descriptions": "I was sent off into a room and asked to fill out these scenario questions that I didn't have a clue about as I'd never done support work before. Two women then came in and asked me a load of questions.", "Interview Questions": "What does person centered mean to you?"}, {"date": "21 Aug 2019", "title": "Housing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mencap (Manchester, England) in Jan 2015", "Interview Descriptions": "formal interview, tenant panel and testing, was at head office, with multiple staff as part of the recruitment process. average difficulty / duration. tenant panel was very interesting and enjoyable", "Interview Questions": "why do you want to work for Mencap?"}, {"date": "14 Apr 2015", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mencap (Belfast, Northern Ireland) in Jun 2014", "Interview Descriptions": "I was given a days notice for the post as it was an internal troll, and it was very clear I was not a serious candidate as the senior manager was more concerned with her subsequent meeting than interviewing me.", "Interview Questions": "Experience reporting"}, {"date": "7 Apr 2015", "title": "Human Resources Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap (Peterborough, England) in Jun 2014", "Interview Descriptions": "Initial phone screen with Manager. Then 1st interview with 2 Manager's. 2nd Stage Interview was a presentation and panel interview with a Senior Manager, Manager and HR. Very thorough and slick interview process. On-boarding was also quick and seamless.  Contract was sent via email and via post.", "Interview Questions": "What I knew about Mencap as an organisation?  Why I wished to work for Mencap.?"}, {"date": "15 Dec 2013", "title": "Relief Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Mencap (London, England) in Apr 2013", "Interview Descriptions": "Took almost 4 months, bad thing is that you get paid only at the end of the next month. So you have to work 2 months before you get the money.", "Interview Questions": "Nothing unexpected"}, {"date": "30 May 2015", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mencap (Liverpool, England) in Jun 2012", "Interview Descriptions": "Excellent. It was very genuine. I was interview by a small panel. They made me comfortable and took time to ensure that I really understood what the question was about. I was nervous as this meant a great deal to me. The informal style helped.", "Interview Questions": "Basically about values and how I would approach tasks and the role"}]]