[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great culture!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Aug 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The wonderful people working here. Exciting work with interesting clients.", "cons": "A heavy workload in consultancy"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "-", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2023", "job_title": "Project Manager in London, England", "duration": "N/A", "pros": "Great colleagues and supportive environment", "cons": "Pay and progression, transparency, organisation"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Left to get on with it.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Mar 2022", "job_title": "Employment Advisor in Hackney, England", "duration": "N/A", "pros": "Great staff who want to help each other.\r\nFlexible working", "cons": "No way to progress within the organisation.\r\nNot enough support from Managers"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good inital opportunity", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Aug 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "wide expose to different sectors", "cons": "not enough staff in each team"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Not The Best", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "10 Jul 2021", "job_title": "Office Administrator in London, England", "duration": "N/A", "pros": "Some of the employees and the distance to work.", "cons": "Not the best employer for me."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Dead End", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Aug 2019", "job_title": "Multiple Roles in London, England", "duration": "N/A", "pros": "Low pressure as targets are meaningless, with no one hitting their target across the board. \r\n\r\nIf you are a manager you will have no target, or at least your targets will not be advertised across the board like everyone else. \r\n\r\nThere are some talented people who work for the organization, however, these people are not found within Senior Management.", "cons": "Your job title/role can be changed at the drop of a hat with no prior discussions (my job role could change weekly).\r\n\r\nManagers do not take employee reviews seriously. Employee appraisals are often conducted 3 months late and are rushed through to keep hr happy.\r\n\r\nOperations are a joke, with no structure or plans in place to enable staff to hit targets. \r\n\r\nSenior Management often has no real idea of what happens on a day to day basis. \r\n\r\nThere is a lot of infighting between different groups with Management rarely offering any solutions to existing problems.\r\n\r\nDaily meetings can be hostile and achieve nothing. There are morning and afternoon meetings every day, Managers use these meetings to try and pressure staff to hit their target without providing any solutions or ideas on how staff can do this. I can not stress enough how pointless these meetings are. \r\n\r\nStats/KPI's are recorded on paper..., which goes against the companies sustainability policy as this is just a complete waste of paper/resources. \r\n\r\nNo training is provided for staff. Induction lasts a day and is just a form-filling exercise. \r\n\r\nSome office spaces are not fit for work, I was lucky as I could work offsite/in other offices. \r\n\r\nWork equipment is very poor."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst graduate experience! Terrible management. This is not a working environment for those who have additional needs", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Feb 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "-The interview process left a positive impression on me as the two senior consultants who interviewed me were welcoming and warm, putting a case for why Renaisi would be a great place to work.  I didn't realise this would not be the case when working there.\r\n\r\n- Majority of employees are kind and enjoyable to work with, yet the working culture can make the environment feel cold due to demands and departmental separation.", "cons": "In a social enterprise like Renaisi that aims to help people to thrive, you would expect that it would support its employees.   I was provided a line manager, a senior project manager who was new to his role a few weeks after I joined. I did not receive a proper induction from HR or any support for my learning difficulty of dyslexia, all of which I had raised on my application form and interview process. My line-manager blamed HR for this yet he himself did not take the initiative to peruse this support  until I pushed this.  Given that I was new to the world of work, I did not know what support I could receive and therefore, as I have always done, did my best to not let these challenges affect my work. Although at first I felt welcomed into the team, over time, the working culture in the head office felt corporate, individualistic and departmental, heavily reliant on how well you knew senior staff.\r\n\r\nI gave my very best to my work and inspite of the work itself being monotonous and repetitive, I believed it was a crucial step for me to learn how to understand the programme I was working for. I put in extra time, working when I was on sick leave and until 8pm at night for several months due to the high work load and lack of staff on the programme. I was subject to horrendous micromanagement, cold behaviour and I constantly felt undermined by both a Senior project manager (my line manager) and another staff member who evidently wanted to prove they could manage and assert their authority.  Although the line manager I had took me out for one-to-ones, it was mainly him doing the talking and all about how to \"impress\". I never felt he genuinely cared about my progress or interests.\r\n\r\nI was put on a probation plan 6 months later for reasons I strongly feel I didn’t deserve and of which reflected my learning difficulty.  For someone who has always been praised for their work ethic and positive attitude, this came to me as a shock. I was subject to appalling emails and condescending comments from my manager. I would be penalised for the smallest errors, even when it was my first time doing a task such as producing reports based on financial data. I had actively seeked support from other colleagues and him to make sure I was doing it right.  Although we had frequent meetings about my 'progress', they often lacked purpose and where I could have spent that time giving my best to my job. I never once felt he or aNetwork Manager I was working for sincerely cared about my wellbeing or progress. My probation plan was dropped 2 weeks after they had realised they had failed in providing essential support that I needed and I had complained about their management style. After this, they started the process of providing me with some support and I did see a change in their management style. I'm disappointed that it took all this time for them to provide me with this support. Had I not complained or disputed it, they would have continued with their passive-aggressive bullying behaviour.  In addition to this, I don't feel I was given the same opportunities as other Project Officers had received. \r\n\r\nMy manager's manager had sympathised with me and apologised for the behaviour I had endured, yet he approached me with ‘what are we going to do with you’. This was evident to me of how much this organisation lacked in sensitivity towards employees with additional needs. I stuck this behaviour out for a year and I was encouraged to leave this job several times by doctors, mentors and another manager and colleague at Renaisi who empathised with my experience. Giving my notice and leaving this job was the best thing I did for myself and my health.  \r\n\r\nThe only time I really felt listened was when a new HR manager joined the team before I left. I am hoping the working culture and sensitivity awareness for people that have additional needs has improved.  It was an exhausting and emotional experience where I didn't feel I was growing professionally or personally.   As this was my first graduate job, I am disappointed with how I was treated. Since leaving Renaisi, I have been able to enjoy working and have experienced what it is like to have a supportive and caring manager and be a part of a team where I feel like an equal."}], []]