[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Team Atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jun 2019", "job_title": "Anonymous Employee in Brisbane", "duration": "N/A", "pros": "-Working for an organisation where all are passionate about helping children with disorders succeed.\r\n-Being part of a very diverse workforce\r\n-regular meeting across disciplines and levels where all get a chance to be heard and give input, feels like you have a real chance to have a significant positive effect on many students through your work.  \r\n-working for an organisation that does relevant research in the area and often invloves employees in both research and sharing outcomes.", "cons": "-for an organisation this unique, they have not done them self any favours basing by basing their school and corporate offices in the outer western suburbs. \r\n-Traffic a bit of an issue in the morning, lack of parking."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor staff retention for good reasons", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jul 2021", "job_title": "Psychologist in Brisbane", "duration": "N/A", "pros": "Rewarding mission\r\nKnowledgeable allied health professionals\r\nGreat colleagues and solidarity across the organisation", "cons": "In my opinion, the leadership at SALDA take advantage of the caring nature of their staff and don't provide adequate resources and support. The majority of staff are people who have chosen to work in caring professions. They are given increasing amounts of work without support of resources, guidance, or supervision. This could be because current Leadership has never worked in and appears to have no understanding of clinical practice in Allied Health. At some point, often quickly, staff are overworked and burnt out. Combine this with a lack of appropriate financial compensation and they leave within a year or so."}]]