[[{"date": "8 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Freedom from Torture (London, England) in Mar 2023", "Interview Descriptions": "During the interview, I had to give one oral presentation (5 mins ) and answer competency-based questions for 45 minutes. The questions were related to the skills mentioned in the job description. However, I found it disappointing that the interview panel members were changed without prior notice.", "Interview Questions": "The presentation task was to provide a plan for mobilizing a network of activist volunteers, such as Survivors Speak OUT, to oppose the Illegal Migration Bill. The presentation had a time limit of only 5 minutes. It required the consideration of opportunities and threats, potential tactics, internal and external partnerships, and potential difficulties and how to overcome them. During the interview, as the role was for a manager position of a survivor-led activism group, I was asked questions about my experience in such groups. The questions focused on such issues as the main difficulties faced by asylum seekers in the UK currently, examples of managing volunteers and handling disagreements within a group."}, {"date": "14 Sept 2022", "title": "Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Freedom from Torture", "Interview Descriptions": "It was well organised with an assessment but the interviewers would not have a poker face and kept making faces when I did not answer something right which discouraged me from going through the rest of the interview. When I asked an interviewer to repeat a question, she just yelled it back to me.", "Interview Questions": "How would you like to be managed?"}, {"date": "4 Apr 2022", "title": "Volunteer Legal Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Freedom from Torture", "Interview Descriptions": "A very easy and smooth interview. I had a standard interview/question section by the Line Manager who I was to have a close working relationship with and with the Department Manager followed by a light friendly chat.", "Interview Questions": "How to you deal with diversity?"}, {"date": "13 Nov 2019", "title": "Human Resources Generalist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Freedom from Torture (Islington, England) in Nov 2019", "Interview Descriptions": "The recruitment was very quick and straightforward. I was selected for an interview and was told on the day I was successful. The DBS process and references were started within the next few days.", "Interview Questions": "Mainly went through my CV and general competency questions asked along the way"}, {"date": "10 Oct 2019", "title": "Research Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Freedom from Torture (London, England)", "Interview Descriptions": "There was a 30-minute writing task and then a traditional panel style interview. The panel interviewers were very nice and made me feel comfortable.  An amazing organization doing essential work.", "Interview Questions": "What kind of research methodologies are you aware of?"}], [{"date": "8 May 2023", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Freedom from Torture (London, England) in May 2019", "Interview Descriptions": "1. Test - consists of scenario based questions. This is a common sense test which lasts between 30-40 minutes. 2. Interview - 3 members of staff who ask quite generic questions. They are keen for clear examples.", "Interview Questions": "1. Can you give an example of when you changed a system/implemented a system 2. Example of when you took initiative 3. Example of when you had to deal with a difficult situation"}, {"date": "2 Jun 2019", "title": "HR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Freedom from Torture (London, England) in Jan 2018", "Interview Descriptions": "Good and professional. They got back to me that day to say I was successful and the on-boarding process was good. All paperwork was dealt with before starting. It was an overall good experience.", "Interview Questions": "Experience"}, {"date": "3 May 2017", "title": "Legal Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Freedom from Torture", "Interview Descriptions": "The interview was a pleasant process, the interviewers friendly. They had a list of questions and wrote down my answers. Interview lasted half an hour in total and only comprised of all the usual questions e.g. why do you want to work here? Can you give a specific example of your use of administrative and research skills?", "Interview Questions": "Why is diversity important?"}, {"date": "20 Mar 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Freedom from Torture", "Interview Descriptions": "One interview with my direct supervisor and another member of the team. They were really nice and friendly and the interview was conducted in a relaxed manner - a few standard situational questions.\r\nIt will really help to research the organisation and get an idea of their latest achievements, events and projects", "Interview Questions": "What kind of sensitive information to you think a charity database holds?"}]]