[[{"date": "9 Mar 2022", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Meriter Health Services", "Interview Descriptions": "1 hour phone interview\r\n8.75 hour in person interview - approximately 15 separate interviews spread out over the day.  Some with a panel of several people\r\nAfter the interview process was complete, a simple automated email was sent.  There was no personal phone call despite spending the day with several members of the team.  No follow up from the thank you emails I sent or any feedback on the lengthy in person interview.", "Interview Questions": "The interview was for leadership.  Some behavior, some general discussion."}, {"date": "15 Oct 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meriter Health Services (Madison, WI) in Oct 2019", "Interview Descriptions": "HR called me after 1 1/2 to schedule phone interview with recruiter and in person interview with clinical administrator plus two other people. Phone interview took 30 mins. They asked mostly behavior interview questions. Second interview was just okay!  I felt uncomfortable with their questions. They asked around 10 -12 questions. It felt like they think I am dumb. I have a lot of experience in clerical/medical field plus I have education yet they were offering $15 because they assumed I am dumb Asian.  They did not even said that we will call or something before I left. I would not apply at Unity health again. They will make you feel very uncomfortable and yes I noticed that they will not hire you unless you are White. The office was full of white people only.", "Interview Questions": "Foster unity\r\nOwn The Moment\r\nChampion Excellence\r\nSeize Opportunities \r\nbehavior interview questions based on your experience."}, {"date": "16 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Meriter Health Services (Madison, WI)", "Interview Descriptions": "Initial phone screening with HR, followed by an in-person interview with the floor manager. Upon first walking through the front door, they ask you to sit in the round \"interview couch\" until someone comes by and picks you up. You sort of feel like a spectacle with all the staff walking by, knowing that you will be a possible workmate. Following the interview, there was then a shadowing experience with the floor staff, and finally an offer via phone call. \r\nAfter the offer was accepted, a drug screen needed to be performed within 4 days. Then, a very intense health screening would take place.  Altogether, the staff was very nice throughout the whole process.", "Interview Questions": "What is the most exciting or interesting thing you have done lately?"}, {"date": "15 Apr 2020", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meriter Health Services (Madison, WI) in Dec 2018", "Interview Descriptions": "1. Email to schedule phone interview with HR\r\n2. HR phone interview. Schedule in-person interview.\r\n3. Interview with Respiratory Care Manager and Supervisor\r\n4. Phone call from HR. Email with all info about job.", "Interview Questions": "HR Interview:\r\n- What do you know about our hospital?\r\n- Go over the values and give examples in your practice that illustrates these values.\r\n- Schedule interview with manager and supervisor.\r\n\r\nManager and Supervisor Interview:\r\n- Go over your resumé with us and tell us who you are.\r\n- What are your strengths and weaknesses?\r\n- Which area/speciality do you want to work in? Where do you want to learn more?\r\n- Which equipment have you used and are you familiar with?\r\n- How would your coworkers describe you?\r\n\r\nHR call:\r\n- Offered position, went over benefits and all info about job.\r\n- Emailed me all the info and time to accept/reject offer.\r\n"}, {"date": "11 Mar 2018", "title": "OTR Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Meriter Health Services (Madison, WI) in Jan 2018", "Interview Descriptions": "Phone interview and initial interview was speedy.  I was asked back for a 2nd interview and had the most off putting experience.  Unit manager had some serious issues (something going bad in her day or upset with someone else... I couldn't figure it out) but she came off as  snappy and rude.  I felt belittled in this experience and sad for the unit, because the other staff seemed amazing and it would have been a rewarding population to work with, but her approach was extremely off putting and reflected poorly on facility.  I want to work for a place that is invested in me, as much as I am invested in them.  In addition, if you have conflict going on, don't let candidates see that!", "Interview Questions": "STAR questions regarding  core values and mission statement "}, {"date": "8 Sept 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meriter Health Services (Madison, WI) in Jun 2016", "Interview Descriptions": "The process started with a phone interview with a recruiter, then I advanced to an in-person interview with 5 people asking questions. Once I accepted the position, I went through all of the health screenings required for healthcare employees. I started a month after I accepted their offer.", "Interview Questions": "What interests you about this position? What interests you about Meriter? "}, {"date": "15 Nov 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meriter Health Services", "Interview Descriptions": "Application process: I submitted my application through Meriter’s career website. A couple of weeks later, I was contacted through phone by Human Resources to set up an onsite interview. I scheduled an appointment and afterwards was given an email confirmation, the location and the names of the interviewers.\r\n\r\nInterview: I was greeted by one of the interviewer who came down to get me and went up the elevator to meet up with two other interviewers in a conference room.  Each interviewer had typed up questions where each took a turn asking me a question on the paper and wrote down my response down. I felt the interview was super short nor did I feel as if I connected with them because they all were focused on writing down my answers.", "Interview Questions": "What interests you about this position? Are you comfortable working in a fast paced, dynamic, and complex organization? "}, {"date": "10 Nov 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meriter Health Services (Madison, WI) in Nov 2015", "Interview Descriptions": "I applied online and received a call about 7 days later.  I interviewed with 2 friendly employees in the Marketing Department. They asked about 15 questions. Some were easier to attach stories to and prepare for than others but all were fair and for the most part easy.  The interview was not threatening and I could tell both interviewers really enjoyed working at Meriter Business Center.  The entire process lasted less than 20 minutes.", "Interview Questions": "What past experiences do you have in marketing?"}, {"date": "27 Aug 2015", "title": "Business Intelligence Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Meriter Health Services (Madison, WI) in Feb 2015", "Interview Descriptions": "First interview was over the phone with four of the team members.  The second interview was face to face and on site at the business office with two team members.  Both interviews occurred with two to three weeks of each other.", "Interview Questions": "How do you work in a team setting?"}, {"date": "17 Nov 2014", "title": "Health Information Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Meriter Health Services", "Interview Descriptions": "My interview was in the facility off Rimrock, which is nice and new.  I went up to the receptionist's stand and the woman literally ignored me for about 5 minutes while she talked to someone else (as in didn't even look at me or acknowledge my presence), which was a kind of bizarre experience as I was standing about 5 feet in front of her.  I finally kind of interrupted he and she was friendly enough but still didn't let my interviewer know I was waiting for another 5-10 minutes...at least I got there early enough to account for the random 15 minutes of time I was actually there that they didn't know about.", "Interview Questions": "There were two full pages of \"what are your strengths and weaknesses\" type canned questions in which the interviewer drilled through consecutively and took notes on.  The questions skewed heavily toward the negative side (ie discussing past problems or mistakes and how you overcome challenges).  It was a really tedious interview and the girl conducting the interview did not seem at all invested in it.  I almost groaned out loud when she flipped the page over and tried to find a point to duck out, but ended up just shrugging through the rest with the same relative disinterest she had.  "}], [{"date": "8 Oct 2014", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meriter Health Services", "Interview Descriptions": "One interview that was very easy over the phone. It is a union job so there are a lot of things you have to get through before you can be hired.  The work is very easy and get paid very well.", "Interview Questions": "Easy"}, {"date": "25 May 2015", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Meriter Health Services (Madison, WI) in Jun 2014", "Interview Descriptions": "It was brief and easy. Supervisor will look over your resume and if they think you are right fit you will get a call back. The main things that they worry over are background checks, which the human resource will do and immunization because it is a hospital with patients. The office manager is very pleasant and will speak with you briefly about the position in person. It was an overall pleasant process.", "Interview Questions": "Mostly about your availability"}, {"date": "19 Jul 2013", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meriter Health Services (Madison, WI)", "Interview Descriptions": "It was a simple and non-threatening/nerve-wracking experience. HR contacted me and let me know they were interested. I was to contact one of the personal in Marketing. I did so and we set up an interview. I interviewed with two people who each asked questions. They were very welcoming and answered all of my questions. They got back to me within a week (or less).", "Interview Questions": "It was pretty straight forward. Experience you've had with social media, marketing, etc. etc. Nothing off the charts."}, {"date": "11 Apr 2010", "title": "Reception Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Meriter Health Services (Madison, WI) in Feb 2010", "Interview Descriptions": "short interview. Though i though the interview was good and was told I would receive information for a followup interview by the end of the week. I did not hear anything for over 2 weeks and that was a rejection letter in the mail.", "Interview Questions": "Tell me how react to a difficult person?"}, {"date": "13 Dec 2013", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Meriter Health Services (Madison, WI) in Jun 2009", "Interview Descriptions": "No issues", "Interview Questions": "N/A"}]]