[[{"date": "26 Sept 2022", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centerstone", "Interview Descriptions": "The interview team was wonderful. HR is a very big challenge to communicate with- no responses and not helpful nor do they explain issues well. I’d consider looking for employment elsewhere if you can.", "Interview Questions": "N/A"}, {"date": "1 Jun 2022", "title": "CCBHC Care Coordination Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Centerstone in Mar 2022", "Interview Descriptions": "Simple, no trick questions. Not very up-front about job description or pay. They are desperate for people since there is such high turnover. HR literally hides from people so nothing ever seems to change. I would not suggest working here, you are better off going to Sarasota.", "Interview Questions": "What is the least amount of money you can accept?"}, {"date": "24 Dec 2021", "title": "Recovery Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centerstone", "Interview Descriptions": "It was very easy to talk to the interviewer and it was made up of the standard interview questions, with some behavioral questions as well. The interview was about 30 minutes.", "Interview Questions": "Why are you interested in working here? "}, {"date": "3 Dec 2021", "title": "Family Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centerstone", "Interview Descriptions": "Multiple people.  lots of opportunity to speak learn and ask questions. You are given opportunity to expand on your strengths as well as areas of improvement. Often team members of various ranks are included in interview", "Interview Questions": "Tell me something exciting you've done?"}, {"date": "10 Sept 2021", "title": "Bachelor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Centerstone", "Interview Descriptions": "you turned in your resume, and then wait for interview, the interview was not very formal but they explained a lot beforehand about the intern position and what you would learn from it", "Interview Questions": "if you have a conflict with your teammate, what would your solution"}, {"date": "3 Apr 2023", "title": "Residential Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centerstone (Herrin, IL) in Sept 2021", "Interview Descriptions": "It was simple and smooth. Great explanation of the job process, and pay. Loads of paper work is the downside. Best to go company and not temp. Questions about driving record.", "Interview Questions": "Experience questions, questions about driving record."}, {"date": "10 Oct 2021", "title": "HR Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone (Nashville, TN) in Aug 2021", "Interview Descriptions": "Sadly, the process went poorly even though my 2 interviews went well.  I never heard back, even after following up with the person I interviewed with, never got a rejection or an update,  they just ghosted me.  Rather strange for such a large company", "Interview Questions": "Very generic interview questions.   Tell me about a time...seemed scripted and cold."}, {"date": "30 Jul 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centerstone", "Interview Descriptions": "Interview process was through Zoom which was very accommodating. Felt relaxed, like I was having a conversation instead of being interrogated. Be prepared to give reasons why you would be a great fit for the position you are applying for and just be yourself. Enjoyed the entire experience.", "Interview Questions": "Tell me about yourself and why you would be a good fit for this position."}, {"date": "24 Jun 2020", "title": "School Based Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone (Nashville, TN) in Apr 2020", "Interview Descriptions": "The interview was over zoom with two team leads from the company. I had a positive experience and enjoyed speaking with them. Some of my questions they did not seem able to answer.", "Interview Questions": "What strengths/weaknesses would I bring to the position?"}, {"date": "21 Sept 2021", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centerstone (Bradenton, FL) in Jan 2020", "Interview Descriptions": "Lengthy. Communication with supervisors can be a struggle at times. Seems as they refer to recruiter most of the time. Seems they are not sure what they are doing or what to do next.", "Interview Questions": "Why do you feel you would be a good candidate for this position. "}], [{"date": "24 Nov 2018", "title": "Grant Writer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centerstone", "Interview Descriptions": "There were 2 people who interviewed me. I walked through my experience, they answered questions about the job position, I described my previous knowledge about the organization, and they asked my about my experience with various software. Following the interview, there was a grammar, writing, and math test.", "Interview Questions": "walk through resume, why interested in position, rate self in experience with Microsoft and Adobe products"}, {"date": "25 Oct 2021", "title": "Prevention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centerstone in Sept 2018", "Interview Descriptions": "Got contacted after about a month of applying. Interviewed a week or so later at the closest clinic to my location. Interview was very easy-going.  Several scenario/behavioral based questions. After a few days, I got a response.", "Interview Questions": "What is you leadership style?"}, {"date": "23 Dec 2018", "title": "Youth Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centerstone (Louisville, KY) in Sept 2018", "Interview Descriptions": "Thirty minute interview asking a lot of questions about how you would handle stressful situations (escalated children, etc) and about your personal philosophy guiding your working with youth. Some questions about how you would work on a team.", "Interview Questions": "Is there a difference between punishment and discipline?"}, {"date": "1 Aug 2018", "title": "School Based Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centerstone (Indianapolis, IN) in Jul 2018", "Interview Descriptions": "I submitted an application online, was emailed two days later, and had my interview a few days after that. Interviewer was very laid back, it felt like a normal conversation. I was told I would hear back in a week, and they stuck to that timeline.", "Interview Questions": "Why do you want to work with this population?"}, {"date": "28 Aug 2018", "title": "Addictions Nurse Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Centerstone (Louisville, KY) in Jul 2018", "Interview Descriptions": "I received a phone call within days of applying, & then met with a charge nurse on-site for a tour & brief, informal interview. I received an email offer within a day or two, including a background check, drug screen, & an online app that allowed me to send out letters requesting a reference survey from 3 professional references. Most everything was completed online & the interview itself lasted less than 30 minutes.", "Interview Questions": "Why are you interested in working with clients in addiction recovery/detox?"}, {"date": "20 Jan 2019", "title": "Life Skills Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centerstone (Alton, IL) in Apr 2018", "Interview Descriptions": "It starts with a phone interview, if you move to the next step then an email correspondence is sent requiring you to provide five professional references to anonymously, fill out  online questionnaires about you before they would move to the next step which is an  in person interview including the supervisor and her supervisor", "Interview Questions": "What are your goals for yourself in the next 5 years?"}, {"date": "19 Oct 2020", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Centerstone (Louisville, KY) in Feb 2018", "Interview Descriptions": "It went well. The interview process was normal. I thought the interview process was fine and all questions needed to be addressed were addressed. All in all, it was a great interview with Centerstone", "Interview Questions": "What are your biggest weaknesses."}, {"date": "14 Sept 2020", "title": "Recovery Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centerstone (Carbondale, IL) in Jan 2018", "Interview Descriptions": "The interview was not very long and didn't ask difficult questions while being asked by 3 different hiring managers. The process went smoothly and it is a lot better than today when interviews are only conducted only for almost every organization.", "Interview Questions": "They asked your interest and work experiences. "}], [{"date": "28 Aug 2017", "title": "TLP Advsior Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centerstone (Carbondale, IL)", "Interview Descriptions": "Laid back; they will ask you are you willing to pick up after clients (be a maid service), if you have a clean driving record (can act as a taxi service), if you have good communication skills (so they can know who to get over on), and so forth. Just smile, nod your head, and collect your money so you can get on with your own life as they try to figure out their own.", "Interview Questions": "If a client runs away and is gone for a period of time and you see that their apartment is dirty, what could you do?"}, {"date": "9 Sept 2019", "title": "Psychosocial Rehabilitation Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centerstone (Nashville, TN) in Aug 2017", "Interview Descriptions": "The interviewing process is relatively easy, one or two interviews prior to hiring.  However, the hiring process after accepting the job is lengthy.  Be prepared for it to take 4 to 6 weeks for a start date.", "Interview Questions": "The interviewer asked why I thought I would be an asset to the company, and what challenges would I have in order to work there."}, {"date": "1 Oct 2017", "title": "Crisis Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Centerstone (Louisville, KY) in Jul 2017", "Interview Descriptions": "Since I interned at the job that I'm at now, the interview process was short, sweet, and to the point. I didn't even truly look on the Centerstone website because I was asked to stay on.", "Interview Questions": "Have you had any experience in this field of work? "}, {"date": "17 Aug 2017", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centerstone in Jun 2017", "Interview Descriptions": "Amazing. Conversational. Easy Going. Although, long. The woman was very nice, the one who interviewed me. But, I was very nervous and that may have effected my overall experience.", "Interview Questions": "What are some strengths that you would bring to this job?"}, {"date": "2 Jul 2017", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Centerstone (Louisville, KY) in Mar 2017", "Interview Descriptions": "I submitted a resume through their website.  A talent acquisituon manager called and conducted a brief interview. Next, i interviewed with the unit manager. Lastly, i had a group interview with the unit manager and team members from the team i joined.", "Interview Questions": "They asked how I would respond to specific situations that occur when working with the target population."}, {"date": "30 Mar 2017", "title": "Support Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centerstone (Springfield, TN) in Mar 2017", "Interview Descriptions": "Questions were aimed mostly at assessing my personality. They asked me what I liked to do in my time off and what my hobbies were. They also asked me to describe myself in a few words and what, if anything, I would change about my personality. I asked if there was room for advancement in this position and the answer was no. But I was told it would be good experience for other positions with Centerstone.", "Interview Questions": "What would your ideal day off entail?"}, {"date": "27 Nov 2016", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centerstone", "Interview Descriptions": "Easy, confusing, and disorganized.  Interview, offer, accepted, paperwork, orientation.  Pretty quick.  Background check seemed quick.  \r\nThey promise stuff in the interview, like a bonus but then no one meets the bonus standards because they are outrageously high.", "Interview Questions": "Standard questions"}, {"date": "31 Oct 2016", "title": "Theapit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Centerstone (New York, NY)", "Interview Descriptions": "I was interviewed by a regional director and a supervisor. The interview was very causal and friendly. They asked me a few questions than allowed me to ask a few and then showed me where my office would be.", "Interview Questions": "Do you think you can handle a fast paced work environment with a high productivity expectation?"}], [{"date": "19 Oct 2016", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone (Alton, IL) in Sept 2016", "Interview Descriptions": "They always have 2 supervisors interview together for any position. They both asked questions and interacted with me equally.  Both interviewers were friendly, made sure I understood everything and encouraged me to ask questions.", "Interview Questions": "Asked several questions about what would you do during a crisis situation."}, {"date": "19 Aug 2016", "title": "School-based Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone", "Interview Descriptions": "I went to the first interview and was asked to go to the second interview after about a week. I was told the same day that the job would be mine after I passed the background check and references. Both interviews were laid-back and friendly. I wasn't asked many questions. It's taking a couple of weeks to start in the job due to paperwork. However, they are keeping communication lines open.", "Interview Questions": "What is your main therapeutic theory used?"}, {"date": "1 Apr 2020", "title": "Talent Acquisition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone (Nashville, TN) in Jul 2016", "Interview Descriptions": "The interview process was awesome, laid back and didn't feel like I was interrogated. was walked around and introduced to the team. everyone was friendly. Was interviewed by two managers and one susupervisor", "Interview Questions": "How knowledgable was I about the company?"}, {"date": "24 Jun 2016", "title": "Youth Teacher/Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centerstone in Jun 2016", "Interview Descriptions": "I was called in the day before for an interview. I went in the next day, and to me everything went well. I can say that I was probably overqualified for the position, but I still wanted the position. The interviewer was nice and made me feel at ease. She explained clearly the specifics of the job, and also the mission of the organization. I was told that I would know by the end of the day since they needed someone immediately. I was called later that day and told I wasn't a good fit for the position.", "Interview Questions": "Why did I apply for this position? "}, {"date": "5 Aug 2016", "title": "CSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centerstone (Louisville, KY) in May 2016", "Interview Descriptions": "It was an experience that before receiving the position it had given me the opportunity to get a close look at my now supervisor  and overview of the job description.  This is important because in this job we work closely with our supervisors.", "Interview Questions": "Your job experience, how you interact with others"}, {"date": "14 Apr 2016", "title": "RAII Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centerstone", "Interview Descriptions": "Lasted approximately 1 hour, basic questions about the job itself, and also question on how you handle situations and working with a variety of people and groups.\r\nThere were several people interviewing me, in a round table type environment, which I did not originally expect.", "Interview Questions": "What is your experience working with people that have mental health or substance abuse problems?"}, {"date": "5 Aug 2017", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centerstone (Batesville, IN) in Mar 2016", "Interview Descriptions": "Met with hiring manager who was very friendly. They then asked me about myself and experience. They then gave me several vignette questions which consisted of different social services scenarios.", "Interview Questions": "To tell me a little about my experience "}, {"date": "19 Oct 2015", "title": "Office Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone", "Interview Descriptions": "Basic interview questions.  Interview took less than 30 minutes. More time was spent talking about what environment the job was going to be in; clients served, high stress situations, etc. The position  was offered to someone local but they said they would retain my application for possible openings in my city.", "Interview Questions": "How did you overcome difficulty with a customer?"}, {"date": "13 Jan 2017", "title": "ROI Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Centerstone (Nashville, TN) in Sept 2015", "Interview Descriptions": "The interview was like any other interview. I talked to the Office manager one on one and was ask basic questions. I think the whole process took less then 30 minutes. I was the only one the staffing company had sent over so after the interview I was told I could have the job and I took it.", "Interview Questions": "Just your basic questions."}], [{"date": "18 Jul 2015", "title": "Public Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone (Bradenton, FL)", "Interview Descriptions": "I have many years of experience in the PR field. I went through three interviews. First with HR which went great. Got called back to meet with the VP of Business Development which this position would report to. Second interview went even better than the first. Last interview was with the CEO, a very accomplished and well respected individual in her field and the community. \r\n\r\nThe CEO did not seem to impressed with any of this. A month later I get an email saying instead of hiring someone to fill the position they decided to eliminate it. Huh? As they were in the process of merging with a larger entity, my belief is they never expected to fill the position locally and went through the exercise for show. To bad really, I know I could have helped them with public and media relations.", "Interview Questions": "First question, \"As CEO what do you think my expectation is of this position?\""}, {"date": "29 Jul 2017", "title": "Crisis Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centerstone (Nash, TX) in Jun 2015", "Interview Descriptions": "First spoke with someone on the phone briefly. She then sent me some questions to answer and there was a limited amount of time to do so. I then was brought in for an interview with three staff members. They gathered the necessary information. It was fairly informal and they made me feel comfortable.", "Interview Questions": "How do you handle yourself in a crisis/emergency type setting?"}, {"date": "11 Feb 2016", "title": "Crisis Care Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Centerstone (Nashville, TN) in May 2015", "Interview Descriptions": "Answer crisis hotline, perform risk assessment, community referrals. I also work a follow up report where I call clients who are at risk or have attempted suicide in the past. I make sure they are not at risk, ask them about their accessibility to means, help them reschedule therapy appts, etc.", "Interview Questions": "Why do you think you would be an asset to the company?"}, {"date": "9 Nov 2015", "title": "Intensive In-home Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centerstone in Oct 2014", "Interview Descriptions": "I met with the supervisor of my program and talked about my background and interests. She asked about challenges I've had and how I handled them. She told me I was a good fit and was unofficially offered the job. I needed to be credentialed and approved by a board and started a few weeks later. It was a very easy, low-key process.", "Interview Questions": "I was asked about my knowledge of various therapies. Cognitive behavioral therapy is heavily used and applicants should be familiar with it."}, {"date": "27 Jan 2015", "title": "Evaluation Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centerstone in Oct 2014", "Interview Descriptions": "I applied online, and got a phone interview about a week later, that lasted about an hour. Then I was invited for a interview with the head of the department, which took about 20 minutes. I got a call back about 2 weeks later that I was not selected. Overall, a professional interview and experience.", "Interview Questions": "What type of the evaluation would be your biggest strength? "}, {"date": "24 Jun 2014", "title": "Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Centerstone (Bloomington, IN)", "Interview Descriptions": "I was interviewed by the entire treatment team, but understand this procedure has stopped. I received two interviews, which I understand are often combined now. I interviewed with my future immediate supersivor and his supervisor. The other social workers were positive and welcoming, but this seems to vary greatly from office to office. Each Centerstone office seems to have its own unique culture. Of the office cultures I have experienced, the one in Seymour, Indiana is the most friendly, welcoming and helpful.", "Interview Questions": "I weas asked what three things I would want with me if I were to get stuck on a desert island. I understand this is no longer asked. Other questions were standard, such as questions about what extent of experience I had with addictions. I was given a position working with addicts, but was not informed I would be doing this until after I accepted the job, so asking lots of questions about what they expect is very important.\r\n\r\nI was also asked what theoritical base I used. Centerstone uses largely behavioral-cognitive protocols, so that is the correct answer, in my opinion."}, {"date": "3 Jul 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centerstone (Nashville, TN) in Jun 2014", "Interview Descriptions": "I applied online. I was called in for an interview a week later. I interview twice . First with the hiring manager and then again with a C-level. They asked mostly about my personality and coping skills as I would be in contact with a multitude of personnel and their respective personality types. They asked about my job skills and what I really wanted to accomplish at the end of the day.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "2 May 2014", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centerstone", "Interview Descriptions": "Phone and face to face interview", "Interview Questions": "Nothing comes to mind that was extremely difficult."}, {"date": "26 Dec 2013", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Centerstone (Bloomington, IN) in Nov 2013", "Interview Descriptions": "Phone call to set up interview with questions answered about the job\r\nOne interview with 2-3 managers", "Interview Questions": "Why are you a nurse?"}, {"date": "18 Sept 2013", "title": "Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Centerstone (Columbus, IN)", "Interview Descriptions": "The interview was held in two session, the first was one on one. the next was a group interview with current employees doing the jog you are applying for. easy interview good people they were excited to interview and you could tell they took it seriously.", "Interview Questions": "Describe what you think the job is."}], [{"date": "20 Oct 2013", "title": "Employment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centerstone (Nashville, TN) in Sept 2013", "Interview Descriptions": "I arrived and was shocked that the panel of 3 men interviewing me were dressed as if they were ready to grill burgers out the back door.  One man, apparently the highest ranking of the three, spent a lot of my interview texting on his cell phone.  The man who would have been my direct supervisor asked one or two questions.  The man who was his supervisor did most of the questioning and told me I would definitely receive some sort of response from them.  6 weeks later, I met the person who got that job.", "Interview Questions": "There were no difficult or unexpected questions though some of the ones asked made it appear that they had not thoroughly read my resume."}, {"date": "4 Nov 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centerstone (Nashville, TN) in Jan 2011", "Interview Descriptions": "Quick response to online resume and application, two weeks for everything to be checked out such as background and drug test and verifying degree, started job three weeks after first interview, first interview with human resources and then second interview with direct supervisor. Easy questions if you prepare in advance.", "Interview Questions": "What do I know about the company and its mission."}]]