[[{"date": "6 Dec 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Maine Medical Center", "Interview Descriptions": "30 minute phone interview with general interview questions such as why I am interested, my background, future goals, etc. Was relaxed and not too formal. This was more of an entrance interview to see if I have the right background", "Interview Questions": "Why are you interested in research?"}, {"date": "24 Jun 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Maine Medical Center", "Interview Descriptions": "Easy and very relaxed, they don't ask you many questions at all. However, there were multiple interviews and have a sequence of acceptance. They let you know quite early if you are selected or not.", "Interview Questions": "Tell us your experience? Explain"}, {"date": "8 Jun 2021", "title": "Vocational Rehabilitation Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Maine Medical Center (Portland, ME) in Jun 2021", "Interview Descriptions": "Amazing team effort during interview process. Most members of the team were present and eager to participate.  Energy and enthusiasm was palpable, and  interview questions and topics were conversational and genuine. The opposite of threatening or anxiety provoking, I already felt like part of the \"family\".", "Interview Questions": "Inquired about  previous professional experiences listed on resume, as well as personal experience ; Why would I be a good candidate/ what I could offer the team?; What life circumstances led to my interest in this work?..(etc)"}, {"date": "15 Mar 2021", "title": "Covid-19 Case Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Maine Medical Center", "Interview Descriptions": "There was a primary call made to set up an zoom call. She called me once for that. The next week I reached out to her about getting the zoom call, and she said, again, she would email me the link, and that is the last I heard from her.", "Interview Questions": "No questions given....just repeated run around about setting up an interview."}, {"date": "24 Aug 2020", "title": "Ekg Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Maine Medical Center", "Interview Descriptions": "It was very simple, low stress and comfortable. I felt as though it went well and there were not a lot of tough unnecessary questions asked from me. I felt good leaving interview. It was short and sweet- roughly 30 minutes of just casual conversation.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "16 Apr 2020", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maine Medical Center (Portland, ME) in Aug 2019", "Interview Descriptions": "Lengthy interview process, two different people interviewing. They provide instant feedback and it is fairly clear if they like you right off or not. Be confident and you will do just fine.", "Interview Questions": "What do you know about job development?"}, {"date": "30 Jul 2019", "title": "RN Clinical II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Maine Medical Center in Jun 2019", "Interview Descriptions": "Good process, quick, everyone is very nice. but hourly wage/ salary is  extremely poor for a nurse compared to cost of living in Portland, ME.\r\n\r\n\r\n\r\n- - - - - -", "Interview Questions": "N/A"}, {"date": "2 May 2019", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Maine Medical Center (Portland, ME) in May 2019", "Interview Descriptions": "Phone interview very laid back. I enjoyed the conversation it made me less nervous they asked me how I could be a leader it overall took 47 minutes on the phone.", "Interview Questions": "Why I am leaving my current job?"}, {"date": "23 Mar 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Maine Medical Center (Portland, ME)", "Interview Descriptions": "Very easygoing, friendly, questions geared more towards customer service.  An interview with the nurse manager followed by a peer interview with a nurse and cna off the floor. Was offered a job a couple days later.", "Interview Questions": "How would you handle a complaint"}, {"date": "31 Oct 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Maine Medical Center (Portland, ME) in Dec 2018", "Interview Descriptions": "interviewed with the 3 unit managers for SCU. They called my references and I did not hear anything from them for 3 weeks. I called and asked what the next step is and I did not get an answer. 3 weeks went by and I had not heard anything so I accepted an offer at a different facility, when I called to remove my application they offered the job.", "Interview Questions": "Explain a high pressure situation and how you handled it"}], [{"date": "7 Sept 2018", "title": "Health Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maine Medical Center", "Interview Descriptions": "Started with a Skype interview and was invited for an in-person interview. Wasn't told it was going to be a panel interview with the whole team there. A little intimidating and they read off a sheet of questions and wrote things down. Very little dialogue but questions weren't too out of the ordinary. Despite being very qualified, they sent me an automated email that I didn't get the position.", "Interview Questions": "What resources do you use for health literacy?"}, {"date": "4 Oct 2020", "title": "Patient Care Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Maine Medical Center (Portland, ME) in Aug 2018", "Interview Descriptions": "Interview process wasn't organized or professional.  They were not very communicative except during the initial call to set up the interview. This seemed particular to the department or the manager, however.", "Interview Questions": "Does the mission of MMC align with your own?"}, {"date": "3 Feb 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Maine Medical Center (Portland, ME) in Nov 2017", "Interview Descriptions": "Applied online through their website and was contacted about an interview. The online application was very easy to complete and I uploaded my resume. My resume auto-filled most of the application and then I just corrected questionst that needed to be changed.", "Interview Questions": "How do you see social justice as applicable to this job?"}, {"date": "17 Nov 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Maine Medical Center (Portland, ME) in Sept 2016", "Interview Descriptions": "I applied online and then HR called me within a few days and then did a phone interview with HR and then I did an interview with management. I got an offer within a few days!", "Interview Questions": "N/A"}, {"date": "25 Aug 2016", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Maine Medical Center in Jun 2016", "Interview Descriptions": "The Process took over 3 months. 1 round of interview, very basic and easy questions. I was supposed to have mine with the Director. Instead had it with entire team. \r\nThey asked intelligent questions plus they also talked about the role, the team and gave a very good idea about the team I would be working with. I'm still waiting to hear back so I think their interview process is quite slow.", "Interview Questions": "About the resume and past projects"}, {"date": "7 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Maine Medical Center", "Interview Descriptions": "Three interviews, one with HR, one with the supervisors and then a group interview with peers. Overall they went well and asked a variety of questions about my background and where I saw myself in the future.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "17 Jun 2016", "title": "Healthcare Management Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Maine Medical Center (Portland, ME) in May 2016", "Interview Descriptions": "Started with a tour of the hospital, including participation in the daily morning process improvement drive. Next, met with two teams of 2-3 interviewers who were interested in my background to assess suitability to the position. Concluded with a presentation to about 20 people on work done.\r\n\r\nFriendly and relaxed environment. Salary low, but is a non-profit organization.", "Interview Questions": "Why healthcare?"}, {"date": "14 Aug 2017", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Maine Medical Center (Portland, ME) in Mar 2016", "Interview Descriptions": "I applied online as an internal applicant. HR filtered me out of the hiring process because I came up as unqualified. The manager had already known of me so he had to contact HR to receive my application. It was a small interview with the manager and one other employee.", "Interview Questions": "They asked where I saw myself in 5 years and would I be willing to give 2 years to the position. "}, {"date": "9 Aug 2018", "title": "Patient Financial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Maine Medical Center (Scarborough, ME) in Feb 2016", "Interview Descriptions": "Initial temp to hire video chat, once information was received by Maine Medical Center I was brought into the office in front of two floor managers. Basic questions were asked including skills, education, team related questions, future plans, talking about career path, etc.", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "9 Oct 2015", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Maine Medical Center (Portland, ME)", "Interview Descriptions": "Began with a dinner meeting the night before the interview.  The following day was an all-day interview with many stakeholders that would interact with the person that was hired for this position.", "Interview Questions": "Share a difficult moment where you had to deal with a person who was quite confrontational.  How did you resolve it?"}], [{"date": "9 Oct 2017", "title": "Patient Financial Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Maine Medical Center (Portland, ME) in Oct 2015", "Interview Descriptions": "Usually interviewed by two managers.  They really want to know how you work in a team environment. They are very quick on getting back to you.  The point is to make sure you are a reliable person. A lot of situational questions as well.", "Interview Questions": "How do you handle conflict within a team setting."}, {"date": "20 Feb 2015", "title": "Radiology Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Maine Medical Center", "Interview Descriptions": "You first apply online and then you sit before a panel of hiring people and they ask you questions and you answer. It wasn't intimidating or anything like that. They ask about your experience, skills, strengths, and weaknesses. They look at your resume and cover letter so make sure to have those updated.", "Interview Questions": "What past experience makes you qualified for this job"}, {"date": "16 Jan 2015", "title": "Entry Level Management Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Maine Medical Center in Oct 2014", "Interview Descriptions": "Applied for the position and was contacted for an interview the next week. Phone interview was very casual. Went over expectations (salary expectations, why Portland, what do you know about MMC, etc.) \r\n\r\nIn-person interview was a two-day affair. Lead HR lady was standoffish towards me. Managers at MMC are very experienced and nice.\r\n\r\nSome nepotism going on at MMC.\r\n\r\nNever ended up getting reimbursed for travel despite submitting my claim", "Interview Questions": "Tell me a time where you used data to solve a problem"}, {"date": "6 Mar 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Maine Medical Center (Portland, ME) in Aug 2014", "Interview Descriptions": "Applied online and was reached out to via email and then via phone to arrange an interview. Was met by a group interview; interviewers asked pre-written questions. Very friendly atmosphere. Was contacted later by phone by a recruiter who made the offer. No salary negotiation via phone; if you want to negotiate, you have to turn down the offer letting them know that you're interested but not at that rate. If top candidate, likely that recruiter will return with a higher job offer.", "Interview Questions": "Asked behavioral questions such as \"Describe a time when you had a disagreement with your boss; how did you handle it?\""}, {"date": "8 Apr 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3+ months. I interviewed at Maine Medical Center", "Interview Descriptions": "On-line process very cumbersome. Communication lacking from HR about status and process. Took 2 months from application to interview. Day long interview process with 50% of those participating not coached about how to interview, or not interested", "Interview Questions": "None, all quite typical."}, {"date": "18 Feb 2014", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Maine Medical Center", "Interview Descriptions": "submit app, meet manager, meet comite, get job offer", "Interview Questions": "all standard questions, nothing weird"}, {"date": "9 Nov 2013", "title": "IS Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at Maine Medical Center", "Interview Descriptions": "I had a phone interview and 2 in-person interviews, and was surprised how little they asked about my experience and skills.", "Interview Questions": "When can you start?"}, {"date": "2 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Maine Medical Center (Portland, ME) in Aug 2013", "Interview Descriptions": "Easy - I only got asked one question and the entire interview was spent listening to the director of the floor talk about how great their floor is. The hiring process was quick for the most part and I got an offer shortly after I interviewed.", "Interview Questions": "What was the biggest surprise to you after graduating nursing school and entering the nursing workforce. "}, {"date": "29 Jul 2013", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Maine Medical Center (Portland, ME)", "Interview Descriptions": "Easy, I had the education and license they were looking for.  Was pretty relaxed and mellow.  It was almost too easy, my interview at Mass General was far more intimidating.  It was way easier at MMC!", "Interview Questions": "None, they were most worried that I would leave after training due to their abysmal starting pay.  I had proven myself well apparently during my time as a student there.  So there were no real difficult questions about my knowledge, it was kind of a joke really."}, {"date": "16 Jul 2015", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maine Medical Center (Portland, ME) in Jul 2012", "Interview Descriptions": "I was taken by an HR associate to a quiet room to be assessed  one-on-one. She asked me your standard, difficult interview questions and had me play out a complex hypothetical about multi-tasking, gave me immediate feedback on my performance in that and then I was moved to another office to be given a test on math and pharmacy knowledge.", "Interview Questions": "\"Tell me about something from your position at your previous employer that would help you in this job.\""}], [{"date": "23 Sept 2013", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Maine Medical Center (Portland, ME) in Dec 2011", "Interview Descriptions": "The Interview process began with a phone interview with Human Resources and then a  phone interview with the hiring manager. This lead to a face to face interview. Maine Medical center paid for travel and lodging for the interview; this included airfare, hotel, and a rental car. The in person interview consisted of several panel interviews and 1:1 interviews. This process lasted from about 9 am to 5 pm.", "Interview Questions": "The questions were straight forward asking about previous experience with a few behavioral questions thrown in. There was plenty of opportunity to ask questions of the interviewers."}, {"date": "27 May 2011", "title": "Histotechnologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maine Medical Center (Portland, ME) in Oct 2010", "Interview Descriptions": "Application process is straightforward online with ability to upload resume and cover letter.  Having a good resume summary statement that matches your skills with the job description you are after can make an impact with the HR representative that initially reviews resumes.  Interviews may often be over the phone or in person.  Everyone in the process was very warm and welcoming and the work culture is professional and friendly.  It is a place you want to come to every day.", "Interview Questions": "Tell me about yourself?"}, {"date": "27 Feb 2011", "title": "House Kepping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Maine Medical Center (Scarborough, ME) in Aug 2010", "Interview Descriptions": "I was interviewed by the superviser went well she liked me and i liked her she wanted to know my past work so I let her know just what I have done in the past, Then I had an interview whith the director at that time and he asked me the same questions and I gave the same ansers, and it all went very well it was 20 years ago.", "Interview Questions": "past employers"}, {"date": "30 Jul 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maine Medical Center (Portland, ME) in Mar 2010", "Interview Descriptions": "The process involves an online application and initial interview to determine eligibility and fit. From there one is generally interviewed by a group of individuals and a team concensus is made on who to hire. Very kind and relaxed process which is supportive of all applicants.", "Interview Questions": "What value will you bring to the care of patients?"}]]