[[{"date": "18 Jul 2023", "title": "P3 Programme officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme (Rome)", "Interview Descriptions": "Interview are competency based. The questions include a question to introduce yourself, your skills and how your experience contributes to the job. Then a set of 3 -4 competency questions related to the skills required for the position.", "Interview Questions": "How would you communicate complex information to senior management? what would you do? how would you prepare?"}, {"date": "18 Jul 2023", "title": "Senior L&D Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "Competency based interview with request to illustrate specific examples of projects I recommend using the STAR model to answer - specific examples are expected. Explain your role and responsibilities and how you solved specific challenges", "Interview Questions": "Tell us about a time you facilitated a training/designer a learning solution"}, {"date": "4 Jul 2023", "title": "Knowledge Management Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme (Rome)", "Interview Descriptions": "The interview went well but they never got back to me to tell me I didn't get the job or to give me any feedback. This caused me a lot of stress and they never replied to my emails.", "Interview Questions": "Why do you want to work in Knowledge Management?"}, {"date": "1 Jul 2023", "title": "Stage curriculare Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "Colloquio troppo complesso per il livello di posizione (stage), inoltre le persone che hanno fatto il colloquio non volevano rispondere alle mie domande riguardo la posizione. Li ho trovati scortesi nel complesso.", "Interview Questions": "esperienze di lavoro in team, domande specifiche riguardo la posizione"}, {"date": "28 Jun 2023", "title": "Logistic Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme (Rome)", "Interview Descriptions": "Very good process with constat updates and feedback provided after the interview. The whole process took around 4 months from an initial screening, through a written test, until a final oral interview conducted via zoom.", "Interview Questions": "Competence based with technical insights"}, {"date": "17 Jun 2023", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme (Rome)", "Interview Descriptions": "The process was okay but required me to do so much work. They got back on time to tell about my interview outcome. I feel like it is unfair to give someone that amount of work only to decline them a position.", "Interview Questions": "Creating content Copy writing Video editing"}, {"date": "12 Jun 2023", "title": "Knowledge Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme (Rome)", "Interview Descriptions": "I had a 1 hour interview with 3 employees. The interview was full in English, but unfortunately they didn't give me a feedback. The interview was the classics questions and answer the job interview with examples using the star method.", "Interview Questions": "Examples of the job offer"}, {"date": "2 Jun 2023", "title": "Information Management Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "The interview was structured as a comprehensive panel session comprising of four to five competency-based questions, a format that aligns with the standard practice observed in interviews conducted by the World Food Programme (WFP)", "Interview Questions": "Definition of food security Managing conflict Managing information management projects"}, {"date": "13 May 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme (Rome)", "Interview Descriptions": "It took around 1 month for them to contact me through my personal email. The interview was over zoom. They asked specific and general questions. Around 1-2 weeks later I was sent an offer.", "Interview Questions": "What is my experience with deadlines? Can I talk about WFP? Why do I want to work for their team?"}, {"date": "15 May 2023", "title": "Junior Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme (Rome)", "Interview Descriptions": "apply online the got a Phone interview with the hiring manager to discuss the job and the requirement for the job process is one month and you have to fill up a online cv", "Interview Questions": "What is you experience with data analysis"}], [{"date": "19 Apr 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "They contacted me for an interview after 4 months, and I was told what I was being interviewed for (there were several positions within the division) at that moment. It was a panel interview, which felt like an interrogation. I did not get a positive response, but it took them another month or more to tell me that through an automatic decline message.", "Interview Questions": "Given that I was not told before exactly what they were interviewing for in the beginning, I prepared for the division's general work, however I was asked specific questions to the role."}, {"date": "8 May 2023", "title": "Associate Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Food Programme (Rome) in Apr 2023", "Interview Descriptions": "This was the best interview I have ever done! The individuals on the panel made me feel so welcomed and valid, they gave me credits for my answers and seemed genuinely interested to listen to me. In total it took 30 minutes.", "Interview Questions": "General interview questions including motivation"}, {"date": "21 May 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme (Rome) in Mar 2023", "Interview Descriptions": "Basic questions about skills, experiences and the Organization itself. The interview lasted about 20 minutes. No feedback and very unprofessional communication, have not heard back even after asking for an update.", "Interview Questions": "Skills, experiences and knowledge about the Organization"}, {"date": "6 Apr 2023", "title": "SAP Senior Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Food Programme (Rome) in Mar 2023", "Interview Descriptions": "Processo di colloquio ben strutturato. Unico colloquio gestito con metodologia STAR. Giusto mix tra tecnico e skills organizzative e sociali. Condotto alla perfezione. Uno dei migliori colloqui a cui abbia mai partecipato.", "Interview Questions": "Situazioni e task progettuali Simulazioni relative al progetto Simulazioni di ufficio Richieste tecniche Altro"}, {"date": "4 May 2023", "title": "Junior Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme (Rome) in Feb 2023", "Interview Descriptions": "Incredibly slow process as it's usually the case with prestigious institutions such as the UN etc. Totally non-personal email, where I was invited to complete a written task. After nearly one month past completion, I discovered by myself on the career portal that my recruiting process was over. One week later, the person I was \"in touch\" with, sent me a formal rejection email. Really demotivating. There was no interview, but the writing text wasn't easy - which is understandable for this kind of institution.", "Interview Questions": "No interview question, just a written task."}, {"date": "16 Feb 2023", "title": "Junior Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme (Rome) in Jan 2023", "Interview Descriptions": "I applied for a junior consultancy position in mid-November. At the end of December I had an assesment in which I had to record myself answering several questions. At the beginning of January, I was contacted for an interview a week later. At the interview I was told that I would hear about the process in two weeks, but a month has passed and I still haven't heard anything. I am very interested in the position, I have sent an email to follow up but I have not received a reply. I have read in several blogs that the process can take quite a long time, but as I was told it would take two weeks to receive news, I understand that it is because I have not been selected. Has anyone had a similar experience?", "Interview Questions": "Questions related to the position"}, {"date": "4 Feb 2023", "title": "Internship HR Global Talent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme (Rome) in Jan 2023", "Interview Descriptions": "First i send my CV, motivational letter and other documents. One month later i received an email to make a PP presentation. The first interview was one week later with the HR team and the last interview with the Head Officer.", "Interview Questions": "Motivation, experience, how you manage stress, how you schedule your day and behavioral questions."}, {"date": "21 Nov 2022", "title": "Knowledge Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome)", "Interview Descriptions": "Good rapport with competency based questions. There were 3 panelists with the hiring manager. They seemed impressed. I was contacted by the team assistant and my profile on the recruitment platform changed to “congratulations, you passed to the interview stage”. I wrote a test a week before being invited for interview.", "Interview Questions": "How have you handled a difficult colleague in the past?"}, {"date": "16 Aug 2022", "title": "Marketing Communication Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Aug 2022", "Interview Descriptions": "I was invited to a Teams-interview with the Head of the unit and two other communications specialists. It took 30 minutes and I got 4 technical questions, all about my competence and experience. The people were very nice and friendly.", "Interview Questions": "Which are the challenges you see for our organisations?"}, {"date": "18 Jan 2023", "title": "FIT Pool Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Aug 2022", "Interview Descriptions": "The interview was simple. I applied for a FIT Pool position, and was offered an interview after 4 months of applying and after an online assessment. The interview questions were behavioral questions, simply asking to define myself, my past experiences and why I am motivated to apply for this position. I was also asked about my strengths and weaknesses, and what I would have done to avoid a conflict situation with my colleagues.", "Interview Questions": "- Strengths - Weaknesses - How do you manage a project - How do you avoid conflicts?"}], [{"date": "7 Apr 2022", "title": "Regular Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "1) Send CV and cover letter via the online platform 2) written assessment based on technical knowledge necessary for the role 3) panel interview with potential colleagues and a representative from the admin / HR department.", "Interview Questions": "Why are you fit for the role?"}, {"date": "23 Sept 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme", "Interview Descriptions": "A 30 to 40 minute telephone interview which surprisingly mostly  focused on competencies as opposed to technical questions and previous experience. Also  brief CV overview.  At the end of the interview there is a possibility to ask questions which is what I believe can make a difference. It is a chance to show that you know what you are applying for and what to expect. At this point, it should also be mentioned that the selection process is very competitive, approximately 800 applicants for one position. So what will really get you the job is your initial application.", "Interview Questions": "1)Describe a situation where you had to communicate a complex issue to an audience unfamiliar with your area of expertise.  "}, {"date": "18 Aug 2021", "title": "Visual designer consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "I was interviewed, after presenting a design assignment, by the current visual designer whom I’d be working with if hired. Questions made were very much design oriented. Didn’t passed on to next step due to the results of my assignment. Each step takes a fairly long time to obtain feedback from.", "Interview Questions": "How do you usually handle a design project?"}, {"date": "17 Aug 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at World Food Programme (Rome) in Jul 2021", "Interview Descriptions": "The interview process consisted of a written technical examination and upon passing a panel interview via Skype. Questions centered on past relevent experience, competencies and overall fit within the team.", "Interview Questions": "What makes you a good fit for the role?"}, {"date": "18 Apr 2021", "title": "Partnership Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at World Food Programme", "Interview Descriptions": "The recruitment process included a written assessment, a language test and two rounds of interviews (a video interview through HireVue and a live panel interview with three Partnership Officers and a member from HR)", "Interview Questions": "Both the video interview and the panel insisted a lot with behavioural questions on receiving feedback, reacting to a negative situation and dealing with difficult stakeholders."}, {"date": "24 May 2023", "title": "Business Support Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in May 2021", "Interview Descriptions": "It has represented a long process. They send you the Written test to do in a proctored environment and then oral interview after different months from application. It could last less.", "Interview Questions": "Why are you the best candidate?"}, {"date": "17 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at World Food Programme", "Interview Descriptions": "Ho mandato la candidatura online. Dopodiché, ho sostenuto due prove scritte: una attitudinale, in cui mi hanno fatto domande in stile colloquio e una tecnica con 3 problemi. I tre problemi erano: scrivere un negotiation brief, analizzare dei dati su Excel, e creare un powerpoint per una campagna di raccolta fondi. Infine, sono stato invitato al colloquio.", "Interview Questions": "D: Perché vuoi lavorare nel WFP?\r\nD: Dimmi di una volta in cui ti sei dovuto adattare in fretta ad una situazione che è cambiata rapidamente."}, {"date": "18 Mar 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "Dopo aver effettuato l’application online sul sito sono stato contattato e ho sostenuto un colloquio conoscitivo e tecnico con i responsabili della funzione ricercata per la posizione in questione", "Interview Questions": "Descrivi le tue passate esperienze lavoratove"}, {"date": "4 Jun 2021", "title": "Deputy General Counsel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at World Food Programme (Rome) in Mar 2021", "Interview Descriptions": "Compilazione form World Food Programme con inserimento dati personali ed invio di Curriculum Vitae e Lettera di presentazione; la compilazione è molto complessa e richiede un notevole impegno di tempo", "Interview Questions": "Esperienze precedenti, preparazione accademica; impiego attuale; retribuzione"}, {"date": "27 Jan 2022", "title": "Talent Acquisition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Mar 2021", "Interview Descriptions": "The Interview consisted of five to six competency based questions involving past experiences, strengths, and weaknesses.\r\nAfter the technical assessment, there is a video interview assessment, then the final interview.\r\nQuestions such as my motivation, technical skills were not fully focused on as much as the competency aspects.", "Interview Questions": "Have I ever been in a leadership position? what was the most challenging thing I had to do as a leader"}], [{"date": "22 Apr 2021", "title": "Programme policy officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Dec 2020", "Interview Descriptions": "Technical written test of two hours with specific questions on the region,  followed by panel interview of 45 minutes. Overall it was a pleasant experience and the impression was that even those candidates that did well but were not selected would have been considered for other positions.", "Interview Questions": "A couple of general questions on motivation and background followed by specific questions"}, {"date": "9 Mar 2021", "title": "Budget and Programming Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at World Food Programme (Rome) in Dec 2020", "Interview Descriptions": "Applied online and was interviewed 7 months later, overall the interview was good and not difficult . it was done online and there were 3 people on the panel. most of the questions were behavioral iterview questiosn", "Interview Questions": "How would you handle a difficult situation with a colleague"}, {"date": "2 Dec 2022", "title": "Editorial Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at World Food Programme (Rome) in Nov 2020", "Interview Descriptions": "I was cold-contacted/recruited for an interview for a contract position in a new department that was slated to last only two months after the date of the interview. Prior to the interview, I had to sit a writing test and pen an in-depth feature article where the specs weren't completely clear.", "Interview Questions": "I can't remember the specifics of what they asked me – it was all very vague because the department was new. The people interviewing me were really personable and kind, and clearly it would have been an interesting opportunity if it had gone forward. Unfortunately, I got the impression that they were instructed to hold interviews preemptively, ahead of actually forming the new department or guaranteeing its viability. I was told a few weeks after my interview that the position no longer existed / the opportunity was no longer available. It was a decent learning experience, but overall left me with a distaste for exploring more work in that sector."}, {"date": "6 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme (Modena) in Oct 2020", "Interview Descriptions": "Come primo step ho fatto l'applicazion sul loro sito, ho letto molto, mi sono informata usando il materiale che ho trovato, quindi ho inviato curriculum,lettera motivazionale e ho compilato la loro domanda online. Poi è iniziata la selezione vera e propria, ho fatto una prova su Excel e Power point e una volta  superato questo step ho fatto due colloqui, con Business cases.", "Interview Questions": "Perché questa organizzazione umanitaria e non altre, cosa pensi di poter portare, punti di forza, debolezza"}, {"date": "29 May 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "The interview was made of a first written assessment on the topic of the internships followed by a phone interview with the hiring manager. After the second step, I received an offer of internship.", "Interview Questions": "Give me an example of research project you’ve worked on"}, {"date": "23 May 2020", "title": "Security Guard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at World Food Programme", "Interview Descriptions": "Now im in the process...first they sent me invitation that i was picked from great ammount of applications. Then i passed 2 hours written test in computer (60 questions), 1 opened question(situation and report about it). Now im waiting for other tasks.", "Interview Questions": "I don't know yet"}, {"date": "2 Nov 2022", "title": "Clinical Psychologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Food Programme (Rome) in Mar 2020", "Interview Descriptions": "I applied online through the WFP website. After 3 weeks I was asked to do an interview by zoom. I met with 4 people in the Panel. It was a challenging yet very interesting interview. They asked me about the application and some background history. They asked why I want to work for the WFP. I received an email one week after saying that although my interview was very good, I didn't get the job because of the lack of experience in the UN system.", "Interview Questions": "Why I applied for this job. What's the value I could bring to the WFP Team? What was my experience with the family system model. What was my experience working with UN. Conflict resolution example in a Team. An example of strategic communication."}, {"date": "13 Dec 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Food Programme", "Interview Descriptions": "Overall a pleasant experience. Great hiring manager. Very clear, efficient and professional communication. A telephone interview took around half an hour, interviewers called exactly on the arranged time and were friendly and polite throughout.", "Interview Questions": "Why did you apply? How your experience matches the position?"}, {"date": "24 Jun 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "At first the ask you to do a task in 3 hours and half  at home and than they call you for an interview in their headquarter to ask you some questions", "Interview Questions": "when was the time you had difficult working in a team and how did you resolve it?"}, {"date": "8 Aug 2020", "title": "Programme policy officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at World Food Programme (Rome) in Jun 2019", "Interview Descriptions": "The first stage was a 120 mins written test which had 4 questions. The second and final stage was a 45 min video interview with a panel of 4 WFP personnel.", "Interview Questions": "What was the most challenging encounter in your previous or current employment and how did you manage to overcome the challenge?"}], [{"date": "17 Jul 2019", "title": "Procurement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme (Rome) in May 2019", "Interview Descriptions": "The invitation to Interview was an e-mail that had been forwarded, which I felt could have been avoided to make it feel more personal. I had two interviews, pretty normal competency based questions around teamwork and leadership skills. I applied for the position in December,  first Interview was in April and the next one in May, so a rather lengthy process! After 3 weeks, I asked for feedback and was advised they would get back to me after 2 more weeks. I asked one more time after that and I have still not heard anything back from them. I will leave it at that. I understand that there are a lot of candidates for these positions, but I still think they should have the courtesy to inform you if you weren't successful after your interviews or just update the online status... I am left feeling rather disappointed.", "Interview Questions": "What makes you a leader and not a follower?"}, {"date": "15 Mar 2022", "title": "Senior IT Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Food Programme (Rome) in Jan 2019", "Interview Descriptions": "Colloquio di persona presso la loro sede. Durata complessiva circa 1 ora. Domande sull'esperienza lavorativa, sulle motivazioni. Spiegazione complete del ruolo e delle responsabilità. Presente il responsabile IT e HR", "Interview Questions": "QUal è il motivo principale che ti spinge a cambiare lavoro?"}, {"date": "6 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Dec 2018", "Interview Descriptions": "I applied online. Got a call from rome headquarters to confirm about my availability after 2 days. After a week , got an email for a skype interview. Two people from the department that would assign the interview took interview for about 25 mins. They introduced themselves and also about the job and responsibilities of the intern.", "Interview Questions": "what is your motivation to work here.\r\nquestions related to past projects i had been involved in.\r\nsituational questions about how you deal with a difficult person and about time management and team work.\r\n"}, {"date": "15 Oct 2018", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "I submitted an application and had to also include a sample of a report I wrote. I was then called for a panel interview with senior managers and HR. The questions were quite technical and based on a series of experience I had in the past, related to the job description.", "Interview Questions": "Questions about partnership - fundraising - coordination skills"}, {"date": "22 May 2018", "title": "Intern - Due Diligence UNit Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in May 2018", "Interview Descriptions": "Envoi d'une candidature en ligne (CV et lettre de motivation), puis prise de contact par email pour un entretien téléphonique. Entretien d'environ 30 minute avec deux personnes. Due diligence + compétences personnelles et profil.", "Interview Questions": "How would you proceed to a due diligence check? "}, {"date": "2 Jun 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Feb 2018", "Interview Descriptions": "Sono stato chiamato per un colloquio di tirocinio. Sono stato invitato all'edificio del WFP a Roma. Sono stati molto professionali e  molto puntuali. Ho ricevuto una risposta negativa. Ma penso che sia ancora importante. Alcune organizzazioni non danno mai una risposta se è negativa.", "Interview Questions": "Abbiamo avuto una conversazione molto rilassata sulla mia istruzione e sulle precedenti esperienze lavorative. Mi hanno chiesto perché mi piacerebbe lavorare lì."}, {"date": "25 Oct 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at World Food Programme (Rome) in Jan 2018", "Interview Descriptions": "There was a written test that was to be completed in two days plus one phone interview with two panel members. The questions were mostly competency based and the written test focussed on technical skills", "Interview Questions": "How you would handle a request from a higher up if your boss could not be consulted to verify some information"}, {"date": "9 Nov 2019", "title": "Communication Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme (Rome) in Jan 2018", "Interview Descriptions": "After 3-4 weeks from the online application, I received a written test (24h to submit it), where I had to prepare an article for the intranet and a graphics. After other 2-3  weeks I was invited for a panel interview (via Skype), which was competency based. After other 2-3 weeks, I was invited for a second \"meet-the-team\" interview, again via Skype.", "Interview Questions": "The competency based interview had both HR questions (\"Describe how you solved a conflict with a colleague\" type of questions) and more technical questions on e.g. how I plan a communication campaign and what are the things I would keep in mind when doing so"}, {"date": "17 Nov 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at World Food Programme (Rome)", "Interview Descriptions": "I passed the Computer Skills Tests and the English Proficiency Tests at FAO and the person who chose me was in need of someone who had passes the tests to make sure she could receive the help she needed", "Interview Questions": "She explained the job only and told me my salary"}, {"date": "3 Oct 2017", "title": "Junior Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at World Food Programme (Rome) in Oct 2017", "Interview Descriptions": "Meeting with 3 interviewers. Normal interview questions with nothing unexpected really. They did ask what I knew about WFP so be able to eloquently talk about what WFP does and why your interest in this specific UN branch.", "Interview Questions": "What are your thoughts on knowledge."}], [{"date": "11 Jan 2021", "title": "Government Partnership Division Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Rome) in Sept 2017", "Interview Descriptions": "I submitted my application in April 2012. I was contacted in August 2012 with an e-mail inquiring whether I was still available and interested. The interview was scheduled one month later. I received a reply within one week.", "Interview Questions": "They asked me:\n- Why I was interested in joining WFP;\n- My experience with government partnerships;\n- My academic and professional background.\n\nThey  also opened up to my questions - I was interested in knowing about their lobbying strategy vis-a-vis governments to secure funding."}, {"date": "14 Nov 2017", "title": "Individual Fundraising Digital Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at World Food Programme (Rome) in Feb 2017", "Interview Descriptions": "Very quick process. I applied online, the next day I was called for a phone interview and 3 days later I got the job. It was a very positive experience.", "Interview Questions": "How did I fit the specific job requirements? \r\nWhy did I apply?"}, {"date": "23 Jan 2017", "title": "Legal Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Food Programme (Rome) in Nov 2016", "Interview Descriptions": "The interview consisted in two steps. The first was a written text (1 hour long) and was divided in 2 parts: in the first part was asked to draft a contribution agreement between WFP and a State, the second part concerned a legal advice regarding a WFP officer", "Interview Questions": "Explain your background and career's plans\r\nQuestions on the immunities of UN's officers (which is the legal framework, why they have these immunities)\r\nIf the UN can be part of a trial\r\nWhich are the essential clauses in a contribution agreement"}, {"date": "9 Nov 2016", "title": "Human Resources Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at World Food Programme (Rome) in Sept 2016", "Interview Descriptions": "I was interviewed personally at WFP Headquarters. The interview lasted 1 and a half hours and I was told I would get a reply within the next few days. Not only did I never hear from them again, but when I wrote an email asking about the results of the selection process nobody cared to answer. Complete lack of respect and consideration from Human Resources, they were very unprofessional. Not at all what you would expect from a humanitarian agency of its calibre.", "Interview Questions": "Normal questions, especially focused on the use of software"}, {"date": "3 Jul 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at World Food Programme (Milan) in Jun 2016", "Interview Descriptions": "The interview was a skype one\r\nThe interview was divided into two parts:\r\n- in the first one, general questions have been asked\r\n- in the second one, case study (you are a WFP member, you have to decide how much food and how much people send to Cairo Region, you cannot use a calculator)\r\nthe interviewer was nice", "Interview Questions": "present yourself"}, {"date": "15 Nov 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Food Programme (Rome) in Jun 2016", "Interview Descriptions": "The interview was great, I was interviewed by three consultants and the second interview was the Head of Office. Questions were not hard and it was a pleasant experience. I was asked questions by all three consultants about what I would do in certain situations and what are my goals.", "Interview Questions": "Do you have experience with Microsoft office? "}, {"date": "8 Jul 2016", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Food Programme (Milan) in Jun 2016", "Interview Descriptions": "Lots of mail and two Skype interviews with a very fast process.\r\nAll of this process was unproductive due to their strict guidelines regarding interns and to the lack of attention of the recruiters (no appropriate interviews with a brief and rude mail to explain the negative feedback): it looked like they needed an intern (maybe for the summer) but they're looking for a perfect candidate.", "Interview Questions": "General questions, the second interview (with the HR Director of the branch) was really quick, it looked like he was in a hurry"}, {"date": "9 Mar 2016", "title": "Internal Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at World Food Programme (Rome) in Dec 2015", "Interview Descriptions": "I applied online in November and was called for a phone interview in December after which I was asked to write a report, summarizing the  interview I had. A few weeks latter, I was invited for a technical text which was sent to me via email and I had to submit my response within 24 hours. This was the most intensive UN (technical) text I have ever written (I have written more than 10 of them for other UN organization). Basically, I was given a report, based on which I had to prepare my audit plan. I was then invited to Rome for a Face to Face interview after which I was supervised to write a 2 hour management test mainly to test my soft skills and how I am able to prioritize my work in the real work environment. After this, I had the opportunity to be interviewed by the Inspector General. 8 of us made it to this stage.  A few weeks latter, they came back to me saying the position has been offered to a more senior candidate. However, because they were very impressed with my performance through the whole process, they would offer me a lower level position (which was one level lower than what I had applied for) if I would accept it and depending on my performance on the job, I will be considered for that higher level post if any became vacant in future. well, I was very disappointed but it sounded like a very good opportunity for advancement in my career and it was in the field I had longed to get back to so I accepted. Additionally, they had given me a very good impression of WFP throughout the whole process so .... it sounded like an organization I would love to be a part of.\r\nFinally and lastly, I was invited for a French test since I had listed French as my second language. My phone number was given to a testing company to call me and their number was also given to me. Because I had already read on this site about someone's experience where he was called an hour latter than I agreed, I decided to call the  testing company myself when they were 10 minutes late. It was an oral and listening test to determine my level in French. The evaluator was speaking at normal speed so it was not very fast. some of the questions asked were: tell me about yourself, what will you do this weekend, where do you normally go when you want to be alone, where would you like to go on pension, describe how to make tea, how will you describe the global economy to someone, what will you say to a friend who invited you to a party but you would not be able to attend because of other commitments etc. In all, I think they asked about 20 questions but I am not very sure and it took exactly 30 minutes to complete the test. I googled how to prepare for a language test and I found many helpful sites. One of the most helpful websites had an article called \"How to prepare for a foreign language oral or speaking exam and succeed and do well\". All the tips given here were very helpful. There was also another site with an article called \"How to prepare for your foreign language oral exam\".\r\nSoon after writing the exam, I received the intent of offer email with some forms to sign.  I have not received the contract yet but hopefully I will receive it soon and I am enthusiastic about the contributions I can make to the audit team.", "Interview Questions": "Tell us about yourself, why you want to work with us and how your qualifications are going to help you succeed in this role. What are the qualities of a good leader, Tell us about a difficult situation you encountered and how you handled it, there was another one about teamwork but I cannot remember exactly what it was and then I had to answer a question about working in a multicultural environment in French. The interview itself was not difficult because I was well prepared but the tests were difficult."}, {"date": "15 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Food Programme (Rome)", "Interview Descriptions": "Was asked to do a written test one month after I applied. I passed the test and was asked to do a phone interview with a panel one week later. Then was offered the position one week later.", "Interview Questions": "They asked about my background and motivation for working with WFP and what I knew about them. Also wanted to know how my skills/strengths and how it relates to the position."}, {"date": "7 Jul 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Food Programme (Rome) in Jun 2015", "Interview Descriptions": "The atmosphere was nice. I applied online and I've been called after one month. The phone interview had a duration or 40 minutes more or less and it was a panel interview.", "Interview Questions": "Nothing strange: Presentation, Why did I apply..."}], [{"date": "29 Apr 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Food Programme (Rome) in Apr 2015", "Interview Descriptions": "Years after I had applied I finally received an email where they wanted to schedule a 30 minutes interview which would be followed by a written segment. \r\nI found useful info on how to prepare for the interview on the UN website. \r\nThe written segment was an analysis/critique of two of the three main funding systems of WFP", "Interview Questions": "Do you know what the WFP does? "}, {"date": "5 Oct 2015", "title": "Due Diligence Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Food Programme (Rome) in Mar 2015", "Interview Descriptions": "1) Online CV and a few questions to be filled, 2) A phone interview from the head of the team in which I was supposed to talk about my motivation for the job and answer how I would write the report if I were assigned to study a company/donor. 3) Last stage is a written test that can be done remotely but has to be sent within the designated time interval in which I was given a company profile and had to find the relevant information regarding any misconduct/lawsuits of the company and to write a short report.", "Interview Questions": "1) Motivation, 2) I give you a company name and want you to write a report on it how will you conduct it?"}, {"date": "10 Jan 2015", "title": "Emergency Preparedness Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme in Oct 2014", "Interview Descriptions": "Applied online and got an email that I would have a phone interview in a month (and this was already a month after I'd applied).  After interview I heard back within a few weeks.  The whole process took about 3 months. They looked at my college classes to make sure that I was properly prepared for this type of interview.  Before the interview I was given a take home assignment to complete that would be discussed in addition to the interview.  The assignment was a little confusing but I managed to complete it almost entirely correctly and they were impressed that I was able to figure it out.  During the interview they asked about my past experience and I if I already knew about the computer programs that would be used during the internship.  Overall they were very nice and the interview was pretty straight forward.", "Interview Questions": "How my past experience could be applied to this new position. "}, {"date": "31 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Food Programme", "Interview Descriptions": "I applied online and the process took 2 months. Upload my CV on the website, and after couple of months I got an email and we set a phone interview. I had to present myself, demonstrate how my experience and knowledge match the duties and also explain why I had applied to that position and company.", "Interview Questions": "Nothing special. I was asked to demonstrate specific knowledge vital for that position."}, {"date": "18 May 2016", "title": "Programmer Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at World Food Programme (Rome) in Oct 2012", "Interview Descriptions": "In my case, the process involved an HR officer and a supervisor, and took one hour face-to-face.The people were nice and approachable and the situation was more like a conversation. They did use a competency based approach whereby you had to talk through situations, your ways of dealing with them and the results.", "Interview Questions": "Can you tell us what you know about the WFP school feeding programme?"}, {"date": "30 Aug 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at World Food Programme (Rome) in Dec 2010", "Interview Descriptions": "Upload my CV on the website, and after a few day, I've been called. The interview was average, behavioral  questions and the atmosphere was peasant. At the end of the interview they asked me if I wanted to join the organization", "Interview Questions": "Nothing weird, strengths, weakness, previous jobs..."}, {"date": "21 Sept 2010", "title": "Software Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Food Programme (Rome) in Aug 2010", "Interview Descriptions": "I applied online for an advertised vacancy. They were quite quick at advising me of reaching the shortlist, which is unusual for the UN. Most of the HR processes were surprisingly quick.\r\n\r\nFirst I had to do a language test in a WFP official language other than English. Or you have to provide evidence of some kind of certification of your language level. I had no such certification so I signed up for a test. \r\n\r\nLittle information about the test was provided beforehand. Basically though an external firm was given my phone number and a time to call, which had been agreed with me.  They called almost an hour late however. The test was conducted purely over the phone, so it could only focus on listening and speaking ability - the former particularly not being a strong point for me. The tester would ask a question and you would respond to it. Many of the questions were hypothetical (what would you do if you were outside and it started raining and you had no umbrella? how would you describe the sea to someone who was blind?) and others practical (what will you be doing in 10 years? what did you do on the weekend?). The idea is to make you use various pieces of grammar (conditional, future etc) and also to test if you understand the questions. The language test lasted probably around 20+ minutes.\r\n\r\nI struggled a fair bit, but the level required obviously depends on the job and the job I was going for probably did not require a high level. I am at about B1 level in this language and managed to get to the interview stage.\r\n\r\nI then was invited to interview in person in Rome at their HQ, with the option of a phone interview instead if I preferred. I went to Rome. I organised the transport and hotel myself, but I was later reimbursed (keep your receipts!).\r\n\r\nThere were 3 people in the interview - pretty standard in the UN system. The interview started 5-10 minutes late, although one of the panel members turned up only after another 10 minutes or so.\r\n\r\nI got the impression that the panel members were not serious and that this was not an open recruitment exercise. Two of them constantly checked their Blackberries during the interview, with one even writing up an email (presumably) during it. This is annoying enough in a meeting, but during an interview it was insulting and lacking in professionalism.\r\n\r\nThe rest of it went OK, taking about 45-50 minutes consisting of Q&A from both sides. There were no especially tricky questions, but I got the clear impression there was a hole in my CV that meant I would not get the job. I assume that HR must have done the shortlisting, rather than panel members.\r\n\r\nMy overall impression was poor due to the Blackberry checking. I was left with a sour taste in my mouth regarding the organisation.\r\n\r\nAs a final sign of this, the position was then re-advertised on the internet without the organisation even having sent me any feedback on my interview. I guess that acts as the rejection email in their eyes!", "Interview Questions": "How much of your work time would you like to be taken up with technical work?"}]]