[[{"date": "16 Mar 2023", "title": "Officer, HQ Programs Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Medical Corps", "Interview Descriptions": "The interview process was fairly straightforward. After submitting my application, I had two phone interviews - one with HR and the other with the hiring team. Both went well and the questions raised were as to be expected. The people were very nice!", "Interview Questions": "How do you work with country offices? What are your priorities?"}, {"date": "7 Feb 2023", "title": "Medical Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Medical Corps", "Interview Descriptions": "Interesting interview with questions focus on background and understanding of current healthcare issues. Interviewers were engaged into conversation. Provided detailed job description and ensured understanding and compliance with every requirement.", "Interview Questions": "Q: What are 3 current main healthcare concerns in country X?"}, {"date": "2 Feb 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "Never got back to me to say I had or had not got the job after 2 rounds of interview and an extensive timed written test. Felt the interview went on the whole ok, not obviously bad or good.", "Interview Questions": "Written test to fill out a logframe"}, {"date": "31 Dec 2022", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "From simple to complex issues focussing the posted vacancy and objectives. More focus on each responsibility and job descriptions. Focus on each main tasks and compare with actual experience. Personality and language skill with confidence.", "Interview Questions": "Your knowledge about PSEA and reporting mechanism"}, {"date": "28 Mar 2022", "title": "Program Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "classic with a panel of four recruiters.\r\nThere was a written test before the interviews.\r\nThere was a phase on my motivation and my previous experience.\r\nAnd then a technical phase of interview with 2 program managers", "Interview Questions": "Why do you think you'll do well at this job?\r\n"}, {"date": "10 Feb 2022", "title": "Marketing and Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "Very chill. Consisted of initial resume and cover letter screening, first round video interview, then final interview and offer. The people here are chill and are looking for interns' help, so the process was not intense.", "Interview Questions": "How did you hear about international Medical Corps?"}, {"date": "25 Jun 2021", "title": "IT ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "Applied through a provided email.\nWas called for a technical written test\na week later was called for an oral interview\nwithin 2 weeks was contacted with job offer\nThe interview panelists were fair and had simple questions", "Interview Questions": "Define Active directory, OU , Group policies "}, {"date": "18 May 2021", "title": "MEL Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "HR ghosted me after the interview invitation.\n\nHR sent me an email that they were considering me for the MEL Coordinator job I applied for in their organization, which I confirmed my availability for the interview. Sadly, HR never replied to that email nor call me on the day I proposed for the interview. I was, still am devastated. I wrote the HR following up emails, texted on Skype , follow the HR on Linkedin .. all one can do without success. This was 1 month ago, I still don't know what happened to that interview, but life has to go on. I hope there was a technical issue and they weren't being unproffessional.", "Interview Questions": "Didn't get the chance as explained above, I got stood up."}, {"date": "30 Nov 2022", "title": "Logistics Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Medical Corps (Split) in Apr 2021", "Interview Descriptions": "Very easy, and we mostly talked about the job position and my CV. What is this job all about, and will I be available for traveling on field missions. We were talking about mine and their expectations.", "Interview Questions": "When am I available? Why do I think I'll be suitable for this position? Salary expectations? How to handle people with \"hard personalities\" at the workplace."}, {"date": "12 Aug 2021", "title": "Officer, Resource Development – Grants and Reporting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at International Medical Corps (New York, NY) in Mar 2021", "Interview Descriptions": "I was short listed for a 30 minute HR video interview and the process was fine. Afterwards u sent a follow up email thanking the interviewer and asking more questions and never heard back. No rejection  email or any form of communication.", "Interview Questions": "General: tell me about yourself, why do you want to work in this position. "}], [{"date": "18 Feb 2021", "title": "Program Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at International Medical Corps (Erbil) in Feb 2021", "Interview Descriptions": "Written test for like 3.5 hrs first, it took almost a week before they reached back to the us (candidates) again for the F2F Interview . At first we were like 7 candidates and only those who got higher score were like 3-4 applicants invited for second phase and last stage of the hiring process.", "Interview Questions": "Write a Concept Note based on a given scenario."}, {"date": "21 Jan 2021", "title": "Desk Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at International Medical Corps", "Interview Descriptions": "Structured as a standard interview - nothing out of the ordinary or surprising. Questions were as expected and relatively easy to address. Overall, learn the company and the work and why you’re interested in the position.", "Interview Questions": "Why are you interested in working here?"}, {"date": "2 Jan 2020", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at International Medical Corps (Monrovia)", "Interview Descriptions": "the interview process was very fair and transparent, it was done accordingly to the advertisement; the interview was social, administrative and personal, the process started with evaluation test / writing test and oral interview, after the oral interview and offer, the recruitment process was concluded with Training  and self examination and i started the job in August of 2015", "Interview Questions": "What are in interested in working with International Medical Corps"}, {"date": "7 May 2019", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at International Medical Corps", "Interview Descriptions": "Test and panel interview. Was contacted by HR over the phone asking a couple of logistical questions and then inviting to carry out the test and interview. Overall the process was fine, panelists were nice", "Interview Questions": "General role specific questions. "}, {"date": "17 Jan 2023", "title": "Logistics Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at International Medical Corps (Split) in Feb 2019", "Interview Descriptions": "Pleasant interview in English language with heads of HR and Head of the department, lasting around 30 minutes, together with test of computer and Microsoft Excel skills. Atmosphere was tense free.", "Interview Questions": "Excel testing in addition to verbal questions"}, {"date": "3 Feb 2021", "title": "Senior MEAL Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at International Medical Corps (Addis Ababa) in Feb 2019", "Interview Descriptions": "The interview were conducted with HR, Technical MEAL staff and project managers physically. The technical questions were raised by MEAL manager and project manager and the HR related questions were raised by HR staff. After that different questions also raised using phone call.", "Interview Questions": "What are the major dimensions of data quality during project monitoring?"}, {"date": "4 Nov 2022", "title": "Nutrition Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at International Medical Corps (Maiduguri, Borno) in Oct 2018", "Interview Descriptions": "The oral and written interview process was fair and both happened the same day. The questions for the written test were basically technical questions for the role and a few gender questions", "Interview Questions": "Why do you want to work with us"}, {"date": "14 Feb 2022", "title": "Finance Manager and Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Medical Corps (Ankara) in Feb 2018", "Interview Descriptions": "In case they need you, interview takes only 5 minutes taking questions on the phone. I was hired for a very critical position just after 5-10 minutes taking interview. HR staff are very good and they do their best to select a good candidate however high level managers do fail during selection process.", "Interview Questions": "The interview questions were very simple for me. Especially HR Coordinator position questions. Because hiring manager was unaware of Human, Humanity, Ethics, cose of consucts and core principles. "}, {"date": "23 Apr 2022", "title": "Registered Midwife Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at International Medical Corps (Jordan, AR) in Jan 2018", "Interview Descriptions": "General questions about the midwife then case type of questions normal and complicated cases how you manage situation and best solutions you will take\r\nGenerally questions about if  a pregnant woman with gestational hypertension or DM \r\nAntepartum hemorrhage and medications that are taking", "Interview Questions": "Advanced Life Support in Obstetrics\r\nNormal cases \r\nComplicated cases "}, {"date": "3 Jun 2021", "title": "Programme Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at International Medical Corps (London, England) in Dec 2017", "Interview Descriptions": "Three stage interview. First with an HR person, second with a Programme HQ person and third with the In-Country Manager. The first two interviews were one to one, straightforward. The third interview was a panel.", "Interview Questions": "Why do you want to work for them?"}], [{"date": "18 Aug 2017", "title": "Emergency Roster Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Medical Corps", "Interview Descriptions": "I applied to a few positions with IMC online and never got a response. After networking with several people I was given the contact information for someone in HR. We emailed back and forth a few times and then scheduled a phone interview where she explained I did not have enough specific first response/emergency aid experience  for the jobs that I applied to. She said due to my other skills and experience (about 5 years of public health work in several African countries) that she would push my application to the hiring manager to get me into a program management or evaluation position, and that I could work my way into an emergency sector job. She told me the manager was out of the office for a week and to email her the following week for an update. I emailed her 4 times and sent two linkedin messages but she never responded. I was ghosted and never understood why, as she had seemed genuine on the phone.", "Interview Questions": "asked me to elaborate on my program management and evaluation experience"}, {"date": "6 May 2019", "title": "Finance/Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at International Medical Corps (Nairobi) in Apr 2017", "Interview Descriptions": "It was a simple phone call that ended with the offer being made unofficially. I letter was asked to go pick the physical contract and accept if the terms suited me. I took it. It was the best working experience for me to date.", "Interview Questions": "How I intend to be of impact to their objectives. "}, {"date": "15 Jan 2016", "title": "Logistics Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at International Medical Corps", "Interview Descriptions": "took two month to get interview, after calling people from inside to push my CV, HR contact me and I replied and added her on Skype, and she didn't respond for a week. then she talked with me and said my qualification meet their requirement, asked for the title or place of the job and she said Africa but doesn't know where. after two weeks got interview with senior person who asked me what is my profession and had no idea about my CV. after a week I sent an email to him and he said the position cancelled because of financial constrains. replied immediately and asked about a position just opened on the website and he replied we have picked a person for this one", "Interview Questions": "what are your dream?\r\nwhere do you see yourself in five years?\r\nWhat's your profession? \r\nTells us about you work experience?"}, {"date": "31 Jul 2015", "title": "Senior Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at International Medical Corps", "Interview Descriptions": "There wasn't clear articulation of who was making the final decisions on salary -HR or the hiring manager/department.  There was no disclosure of salary range, and what was shared as the max was not in fact the max possible. Could tell that HR interviewer was trying to rush thru benefits and portray the benefits as better than they were. The whole process with HR made me feel steam-rolled.", "Interview Questions": "Can you explain a bit about your experience working in emergencies or developing countries? "}, {"date": "10 Jul 2015", "title": "Emergency M&E Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at International Medical Corps (Washington, DC) in Jun 2015", "Interview Descriptions": "The interview process was fairly smooth; I did 3 interviews, an initial screening, a generic discussion with the country team and a technical test. The screening lasted 15 minutes and questions were concise yet demanding very technical issues. The interview with the country director was about an hour long and questions were related to a variety of inter-personal, personal, technical and development competences. The technical test lasted about 1h and 40 minutes and was only related to technical issues.", "Interview Questions": "The technical interview was easy and it contained the typical M&amp;E questions about setting up an M&amp;E system while dealing with local challenges as well as explanation of qualitative and quantitative methodologies."}, {"date": "25 Jan 2016", "title": "HR-Admin Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at International Medical Corps (Kilis) in Jun 2015", "Interview Descriptions": "Very straight forward. Then started with a 10 minutes phone interview, followed by inviting me to the official interview which I did over Skype. There was a panel asking some questions related to the position in addition to behavioral questions \r\nReceived the offer one week after", "Interview Questions": "Most questions were about previous job experiences and some were related to behavior\r\nnothing complicated"}, {"date": "15 Apr 2015", "title": "Resource Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Medical Corps", "Interview Descriptions": "The interview began with a basic phone screening which eventually lead to an on-site interview with a few members from the department team a  couple of weeks after. The questions were basic and the interview was fairly easy going. I did notice that the interviewers seemed bored with me before they even asked me questions which leads to believe they already had a candidate in mind and left me with the sense that I wasted almost 2 hours of my time.", "Interview Questions": " Both the screening and the following interview were similar in regard to the questions i.e. why are you interested, strengths, weakness etc."}, {"date": "3 Jun 2015", "title": "Finance Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at International Medical Corps (Los Angeles, CA) in Feb 2015", "Interview Descriptions": "The interview was very structured and relevant to the position. The process very long, I was interviewed by multiple people from different office who did not communicate with each other. I was throughly drilled on my knowledge of excel by one interviewer in the DC office. At the time of salary negotiations (LA office) I  was asked to take an excel exam. I was told this was to justify my asking salary because they did not know  my skill level. \r\n\r\nThere was clearly a lack of communication between the two offices.", "Interview Questions": "Dealingl with office politics and power struggle."}, {"date": "13 Jul 2015", "title": "Porgram Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Medical Corps (Canberra) in Dec 2014", "Interview Descriptions": "Incredibly rushed. I filled out an email questionnaire that was generic that they must have sent anyone who applied. My \"technical interview\" was with a lovely doctor who was very freindly however had zero to do with the position or project I was interviewing for.", "Interview Questions": "Why do you want to work for IMC? How will you manage living in a stressful environment."}, {"date": "19 Dec 2015", "title": "Logistics Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at International Medical Corps (Washington, DC) in Nov 2014", "Interview Descriptions": "Took about two weeks after you apply, after that you go through a HR screening, with HR screening you are then asked for someone technical to contact you, four days down the road you get contacted and ask technical question.", "Interview Questions": "Do you have any warehousing experience?"}], [{"date": "17 Jun 2014", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at International Medical Corps in Jun 2014", "Interview Descriptions": "I was called out of the blue for an interview and so didn't have time to prepare. The questions were all standard interview questions - your strengths/weaknesses, why you want the job.", "Interview Questions": "The questions were all expected, but the timing of the interview was unexpected."}, {"date": "25 Aug 2013", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at International Medical Corps", "Interview Descriptions": "There was really nothing remarkable about the interview process. The standard questions were asked: what is your experience in program management? Tell me about your conflict management skills? What have you done in terms of reporting and which donors have you worked with? Have you worked with proposal development. Very generic questions. However, as this was a field position, I had the entire interview conducted in the working language.\r\n\r\nI was really caught off guard by the interviewer, who seemed rushed or uninterested. I honestly did not think that I would make it to the second round! He asked me if I had any questions regarding the organization, and I asked for more details about the structure, after which he chuckled and said that I didn't really get the way IMC worked (this was my first interview, and no organizational chart was available online). The second question I asked was about the activities, and he said \"voila!\" like I had asked the \"correct\" question. Then after he answered the question, said \"nice talking to you\" and quickly hung up. No \"do you have any other questions?\" or explanation of the next steps. i was left very confused.", "Interview Questions": "None- just be prepared to provide examples."}, {"date": "26 Sept 2015", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Medical Corps (London, England) in Mar 2013", "Interview Descriptions": "Competency based questions focused on ability to manage projects, navigate office dynamics and knowledge of humanitarian sector areas.  The interview started as a one on one interview with a line manager, later a Director of Operations joined.  Overall the process was straight-forward, the interview questions were not challenging and the atmosphere was friendly.", "Interview Questions": "How would you describe the role of IMC?"}, {"date": "19 Dec 2016", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at International Medical Corps (New York, NY) in Sept 2012", "Interview Descriptions": "I applied for a position online, the head of the department reached out to me.  Did a phone screening and then met with the team for an in-person check-up half way through the project.", "Interview Questions": "1) Are you able to complete the project, 2) What would be the timeframe to do complete and 3) How many hours are you able to commit?"}, {"date": "11 Nov 2015", "title": "Various Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at International Medical Corps (Washington, DC) in Mar 2012", "Interview Descriptions": "If you are already employed by the company, the interviews tend to be a mere formality. They value that you know and won't question the questionable systems and hierarchy more than anything.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "8 Jul 2012", "title": "Business Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at International Medical Corps (Damascus) in Dec 2011", "Interview Descriptions": "i got a phone call from telecommunication company in this phone call they asked me to talk about my self for 1 minute in English, then the person on the phone arranged an interview with me in the main building \r\nthe interview had 3 processes  \r\nfirst processes it was computer skills and microsoft office test \r\nthen i had English test and the final interview was 1:1 interview", "Interview Questions": "unexpected question\r\n do you have any kind of phobias ? "}, {"date": "10 Oct 2015", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at International Medical Corps (Los Angeles, CA) in Sept 2011", "Interview Descriptions": "Met three of IMC's Executive Officers.  We sat around a table, and discussed IMC's need and my capacity to do those expectations.   I thought it went very well, given my previous background experience and what IMC was looking for.", "Interview Questions": "Details on my work history background, and how I could best do the job working both at Headquarters and overseas.  Nancy Oessey was a dictator, she ran show for the headquarter staff of approx. 8 at that time, with the same amount working overseas at his its work sites in the developing world or those countries facing political / military friction.  I was able to answer all the questions asked, while asking them of their revenue for field work, what kinds for work activities they preform, what countries are they working in, and how the logistically, and financially provide for their programs, means of transportation, and housing.  A content employee, is a good employee in what they do!  Thank you."}, {"date": "22 Oct 2009", "title": "Grants Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at International Medical Corps (Los Angeles, CA) in Jul 2009", "Interview Descriptions": "I just met with the manager and he we talked for about 30 minutes.", "Interview Questions": "What was the hardest thing you have faced in a past job?"}]]