[[{"date": "N/A", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC", "Interview Descriptions": "The interview was very straightforward based on experience and the interviewers were nice and made me comfortable during the whole interview. pretty fast response, they will answer all questions you might have.", "Interview Questions": "what experience do you have why I left my last job"}, {"date": "16 Jun 2023", "title": "EMR Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Keck Medicine of USC (Los Angeles, CA)", "Interview Descriptions": "3 Interviews. 1st with recruiter/hiring manager. 2nd with department colleagues. 3rd with department manager. Behavioral and skills related questions specific to EMR experience. Lots of questions related to 'what would you do in this scenario:...'", "Interview Questions": "Tell us about a time you had an issue you couldn't solve with a Wiki page"}, {"date": "6 Mar 2023", "title": "LVN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "Half hour zoom interview with clinic manager and lead supervisors. Interview was straightforward with experience questions and past experience. Very professional and managers were genuine and easy to talk to", "Interview Questions": "Explain a time when you had difficulty communicating with the MD"}, {"date": "10 May 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Mar 2023", "Interview Descriptions": "Unprofessional. 2 rounds of interview: one with the department head and one panel interview with the set topic of presentation and then round of questions from the present (around 5-8 people in total). All questions originated from STAR technique (soft skills predominantly) and none one simple question regarding my actual knowledge was asked. No response after the interview whatsoever. I followed up with the HR but was entirely ghosted.", "Interview Questions": "STAR based questions: Provide example of a situation with difficult employee and how you dealt with it."}, {"date": "24 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "Begins with a phone screen followed by in person interview with nurse manager, if they like you then you get to meet the director and will have a short interview with them also.", "Interview Questions": "Why are you a good fit for this job?"}, {"date": "24 Mar 2023", "title": "UX-UI Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at Keck Medicine of USC in Jan 2023", "Interview Descriptions": "Intro call with recruiter, video call with panel of interviewers (IT team), assigned a design challenge and given a few days to complete it, video call with same panel to discuss design challenge", "Interview Questions": "Q: Do you have any hi-fidelity works we can look at now? If not, can you present some by the next interview call? Q: Who is the persona you are focusing on? Age range of your users? Q: How will you ensure user safety?"}, {"date": "8 Nov 2022", "title": "CLS I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "Preliminary online assessment that generates a talent card. Pretty subjective, but simple questions asked. I believe they are essentially looking for personality traits. Asks you to answer honestly. Some questions repeat themselves to avoid overthinking.", "Interview Questions": "Online assessment, generating a Talent card."}, {"date": "21 Oct 2022", "title": "Programmer Analyst II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Keck Medicine of USC in Oct 2022", "Interview Descriptions": "The interview process was a 2 step interview process. Both took place over zoom and both had multiple interviewers. The first interview was pretty technical, and the second interview was mostly a \"best fit\" interview.", "Interview Questions": "What is a challenge or conflict you’ve faced, and how did you deal with it?"}, {"date": "3 Dec 2022", "title": "Administrative Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Oct 2022", "Interview Descriptions": "The interview process was a series of 8 or so half hour interviews with different members of the c-suite. Each had their own questions to ask and was managed very well.", "Interview Questions": "Tell me about some of your weaknesses?"}, {"date": "10 May 2022", "title": "Therapist, CMHC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keck Medicine of USC", "Interview Descriptions": "The interview process was overall very thorough. It consisted of three interviews all with various staff with CMH. The first interview was with both clinical directors. Then upon review, they will offer you to do two additional interviews one of which is a case presentation.", "Interview Questions": "How did you incorporate culture into your treatment? "}], [{"date": "8 Mar 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "Nicely organized interview process with appropriate interviewers assigned for subject of interest. Very open to talk about future prospects and past student placements. Professors seemed to listen to what I was saying rather than just trying to spend time.", "Interview Questions": "Why did you choose USC?"}, {"date": "21 Dec 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Mar 2022", "Interview Descriptions": "I got a call from the ambulatory float pool director and accepted an interview. The interview was on Teams which is similar to Zoom. It was a panel of 8 people. They all asked me questions regarding my experience and also scenario questions. It lasted about 30 minutes. They made me feel comfortable and welcome.", "Interview Questions": "•What would you do if a patient has been waiting in the lobby for 30 minutes and you’re the only MA assisting 3 doctors? with no other MAs or nurses around •Do you know what Telemed is? If so what is it and how does it work? •what would you do if your coworkers don’t want to help? •How would you deal with an upset patient? How would you handle it? Would you notify your supervisor? •what are the normal ranges for BP?"}, {"date": "18 Feb 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "You fill out a form and application and do a bunch of paper work and then you have to attend an orientation. Simple, tedious, but it took a while for them to get everything through before I actually started to volunteer at Keck.", "Interview Questions": "Why do you want to be a volunteer?"}, {"date": "5 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "They called me 2 days after I submitted my online application and scheduled me for an interview few days far with the director and possibly the charge nurse or nurse manager", "Interview Questions": "N/A"}, {"date": "3 Mar 2022", "title": "Medical Assistant Float Pool Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "I applied in May 2021 and got an interview February 2022. Once I received the call from the recruiter she scheduled me for a zoom interview with 5 other recruiters. All 5 recruiters asked me interview questions, so it was a group Interview. They ask Very basic questions. They all made me feel comfortable and confident.", "Interview Questions": "1.) what does quality care mean to you?\r\n2.)  What do you know about USC?\r\n3.)  how would you room a patient?\r\n4.) If you need assistance from a nurse and the nurse is busy how would you handle that? "}, {"date": "25 Nov 2021", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keck Medicine of USC", "Interview Descriptions": "It was a panel interview with the team, and all the questions asked were relevant to the job posting. The parking instructions ended up being differently from what it actually is at the parking lot, so that was a bit stressful before the interview.", "Interview Questions": "Tell us about yourself.\nWhat is your experience with SPSS?"}, {"date": "20 Jun 2023", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC (Las Vegas, NV) in Nov 2021", "Interview Descriptions": "The interview process consisted of two interviews. One virtual interview with one individual on the leadership team and a second in person interview with three leadership team members. After the first initial virtual interview, there was very little wait time before receiving a notification of interest for the second in person interview. I was provided with all necessary information such as the meeting location, meeting date and time and whom I'd be interviewing with on the day of the second interview.", "Interview Questions": "What interested you the most about this position?"}, {"date": "19 Oct 2021", "title": "Director, Digital Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC", "Interview Descriptions": "The interview process was pretty standard for this type of role: recruiter phone screen followed by in-person interview. Hiring manager seemed to be going through the motions somewhat, otherwise everything was normal.", "Interview Questions": "What do you consider your strengths?"}, {"date": "13 Oct 2021", "title": "Operations Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Keck Medicine of USC", "Interview Descriptions": "Three rounds of interviews and an assignment. this process took atleast two months. there was a background check and drug screening as well. was an overall good experience though. The company takes its time picking quality people.", "Interview Questions": "They wanted to get to know me as a person "}], [{"date": "16 Sept 2021", "title": "Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "Interview with the supervisor was straight forward, asked behavioral questions mostly related to job description and how past experiences relate to the position. Asked a great deal about the experiences to get a sense of your skills.", "Interview Questions": "How does your past work experiences relate to this position?"}, {"date": "30 Jul 2021", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "Few calls with the lab members and then the PI reached out to me for a chat. Simple experience overall. Took a month or so to get hired but the communication was there.", "Interview Questions": "Describe your past research experience."}, {"date": "17 Jun 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "it was a pleasant process.  detailed with job description and expectations, but qualifications were high.  interviewer was easy going and upfront about if I'd be qualified enough to get the job", "Interview Questions": "what skills do you have in this field?"}, {"date": "2 Jun 2021", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC in May 2021", "Interview Descriptions": "The interview was more detailed towards statistical programming and less towards the healthcare curriculum. There were research situations provided for which analysis was to be done. More insights were asked on the models used previously in the projects and assignments. Survival and longitudinal experience were also measured.", "Interview Questions": "What are the statistical packages and models you have experience working with?"}, {"date": "15 Apr 2021", "title": "Senior CRA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC", "Interview Descriptions": "Very thorough and professional. We discussed my experience and requirements if hired. I was given insight into what they are looking for and how i would be a fit. I look forward to hearing from them. Thank you.", "Interview Questions": "What are my long term goals with this job and clinical research?"}, {"date": "13 Apr 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Mar 2021", "Interview Descriptions": "It was a Zoom interview with the nurse manager and hiring manager. Both were very polite and I enjoyed the interview process. I was very nervous at first but they made me feel comfortable.", "Interview Questions": "How I handle a conflict\nHow to handle criticism\nWhy do I want to work there "}, {"date": "3 Feb 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Keck Medicine of USC", "Interview Descriptions": "The process was fine. Did not ask too many technical questions and it is more behavioral. The interviewer was quite nice and the working environment is great. I think it is a good place to work at.", "Interview Questions": "my experience, why Keck, imagine me in the future, and why I am good for Keck."}, {"date": "8 Dec 2020", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Keck Medicine of USC", "Interview Descriptions": "There are about three or four rounds of interviews. The interview is not very hard overall. But the Keck medicine expect people are having experience in the Health care system.", "Interview Questions": "Why do you want to work here?"}], [{"date": "1 Nov 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Keck Medicine of USC (Los Angeles, CA)", "Interview Descriptions": "I applied on the USC job page and received an email from someone in the department several weeks later. I was invited onsite for an initial 2:1 interview and an Excel skills assessment. Weeks later, I received another invite to come back for another 2:1 onsite interview.\r\n\r\nThe first set of interviewers were great. They were genuinely friendly and passionate about the work they do.  However, I can't say the same thing about the hiring manager. He was late to the interview, yawned throughout, and even picked up his phone halfway. I knew early on that I did not want to work under this guy and was glad the position went to someone else.", "Interview Questions": "How do you handle politics?"}, {"date": "20 Aug 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Keck Medicine of USC (East Los Angeles, CA) in Apr 2018", "Interview Descriptions": "the interview process was very comfortable. the two individuals were extremely nice and attentive when asking questions. the interview was professional, had i further researched (lol) the position i think i could have had better answers for the panel.", "Interview Questions": "why did you apply to usc?"}, {"date": "6 Dec 2017", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Keck Medicine of USC", "Interview Descriptions": "I was asked to come in on very short notice was told that I would be hearing back in the next week and never did. The interviewers were very unprofessional and asked only 1 question.", "Interview Questions": "Why were you interested in your major?"}, {"date": "28 Oct 2017", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Keck Medicine of USC", "Interview Descriptions": "I applied online for several positions, received a call back3 weeks later asking what was my schedule and job schedule preference, and was scheduled for an interview one week later. The interview was a job fair with several candidates scheduled at the same time and ultimately, having an interview in a desk with two other interviews having a separate interview.", "Interview Questions": "Tell me about yourself."}], [{"date": "30 May 2017", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC in May 2017", "Interview Descriptions": "I had two negative experiences interviewing at USC.  If the institution has set protocols for hiring, they do not make sure the research PIs follow them. \r\n\r\nIn one case, the hiring manager seemed to like me but wanted me to complete lengthy on-campus training courses and work a \"trial period\" in her lab lasting several weeks without pay before she would extend me an official job offer.  I did not feel comfortable going along with that plan, so I withdrew my application.\r\n\r\nIn the second case, I received a job offer from another lab detailing the pay, hours, and expected start date.  But the PI did not send me information on the health insurance and benefits at USC, so I asked him to send them to me before I made my decision.  He did not respond and I had to ask again two days later, at which point he sent me the benefits information but seemed very irritated in doing so.  That same day, after I looked over the benefits, I told him that I accepted the position and was looking forward to starting.  Several days passed with no updates from him, so I called him and emailed him asking when I could start the background check.  When he finally got back to me, it was to tell me that he had hired another candidate instead and was not interested in my application.  It seemed like I dodged a bullet because I do not want to work for someone who treats potential coworkers that way, but I don't know why he stopped responding to my communications promptly and hired someone else after I accepted the position, other than that he became annoyed when I asked for more details about the job instead of accepting the position right away.  No one should ever expect someone to accept a job without knowing what benefits were offered.\r\n\r\nI think USC Keck HR should audit how research hiring managers are interviewing and on-boarding new employees.  I wonder if the person who accepted the job in the first lab I interviewed for really did have to work for several weeks without pay.", "Interview Questions": "Why do you want to work as a lab tech instead of pursuing a PhD?"}, {"date": "2 May 2017", "title": "Clinical Research Data Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Apr 2017", "Interview Descriptions": "Applied on company's website. Almost a month later I got a email requesting an in-person interview for the following week. A majority of the time the interviewer talked about the job responsibilities. Following week received an email that I was not selected for the position.", "Interview Questions": "Tell me about yourself. What are your career goals?"}], [{"date": "13 Jul 2015", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Keck Medicine of USC (Los Angeles, CA) in Jul 2014", "Interview Descriptions": "Interviewed by a panel of qualified professionals in my field at the hospital.  Everyone was exceptionally pleasant providing honest pros and cons to that specific unit.   Really enjoyed the process and interactions.", "Interview Questions": "Why I want to work for the hospital."}, {"date": "10 Nov 2014", "title": "Patient Experience Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Keck Medicine of USC in Apr 2014", "Interview Descriptions": "First round interview was very easy. They were more interested in why you want to work within patience experience, and your background coming into the internship. The interview took place on campus.", "Interview Questions": "N/A"}]]