[[{"date": "7 Jul 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health (Sunnyvale, CA)", "Interview Descriptions": "Interview was easy took a month to hear about outcome. Benefits are tricky it said in pto 28 days but it included clinic holidays (i.e Christmas thanksgiving) those need to be accused to use which was tricky wording that was the reason I did not take job", "Interview Questions": "experience and scenarios specific to specialty"}, {"date": "7 Jul 2023", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Stockton, CA)", "Interview Descriptions": "The interview process went smoothly. Two people interviewed me at the same time and asked questions I expected and was prepared to answer. No curve ball questions. Was called the next day and offered the job.", "Interview Questions": "Give us a one minute elevator speech explaining why we should hire you."}, {"date": "22 May 2023", "title": "Transitional Care Associate  Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sutter Health", "Interview Descriptions": "Pleasant and thorough interview process, described the needs of the department, job duties and requirements on the floor. Personal and professional process - as to be expected. Application was thoroughly reviewed and went over with the interviewer.", "Interview Questions": "They asked about my flexibility of schedule and how much I would be available nights and weekends."}, {"date": "15 May 2023", "title": "Budget and Coverage Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health (Oakland, CA)", "Interview Descriptions": "Initial introduction was done via phone. Very personable and transparent. In person, interview was with the team and questions were in line with job description. Follow up questions were specific to the department and they also provided some relevant information.", "Interview Questions": "What was your past experience as it relates to the job? Tell us about yourself Do you see yourself fitting with the team?"}, {"date": "11 May 2023", "title": "Medical Assistant Per Diem Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Roseville, CA)", "Interview Descriptions": "As a transgender woman I put on my resume my legal name which is a boys name exclamation marks the name of my preference Sutter healthcare has denied every single application without a interview or phone call at the very least they are transphobic and discriminatory if your lgbtq+ It’s unlawful to discriminate and can be reason to proceed legal action", "Interview Questions": "Mr hey never offered a single phone call or interview"}, {"date": "8 May 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Fort Smith, AR)", "Interview Descriptions": "Easy interview on zoom. Had to reschedule, which was gonna problem. Received an offer a few days later after the interview. The pay is quite decent for my first time working from home.", "Interview Questions": "Scenario based questions for interview"}, {"date": "20 Apr 2023", "title": "Chief Marketing Officer (CMO) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "Tough with very direct questions that challenge the person. Long conversation on direction in Healthcare industry and ethics. Very enlightening, friendly. Good looking workspace. Love the benefit package and the vibe of the office as I walked through.", "Interview Questions": "Where did I think the provision of value based care was going within health system models."}, {"date": "14 Apr 2023", "title": "Asset Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "The interview process was straight forward and the Interviewing staff was good. They asked relevant questions and kept it under 20 minutes. Everyone was excellent and well-informed about my background.", "Interview Questions": "Tell me about a time you had to deal with a difficult situation."}, {"date": "3 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Antioch, CA)", "Interview Descriptions": "Easy going with ED director, common triage and prioritizing questions. Able to ask questions at end of interview to get a better idea of the department. Interview was done via zoom.", "Interview Questions": "Tell me about yourself and why you want to work here."}, {"date": "2 May 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Antioch, CA) in Apr 2023", "Interview Descriptions": "I submitted my application through the Sutter Health Careers website and was only contacted for one position. The hiring manager reached out to me via phone and email and scheduled a Zoom call for a week later. However, we experienced technical difficulties during the interview.\r\nThe hiring manager mentioned that staff interviews were still ongoing and that I should expect a representative to contact me within one to two weeks. Unfortunately, I have not heard back from them yet. While I believe I performed well during the interview, I am still waiting for a job offer to confirm this.", "Interview Questions": "What made you apply to Sharp? Define \"caring\" \"Tell me about the time...\" Clinical situations"}], [{"date": "7 Mar 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Mostly questions about personality. Situational questions asked also see how you handle certain things. Team work is key . Communication and skill. They want to know about certifications and school.", "Interview Questions": "Tell me about yourself? Tell me a time you had to pay attention to detail."}, {"date": "1 Mar 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "It was alright. I thought went really well in my pov. They told me they will call me and set a date to FT with the dr and over the weekend I get a email saying I was not chosen for the position", "Interview Questions": "What is your strengths and weaknesses"}, {"date": "1 Mar 2023", "title": "Claims Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "A panel interview of 4 people and they each took turns asking questions it was not too difficult. Heard back within 2 weeks and they offered the job. I started within the next two weeks after that", "Interview Questions": "My experience from other jobs"}, {"date": "29 Apr 2023", "title": "Patient Services Representative II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (San Francisco, CA) in Mar 2023", "Interview Descriptions": "The interview process at sutter health was one Phone interview then one zoom interview they just get to know you and tell you about the job to see if you will be a match", "Interview Questions": "what do you do at your current job"}, {"date": "17 Apr 2023", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sutter Health (Phoenix, AZ) in Mar 2023", "Interview Descriptions": "Interview was fantastic. There were a couple snags in the process, but the recruiter and the interviewer went out of their way to rectify the issue and move forward. I liked the way the interview was handled, and as a result, I will keep them in mind in the future.", "Interview Questions": "What is a difficult situation you handled at a previous job?"}, {"date": "4 May 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Sutter Health (Sacramento, CA) in Mar 2023", "Interview Descriptions": "Applied on March and received a call in April. I got the first interview was via zoom and 2nd interview in-person which went really well and was offered the job on the spot.", "Interview Questions": "Why do you want to work here? Tell me about yourself? Strengths? weakness?"}, {"date": "10 May 2023", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sunnyvale, CA) in Mar 2023", "Interview Descriptions": "Interviewed with a team of 4 people. They asked many questions about previous work experience as well as some personal. Overall the interviewers were very friendly and took the time to evaluate my candidacy.", "Interview Questions": "Tell us about a challenge you encountered and how you dealt with it."}, {"date": "4 Feb 2023", "title": "Clinical Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "There was an extensive phone screening and conversation, followed by a panel interview. Interviewers had a set list of questions to ask so it was more formal than I was used to. All managers were very nice and seem like they would great to work with. I am still waiting hear back.", "Interview Questions": "Tell us about a time you had to champion a tough change."}, {"date": "10 Mar 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Feb 2023", "Interview Descriptions": "Overwhelmingly large round table with everyone there, each participant asked a question but it was almost repetitive. This made the process difficult to try and reframe new answers for the same questions.", "Interview Questions": "Difficult situation at work and how you handled it"}, {"date": "13 Mar 2023", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health in Feb 2023", "Interview Descriptions": "Interviewer was warm and friendly. She was easy to talk to and transparent about the job. Appreciated the honesty and made me feel so comfortable. Welcoming and friendly. I appreciate how well I was treated during the interview", "Interview Questions": "What makes you stand out?"}], [{"date": "19 Jan 2023", "title": "Dietary Food Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "I was contacted over a month after submitting my application. The process was straight forward. I was perplexed when told it would take me 1 month to be brought on board", "Interview Questions": "Simply asked to recite my educational background & why I feel I fit the position."}, {"date": "16 Jan 2023", "title": "Business Intelligence Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "1st round is Interview with manager and other team members. 1 hour questions on SQL, experience and other related questions 2nd round is interview with the director and manager. Behavioral questions and experience related questions", "Interview Questions": "N/A"}, {"date": "31 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (San Mateo, CA) in Jan 2023", "Interview Descriptions": "Kind, easy, welcoming interviewers. They made me feel comfortable and acknowledged my talents. They wanted to know job duties and what a typical 8 hour day looked like. they said their unit was low acuity.", "Interview Questions": "Why did I leave my last job."}, {"date": "22 Dec 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "The interview process was through zoom. They had about 3 to 4 people in there either asking questions or observing. They asked a fair amount of questions and it lasted about 30-40 minutes", "Interview Questions": "what qualities do you have to contribute to the company"}, {"date": "10 Dec 2022", "title": "Business Intelligence Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "First round with HR and second round with the team. One of the interviewers was so aggressive and I do not know how she works in a team! If I get the offer, I would not join this team!", "Interview Questions": "Advanced SQL and Tableau Interview"}, {"date": "15 Nov 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (San Francisco, CA)", "Interview Descriptions": "Very friendly and charismatic staff. It seems like a family. They are all work together to provide excellent patient care. I got a chance to meet many member s of the team", "Interview Questions": "Do I like working in the operating room"}, {"date": "25 Nov 2022", "title": "Registration and Scheduler, Diagnostic Medical Imaging Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Palo Alto, CA) in Nov 2022", "Interview Descriptions": "I applied online the first week of November and heard back about three days after submission. Quick and easy interview process. Met with the department supervisor, who was very easygoing and lovely to speak with. She made it feel like a conversation with a friend throughout instead of an interview, which gave me good insight to how the department is run. The imaging coordinator was also present for my interview and spoke to me about casual things. Three business days later I received a call from HR with a verbal offer.", "Interview Questions": "Are you comfortable with a subject-to-change work schedule?"}, {"date": "24 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sutter Health", "Interview Descriptions": "Interview process was a panel of 4. Nurse director, 2 nurse managers, and educator. They had each person ask a question.  A week later I received the job offer and then the HR onboarding. All took about a month.", "Interview Questions": "Tell me about yourself \n\nName a time when you were involved in conflict and what did you do\n\nIf a patient is showing symptoms of increased HR, temp, what are your first thoughts? And what orders do you anticipate? \n\nIf you see changes in your patients rhythm what should you do first? \n"}, {"date": "18 Jun 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (San Francisco, CA) in Sept 2022", "Interview Descriptions": "The interview process started with an initial recruiter screen, virtual interview with the hiring manager, in person interview with senior leadership, and then an in person interview with peers. Many questions were focused on process and leadership qualities.", "Interview Questions": "How did you contribute to creating a supportive culture for your teams focused on continued improvement?"}, {"date": "21 Sept 2022", "title": "Customer Service Agent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sutter Health (Phoenix, AZ) in Sept 2022", "Interview Descriptions": "Received an informal call from the shift supervisor to discuss the company, role, and work environment. I was told at the end of the call that she was excited about me joining the team and how she felt I would enjoy working there. I was told that I would hear back from the recruiter within 1-2 business days. After a week and a half, I received an email that I was not selected for the position.", "Interview Questions": "I was asked if I ever worked from home and what shift I wanted. I was told I would be assigned to the shift I selected. "}], [{"date": "24 Aug 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Questionnaire and phone call , back round check and drug screen. I just applied so I am not sure of how the process works.  It would be great to know though", "Interview Questions": "Run of the mill questions "}, {"date": "26 Oct 2022", "title": "Diagnostic Medical Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Fremont, CA) in Aug 2022", "Interview Descriptions": "Quick telephone interview about background and then in person interview meet and greet with other ultrasound techs. There was also a Scanning interview as well to assess skills and techniques.", "Interview Questions": "What licenses I have and availability"}, {"date": "31 Aug 2022", "title": "Quality Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health in Aug 2022", "Interview Descriptions": "Very to the point and professional . There are 2 interviewers and only one round of interview.  The decision was made within same week which is good so doesn’t keep applicant waiting", "Interview Questions": "What was a time that you had to handle an upset customer?"}, {"date": "21 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "two rounds interview with the management team and staff, each  interview panel took one hour. Lots of questions are related to nursing practice. They had no job related person in the interview panel.", "Interview Questions": "why are you interested in this position?"}, {"date": "10 Jul 2022", "title": "Registered Nurse Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Site down on site face to face interview. I didn’t get the job because I had another per diem job at another hospital and they felt I would not promote time needed for them.", "Interview Questions": "Your strengths and weaknesses in current position "}, {"date": "22 Dec 2022", "title": "Program Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health in Jun 2022", "Interview Descriptions": "Received call for screening questions, then was set up for an in-person interview with manager, supervisor and other program coordinator. Received offer by phone less than a week later by phone", "Interview Questions": "Why do you feel you are a fit for this role?"}, {"date": "25 May 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Very easy going, manager was presentable and asking easy to answer questions! Typically the manager and a few medical assistants will lead the inter view! ended interview with walk around the department", "Interview Questions": "“what is list important to you in the work place?”"}, {"date": "30 Dec 2022", "title": "Compliance Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health in May 2022", "Interview Descriptions": "Too long. 3, separate hour long interviews with different sets of staff. Round 3 had 5 staff, 2 who appeared that they didnt want to be there, killed the mood. I knew after that interview it would go no further. It didnt....", "Interview Questions": "Tell me about yourself and what interests you in this opportunity"}, {"date": "10 Jun 2022", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health in May 2022", "Interview Descriptions": "The interview was very easygoing and chill. The interviewer made me feel really comfortable and asked relevant questions about my experiences in the healthcare field. The interview was approximately 30 minutes.", "Interview Questions": "What is your strongest quality/skill? *not sure if that was the exact wording"}, {"date": "5 Dec 2022", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (San Mateo, CA) in Apr 2022", "Interview Descriptions": "Several emails and then an in person interview with 4 people. You feel like a bug in a glass. You sit and they take turns asking you questions. Once done you wait and someone else comes in the room. They give you a tour.", "Interview Questions": "What would you do if you had a difficult client?"}], [{"date": "17 Mar 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Unit manager randomly called me over the phone and asked me interview questions. Examples like where do you see yourself in 5 years, why nursing, tell me about yourself, etc.\r\nNext day had an in-person interview. As a new grad, they have me about 7 clinical scenario questions relevant to the unit then about 4 behavioral questions.", "Interview Questions": "What patient population are you interested in?"}, {"date": "8 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Generally a panel interview with about 10 panel questions that involve critical thinking and past experiences. Often several managers, charge nurses and some administration personnel will sit in on the panel", "Interview Questions": "Describe a time when you had known you made a mistake. How did you handle it and what did you learn from it."}, {"date": "1 Apr 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Palo Alto, CA) in Mar 2022", "Interview Descriptions": "It was extremely quick process. Got called to schedule an interview. The next monday I was interviews. 3 days later I was called for the job. The two interviewers were very professional and throrough. The HR manager was helpful letting me know what is the onboarding process. 10/10", "Interview Questions": "Why did you choose sutter?"}, {"date": "15 Apr 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health in Mar 2022", "Interview Descriptions": "The entire process took around thirty minutes. I was initially greeted by the manager and then I met one of the leads. Both people interviewed me and asked questions that where about my how I work with people and why I want to work there. Questions where of that nature. Both people were extremely nice and made the entire experience very pleasant, which helped calm my nerves.", "Interview Questions": "Why do I want to work for Sutter Health?"}, {"date": "2 Feb 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Very long, 40 plus question interview. Management was nice but had other MAs interviewing me as well who were not the leads. They also had the provider ID be working for in the interview", "Interview Questions": "What are my strengths and what do I consider my biggest weaknesses "}, {"date": "7 Apr 2022", "title": "Clinical Laboratory Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Feb 2022", "Interview Descriptions": "All the panels are present in the interview, so it only took an hour and the questions are not repeated, unlike a per-person interview. Questions were thorough and traditional. The interviewers are pleasant and professionals.", "Interview Questions": "What are your strengths and weaknesses?\r\nHow do you handle a difficult situation?\r\nWhat is a memorable experience in your past job?"}, {"date": "29 Jan 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Very smooth. I had two interviews and both were in person. One with the director and the second one with the team I would be working with. I was also given a tour of the clinic.", "Interview Questions": "What are similarities and differences while treating a patient with chronic back pain vs. acute back pain. "}, {"date": "13 Jan 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "From what I heared it's easy to get you just got work for for job you enquire on getting. Be on time do what you need to do work your hours and have fun.", "Interview Questions": "Have you had any receptionist experience  in the 5 years? Do you have your high-school diploma? "}, {"date": "30 Dec 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "Went through over the phone interview and waiting on second interview any tips on what the second interview maybe like. I see I’m some that it’s many people in the interview when people get interviewed does anyone know if it’s the same for medical assistant", "Interview Questions": "Why do I want to work for sutter"}, {"date": "11 Dec 2021", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sutter Health", "Interview Descriptions": "Very positive interview process, first with the director and then with the director, the VP, and another director all together. It felt much more like a conversation, and they seemed genuinely interested in me as a person.", "Interview Questions": "Tell about a project you've worked on ..."}], [{"date": "9 Dec 2021", "title": "Medical Assistnat Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "#1) Introductions. One of the most important steps in the interview process just so happens to be the first. ...\r\n    #2) Small Talk. After introductions are finished, it is a good idea conduct a bit of small talk with the candidate. ...\r\n    #3) Information Gathering. ...\r\n    #4) Question/Answer. ...\r\n    #5) Wrapping Up.", "Interview Questions": "What do you see yourself doing in 5 years? "}, {"date": "26 Dec 2021", "title": "Enviromental Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Dec 2021", "Interview Descriptions": "I apply early December and interview 2 weeks ago. I got interview at two different hospital.   It was a good interview and got hired.  Then go though the pre hire paper work.", "Interview Questions": "Where do see yourself in 5 years ? "}, {"date": "8 Dec 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health (San Jose, CA) in Dec 2021", "Interview Descriptions": "got a call to come in for an interview, went in a couple days later and met with the manager and another employee. pretty easy but I think it was because the manager was pretty cool", "Interview Questions": "qualifications, what I did at my previous position, pretty basic"}, {"date": "19 Nov 2021", "title": "SURGICAL SERVICES ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Straight forward interview process with typical questions. Was a little weird and distanced because of the pandemic. Started with a ohone screening which lead to one in person interview. Was called back within a couple days with an offer.", "Interview Questions": "What do you know about our department?"}, {"date": "11 Nov 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Disorganized, couldn’t even bother to feed the interviewee.  We’re quite rude and very disorganized, should have taken the hint. My wife even said bad feelings about the place, but the largest salary offer of the four major systems.", "Interview Questions": "Difficult dealing with conflict in your career? "}, {"date": "9 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sutter Health (Oakland, CA)", "Interview Descriptions": "the interview process was very straightforward. The unit manager wanted to get a feel for the person on the other end of the phone (phone interview due to covid). There were questions about your previous unit specific experience and a couple of behavioral questions.", "Interview Questions": "Why should we hire you?"}, {"date": "6 Nov 2021", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Interview was smooth, but be prepared to answer tough questions.  It is a hospital environment,  so they are looking for a staff that acts accordingly.  If was an interesting process. I would absolutely recommend.", "Interview Questions": "N/A"}, {"date": "10 Nov 2021", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (San Francisco, CA) in Nov 2021", "Interview Descriptions": "A call from the hiring manager went over my past experience and scheduled an interview.\n2nd interview was a zoom with the manager and supervisor. Basic questions and was easy going.\n3rd was with both again but in person and with another scheduler.", "Interview Questions": "tell me a time you dealt with an angry patient"}, {"date": "18 Oct 2021", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "1. Phone screen with senior staff member\n2. In-person interview (approximately 20 minutes; with 5 staff members one of whom was potential supervisor)\n3. Follow up with job offer and details about pre-work reference checks, health screen and background check", "Interview Questions": "Experience with customer service; situational/scenario questions"}, {"date": "18 Oct 2021", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Little Rock, AR) in Oct 2021", "Interview Descriptions": "Very thorough and thoughtful questions requiring accurate and appropriate answers. one of the best questionnaires I've personally experienced. They are understandably wanting caring and genuine people so they have smart questions to weed out the bad seeds.  If you don't share a truly genuine concern for other people this position is not for you.", "Interview Questions": "Tell me about a difficult situation that occurred on the job and how you handled it?"}], [{"date": "1 Oct 2021", "title": "Food Nutrition Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Oakland, CA)", "Interview Descriptions": "Panel interview usually manager director and an employee. Takes usually half an hour and mostly straight forward with the questions.  A second interview can happen but only if said managers or directors are unavailable for the first panel interview", "Interview Questions": "What are your current availabilities "}, {"date": "15 Oct 2021", "title": "Per Firm MA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Palo Alto, CA) in Oct 2021", "Interview Descriptions": "3 Panel interview via zoom. Have not interviewed yet but looking through glass door for some interview questions to get myself prepared. Currently working as a dialysis tech but want to pursue also as an MA", "Interview Questions": "What is your weakness and strength"}, {"date": "20 Oct 2021", "title": "Insurance Authorization Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Sutter Health (Houston, TX) in Oct 2021", "Interview Descriptions": "This I meter view made me feel so comfortable. I was so nervous at first but they made me feel like I already worked there. The energy from the interviewer’s were AWESOME! :)", "Interview Questions": "How would I handle a difficult patient."}, {"date": "27 Sept 2021", "title": "Respiratory Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "The interview consists of 3 people. Panel interview and each take turn to ask questions. Some questions were average while others were more difficult. Overall, interview was okay. It lasted about 15 minutes.", "Interview Questions": "How to handle difficult situation ?"}, {"date": "15 Sept 2021", "title": "Compliance Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health", "Interview Descriptions": "The Panel interview with the hiring manager and team was part of a multi-stage process. First the team introduced each other and the work they were responsible for. This was followed by asking behavioral questions.", "Interview Questions": "Q: How Would Your Coworkers Describe You?"}, {"date": "8 Sept 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Really easy! Got called for a interview and another call the next week offering the position. Super fast and a smooth process, just have to go through background and drug test.", "Interview Questions": "What was a situation you handled nicely."}, {"date": "15 Nov 2021", "title": "Information Security Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Sutter Health in Sept 2021", "Interview Descriptions": "Applied for a role on the information security team in mid August 2021. Four days later getting an email that the position had been filled but there is a related and similar role, would I be interested? \n\nHmm, role filled in four days is already a red flag but let us see where this goes shall we? \n\nConversation with recruiter went well, and the conversation with the hiring manager. In fact, I really liked the hiring manager – they said the right things, had a similar perspective on approach and business needs. \n\nNext step was a panel with multiple individuals from their security and privacy teams. A little intimidating, but it provided a good basis for understanding the interactions between and the scope of the teams. \n\nNext was the conversation with the deputy executive in mid-Sepetember, and when things tanked badly. This individual focused on my resume and made the judgement that I was a job hopper, not accepting my explanations or reasoning, and determined I would leave them as well. He then went on about he had been at his last job for ten years and could not understand why some else was not able to do the same, they just had two people leave, and they needed folks to stay there for the long haul. \n\nHonestly, I was dumbfounded as to the logical fallacies and his white male entitlement being used to dismiss my background and experience with his inability and/or unwillingness to grasp how others not as fortunate or advantaged, that are disabled veterans, had to experience a bad employer/toxic work environment, neurodiversity, or just plain unlucky may contribute to a work history. If this indicated how short-sighted, callous, and unprofessional this judgmental executive would be during an interview, how would this carry over when working on their team? No wonder they have people leaving! \n\nThen silence for weeks.\n\nIn the third week of November 2021, I received the canned rejection email from their ATS. The role was reposted to their ATS and the job posting sites the next morning. So they would rather keep searching for the unicorn candidate rather than give someone a chance. \n\nI want to work with true leaders, not judgmental managers who are stuck in their own logical fallacies for years. If this is how they treat candidates, this has me questioning how do they treat you as a patient? I will never apply for a job at Sutter ever again, will never get my medical care from Sutter; and will recommend to everyone who asks to avoid Sutter as a medical provider or an employer.", "Interview Questions": "Are you comfortable with commuting onsite three days a week to the work location? "}, {"date": "31 Aug 2021", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Sutter Health", "Interview Descriptions": "Simple. Spoke to someone for 10 mins and got the position. They have accommodated my needs during covid. They gave me their own personal experience to show me how they have grown in the company.", "Interview Questions": "What does work ethic mean to you?"}, {"date": "13 Aug 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Sutter Health (Ogden, UT) in Aug 2021", "Interview Descriptions": "It was fun and fast. They asked the “normal” interview questions. I felt like they actually wanted to get to know me. I was advised what could potentially happen if I was offered a position with Sutter Health and they answered all questions I had.", "Interview Questions": "They were general interview questions. "}, {"date": "26 Aug 2021", "title": "Certified Clinical Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sutter Health (San Francisco, CA) in Aug 2021", "Interview Descriptions": "Over the phone interview with director, if they want to proceed you will be called in where you will speak to the director do a hands on interview Ex: Take vitals on a automatic and they ask you about Glucose/A1C, Vaccinations.... Then you will be taken to interview with Onsite nurse, Director Of Operations, HR and they ask you questions.", "Interview Questions": "Commute, Why do you wanna work here, Tell us about yourself, What is something your last employer would say about you, why did you leave your last job?"}], [{"date": "16 Sept 2021", "title": "Great Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sutter Health (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "Great interview process, fast replies with a job offer if you pass. Interviewed with two people over the phone. Drug testing process kind of sucks though.  You're limited on time with a code that expires within 2-3 days and have to only go to one location of their choosing closest to your zipcode.", "Interview Questions": "What is one mistake you made and how did you overcome it"}, {"date": "23 Jul 2021", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Mountain View, CA)", "Interview Descriptions": "Typical interview questions, small dosage and syringe exam. Not very stressful at all depending on which specialty you apply with. If you know what you are doing in your scope of practice, then you have nothing to worry about.", "Interview Questions": "What does success mean to you?"}, {"date": "17 Jul 2021", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "My interview was pretty standard I didn’t think it was good or bad just getting to know the person and what their strengths and weaknesses are and why they are interested it seemed like a normal process and I would do it again", "Interview Questions": "Why are you interested in this position ?"}, {"date": "9 Jul 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Three panel interviews including executives. HR process was okay but didn’t really answer my questions. The interviewers mostly had negative things to say about the work. Overall the people seemed nice but didn’t offer good vibes about the job itself.", "Interview Questions": "What kind of animal best represents me. "}, {"date": "6 Jul 2021", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Phone interview followed by an in-person interview. The in-person interview involved 3 panels.  It went for about one hour, followed by few minutes of question and answer. The supervisor and project manager were in the panel.", "Interview Questions": "Tell us about your data gathering skills and experiences "}, {"date": "7 Jul 2021", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sutter Health in Jul 2021", "Interview Descriptions": "It was a virtual interview (due to the pandemic), with the manager and a couple lead scientists present. They asked 10-15 interview questions, all very standard. Able to ask questions at the end, lasted about 45 minutes.", "Interview Questions": "Have you done anything in the last year to improve or advance your career?"}, {"date": "20 May 2021", "title": "Staff Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "It was a panel interview with managers and other staff nurses, conducted in person and on site.  They each took turns asking questions, but overall, it was a really good experience.", "Interview Questions": "Name one time you faced a challenging work situation, how did you handle it, and what did you learn? "}, {"date": "19 May 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "It was a phone interview with 2 of the department managers. I had a really good conversation with them they were very easy to talk to. They gave me an offer as soon as we were done with our conversation. I really could not have asked for a better experience.", "Interview Questions": "Basic questions that you can expect at interview"}, {"date": "7 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Some tough questions but very friendly and pleasant. Didn’t feel intimidated at all yet I felt like we were having a discussion. They asked some appropriate questions in each interview.", "Interview Questions": "How do you handle conflict with an MD?"}, {"date": "27 Apr 2021", "title": "H P S Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "It was based on experience and knowledge of the position. The difference between Mental Health and Medical variances for Health Program Specialist (HPS).  Reminder of the importance of HPS for providers and staff for policies, procedures and compliance.", "Interview Questions": "How are you different from other candidates?"}], [{"date": "4 Apr 2021", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Quick 30 minute interview that asked \"situational\" questions and clinical questions. Would definitely brush up on MNT knowledge, especially in ICU.  Decision was quick and HR was flexible in start date.", "Interview Questions": "Comfort with administrative tasks, clinical scenarios"}, {"date": "19 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "They have panel interview which consist of the unit staff and then hiring manager. They want to see if you will be a good fit in the team. Every person will ask questions and the difficulty varies.", "Interview Questions": "Tell me more about your self.\nWhy sutter health? "}, {"date": "16 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Sutter Health", "Interview Descriptions": "Interview process was a nursing panel with three unit managers. It took a total of 45 minutes. It consisted of basic questions and some clinical questions. Overall, it was a smooth process.", "Interview Questions": "What are some nursing interventions you would do if a patient presents with signs and symptoms of CHF? "}, {"date": "18 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Mar 2021", "Interview Descriptions": "It was a Nurse panel with 4 managers from different units, where they asked clinical case scenario questions. There was also a series of other questions in regards to your behavior.", "Interview Questions": "Tell me about yourself ?"}, {"date": "31 Mar 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Roseville, CA) in Feb 2021", "Interview Descriptions": "It was over facetime. waited for a little bit in  a virtual waiting room but the interview was 1 on 1. The questions that were asked wee pretty straight to the point. I think They just want to make sure you are qualified and serious about the position since you are working in health care.", "Interview Questions": "why do you want to work for sutter?"}, {"date": "24 Feb 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (West Valley City, UT) in Feb 2021", "Interview Descriptions": "Very personable. I really enjoyed talking to the lady that interviewed me over the phone. She was very easy to communicate with and made me feel comfortable. We did talk a lot about past jobs and how they related to this position.", "Interview Questions": "They did ask how you would handle a few different situations. "}, {"date": "14 Oct 2020", "title": "Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "multiple phone calls and zoom videos. the final was a panel interview led by 3 people/ overall a good experience. i would come prepared and with a brag book. i sent multiple follow up emails and networked.", "Interview Questions": "tell us about a time when you handled an obstacle"}, {"date": "15 Oct 2020", "title": "Registered Nurse Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "The interview consisted of 3 panel supervisors. It was round robin style where each asked one question. It took over 45 minutes. They were really nice. It's been 10 days now and my status online has updated to \"You are one of the final candidates being considered.\" Hopefully, something positive comes up soon.", "Interview Questions": "Give us an example of a time when you had conflict at the workplace and how you handled it?"}, {"date": "24 Sept 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Salt Lake City, UT) in Sept 2020", "Interview Descriptions": "I applied on Indeed then received email about an interview from recruiter the next day I had a phone interview with 2 supervisors then the following day I was offered the job.", "Interview Questions": "What I thought good ethics was. "}, {"date": "29 Sept 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Palo Alto, CA) in Sept 2020", "Interview Descriptions": "Applied online and just to see what is my statue. I waited and got a call for an interview. I got the call and then went to the interview to meet the hiring manager. Now waiting for second interview.", "Interview Questions": "What is your weakness and strength?"}], [{"date": "5 Oct 2020", "title": "Work From Home Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Salt Lake City, UT) in Sept 2020", "Interview Descriptions": "It was easy and painless. I did the video interview through Indeed. Than proceeded to the interview with the talent recruiter. No questions were asked that made me feel nervous. It was very comfortable.", "Interview Questions": "What experience do you have? "}, {"date": "24 Sept 2020", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Sept 2020", "Interview Descriptions": "Still in the process it has been about 2 weeks. I am scheduled to take test tomorrow. Test is general questions and 5 dosage questions you must get 80 percent on both test in order to pass the assessment. Recommend study guides and knowing your scope of practice to ensure that you pass!", "Interview Questions": "N/A"}, {"date": "20 Jan 2021", "title": "Customer Service Representative (Work From Home) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Sept 2020", "Interview Descriptions": "Interviewer was super nice! I had one phone interview and it was a general question and answer interview. The interview was about 20-30 minutes. I came prepared with questions to ask about working from and equipment requirements.", "Interview Questions": "What are good ethics? Strengths and weaknesses, Tell me about yourself"}, {"date": "9 Feb 2022", "title": "Desktop Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Oakland, CA) in Sept 2020", "Interview Descriptions": "Very easygoing, they asked a technical questions but most importantly wanted to know about customer support and how you are with interpersonal skills. I learned alot of technical things on site so just make sure you are a people person", "Interview Questions": "What do you think is the most important microsoft application?"}, {"date": "31 Aug 2020", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "It was rather informal. I got a referral for the position. I spoke to the lead tech and one leaving. They told me about the position and what was expected and how long the training would take.", "Interview Questions": "How was I with high vol of blood? Since it was an OR tech position."}, {"date": "30 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "An in person interview is conducted with a panel of hiring nurse managers. Lasts about 30 minutes. Received a phone call by the end of the week with offer of employment.", "Interview Questions": "What made you want to work at sutter"}, {"date": "11 Aug 2020", "title": "Registered Nurse (Flu Nurse) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Jul 2020", "Interview Descriptions": "questions were behavioral based and fairly simple. It was a phone interview with two people. The interview took about 30 min to complete and I was hired within an hour of completing the interview. They asked about also anaphylactic reaction and how you would handle it...", "Interview Questions": "tell me about a challenge you had with a coworker and how did you handle it"}, {"date": "27 Sept 2021", "title": "Sterile Processing Technician II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Oakland, CA) in Jul 2020", "Interview Descriptions": "There were three interviewers, all women, and it was very intimidating. It was also during Covid so we all had masks on which was even more uncomfortable. They asked a lot of questions and quizzed me on physical surgical instruments.", "Interview Questions": "Name all ten of these surgical instruments (handed me a bag of instruments)"}, {"date": "3 Feb 2021", "title": "Patient Service Representative I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sunnyvale, CA) in May 2020", "Interview Descriptions": "I had applied through Sutter Health website and within one week I got call from manager for interview date and time. I went for interview in Sunnyvale, CA. The manager asked me some interview question, which was easy to answer then she gave me tour of building and told me that I will get phone call from her for the decision, but I did not got any rel[ly from her.", "Interview Questions": "Tell me about yourself.\nHow do you handle rude patient."}, {"date": "10 Apr 2020", "title": "Diet Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Sutter Health", "Interview Descriptions": "The interview was pretty casual. It was me, the director of the food and nutrition department, a current diet clerk and a registered dietitian asking me questions. All of the questions were pretty straightforward, typical interview questions. They asked me about my customer service experience since the job entails working with hospital patients, as well as my communication and multi-tasking skills. They were very clear about what the hours would be like, how scheduling works, and what the pay would be. They didn't ask any specific nutrition questions.", "Interview Questions": "How would you deal with a difficult patient that is requesting items that don't comply with their diet order?"}], [{"date": "19 Jan 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Apr 2020", "Interview Descriptions": "The first interview was about 30 minutes over the phone with a general recruiter. The second interview was with the head of the data team, which was also over the phone and took about 20 minutes. Third interview was with the entire data team (5 total) over Zoom and took about an hour.", "Interview Questions": "Strengths/weaknesses, examples of challenges, things I was proud of professionally."}, {"date": "5 Feb 2021", "title": "Clinic RN Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Apr 2020", "Interview Descriptions": "Phone interview, then interview with Supervisor on phone. In person interview with Manager and Supervisor from another area.  Interview with Contract Manager. No questions of substance. Interview focus was challenges that would be faced. Staff RNs interview you in the end and in theory make the final decision.", "Interview Questions": "Money, experience, why I would want to work there? Was I familiar with employer satisfaction?"}, {"date": "20 Oct 2021", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Mar 2020", "Interview Descriptions": "Two panel via zoom \r\nTook turns to ask questions \r\nThen u ask questions \r\nNo that’s it \r\n\r\nThey asked scenario and personality questions and and me and and and and \r\nI got it", "Interview Questions": "Talk about diff pt and what happ "}, {"date": "21 Feb 2020", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Sutter Health", "Interview Descriptions": "Met with two employees who were friendly from the get-go. The whole process was smooth (at least I felt it was). Though I was not offered the job on the spot, I am hoping to hear back shortly.", "Interview Questions": "Call center experience"}, {"date": "9 Mar 2020", "title": "Patient Services Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sunnyvale, CA) in Feb 2020", "Interview Descriptions": "I received an email for an interview  2 weeks after applying. It was a 30 minute interview, walked around the building after the interview. I was told I would receive a notice through them 3 days after my interview, but never received a call or email.", "Interview Questions": "What are your strengths?"}, {"date": "15 Jan 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Modesto, CA)", "Interview Descriptions": "Be prepared for a panel interview, bring at least 4-5 resumes. Questions are generic, be prepared to \"sell\" yourself.  After the interview the offer or denial is sent through your portal, so be sure to have your email updated.", "Interview Questions": "Why would you be a good candidate for the job?"}, {"date": "7 Jan 2020", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Behavioral and clinical questions. Not really excited about the fact that they are non union. They have a decent new grad program for newer nurses. Good place to start out and get experience as they hire in specialty units", "Interview Questions": "Clinical critical thinking questions "}, {"date": "26 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Santa Rosa, CA) in Jan 2020", "Interview Descriptions": "My interview process went smoothly . It was a phone interview with the unit manager and clinical educator. Questions were average difficulty, mostly behavioral questions. It took about one week for follow up.", "Interview Questions": "Tell us about yourself. \nWhat is your NICU experience?\nHave you attended deliveries? "}, {"date": "24 Aug 2022", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Los Gatos, CA) in Jan 2020", "Interview Descriptions": "Interviewed 1 year after externing at a different Sutter Health Location. Received two phone calls and then one in person interview with one person. Others told me they had a panel of five.", "Interview Questions": "Tell me about 5 different times you were a leader"}, {"date": "8 Jan 2020", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sunnyvale, CA) in Dec 2019", "Interview Descriptions": "It was a panel interview of 3 and lasted for about 45 minutes. Asked the questions from a package. The interview staff very nice, and answered your questions. They told you when you could expect to hear from them, which was about 20 days or approximately 3 weeks", "Interview Questions": "tell us a little bit about yourself"}], [{"date": "26 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health in Dec 2019", "Interview Descriptions": "Panel interview with nurse manager and 2 charge/staff nurses. The interviewers asked a series of scenario questions and a few basic interview questions. The entire process took 1 week as I applied on a Friday night, had the interview the following Wednesday and accepted the position two days later.  The interview took about 45 minutes and was called when offered the position.", "Interview Questions": "Scenario questions regarding prioritizing patient care."}, {"date": "3 Oct 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sutter Health (San Francisco, CA)", "Interview Descriptions": "I applied online and got a call for an interview 2 days later. Panel interview with 2 nurse managers. They were friendly yet professional. Easy interview questions. They just want to get to know you and see if you're a good fit.  After the interview they gave me a brief tour of the unit. Got an offer 3 hours later.", "Interview Questions": "Tell me about yourself, your work experience, and why you applied for this position"}, {"date": "9 May 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Oct 2019", "Interview Descriptions": "Easy process and basic behavioral interview questions.   It consisted of 2 interviewers and they took turns asking questions. At the end of interview they asked if I had any questions.", "Interview Questions": "Tell me about a time when you made a mistake and how you fixed it. "}, {"date": "7 Aug 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Oct 2019", "Interview Descriptions": "there were 4 people in the room, lasted around 10-15 minutes. It was for a pediatric medical assisting position. I wasnt aware that there was going to be 4 people in the room interviewing me until I checked into my interview and the lady at the front desk told me. There was general interview questions as well as technical ¨what would you do if...¨ questions.", "Interview Questions": "Why sutter health, how would you handle a child who doesnt want to receive shots"}, {"date": "23 Sept 2019", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health", "Interview Descriptions": "The manager contacted via email for a phone screening. Basically asked the experience listed on the resume and introduced the job. Then scheduled an on-site interview with 2 RDs.  Asked several behavioral situational questions and several case studies.", "Interview Questions": "Describe your dream job. \r\n"}, {"date": "18 Sept 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Phone interview, only 5-10 minutes max. No in-person interview offered. After phone interview you'll be given documents for orientation that lasts 2 hours. Overall fairly easy. No experience needed as a volunteer.", "Interview Questions": "Why did you want to volunteer at Sutter"}, {"date": "18 Sept 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (San Francisco, CA)", "Interview Descriptions": "So the interview itself was amazing. The people interviewing asked relevant questions pertaining to the job. They were very interactive. \r\n\r\nThe bad review is for the recruiter. Like any job, I submitted my resume that had every experience that pertained to nursing. A few days after my interview, I get a call that I am offered a position. I of course accept. A week later I receive an email that I rejected the offer? Hmm that’s weird. So I call the recruiter and asked what happened. She tells me there is a sutter rule that internal transfers cannot occur within 6 months of being hired at another sutter facility. I was working at another sutter facility and officially quit already since I received an offer. I told the recruiter that it was in my resume. I was not aware of this rule, and was confused why they didn’t automatically reject my application due to this rule. \r\n\r\nSo be careful if you are doing a transfer from another sutter facility. Make sure you work six months first. Also be aware that the recruiter doesn’t clearly look at your resume. Obviously the recruiter didn’t look at mine. Luckily my wife makes enough money for me to be out of a job temporarily since I quit my job because I received that offer.", "Interview Questions": "N/A"}, {"date": "22 Aug 2019", "title": "Billing Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Great easy simple process questions were simple no trick questions. Just know your stuff and the interview process will be simple . Dress business like but not to fancy", "Interview Questions": "N/A"}, {"date": "30 Aug 2019", "title": "Regulatory Privacy & Information Security Analyst, Awareness & Training Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Sutter Health (Roseville, CA) in Aug 2019", "Interview Descriptions": "It was a long process but the offer was well worth it. I had a phone screen interview, a phone interview, a panel interview, and a one-on-one with the Senior Deputy Chief Information Security Officer.\r\n\r\nAll of the interviews were straightforward, and everyone had a relaxed attitude. The only stress involved was the stress I brought in with me. Very nice people and great experience all around.", "Interview Questions": "Tell me about yourself."}, {"date": "29 Aug 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Mountain View, CA) in Aug 2019", "Interview Descriptions": "I was had a total of 4 interviews, 1) phone interview with the recruiter 2) phone interview with the hiring manager 3) onsite interview with the hiring manager and finally 4) a panel interview.  I was not selected for the position, which is fine, PAMF needs to hire the right person for their positions.\r\n\r\nWhat I take exception to is how I learned that I was not selected.  I received a impersonal form email that I was not selected.  When an candidate goes through 4 in depth interviews and they are not selected it is disrespectful and unprofessional to send an impersonal email.  In all my years of being in HR if a candidate was in the final interviews they always received either a personal phone call from the recruiter or a personal email.  I certainly  wouldn't send a form email to a candidate.", "Interview Questions": "Why do you want to work in healthcare?"}], [{"date": "15 Jul 2019", "title": "Financial Clearance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health (Roseville, CA)", "Interview Descriptions": "Interviewed with 4 different supervisors in a room. They each asked questions. Was a bit nerve wracking and awkward with four different people looking at you. The questions could be quite difficult.", "Interview Questions": "How did you motivate others during group activities?"}, {"date": "1 Aug 2019", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (San Jose, CA) in Jul 2019", "Interview Descriptions": "Applied online. Received an email to come for an interview. Questions were not bad but had around 10-12 questions. Pretty sure the hiring manager was not going to offer me the job anyways. Good experience though. Not sure what they were looking for as a candidate.", "Interview Questions": "why you want to work here? "}, {"date": "21 Jul 2021", "title": "Wellness RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Sunnyvale, CA) in Jul 2019", "Interview Descriptions": "I Applied to position posted online. I was then contacted  from the hiring manager within 2 weeks of applying. I Then interviewed  with the manager within 2 weeks.\r\nThe follow  up was extremely  fast and was contacted by HR within the same week.", "Interview Questions": "Can you tell me about your overall nursing experience?"}, {"date": "18 Jul 2019", "title": "Marketing Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Sutter Health (San Francisco, CA) in Jul 2019", "Interview Descriptions": "Was a phone call interview started about 4 weeks ago, finally got to the phone call. Talked about my project management experience and print knowledge. Was asked to come in person to meet manager and other teams I was supposed to support. 48 hours later they took it back after making a whole big deal about scheduling. Said they found a candidate, and they were in a hurry to hire. But not in a hurry enough to interview properly.", "Interview Questions": "The projects are pretty much print material only are you okay with that?"}, {"date": "27 Jun 2019", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Quick and straightforward. An online application and upload your resume. Also basically writing out your entire resume all over again in the online application and adding the recommenders. You also must explain why you left your previous job and your supervisors.", "Interview Questions": "Old employment questions "}, {"date": "12 Jun 2019", "title": "Exercise Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "Laid back and comfortable. It is as if you are having a conversation with the interviewer. Do not be afraid to be yourself or even ask questions. It all helps them see the real you.", "Interview Questions": "Tell me about yourself?\r\nTalk about a time you had to work with a difficult coworker?\r\nWhat is your most proudest accomplishment?\r\nWhat did you choose to work in cardiac rehab?"}, {"date": "8 Jul 2021", "title": "Senior Contract Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (Roseville, CA) in Jun 2019", "Interview Descriptions": "The process was relatively standard.  Questions were standard health care and organization-based.  Also, some of the standard questions about professional weaknesses, etc. were asked too.  I did not find the interview to be too difficult", "Interview Questions": "Please tell us about your experience?"}, {"date": "23 May 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health (Stockton, CA) in May 2019", "Interview Descriptions": "I applied for the position sometime mid April and heard back from a recruiter a few weeks later to schedule the pre screen exam. The exam was scheduled two weeks later. You get two chances to pass it and you need 90% and higher to qualify for the certain region I applied for. After I passed the exam the recruiter forwarded my information to the hiring manger. The hiring manger then contacted me through phone to set up an interview the follow week and to also ask a few questions. Kind of like a small phone interview. It was a panel interview of three people apart of the department which included the hiring manger, an MA and another member of the team. Everyone took turns to ask me several questions. I had a very good experience overall. Once you are offered the position you must pass a background screen, pre and post drug screen and go through a medical assessments.", "Interview Questions": "What are your strengths and weakness?"}, {"date": "16 May 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (San Francisco, CA) in May 2019", "Interview Descriptions": "Phone interview (about 30 minutes), then on-site interview at SF office.\r\nThe phone interview just asked some basic information and set up a potential onsite. Then the onsite is set up 1 week after. The onsite interview is shorter than other companies. Then they also asked some references.", "Interview Questions": "What made you think you fit this position"}, {"date": "30 Jun 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Roseville, CA) in May 2019", "Interview Descriptions": "Interview was 1 on 1, super easy and wasn't longer than 30 minutes. The interviewer was super nice and asked open answer questions.  Got hired on the spot. Was escorted to the interview by the supervisor.", "Interview Questions": "Tell us about yourself"}], [{"date": "5 Sept 2019", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Sacramento, CA) in May 2019", "Interview Descriptions": "Didn't get past recruiters. Not impressed with them as the attitude they gave off was that they know more than me and not helpful at all. Unfortunately they passed up on a very qualified candidate in me and from what I have discussed with other colleagues, if the hiring managers have an interest in you, if they have some personal feeling against you, it will not go well. Too bad.", "Interview Questions": "Why should I hire you"}, {"date": "21 Apr 2019", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "I was called by the hiring manager for a Phone interview, and then offered an in person interview a week later.  Offer was given within a week after the inperson interview.  Very efficient.", "Interview Questions": "Why do you want to leave?  Do you realize that you are starting your career over again?"}, {"date": "20 Oct 2020", "title": "Claims Adjuster Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Apr 2019", "Interview Descriptions": "I applied online\nMy first call was with a HR rep who asked me about the job and my background. She mostly wanted to know why  I was interested. I tried then to ask about salary but she wouldn't discuss that with me. It was a 15 minute phone call. \n\nI was then scheduled for an in-person panel interview with 4 people (but it ended up being 3 after one guy called out sick); this took about 45 minutes but they round-robined a bunch of questions about how I would handle scenarios like a difficult customer or working with multiple departments to get things done. \n\nAfter my interview, I was given 20 minutes to write down answers to a scenario of a worker's compensation injury and how I would investigate it and reserves for that body part. \n\nAbout a week after my in-person interview, I got a call from the person that would have been my direct supervisor (since he was absent from the in-person meeting) because he wanted to feel me out and get to know me more. He wants to ask me about my hobbies, what I knew about Sutter Health as an organization, and confirm that I knew that this wasn't going to be an upgrade from my current job. I, again, tried to ask about salary since it wasn't posted online. \n\nI got a call a week after that with a job offer but once salary was discussed (which apparently they offered me middle of the payscale), I wasn't able to take it because it was too low.", "Interview Questions": "Give an example of a time that you dealt with an irate injured worker, what did you do? "}, {"date": "14 Apr 2022", "title": "Physical Therapy Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sutter Health (Santa Cruz, CA) in Apr 2019", "Interview Descriptions": "Interview was done in the clinic where the job is located with managers I work with. There was a phone screening ahead of time with an HR representative. All were quick and personable.", "Interview Questions": "N/A"}, {"date": "28 Mar 2019", "title": "Emergency Medical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Sutter Health (Sacramento, CA) in Mar 2019", "Interview Descriptions": "Took 5 months to get an interview but once I did the process took off. Sat with 5 staff members who asked questions. After that received a call back within a week.", "Interview Questions": "Conflict resolution. "}, {"date": "12 Oct 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Palo Alto, CA) in Mar 2019", "Interview Descriptions": "Easy got called for interview a few weeks after applying. Interview felt very easy, more like a conversation to ask and answer questions about my experience and their specifics on the job.", "Interview Questions": "How are you as a team player?"}, {"date": "27 Feb 2019", "title": "LVN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Applied online, was contacted by recruiter via email. Scheduled a phone screening. After passing phone screening, asked to come in for face to face interview. Basic interview questions about the role. Diseases knowledges. S/sx treatments and such", "Interview Questions": "How do you deal with a difficult patient?"}, {"date": "25 Feb 2019", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (San Carlos, CA) in Feb 2019", "Interview Descriptions": "Got phone interview on Thursday. Interview in person on Friday. Got offer following Tuesday. Went very well, 3 people that interview me.  Questions all about from your experience.", "Interview Questions": " Tough Situation experience. \r\nHow you solve that? "}, {"date": "14 Feb 2019", "title": "Lean Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Jan 2019", "Interview Descriptions": "Had a phone and in person panel interview with pre-work to show ability. Was very impressed with the process and felt it was one of the best ways I have seen to understand a candidates talents and fit for a position.", "Interview Questions": "How would you engage with someone who is not on board with a change or being resistant to what your doing."}, {"date": "19 Nov 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Sutter Health", "Interview Descriptions": "The whole process was about 2.5 hours. It included various questions from management and a panel of staff.  Questions were mostly tied to analytics and how you would handle difficult situations. Afterwards, there was an excel and analytical test where you had to explain your conclusions.", "Interview Questions": "Why are you leaving your current job?"}], [{"date": "14 Nov 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "The interview process involved an introductory phone interview and a subsequent panel interview in-person. It took some time for the first interview request to come in and the panel interview request to be sent as well.", "Interview Questions": "Describe your work experience and how it would relate to this position."}, {"date": "29 Nov 2018", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (San Francisco, CA) in Nov 2018", "Interview Descriptions": "Well, let this be a lesson on first impressions. Because, wow, did I have a first impression. \r\n\r\nPhone interview: Scattered and unorganized. Many red flags but decided to take the in person interview, because why not. \r\n\r\nIn person interview: Rude and rushed. They didn't schedule a conference room so the interview was in the lobby, which is loud and is obviously not intended for a 1:1 conversation. The Recruiter answers her phone in the middle of interview and says that she has an appointment and will need to leave early. Thanks for the warning, but, why did you schedule it during this time in the first place if you knew you had to leave? After 30 min of talking, I'm out of the blue ushered to a conference room with two other people. During the interview, it's very apparent that no one has looked at my resume before I arrive. One person I've already had a phone interview with, the other just spoke to me in the lobby, and the third had never met me before. The layout of the interview was awkward because I'm trying to simultaneously catch one person up on who I am while answering the questions. \r\n\r\nSomething that I've taken from my years of recruiting is knowing how to judge an organization based on my candidate experience. For instance, I would never answer my phone in the middle of an interview nor would I have an interview in the middle of a hospital lobby. This signaled to me that 1. My time is not being valued. 2. Things are so disorganized that a conference room couldn't be scheduled ahead of time. \r\n\r\nSo yes, in the end, I didn't move forward in the process. Was I sad? Not in the least. You're welcome to chalk this review up to be another \"bitter review from someone who didn't get the offer.\" \r\n\r\nI'm writing this review in some hope that the HR team at Sutter reads this and figures out how to make some major adjustments in their interview process, or lack thereof.", "Interview Questions": "Let's say there is someone who doesn't like or hates you - what would they say about you?"}, {"date": "5 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Nov 2018", "Interview Descriptions": "It was via FaceTime. 3 person panel with interview questions. Not bad, but personally like in person interviews better to get a feel of the unit and for non verbal communication and vibes", "Interview Questions": "What do you expect from your leadership team?"}, {"date": "16 Aug 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health", "Interview Descriptions": "I had a phone interview. I was contacted by the hiring manager after applying online. They were very flexible with scheduling. After the offer was made, I was contacted by a recruiter.", "Interview Questions": "Favorite and least favorite types of patients."}, {"date": "19 Sept 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Aug 2018", "Interview Descriptions": "After 1st panel interview, got a call that same day for 2nd interview for the following week.  Another panel interview.  That same day, I got a call and was offered the pos.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "11 Jul 2018", "title": "ICU RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Santa Rosa, CA) in Jul 2018", "Interview Descriptions": "It was disappointing to say the least. Interesting enough, in December the ICU wanted me to take a travel assignment based off of my resume alone; not even an interview needed. Unfortunately they pulled the contract altogether before I could accept it. Then in February I applied for 3 of their night FT positions and received a call from their recruiter, who asked me random personality based questions and then setup an interview for me in the ICU. \r\n\r\nAt the last minute I received a text message from the \"ICU interviewer\" stating she needs to reschedule, so I did and met at her office in the ICU. The interview was not very formal and it really just went over my resume and previous work that I had not listed (i.e. non RN, but pt care roles), but no real in depth scenario or knowledge based questions. She did mention that she had some new nurses on nights. She said she would speak to my references and get back to me and told me to email her if I had any questions. I did email with some questions while thanking her for the interview. However her reply did not bother addressing my inquiries and just said I don’t have enough experience although my resume states otherwise and they wanted my travel contract in December based on my resume alone. \r\n\r\nSo over the last 4 months there have been openings and recently 5 ICU night positions. It appears the Staff turnaround is high there and most likely need staff more than the staff needs them. I applied and a month later I get a call from the same \"ICU interviewer,\" who had no idea she had talked to me before. We setup an interview and I met with her in her office again. \r\n\r\nShe recognized me, she inquired, and I told her she didn’t hire me. She asked why and when I began to state the above someone barged in the office asking questions about an ER admit, getting a patient out, etc., etc. The person left and the \"interviewer\" apologized while holding her phone and text messaging, which went on for the majority of the interview. Again, no knowledge or scenario based questions.\r\n\r\nThe first request was to tell her about myself. As I went on from the beginning of my hospital career 8yrs ago and discussed my different roles and experience at each job, she interjected and wanted to know about my time in ICU. Most of my time as a nurse had been step-down ICU until now where it’s been mostly ICU.\r\n\r\nI am currently on a travel contract at a nearby facility in the ICU and she concluded that it’s not an adequate ICU although I stated that I take vented patients on ICU drips. She asked about my preceptors back home and said she would need to speak with them because  there has been too much of a gap between when I worked back home until now (6mo) and I basically don’t have my skills current. That was not an issue in February, but apparently it is now. She also mentioned that she has 5 brand new graduate nurses and needs someone with experience. So basically, they can’t keep staff, so they hire nurses with zero experience, but won’t hire nurses with 8yrs bedside care, 4yrs RN (2yrs as step-down ICU, 2+yrs ICU) experience. \r\n\r\nI stated that back in FL, the work experience is exponential without the unions or patient ratios to protect nurses. Medical staff are put to the test every single day back home. While text messaging,  she just said she would need my references and gave me her card, so that I could email them to her. \r\n\r\nI emailed my references to her the next day, my references were waiting for a phone call, but the next morning I received an email again saying I don’t have enough experience. My references were never contacted. I replied back to the email questions that decision and the rationale for everything stated above, not expecting a job, but wanting a logical reason for such inconsistent reasons and telling me one thing, while not giving me a professional interview, and doing something else entirely.\r\n\r\nNot a good representation of what I thought would be a great place to work. Obviously they need to fill ICU positions regularly. It seems they need staff more than the staff needs them as reflected by the multiple job listings. I considered staying in CA and making Santa Rosa my home, coming back to my home state of CA. It would take a lot now to make me reconsider that. It’s their loss. \r\n\r\nThe only reason the interview was difficult is because of the lack of professionalism on her mobile phone and not really giving undivided attention, and not following through with what she said she would do. If I got the job, the interview would have been simple because no challenging questions were asked. They would rather hire people with zero experience, who will most likely make many mistakes rather than hire someone with 2yrs experience, which is not enough experience. However that makes sense, I will never know. It’s probably not a facility I would feel comfortable trusting or working with.", "Interview Questions": "I was not asked any real questions to determine my knowledge, critical thinking, skill set, or anything that all other managers ask at other hospitals. It was not very professional. Everything asked was printed on my resume, which just pertained to the amount of time worked at my last jobs."}, {"date": "15 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sutter Health (Sacramento, CA) in Jul 2018", "Interview Descriptions": "Met with Manager and Assistant Nurse Manager! Mostly asked about situational Emergency questions and how would I handle each situation! Also included questions regarding how I would handle a difficult situation between myself and a teammate!.", "Interview Questions": "What would you do if you had a patient who was short of breath, while you also was called to take care of a patient who was bleeding from an Iv site and you have a Physician returning a call placed to him earlier?"}, {"date": "4 Jun 2019", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Modesto, CA) in Jul 2018", "Interview Descriptions": "Applied online and heard back in one week from HR.  Landed an interview in one week.  Panel interview of 3.   Whole process took one month.  Started working after 1 month of interview.   The panel interview was as manager , supervisor, and educator", "Interview Questions": "Tell me about yourself, how do you treat sepsis and chest pain , deal with difficult family member "}, {"date": "14 Sept 2018", "title": "IT Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Sutter Health in Jun 2018", "Interview Descriptions": "I had one telephone screening interview with a PC and manager.   On a different day,  another \r\n\r\n\r\n interview was scheduled with four different managers on line conducting the interview.", "Interview Questions": "I was asked a situational interview question."}, {"date": "19 Jun 2018", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (San Francisco, CA) in Jun 2018", "Interview Descriptions": "Typical interview questions; why do you want to work for Sutter, why should we hire you, scenario questions. I felt they were seeing if my personality would be a good fit for the team.", "Interview Questions": "Why should we hire you for this position? What do you bring to the table?"}], [{"date": "16 May 2018", "title": "Counsel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health", "Interview Descriptions": "Pretty straight forward - screen with recruiter, phone interview, in person interview with three members of my future team. Was slightly awkward sitting 3 on 1, but the questions were straight forward.", "Interview Questions": "Tell us about your current projects "}, {"date": "6 May 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sutter Health (Tooele, UT)", "Interview Descriptions": "Phone interview was great, I learned a lot about the job and felt really confident afterwards. My recruiter was Jake and I think he really knows what he’s doing! He really set me up to understand the role i was applying for.", "Interview Questions": "Tell me about a time when you had to overcome a conflict at work."}, {"date": "1 May 2018", "title": "MA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Went well, took a long time. I had to do more than one interview, one with manager, supervisor and one with doctor. It was a good process I have nothing negative to say.", "Interview Questions": "Tell us about a time you did process improvement?"}, {"date": "6 Jun 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Sutter Health (West Valley City, UT) in Apr 2018", "Interview Descriptions": "I had one phone interview and one in person interview. They discussed my resume and gave basic information about the position. There were typical interview questions, that were not too difficult. The supervisor answered all of my questions and was adequately prepared.", "Interview Questions": "Tell me about a time you made a mistake. What did you do?"}, {"date": "6 Apr 2018", "title": "Emergency Nurse Memorial Medical Center, Modesto Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health", "Interview Descriptions": "The interview was a panel of three. Each member would take turns asking assigned questions. \r\nThe interviewers were pleasant. I was surprised how large the room was that I was interviewed in. The seating arraignment was intimidating.", "Interview Questions": "A two part question on a septic patient. Signs and symptoms of a septic patient and how I would approach providing nursing care to the patient."}, {"date": "27 Oct 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Oakland, CA) in Apr 2018", "Interview Descriptions": "Applied online, and I had to check status of my application everyday to get an update. My application started with \"consideration\" and moved up to \"hiring manager\" to \"final candidate\". This took 4 weeks to be contacted for an in-person interview with hiring manager.", "Interview Questions": "Tell me about yourself"}, {"date": "9 May 2018", "title": "Web Content Writer/Editor- Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Sacramento, CA) in Apr 2018", "Interview Descriptions": "They have a very detailed job description, knowing exactly what they want. And a very high expectation of qualifications. The online portion of signing up was relatively easy, although I would have preferred a one-click submission instead of having to fill out everything in my resume into their system for the hundredth time. Companies need to streamline this process to save people hours of their time.", "Interview Questions": "They asked what previous experience I had writing web content."}, {"date": "13 Feb 2018", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "I was taken into a conference room and interviewed by two people.  They described the requirements of the position in detail.  They also explained much about the organization and the particular office in which I would be working.  They asked me a series of questions about my reasons for entering this field, my goals, and my experiences.", "Interview Questions": "What would you do if you were assigned to one physician but that physician called in.  You are now assigned to a different physician for the day.  What would you do to prepare for your day?"}, {"date": "21 Jul 2021", "title": "Senior Business Intelligence Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Sacramento, CA) in Mar 2018", "Interview Descriptions": "Individual and panel interview along with a skills assessment requiring the candidate to do an analysis based on data supplied. Typical background screening drug testing etc. overall the process took 3 weeks to get hired.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Feb 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Sutter Health", "Interview Descriptions": "I applied for Sutter health about two weeks ago. Got an email back asking for times that I was available so they could call me for a phone interview. They called me about a week later for the phone interview. The guy that interviewed me told me he would email me the following Monday. Overall good experience", "Interview Questions": "What do you do at your job right now?"}], [{"date": "14 Feb 2018", "title": "LVN RADIATION ONCOLOGY Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Sutter Health in Feb 2018", "Interview Descriptions": "Contacted by Regional Director of Rad. Onc. And had phone interview with her and an RN. Followed by an in person panel interview with a doctor and 4 staff members. Never, have I had such a professional interview. They didn’t read questions off of a piece of paper, which seemed to be the trend.", "Interview Questions": "Why did i want to be in Radiation Oncology. \nI was asked about my career history and why being a nurse was important to me. Very relaxed and felt welcome to be a part of the team."}, {"date": "6 Feb 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "They called me via phone and it took about 10 minutes. A couple days later I got paperwork emailed to me. It was a fairly easy hire compared to other experiences I have.", "Interview Questions": "previous medical experience"}, {"date": "20 Apr 2019", "title": "BI Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Feb 2018", "Interview Descriptions": "Process went for 30 min with sql fundamentals, then to advanced along with scenario based questions. MSBI, Tableau and Power BI, Informatica stack is the focused areas of the interview", "Interview Questions": "Sql Technical questions"}, {"date": "30 May 2019", "title": "Business Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Vacaville, CA) in Jan 2018", "Interview Descriptions": "Panel interview. Professional and friendly staff. Questions were good and made you think. Good interview. Took about 30 minutes. Took place in a conference room. Many questions were based off of past experiences and personality.", "Interview Questions": "How do you handle drama in the workplace "}, {"date": "3 Mar 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (San Francisco, CA) in Jan 2018", "Interview Descriptions": "The interview process was very simple. Everything was explain when arranging the interview. I received an email regarding the interview. All communication was clear. They ask standard interview question pertaining to your work history and question relating to the role.", "Interview Questions": "Tell me a little bit about yourself. "}, {"date": "25 Jan 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Jan 2018", "Interview Descriptions": "Applied online got a call back weeks later was asked why I was choosing that specific specialty supervisor let me know my references and previous employer had good things to say. Was then asked to come in for an interview.", "Interview Questions": "If your last supervisor would say something negative about you what would it be?"}, {"date": "6 Oct 2020", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Jan 2018", "Interview Descriptions": "Good experience. Warm presence. Panel of people. Competitive process. Appears to be the kind of place you would want to work because they seem to care most about your experience, your passions, your strengths and how they can help you grow in your career.", "Interview Questions": "I honestly can’t really remember. "}, {"date": "26 Dec 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (West Valley City, UT) in Dec 2017", "Interview Descriptions": "Interviewer was aloof. Disengaged. Didn't introduce herself at the beginning of meeting or anything, just said follow me. Kinda realized I wasn't getting the job into the middle of the interview. Good experience anyway.", "Interview Questions": "What do you look for in a leader"}, {"date": "18 Dec 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Mountain View, CA) in Dec 2017", "Interview Descriptions": "I was interviewed by one woman \"the manager\" and another woman just sat in the room. The interview was very relaxing and comfortable. She asked me to tell her about myself and why was I interested in this position. It was not you typical interview with clinical questions, it was very laid back.", "Interview Questions": "Why are you interested in this position? Tell me about yourself. "}, {"date": "20 Mar 2018", "title": "PSR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sutter Health (Sacramento, CA) in Dec 2017", "Interview Descriptions": "Got back to my application immediately since they needed to replace the worker who left. There was a three person panel with a representative from departments such as PT and admin.", "Interview Questions": "What muscles do you activate when performing a squat and a bridge?"}], [{"date": "11 Dec 2017", "title": "PSR Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Dec 2017", "Interview Descriptions": "Interview went smoothly, many behavioral/situational interview questions were asked. Interviewers were very kind and made you feel comfortable throughout the process. Remember to ask questions at the end of the interview.", "Interview Questions": "What is something you can improve on?"}, {"date": "19 Nov 2017", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Sutter Health", "Interview Descriptions": "Apply on line,  get a phone call from HR next day,  department director call me a day  after,  ask me couple questions about myself and set up a face to face interview which includes a cooking skills exam.", "Interview Questions": "why are you qualify as a cook in Sutter Health ?"}, {"date": "9 Nov 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sutter Health (Ogden, UT) in Nov 2017", "Interview Descriptions": "I applied online and uploaded my a PDF of my cover letter and resume. The next day I received an email requesting the 3 best times over the next week to receive a phone call for a telephone interview. I replied immediately, and the third day I received an email stating the date and time (5 days later) I could expect to receive the telephone call. About 8 minutes after the time specified, I received a call from the interviewer. She was well prepared, had my resume on hand and referred to it during the interview. She readily answered my questions.", "Interview Questions": "Give me an example where a customer was upset about something that was not your fault, and tell me how you resolved the problem."}, {"date": "16 Nov 2017", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Sutter Health (West Valley, UT) in Nov 2017", "Interview Descriptions": "It was a group interview of 6 people. It was different they asked group questions and individual. I was notified within 4 hours of being hired. There was three managers there. They were all so nice and relaxed. Seemed to have a sense of humor also. I liked it", "Interview Questions": "What is one weakness you will have with this job?"}, {"date": "15 Nov 2017", "title": "Administrative Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health (Fairfield, CA) in Nov 2017", "Interview Descriptions": "1st Round: 45 minute video interview with HR Representative\r\n2nd Round: 30 minute video interview with executive\r\n3rd Round: all day onsite interview with two panels of executives (c-suite and potential preceptors)", "Interview Questions": "Why are you interested in healthcare?\r\nWhy Sutter Health?\r\nTell me about a time when you failed."}, {"date": "20 Oct 2017", "title": "Desktop Support Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Sutter Health", "Interview Descriptions": "Contacted by a recruiting agency about position, set up interview soon after. Easy interview just general questions. Heard back a couple days later with an offer. Pretty easy and straight forward process", "Interview Questions": "basic troubleshooting and customer service questions"}, {"date": "10 Dec 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health in Oct 2017", "Interview Descriptions": "Phone screening with Director, Panel interview with dept Manager and Director, and at last HR recruiter calls to offer job. After, you will have to go through the background, physical, and drug testing.", "Interview Questions": "What would make you a perfect fit for Sutter Health?"}, {"date": "4 Sept 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sutter Health", "Interview Descriptions": "My interview went great. No pressure at all. Great vibes. Panel type interview. Was asked many questions. Received a call for a second interview within a week. Second interview went even better than the first interview. Was offered the position 5 days later.", "Interview Questions": "How well do you work under pressure?"}, {"date": "5 Jan 2018", "title": "Project Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Burlingame, CA) in Aug 2017", "Interview Descriptions": "The interview is first arrange via email, and then by a screening phone interview , and  followed by an on-site group/ panel interview that consists of various stakeholders , eg  MDs, RN, & Departmental Managers.", "Interview Questions": "What was your prior experience with Healthcare and please elaborate.\r\nWere there difficulties in prior project implementation(s) and elaborate on what/how did you address the situation."}, {"date": "22 Jul 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "I contacted the volunteer coordinator, who got back to me quickly. I filled out a simple application--biggest requirements are a reference and vaccines. The volunteer cycle (100) will start when there is an orientation, which I believe occurs only about 4 times a year. From the time I applied to the orientation, about three months passed. During this time, I received a phone interview.", "Interview Questions": "Why do you want to be a Sutter volunteer?"}], [{"date": "25 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health (Bakersfield, CA) in Jul 2017", "Interview Descriptions": "Quick and easy and very flexible since I was not living in the area at the time. The recruiter was very friendly and help guide me through the process of hiring", "Interview Questions": "What your strengths and weakness are, experience, etc"}, {"date": "19 Oct 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Jul 2017", "Interview Descriptions": "panel review with the manager, clinical coordinator, charge nurse and others. they call you to come in for an interview, you go in a conference room with all the nurses facing you across a table and ask you questions. they were friendly but intimidating .", "Interview Questions": "tell me about yourself?  strength/weakness? favorite class/subjectin nursing,and  least favorite?how would you respond to a rude surgeon? tell me about a time you faced a challenge and how did you proceed to solve?"}, {"date": "7 Jul 2017", "title": "Evs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sutter Health", "Interview Descriptions": "Interviewed by three people. They were very nice. They ask a list of behavioral questions. Study before your scheduled interview , research their website it als provides a list of sample questions they might ask as well as questions you can ask them.", "Interview Questions": "Tell us about a time you had a miscommunication with a customer, how did you handle it?"}, {"date": "14 Oct 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Sutter Health (San Francisco, CA) in Jul 2017", "Interview Descriptions": "Prepared a standout resume. Bussiness attire dress. Prepared some scenarios. The questions are pretty much straightforward question. Time management and prioritization scenario.  Stress management and critical thinking skills. dealing with staff. why did you choose nursing.", "Interview Questions": "What is the most challenging situation you have encountered in nursing?"}, {"date": "20 Oct 2017", "title": "Family Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Palo Alto, CA) in Jul 2017", "Interview Descriptions": "They called me a few weeks later after applying online. First interview was with nurse manager and then an in person interview with 2 MD,2 NP, 1 Pa and manager.  Each asked questions about skills and experience with procedures, geriatrics and pediatrics.  They also give you a five test  questions.", "Interview Questions": "Tell me about a typical day at your current job? What type of patients do you see? "}, {"date": "29 Jul 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Modesto, CA) in Jul 2017", "Interview Descriptions": "The phone interview is done over speaker phone with another team member listening in. Be prepared to answer questions that attest to your knowledge/experience.  The whole phone interview lasted about 15-20 min.", "Interview Questions": "How have you taken lead at your current job?"}, {"date": "25 Sept 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in May 2017", "Interview Descriptions": "14 individuals interviewed me ... way too many! A leader should be empowered to hire for their department. The process was very daunting and left a bad impression of the company and the department.", "Interview Questions": "Give me an example of a goal that you reached and how did you reach it."}, {"date": "22 Feb 2017", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "Panel interview with 4 member of the Unit I was applying. Very easy going and systematic. \r\n\r\nI had my interview at the end of one week and the following Monday was a holiday, I received my offer of employment on the Tuesday following my Thursday interview. I was asked to start the following Monday", "Interview Questions": "The questions they asked were all on the Sutter Web-site, the ones that can be found under interview tips, I believe. \r\nTell us about yourself?\r\nWhy sutter?\r\nA time you had a difficult family member?\r\nA time you had use your assesment skills and implement change?\r\nTime you took charge or showed leadership skills? Etc...\r\n\r\nI had my interview at the end of one week and the following Monday was a holiday, I received my offer of employment on the Tuesday following my Thursday interview. I was asked to start the following Monday "}, {"date": "1 Jul 2018", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Davis, CA) in Mar 2017", "Interview Descriptions": "Typical panel interview with manager and few employees. My interview was with manager and diet technician. Many general situational questions that company requires employers to ask. The interview took about 1 hour.", "Interview Questions": "Describe a time when you were faced with a stressful situation that demonstrated your coping skills."}, {"date": "21 Feb 2018", "title": "Healthcare Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health (Modesto, IL) in Mar 2017", "Interview Descriptions": "Panel interview with 5-7 people. It was very easy to talk with staff. Ask questions about the program's goals. Panel was large, but they made it easy to speak to each person, so you felt less nervous.", "Interview Questions": "How would you handle transportation issues for a patient?"}], [{"date": "18 Feb 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Had two rounds of interview. Everything went quite smooth. The person genuinely tried to hear about my experiences and skills. Always followed up on time. First round was on the phone. It was a screening interview with a few behavioral questions. Second round was a video interview. It was solely behavioral.", "Interview Questions": "Tell me about a time that you showed initiative to tackle a challenging situation"}, {"date": "7 Feb 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Vallejo, CA)", "Interview Descriptions": "Average- 3 rounds- phone interview, one of one interview and then panel interview. Asked behavioral questions -- your past work, stress questions, financial analysis question, past experiences. Phone interview took like 30 mins, 1x1 interview took like 1hr and panel interview took another 1 hour. They were not on the same day.", "Interview Questions": "Basic Generic behavioral questions"}, {"date": "1 Feb 2017", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Soquel, CA)", "Interview Descriptions": "I was contacted shortly after submitting my resume, and I had phone screens with the hiring manager and recruiter.  After the phone screens, I was contacted the next day and scheduled for an in person interview that took place the following week.  I had to take the day off work, as the drive was 1 1/2 hours one way, and it was clear that I prepared for the interview and thoroughly researched the company and individuals that I was met with.   I also sent a thank you note within three hours of my in person interview.  Nobody has bothered to get back to me, which shows a complete lack of courtesy and a complete lack of respect for the time and effort that I put into the process.", "Interview Questions": "What do you think will be the most challenging aspect of this job?"}, {"date": "10 Nov 2017", "title": "Case Management Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Sutter Health (Roseville, CA) in Feb 2017", "Interview Descriptions": "First a phone interview with the supervisor. Then a round table chat with all three managers (director included). If right for the role, a group interview ensues. Group interview is comprised of RN Case Management and Social workers.", "Interview Questions": "How can you handle situations where someone doesn't get their work done, and leaves it for the next day?"}, {"date": "13 Jun 2018", "title": "Desktop Tech I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (San Francisco, CA) in Feb 2017", "Interview Descriptions": "4 person panel interview. Overall very easy going and questions directly relate to the job. Some were personality based others were tech based. Just be your self and don't try to BS saying something you think they want to hear.", "Interview Questions": "If you had two importantly equal projects assigned to you and you found out both were not going to be completed. How do you go about this? "}, {"date": "17 Jan 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Sutter Health (West Valley City, UT)", "Interview Descriptions": "I was called and they did a phone interview, it went well so they invited me in for an in-person interview. It was a group interview and they asked basic questions. Or was fun and the interviewer was warm and personable. Fun interview process.", "Interview Questions": "What is your biggest accomplishment in the work place?"}, {"date": "4 Jan 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health", "Interview Descriptions": "It was a fairly easy process. It was quick and simple. Just how smoothly the interview and hiring process went, I knew it would be a great place to work. Everything from the application, the 1st and 2nd interview on through the background and drug screening took about a week's time.", "Interview Questions": "How well do you adapt to change?"}, {"date": "2 Feb 2017", "title": "Vice President, Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Sutter Health (Alameda, CA) in Jan 2017", "Interview Descriptions": "The entire process was \"messy\" to say the least.  \n\nThe final stage of interviewing was with the CEO, physicians, and Director group (17 people total). The CEO asked me if I had children, the physicians broke out into laughter as soon as I left the room, and the Director group was cold and disengaged.", "Interview Questions": "Do you have children?"}, {"date": "18 Oct 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Jan 2017", "Interview Descriptions": "Phone interview (screening) with recruiter, then the manager and finally a panel interview with the management team.   The phone interview was about 5 minutes in length, told me next steps if I was selected to the next round of interviews.", "Interview Questions": "My technical background"}, {"date": "20 Jun 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health in Jan 2017", "Interview Descriptions": "The process took around a month, and it consisted of two rounds of interviews. The first round was the usual phone screening. The second round was a video interview that focused on how my experiences demonstrate the skills that they are looking for (leadership, teamwork, etc.) \r\nThe process was great; the internship coordinator takes it serious and she is organized and timely. You are also asked for location preferences during the interview process.", "Interview Questions": "Give me an example of a time you completed a very complex project. Explain how you approached it."}], [{"date": "10 Mar 2018", "title": "Prep Cook Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Roseville, CA) in Jan 2017", "Interview Descriptions": "Fairly brief, similar to most interviews I have been too. Spoke about my experience and why I wanted to work for this company as well as my availability. Overall it went well.", "Interview Questions": "Why I wanted to work here?"}, {"date": "23 May 2017", "title": "Director of Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Sutter Health (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "Interview process was professional, followup took a very long time. There were multiple panel interviews with no feedback for over a month.  The interviews involved face to face, tela conference, and on the phone with a key decision mater.", "Interview Questions": "How I would manage an off site work force."}, {"date": "9 Nov 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "I was called in for an interview after applying three weeks prior online. The panel was two people, the manager and an HR person. They asked basic interview questions and nothing was a surprise, the interview lasted one hour. I was told it would be several weeks before they made their minds up but within four days HR was calling me with an offer. They were very happy to have me.", "Interview Questions": "How I worked with a diverse population. \r\nWhat I thought the most important part of my role in healthcare is."}, {"date": "3 Nov 2016", "title": "Training Coordinatir Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health", "Interview Descriptions": "Very pleasant and nice. The interviewer was very kind to provide information and was very engaging. It made the whole process very easy and pleasant. Definitely a good start and a good place and people to work with.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Oct 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sutter Health (Auburn, CA)", "Interview Descriptions": "It usually is a peer interview, consisting of 3-4 employees that you will be working with. Each employee along with the supervisor will ask a series of questions pertaining to the specifics of the job. They usually will ask you about yourself and what it is about you that would make you an asset.", "Interview Questions": "What is it that you can bring to the team?"}, {"date": "13 Oct 2016", "title": "Brand Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health", "Interview Descriptions": "Recruiter reached out to me on LinkedIn. Process was as follows: Had a phone screen with the recruiter, then with one of the marketing directors, and finally had an on-site interview with two marketing directors.  Then, after hearing no feedback for weeks, followed up with the recruiter a couple of times over email and got the runaround (and never any final decision) - very unprofessional, considering that I found out later through the grapevine that a few hires had been made. Luckily, shortly after I found a better job elsewhere.", "Interview Questions": "Tell us about a time you took a risk and what the outcome was"}, {"date": "26 Feb 2017", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Emeryville, CA) in Oct 2016", "Interview Descriptions": "Phone interview then two group interviews. First group interview met entire group in local office. Very impressed with local management in group - very professional and liked her management style - would have enjoyed working for her. Rest of the group were all fairly new employees.  Very disappointed with lack of professionalism of paralegal. Very disappointed with top management from SF. Very disappointed no one spoke up to improper interview question.  At last interview, very very apparent why the position was open.", "Interview Questions": "What year did you graduate"}, {"date": "6 Sept 2016", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Fairly good, like any other job interview you go in and then a manager will call you from the department you applied for and then they gave you an answer within the next couple of days", "Interview Questions": "Why are you wanting to leave your current job"}, {"date": "15 Aug 2016", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (West Valley City, UT)", "Interview Descriptions": "bout 2 weeks. I received a call from HR for an interview. I met with Cassidy Fernandez. Cassidy was very professional and polite. What impressed me the mother was her vast knowledge about the company and her enthusiasm. She had an answer to all of my questions. The interview went smooth and beneficial to both parties. Kudos! To management for having Cassidy in the front line hiring process. She showed great interviewing skills. (After all I got hired!;). After that I used Sutter's website and added my references. The people you list as references have access to the same website  to answer questions about the previous work or personal relationship with the applicant. After that is completed you are either hired or not. Best of luck!", "Interview Questions": "Tell us about a time when you  talked to an irrate customer and how did you had le it?"}, {"date": "13 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Vallejo, CA) in Aug 2016", "Interview Descriptions": "Formal panel, very matter of fact lots of behavioral questions. Very professional   and calm. attitude. The whole interview took 25 minutes. They had their poker face and did not give me a clue that I got the job. I got a call a week later.", "Interview Questions": "My favorite: what three things would your previous boss say about you?"}], [{"date": "15 Aug 2016", "title": "File Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "The supervisor contacted me by phone to set up the initial interview. She received my information from the computer system selecting me according to my on-line application. The supervisor met with me at the first interview, then during the second interview there was another file clerk present. Both of these were comfortable interviews. They were very good to answer my questions, as well. When we were finished I was given a tour of the office and met the team. It showed to be a place that was well coordinated with decent camaraderie between the employees.", "Interview Questions": "There were some questions of how I stay organized in my duties."}, {"date": "30 Aug 2016", "title": "EHR Service Desk Tech (Contractor) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Sutter Health (Sacramento, CA) in Aug 2016", "Interview Descriptions": "Applied online directly through their website, was contacted by a recruiter. I did a technical screen with the technical recruiter via Skype and was moved to a second interview with the hiring manager. The hiring manager I interviewed with stated how exhausted they were, seemed out of focus when speaking with me, eye contact wasn't all there, and seemed to be in a rush. Overall, it was a pretty neutral experience with the direct hiring manager, but was an amazing experience with the recruiter. The recruiter was quick and responsive. The interview with the hiring manager was standard.", "Interview Questions": "Tell me about what you do at your current job?"}, {"date": "13 Jun 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Fresno, CA) in Jun 2016", "Interview Descriptions": "Ok, the interview process. Very straight forward, clear, and easy. Everyone was really helpful, especially the recruiter, mine had an awesome Australian accent. He set up an interview with the hiring mgr, an appointment for the health screen and got me onboard as an employee. From applying online to first day of employment was a matter of only less than 30 days.", "Interview Questions": "N/A"}, {"date": "5 Jun 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Sutter Health (Roseville, CA) in Jun 2016", "Interview Descriptions": ". I applied for the ED RN position.The Interview was very informal, I met with 2 Nurse ED managers and another co-worker , in an office, almost like a panel interview. The managers were very calm, I was anxious initially then felt relaxed as the interview proceeded. Its was mostly behavioral questions.", "Interview Questions": "They ask me why I decided to work for Sutter Health\r\nTell me a bit about yourself\r\nThe most outrageous thing that ever happened to you in the ER\r\nHow do you to handle conflict"}, {"date": "9 Sept 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sutter Health (Davis, CA) in Jun 2016", "Interview Descriptions": "Review of work experience and knowledge going through the resume job duties and skills. Panel interview with 3 interviewers asking questions each asking on skill and experience. each person took notes as questions are being answered. Break down of the position duties that interview for and break down on benefits and pay. Day after interview called from supervisor called offer my self the position. it took 20 day in the whole hiring process. Drug screening background check and health exam.", "Interview Questions": "what is your experience with Epic, Hippa, patient demographics. etc"}, {"date": "23 Jun 2016", "title": "Medical Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Sutter Health (Livermore, CA) in Jun 2016", "Interview Descriptions": "The interview had 5 people. one doctor, three CLS and one hiring manager. I was totally unprepared for that many people being that it was my second interview I've had in 10 years and my first panel interview. I also took a tour of the laboratory and reviewed what I knew on a clinical level with one of the Clinical Laboratory Scientists. Everyone asked me 2 questions a piece.", "Interview Questions": "If I am unaware of a lab procedure, what would I do and would I go again protocol?"}, {"date": "8 Nov 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Redwood City, CA) in May 2016", "Interview Descriptions": "I was called and a message was left on my voicemail. Unfortunately, the return phone number was a generic number for the unit so it was a little difficult to get a hold of the manager. I was interviewed 2 days after the phone call was placed, the interview took about 90 minutes. I received a follow up phone call a few days later with an offer, however didn't accept the offer because of the pay rate.", "Interview Questions": "The manager kept things professional yet basic. The interviewer only asked questions based around myself and some about my work ethic. The interview itself took close to an hour and a half. I was shown around the department, introduced to the staff and we discussed our history in the medical field, our requirements on both ends for the position, hours, expectations, etc. The interview was very relaxed and the interviewer was quite personable."}, {"date": "2 Sept 2016", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Roseville, CA) in May 2016", "Interview Descriptions": "Excellent experience involving a wide range of pharmacy, nursing, and physicians.  The experience left me with a strong sense of the value the team places on the contributions that pharmacists make in a hospital setting.  I did not have the right experience to make the cut here, but I will apply again after I have more time at another hospital.", "Interview Questions": "Very specific situations from my past work history and how they applied to each question."}, {"date": "18 Jun 2016", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sutter Health (San Francisco, CA) in May 2016", "Interview Descriptions": "The interview process consisted of open interviews. The interviews were held in a conference room next to the cafeteria in the California Campus. There were many unit managers there to interview candidates one on one. The interviews lasted about ten to fifteen minutes with four to five questions. The experience was short and friendly. They notify applicants through letters of whether they got the position or not.", "Interview Questions": "Tell us about your nurse to patient interaction."}, {"date": "26 Apr 2016", "title": "Inpatient Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "I applied online. In about 3 weeks, I received a phone interview. Then I was offered an onsite interview. The managers were really nice. Questions during my interview were mostly personality questions and questions regarding my background and previous experience.", "Interview Questions": "Most are situational questions"}], [{"date": "12 Apr 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "Phone screen and then in person panel interview. The panel interview consist of management and directors. The interview as pretty standard as they asked questions regarding your experience and some behavioral questions.", "Interview Questions": "Tell me your experience?"}, {"date": "30 Mar 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Phone interview. All behavioral and situational questions. Use examples and reference actual experiences.  Was a very smooth process and the interviewers were wonderful. Not usually a fan of phone interviews but the process was actually smooth.", "Interview Questions": "N/A"}, {"date": "29 Apr 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (West Valley City, UT) in Apr 2016", "Interview Descriptions": "Checked in front desk for a walk-in interview after finishing my application online.  The lady was super nice and friendly.  She asked me for a cover letter and my resume and I had to answer like 10 questions that were easy to answer.  I took college classes on doing interviews, resumes,  and cover letters and that was one of the best courses I ever took in college.", "Interview Questions": "What are you're weaknesses?"}, {"date": "6 May 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Apr 2016", "Interview Descriptions": "Really straight forward. They asked a lot of clinical based questions and they like when you draw from your experiences. Everyone was very friendly and helpful. IT also helps to look on their website, they have some example questions and used a couple in the interview.", "Interview Questions": "Name a time when the group decided upon something that you didn't agree with, but you still went along with it."}, {"date": "27 Apr 2016", "title": "HIM Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Mar 2016", "Interview Descriptions": "I was interviewed by a panel of four people - each person asked one question. All of their questions were behavioral (i.e. \"tell me about a time when...\"). All of the people were on the younger side and dressed in business casual, so I didn't feel super-intimidated. Because there were only 4 questions, the interview went very quickly.", "Interview Questions": "\"Tell me about yourself.\""}, {"date": "16 Feb 2018", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (West Valley City, UT) in Feb 2016", "Interview Descriptions": "This was an internal posting, and I applied through the company website. I received notification from the hiring manager that they would like to schedule an interview. After having an interview the hiring manager, I then had a panel interview with 2 supervisors and a manager.", "Interview Questions": "Describe a situation where you disagreed with your direct supervisor/manager. What was your reaction? What was the eventual result?"}, {"date": "28 Jan 2016", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Santa Rosa, CA) in Jan 2016", "Interview Descriptions": "Easy application process and smooth interview. Interviewers were kind, professional and courteous. The process is very warm and progressive, would highly recommend to friends to apply. Sutter is a wonderful organization.", "Interview Questions": "Where do I see myself in five years?"}, {"date": "3 Dec 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Sutter Health", "Interview Descriptions": "Applied for the job. Got a call for a one on one interview 6 months later. Got a call back for panel a few days after one on one. Was offered the job next day.", "Interview Questions": "What is your greatest strength and weakness?"}, {"date": "5 Mar 2016", "title": "Senior Lean Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Sutter Health (Sacramento, CA) in Jan 2016", "Interview Descriptions": "Applied for the job on the Sutter Health.org site. Took many weeks to be notified of an interview opportunity. Interview was a panel of 6. Most of the panel was the team I'd be working with, including the Director. The interview was scheduled for 45 minutes: the first 30 with them asking questions, the last 15 for my questions. There were approximately 10 questions asked of me, mostly scripted behavioral questions. The interview ended on time. Was notified by phone that I did not get the job, \"We offered the position to another candidate.\"", "Interview Questions": "What is it that brings you to this work? And what excites you about it?"}], [{"date": "11 Jun 2017", "title": "Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health (Sacramento, CA) in Jan 2016", "Interview Descriptions": "I was originally interviewed by Launch Consulting, the Service Desk's contracting agency. The initial interview with Launch was pretty relaxed with a basic skills test that covered some CMD commands and Windows workflows. A few days later there was a second interview with Sutter and their management which focused on customer service qualities and general personality. The interview process took one week and the onboarding process took three weeks. After a year Sutter offered an internal hire position and the conversion process took three weeks.", "Interview Questions": "What command can you use to test the network connectivity of a device?"}, {"date": "12 Jul 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sutter Health (Oakland, CA) in Dec 2015", "Interview Descriptions": "Interviewed with the office manager and the team.  Friendly team and manager was nice. First it was Phone interview with recruiter. Second, one on one and lastly with key team members.", "Interview Questions": "Do you know how to schedule meetings with Outlook?"}, {"date": "26 Oct 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health", "Interview Descriptions": "For the position of the Medical assistant, a recruiter calls and confirms the interest in the position. Then they schedule you for a skills assessment prior to the interview. If you pass, they forward your information to the hiring manager. The interview was panel style. the Supervisor, lead and an MA. Most of the questions were scenario questions and they requested answers on what you have done and not what would you do.", "Interview Questions": "Name a time when you had a disagreement with management's decision on something, what did you do or how did you handle it?"}, {"date": "13 Apr 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Sutter Health in Nov 2015", "Interview Descriptions": "The whole process took about 3 weeks after receiving the first phone call to the phone call with telling me i did not get the offer. The process was very straight to the point. I was first contacted by the HR department then I was scheduled a phone interview with one of the leading doctors on the case.", "Interview Questions": "Tell me about your previous experience in a research lab?"}, {"date": "15 Sept 2019", "title": "CNA/HHA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Sutter Health (Sacramento, CA) in Nov 2015", "Interview Descriptions": "Panel/friendly - it was not in 2015, but in 2008. I am currently employed there, but looking at other opportunities for employment. I have little time and need to get ready to leave now.", "Interview Questions": "What to do in emergency"}, {"date": "13 May 2016", "title": "Chief Operating Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Sutter Health (Sacramento, CA) in Oct 2015", "Interview Descriptions": "Formal meeting with HR, Finance and Operational leadership.  Purposeful and direct, yet also very engaging and inclusive environment. While not explicit, they are seeking good cultural fit, not just skills and abilities.", "Interview Questions": "How do you lead change."}, {"date": "4 Jan 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Salt Lake City, UT) in Oct 2015", "Interview Descriptions": "I originally went through Prince & Perelson which I would NOT recommend to anyone!  DO NOT GO THROUGH A TEMP AGENCY. It was a irritating and lengthy process to finally become full on and I could have been earning bonuses but couldn't. When I finally became an employee I had to reapply but did not have to redo an Interview.", "Interview Questions": "What was a hard situation at work which you have dealt with and how?"}, {"date": "1 Oct 2015", "title": "Lean Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Sutter Health (Mountain View, CA)", "Interview Descriptions": "Pretty standard for the industry.  Describe previous work history, past projects that were successful and failed, meet with a few leaders and colleagues, why do you want to work for company, etc.", "Interview Questions": "Why do you want to work for company?"}], [{"date": "25 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sutter Health (Sacramento, CA) in Sept 2015", "Interview Descriptions": "Panel, good questions mostly on the behavioral side.  Prepare your answers as most of the questions surround how you work with others, describe actual situations for the questions. Practice youranswers so they roll off very natural.", "Interview Questions": "Tell me aboutatime when you made a mistake, how did you handle it?  How do you like to be managed?  How would you handle a coworker who was creating problems."}, {"date": "16 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "5 panel interview it was nice the people who interviewed me was nice it took like 45 min interview I was so prepared they I was nervous at fisrt but after that i did good the next day they called  me for another interview with the MD and I did good then that day they offered me the job", "Interview Questions": "what is pace rpogram"}, {"date": "15 Sept 2015", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "It was three week process, they background check, and criminal check. You interview two to three times and after its paid training for three weeks. The training is good but boring.", "Interview Questions": "how did you hear about us?"}, {"date": "2 Sept 2015", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "Panel interview in the cafeteria. Sort of a busy and strange place for all the personal discussion that occurs during an interview.  One person even sat down at the table I was sitting at and watched videos on his phone while I answered all the questions from the panel members at the other table.  No one said anything, he just stayed there watching his phone for 20 minutes!  All in all it was an experience I've never had before.  I am re-leaved in a way that I didn't get the job, what kind of workplace environment would it be???", "Interview Questions": "How would you introduce yourself on the first day to the other workers?????"}, {"date": "21 Feb 2017", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Roseville, CA) in Sept 2015", "Interview Descriptions": "Easy and comfortable. I was interviewed by two of our three bosses. I left the interview with a smile and a good feeling about the outcome. Sure enough, about a week later I got a call from HR with a job offer!!!!", "Interview Questions": "No tricks, just basic interview questions.Both bosses were great, We talked, laughed, AND interviewed at the same time. Painless!"}, {"date": "18 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Roseville, CA)", "Interview Descriptions": "Panel Interview; Maybe an hour long. Wide range of questions. A word of advice: check out Sutter's website, as it has a GREAT list of potential interview questions that you can use to mentally prepare yourself for the interview. Clinical scenario question felt intense-- think about your C-ABCDE (etc.) process, and you should be okay. Everyone I spoke to about the interview (who was hired) also thought they interviewed horribly, so don't feel too bad if you walk out feeling like you failed miserably.", "Interview Questions": "Scenario with admission that suddenly becomes unstable."}, {"date": "30 Sept 2015", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Sutter Health (Sacramento, CA) in Sept 2015", "Interview Descriptions": "My friend had referred me and I got an interview the next day after emailing my resume to a department manager. The interview went well. Interviewed with two nice ladies. They made it very calm and comfortable. The interview lasted 30 mins (they usually last about 10) she was really into talking to me and discussing her future plans for herself personally -I really thought and believed I did good. They then said that I will hear back on Wednesday (interviewed Tuesday). 3 Wednesdays passes by and I haven't heard anything. I emailed a thank you letter a week after- still no answer. The third week I sent a follow up letter and still no reply. I just wish they had a way of letting you know if you got the job or not. Whether it's a phone call or a automated email saying you didn't pass the interview.", "Interview Questions": "Why Sutter?"}, {"date": "16 Dec 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Oakland, CA) in Sept 2015", "Interview Descriptions": "I met with the Dept Manager and Assistant Manager on the same day.  They asked me questions, mostly, targeted toward my work history.   Other questions were to determine what skills I had acquired in my previous roles.", "Interview Questions": "Describe an interaction you had with a difficult co worker.  How did you work through the issue?"}, {"date": "8 Feb 2019", "title": "Vice President Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Sutter Health (San Francisco, CA) in Sept 2015", "Interview Descriptions": "Could be up to four rounds and  ten people, providing a good cross-section of employees at different levels, with an equal and balanced focus on  culture fit, technical knowledge, organizational dynamics. There were no case studies.", "Interview Questions": "What was the biggest challenge you faced and how did you determine your approach to solving it?"}, {"date": "13 Sept 2015", "title": "ISC Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Sutter Health (Salt Lake City, UT) in Sept 2015", "Interview Descriptions": "I was in a room with 6 managers and they were shooting questions at me. They really were vague on the job qualifications and one of the managers could not get off of the excel project process.", "Interview Questions": "Can you describe a shortcut that you have used on excel"}], [{"date": "7 Nov 2015", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health in Aug 2015", "Interview Descriptions": "Interview with two people. Took notes on laptops.     After interview they send a link for your references to fill out about you.  Interviewers were friendly. Stressed importance of call times and metrics.", "Interview Questions": "Why do you want to work here? What do you know about our company?"}, {"date": "6 Apr 2016", "title": "Content Management Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (Oakland, CA) in Aug 2015", "Interview Descriptions": "Friendly atmosphere, no stress and warm environment such as:\r\nDescribe a situation you successfully persuaded someone to see things your way.\r\nTell me about a time when you had too many things to do and you were required to prioritize your tasks.\r\nGive me an example of a time when you set a goal and were able to meet or achieve it.", "Interview Questions": "Behavioral and job related questions"}, {"date": "22 Jul 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (West Valley City, UT)", "Interview Descriptions": "You meet the managers and the supervisors for the first and only one on one interview. If hired, you get an acceptance letter and the step by step of the required hiring stages. Once you submit and meet the requirements, you are given an offer letter and your day of reporting.", "Interview Questions": "What makes you feel you are fit for this job?"}, {"date": "9 Jul 2015", "title": "RN Staff Nurse- ED Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Roseville, CA)", "Interview Descriptions": "I applied online and they called me to schedule the interview, The interview lasted  20-25 min. I one if the shortest interviews I have participated in. It was a 3 person panel interview", "Interview Questions": "Tell me about your favorite patient"}, {"date": "30 Jun 2015", "title": "Patient Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "Arrived, left my name with the front and was called in by the director after ten minutes or so. Was interviewed by the Head of the Department and Director of the Building. They had my resume in hand as they asked me questions about myself and why I wanted to work there.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Feb 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Murray, UT) in Jul 2015", "Interview Descriptions": "The process has changed since I started there. I believe they actually do video interviews now and also there are a couple more steps. They also hire through a staffing agency as well.", "Interview Questions": "N/A"}, {"date": "2 Apr 2019", "title": "Billing Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sutter Health (Murray, UT) in Jul 2015", "Interview Descriptions": "Questions related to past experiences related to the job and having me go over how I would use current knowledge to handle situations that come up in the job", "Interview Questions": "Questions about past  customer service and medical background and a few scenario questions"}, {"date": "24 Jul 2015", "title": "Staff Nurse II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Walnut Creek, CA) in Jul 2015", "Interview Descriptions": "Submitted online application with no word for a few weeks. Had phone interview, then a week later called in and had first and second interview same day with 2 different people.", "Interview Questions": "tell me something about yourself, why do you want to work for sutter. What experience do you have."}, {"date": "20 Jun 2015", "title": "Project Manager II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Sutter Health", "Interview Descriptions": "The process was extremely fast because there was an initiative that needed to start on a specific date. It took two weeks from first interview date to start date. Although there was time constraints the admin was helpful in scheduling time around my availability.  Human resources contacted my referrals immediately and upon accepting the offer gave me detailed instructions on next steps.", "Interview Questions": "How do I handle ambiguity."}, {"date": "1 Jul 2015", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Sutter Health (Roseville, CA) in Jun 2015", "Interview Descriptions": "I received the interview through a staffing agency called K Force the following day after the interview I heard back from Sutter and I was not selected. It was a panel of two women both women were very nice and friendly however they were only looking to hire about four or five people it is very important that you know some medical terminology such as HMO, PPO, and EPO and information about medicare", "Interview Questions": "Describe a time you had to deal with a difficult customer  "}], [{"date": "22 Oct 2015", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Sutter Health (Santa Rosa, CA) in Jun 2015", "Interview Descriptions": "I had 2 interviews first interview was one on one with a regional manager, second interview was with office manager, LVN and 2 medical assistants. They then call you and let you know if you got the job or not. If you get the job they then send you to Novato for computer training.", "Interview Questions": "Why should we hire you, what can you offer us at Sutter Health, describe a difficult patient and how you handled the situation, what are your strengths and weaknesses."}, {"date": "15 May 2015", "title": "LVN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Applied online. Received a call 4 days later. Went to the interview and I was expecting questions about the unit I applied for but they asked basic interview questions. They explained the whole hiring process to me and told me I would be contacted through HR about their decision. Received an email the following week saying that the position was filled.", "Interview Questions": "Why did you apply for this position?"}, {"date": "28 May 2015", "title": "Healthcare Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Sutter Health (Murray, UT) in May 2015", "Interview Descriptions": "A group of interviewees facing  a panel of interviewers. We introduced ourselves. They asked a couple of  group questions and then individual questions, then we were given a chance to ask questions.", "Interview Questions": "What is some constructive feedback you have received from your superiors?\r\nWhen did you have an opportunity to take on a leadersip role and what happened?\r\nhow do you prioritize your workload?"}, {"date": "26 May 2015", "title": "Project Coordinator () Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Sutter Health (Sacramento, CA) in May 2015", "Interview Descriptions": "Great initial meetings with team in Natomas office. Had offer made to me through one staffing agent and then continued to interview with another agency for other positions I was more interested in.", "Interview Questions": "what are your strengths"}, {"date": "14 Apr 2015", "title": "Know Your Stuff! Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health (Salt Lake City, UT)", "Interview Descriptions": "Pretty standard, turned in an application and received a call just a few days later. Met with a recruiter, whose job it is to make you feel you are important and a really good candidate (so don't be fooled) :) The recruiter said they would get back with me several weeks ago, and even though I have attempted to contact they are always unavailable.", "Interview Questions": "Know everything on your resume! I was grilled on nearly all aspects from positions, duties, accomplishments, even dates of employment!"}, {"date": "15 Jul 2016", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sutter Health (North Sacramento, CA) in Apr 2015", "Interview Descriptions": "They have you do tests before an interview. The math test is easy but the other is hard unless you're right out of school. They ask a lot of questions study very gard", "Interview Questions": "Describe yourself"}, {"date": "16 Apr 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health in Apr 2015", "Interview Descriptions": "I received an email to schedule an interview which was a week later. I went in and gave them my resume and other items they asked for(Certs) I then was called in and it was basically a skills test to see what clinical skills I had such as picking the right medication. I was given scenarios and asked what I would do in that situation. I was handed a syringe and told to put such and such amount of air in the syringe. And then asked a few questions about what type of worker my coworkers would say I am. I was then told to wait outside the room and wait for an HR rep to come get me.  I was then taken to another room and offered a position and instructions on what comes next.  I stressed over it  alot more than I needed to.", "Interview Questions": "If my former coworkers were asked what am I like to work with, what would they say?"}, {"date": "11 Nov 2015", "title": "Diagnostic Imaging Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Apr 2015", "Interview Descriptions": "They called me to verify my interest in the position. Then they set up an interview a for a couple weeks later. I had to go online and complete some task prior to my interview. Went in for my interview and was offered the job a few says later. Then there were more pre-employment tasks for me to complete prior to my start date.", "Interview Questions": "Have you ever had a conflict with another co-worker? If so, had did you resolve ita?"}, {"date": "28 Feb 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (West Valley City, UT) in Mar 2015", "Interview Descriptions": "It’s not that long. Only had to do one interview . It takes a little bit for the background check to come back because they are in the healthcare field.", "Interview Questions": "How would you handle certain situations"}, {"date": "21 Apr 2015", "title": "PHARMACST Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Sacramento, CA) in Mar 2015", "Interview Descriptions": "Phone interview, panel - approximately 1 hour in duration.  Friendly experience.  Each panel member took turns asking questions.  Approximately 4 individuals were involved in the panel.  Surprisingly, they only required a phone interview and did not need to interview me face to face.", "Interview Questions": "Traditional scenario type question."}], [{"date": "1 Feb 2016", "title": "Human Resources Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Sutter Health in Mar 2015", "Interview Descriptions": "I was contacted by recruiter after applying online.The recruiter scheduled a Phone screen. Typical screening questions. I was contacted 2 months later for the panel interview with Sr Leadership. Panel interview was straight forward no difficult questions. Mostly behavior style questions", "Interview Questions": "What type of Management style do you prefer?"}, {"date": "20 Feb 2015", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Palo Alto, CA) in Feb 2015", "Interview Descriptions": "First had a phone interview asking the typical interview questions (why this job? why health care? etc.)\r\nAfter about a week I got invited to an in person interview. 2 hour interview process. Had a 90 minute exercise that tested word applications knowledge. Afterwards, had to present the work from the exercise to a panel and then finished off with a panel interview.", "Interview Questions": "What was an uncomfortable situation you have been in and how did you handle it? What is your greatest accomplishment? Do you value quality of work or quantity (getting it all done in time)?"}, {"date": "7 Apr 2015", "title": "Accounts Payable Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Sutter Health (Roseville, CA) in Feb 2015", "Interview Descriptions": "Face to face at company facility. Interviewer explained what functions were at the location, what the duties of the position were, and what would be expected of employees in the position. Interviewer also explained how their new process was implemented and how it was working so far.", "Interview Questions": "What is your experience level and what were some of your daily job duties?"}, {"date": "31 Jan 2019", "title": "Home Health Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Alameda, CA) in Feb 2015", "Interview Descriptions": "Easy and simply. Applied  the company called the next day . Interviewed and orientation the following week. Simple questions and tests. Then background check and orientation with a group of other people. 8 hr orientation", "Interview Questions": "How to you handle a stressful situation?"}, {"date": "29 Jan 2015", "title": "Admitting Clerk Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Submitted application on their website, one of over 100 I have submitted and was called for an interview. I sat in front on a panel of 4 ladies and was interviewed in tandem by them all. It was a little awkward trying to maintain eye contact and feel confident with 4 people staring at you.", "Interview Questions": "There really wasn't a difficult question"}, {"date": "10 Mar 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Jan 2015", "Interview Descriptions": "I went there pretty early and went to a coffee bar a little bit. then i went to the conference room there are 3 people together. asked a lot of questions. the whole process was around 39 mins. no pressure at all .at last i was told to go home waiting for reply", "Interview Questions": "why you choose this job"}, {"date": "16 Apr 2016", "title": "Director, Non-clinical Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Sutter Health (Sacramento, CA) in Jan 2015", "Interview Descriptions": "First call was with human resources as a phone interview, VP interview and then panel interview. There were four people on the panel interview. First call was with human resources as a phone interview, VP interview and then panel interview. There were four people on the panel interview.", "Interview Questions": "Most of the questions were scenarios."}, {"date": "11 Sept 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (Palo Alto, CA) in Jan 2015", "Interview Descriptions": "At the time I applied for the job, the clinic had just barely merged with Sutter, so my comments can't be viewed as representative of Sutter. A friend of mind who is a doctor at the practice, invited me to apply so I did. I interviewed with 3 doctors and one nurse, but not as a group. The interviews were 1:1.", "Interview Questions": "What made you want to apply here?"}, {"date": "2 May 2015", "title": "Housekeeping Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Davis, CA) in Dec 2014", "Interview Descriptions": "Process took about 2 months for the call for an interview. Interviewed with two people manager and Housekeeping lead. Manager was really nice but the lead was really uninterested. Two days later I get a email stating the position was filled. I called the manager she stated they went with someone else. I felt the interview was a waist of time and they knew who they was going to go with before I interviewed.", "Interview Questions": "How much experience do you have in housekeeping"}, {"date": "27 Apr 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Sutter Health (San Jose, CA) in Dec 2014", "Interview Descriptions": "multiple requests for return interviews all of which lasted between 3 and 6 hours without any guidance as to requirements and the software for negotiating the application process took multiple attempts with over 28 hours required for correcting and re correcting mistakes made by the internal computer processing of the application.  AT least messages left for help were returned within 48 hours.", "Interview Questions": "how much experience have you had within your field?"}], [{"date": "10 Nov 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Sutter Health", "Interview Descriptions": "I had 2 panel interviews and a one on one with the hiring director. About 6 people on each panel. It was a long process from the time I applied. About 2 months. Be prepared to answer many questions from all people on the panel. I would say out of all of the places I have interviewed, it wasn't the hardest, but it wasn't the easiest either. They did really pick apart my resume. Mostly to see if it was accurate.", "Interview Questions": "Most questions were situational. How I would handle difficult situations. "}, {"date": "11 Jun 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Nov 2014", "Interview Descriptions": "Interview with hiring Supervisor and staff. Interview was held on-site. The interview lasted one hour with the hiring Supervisor and 30-45 minutes with the department staff. The interviewer had a prepared list of questions that he asked every candidate. The staff interview as less informal, and was geared to personality and character fir into the department. A follow-up for the decision process was communicated to take about one week.", "Interview Questions": "Experience specific"}, {"date": "23 Oct 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sutter Health", "Interview Descriptions": "Interview process was very thorough.  Was asked to provide a web-based video interview as a screening step - then interviewed with recruiter, hiring manager, executive team and had 2 panel interviews.  The staff seemed prepared and engaged in the interview process.", "Interview Questions": "This question was unexpected:  what could your current employer do differently to keep you from leaving?"}, {"date": "20 Aug 2017", "title": "Clinical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Crescent City, CA) in Oct 2014", "Interview Descriptions": "Panel interview- round robin questions. In my case, the interview was held over the phone via a conference call due to the remote location of the affiliate (Crescent City, CA) versus the location of the main offices (Sacramento, CA). The questions focused on my clinical experience and what I could bring to the table by working in informational services.", "Interview Questions": "Are you ready to transition away from bedside nursing?"}, {"date": "27 Apr 2017", "title": "EBA Specialist Customer Service Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Murray, UT) in Sept 2014", "Interview Descriptions": "First it was a phone interview. Then after that if was a video interview that WA taped and recorded. They a group interview at the facility with 5 other interviewees.", "Interview Questions": "Why do you like helping people."}, {"date": "15 Jul 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health (West Valley City, UT) in Aug 2014", "Interview Descriptions": "Interviewed on-site and the interview took 10-15 minutes. Met with one HR person and she asked somewhere between 5 to 10 questions. The questions were primarily related to customer service and a little about my previous experience.", "Interview Questions": "How do you handle speaking with someone who is upset or frustrated?"}, {"date": "1 Apr 2015", "title": "Account Management Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sutter Health in Aug 2014", "Interview Descriptions": "Complete online application, get a call from manager/phone interview and lastly in person interview.\r\n\r\nThis process took a very long time. Also I hadn't been briefed before coming for my in person that I would be meeting the entire team.\r\n\r\nI thought this would just be meeting the hiring manager and getting a feel for it. Then the 2nd meeting would be a panel. I wished I had known it was. Combined interview so I was better prepared.", "Interview Questions": "Had the whole team interview me"}, {"date": "9 Jun 2015", "title": "Health Care Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Sacramento, CA) in Aug 2014", "Interview Descriptions": "got email from a recruiter and set up interview with her. Interviewer was very friendly, and nice. asked basic question about past experience and some behavioral questions. what changes want to make.", "Interview Questions": "Interviewer was very friendly, and nice. asked basic question about past experience and some behavioral questions. what changes want to make."}, {"date": "10 Jul 2014", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health", "Interview Descriptions": "For the most part the hiring and interview process was pretty standard. What they seemed to be looking for was experience versus any degrees that you currently hold. The questions that they asked were very straight forward and there were a few questions where they asked some \"get to know you\" type questions to see if you were someone that would fit into the company atmosphere.", "Interview Questions": "What would you say is one of your flaws? and How would you deal with a difficult coworker/peer/manager?"}, {"date": "7 Jul 2014", "title": "LinkAges Program Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Sutter Health (Palo Alto, CA)", "Interview Descriptions": "Process took about a week for somebody to call me for an interview. Met with two people and they were all fairly nice. Asked questions about my work experience and how it relates to the position. Asked about specific job experiences and what I accomplished and what challenges I had. Asked many questions about team work and working in groups and how I overcame challenges for that as well.", "Interview Questions": "What duties did you have during a specific volunteer experience?"}], [{"date": "21 Jun 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Sutter Health (Rancho Cordova, CA)", "Interview Descriptions": "Consisted of phone interview with recruitment manager, interview with hiring manager, and several panels. The recruitment manager was very thorough, asked very thoughtful questions, and accurately represented the organization, culture, and challenges of the role. Panel process was not very appealing-too many people that didn't seem completely engaged. Interviewing should marketing on both sides.", "Interview Questions": "How would you affect change with an organization with a strong culture and somewhat set ways for running the business?"}, {"date": "5 Jul 2014", "title": "Quality Review and Risk Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Sutter Health in Jun 2014", "Interview Descriptions": "Interviewed via phone for an interim management position.  Thorough reference check, basic orientation done on the fly by director and human resources due to vacations.  Hired as interim manager while company actively recruits for the position. Company transparent about this being a high turnover position with extremely poor retention of employees in the department.", "Interview Questions": "What can you do to help us improve retention ?"}, {"date": "2 Apr 2016", "title": "Project Manager II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Sutter Health (Emeryville, CA) in May 2014", "Interview Descriptions": "I had a phone screen, then a group interview with my prospective team, then a one-on-one with the Chief Executive of that team, then another group interview.  All the interviews were in-depth and lengthy.  I learned a lot about the team and the company in that time.  All in all it took more than 3 months.", "Interview Questions": "How comfortable are you working independently?"}, {"date": "5 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health", "Interview Descriptions": "Many many applicants per position, helps to know someone already working in the department. Initially apply online and complete questionnaires about work history and experience. If pass online questionnaires, then application forwarded to department management. Initial interview with department managers, second and sub-sequential interviews usually with peer staff members in collaboration with management.", "Interview Questions": "What is your approach to your personal workload and the workload of others?"}, {"date": "24 Mar 2014", "title": "Accounting Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Sutter Health", "Interview Descriptions": "I applied online through my school for an internship with Sutter and heard back from them a little over month and a half. The interview was pretty typical, had questions about my customer service experience, why do I want to study accounting, etc. Overall, it has been a good experience and I am happy that they wanted me to join their team.", "Interview Questions": "Nothing out of ordinary, just questions of why you would be a good fit, why do you want to study accounting, etc."}, {"date": "16 Dec 2015", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (West Valley City, UT) in Feb 2014", "Interview Descriptions": "Email confirmation and set up through phone call. Interview was easy and enjoyable, but did not prepare me for what to expect on the job. I did have to drug test. One nice things is if you miss the call, they will leave a voicemail and try again. It's not like other employers if you miss the call that's your only chance.", "Interview Questions": "What do you know about this company?"}, {"date": "3 Jul 2016", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Sutter Health (Sacramento, CA) in Feb 2014", "Interview Descriptions": "Was 2 day process , also involved meeting and lunch with peers which was good to get questions answered. Went over the organization and answered questions and concerns. Also had chance to see clinic area and setting . Asked about skill set and expectation.", "Interview Questions": "average patient load managed"}, {"date": "10 Jan 2014", "title": "Accounting Intern Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sutter Health", "Interview Descriptions": "I was able to get this position through an acquaintance. The questions I got asked were pretty typical : Tell me about yourself? Why do you think you would be a good fit? What are your past experiences?", "Interview Questions": "Why work in healthcare?"}, {"date": "7 Dec 2015", "title": "Administrative Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Sutter Health in Jan 2014", "Interview Descriptions": "Onsite at my school with one of the preceptors for the 3 different internships. it was very smooth. they have since changed the process to make it more formalized and they now interview folks from all over the country for the summer intern positions.", "Interview Questions": "experience? \r\nbehavioral questions"}, {"date": "11 Nov 2013", "title": "Implementation Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sutter Health", "Interview Descriptions": "- Easy interview process consisted of 1 phone screen and 1 45min in-person interview\r\n- Recruiter was not responsive and did not show up for initial scheduled phone call", "Interview Questions": "- No difficult questions. All pretty standard behavioral questions specific to the job.\r\n- Example what are 2-3 qualities that make a good trainer and why"}], [{"date": "6 Nov 2013", "title": "Dermatologist/Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sutter Health", "Interview Descriptions": "Great interview process but long - 2 days in total. They cover all expenses and reimburse everything as well. My husband was able to travel with me for the interviews and expenses were covered for him also. First day: Tour of clinic and several meetings (both group and one-on-one) with internal medicine and Derm dpt. Last interview session is 1 hour and is a behavioral interview.", "Interview Questions": "Tell us about a time you disagreed with your boss and what you did in that situation. What did you learn from it?\r\n"}, {"date": "22 Mar 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Sutter Health (Rancho Cordova, CA) in Nov 2013", "Interview Descriptions": "First was a phone interview, then a face to face with the Director of a department. Then interviewed by a panel, including several people from different locations that were brought in via video conferencing. Each experience was very positive. The interviewers worked hard at putting me at ease. Very professional, friendly atmosphere.", "Interview Questions": "All were very common interview questions. They did ask me \"to walk them through my resume\"."}, {"date": "30 Oct 2013", "title": "Account Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at Sutter Health", "Interview Descriptions": "Phone interview was quick and easy. Went to panel interview, went well. Was told would find result in 2 weeks minimum. Follow up for two week, all I got was the run around. After 2 months, received a generic email stating a better candidate was selected.", "Interview Questions": "What is your daily production?"}, {"date": "14 Dec 2016", "title": "Claims Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Sutter Health (Roseville, CA) in Sept 2013", "Interview Descriptions": "It was fairly easy.  They asked the basic questions.  Interviewed by 2 people, and then was called five minutes later to interview with another.  After the interview I was called in by another person on the other side of the building who asked me how I felt the interview went and they had me sign a form to run background check", "Interview Questions": "what makes you qualified, what can you bring to the team, How have you handled a situation with a coworker "}, {"date": "8 Dec 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Sutter Health (Sacramento, CA) in Aug 2013", "Interview Descriptions": "The interview process was like any other I had a phone interview and then received a call from the hiring manager. I had a panel interview for this position since i would be working with different vendors.", "Interview Questions": "How do I feel I will contribute my skills to this position."}, {"date": "22 Aug 2013", "title": "Department Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health (Sacramento, CA) in Aug 2013", "Interview Descriptions": "I have been trying to get on with Sutter Health for over a year. I had been called in to panel interviews at 3 different locations. The last one was at the location on F Street in East Sac. While all the interviews went well, I wasn't selected for reasons that weren't explained to me. My last panel interview went very well. It was pretty standard without any \"gotcha\" questions. I was told that they had to interview other people, and that they would be getting back to me soon. I figured that was another rejection so I was very surprised when they called me while I was on my way home to tell me I got the job. I am so looking forward to working there, and hope to show them I am a valuable employee who brings their best to every task given.", "Interview Questions": "There weren't any difficult of unexpected questions. I've heard a few in other interviews like \"What are you passionate about?\" Sheesh!"}, {"date": "6 Dec 2013", "title": "ETL Architect Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sutter Health in Aug 2013", "Interview Descriptions": "It went fine. Had 4 people on the call. call was focused more on leadership , people management abilities", "Interview Questions": "how would handle difficult person in your team"}, {"date": "20 Sept 2013", "title": "Infrastructure PM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Mather, CA) in Aug 2013", "Interview Descriptions": "Inistial interview in phone. Fairly short, but to the point.  Got immediate feedback as to how I did.  Feed back was good which led me to think I'd make it to the next round which I did.  In person interview was within 2 weeks and had representatives from 3 areas relating to the position.  Process was quite informal and also went well.  Withing 10 day received an offer which I accepted.", "Interview Questions": "Most unexpected thing that happened was that the hiring mgr for this position attended the final in person interview and just commented that we had already spoken as he did the previous phone interview, and that he didn't need to ask anymore questions as he was satisfied with my previous answers and he was okay with me as far as he was concerned."}, {"date": "25 Jun 2013", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sutter Health (Mather, CA)", "Interview Descriptions": "Interview process was a joke.  In my case, the interviewer had no clue what Project Management really is or how to identify a skilled project manager.  I interviewed for other Sutter Health FTE positions while contracting.  Those interviews were better, but still mostly very general.  The hiring managers are not very adept at knowing how to identify and hire resources best suited to growing the organization.  Often, the hiring manager is too busy and would send a junior team member to conduct the interview.", "Interview Questions": "Very basic interview questions, essentially reiterating the same information presented on my resume."}, {"date": "4 Jul 2013", "title": "Research Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sutter Health", "Interview Descriptions": "Was an online interview through webcam. Not very friendly and quite  intimidating. microphone was not clear at all in their end and they asked very random questions not relating to programming at all", "Interview Questions": "Testing different types of case studies when my position encompassed programming"}], [{"date": "27 Sept 2013", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Jul 2013", "Interview Descriptions": "The interview process was very easy. There is really no wrong awnser. It is usually over the phone, however my experience was in person. They basically just want to know the reason you want to volunteer at their hospital. There is no stress or complications, everything went smoothly and a lot of good help from the volunteer services.", "Interview Questions": "Why do you want to volunteer?"}, {"date": "31 May 2017", "title": "Clinical Nurse Resident (New Grad) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Sutter Health in Jul 2013", "Interview Descriptions": "Panel interview with 6 people, including residency manager, a charge nurse and an assistant manager, and a couple nurse educators. \r\n\r\nEach panel member asked one question from  scripted paper in turn. At the end the panel was given an opportunity to ask questions. It happened to be the two people in the department I was hired for were the ones to ask additional questions. One focused on my past work experience, the other asked about an internship project.", "Interview Questions": "Tell me an example of dealing with a difficult patient/physician"}, {"date": "6 Oct 2014", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Sutter Health (Roseville, CA) in Jul 2013", "Interview Descriptions": "Easy, this wasn't difficult, the interview was basically informal. They asked basic questions and more of behavioral questions. I spoke with one of the leads and they were really chill and easy going.", "Interview Questions": "N/A"}, {"date": "16 May 2013", "title": "EHR Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Sutter Health", "Interview Descriptions": "2 interviews back to back. 1st one with management the 2nd with the leads for the EHR Service desk. Pretty general questions about IT stuff from the technicians. Management just asked general question like why do you want to work here etc.", "Interview Questions": "I didn't encounter anything crazy. Just your standard IT questions."}, {"date": "3 Feb 2014", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sutter Health (Berkeley, CA) in Apr 2013", "Interview Descriptions": "Hiring process does not take too long, about 3-4 weeks to get an interview. You meet with person who is in the current role and then the doctor you are working with and then the hiring manager. Very smooth process.", "Interview Questions": "Why do you want to work at sutter?"}, {"date": "16 May 2014", "title": "Hopital Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Mar 2013", "Interview Descriptions": "Called me back a long while after I applied. I almost forgot I had applied. Came in for a 5 person panel interview and aced it. Invited the same day to come back the next day for another interview. Aced it and offered position on drive home. Started my process with employee health and was working within 2 weeks or less.", "Interview Questions": "None really, just typical questions about strengths and weaknesses and prior experience. one or two \"Name a time when...\" questions."}, {"date": "26 Aug 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Sutter Health (Sacramento, CA) in Mar 2013", "Interview Descriptions": "You were questioned by about 5 people form the office. They asked multiple questions that were pertinent to this job position. They also reviewed your resume. It was slightly stressful since there were multiple people in the room interviewing you.", "Interview Questions": "Why do you want to work in this office?"}, {"date": "27 Oct 2015", "title": "Director of Risk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Jan 2013", "Interview Descriptions": "questions related to job qualifications as well as experience with claims, loss runs, insurance.  experience with physicians, clinicians, and teams.  strengths and weakness, dealing with confrontation, dysfunctional teams, problematic employee.", "Interview Questions": "why do you want to work for Sutter?"}, {"date": "21 Nov 2012", "title": "Clerical Support Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Murray, UT)", "Interview Descriptions": "I was called & did a quick on the spot phone interview, questions like:\r\nWhats your ideal working enviorment? Whats your most greatest accomplishment at your most recent job?  what do you think is most needed in the workplace  for you 2 be happy.\r\nthen called in with 2 peop", "Interview Questions": "If you were interviewing a potential canidate, what would be more important , attitude or knowledge and why? "}], [{"date": "27 May 2014", "title": "HMO PPO Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in Sept 2012", "Interview Descriptions": "A little tence which is expeted and with a great suppervisor and staff members that were in the panel. I have a wonderful job and plan on staying here as long as I can.", "Interview Questions": "N/A"}, {"date": "12 Aug 2012", "title": "AR II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA)", "Interview Descriptions": "Applied online, Manager called me... went in for a interview and was hired about 4 weeks later.", "Interview Questions": "N/a- easy questions. "}, {"date": "13 Jun 2012", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sutter Health (Sacramento, CA) in May 2012", "Interview Descriptions": "Interview was initiated by department admin, throughout the whole process I did not have any interaction with a recruiter or someone from HR until the end when I got a boiler plate thank you for applying email.  The process started with a group phone interview, followed by a panel interview, followed by another panel interview and ended with a skills test and the process is dragged out between multiple days requiring to take a decent amount of time off if you are currently working.  All the questions are very engaging, open ended analytic in nature and throughout the dialogue you gain a good sense of the role and responsibilities.", "Interview Questions": "Why do you want to work at Sutter?"}, {"date": "24 Oct 2015", "title": "Supervisor Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Feb 2012", "Interview Descriptions": "phone screen, 1:1 screen with direct hiring supervisor, followed by 2 panel interviews- 1 with management and 1 with direct reports. The recruitment team needed to do background checks on any country you've lived in for more than 4 months, this process delayed my start date by nearly one month. They only have orientation sessions every 2 weeks which can also delay start dates.", "Interview Questions": "tell us about a time where you had to deal with a difficult employee"}, {"date": "2 Dec 2014", "title": "Facilities Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Sutter Health in Jan 2012", "Interview Descriptions": "Came in as a temp. Then there was no interview, but once you start on as a permitted employee, you must pass a background check, drug test and physical. Other departments have a phone interview, then a one on one, then a panel interview.", "Interview Questions": "None, I started as a contractor through a local temp agency. Not the type that has a rediculious amount of perks."}, {"date": "7 Feb 2012", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sutter Health (Emeryville, CA) in Dec 2011", "Interview Descriptions": "The recruiter and director didn't seem very organized and were on two different schedules. The recruiter insisted that they should have the chosen candidate by the end of the week after I interviewed but the director said it should take at least 3 weeks. \r\n\r\nAfter playing phone tag with the recruiter on the initial set up of the interview we finally got in touch, mostly technical questions were asked leading me to be in the top 4 candidates chosen. The interview with the director went pretty smooth and no challenging questions were asked in which I prepared for. After consistently checking up with both the recruiter and director they ensured to keep me up to date on the decision making process. During the fourth week the recruiter didn't return my call or e-mail so I ended up frantically searching for jobs again, to my amazement they had re-posted the job that they had taken down 3 weeks prior. Since there were only 3 other candidates I felt deceived that I wasn't even notified about the process taking longer than originally planned. \r\n\r\nThe sixth week is when I got a generic \"this position is no longer available\" e-mail. I wrote the recruiter to thank her for her time and she wrote back a snobbish letter in which I thought was very unprofessional. Doubt I'll ever look at Sutter Care at Home job opportunities again due to the ill and unprofessional treatment of the recruiter.", "Interview Questions": "What transferable skills from previous experience can you apply to this position?"}, {"date": "19 Aug 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Sutter Health (Mather, CA) in Sept 2011", "Interview Descriptions": "Interviewed after flying across country to interview with another country and drove to Sacramento to meet with Sutter staff on a different day. Met with several people on the leadership team. Couldn't meet with two, as they were at another site, but did phone interview while I was there. I ended up having to miss more work to fly out for another interview to meet the two people who I phone interviewed with before. I met with one person for an hour and the other person could not be bothered to show up. So, missed two days of work for a one hour interview.", "Interview Questions": "Lots of questions, met with a bunch of people. All related to leadership "}, {"date": "27 Jul 2011", "title": "Support Ops Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Sutter Health (Sacramento, CA) in Jun 2011", "Interview Descriptions": "It was great. I already worked for the company and they offered me the promotion", "Interview Questions": "N/A"}, {"date": "21 Aug 2013", "title": "Site Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Sutter Health (Castro Valley, CA) in May 2011", "Interview Descriptions": "Went through 3 rounds of interviews - including a panel interview with entire Business Office supervisory/management team", "Interview Questions": "Nnone.  It was simple."}], [{"date": "7 Sept 2011", "title": "Systems Engineer III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Sutter Health (Rancho Cordova, CA) in Apr 2011", "Interview Descriptions": "I was called for a phone interview with the hiring manager.  My technical skills were explained and he thoroughly enjoyed my background on various items.  He informed me that a further one-on-one interview would be necessary with a panel of technical folks.\r\n\r\nOn the day of the one-on-one interview I arrived at the location on time.  I was escorted and taken to a conference room where there was a panel of people with various technical expertises from Web Developers, Production Support, Managers and Engineers.  Most of the panel were men along with only one female.  Various questions were asked from windows IIS servers, Weblogic, Database and Linux/Unix.  I felt confident about my answers.  At the end of the first round, I was taken to another waiting area and was asked to wait around 15 minutes for them to decide if I made it to the second round.\r\n\r\nAfter 15 minutes, the hiring manager came to escort me out of the building, he proceeded to explain that I didn’t qualify for the position because I didn’t have enough Windows 2008 Server experience along with IIS 7 which I found it almost laughable since his staff learned the technology four months before my interview.  Usually my experience on Unix/Linux is a demonstration that I can learn just about any operating system but that was not the case here.  Windows trumped Unix?  When has anyone seen that before?    The hiring manager seemed very heart broken that his staff of technical folks didn’t want to proceed with a second interview which lead me to believe that something else was at work.  To be told that I was not technical enough because I didn’t know one piece of a technology is a flat out lie and that leads me to believe they were making an excuse.\r\n\r\nI got the impression that this is a Good O Boys shop.  There was only one woman in the interview panel which was a Manager and I didn’t see many women working in the Information Technology building.  I’ve never heard of a job that requires people to know exactly every piece of Technology and not be given an opportunity to learn new items on the job.", "Interview Questions": "N/A"}, {"date": "24 Aug 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Mar 2011", "Interview Descriptions": "There was a phone interview, several in-person interviews and two panel interviews followed by a personality type test and a drug test.  Panel interviews were not with the same people who interviewed me one-on-one.", "Interview Questions": "What about this job appealed to you?"}, {"date": "13 Feb 2014", "title": "Applications Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Sutter Health (Sacramento, CA) in Feb 2011", "Interview Descriptions": "30-minute phone screen with 2-3 current staff to review resume elements;\r\n\r\n60-minute panel interview with 7-8, including hiring manager;  round-robin approach to pre-scripted questions, with no/minimal ad-hoc questions;  10 minutes reserved at end for application to ask questions", "Interview Questions": "\"Build me a snowman\".  "}, {"date": "14 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Sutter Health (Modesto, CA) in Feb 2011", "Interview Descriptions": "It was a panel interview with managers, educators, and other RN's. I first had a phone interview and then an in person panel interview was set up. I was notified by my recruiter within a couple of hours that I had been offered the position.", "Interview Questions": "Very generic canned questions were asked. \r\n\r\nFor example:\r\n\r\n Tell me about a time when you had a difficult patient?\r\n Tell me about a time when you had a conflict with a coworker?\r\n What would you do in ____ situation?\r\n What medication would you anticipate giving to a patient with XYZ symptoms?"}, {"date": "8 Mar 2012", "title": "Strategic Planning Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Sutter Health (Sacramento, CA) in Nov 2010", "Interview Descriptions": "Very laborious process.  They had my resume for about 4 months before they called.  Started with a phone interview with the hiring manager.  That went well so I was invited for a 1:1 interview.  That also went well and I had good rapport with the hiring manager.  He asked me to appear for a panel interview which got a bit riduculous.  There were 6 people present in the room and three others attended from another office location via teleconference.  Nine people...barely enough time for each person to ask one question, and I never knew where the next question was coming from.  I felt like I was being vetted for the supreme court.  This was for an upper level analytical position; individual contributor...not even a manager or director.  I felt it was overkill.  Furthermore, I didn't have good rapport with some of the folks in the room.  Manager called a few days later and offered me the job.  I was surprised...didn't think the panel had gone well, but boss obviously liked me well enough to (perhaps) overrule them.  Since no one from the team I would be working with directly was part of the panel, and since I was on the fence (liked the boss but maybe not the larger group) about the position, I asked to be able to meet with the team I'd be working with to help make up my mind.  Not sure what the boss told them; again, I had already been offered the job.  They put me in another panel with the team (three of them vs. me...and it was \"versus\") and the team grilled me hard.  I wanted to laugh and say, 'you guys know that I've been offered the job and I'm trying to decide, right?'\r\n\r\nI ended up accepting the offer after making some demands and it worked out fine, although I was right about some of the folks on the panel.", "Interview Questions": "Tell me about a time you were asked to present unpopular data/findings; how you did it; what the outcome was; what you would do differently; etc."}, {"date": "27 Aug 2010", "title": "Senior Project Planning Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sutter Health (Sacramento, CA) in Aug 2010", "Interview Descriptions": "A few days after applying online I received an email requesting a phone screening interview.  After the phone interview we scheduled a panel interview for the following week.\r\n\r\nThe panel interviewers consisted of 5 people from the team, i.e., people the candidate would actually work with.  The representation were three peers, the director, and the manager (who conducted the phone interview).\r\n\r\nAll of the interviewers were very nice and demeanor was comforting (even when I answered a question incorrectly, they didn't make me feel stupid about it).  \r\n\r\nThe office, which is located off Hwy 50, is beautiful and comfortable.  I was in the lobby/waiting area for about 20 mins and noticed the people entering and leaving the building.  They all looked happy and all greeted the security guard by first name.", "Interview Questions": "How do you edit a project plan in MS Project?"}, {"date": "11 Sept 2010", "title": "Real Estate Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Sutter Health (Sacramento, CA) in Aug 2010", "Interview Descriptions": "When I came in for the interview, my impression was that either the position really did not exist or the hiring manager had already settled on another candidate. The interview was supposed to be with four people, but two of them took off work early and did not come. The two people I met with were nice and courteous, but showed no enthusiasm or interest during the one hour meeting. My attempts to engage them in an open-ended discussion did not achieve much. The interview ended right on time. Throughout the whole process I could not figure out why the two interviewers were wasting their and my time.", "Interview Questions": "There were really no questions during the interview besides the regular tell us about yourself and what do you know about Sutter."}, {"date": "4 Feb 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Sutter Health (Sacramento, CA) in Jul 2010", "Interview Descriptions": "Used an employment agency to get in the door.  Interviewed with employment agency and then with the key staff I would be working with.  Questions were asked about my computer abilities as well as my skill level and experience.", "Interview Questions": "What is one thing about your most recent job that you do not like and why?"}, {"date": "6 Feb 2011", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Sutter Health (Antioch, CA) in Jul 2010", "Interview Descriptions": "Very professional process. Organized and detailed from the very first phone call. Had three separate interviews. Was able to check back with more questions- Started on time, ended on time and co-workers were part of the process. It was obvious they knew what skills they were looking for. There is friendliness and teamwork evident- people know each other well.", "Interview Questions": "Not a lot about budget expenses- unusual"}, {"date": "13 May 2012", "title": "Support Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Sutter Health (Sacramento, CA) in May 2010", "Interview Descriptions": "Phone interview.  Hiring Manager interview. Six person panel interview.  Personality question.  Job skills questions.  Previous accomplishment questions.  How do you handle difficult situations, how would you communicate in a persuasive manner with doctors or nurses.", "Interview Questions": "N/A"}], [{"date": "29 May 2012", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Sutter Health (San Francisco, CA) in Apr 2010", "Interview Descriptions": "Being hired through a recruiter for a contract position made the interview process much less daunting. I interviewed with the hiring manager over the phone and discussed my skills to determine a match. I was contacted later that day to come in for a brief in person interview which in turn became a job offer right on the spot. Excellent professionalism by the organization and manager.", "Interview Questions": "Whether or not I could perform the tasks despite having less than the qualifications in the job description. I was able to perform them. "}, {"date": "9 Apr 2010", "title": "Human Resources Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Sutter Health (Sacramento, CA) in Mar 2010", "Interview Descriptions": "Once I applied onine, I received a phone call from a recruiter. Typical phone interview...asked me what my current job was, why I was leaving, when I could start. Lasted about 15 minutes. The Recruiter was extrmely nice. It has been two weeks and I have not heard back yet but was told that once they set interviews they would contact me.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "8 Jul 2010", "title": "Manager Trainee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Sutter Health (Sacramento, CA) in Mar 2010", "Interview Descriptions": "Interviewed with a recruiter at my university. She mostly asked about managerial experience. She told me they were looking for someone with more managerial experience. She used the example of someone who had worked in a restaurant as a manager or team leader.", "Interview Questions": "Tell me about a time you had a problem with an employee. "}, {"date": "26 Mar 2011", "title": "Healthcare Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Sutter Health (Yuba City, CA) in Oct 2009", "Interview Descriptions": "Greeted warmly, interview went well. Declined offer, too low.", "Interview Questions": "N/A"}, {"date": "22 Jul 2013", "title": "Pharmacy Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Sutter Health in Feb 2009", "Interview Descriptions": "administration remotely involved, somewhat dependent on staff priorities", "Interview Questions": "what strengths can you bring to daily operations? how do you motivate people?"}, {"date": "31 Oct 2013", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sutter Health (Sacramento, CA) in Feb 2009", "Interview Descriptions": "panel interview with staff", "Interview Questions": "past experience and training"}]]