[[{"date": "6 May 2023", "title": "Technology Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marie Curie", "Interview Descriptions": "Initial interview was good. Friendly approach with no preparation required. Felt like a standard technical Q&A style. \r\n\r\nI was let down by the fact they decided to change their stance on remote working a day before my second interview. The initial offering required 2 days per month on site for key meetings. This was then changed to requiring a strong onsite presence. I live 300 miles from head office. I only applied based on their home working flexibility offering. \r\n\r\nVery disappointing and a waste of everybody’s time", "Interview Questions": "Talk us through your approach to relationship building"}, {"date": "19 Jan 2023", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marie Curie", "Interview Descriptions": "Good interview process. Fair and easy. Heard within a short period. Straight forward questioning I recommend this company, pay is constantly reviewed. There are a variety of jobs. Recommends Marie Curie*", "Interview Questions": "Differs between interviews. Typical questions"}, {"date": "6 Dec 2022", "title": "Volunteering Development Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marie Curie (Glasgow, Scotland) in Nov 2022", "Interview Descriptions": "I was asked to join an in person interview. The team was very understanding of availability. The Interview took place in Glasgow to the Marie Curie Hospice, and it required to wear masks which cause some difficulties at least for me. Few days after the interview, I received a call and a voice message thinking it would be a positive feedback or at least a good one even if negative. I had been asked to call back, I did and then I received an email with the rejection and shortly put that I did perform well at the interview and I was not selected. I asked for further feedback and I never heard back. As I understand it is a competitive and busy environment, this is no way to treat a candidate who spent money to travel for an in person interview. Further, travelling to the hospice was not very easy.", "Interview Questions": "1) Previous experience. \r\n2) How would you build work relationships with internal and external stakeholders. \r\n3) How would you describe your volunteering experience. \r\n4) How would you make improvements in the volunteering area."}, {"date": "18 Jul 2022", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marie Curie (London, England) in Jul 2022", "Interview Descriptions": "Application was quite long but standard for the industry then I received an interview offer around 1-2 weeks later. The interview took about 1 hour, and the interviewers were very kind.", "Interview Questions": "Tell me about a project you managed well and poorly?"}, {"date": "16 May 2022", "title": "Assistant shopmanager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marie Curie", "Interview Descriptions": "I arrived on time was asked if I wanted any water, was made to feel relaxed. Very informal which suited me. There were 2 interviewers and they both took notes but I wasn’t put off as I had been told this would happen.", "Interview Questions": "How do I handle difficult customers"}, {"date": "18 Jan 2021", "title": "Project Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marie Curie", "Interview Descriptions": "The second the virtual interview started I already knew I didn’t get the job. The first thing they did was take a photo of me with hardly an explanation behind it, I thought this was very bizarre and I felt immediately awkward. Neither interviewer displayed any particular interest in getting to know me during the 20 mins interview (far too short a time if you ask me), the questions were very basic but they didn’t even ask me for my notice period or salary expectations to align me properly to the job. A big clue they weren’t interested. For a 20 minute interview I feel I should have been telephone screened prior to the first stage interview so they at least had my basic info. I was barely given an opportunity to ask questions - it seemed that both interviewers were keen to leave and/or forgot to let me ask questions. I just about squeezed one in at the end, and due to the answer given to me I already knew I wasn’t successful during the interview. The interviewer answered my question in a way that implied I will not get to work with Marie Curie first hand. After chasing up on the outcome (I already knew I didn’t get it - but it’s the principal), my feedback was a pretty cold, standardised email with no personal touch “we have decided to progress with other candidates with skills that better align with the role”... in which case I don’t understand why I was shortlisted if it’s a case of skill set which my CV outlines. I would have preferred honest, in depth feedback given the time I put in to researching and preparing for an interview. I didn’t have a good experience as a candidate which is a shame as I admire this charity. I’m really put off applying for future roles here.", "Interview Questions": "Give an example of a time that you managed a project"}, {"date": "13 May 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marie Curie (London, England) in Feb 2020", "Interview Descriptions": "Interview, drugs calculations, scenarios, trouble shooting. Hired, long HR process, dbs check, cv check and references took ages. Started months after I initially thought i would. Probation period of a couple of months.", "Interview Questions": "Leadership experience "}, {"date": "5 Jan 2020", "title": "Senior Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marie Curie (Dumfries, Scotland)", "Interview Descriptions": "It was a mixture of questions about personal experiences, what palliative care means to you and simulation scenarios. There was a SIM man where there was questions about how to provide clinically appropriate care.", "Interview Questions": "What does palliative care mean to you?\r\n"}, {"date": "26 Nov 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marie Curie", "Interview Descriptions": "Had two interviewers interested in knowing more about me, basically wanted me to talk through my CV without saying so. Afterwards a technical test was given to ascertain the level of my technical skills.", "Interview Questions": "Why Marie Curie?"}, {"date": "22 Oct 2019", "title": "Receptionist/Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marie Curie", "Interview Descriptions": "They literally met me, had a chat, got to know what my experience was but they wanted to know more about who I am and my personality, which took a lot of pressure off the interview process.", "Interview Questions": "How many years experience do you have?\r\nWhat do you know about Marie Curie and what we do here?"}], [{"date": "25 Nov 2019", "title": "Fundraising Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marie Curie (London, England) in Oct 2019", "Interview Descriptions": "Lovely interviewers who tried their best to make the process as friendly and laid back as possible. Lots of questions asked about previous experience and general competencies. Questions were fairly straightforward. They gave me a deadline for when they would contact me which was met. Feedback was included in the rejection email which was helpful for future interviews. Overall, although I was not offered the position, I was extremely happy with the interview process.", "Interview Questions": "General competency questions. Wanted lots of examples from previous employment."}, {"date": "13 Jan 2020", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Marie Curie (London, England) in Sept 2019", "Interview Descriptions": "Very fun and informal. Allowed to wear your own clothes. We played games to show how confident and charismatic we were and see if we could think on the spot. Very fast hiring process and friendly managers.", "Interview Questions": "What is the hardest thing to manage about you?"}, {"date": "19 Dec 2018", "title": "Relationship Support Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marie Curie (London, England) in Dec 2018", "Interview Descriptions": "Upon arriving at reception I met a manager and team leader who took me into an interview room. First part of the process was 15 generic questions and second part was a telephone role play. The interviewers did not seem interested in the process and it seemed to me that they already had the candidates selected for the role. The disappointing part for me was that during that interview I was told they would be in contact with the result within two days and I could have detailed feedback from the interview. I did not hear back from the interview for nine days and had to contact the recruitment team myself to find the result. I was also not given any feedback and sent the result from an email stating to not reply back. The whole experience was very disappointing and unprofessional. If I was offered the role I would have turned it down because of the unfair treatment.", "Interview Questions": "What do you know about Marie Curie"}, {"date": "18 Feb 2019", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Marie Curie (London, England) in Nov 2018", "Interview Descriptions": "I applied for a temporary administrator to work at the head office in London in November 2018. I  submitted my CV via a recruitment agency and got an interview. The process took 5 days. \r\n\r\nI arrived on time for the interview, the receptionist contacted the interviewers but they arrived over 20 minutes later.  I attended an interview - which was about 20 minutes. Was interviewed by two coordinators.  \r\nI walked through the head office floor to a room. One thing that was striking was how not diverse the London Head office is - very white dominated. \r\n\r\nThe interview was very informal, but I could tell the interviewers was very ill-prepared. The interviewers really struggled to ask relevant questions for the job. One of the interviewers kept trying to work out what to ask me. \"Erm, what should I ask you next erm\"  So to avoid the sheer awkwardness of being interviewed by people that did not know what to ask,  I asked a few questions about the job. \r\n\r\nI was not offered the job which did not surprise me.", "Interview Questions": "What is your greatest weakness? "}, {"date": "8 Mar 2018", "title": "Fundraising Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marie Curie (London, England) in Feb 2018", "Interview Descriptions": "The interview experience was fairly relaxed, I felt really comfortable. First off I had to complete a short 15 min writing test. It was to answer questions about dealing with customers and then to proofread a letter to a supporter. Then my two interviewers asked simple questions about my interest and suitability for the role, experience and knowledge of Marie Curie", "Interview Questions": "Give an example of an office process which improved efficiency in a former role?"}, {"date": "10 Nov 2021", "title": "Professional Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Marie Curie (Manchester, England) in Feb 2018", "Interview Descriptions": "Very chilled face to face interview with managerial staff who did a great job putting everyone at ease in order to present themselves in the best possible manner. Didn't last too long maybe 20-30 mins", "Interview Questions": "Why do you wish to work for Marie curie?"}, {"date": "5 Jan 2018", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marie Curie", "Interview Descriptions": "The first round was a competency and technical interview with the normal expected questions. There was a second interview which was less formal. The interviewees were friendly and approachable, putting me at ease.", "Interview Questions": "What do you expect the challenges to be in this role?"}, {"date": "2 Nov 2017", "title": "Marie Curie Fundraising Promoter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Marie Curie (Solihull, England) in Nov 2017", "Interview Descriptions": "Went through Reed.co.uk and applied for the post advertised on there. The recruitment agency got me into contact with Marie Curie shortly afterwards and then I had a telephone conversation followed by an invitation to interview.", "Interview Questions": "What would you do if someone approached you and said that Marie-Curie did nothing for their terminally ill family who passed away?"}, {"date": "26 Jun 2017", "title": "IT Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marie Curie (London, England) in Jun 2017", "Interview Descriptions": "Applied online via official website\r\nreceived email for 1st interview\r\nquestions about CV\r\nTour of offices and also departmental office\r\nVery good environment with helpful staff and central location\r\nAlso really enjoyed the interview as they put me at ease", "Interview Questions": "N/A"}, {"date": "16 Dec 2016", "title": "Door to Door Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Marie Curie (Sunderland, North East England, England) in Nov 2016", "Interview Descriptions": "The interview was fairly quick because I was the only one who showed up. The manager was friendly and communicative, took time to explain the job and your responsibilities in detail. He asked some basic questions like how much do you know about the charity, but the e-mail you receive from the agency tells you everything you need to prepare for it. All in all it was very relaxed and conversational.", "Interview Questions": "How much do you know about Marie Curie?"}], [{"date": "6 Jul 2016", "title": "Street Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Marie Curie (London, England)", "Interview Descriptions": "Very strict and very crowed. The interviewer was a bit intimidating, but not aggresive. He made sure to explain us the difficulties of the job, and every detail of how we (in case they acepted us) were going to be paid.", "Interview Questions": "To talk with a partner about their favourite movie/book and then describe it."}, {"date": "21 Jan 2019", "title": "Street Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Marie Curie (Vauxhall, England) in Jun 2016", "Interview Descriptions": "Through a recruitment agency, had a group session then individual interviews before being invited to full group day of training, not everyone from the group is selected to be a fundraiser after the week of training.", "Interview Questions": "Why do you want to fundraise ?"}, {"date": "14 Jun 2016", "title": "Door to Door Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Marie Curie (Sunderland, North East England, England) in May 2016", "Interview Descriptions": "It was a group interview so you get plenty of time to think, but this also means you need to stand out more. It was explained that you would start training immediately, the working hours and salary were also explained. In a group of four it took 30 - 35 minutes and they got back to me within three days.", "Interview Questions": "What are you passionate about and why should I be passionate about it too?"}, {"date": "26 May 2016", "title": "Junior Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Marie Curie (London, England) in Apr 2016", "Interview Descriptions": "Interviewed with a group of people, was asked several questions and put into different scenarios to see how we would react. It was very high pressure because you had to think on the spot and find an answer to a question you weren't necessarily expecting. Some of the questions were very abstract and had to be thought about properly in the allotted time given.", "Interview Questions": "Describe the colour orange"}, {"date": "28 Jul 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Marie Curie (Stourbridge, England) in Apr 2014", "Interview Descriptions": "Very casual. Just ask you why you want to volunteer and what you think you will get out of it. The setting wasn't very formal, the interview was held in the back of the shop where all the stock is held.", "Interview Questions": "Q: Why do you want to volunteer here?"}]]