[[{"date": "31 Jan 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Alaska Fairbanks", "Interview Descriptions": "Good review process that went really easy and made getting hired quick and easy. I am not sure how else to describe the ease of the interview. The interviewer was very nice and she really took her time to get to know me and my needs as well as describing the needs of the jobs and describing what I will be doing.", "Interview Questions": "Why do you want to work here"}, {"date": "17 Nov 2020", "title": "Facilities Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Alaska Fairbanks in Nov 2020", "Interview Descriptions": "Applied through their website. HR contacted through phone after 2 weeks and scheduled an online interview through zoom with the hiring committee. Followed up with HR after 2 weeks to learn that the position was offered to another person.  After the Interview, I felt like if you live within Alaska, you have a better chance of getting a job offer compared to someone from the lower 48 states.", "Interview Questions": "Mainly questions regarding my previous roles, experience with construction, Installation & maintenance of equipment, and experience in dealing with government bodies for permitting purposes."}, {"date": "16 Mar 2021", "title": "Science Writer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Alaska Fairbanks in Oct 2020", "Interview Descriptions": "Interviewed with three people including the person I was replacing. Did an unnecessarily long writing test, completed a background check and received an offer. Interview was about an hour long.", "Interview Questions": "Are you willing to move to Alaska?"}, {"date": "14 May 2023", "title": "Budget Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Alaska Fairbanks in Mar 2020", "Interview Descriptions": "Everyone was very friendly and knowledgeable. However, it was a 2 part interview which on the second part your excel proficiency was tested. The first part is a 3 person interview that felt like an easy going casual conversation.", "Interview Questions": "Must know how to use excel pivot tables"}, {"date": "23 Nov 2022", "title": "Desktop Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Sept 2019", "Interview Descriptions": "They just ask questions to see if you have any experience with troubleshooting in the past. Experience with Windows Servers and AD is a big plus since the majority of phone calls will require some sort of password reset. Especially on Monday mornings! They also prefer folks with any PowerShell knowledge.", "Interview Questions": "Do you have any experience with PowerShell? Describe previous experience troubleshooting with customers in a professional setting. Do you have any experience remotely logging in to a client's workstation? Have you ever used Microsoft Windows Server? Are you familiar with AD servers?"}, {"date": "19 Aug 2019", "title": "Student Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Alaska Fairbanks", "Interview Descriptions": "Standard UAF style interview. Be prepared to have 3-5 people asking you questions during the interview.  Those conducting the interview have to take notes for HR, so they may not make a lot of eye contact.", "Interview Questions": "What does student success mean to you?"}, {"date": "13 Oct 2019", "title": "Logistics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in May 2019", "Interview Descriptions": "The interview experience was rather lax and it was honestly more of a formality as they were already speaking to me about hours and freedom of time for the position. But aside from that it was a quick and painless conversation about working with others in the environment where kids would be involved and to keep everyone safe and if I was prepared for that responsibility.", "Interview Questions": "Are you comfortable working with fellow coworkers as well as students from rural communities?"}, {"date": "21 Apr 2019", "title": "Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Mar 2019", "Interview Descriptions": "I had a phone interview, capped at an hour. There was a presentation required of the candidate  at the end, that was not intended to be a surprise but the hiring manager neglected to inform me.  There were a few scenario questions; many of the questions were very similar to each other. From closing date to application outcome, the process took about a month.  Interview panel was nice.", "Interview Questions": "How would you advise a first time freshman who walks into our office?"}, {"date": "10 May 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Alaska Fairbanks", "Interview Descriptions": "The interview was standard. I was interviewed by the supervisor and the phD student I would be working for about my education, experience, time for questions for the employer, etc. Just come prepared, have a firm handshake, and email the employer after the interview.", "Interview Questions": "Do you have any questions for us?"}, {"date": "22 May 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Mar 2017", "Interview Descriptions": "Direct interview with three RDs who will ask why you want  the position and ask you question on basic Residence Life Policy. These questions are fairly easy and are mainly personality based.", "Interview Questions": "What would you do if someone came to you at 3 AM for a vacuum?"}], [{"date": "7 Nov 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Apr 2016", "Interview Descriptions": "I met with the professor running the project.  We talked about the projects he had funding for and determined my level of interest.  We also discussed a general time line for finishing the project, and that was mostly it.", "Interview Questions": "What interests you about the proposed projects? "}, {"date": "20 Jan 2019", "title": "Mechanical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Alaska Fairbanks in Jan 2016", "Interview Descriptions": "Skype interview and background check of majors. They will also check your research background and interest to work with which area at the University of Alaska Fairbanks. They will ask you about your all prior experiences to work with different companies.", "Interview Questions": "Why you chose UAF?"}, {"date": "2 Feb 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Jan 2016", "Interview Descriptions": "This is an application for grad school so there is usually no specific question. You apply online for grad school and you indicate in your application that you need something like research or teaching assistantship.", "Interview Questions": "what is your name"}, {"date": "20 Mar 2017", "title": "CGI Animator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Jul 2015", "Interview Descriptions": "Very laid back, most of the interview was explaining the processes behind the shots on my demo reel.\r\n\r\nThe entire department was there, we just sat by my future supervisor's desk and walked through work I've done for my past jobs. They brought up looming projects they needed me to attend to, I honestly explained how I would tackle the problems- which parts I was confident I could complete, and which parts I did not have a lot of experience with yet. I ended up completing the work to their satisfaction, but being honest about my skills and limitations I didn't lie or create false expectations :)\r\nAlthough 'fake it til you make it' always has its place.", "Interview Questions": "What skills do you feel you bring to this job?"}, {"date": "7 Dec 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Jan 2015", "Interview Descriptions": "I have applied through the website. after month they called me, and they took interview.It was good for me, answered as much as i could. They were kind.Didn't worry much,", "Interview Questions": "Previous job, responsibilities, my future aims. Particularly asked about the grant program."}, {"date": "2 Jan 2014", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Alaska Fairbanks", "Interview Descriptions": "Applied through UAK jobs, got an interview call. Interview involved review of past experience and also explanation on projects and some technical questions.", "Interview Questions": "N/A"}, {"date": "28 Aug 2012", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Alaska Fairbanks (Fairbanks, AK) in Sept 2011", "Interview Descriptions": "Student job.  Structured interview with assistant resident director.  1 week before working a day long orientation and training session with other hired desk attendants included people new to the job and others who were rehired for the year.", "Interview Questions": "How you would react in certain situations including how you would deal with your friends that came over to visit.  Also how you would deal residents."}]]