[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great cause, great people", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Apr 2022", "job_title": "Nurse Practitioner in Pasadena, CA", "duration": "N/A", "pros": "I love ChapCare for its mission/cause to serve the poor. From day 1 everyone was very welcoming and supportive. I have recommended ChapCare to a friend and would do so again anytime.", "cons": "I didn't really experience any cons."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Horrible management, high turnover", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Jun 2023", "job_title": "Advanced Practice Provider in Pasadena, CA", "duration": "N/A", "pros": "1) The patients are from an underserved community and really really need help. For the most part they are the most gracious and appreciative people on the planet and you really feel like you are making a difference in the world where it's needed. 2) Benefit package is more than decent 3) Setup is nice, Primary Care services with in-house pharmacy, optometry, dentistry, behavioral health makes it easy to get patients comprehensive care", "cons": "Management is completely unresponsive to provider and staff concerns. Providers are overworked, often stay late, work through lunch, and are at a complete disadvantage by being salaried. If providers were paid overtime, this place would fold. Toxic work environment"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Administration", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Jun 2023", "job_title": "Credentialing Coordinator in Pasadena, CA", "duration": "N/A", "pros": "It was closer to my residence.", "cons": "Administrator did not support there workers and they did not respect you when you were on lunch or break. Admiration took advantage of funds and grants from the state."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Receptionist", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Apr 2023", "job_title": "Medical Receptionist in Pasadena, CA", "duration": "N/A", "pros": "Hours, days, and small offices", "cons": "The pay is very low. The managers expect for you to cover all day by yourself if someone calls out they won’t send no back up."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "It was ok", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Jul 2022", "job_title": "Certified Medical Assistant in Altadena, CA", "duration": "N/A", "pros": "The patients and SOME of the doctors were great\nHave all necessary supplies, fully stocked", "cons": "Forced us to get certified or basically lose your job. \nManagement is unorganized and rude \nDo not listen to employees \nNo room for raises, or bonuses"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not the best - good for experience in healthcare", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 May 2022", "job_title": "Coordinator in Pasadena, CA", "duration": "N/A", "pros": "They hire those who are new to the work force.", "cons": "Micromanaging, ageism, and huge lack of camaraderie. Be prepared to be watched like a hawk if you get up from your seat."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "So many *POSITIVE* changes in the last two years!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jul 2021", "job_title": "LVN Supervisor in Pasadena, CA", "duration": "N/A", "pros": "- Great benefits \r\n- Amazing new CCO \r\n- Providers and back office teams are great!\r\n- A lot of structural and key staff changes have been made, so many of the issues that existed for so long are now being dealt with and improved. Company has made huge strides in the past two years.\r\n- The company has really made a commitment to made positive changes and honestly, this is the reason I have lasted.", "cons": "- Lack of communication and miscommunication regarding matters( but being worked on). Personally I just document everything in email."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Nov 2020", "job_title": "Dentist in Orange, CA", "duration": "N/A", "pros": "good environment, great boss and wonderful family to work for", "cons": "Pay was not the greatest"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Steer clear of this corrupt clinic", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Mar 2015", "job_title": "Anonymous Employee in Pasadena, CA", "duration": "N/A", "pros": "Retirement account that's about it as it's a prison here where management watches you on their cameras to make sure you work your 8 hrs and stick to your 10 min breaks.", "cons": "I worked here for 5 years as a biller and never got a raise.  Management is corrupt and continually get federal funding to open new clinics and only give gigantic raises to management staff only. They will not care for no one but for those who were part of their clique. There no well organized management which made it a headache and stressful. the training was horrible as they do not train you well. They will throw you in boat with no paddles and expect you to row as same as their other employees and continue to pile new projects on you with no raise.  The human resources department is incompetent as we receive our insurance and benefits late. I heard that they fire employees they don't like and deny their unemployment insurance and make up excuses that the employee resigned.  The CEO and various managers get over inflated salaries while doctors and line staff don't get paid enough for the work they do."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Ob/Gyn opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Oct 2020", "job_title": "Physician in Pasadena, CA", "duration": "N/A", "pros": "Other employees are very nice", "cons": "The administration doesn't follow thru with promises"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "CMA", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jan 2018", "job_title": "Anonymous Employee in Pasadena, CA", "duration": "N/A", "pros": "Health ins. That's about it. Maybe some of the doctors are cool. Sweet people.", "cons": "Everything.  From management, hr, staff. There is favoritism. I feel like a lot of things are reportable here. A lot of weird stuff going on. They don't care about some employees I won't say all because from what I hear management and HR get paid very well. I personally am trying to get another job I'm coming up on 2 years and I'm very disappointed if not for my son being sick and having to pay med bills I would have been gone within the first week.  Not to mention they brought in newly graduated LVNs and had the CMAs Train them and then they got raises and moved to lead positions, plus the CMAS did not get payed to train !! When it was brought up to HR they said we never trained anyone they just shadowed us and we answered questions. Haha wtf that's training. Especially because NOT ONE LVN knew how to do anything they ALL just graduated. SAVE YOURSELF STRESS AND SKIP THIS JOB !!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Beware fake positive reviews written by nervous management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2015", "job_title": " in Pasadena, CA", "duration": "N/A", "pros": "Most of the non-management staff are nice.", "cons": "Everything. Bosses sleeping with interns, insecure management, rampant racism, volunteers used inappropriately as free labor, bullying, lazy CEO manipulated like a puppet by a CFO with a monstrous inferiority complex.\r\n\r\nA patient recently died as a result of poor care!  So many doctors are quitting that they don't have enough left to attend to the patients who haven't moved on to other clinics. Also, this organization does not play nice with other agencies. The only time management ever smiles is when they talk about how \"stupid and incompetent\" managers at other clinics are. This clinic has no friends.\r\n\r\nThe only way they have managed to stay afloat this long is with grant money. However, with so many doctors leaving and staff quitting, it will be impossible to meet the conditions for all of these grants, so they will soon lose all that money. Bottom line: this place won't be around much longer."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Don't work for this ghetto company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Sept 2014", "job_title": "Biller in Pasadena, CA", "duration": "N/A", "pros": "There aren't too many good things about this company except that they have some benefits, vacation and sick leave", "cons": "They don't pay us well here so we all quit one way or another.  I've been making the same income for the past 3 years so I left for higher pay elsewhere.  My manager is a micro-manager who spends all her time looking at our time sheet all day and does not provide any good training to staff, doesn't care about our professional growth, no room to advance.  She is never there to train, has other staff train me.  She plays favorites to staff, hangs out with her favorite staff off work and does corrupt things that she got away with.  She loves to power trip with her staff.   It's a gang mentality here and they fire people left and right or people quit fast.  Feels like a prison here. I'm glad I got out fast as I heard they now have cameras everywhere and spy on you. Don't work here, it's a prison and the manager behaves like a prison guard"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "ChapCare administration threatens the future of the organization", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Nov 2015", "job_title": "Staff Physician in Pasadena, CA", "duration": "N/A", "pros": "I joined ChapCare because of its mission as a community clinic serving uninsured and underinsured patients. Now, over one year later, I can honestly say that I have never worked with such dedicated and competent clinical staff thus far in my career.", "cons": "Unfortunately, the same cannot be said of the administrators who lead the organization.\r\nThe following are 4 of the biggest areas of concern with ChapCare administration:\r\n\r\n1. Certain administrators have created a hostile work environment that has led to extremely high turnover rates in their departments and the loss of numerous dedicated and competent employees (see other reviews on this website).\r\n2. The lack of a formal HR department means that there is nowhere for employees to report their grievances. Furthermore, worker’s compensation cases and temporary disability cases have been mishandled by the informal HR department.\r\n3. The disorganization and lack of communication in various administrative departments have led to serious compromises in patient care. This includes patient appointments being mistakenly canceled on 2 separate occasions for a provider whose first name is similar to another non-clinical staff who called out sick. This also includes the inability to provide patients flu shots because the finance department has not paid its bill.  These are just 2 recent examples of regular, ongoing compromises to patient care due to the incompetence of these departments.\r\n4. The leadership of ChapCare has allowed the above to happen for the last 6 years and has let 2 medical directors and numerous medical providers (doctors, nurse practitioners and physician assistants) leave due to the above problems without making any changes.\r\n\r\nA clear example of the leadership’s attitude towards their employees occurred at a recent all-staff training. A representative from a risk management firm was invited to speak to the staff regarding workplace safety. The representative included a slide that showed the different types of workers comp claims that were settled in the last several years. When an employee pointed out that the biggest claim was for undue workplace stress (point number 1) and asked the representative what can be done in response, the representative mentioned offering employee stress management classes. That should have been the end of the conversation. However, leadership proceeded to take the microphone and speak at length about how just because the claim was settled does not mean it was a legitimate claim. For the leadership of an organization to respond to employee concerns with such defensiveness and dismissal clearly shows a lack of responsibility for the organization.\r\n\r\nFive years ago, following the resignation of the first medical director under this current administration, the medical providers raised their concerns to the Board of Directors and nothing was done. Now, 6 months after the resignation of the second medical director under this administration, the current group of providers have again raised their concerns to the Board of Directors. Unfortunately, it appears that this time around there still will not be an adequate response. If so, ChapCare will continue to lose dedicated, competent staff, and unfortunately the patients will be the ones to suffer the most."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unprofessional management creates hostile environment that stifles creativity, growth and teamwork.", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jun 2015", "job_title": "Anonymous Employee in Pasadena, CA", "duration": "N/A", "pros": "Chapcare has a great mission. Non Management staff are fairly friendly. Decent benefits.", "cons": "As a 501c3, ChapCare must have a set of values it strives to follow in the course of its everyday operation. Some of these values include respect and helping/learning from colleagues. Unfortunately, management--the very people who should incorporate and demonstrate such values--do not apply them internally.  Staff is demeaned and unappreciated. I am a well educated person with a versatile skill set that ChapCare claimed was conducive to the needs of the organization as well as the demands of the job. In fact, my job duties were revised to reflect my skills; yet, I rarely received any challenging projects and used very little of my talents. Without any discussion and without my consent, I was given menial receptionist duties and confined to a front desk, none of which was discussed at the job interview. Granted, my pay remained unchanged but I was very unhappy and felt disrespected.\r\n\r\n In addition to being condescended, I was bullied by management, which included a member of the HR department.\r\n\r\nMy immediate supervisor was a terrible communicator who procrastinated and gave very little guidance. In fact, I did not receive any type of training relevant to the daily execution of my job or chap policies. Actually, chap was lacking in several clear policies which I believe is a strategic decision so as to allow for malleability with regard to company rules etc. I am a disabled person and Chap gave me a very difficult time when I requested a reasonable accommodation and further cited random policies to justify certain denials, policies that were nonexistent in the employee handbook.\r\n\r\nCertain members of management form a clique and demonstrate clear nepotism and favoritism. These individuals also lack any college degrees one might expect to see given their status and job titles in the organization.  Further, do not expect your creativity and ideas to be met with a mind that is both open and cognizant of organization needs; you will instead encounter rigidity and insecure defensiveness and will eventually feel demotivated to put forth any meaningful effort.\r\n\r\nOverall, my experience was negative. Management created an unwelcoming and at times; hostile environment. They behaved unprofessionally and childishly and were, in my opinion, the sole cause of why my experience was so terrible and I am certain they are the cause of the high turn over rate at the firm. As an aside, to me, it is abundantly clear that the positive reviews wherein management is encouraged to continue their work, was written by a manager which only further exemplifies how petty these people can be as they are unable to gracefully accept criticism.\r\n\r\nI was terminated from this job. The day of, I had a discussion with my boss about my workload being too light and expressed my concerns that I was underutilized. Later in the afternoon, I was terminated. Though I was glad to be let go, I started that position with high hopes of a long term tenure wherein I would make many positive contributions. It is a shame that I was let go because of my disability, because I was overqualified, and because they were unable to find/provide me with adequate work to utilize my skill set. \r\n\r\nI do not recommend working here as no amount of income or learning experience is worth the disrespect and unprofessionalism displayed."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "CHAPCare IS NOT WHAT THEY PORTRAY THEMSELVES TO BE...", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Jul 2017", "job_title": "Medical Provider in Pasadena, CA", "duration": "N/A", "pros": "I was attracted to CHAPCare because of their mission statement and the ideals to help those in the underserved community.", "cons": "1)    THIS IS A FOR PROFIT COMPANY\r\n    At a meeting, administration did a presentation that showed how much payment is received with each patient visit via their insurance. At the end, they emphasized to treat patients with commercial insurance and Medicare as VIPs since the company receives more money for them and to try to restrict the number of visits of patients with My Health LA (county insurance for the undocumented) since the company received less money for them.\r\n   Later in meeting, they presented a slide where they were using providers' names who were not full time at the company to show as if there were more providers working at the company in order to increase the number of patients assigned to clinics from insurance companies to maximize profits. \r\n   The company qualified for several grants and one of the requirements was to open more clinics in underserved areas. Though the clinics were opened, they were never fully staffed or properly equipped and a few were closed due to having no staff...they are still misrepresenting these clinics through advertisements. If you call those clinics, you cannot make an appointment and the staff will redirect you to another clinic.\r\n\r\n\r\n 2)   TOXIC WORK ENVIRONMENT\r\n    Multiple formal complaints were filed against a higher administrative employee and some of those who filed the complaints were so affected by this employee they had to seek outside medical care from occupational medicine...no disciplinary action was taken by administration. When administration did their investigation, they responded that the higher administrative employee's unprofessional behavior was part of their \"personality\" and to just deal with it. Multiply employees resigned due to this employee's behavior and yet nothing was done.\r\n\r\n\r\n3)   UNQUALIFIED AND POOR MANAGEMENT\r\n    The administration in charge of all the medical staff do not provide direct patient medical care but they dictate how medical care should be provided without even seeing what is going on at each of the clinics. They disregard medical staff recommendations and at times clinical guidelines.\r\n\r\n\r\n4)   YOU ARE JUST ANOTHER NUMBER TO THEM\r\n    An employee there for many years who was adored by patients and providers and who was in charge of a program there was approached by administration and told they would be replaced with new hires without reason. When this employee asked the reason and requested recognition for their dedication, the administration did nothing. This employee left for another company who would treat them better. Patients were upset and soon after some providers resigned, one reason was there was no qualified replacement to continue working safely with patients to provide quality care."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "do not work for a ghetto company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Jan 2014", "job_title": "Medical Records in Pasadena, CA", "duration": "N/A", "pros": "they give good hours and overtime.", "cons": "management and subordinates love to gossip alot and make stories about other people to make themselves look good. they are very very unprofessional and very unsupportive about their employees. they discriminate and bully employees here."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "\"Chapcare\" the place where employees are treated like illegals by management.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jul 2015", "job_title": "Medical Assistant in Pasadena, CA", "duration": "N/A", "pros": "Nothing...Beware of fake reviews. Beware of  beware of Hr management the higher ups and kissups,   trust no one.", "cons": "People who manage this company need to resign."}]]