[[{"date": "28 Feb 2023", "title": "SPT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "They ask personal questions, and not the basic \"why do you want to be a PT\". The staff is very kind and are searching for people who have good intentions.", "Interview Questions": "If you have your grandmothers birthday party and a test the same day, would you skip your grandmothers birthday or ask to move the test."}, {"date": "22 Nov 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "Online application, recruiter phone call, and in-person panel interview One question is asked by each person while others write your response. One of the people in the panel is your first line supervisor. They send an offer within 30 days.", "Interview Questions": "Handling conflict with team member Previous situation where you had to think outside the box A time when you regretted an action"}, {"date": "12 Aug 2022", "title": "Social Worker (MSW) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "The interview process was disorganized and had no structure. I was informed it would be about an hour. At the 30 minute mark, one of the interviewers interrupted another interviewer to comment it was almost lunch time and continued with passive aggressive sighs and comments for the next 5 minutes as we concluded the meeting. Okay I didn't get the offer.", "Interview Questions": "What I wanted to ask them."}, {"date": "21 Jul 2022", "title": "Asst. director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center (Fort Worth, TX)", "Interview Descriptions": "STAR interview process. Situation: When and Where?  Task: What was the issue? Action: What did the person do?  Results: How did it end? What was the outcome?  Interviewed on 6 competencies. Which are Leadership, Communication, Customer Centered, Initiative, Critical Skills or Problem Solving and Relationship Building.", "Interview Questions": "Describe a time when you had several large projects hat needed to be implemented. How did you determine the priorities of each? What ended up happening? "}, {"date": "8 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Texas Health Science Center (Denton, TX) in Aug 2021", "Interview Descriptions": "The interview process was very straightforward and easy. Asked very basic questions, tell me about yourself, your strengths, and tell me about a time when... It was also very quick less than 30 minutes.", "Interview Questions": "They asked: Tell me about yourself"}, {"date": "4 Feb 2021", "title": "Senior Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "Value based interview. The interview process is pretty average but there a multiple interviews and could take weeks before you actually start the job. It took me almost a two months", "Interview Questions": "Tell me about yourself, \r\n\r\nTell me about a time you had to handled a conflict "}, {"date": "16 Apr 2020", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "My interview process was Average. I met with two of the women who asked me about my previous experience working with public relations and communications.  There was also a 30-minute writing  test I took where I wrote a campaign for an upcoming event.", "Interview Questions": "What was a time you failed?"}, {"date": "25 Mar 2019", "title": "Human Resources Benefits Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "First there is phone interview, after that there is face to face interview with boss and after that there is an interview with team leads. After that boss does proper work for you with University of North Texas.", "Interview Questions": "What do you expect to do in this position?"}, {"date": "30 Nov 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jan 2019", "Interview Descriptions": "The best interview process ever! Be prepared for two rounds of interviews. The first interview is via phone, and the second interview will require a presentation depending on the position", "Interview Questions": "N/A"}, {"date": "15 Nov 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Oct 2018", "Interview Descriptions": "The process began with a rude recruiter completing a phone screen. She stated my resume did not have enough experience, yet she initiated the screen. Weeks later, I received a call to complete a face to face interview. Once completed, I was told I would be contacted for a phone interview with another team member. I did not hear back and followed up with an email with no reply. I contacted the rude recruiter again and she replied stating the dept decided to move forward with someone else. Very unprofessional of the team that interviewed me. Be considerate of an applicant's time as they are considerate of yours. Works well anyway because the position would have had to interact with toxic people from another organization.", "Interview Questions": "Do you use icebreakers?"}], [{"date": "16 Apr 2020", "title": "Library Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jan 2018", "Interview Descriptions": "Great experience. The process started in December with a phone interview. The phone interview was about 30 minutes long and they asked about 10 questions. In January, they offered an in-person interview. I received an email with an agenda. During the interview, I was interviewed by 4 of the team members. One of the team members was out of the office on vacation. I had to complete two interview sections and give a 30- minute presentation to at least 20-30 people.", "Interview Questions": "Are you willing to travel? "}, {"date": "19 Jan 2022", "title": "Content Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center in Jan 2018", "Interview Descriptions": "Group interview, with five interviewers on one side of the table and me on the other.   This set-up made for a stiff and unnatural-feeling interview.\r\n\r\nEveryone was friendly enough, though it was obvious that a couple of people had been coached on what to ask.  Most of the interview felt pre-scripted and somewhat awkward.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Jun 2017", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "Its is easy for students to get on campus jobs. If your area of interest is matching with your mentor  or supervisor then you can convince him/her about how it wilt help you in your career.", "Interview Questions": "Previous experience and knowledge."}, {"date": "31 Oct 2017", "title": "PBX Operator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jan 2017", "Interview Descriptions": "I applied and didn’t get any communication until a month later. I was scheduled for a phone screen by HR and was asked a lot of scenario questions I was told to provide very specific examples. The phone screen later about an hr. I was told if chosen the hiring manager would set up an interview. I was called 2 or so weeks later and an interview was set up. It was a panel of about 4 individuals from the dept. I was asked the same scenario questions however they were posed at “story time” question, like EXACT instances. The interview was about an hour I was asked if I wanted to be communicated with on the decision and I said yes please. I never heard back. No phone call, no email.", "Interview Questions": "Name a specific time when you received a call and you were unsure what to do."}, {"date": "3 Jul 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of North Texas Health Science Center (Fort Worth, TX)", "Interview Descriptions": "There were 10 Ph.D. in the room and it took approximately one hour. They asked many questions about my skill set, computer usage, personality, former employers, and why I want the job.", "Interview Questions": "Am I a people person?"}, {"date": "23 Sept 2016", "title": "Institutional Research Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jun 2016", "Interview Descriptions": "I was contacted for an interview a few days-week after applying online. 2 rounds of interviews, first with a panel of three people I'd likely be working with on day-to-day basis, and the interview was conducted via Skype since I was out-of-town. It was very pleasant and I enjoyed the conversation. They asked a series of behavioral questions and those regarding my experience and background. Second was with departmental higher up, which was also via Skype. Interviewer was condescending and strangely combative in his questioning. Not a positive experience and major red flags. I went home and cried after the interview, and I'm no soft cookie. I thought I wouldn't get the job after speaking with him, and was surprised to receive an offer a few days later.", "Interview Questions": "What do you think are the most challenging issues IR is facing and how would you address them?"}, {"date": "8 Jul 2016", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jun 2016", "Interview Descriptions": "The interview was very laid back. I was asked a few questions about my experience, but the interviewer was more interested in my personality and the way I handle working in the lab/with other assistants should a problem occur. The interviewer was also interested in working with a recent graduate who had aspirations to go into a graduate/Ph.D. program. Very comfortable interview process.", "Interview Questions": "What experience do you have working in a lab?"}, {"date": "19 Feb 2018", "title": "Student Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in May 2016", "Interview Descriptions": "I was referred by a friend who worked there previously. Just one in person interview, pretty easy.Most asked about my previous experience, my skills.It took less than a week to start the job.", "Interview Questions": "your previous experience "}, {"date": "23 Apr 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Feb 2016", "Interview Descriptions": "Applied and notified four months later that I had been selected to interview. Had to complete value-based, scenario questions via email prior to my interview.  Interviewed with two people from the department.  Was offered the position two months later.  The entire process from application to interview to offer was very long, and took over six months.", "Interview Questions": "Tell us about a time you disagreed with your immediate supervisor."}, {"date": "26 Apr 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jan 2016", "Interview Descriptions": "Behavioral interview process with several different panels.  Want to find out how you react in many experiences to see if you will fit in the culture.  Great experience.", "Interview Questions": "Questions related to \"Have you ever experienced [xxx]?  How did you handle it?  Tell me about a time when [xxx]?  How did it turn out?\""}], [{"date": "22 Jul 2015", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "Phone interview to begin the interview process. Then if I passed the phone interview we went to 1 on 1 interview with the firing manager. Lastly consisted of a panel Interview.", "Interview Questions": "Experience?"}, {"date": "24 Jun 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jun 2015", "Interview Descriptions": "Phone interview, then in person interview. After the phone interview, I had to waith a couple of weeks to find out if I made it to the in-person interview. At the in-person interview, I was put through a more thorough test of my ability to multi-task, and real-life scenarios.", "Interview Questions": "Tell me a time you took a risk"}, {"date": "15 Apr 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of North Texas Health Science Center", "Interview Descriptions": "Very common process. Introduce the institute organization. Ask questions about your specific interest and area of background.........................", "Interview Questions": "Specific interested department, and your plan of graduate study. Your intention of apply for graduate program at UNT HSC."}, {"date": "14 Apr 2016", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jan 2015", "Interview Descriptions": "Met with Director of program.  The process was long and drawn out.  It took one month after submitting the resume to get a phone call for their screening process.  I was ask the normal questions during an interview.", "Interview Questions": "Tell me about yourself"}, {"date": "2 Aug 2018", "title": "IT Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Aug 2014", "Interview Descriptions": "Initially wanted to interview for the position of IT Admin but was interviewed by two managers at the same time for the original position and one other that they had an opening for.  Relatively short interview, only lasted about 20 minutes.", "Interview Questions": "What would you do if someone told you that they were having trouble with their printer?"}, {"date": "7 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jun 2014", "Interview Descriptions": "2 weeks application period, scheduled for a face-to-face interview and got selected from a pool of 3 candidates. 2 weeks application period, scheduled for a face-to-face interview and got selected from a pool of 3 candidates.", "Interview Questions": "Pretty standard behavioral questions, as well as experience questions."}, {"date": "22 Mar 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Oct 2013", "Interview Descriptions": "Comprised of two interviews. \r\nFirst was over the phone. This interview was to have a fill of your personality and communication skills over the phone. \r\nThe second interview was imperson.", "Interview Questions": "An instance were you had a disagreement with a staff and how you settled it"}, {"date": "21 Feb 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Jul 2013", "Interview Descriptions": "UNTHSC uses the People Pix behavioral based interview system. You interview with multiple people in the department. Lots of scenario based questions are asked. It starts with an online application, then a phone interview, then an in-person interview.", "Interview Questions": "Name a time when you worked in a group. What went well and what didn't work out very well."}, {"date": "11 Aug 2015", "title": "Student Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Aug 2011", "Interview Descriptions": "Phone Interview with a Director and then an in-person interview with a committee of folks.  After that, your references will be called and then HR will review your file and call to make an offer.  Then, a drug test and background check will follow before you can have a start date submitted.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "24 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of North Texas Health Science Center (Fort Worth, TX) in Apr 2011", "Interview Descriptions": "The job was listed on their website but I got to learn of it through an internal source as their website is not very easy to navigate for searching for jobs. I needed to provide my resume, two letters of support and waited for almost a week before I had my interview. The interviewer was my boss and was very professional. The interview did not seem like a tough interview but was more like an informal discussion about the projects, work culture, expectations and where can I fit in, with my experience and skills. We did not discuss salary or benefits. A heard back within a week and upon informal commitment, I received the offer letter enlisting my job description, expectations, salary and benefits.", "Interview Questions": "They asked me about my previous work experience and how do I see myself fitting in their lab."}]]