[[{"date": "2 Jun 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pepperdine University (Los Angeles, CA)", "Interview Descriptions": "Not a tough interview. Standard questions. No surprises. Basic and entry level position, so as you would expect. Just not the right fit for me now. Nothing bad or negative to report.", "Interview Questions": "How have you managed up before?"}, {"date": "25 Apr 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "Very standard Interview - talked with supervisors of the position. Discussed goals, strengths, experience and how the role works. It took no more than 30 minutes. Everyone there was really nice.", "Interview Questions": "What is one area of improvement you might need when stepping into this role."}, {"date": "2 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "The interview was great and very casual. It was a very relaxed conversation. It lasted around 30 minutes, more or less. We discussed general background and general interests. There were a few others interviewing.", "Interview Questions": "Where are you originally from?"}, {"date": "6 Dec 2022", "title": "Contractor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "There was poor follow through with no follow up after the interview. Perhaps the group is busy or disinterested. In any case, disappointed that there was no explanation or closure.", "Interview Questions": "What is your background in this area?"}, {"date": "19 May 2022", "title": "Content Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pepperdine University", "Interview Descriptions": "There was an extensive written questionaire during the application process.  I appreciated this opportunity and thoughtful answers seemed to have gotten me a telephone interview. The telephone interview went really well but ultimately I was not extended the offer.  The direct supervisor who interviewed me was very nice to let me know and said it was a difficult decision.  I know she hesitated to call me in the first place because she said she thought I was overqualified for the position. I appreciated she gave me the opportunity anyway.  My guess is that this played into her final decision.  Overall, I got the impression it would have been a great organization and team to work for.", "Interview Questions": "I can't recall specific interview questions. It was more of a conversation.  We discussed the position and how my skills pertained to it.  We discussed what the school was hoping to do in the future and plans on how they would like to highlight the school and administration and how I might be able to help in that endeavor.  I recall that the interviewer liked my \"energy\" and ultimately I think being enthusiastic about the job played an important role in being considered for the position."}, {"date": "1 Apr 2022", "title": "Admission Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pepperdine University (Malibu, CA) in Mar 2022", "Interview Descriptions": "My interviewer was calm and nice. She described the job throughly and make myself very comfortable taking to her. The interview lasted 30 minutes with most questions are about my characteristic and how can I manage my time for work and study", "Interview Questions": "Why you want to work at International Program?"}, {"date": "29 Oct 2021", "title": "Marketing Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "Straight forward and to the point. Great response. Very responsive interviewer. Loved the interaction. Very respectful of the interviewee’s preferences. Looking forward to working with this amazing institution. Also, the package and benefits are great too.", "Interview Questions": "Explain your past experiences in a similar job. "}, {"date": "6 Oct 2021", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "Great! Very involved and down-to-earth interviewers. The whole process was clear and well organized. Several stages, starting with group interviews and ending with a panel. Remember to not worry about standing out too much in the group interview. They know what to look for, just be yourself.", "Interview Questions": "How do you see yourself contributing to campus?"}, {"date": "4 Oct 2021", "title": "Student Accounts Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "It was a 2 part interview via zoom. The first interview was with GSEP team. They asked a few scenario questions, why I was interested in the position, and how I stay organized. They also asked if I ever worked with adult students, considering it’s for the graduate program. There was no religious questions asked in the first round of interviews. In the second interview was with the Dean. She started the interview by asking me to lead a prayer. Asked how I practiced and stayed active in my religion.", "Interview Questions": "How do you stay organized?\r\nWhat interested you about the position?\r\nWhat do you know about pepperdine and why would you be a good fit?"}, {"date": "21 Sept 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "Spoke with the Professor I would act as research assistant for. We spoke for about 40 minutes regarding my relevant experience as well as my schedule. Was notified during the interview that I had the job.", "Interview Questions": "Q: How has your prior course experience prepared you for this position?"}], [{"date": "10 Dec 2022", "title": "Human Resources Specialist (HR Specialist) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Sept 2021", "Interview Descriptions": "Very religious based interview. And patriarchal. Never spoke to any female leaders. Didn't seem to have any women in leadership positions. Everyone was very nice. And young. And male. Job was also a bit too entry level for me.", "Interview Questions": "How my personal religious view aligned with Christianity."}, {"date": "8 Jul 2021", "title": "Academic Tutor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "Was fairly straight forward and I was pleased to stay updated throughout the process with the team. They asked general questions about roles and my background and how it would apply", "Interview Questions": "Why do you think you'd be suited for this role?"}, {"date": "7 Dec 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "The interview went well. The interview went by quickly and receptive of my questions at the end. They were also very welcoming and made me feel comfortable during the process.", "Interview Questions": "How do you practice your faith and how can you bring that to this current position"}, {"date": "7 Dec 2020", "title": "Library Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "I applied on Handshake and my supervisor emailed me asking to interview me. She was kind and professional and the interview was easy to get through. It felt more like a conversation.", "Interview Questions": "Why are you interested in marketing?"}, {"date": "24 Jan 2020", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "It was a little stressful. They asked me questions that were controversial to the rules at Pepperdine, but I answered responsibly. They had multiple rounds. The first one was a group interview and the second session was individual sessions. I hoped that I was able to make it to the next round.", "Interview Questions": "If someone came to you in confidence about an alcohol issue would you tell DPS?"}, {"date": "4 Dec 2019", "title": "International Programs Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA)", "Interview Descriptions": "The first interview was very relaxed and informal.  I found about the position through a friend at Pepperdine, so they already knew me before the job.   I just met with my supervisor and he asked me about my availability and past job experiences.", "Interview Questions": "Why do you want to work in this office?  Also, what past experiences do you have that could contribute to your role here?"}, {"date": "30 Nov 2021", "title": "Healthy Minds Co-President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pepperdine University (Malibu, CA) in Aug 2019", "Interview Descriptions": "the process was quick, simple, and straightforward. the interviewers were friendly and explained how the process would work before we got started. I really enjoyed this interview and appreciated that they left me with a decent amount of time to ask questions", "Interview Questions": "what is the kind of company culture that you're looking for? "}, {"date": "11 May 2019", "title": "Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Pepperdine University (Los Angeles, CA)", "Interview Descriptions": "I had a group panel and a second interview on a different day one-on-one with the Executive Director of Marketing. The group panel was actually very good. This review is about the one-on-one with the Executive Director of Marketing.", "Interview Questions": "I had to create a portfolio the night before with little notice. I think I did a good job on it, but to me it shows a lack of consideration for others with the short notice."}, {"date": "22 Apr 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "Quick 30 minute phone interview, followed up by a persons interview . What experience do you think you can bring from previous employers was the real questions that was asked, then it was expounded on heavily throughout the quick and easy 30 minute process. The interview seemed quick and easy. The process was seamless and they were very nice.", "Interview Questions": "What experience do you think you can bring from previous employers was the real questions that was asked, then it was expounded on heavily throughout the quick and easy 30 minute process. The interview seemed quick and easy. The process was seamless and they were very nice."}, {"date": "25 Jan 2020", "title": "Career Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pepperdine University in Mar 2019", "Interview Descriptions": "The interview process was in-person or through Zoom if you are abroad. It was with the Director of the Career Center and the Program Manager. Usually they get back to you within 3-4 days after the interview letting you know if you got the position or not.", "Interview Questions": "What was a time that you showed leadership?"}], [{"date": "7 Dec 2018", "title": "Assistant to the Associate Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "First, an in-person skill test. This involved creating a particular type of document to meet the specifications of a scenario and then some  problem solving questions in writing.\r\nThen, following the test, there were two in person interviews.", "Interview Questions": "N/A"}, {"date": "30 Nov 2018", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pepperdine University", "Interview Descriptions": "Great, comfortable. The supervisors interviewing me asked me a lot of questions, and we got to know each other very quickly. The conversation felt lik!e we had known each other for years", "Interview Questions": "How do you see yourself growing in this role?"}, {"date": "10 Aug 2018", "title": "Campus Safety Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pepperdine University (Malibu, CA) in Aug 2018", "Interview Descriptions": "Horrible , Was asked to give a copy of drivers licence and proof of insurance. However those are not allowed to be asked for until formal job offer. When I contacted the school the next day they stated they had to right to ask. Since when is this legal in California?", "Interview Questions": "Are you a church of Christ member ?"}, {"date": "23 Apr 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Mar 2018", "Interview Descriptions": "It was nice that we have a casual conversation on my resume and further had the discussion about opportunities and challenges. Relevant project experiences are really important. I was asked about plan in future as well and I talked about my short term and long term goal.", "Interview Questions": "Tell me about your resume"}, {"date": "16 Feb 2022", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Pepperdine University (Malibu, CA) in Feb 2018", "Interview Descriptions": "The interview process went smoothly. I was interviewed by the student lead technician and the office manager. I was asked a couple of questions about my resume and some experience related to IT and basic technology.", "Interview Questions": "Tell me about 'X' experience on your resume?"}, {"date": "30 Jan 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "I had a phone interview and then was invited to participate in a mock orientation. The director of admissions was on the conference call along with others from the office of admissions. There was no direction on exactly what they were looking for in the mock presentation", "Interview Questions": "How do you deal with conflict"}, {"date": "27 Nov 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "So we were all laid off and I had to re-apply for my job. Then I interviewed first with a committee, then with the person to whom I would report, then with the dean of the school. She asked me to pray and asked me about my walk with Christ.", "Interview Questions": "Please describe your walk with Christ. "}, {"date": "15 Feb 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pepperdine University (Malibu, CA) in Aug 2017", "Interview Descriptions": "The interviewing process was casual. Questions were simple and went from more formal to more personal and fun. It ended with questions that were just mostly joking around, but after they went through the more simple strengths and weaknesses, etc.", "Interview Questions": "Name a difficult situation in the work place and how you handled it?"}, {"date": "4 Mar 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pepperdine University", "Interview Descriptions": "The initial interview lasted about 30 minutes with a group of five faculty interviewers. At the callback, I had to make a short presentation in my academic field and then have lunch with some professors.", "Interview Questions": "What is your research agenda?"}, {"date": "21 Apr 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pepperdine University (Malibu, CA) in Mar 2017", "Interview Descriptions": "The interview was very well executed and in a very comfortable environment. I met with the executive that I would be assisting. It was very professional and pleasant. He told me that he was going to take a bit of time to decide, so not to be concerned if I did not hear back from him right away. This was about a month ago and I have not heard back from them at all on the outcome. Which is a bit disappointing. As they should really take the time to let someone know if they are no longer being considered for the position.", "Interview Questions": "Tell us about your self?"}], [{"date": "28 Feb 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pepperdine University", "Interview Descriptions": "Very quick interview after submitting online resume & cover letter. Very important to have worked in marketing before and be studying business at the undergraduate level.  After this short interview I was contacted within the week with an hourly wage quote and job offer.", "Interview Questions": "Most challenging experience."}, {"date": "20 Mar 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pepperdine University (Los Angeles, CA) in Jan 2017", "Interview Descriptions": "Interviewed at the West Los Angeles location. The interviewee was polite, friendly and made me feel comfortable, which made the process less stressful. I didn't get the job but walked away feeling that if another position became available I wouldn't hesitate to submit another application.", "Interview Questions": "While holding your resume and sumitted information, \"Can you give me an example of they type of work you performed as an ABC (job position) while working for company XYZ (name listed on resume)?\""}, {"date": "9 Jun 2021", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pepperdine University (Los Angeles, CA) in Jan 2017", "Interview Descriptions": "Face to face interview with all personnel responsible. Five of them. They ask, you respond. Topics go from experience to personal questions and the \"why do you want to work here\". Then office skill tests such as typing speed.", "Interview Questions": "What previous experience do you have?\r\nWhy Pepperdine?\r\nWhy this position?\r\nYou know we have religious affiliation, how do you feel about that?"}, {"date": "12 Nov 2016", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Pepperdine University (Malibu, CA)", "Interview Descriptions": "Easy, short and to the point. Great company to work for. I had an awesome interview experience. Laid back and really nice. Lots of distractions through out the interview but didnt seem to bother me.", "Interview Questions": "how long have you been a lifeguard privously"}, {"date": "12 Oct 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Oct 2016", "Interview Descriptions": "Behavioral interview based. Questions are fairly casual. Said Job does not require any technical questions and are only looking for a good match. One needs to beware of their values that are brought up frequently during the whole process", "Interview Questions": "Why are you interested in Pepperdine"}, {"date": "29 Sept 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Pepperdine University (Malibu, CA) in Oct 2016", "Interview Descriptions": "Met with director of business operations on Pepperdine campus. Got nominated for the position through being a sports administration major. Interview was short and more focussed on what I wanted to do in the department.", "Interview Questions": "What are you involved with on campus?"}, {"date": "17 Nov 2016", "title": "Industry Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Pepperdine University (Malibu, CA) in Sept 2016", "Interview Descriptions": "Received a phone screening, was told the next process would be to complete essay questions and was asked to complete them on the first call. Once that was done, I emailed my responses and was then asked to come in for the last phase which was a face to face. I met with the assistant director, the dean of one of the colleges, and the staff from that department on the same day.", "Interview Questions": "One question I was asked was related to how I would incorporate ministry and the mission of the university (it being Christian/faith based) into my role."}, {"date": "15 Nov 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Pepperdine University in Aug 2016", "Interview Descriptions": "Very friendly environment, full of intelligent professionals. Office manager and administrative assistant just ask a few questions regarding your educational goals while at Pepperdine. They mainly focus on any customer service experience you have, familiarity with University housing policy, and your technical skills regarding Adobe and other programs they use.", "Interview Questions": "How do you deal with difficult people?"}, {"date": "4 May 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Pepperdine University", "Interview Descriptions": "One-on-one on site interview. Ask about personal experience first and then turn to specific questions related to position. Pepperdine value the religion and culture. Some departments require student assistant can spread the Christian culture and hold the willingness to help others. If the skill set and other requirements are the same, the attitude shapes the interview process and final result.", "Interview Questions": "How do you understand the responsibility of student assistant?"}, {"date": "27 Aug 2015", "title": "Integrated Marketing Communications Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pepperdine University", "Interview Descriptions": "It's a long process (4-7 interview touch points) and they try to really get a feel for your experience and how you'll fit within the existing team you're joining. You'll meet everyone, including the CMO before an offer is extended.", "Interview Questions": "Q: Why Pepperdine. "}], [{"date": "24 Jun 2015", "title": "Office Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Jun 2015", "Interview Descriptions": "The process took 3 weeks. I applied online, and was contacted the next day to come in that week for an in-person interview. I met with 2 people (so balancing eye-contact was a new challenge for me). It took about 40 minutes. I received a call 3 days later, asking if I could come in for a second interview. I met with a team of 5 people, then the provost, then other staff members of the two offices that the manager would work in. This process took about an hour, and we talked for a while which was a good sign, I thought. She even asked to see a writing sample which I sent in later that day. \r\n\r\nHowever I received an email the following week saying they had filled the position.", "Interview Questions": "Tell me about yourself. "}, {"date": "11 Aug 2015", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Pepperdine University (Malibu, CA) in Feb 2015", "Interview Descriptions": "Applied Online, must answer 8 supplemental questions which really sets candidates apart. Had a phone call from the supervisor and asked more questions. Set up an in person with the supervisor of the supervisor. Once that meeting was set up, I was offered the job.", "Interview Questions": "Why Higher Education?"}, {"date": "5 Mar 2016", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pepperdine University (Los Angeles, CA) in Feb 2015", "Interview Descriptions": "Applied online, long and detail oriented process, 7 sub questions in essay format included (4-7 interview touch points) and they try to really get a feel for your experience and how you'll fit within the existing team you're joining. You'll meet everyone, including the CMO before an offer is extended.", "Interview Questions": "Explain the term \"work ethic\" and please describe yours.\r\n\r\n\r\n"}, {"date": "9 May 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pepperdine University (Malibu, CA)", "Interview Descriptions": "I went and asked if there were hiring students. They scheduled me a short interview and I went. No unexpected questions. They just want to know if you can take calls and help around the office.", "Interview Questions": "None. Most jobs require you to have Federal Work Study."}, {"date": "4 Jun 2014", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pepperdine University (Malibu, CA) in May 2014", "Interview Descriptions": "Found job listing online.  Submitted email about the opening.  Received email with invitation to attend an interview.  Sent requested resume.  Attended in person interview on campus.", "Interview Questions": "You will be working with us for the summer, mostly with international students.  What people skills do you have that will allow you to work well with students from other countries?"}, {"date": "11 Mar 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Pepperdine University", "Interview Descriptions": "Consisted of a phone interview and an in person interview. The phone interview was pretty standard (Experience and how well do you work in teams). The in-person interview was as expected, no behavioral questions. It was more to know how well you will fit within the team dynamic.", "Interview Questions": "What would be your step of action if you are faced with multiple projects all due within a relative short period of time. "}, {"date": "23 Jul 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pepperdine University (Los Angeles, CA) in Feb 2014", "Interview Descriptions": "I applied online via their website in November. Got a call for an interview in January. Had an initial interview with the Executive Director, then second round with the Dean, and third round with other staff. They were accommodating to my schedule and organized. I had already scheduled a family vacation in between what would have been the first and second interview. They were willing to wait until I came back which was really nice of them.", "Interview Questions": "Describe a time when you had to work with a difficult client/student, what did you do and what were the results?"}, {"date": "3 May 2014", "title": "Interactive Content Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Feb 2014", "Interview Descriptions": "As you might expect from such a religious school, everyone involved in the hiring process is very polite and mild-mannered. While the job was posted online, they were looking for someone who was sent their way via referrals (no surprise there, really). It is very important to show in both your cover letter and resume that you are OK with the religious mission of the university. Make sure that all your materials (resume, cover letter, work samples) are absolutely free of spelling and grammar mistakes. The interview process is three stage - first, an individual phone call with the head of interactive, then a conference call with everyone on the team, and finally, an in-person interview on the campus. The conference call is the most challenging part of the process, as there are a lot of people in the room, and each one has their own personal agenda. It can be difficult to figure out who is asking what, and why, but the best thing you can do is to try to be diplomatic if someone starts asking questions that seem more like barbs aimed at other people in the room (or past mistakes that you are not aware of).", "Interview Questions": "What would you do to help us fulfill the mission of the school by improving our website? "}, {"date": "1 Jul 2015", "title": "Career Services GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Pepperdine University (Newark, NJ) in Aug 2013", "Interview Descriptions": "It was over Skype, but relatively easy going and to the point. They look for people that not only are strong workers, but are also a good fit for the team itself and the office environment. Once the Skype interview was complete, I received an email within the week saying I was hired.", "Interview Questions": "Tell us a time when you made a mistake on a team."}, {"date": "25 Jul 2013", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pepperdine University (Malibu, CA)", "Interview Descriptions": "Submit an application through HR website. Pepperdine called back next day to arrange an interview the following day. I was interviewed by a large group of the department(6-8 people). Called back and was offered the Job.", "Interview Questions": "What does design mean to you. "}], [{"date": "4 Nov 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Pepperdine University (Los Angeles, CA) in Jun 2013", "Interview Descriptions": "I went through several rounds of interviews and had to deliver a presentation.  I met with my direct supervisor, colleagues, and faculty. The hiring process has changed since then.", "Interview Questions": "Describe a mistake you made and how you handled it."}, {"date": "23 Apr 2013", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Pepperdine University (Malibu, CA)", "Interview Descriptions": "Did a phone interview first. Then met with hiring manager and then did a group interview. I was given an offer after the last interview.", "Interview Questions": "No real difficult questions"}, {"date": "18 Mar 2013", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pepperdine University (Malibu, CA)", "Interview Descriptions": "I was initially called by the hiring manager and asked to come in to interview. I interviewed for the first time with him and one of his direct reports, then spent some time chatting with the person vacating this position. From there, I was called and asked to come back for a second interview, which included lunch.", "Interview Questions": "The questions were fairly general and the interview was pretty conversational. The one question that surprised me was, \"Tell me about the best practical joke you've seen.\" He was looking to see what my sense of humor was like!"}, {"date": "30 Apr 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pepperdine University (Malibu, CA) in Aug 2012", "Interview Descriptions": "Submitted an application online.  I was contacted via email about an interview and came into their office the next day. I was interviewed by the supervisor on duty on the spot, lasted about ten minutes. Nothing out of the ordinary. I was always treated very respectfully and the supervisor was happy to answer any questions.", "Interview Questions": "Why should we hire you?"}, {"date": "7 May 2013", "title": "Senior Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Pepperdine University (Malibu, CA) in Aug 2012", "Interview Descriptions": "Best if you are recommended by Church of Christ member; interview process is not difficult", "Interview Questions": "describe a work challenge and how you dealt with it"}, {"date": "29 Dec 2016", "title": "Web Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pepperdine University (New York, NY) in Aug 2012", "Interview Descriptions": "Easy, efficient, to the point. Employers have a one on one with you, and you tell them all the qualifications you have, and how they apply to the position. Then you find out how applicable it is.", "Interview Questions": "Years of experience, and what you can show for. "}, {"date": "21 Oct 2015", "title": "Assistant Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Jan 2012", "Interview Descriptions": "Generally an easy process. They wanted to get an understanding of my knowledge of basic anatomy, but more importantly they were interest in finding out why I am interested in working with athletes and why physical therapy, which is a big part of the job, is a compelling idea to me. Overall everyone was very friendly and nothing about the process was particularly difficult", "Interview Questions": "Why do you want to work for Pepperdine athletics?"}, {"date": "16 Jun 2016", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Jan 2012", "Interview Descriptions": "The interview was fair. Although intimidating due to the caliber of interviewers (e.g. established academics), they made me feel comfortable and welcomed. Questions were fair and well-thought, and there were no surprises. The setting was formal and in one of their conference rooms.", "Interview Questions": "How do you deal with conflict?"}, {"date": "26 Aug 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Pepperdine University (Malibu, CA) in Sept 2011", "Interview Descriptions": "It only took a couple of emails to apply. I submitted my resume and then I was called a few days later to set up an interview. There was only one interview, and it took place with two people. One took notes and the other asked questions, but they were not particularly difficult.", "Interview Questions": "Tell me about yourself..."}, {"date": "26 Feb 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pepperdine University (Malibu, CA) in Aug 2011", "Interview Descriptions": "The hiring process was extensive. It begun with a 30 minute phone interview which ended with a request to meet in person that same week. In person, I met with the hiring manager one on one, and then a panel of three employees in that department. A few days following I was asked to meet the rest of the team out of the West LA office. That consisted of 4 separate interviews one on one with 4 members of the staff including the Executive Director.", "Interview Questions": "The interview questions were not difficult, they pertained to my experience and how I worked in specific scenarios. I never felt that a question was too difficult to answer."}], [{"date": "21 Jun 2011", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Pepperdine University (Malibu, CA) in Jun 2011", "Interview Descriptions": "I applied for a position on Pepperdine's website.\r\nThe application process was very straightforward. I received an email requesting an in-person interview for the following week.\r\nWhen I arrived, they were very polite, friendly and prompt.\r\nThe interview itself lasted about 30-40 minutes. The interviewers were extremely warm, friendly and professional. Considering  that this was my first interview in many years, I was very nervous. I have also heard many wonderful things about the working environment and employees at this location which added to my nerves since I sincerely wanted this position. \r\nI was disappointed with my unexpected nervousness, but extremely impressed with how professional, yet empathetic the interviewers were.", "Interview Questions": "Tell us about yourself?"}, {"date": "23 Apr 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Pepperdine University (Los Angeles, CA) in Apr 2011", "Interview Descriptions": "Pleasant, yet thorough. My interviewer had definitely done her homework prior to our meeting. The interview was conducted online and I was hired immediately. My interviewer seemingly felt I was a good fit for the position based on the documents that I had submitted to her in my application packet.", "Interview Questions": "What was my mission and vision"}, {"date": "15 Mar 2013", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pepperdine University (West Los Angeles, CA) in Aug 2009", "Interview Descriptions": "2 panel interviews with team members and dean", "Interview Questions": "describe your greatest weakness"}]]