[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Loved the last 8 years working here, and I look forward to the next 8", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 Jun 2021", "job_title": "Campaign Manager in London, England", "duration": "N/A", "pros": "I'm a current employee at 38 Degrees, and have worked here for a fair few years now - starting as an intern initially The org has gone through some changes and some ups and downs during that time, but there's a reason I'm still here after so long and that's because it's always been an incredibly supportive, creative, and exciting place to work.\r\n\r\nHere's what I love about the campaigning we do at 38 Degrees:\r\n\r\nInnovative tactics and pushing the boat out to achieve change. In the last month or so I've personally worked on:\r\n- An open letter that's had a really positive response from an independent pay review body\r\n- Fundraising for, designing, and booking in a full page ad in a national paper in the space of week\r\n- Designing and implementing a spiky tactic that saw 1000 NHS staff send in £3.50 to Boris Johnson showing him exactly what his proposed pay review would look like - also planned and launched in just a few days\r\n- Supporting a nurse who's been struggling during the pandemic to come to London and take her message straight to Downing Street - culminating in her being interviewed line on breakfast tv\r\n- Producing an online leader board to showcase where MPs stand on an issue - to better hold them to account\r\n- Supporting 38 Degrees members to promote and champion getting the vaccine with their friends and family, an action that could literally save lives\r\n\r\nThis barely scratches the surface on the kinds of things I've worked on at 38 Degrees over the last 8 years, but shows that even in the last month where we've been focused on finishing our new strategy, and are low on capacity, there's huge scope for pushing the boat out and stretching yourself. As an organisation we want people to think first and foremost about what will have the achieved impact - and then worry about what is and isn't possible afterwards.\r\n\r\nAs with any organisation we do have other internal metrics that can speak to organisation health around things like fundraising, and engagement from membership, but those are constantly reviewed depending on what's happening both internally and externally.\r\n\r\n38 Degrees has also, the entire time I've been there, offered a lot of support to employees. I think this is particularly evident in the support offered over the last year during the pandemic.\r\n\r\nThe last year has been a pretty difficult one for a lot of people, but 38 Degrees has offered a lot of support to try and make it easier during that time. I wanted to list out just a few of the things I've benefited from, or witnessed others benefitting from, in the last year:\r\n\r\n9 Day Fortnight - and subsequent pay increase on the back of it:\r\nWhen it became evident how long the pandemic would last, and how much of a toll it was having on people, the organisation introduced a 9 day fortnight to give us more time to recuperate - this obviously meant people were working fewer hours, but salary did not change on the back off it leading to what was essentially a ten percent pay rise for all staff\r\nExtension of temporary contracts - pre pandemic we had four new interns start on what was only ever confirmed as an 8 month contract. However when it became apparent that their contracts would run out midway through the first lockdown the organisation extended them by an extra three months to give those interns more time to find new employment\r\nFlexible approach to childcare requirements - obviously things like school closures puts added strain on staff with children, and the organisation was really flexible in accommodating that\r\nPersonalised approach to the specific challenges faced by the pandemic. I witnessed one instance where a junior member of staff was in a particularly difficult situation outside of work, and asked for help. The organisation went above and beyond, including with financial aid, to help support them in getting out of that situation. I have no doubt that that same level of support would be offered to others in a similar place - and perhaps has been in circumstances I'm not aware of.\r\nSocial hours - we'd always been a pretty close knit team, and for some not working in an office together really took its toll on staff happiness, so the organisation has introduced social hours every couple of weeks where, over zoom, we can come together and take part in activities separate to work - often able to expense materials, lunch and more as part of it\r\nMental health initiatives - the organisation has purchased headspace memberships for everyone in the team, offered training for mental health awareness courses, and paid for a number of team members to be trained up as mental health first aiders\r\n\r\nWe also have a really generous learning and development budget, with time set aside to allow members of staff to go on training and courses during the work day, and whilst there is a set individual budget, on a case by case basis the organisation will allow people to spend over that if a particular course or bit of training costs more.\r\n\r\nThe final element of 38 Degrees support that I would like to flag is around pay. Pay at 38 Degrees is a lot higher than other organisations in the sector - as is evidenced by the fact that our internship pays more pro rata than than a lot of campaigns assistant and campaigner roles out there. Additionally I have received a pay rise every single year that I've been at 38 Degrees, regardless of whether or not my role title or responsibilities have changed. When I talk about this with friends working at other organisations or in different sectors they've always been surprised at this as a lot have gone years without a salary increase as that has been fully dependent on things like a role change.\r\n\r\nI was surprised to see other recent reviews talk about how our income hasn't changed at all, when we have weekly updates on income and so everyone should know that over the last six months we have seen a pretty big decrease in our monthly income. But thankfully as an organisation we've always had a goal of maintaining good reserves to get through dips in income, and I feel confident that when we finalise our new strategy and can implement plans we can see that start to go up again! And despite that, whilst pay rise percentages have dropped a bit over the last 12 months, to my knowledge every single member of staff has had an above inflation increase at their annual review.\r\n\r\nOn diversity, equity and inclusion as with basically every workplace out there 38 Degrees is not perfect. There will always be room for improvement, there will always be times when things go wrong, but I know the SLT and SMT want to work with the team to improve.\r\n\r\nFor me personally I'm a queer woman who has never felt able to be anything but open about that at work. I have a disability that means things like office equipment for me is going to be more expensive, but work has always been sure to buy whatever I need to work well - both in our London office, and when we moved to home working. On multiple occasions they've paid for professional assessments so I and they know I have exactly what I need. I have fairly severe long term depression and SLT and my line manager have never been anything buy supportive in giving me time off when needed, and pointing me to the support they personally pay for to provide, like an Employee Assistance Program. \r\n\r\nI know that, especially considering some of the other recent reviews, a lot of this may sound a bit too good to be true, or an embellishment, but I don't really believe in saying anything anonymously. And I'm also really excited at the prospect of some wonderful new colleagues joining in our current recruitment process and would love to talk more about this organisation I'm proud to be a part of. So if you have any questions about this review, the other reviews mentioned, or the various roles currently open - my name is Megan Bentall and you are more than welcome to message me on LinkedIn to ask them!", "cons": "We've been a bit delayed in writing our new strategy together as an organisation. First due to the previous CEO leaving, then Covid slowing things down too. The delays have meant that we haven't been able to have as much impact in the last year as we have previously, and has led to some frustrations amongst the staff team that have been difficult at times. That being said we are less than a month away from the strategy being finalised and I am really really excited to start putting things in action and see where we get to next.\r\n\r\nUnder the former CEO we had some pretty lose policies on things like promotion, pay and HR procedures. It was ok when we were a smaller organisation - though still open to abuse - but as we grow it's been necessary to actually put fair processes into place. They were policies that would particularly benefit people who's voices are loudest, or were best at championing themselves, and a real shift has been made by the organisation to change that. Obviously if you're someone who would particularly benefit from that unfair system these changes won't be popular with you, and so this has seen some staff leave as a result. And there are still new policies that need to be worked out by the team and by the union. This process has been slow going at times, and been quite difficult emotionally, but I'm glad we're doing the work to make things fairer, and look forward to completing it.\r\n\r\nWork/Life balance. We're a team of people that are really really passionate about the issues we campaign on the members we represent. That's good, but it does also mean we are always pushing to do more, and react to everything that's going on, and if we all want to make change happen we're not always that great at reigning each other in. It can sometimes mean long hours, and working at a fast pace, and getting carried away with doing as much as possible - which can be pretty exhausting. That being said we encourage people to take TOIL for over time worked, and any overworking is never something I'm pressured into doing by anyone other than myself and my need to do all the things.\r\n\r\nNo workplace is perfect, and there are definitely challenges at 38 Degrees, but there's a reason I've been here 8 years - and look forward to the next 8!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Deliberately getting rid of everything that once made it a great place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Jun 2021", "job_title": "Software Engineer in London, England", "duration": "N/A", "pros": "- Amazing colleagues. I have never worked anywhere else with such a high percentage of people that I genuinely liked and admired, and such a low (often zero!) percentage of people that I disliked. Even the senior management team are for the most part good people, in my opinion, which only makes the way they're running the company now even more confusing, frustrating, and upsetting.\r\n\r\n- Occasional fairy godmother moments still show glimpses of the company at its most human and exceptional. Notably this included the offer of untracked, judgement-free time off at short notice during the first few weeks of the first lockdown last year, followed by giving everybody every other Friday off (at full pay) from then on.", "cons": "- About two years ago, the company underwent a brutally intentional shift from having a very flat, co-operative/collaborative structure, to a very stratified hierarchical structure - with an unusually wide (and still-widening) gap between the 10 or so people who get to make decisions, and everybody else. This is being presented as \"professionalisation\".\r\n\r\n- The stratification seems to have triggered and amplified the organisation's occasional tendency to degenerate into pursuing easily-quantified short-term targets (clicks! donations!) rather than pursuing its actual mission.\r\n\r\n- Failure to recruit fast enough to compensate for the always high (and now accelerating) turnover has obviously caused understaffing, and has very noticeably increased workloads for people at almost every level of the organisation - resulting in even higher turnover. People are now quitting without even finding another job first.\r\n\r\n- Relatedly; a significant number of people are visibly not well (mental health stuff, to an extent that takes a physical toll) by the time they finish working their notice."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Don’t apply to work here", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 May 2021", "job_title": "Campaigns in London, England", "duration": "N/A", "pros": "These other reviews are old, and 38 Degrees used to be a much better place to work.", "cons": "If you join 38 Degrees, you will be made to feel completely disposable. \r\n\r\nA lot of roles will shortly be advertised at 38 Degrees - please think long and hard about whether you should apply. Speak with people who have recently left. There were also a lot of roles advertised in late 2020 too, and most of those new recruits have quit or are about to do so. \r\n\r\nLeadership’s approach to their staff, led by Interim CEO Zoe Whyatt, is hostile and unkind, and if you raise concerns, there’s a decent chance you’ll be disciplined for something else unrelated shortly after. It’s clear that the organisation doesn’t care about their incredibly high turnover, their solution is to just recruit, recruit, recruit. \r\n\r\n38 Degrees’ campaigns are all about getting clicks and raising money, nothing to do with impact. You’ll feel like you’re working in a clickbait farm after a few months. \r\n\r\nLeadership is refusing to engage with the staff team or union in any meaningful way to address these issues, and staff are miserable. In a recent survey shared with staff and ex-staff, 71.9% of staff described their level of contentment at work as either ‘unhappy’ or ‘extremely unhappy’. \r\n\r\nI would not recommend working here to anyone."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great employer!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jun 2021", "job_title": "Operations in London, England", "duration": "N/A", "pros": "Great wage, supportive and understanding senior leadership team, work is acknowledged and recognised, flexible working (especially during covid - SLT implemented a 9 day working fortnight), generous annual learning & development budget, fast paced environment where I am involved in different tasks and roles which gives me the opportunity to expand my knowledge.", "cons": "Currently 38 Degrees is going through a challenging period while we mature from a start up to a medium size organization. This is being met with resistance by some staff members. Due to this there are some culture issues but with some positive, enthusiastic, professional new team members, 38 Degrees will thrive and achieve it's mission of creating a fairer world in a working environment which is inclusive, trusting and supportive."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Going through a period of major change, but exciting times ahead", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2021", "job_title": "Anonymous in London, England", "duration": "N/A", "pros": "A team who cares passionately about ongoing issues in the world, is nimble and reactive, and has strong ideas about how to make the world a better place. Development of our new strategy - exciting times ahead! Incredible support by our members and I’ve witnessed many, many campaign wins during my time working here. The benefits are generous, including an individual training allowance, wellbeing initiatives, flexible working / Covid flex (every other Friday off) good salary, and many other things. Transparency is important and organisational information is widely communicated - to an extent that I hadn't experienced before in previous workplaces.", "cons": "38 Degrees is going through a period of big change right now - we're looking for our next CEO and there have been a number of personnel changes across the team. Working from home during the pandemic has been tough on the team culture (as for many people used to engaging person-to-person on a regular basis), though every effort has been made to encourage social interactions as much as possible, such as a fortnightly “social hour” and various other zoom gatherings. The negative reviews also posted here suggest that the whole team is deeply unhappy. But many (including myself) remain committed to 38 Degrees and its mission. The feedback from a few threatens our organisation’s sustainability and jeopardises our ability to do good in a very challenging world. More work needs to be done to move on from this culture, but change is also a very positive force and I see a huge amount of hope ahead, especially as we look to return to a physical office. The leadership team is working hard to find ways to resolve internal conflict, for example bringing in external experts, and continually looks for ways for 38 Degrees to move forward and grow, both strategically and culturally."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Changed for the worse", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 May 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "38 Degrees used to be a great place to work - I'm not surprised that the other, positive reviews, are largely from years ago.", "cons": "Over the last two years, the leadership have changed the organisation massively and, in almost every respect, for the worse. Progression paths have been cut off, pay increases have been capped (despite financial forecasting all being very healthy), and the culture of trust and support that used to exist has been replaced entirely by a hostile and aggressive top-down approach from management. The organisation is haemorrhaging staff - with something like 40% of the campaigns team leaving over the last 18 months - and the leadership just completely have their heads in the sand, refusing to even acknowledge that there is a retention issue that needs addressed.\r\n\r\nI have lost all faith in the leadership's willingness to address the ongoing issues, and I honestly couldn't recommend working here."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "38 Degrees is developing  and is a progressive place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Jun 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "38 Degrees is a progressive organisation that has gone through a lot of change and is committed to changing the difficulties that it has encountered as it moves through this change - it's one of the first organisations that I know that gave staff a paid day off every two weeks as a result of COVID - staff also get a £1,200 L&D budget every year - our well-being team look for creative ways to support our team, we celebrate our colleagues achievement every week and are look forward to being in a space together as COVID eases. The majority of staff are truly amazing, collaborative and support the mission of the organisation to make change in the UK by giving a voice to the voiceless through their work. More change is coming but this is necessary to build a stronger organisation. You will enjoy your time with 38 Degrees, you can speak to leadership if you have concerns and know that issues will be listened to and resolved. I am happy and confident to be here as are the colleagues in my team", "cons": "As we are changing to a stronger organisation with structures that support staff, new processes and ways of doing things not everyone is happy and sometimes this disgruntlement leads to a difficult environment for those who want to stay and build an amazing future. But I am confident that we have a bright future and the ability to do more good work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Soul crushing work and incredibly poor leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jun 2021", "job_title": "Campaigns in London, England", "duration": "N/A", "pros": "Supportive junior colleagues, who have their heart in the right place — and who after they leave 38 Degrees, are going to go on to do the most wonderful things for the world.", "cons": "I feel compelled to leave a review after seeing so many of my colleagues speaking out, and so desperately trying to be heard after months and months of feedback being ignored internally. \r\n\r\n38 Degrees is about to hire for a new CEO and new campaigner roles — please, please think carefully before applying for or accepting these roles. \r\n\r\n38 Degrees’ organisational culture is in crisis, and it has been for a while. Staff turnover is extremely high - around half of the entire campaigns team has progressively left in the past 12 months. New starters routinely leave before their probation period ends. Of the staff who are left there now, many are absolutely desperately looking to leave. \r\n\r\nThe approach by management is hostile and aggressive, and trust between leadership and staff is dismally low. Staff pay rises have been slashed, despite the organisation returning a large surplus — while at the same time, the CEO’s salary has been increased 25% to be up to £100,000. Leadership at 38D (which *absolutely* includes the board and board chair) have repeatedly failed to listen to staff who have raised concerns — staff are trying to escalate their concerns, leadership refuse to engage or deny what they’re raising, and the staff members eventually have no choice but to eventually resign in frustration. \r\n\r\nEvery organisation is institutionally racist, but 38 Degrees’ lack of investment in both anti-racism campaigning and policies says it all about how deeply entrenched the systems of oppression are at this workplace. When racism has been called out, both privately and in all-team sessions, it has been met by denial, and a refusal to engage with or rectify the issues.\r\n\r\nAs an organisation, 38 Degrees are failing to do the hard work when it comes to dealing with oppression. In fact, what we're doing is one step worse - we're making the public statements when there's external pressure (i.e. George Floyd), and then failing to follow through with anything substantive. We are consistently centring the voices and perspectives of those who need it the least — of older, wealthier and white people. \r\n\r\nThis organisation has no impact in the real world, and simply just churns out populist, centrist petitions and non-stop fundraising emails. Being a campaigner here is soul destroying — like being at a worse, more impotent version of change.org. \r\n\r\nI think our model borders on being fraudulent at times — as we constantly ask our (older) members for money, and then almost never actually do campaigning other than just engaging and reengaging our email list with meaningless petitions. \r\n\r\nI remember reading a message from a woman who was so poor, but she had decided to donate her heating allowance to 38 Degrees. It broke my heart — I became a campaigner to help people like her, not to mislead them into giving us donations. It really is soul destroying.\r\n\r\nIf you’re thinking about applying to be the next CEO — this is the model of campaigning and 5 year strategy that you’re going to inherit and need to implement. It’s running an organisation like a business, designed to hit unrelenting income goals — not a venture trying to make the UK a fairer and more equitable place. \r\n\r\nI would not recommend working here to anyone."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A bad working environment, and poor leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jun 2021", "job_title": "Digital Campaigner in London, England", "duration": "N/A", "pros": "No staff members earn less than the living wage, and there are some other benefits. But I believe that many current and former staff would agree that those things do not make up for the toxic work culture, the amount of hours you have to work and the unfulfilling click-driven campaigns being run.", "cons": "38 Degrees claims to be a progressive organisation - in reality this is far from the case. In the last year, and under the leadership of the current interim CEO Zoe Whyatt, it has shown itself as an organisation committed only to preserving its income and hitting vanity metrics, and more significantly as an organisation unwilling to tackle institutional racism and instead replicate and worsen it. \r\n\r\nThe organisation can no longer be considered ‘progressive’ in any sense - it has introduced policies that disproportionately affect the pay and progression of minority staff, it has scrapped the 3:1 pay scale, opting to pay any new CEO over 100k (an increase of 25%) while not changing junior staff pay in any way - in fact slashing it, and it has ended or not extended several employee contracts during the height of the pandemic despite the org being in a good financial position/those staff members not having any performance issues. It has even given some staff a 1% pay rise for \"great\" performance, while ironically campaigning for NHS staff to get more than a 1% pay rise because it is below inflation.\r\n\r\nIt used to be committed to running meaningful impactful campaigns but this has also gone in recent months, as well as any element of a good, happy and safe working culture - with a high proportion of the campaigns staff recently leaving. \r\n\r\nThere are indeed various staff benefits like a paid day off every two weeks (this is not permanent however and will likely end as COVID measures do), and a sizable learning and development budget. But even with these benefits, and the good pay, the working culture and staff morale is so low that 10 staff members have left the org in the last two months alone, that’s nearly a quarter of the staff team. \r\n\r\nPerhaps the biggest issue and reason for so many staff leaving (with many of those ex employees also writing negative reviews on here) is because of the poor leadership of the organisation. The CEO and Senior Leadership Team (SLT) refuse to engage in meaningful conversation, even on matters as serious as racism in the workplace. They pay lip service to diversity and inclusion but when it comes to actually taking action to root out issues of racial bias and discrimination in the workplace they are silent and protective of the offenders. They have a bullish and uncollaborative approach to all decision making, and take feedback personally, often refusing to accept it, despite claiming that the organisation boasts a wonderful ‘feedback culture’. \r\n\r\nIf you apply to work at 38 Degrees please speak to current and former members of the staff team, all but a few are unhappy in their jobs hence the number of staff leaving and the big recruitment drive currently being run. The culture is toxic - with leadership saying they are willing to listen and learn, but not."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Soul crushing place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Jun 2021", "job_title": "Campaign Manager in London, England", "duration": "N/A", "pros": "They are very stable financially, fundraising so far unaffected by COVID.\r\nLots of great colleagues, more than usual. Very many people forge very close friendships (although largely through mutual frustration, pain and misery)", "cons": "38 Degrees is a soul-crushing place to work. \r\n\r\nIf you care about running campaigns that have impact on anything, this is not the place to work. It is an impossible and soul crushing weekly battle to run proper campaigns. Campaigns are consistently killed to reallocate resource to creating clickbait petitions that there is no intention to do anything with. Campaigners raise tens of thousands of pounds but aren't allowed to spend it on campagin actions. It feels like the org only exists to raise money to keep existing. There is no strategy, vision or any meaningful desire to create impact.\r\n\r\nThe \"reactive\" always on culture leads to permanent burnout after a year or so of working. Every task, email, petition is treated as urgent and you work at 100% from the beginning to the end of the day. This can feel exciting and fun when you start working there but after a while it's unbearable, exhausting and affects your ability to enjoy your evening and weekends as you are too exhausted from work.\r\n\r\nThe culture is toxic. Huge numbers of staff are leaving, even new hires are quitting before their probation is over. Morale could not be lower, everyone is miserable and looking to leave. Leadership blame staff for all the problems and talk about staff as if they were petulant kids, rather than adults who deserve respect and have valid concerns or points of view.\r\n\r\nSenior management excuse all of this with being in a period of transition as the company hits 10 yrs after the founding CEO was fired. It's been two years without a strategy, there is no transformation except the destruction of a trusting culture which sought to run ambitious campaigns. The mission is hollow and always shrinking to the lowest point - engagement for engagement sake, fundraising just to meet targets and never spend, impact the last thing to ever be considered.\r\n\r\nMaybe a few years from now this could be improved, but right now avoid at all costs."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love 38 Degrees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Jul 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "38 Degrees is a great place to work. Our culture is strong, really focused on delivering results and serving our membership but in a way which is kind and supportive of each other. We spend loads of money of staff development - I've got a coach, have been sent on some brilliant training courses, have had opportunities to go on secondments overseas, etc.\r\n\r\nMost importantly of all, I get to work on the big issues of the day, run big, ambitious campaigns, and serve a big, broad church membership of people from all over the UK.", "cons": "38 Degrees is fast-paced, and multi-issue, you need to be \"on\" all the time! The office is vibrant, open plan, hot-desking. Most of the time I love this, but there's no hiding place if you're hungover/having an off day.\r\n\r\nNow and then there's an issue I really wish we could be working on, but which the members just don't see as a priority."}]]