[[{"date": "29 Jun 2023", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University (Washington, DC)", "Interview Descriptions": "The interview process was straightforward. Knowing the professor helped. I had the option of interviewing on either Zoom or in-person. The professor was flexible. Overall, it was a good experience.", "Interview Questions": "What makes you interested in this role?"}, {"date": "2 Jun 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at American University", "Interview Descriptions": "Easy interview, basically just asked what my major is, what my hours available are, what my past experience is. Very simple and easy to answer, especially since this was a student position.", "Interview Questions": "Why are you interested in working while still being a student."}, {"date": "13 May 2023", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "It was done virtually and was thorough. There was a screening and then a hiring manager interview which included a mock tutoring session. Lastly, was a final interview to finalize the position requirements.", "Interview Questions": "How have you gone about explaining a difficult concept to a first time tutoring student?"}, {"date": "28 Jun 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University in May 2023", "Interview Descriptions": "Round one- Self interview. Answered 10 questions via audio recording. Fairly straight forward questions. Round two- 3 hour interview with multiple departments. Same questions repeated for each session/department. Wondered if we could not just record the interview and then have other stakeholders review the info later. Very tedious.", "Interview Questions": "Q: How would you handle policies that you don't agree with?"}, {"date": "3 Dec 2022", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC)", "Interview Descriptions": "Quick invitation after application submission, used an easy online scheduling system, interview was with three people from the office. It was conversational and interesting. They were super communicative after the interview too.", "Interview Questions": "Experience working on a team"}, {"date": "8 Nov 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "After an online application, and resume/cover letter, the interview was on Zoom. It included a panel of administrators and program directors and one applicant. It was comfortable and pretty easy! Took about 30 minutes and then heard back within the week.", "Interview Questions": "Give us an example of a time when you took initiative and contributed to the collective through action in the workplace"}, {"date": "8 May 2023", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in Oct 2022", "Interview Descriptions": "Received an email a couple days after applying. I believe it was a single round of interviews, but I didn't get an offer. I didn't hear back from them until two weeks later when I reached out and was informed I didn't get it.", "Interview Questions": "How do you deal with multiple projects?"}, {"date": "13 Dec 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University in Aug 2022", "Interview Descriptions": "Spoke with one woman for an intro call then met in person with 2 people. Both very friendly and helpful. No communication afterwards from them after I sent emails. A simple rejection email doesn’t hurt.", "Interview Questions": "What are some of the skills from your previous job that could be useful for this position?"}, {"date": "14 Jul 2022", "title": "Special Events Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American University", "Interview Descriptions": "The interview process was very smooth. I met with a panel of people and then again with the direct report for the role. The panel gave very clear feedback on the culture of the department and the individual interview gave a clear idea of the responsibilities of the role.", "Interview Questions": "Why do you want to work for the university? "}, {"date": "11 Mar 2023", "title": "Residential Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in Jul 2022", "Interview Descriptions": "The interview process was very easy to navigate. I interviewed with the hiring manager (position supervisor), the other operations coordinator, and the department director. All interviewers were very engaged in the conversation and I felt comfortable being myself.", "Interview Questions": "What is my experience working in Student Affairs?"}], [{"date": "17 May 2022", "title": "Athletic Facilities and Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Very easy and chill process. Interviewer is very nice and easy to talk to made the environment very comfortable. Quick process from applying to interviewing to working. Not a lot of questions during the interview process", "Interview Questions": "What is your availability each semester? "}, {"date": "3 May 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "I was contacted for a virtual interview on a video platform. The actual interview was easy to do and the questions were really good questions. However, I never heard back again after completing the interview. I even reached out to the HR personnel who originally sent me the interview request and they did not respond to my email.", "Interview Questions": "What is your experience managing volunteers?"}, {"date": "1 Nov 2022", "title": "Adunct Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at American University (Washington, DC) in Apr 2022", "Interview Descriptions": "Zoom call, i initial screening was done through word of mouth, and in person visit. She did ask me a lot of question about my instruction method or previous experience on similar course", "Interview Questions": "What do you do when students just give out due to personal mental issues?"}, {"date": "7 Mar 2022", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American University", "Interview Descriptions": "Pretty average interview experience with a few rounds of interviews with a hiring committee etc. I do appreciate how open, flexible, and friendly everyone in the process was. I also appreciated the timely manner in which the hiring director got back to me. One word of advice - prepare something to present on.", "Interview Questions": "Q: What is you ability to look at a candidate beyond their grades? "}, {"date": "15 Feb 2022", "title": "Supplimental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at American University (Washington, DC)", "Interview Descriptions": "Meet with the SI coordinators and put together a sample class that you teach them! This can be on any topic you like or are interested in. They ask you questions about your teaching style and learning style and how you would best help students with the material you are teaching.", "Interview Questions": "How would you handle a student not understanding the information?"}, {"date": "7 Feb 2022", "title": "Staff Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "The application was pretty standard - you filled out which section and the role you were applying for and your contact info and year in school and major. Then you had to submit 3 writing samples/news clips.", "Interview Questions": "What could the newspaper improve on, why would you be qualified for the job, what are some pitches/ideas you want to write about, and why you want to join"}, {"date": "23 Mar 2022", "title": "Director of Strategic Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University in Feb 2022", "Interview Descriptions": "I was first invited to interview through an automated video screening. The questions were timed, and I was only allowed one redo. It was a stressful and dehumanizing process. \r\n\r\nFollowing that, I had one interview with the head of the American University research center I applied for, along with a senior comms staff member for the organization as a whole. I was asked pretty standard questions about my experience as a communications director. I felt like things went well.\r\n\r\nAfter a series of frentic emails from HR about getting my references and additional work samples in, I never heard from them again. A few weeks later, the position was reposted, this time with a salary range which was much lower than my own range.\r\n\r\nWas the fact that I didn't get the job because my range was too high? Did I not provide the right work samples? Did I get a bad reference? I wouldn't know, because no one ever contacted me again. Technically, I think I'm still in the running for the job, because they never followed up, though I'm assuming I didn't get it.", "Interview Questions": "Typical interview questions for a communications director role. "}, {"date": "30 Mar 2022", "title": "International Student Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American University in Feb 2022", "Interview Descriptions": "Completed an online aptitude test and never got a callback. Answers to questions were recorded as well, which made the interview process extremely awkward and impersonal. Waste of time, not worth applying to in the future.", "Interview Questions": "What is a moment you had to deal with a difficult student or customer?"}, {"date": "27 Dec 2021", "title": "Police Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American University (Washington, DC)", "Interview Descriptions": "The entire application process takes about 2-3 months this is to be expected for a police department. The process for me was as follows: application, online written test, interview, background interview, background investigation, hiring. The interview was not difficult  but I recommend practicing with someone and doing some research if you do not have any experience in policing. They give law enforcement scenarios and general workplace scenarios to determine a few things: common sense, general intelligence, personality, competence and the ability to make decisions. They don’t expect you to know the specifics of the law but have a general understanding for the scenarios.  Dress business professional for sure: wear a suit!", "Interview Questions": "Describe an Ethical dilemma at work and what you did? What does integrity and respect mean to you? Multiple basic law enforcement scenarios. "}, {"date": "11 Oct 2021", "title": "Study Abroad Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Friendly, relaxed, but turned out the head of the department (not my interviewer) didn't accept any applicants who were over his idea of ideal weight. I was startled that this kind of discrimination still exists. (I know--stupid of me.)", "Interview Questions": "Don't remember what questions were asked."}], [{"date": "8 Mar 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at American University in Oct 2021", "Interview Descriptions": "Simple questions about experience. Be prepared to talk about the courses you may teach. Helpful if you can be specific when discussing your approach to classes, challenging students, etc. Be concise.", "Interview Questions": "How would you teach [course in job description] to a class of 20 students?"}, {"date": "8 Sept 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Basic interview questions. First I had a phone interview, then an interview with the department's director and her team. It was an enjoyable process overall. Received a quick call back with offer in 3 business days.", "Interview Questions": "How do you balance the students/visitors wants with the University's rules and guidelines?"}, {"date": "1 Jul 2021", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at American University", "Interview Descriptions": "Had an in person interview with two of the senior housing department staffers. The interview lasted about an hour and I was asked questions regarding problem solving and customer service based.", "Interview Questions": "If you are dealing with a parent of student who is asking information about their child's housing information or meal plan, what do you say?"}, {"date": "10 Apr 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American University (Washington, DC)", "Interview Descriptions": "I was a Resident Assistant during the 2013-2014 and 2014-2015 school years, and I believe my interview took place in February 2013.\r\n\r\nI remember there being an application process and then a full day interview process. If I recall correctly, you had individual interviews in one half of the day and group activities/observation the other half.\r\n\r\nIndividual interviews were pretty straightforward; I believe you interviewed with two or maybe three folks...or maybe multiple folks in multiple rounds? It was a mix of professional staff and paraprofessional (student) staff.\r\n\r\nThe group interviews I believe were three different sections.\r\nOne was essentially a pretend 1:1 conversation with a student, presumably for gauging our natural instincts at how to respond and have difficult or intense conversations.\r\nOne was actually done as a group; a half dozen or so interviewees were asked to work together to “design a residence hall” and this presumably gauged teamwork skills, your dynamic in a group, and potentially also gave some insight into what each candidate saw as essential functions/features of the residence hall. \r\nThe third I don’t recall unfortunately at this time.", "Interview Questions": "N/A"}, {"date": "1 Mar 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Group process interview followed by panel interview with RDs. Overall was fairly straightforward, but there were a lot of candidates for the positions.  Group process interview followed by panel interview with RDs. Overall was fairly straightforward, but there were a lot of candidates for the positions.", "Interview Questions": "How I felt responding to emergency and stressful situations?"}, {"date": "18 Sept 2020", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University", "Interview Descriptions": "The initial phone interview went very well and was positive, however, the in-person started on the wrong foot with including outdated information. The HR person listed had a name change, so security wouldn't let me in. The hiring manager during the interview seemed extremely annoyed that I arrived early and left me in a large conference room.  The interviewer was rude and patronizing.  Afterwards, there was zero follow-up. I hadn't planned to accept the job anyway, but I at least expected a \"the position was filled\" email.", "Interview Questions": "Q: Why do you want to work here...etc."}, {"date": "3 Oct 2020", "title": "Teaching Assitant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in Aug 2020", "Interview Descriptions": "Very helpful, very respectful. Highly based on the transcript and having a connection with the professor. There really isn't an interview. Very helpful, very respectful. Highly based on the transcript and having a connection with the professor. There really isn't an interview.", "Interview Questions": "What was your grade in this class?\nWho taught the class?"}, {"date": "1 Apr 2020", "title": "Multiple Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University", "Interview Descriptions": "After having several interviews for multiple positions at AU, I received official word from a department hiring manager confirming that it's the school's policy to not give updates  to job candidates regarding the hiring status until the hiring manager has made a decision. While this policy makes sense from a legal perspective, it makes AU and in particular hiring managers and interviewers look bad.", "Interview Questions": "Why are you the best person for the job?"}, {"date": "12 Feb 2021", "title": "Front Desk Agent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in Jan 2020", "Interview Descriptions": "It was a phone call that took place a few months ago, where the individual called me and we talked on the phone for a discrete amount of time answering a discrete amount of questions.", "Interview Questions": "What are your greatest and weakest traits ?"}, {"date": "30 Mar 2020", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at American University (Washington, DC) in May 2019", "Interview Descriptions": "I received an interview within one week with the Kogod operation office and they asked me some basic behavioral questions. Go over your resume and asked about the experiences you have in the past.", "Interview Questions": "How will you describe yourself as an animal?"}], [{"date": "29 May 2019", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American University (Washington, DC) in May 2019", "Interview Descriptions": "Had a phone interview that lasted a half hour for the school of International Service. None of the questions were particularly difficult but make sure you do research about the school itself because they will ask you specific questions about which programs you find interesting and what you would do to improve them.", "Interview Questions": "What program of the School of International Service would you best be able to tell the story of and how would you tell it?"}, {"date": "27 Mar 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Sent in resume and cover letter. I mentioned past research, my career goals and interests. I did not have to go through an official interview. \r\n\r\nThey typically do not interview graduate RA's unless you apply for a specific position with a specific professor.", "Interview Questions": "N/A"}, {"date": "7 Mar 2019", "title": "Graduate Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at American University", "Interview Descriptions": "Very quick, depends largely on availability and communication skills. I like the fast turn around, and that they recognize your needs as a graduate student. Everyone is eventually trained, so your weekly schedule and people skills are the most important factor.", "Interview Questions": "How would you describe your communication style? "}, {"date": "23 Jan 2019", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American University", "Interview Descriptions": "I applied online. I had two phone calls with the supervisor. I would have met the supervisor in person but I was out of the state.  He was very kind, and offered me the job two days after the second phone interview.", "Interview Questions": "What is your preferred working style?"}, {"date": "2 Nov 2022", "title": "Quantitative Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American University (Washington, DC) in Nov 2018", "Interview Descriptions": "Phone interview with executive director and the other research methodologist. Asked to prepare and present an in-person presentation to the entire center focusing on the methodology. Then had Q&A session with the audience and external statistician who was on the search committee.", "Interview Questions": "Software experience, consultancy experience, knowledge assessment, programming example."}, {"date": "14 Sept 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC)", "Interview Descriptions": "The interview process was smooth. I had to attend two interviews. I heard the result in two weeks. The interview was rather informal about how I can contribute to the program in this position.", "Interview Questions": " how I can contribute to the program in this position. my vision."}, {"date": "12 Jul 2022", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in Jul 2018", "Interview Descriptions": "Virtual interview with the entire team via Zoom, straightforward interview questions, also had the opportunity to ask questions for the team. Non-senior staff were all very new to their roles 1-3 years of experience/working in the office.", "Interview Questions": "Why are you interested in working for this position?"}, {"date": "12 Jul 2022", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University in Jul 2018", "Interview Descriptions": "The interview process was in two parts; first being a phone interview asking about my interest in the department and any experience I had working with students and/or a customer service role. \r\n\r\nThe second interview was in person where I met with several department staff members. Each member asked questions about my interest and experience in the role, as well as provided different questions and scenarios of. how I would respond to certain situations.", "Interview Questions": "What would you do if a parent asked for a student's housing information without the consent of the student present?"}, {"date": "10 Feb 2022", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at American University (Washington, DC) in Jan 2018", "Interview Descriptions": "I wasn't ever interviewed for this job. I already worked for American in another capacity, but I just wrote an email saying I would like to teach, and they told me the classes that were available. I think I had to send my resume, too.", "Interview Questions": "They didn't ask me any questions. "}, {"date": "25 Nov 2018", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University (Washington, DC) in Jan 2018", "Interview Descriptions": "After a short online application, I did both a group interview and an individual interview. For the group interview I was with about six other applicants and we were asked to create icebreaker activities and present to a panel about resources on campus. For the individual interview, a panel asked me questions about my leadership experiences and involvement on campus.", "Interview Questions": "What leadership roles have you held in the past?"}], [{"date": "20 Dec 2017", "title": "Customer Service and Resource Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American University in Dec 2017", "Interview Descriptions": "The interview process was fairly standard. I had a phone screening with an HR rep first and then a Skype interview for the final panel interview. I was one of seven final candidates. The overall experience was very pleasant and I even received a phone call to let me know that I was no longer being considered as a candidate (I really do appreciate receiving such notice instead of waiting and hearing nothing back).", "Interview Questions": "The interview questions were common ones. There were quite a few behavioral interview questions. "}, {"date": "30 Jan 2021", "title": "Registrar Office Personnel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University in Dec 2017", "Interview Descriptions": "Long interview process from application to first interview (about two months), however, once the first interview was completed, the hiring process only took about two weeks. Seamless transition and easy on-boarding.", "Interview Questions": "How do you manage stress at work?"}, {"date": "4 Feb 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in Dec 2017", "Interview Descriptions": "I had two phone interviews (potential supervisor and then with a potential colleague), followed by a writing sample, and then a day long in-person interview with several members of the team.", "Interview Questions": "How would you respond in this example situation? "}, {"date": "14 May 2018", "title": "Assistant Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at American University (Washington, DC) in Nov 2017", "Interview Descriptions": "Quick turnaround, multiple step (2 phone interviews, one day of in person interviews with different levels of staff, and a 30 mins presentation. Spoke with 20+ people on campus and salary negotiable.", "Interview Questions": "Why American?"}, {"date": "8 Jun 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University in Sept 2017", "Interview Descriptions": "Relatively straightforward. Asked about any experience in administrative work, as well as the questions of how one deals with a difficult visitor, etc. Also asked for availability, including on the weekends.", "Interview Questions": "What relevant experience do you have for the position?"}, {"date": "31 Jul 2017", "title": "Assistant Director of Recruitment and Advising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American University (Washington, DC) in Jul 2017", "Interview Descriptions": "I applied online with an employee referral.  I had a phone interview a couple of days later.  I was then invited to submit a writing sample.  When I didn't hear back about the writing sample by the Friday deadline, I emailed the point of contact who then invited me to an in-person interview for Monday morning (short notice).  I interviewed with different teams and people for 4 hours and found out later that week they were going with someone else.", "Interview Questions": "Tell me about a time you had to deliver news about a bad decision someone else made."}, {"date": "7 Apr 2017", "title": "Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at American University (Washington, DC) in Apr 2017", "Interview Descriptions": "I submitted my resume, cover letter, and references via email, and then signed up for an in-person interview. They asked several structured questions (below) and then clarified specific logistical issues like scheduling concerns.", "Interview Questions": "Asked for examples of how I'd handled situations in the past - for example, how I'd handled customers who seemed unreasonable, or balancing priorities. "}, {"date": "28 May 2017", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American University in Apr 2017", "Interview Descriptions": "Applied online for a Part-Time Communications opening. Received an email a few days later to set up a phone interview. The interview went really well, interviewer spoke of next steps and it sounded very promising. Was even told a second, in-person interview would be arranged soon. Then, never heard back. I sent a thank you email within 24 hours. That, and later follow-up attempts, received no response. Even though the position was part-time to start, I was grateful for the opportunity to join AU. Needless to say, I am very disappointed.", "Interview Questions": "Are you OK with working part-time to start?"}, {"date": "16 Mar 2017", "title": "Agricultural Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC)", "Interview Descriptions": "one in person interview with three people, lasted one hour,a variety of substantive and skills based questions were asked.  It was not a stress interview.  One problem, though, was that I did not meet my future supervisor at the interview because she was on maternity leave.", "Interview Questions": "What is agricultural marketing?"}, {"date": "17 Oct 2017", "title": "Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at American University (Washington, DC) in Mar 2017", "Interview Descriptions": "It was quite simple and straightforward. I sat down with someone who worked in admissions and we talked about the job, some of the responsibilities, and why I wanted to work there.", "Interview Questions": "Do you have any experience thinking on your feet while working with others?"}], [{"date": "16 Jan 2018", "title": "Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University (Washington, DC) in Mar 2017", "Interview Descriptions": "Interview done at the last minute.  I was surprised that they weren't better organized.  Seemed to me to be somewhat par for the course.  Interviewers were all friendly and asked fair questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Jul 2018", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American University (Washington, DC) in Feb 2017", "Interview Descriptions": "I applied directly to their webpage, and was contacted a week later for a phone interview. After that I waited for two more weeks until I was called for another round of interviews. The process was rather simple, and the questions were mostly about my previous experience.", "Interview Questions": "What was your previous experience as a librarian? "}, {"date": "22 Feb 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at American University (Washington, DC) in Jan 2017", "Interview Descriptions": "you need to talk to the professor and arrange an appointment with him. The process is not very hard but you need to knew your professor well and also do well in his class.", "Interview Questions": "What is your strength？"}, {"date": "14 Feb 2017", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in Dec 2016", "Interview Descriptions": "I applied on the American University website, filling out an extensive application and submitting my resume and cover letter. I was contacted via email by a HR recruiter and we arranged a time for a phone interview. Phone interview took about thirty minutes, and she told me she would be in touch within a couple of days to let me know if I was moving forward to an in-person interview. She called and asked me to come in for an interview the following Tuesday and informed me that the department was conducting all interviews for this position that day, since they were trying to make an offer to someone before the Christmas break. I went to the interview on campus and spoke with a panel of five people - the department chair, 3 tenured faculty members, and a personnel manager. Two days later, the recruiter emailed me asking for references and asking that I let my references know to please answer her emailed questions as quickly as possible. Three minutes after my last reference texted me that she had sent in the email, the department chair called to make me an offer, which I accepted (did not negotiate).", "Interview Questions": "How do you handle prioritizing tasks and completing work in a timely manner when multiple people need you at once?"}, {"date": "14 Mar 2018", "title": "Marketing and Events Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in Sept 2016", "Interview Descriptions": "I found the job on the university jobs board website. I reached out via email regarding my interest in the role after applying. I followed up again a week later to reiterate my interest in the role. I was then asked to provide my availability for scheduling an in-person interview. The interview went smoothly - it was a relaxed environment. The woman I met with was my boss-to-be and she had great insight into the real tasks the assistant would be assigned in the role. After meeting, I sent a follow-up thank-you email. I found out I got the job 1 week later.", "Interview Questions": "Can you walk me through your resume?"}, {"date": "23 Aug 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University (Washington, DC) in Aug 2016", "Interview Descriptions": "The process was pretty easy. Started with a phone interview and then a little over a week later, an on campus interview was conducted. It consisted of a campus tour, lunch and individual meetings with 5 members of the senior staff. They asked normal interview questions and it wasn't awkward or intimidating at all.", "Interview Questions": "Tell me about your past experiences and why do want this job."}, {"date": "27 Jun 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American University", "Interview Descriptions": "The interview was via Skype. I did not get a follow-up response to my interview. I had to reach out via email to get the acknowledgement that I was not considered for an on campus interview. It would have been nice for them to send something out to the interviewee on their status.", "Interview Questions": "What project did you have to analyze the numbers in? "}, {"date": "8 Jun 2016", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in May 2016", "Interview Descriptions": "Thorough process with friendly folks.  I liked everyone I met during the interview process.  The pay, however, is very low at AU.  They could keep people longer at their positions if they had higher salaries.  Invest in people!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "25 Aug 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at American University (Silver Spring, MD) in Mar 2016", "Interview Descriptions": "I met with former professor and director of the Master's program in two separate meetings. Their goal was to review my knowledge base as well as ideas for the course. Questions illustrated concern for commitment to the time required to the course (6 weeks on Saturdays from 9am-5pm), and  quality of content. I tried to convey my passion, not only for the material but for education and the college experience overall.", "Interview Questions": "How would you structure the 8 hour class day? What ideas do you have to update the course content? What issues do you see in the industry that students should be made aware of?"}, {"date": "7 Nov 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American University (Washington, DC) in Jan 2016", "Interview Descriptions": "Applied online in November 2015.  Received email invitation for first interview in early December.  First interview took place in mid-December and last an hour and half, mainly due to conversations resulted from my questions.  First interview was with the hiring manager and the person from whom I would be taking over the responsibilities.  A few days after first interview I received an email from hiring manager requesting references.  Then the University closed for winter break and I did not hear anything until January 2016.\r\n\r\nJanuary 2016 - Received an email from hiring manager to schedule a second interview.  The second interview was with hiring manager and his superior.  The second interview lasted 30 minutes.  I received the offer within a week.", "Interview Questions": "Standard interview questions: What did you do in this situation?  Tell us about the time that you did that.  "}], [{"date": "15 Dec 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Unorthodox meeting over coffee with the Director, we discussed the research and role and briefly touched on my background in research.  It seemed more informational in my opinion but seemed to be what the director was looking for.", "Interview Questions": "Past experience in research"}, {"date": "2 Nov 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at American University in Sept 2015", "Interview Descriptions": "Emailed for an interview with director of program and manager. Within the week I was called back for a second interview with the Dean. Offered the job in less than two days from second interview.", "Interview Questions": "How would you bring new business development to an already saturated market?"}, {"date": "17 Mar 2017", "title": "Financial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at American University (Washington, DC) in Sept 2015", "Interview Descriptions": "I went to a college career fair and handed my resume to the Student Activities department at American University and then they emailed me several days later to figure out a time for an interview, I had an interview scheduled for the next week and then I interviewed and was told I got the job another several days later.", "Interview Questions": "How do you respond in a stressful situation?"}, {"date": "21 Apr 2016", "title": "Circulation/Stacks Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at American University (Washington, DC) in Apr 2015", "Interview Descriptions": "I submitted my app through the AU Part-time jobs site for a summer position at the AU Library. I got an email to schedule my interview there within two weeks. The interview itself was very relaxed, the staff is great. I wouldn't stress too much about this process. If you get an interview, you're likely already hired.", "Interview Questions": "Talk about a time where you had to balance multiple projects, and how you handled any conflict/problems while doing so."}, {"date": "23 Mar 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "Quick and easy process, interviewed with supervisor only before being offered the position. I met the team after being hired. Mostly general experience questions and some follow up based on those responses. It helped that I knew someone working there and they were able to recommend me.", "Interview Questions": "Tell me about your previous admin experience?"}, {"date": "31 Mar 2015", "title": "Business Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University in Mar 2015", "Interview Descriptions": "First, I had the opportunity to have a phone interview with one of the HR Recruiters for the Business Assistant position. Our conversation went well, and I was super excited for the next steps in the interview process. A few weeks later I received an email from the recruiter stating that they had filled the position internally, but that there was a similar position posted that she was planning to recommend me for. Soon after I applied for that position, I received an email to schedule a phone interview with the hiring manager for the department. My phone interview went great, and we scheduled a second interview for the following week. Once I went in for my in-person interview, I walked out feeling confident, and then received a telephone call that afternoon from the hiring manager offering me the position. It was a relatively quick process, and HR was incredibly helpful during the entire process.", "Interview Questions": "What type of work environment are you most comfortable in?"}, {"date": "2 Feb 2015", "title": "Career Counselor Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American University", "Interview Descriptions": "The interview was fairly simple.  They want to know what you can contribute, how you go about looking for job openings for students, etc.  They prefer people who have some experience as a practicing attorney and are now looking to make a change in careers.  Make sure you can answer why you no longer wish to practice.", "Interview Questions": "N/A"}, {"date": "6 Sept 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in Nov 2014", "Interview Descriptions": "first round is 30 min interview with the professor. professor is nice and casual, he asked for me transcript, writing sample and a presentation. and asked me how comfortable using SAS \r\nsecond round is with dean", "Interview Questions": "all behavior question and technical"}, {"date": "2 Apr 2018", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in Oct 2014", "Interview Descriptions": "Met with select management staff to discuss view and values on customer service. What should be understood is the importance of the concept that customer focus personalities and positive attitude are highly sought after, as the job functions and duties can be easily taught on the job.", "Interview Questions": "Whats most important to you, being right or appeasing the customer"}, {"date": "5 Sept 2014", "title": "Foreign Language Coach Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American University", "Interview Descriptions": "-Reached out to the supervisor and expressed interests of applying\r\n-Got confirmed of interview date over email\r\n-Conducted an on-site interview to talk about resume, past experiences, and strength to contribute. The interview lasts for about 30 minutes\r\n-Got the offer, negotiated schedule, and got started", "Interview Questions": "N/A"}], [{"date": "6 Jul 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American University", "Interview Descriptions": "There were two interviews- the first was a phone interview followed by on-campus. The on campus interview consisted of meeting and interviewing with my supervisor and one other advisor. I found a great deal of value in their interview process as they did not just ask canned questions and rather were interested in learning more about me as a person and seeing if I would fit and work well with the office and supervisor.", "Interview Questions": "Questions relating to dealing with students' parents."}, {"date": "24 Oct 2016", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at American University (Washington, DC) in Jun 2014", "Interview Descriptions": "The hiring process was relatively straightforward, but prolonged due to some senior leadership changes. This may or may not be the case generally, as there is a constant change of mid-level managers. It has its pro's and con's, but it works to the benefit of the university mostly.", "Interview Questions": "What role on a team do you gravitate towards most?"}, {"date": "21 Apr 2015", "title": "Program Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American University (Washington, DC) in May 2014", "Interview Descriptions": "The interview process included, a phone screen, one to one interview with Ready Hire, and an interview with the department. I was hire within 2 business days of interviewing with the department. The whole process was about one month,  2 weeks from application to phone screen.", "Interview Questions": "Name one of your biggest challenges within your current position"}, {"date": "31 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American University in Apr 2014", "Interview Descriptions": "the whole process took about 3 weeks. There are a phone interview a couple of days after I submitted my application. I thought it went well, but I had to wait for more than a week and a half to have a follow up. Recruitment assistants over the phone were not helpful at all. \r\nI later got an email saying they needed an in-person interview. Thant went well and I got the job on the spot.", "Interview Questions": "What are you weaknesses and strengths"}, {"date": "27 Apr 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at American University (Washington, DC) in Apr 2014", "Interview Descriptions": "Was offered the opportunity to write an analysis of a philosophical piece for a chance to apply for the position.  From there I was asked to submit a resume and statement of intent.", "Interview Questions": "N/A"}, {"date": "18 Oct 2015", "title": "Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American University (Washington, DC) in Apr 2014", "Interview Descriptions": "It was fairly simple, an experience based interview, so lots of tell me about this time when questions. Don't be afraid to be honest about why you want the job ie. money. They don't anticipate you to be passionate about guarding the front desk, but they do want you to take it seriously. Emphasize customer service experiences, they want people who are going to be able to keep a smile on their face while telling a parent that they won't be able to do the thing that they want them to do.", "Interview Questions": "Tell us about a time when you provided exemplary customer service"}, {"date": "25 Mar 2014", "title": "Recruitment Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American University", "Interview Descriptions": "Good agenda.", "Interview Questions": "Nothing was unexpected asked all the standard interview questions. "}, {"date": "19 Mar 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at American University", "Interview Descriptions": "All hiring through Housing & Dining follows the same format- they will ask you \"about a time you ____\" and expect a three part response. First, explain the situation you encountered in relative detail but briefly. Second, explain the steps you took to approach the problem or challenge. Third, explain the results AND any feedback you got on your actions. This may seem remedial, but it's important to hit all three as this is literally the order in which they record your response and their thoughts on each piece.", "Interview Questions": "Tell us about a time you worked with someone different from you. "}, {"date": "2 Apr 2015", "title": "Program Specialist- School of Public Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American University (Washington, DC) in Mar 2014", "Interview Descriptions": "I had one in person interview. I applied in mid December and had the interview in mid February and started Mar 3. I interviewed with my now supervisor and now direct co-worker. It was very laid back and took about 30-40 min. I felt very comfortable. The recruiter who emailed me was very helpful before and after the process. I received an offer within a week of my interview.", "Interview Questions": "How do you prioritize tasks?"}, {"date": "21 Sept 2017", "title": "Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at American University (Washington, DC) in Mar 2014", "Interview Descriptions": "I called the early childhood center at AU asking if they had any positions open. They did but had just taken down the ad. I did two working interviews, two because my potential coteacher was out sick the first time I came in.", "Interview Questions": "How do you communicate with your coworkers to make sure everyone gets all the information in between shifts?"}], [{"date": "19 Feb 2014", "title": "Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University", "Interview Descriptions": "Application process conducted online. Contacted later via email that I had received an interview. Interview process was concise and predictable. Single round of interviews. 30-45 minute interview. All behavioral questions.", "Interview Questions": "All were typical interview questions "}, {"date": "30 Mar 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University (Washington, DC) in Feb 2014", "Interview Descriptions": "The interview lasted a half-day. I spoke with many of the hiring panelists in appointments back to back. A member of the department’s hiring team contacted me to set up a time. (If you don’t live in Yukon, initial interviews may be conducted by phone or Internet video.) Now, this was my chance to do some background research and to gather together everything I needed to come to the interview confident and prepared. It was my first experience with this interview style, so I knew I needed to prepare.", "Interview Questions": "If you were an instrument in an orchestra which one would you be and why? What seat would you play?"}, {"date": "6 May 2014", "title": "Police Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at American University (Washington, DC) in Feb 2014", "Interview Descriptions": "Fairly short. They had brought me in for a group interview/orientation. Then we had to come in for a panel interview with other Police Officers and a short writing test, then we had a panel interview with management. It was all pretty standard questions. After a background check was conducted and they called our references. After that we where probationally highered and we had to do a drug test and couldn't have any felonies on our record.", "Interview Questions": "Remember a time when you faced racism in your past"}, {"date": "20 May 2015", "title": "Contract Assignment Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at American University (Washington, DC) in Feb 2014", "Interview Descriptions": "Standard review of statement of work and my portfolio.  I spoke to the person supervising the work and then to his manager.  We went back and forth on the final statement of work.  After some changes on deliverables and fees everything worked out fine.", "Interview Questions": "When can you start work?  What is your standard rate per hour?"}, {"date": "10 Jan 2014", "title": "Media Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University (Washington, DC)", "Interview Descriptions": "You will put in an application (usually online), if you are selected you will do three additional interviews: a basic phone interview with low level admin, an in-depth interview with the library HR rep, and then a through interview with the department supervisors.", "Interview Questions": "How will you discipline employees that are roughly your same age?"}, {"date": "6 Jan 2016", "title": "Coordinator In Housing and Dining Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American University (Washington, DC) in Jul 2013", "Interview Descriptions": "The process focuses around \"targeted selection\" interview questions - they believe that past actions will reflect future performance. They want to hear a story that explains the situation, the problem at hand, what you personally did to remedy the situation, and then any feedback you got/anything you learned from it.", "Interview Questions": "Describe a time when you had to work with an individual or group of individuals that you didn't agree with."}, {"date": "24 May 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at American University", "Interview Descriptions": "Sat down and had a cup of coffee with the professor", "Interview Questions": "Where do you want to be after your 2 years are done at American University?"}, {"date": "1 May 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University", "Interview Descriptions": "The hiring and interview process was smooth and relatively easy. It was more of a conversation with a senior staff member who seemed to have already made their decision following the initial phone interview.", "Interview Questions": "Again, the interview was more of a conversation than an interview with tough questions. Also,  the person i interviewed with talked more and i listened. "}, {"date": "14 Aug 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at American University (Washington, DC) in Mar 2013", "Interview Descriptions": "The interview was apart of the graduate school application process. It was not  typical job interview. I applied for graduate school and the job was apart of my financial package.", "Interview Questions": "Why do you want to attend AU?"}, {"date": "2 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in Jan 2013", "Interview Descriptions": "Apply online using an outdated system, followed by a phone screen, and then an in-person interview. It's a relatively slow process, but the recruiters are friendly. Overall it's the normal interview process.", "Interview Questions": "How does this job help you to meet your goals?"}], [{"date": "4 Dec 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American University (Washington, DC) in Jan 2013", "Interview Descriptions": "I had two interviews, each with a separate upper level management. The interviews were very casual, but I remained very professional. The conversations focused on my ability to remain organized and juggle different projects. They asked me to work on project for them which I returned to them immediately the next day, within twenty four hours. After the interview, I got a call to begin work a week after interviewing.", "Interview Questions": "How are your organizational skills?"}, {"date": "23 Oct 2016", "title": "Translator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at American University (Philadelphia Main Post Office, PA) in Aug 2012", "Interview Descriptions": "Bachelor of Arts in Translation, I translate from English to Arabic and vice versa. The interview was so difficult but skill and experience helped e a lot to get the job.", "Interview Questions": "Why should we hire you?"}, {"date": "1 Dec 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American University (Washington, DC) in Nov 2011", "Interview Descriptions": "There was twenty minute phone interview in the beginning  followed by an in person interview that was onsite on campus.  The in person interview was for about 4 hours. Met every single department person. Fifteen minute breaks in between. More of a group interview setting. I was then given a writing test for about twenty minutes at the end.", "Interview Questions": "What are your organizational skills like?"}, {"date": "23 Apr 2014", "title": "Office Assistant (Student) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at American University (Washington, DC) in Aug 2011", "Interview Descriptions": "A simple phone-call to schedule an in-person interview - as a student, what's more important is your availability as opposed to your ability. Never be afraid as a student to make yourself more available and more times, because that will go a much longer way to getting employed.", "Interview Questions": "N/A"}, {"date": "23 May 2012", "title": "Writer/Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American University (Washington, DC) in Aug 2011", "Interview Descriptions": "Was called by future boss about coming in for an interview. The interview itself made it seem like the job would keep me very busy (in a good way), though that's not how it turned out. My future boss was very friendly, sometimes a little too chatty and repetitive, but nice. Did a writing test to see if I could match their style and tone. Was brought in for a second interview with two team members, which was a little awkward because I wasn't sure how I'd actually be working with them. They seemed like they weren't sure why they had to meet with me.", "Interview Questions": "How would you go about interpreting a scientist's research for a layperson?"}, {"date": "30 Aug 2015", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American University (Washington, DC) in Jul 2011", "Interview Descriptions": "it was a panel discussion and it and respectful and interesting and was useful to get to know the office culture and it was about an hour long and there were two panel interviews and it gave me a good idea of what it would be like to work there.", "Interview Questions": "1. why do you want to work here\r\n2. what do you like about working with students"}, {"date": "16 Nov 2011", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American University (Washington, DC) in Jul 2011", "Interview Descriptions": "Received an email from the professor. Set up a time/date and went to her office to meet with her. Asked questions about interest, background, and ability to perform required duties. Went very well and received offer later in the week", "Interview Questions": "N/A"}, {"date": "30 Dec 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American University (Washington, DC) in Jun 2011", "Interview Descriptions": "Met with other members of the staff in the office for about 2 hours individually with some and with a group.  It was very hot, which should have been a sign.", "Interview Questions": "They asked detailed questions regarding the functions of the office and how it related to my experience."}, {"date": "23 Apr 2013", "title": "Assistant Director of Payroll Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at American University (Washington, DC) in May 2011", "Interview Descriptions": "Interviewed by HR person and one other person.  Interview lasted about an hour an half.  Asked a lot of hypothetical questions.", "Interview Questions": "There were no difficult questions asked."}, {"date": "2 Dec 2015", "title": "Director of Sustainability Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American University (Washington, DC) in May 2011", "Interview Descriptions": "Interview process was managed by a recruiting firm. Recruiter actually expressed negativity about my chances, even though I was eventually offered the job. After phone interview with the recruiter, I was interviewed by phone by the person hiring the position. Then did an in-person panel with supervisor and all peers. Then a final sign-off interview with the CFO.", "Interview Questions": "What do you want to be doing in ten years?"}], [{"date": "24 May 2013", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American University (Washington, DC) in Mar 2011", "Interview Descriptions": "Initial cover letter. Resume. Ect... \r\n\r\nIn interview, the questioners are looking to show thinking from start to finish. Explain the decision the, what occurred, and what the result of that decision was. It would help to say what you would have done differently. Also, emphasize previous positions where you have had to design and lead programs.", "Interview Questions": "A situation where you failed"}, {"date": "4 Feb 2014", "title": "Assistant Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at American University (Washington, DC) in May 2010", "Interview Descriptions": "Meet with various constiuencies", "Interview Questions": "N/A"}, {"date": "25 May 2010", "title": "Part Time Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at American University (Washington, DC) in Apr 2010", "Interview Descriptions": "continuing employment", "Interview Questions": "how long are you planning on staying with us?"}, {"date": "16 Mar 2010", "title": "Health Fitness Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at American University (Washington, DC) in Jul 2008", "Interview Descriptions": "I met with the 2 assistant directors of Recreation Sports and Fitness separately, then met with the Director.  Lastly, I met with the current Health Fitness Supervisors alone.  The last part was the most informal and they gave me all inside information on the job.", "Interview Questions": "Why do you want to work here?"}]]