[[{"date": "26 Jun 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clark College (Vancouver, WA)", "Interview Descriptions": "I submitted an application online and was emailed for a phone interview. I then chatted with the hiring manager and was selected for a part-time role without participating in an in-person interview with a group of interviewers. It felt casual.", "Interview Questions": "How did you hear about this opportunity?"}, {"date": "23 Aug 2022", "title": "Teaching and Learning Center Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clark College in Jun 2022", "Interview Descriptions": "Submitted an application online, with Resume and Cover Letter.\r\n\r\nWas interviewed by a panel for about 30 minutes on Zoom. It was highly structured so there was little chance for side conversation. Was never really given any feedback on my performance.", "Interview Questions": "Why are you interested in this position and Clark College and what in your background best qualifies you for this position?"}, {"date": "11 Mar 2022", "title": "Computer Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Clark College", "Interview Descriptions": "It was easy and it was a great time to get to know the employers there. They are great communicators and it was a nice easy time to talk about experiences and the role itself.", "Interview Questions": "Tell me about yourself and your goals."}, {"date": "1 Feb 2022", "title": "Nursing Success and Retention Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clark College (Vancouver, WA) in Jul 2021", "Interview Descriptions": "Zoom interview where you show them a 20 min lesson on the Nursing Process followed by a 20 to 30 minute interview. They email you questions (seven plus a question: do you have any questions?) 10 minutes before the interview.", "Interview Questions": "Why do you want the job?"}, {"date": "26 Mar 2023", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clark College in Apr 2021", "Interview Descriptions": "In person interview in front of panel of five. In depth description of job duties and expectations. One hour given for interview questions as well as interviewee questions. Skill test given at end of interview.", "Interview Questions": "Name an area in which you feel you could improve on."}, {"date": "21 Apr 2020", "title": "Computer Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Clark College", "Interview Descriptions": "it went well and I liked the interview I felt very comfortable and I would like to work here and i enjoyed talking to the interviewer and I would take the interview again if they offered it to me because it is such a wonderful place to have an interview at.", "Interview Questions": "would you like to work here"}, {"date": "14 Feb 2023", "title": "Video Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clark College (Vancouver, WA) in Oct 2019", "Interview Descriptions": "The interview was done in the office of the supervisor and was fairly average however, the interviewee did seem a little rushed. However, outside of that, the interview went well and seemed professional.", "Interview Questions": "What about this job interested me?"}, {"date": "14 Dec 2018", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clark College", "Interview Descriptions": "Friendly interviewers. Very standard interview questions. Setting was a group interview of about six people and everyone got a chance to talk.  Two interviews were conducted to narrow down who they wanted to hire.", "Interview Questions": "What was one time you had to problem solve?"}, {"date": "28 Jun 2018", "title": "Computer Aid Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Clark College (Vancouver, WA)", "Interview Descriptions": "Very easy. The interview was one on one with the CADD professor. He was interested in someone in the CADD program therefore my certificates weren’t an issue. It was a computer classroom aid he wanted.", "Interview Questions": "What certificates do you have?"}, {"date": "14 Jul 2021", "title": "Would Rather Not Say Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clark College (Vancouver, WA) in Feb 2018", "Interview Descriptions": "It takes a long time to the employer to select candidates and hire. For this reason, many great applicants drop out of the interview process and lower ranking candidates end up getting hired into high positions, and it has yet to end well.", "Interview Questions": "There is always a diversity question. "}], [{"date": "4 Mar 2017", "title": "Director of Advising Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clark College (Vancouver, WA) in Jan 2017", "Interview Descriptions": "I was offered an onsite interview. Everyone was lovely. The final round was a full-day process where i met with dozens of people. There was an open forum for community partners and a follow up process for faculty who could not attend (no one showed up to the follow up). I left the interview feeling pretty good but a few days passed and I received an automated HR rejection. No one followed up in person - even after a request. I believe the position went to a qualified internal candidate.", "Interview Questions": "I was asked a lot about how you manage the needs of a large department. "}, {"date": "11 Oct 2015", "title": "Engineering Club President Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Clark College (Vancouver, WA) in Oct 2015", "Interview Descriptions": "The professor asked me to be the president of the club. I thought about the idea for a while. I weighed my schedule, my classes, my free time, and other things, and then I decided to take the job. So far, it has been going well.", "Interview Questions": "Will you be the president of the Engineering Club?"}, {"date": "8 Sept 2019", "title": "Assistant Professor, Tenure Track Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clark College (Vancouver, WA) in Mar 2015", "Interview Descriptions": "Teaching demonstration and panel  interview. After being selected as a top candidate, there was a final interview by president and vice president of instruction. The teaching demo and panel interview was fine. The final interview was weird and included sexist questions.", "Interview Questions": "Paraphrasing: \"Did you choose to go to that elite college on the east coast despite growing up on the west coast because you were chasing a boy?\""}, {"date": "18 Feb 2015", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clark College (Vancouver, WA) in Dec 2014", "Interview Descriptions": "Completed an online application process, and then a couple weeks later a recruiter called me. I had two interviews within a 2 week period. I was fairly optimistic/hopeful after my second interview, however I received an e-mail notifying me they went with another candidate. I thought that the process was pretty straight forward and the interviewers did a good job asking questions, while making me feel comfortable. Many of interviews I've had they intentionally try to make you feel uncomfortable.", "Interview Questions": "1. Give us an example of a time where a situation/project didn't go well, what did you do?\r\n2. How would you deal with a testy customer?\r\n3. What was your favorite thing about your last job?\r\n4. Tell us about yourself.\r\n\r\nSecond interview was a bit tougher as you would expect. There were 4 people on each interview panel. The second interview included the Chief Communications Officer."}, {"date": "10 Sept 2014", "title": "Curriculum Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clark College (Vancouver, WA)", "Interview Descriptions": "There were two interviews held. The first with a panel across campus disciplines. They asked questions about diversity, working with large numbers of students and working with non traditional students.  The second interview was with a Program Coordinator, Associate Director and Dean of Student Services.  The questions they asked were much more specific, asking about specific situations in how I would deal with a difficult student and how I learn new requirements about degrees and relay that information to students.", "Interview Questions": "The most unexpected question was if I could manage working with 1,000 students per quarter and if I experienced a large volume of students in a day and how I managed the process."}, {"date": "28 Oct 2014", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clark College (Vancouver, WA) in Sept 2014", "Interview Descriptions": "All communication was through e-mail, and the actual interview was set up online.   The interview was a panel interview comprised of five ladies from the HR department, or that worked closely with the department.  Each interviewer asked one to two questions and gave ample time for me to formulate an appropriate answer.  The interview was very straight forward.  After the interview I was asked to do an Excel and mail merge exercise; both of which were fairly easy.", "Interview Questions": "N/A"}, {"date": "12 Mar 2014", "title": "Admissions Recruiter/Student Retention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clark College", "Interview Descriptions": "Submitted an application online and then put together a sample recruitment presentation with slides about the college. After that there was a panel interview with representatives from several offices. Questions focused mostly on how I had addressed working with diverse populations in the past and my personal philosophy on college education.", "Interview Questions": "Tell us about a time you had a disagreement with a coworker."}]]