[[{"date": "9 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA)", "Interview Descriptions": "Had to go through three interviews. First interview was video format, then an interview with a nurse recruiter, then interview with nurse manager. Video format interview was the hardest because they give you a time limit to answer questions.", "Interview Questions": "Three words to describe myself"}, {"date": "6 May 2023", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA)", "Interview Descriptions": "I was asked the usual questions, such as tell me about yourself or where do you see yourself in 5 years? Was also given detailed information about the position, and got a chance to ask the recruiters questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 Mar 2023", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "I felt comfortable in the interview process. The interview was more like a conversation type of interview. Through the interview, a person could tell the interviewer care about his employees and the importance of the position within the organization. Overall, I had a great experience!", "Interview Questions": "Tell me something about yourself? Career goals ? Where you see yourself in the future?"}, {"date": "21 Mar 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "i got interview by the unit manager and another RN on the floor, I believe she had a year of experience at that time. By the end of the interview I was offered the position", "Interview Questions": "what make you choose lehigh valley? Tell me about yourself"}, {"date": "17 Feb 2023", "title": "Engagement Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "I went through a phone interview which went great. I was then interviewed in person- again went great. Both times, I was offered a range of salary and with my experience, I was on the high range of that. I was offered a position, which I accepted. Everything was great until I spoke to HR. HR was absolutely unprofessional and that's coming from someone currently in school for HR via SHRM. She gave me one LOW BALL OFFER. When I explained, I spoke about this with the department and that I had 12 years experience, she tried to belittle me by saying that \" you only have NINE years experience\" lol. I reminded her I had TWO children inbetween and even though I did, I still remained EMPLOYED during and regardless that I was not entry level. For someone in HR, she was absolutely unprofessional and confrontational. She said she would speak to the department and get back to me. There was silence for about four days! I reached out to the department and explained what happened. She emailed me again (in writing) the salary range and again, it was a range I was happy with. It was BOE and I had experience! Then HR sent me an email RESCINDING THEIR OFFER because I was \"over the pay range.\" There was absolutely NO negotiation, there was no communication it was disorganized and disappointing. As someone who worked in the field, again for twelve years in management positions; it's quite disappointing and they should quite honestly be embarrassed at themselves. I had higher hopes for such a big health network. When I emailed HR- I asked kindly- why they rescinded their offer, when the department sent me an email that morning- with a range I was happy with? I was met with silence. Perhaps other departments and other people in HR are better- but there is so much mismanagement going on there; that honestly I dodged a bullet. Clearly they do not want to pay people what they are worth and expect you to accept anything they throw at you- even if it is below what you are worth and you were offered a position, with a pay range you WERE happy with.", "Interview Questions": "What skills I had, Details about the position."}, {"date": "19 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "It was a rather brief process. The interviewer asked me about my background, education, and previous healthcare experience. She proceeded to ask me interview questions and I answered them. She asked if I had any questions at the end.", "Interview Questions": "Describe a situation when you had a difficult patient and how you handled the situation."}, {"date": "10 Jan 2023", "title": "MLA II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Santa Clara, CA) in Dec 2022", "Interview Descriptions": "List of questions. Time of interview 30 minutes. The interview was via Zoom app. And it was recorded. They asked about teem work, stress handling, conflict resolution. What would I do if there is nothing to do at work?", "Interview Questions": "For blood culture what bottles goes first?"}, {"date": "11 Nov 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Called within a few days of application, scheduled immediately to meet with hiring manager. Not really much to describe regarding the interview process it was quick everyone was accommodating and friendly", "Interview Questions": "Usual set of interview questions"}, {"date": "16 Sept 2022", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 9 months. I interviewed at Lehigh Valley Hospital and Health Network (Lehigh Valley, PA)", "Interview Descriptions": "Not too difficult, I contracted for them before hand. Just had to negotiate salary.  That took a while.  Human Resources had to be involved.  Everyone in the department considered it a done deal\n\n\n\n\n", "Interview Questions": "How much experience do you have"}, {"date": "7 Jul 2022", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "LVHN reached out quickly and set me up with an interview. They offered me the position quickly following the interview for an insulting salary. They seem like they would be great to work for if you're okay not being able to afford to live while doing it.", "Interview Questions": "The basic questions that you'd get at any similar job interview for this position. "}], [{"date": "22 Sept 2022", "title": "Category Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Lehigh Valley Hospital and Health Network in Jul 2022", "Interview Descriptions": "Had a quick 20 minute screen with the external recruiting company they are using (Insight Global) and then an hour long interview with two members of their Supply Chain group. ", "Interview Questions": "Please describe your past experience with category management and running in-depth RFQs?"}, {"date": "21 Jun 2022", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "They contact you via email within 3 days after application. First, they places you in a pre recorded interview, then call you for information about residency program, finally is an interview with nurse manager (online).", "Interview Questions": "Why don you want to be a nurse?"}, {"date": "8 May 2023", "title": "Reg Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lehigh Valley Hospital and Health Network (Easton, PA) in Apr 2022", "Interview Descriptions": "The interview process was Smooth, easy, and informative. The interview itself was great.it’s was a pleasure meeting the hiring manager for the position. Overall, it was a pleasant experience for me", "Interview Questions": "What are you strengths and how do you use them?"}, {"date": "2 Mar 2023", "title": "Transition of Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Mar 2022", "Interview Descriptions": "First I received an email asking a few questions. Then I was interviewed with the manager over the phone. After that I received an invite to meet with the entire team remotely via webex.", "Interview Questions": "Explain an example of a problem and how I solved it."}, {"date": "24 Feb 2022", "title": "Security Guard Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Lehigh Valley Hospital and Health Network (Emmaus, PA) in Feb 2022", "Interview Descriptions": "Interviewers were bigots and heavily biased. Questions were irrelevant and pure sexism was displayed by a \"male-dominated\" job. Narcissistic comments were made and were irrelevant to any professional interview process.", "Interview Questions": "How is kindergarten going for you?"}, {"date": "4 Feb 2022", "title": "Patient Transporter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lehigh Valley Hospital and Health Network (East Stroudsburg, PA) in Feb 2022", "Interview Descriptions": "Called in for an in-person interview. The facility and workers were very nice. The response after applying was reasonable, only a couple of days. Scheduled Interview within a week of applying.", "Interview Questions": "What was a conflict that you have had with a coworker and how did yo resolve it?"}, {"date": "5 Jan 2022", "title": "Senior Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network in Dec 2021", "Interview Descriptions": "Although this was a negative experience for me, the interview process itself was very organized and quick.  \n\nI had applied and heard back from the VP of the group within a couple days.  We set up a virtual interview and I was very impressed by the VP.  Although she didn't think I was a good fit for the role I applied, she saw value in me and offered me a different position that sounded good to me.  A few days later I spoke with the hiring manager, who was also very nice, if not desperate for more people because of high workload.\n\nThe VP and I agreed on a number, and mentioned we were both flexible and would meet somewhere in the middle.  She reached out to me and said to expect an offer.  I was shocked a week later when the offer was 30% below what we had discussed, and would result in a huge pay cut for me.  I reached out to the VP to ask where to disconnect was, and to her credit she responded quickly and said she was 'disappointed in the offer she could extend.'\n\nHere's what happened: HR overrode her decision and decided to lowball me based on an internal \"equity comparison/compensation\" pricing model, that reduces people to numbers on a spreadsheet and probably needs to be updated post-covid.  It astounds me that the same companies that are desperate to hire workers and complain that \"no one wants to work\" will turn right around and lowball people.  It's even more shocking to me that an HR department, who never even had a conversation with me prior to calling me to extend an offer, would override a VP's decision as to the value I bring to her team.  Why did you put that VP in her role if you don't trust her judgement?  Clearly, they just took a quick look at my resume for my age, and decided I wasn't worth what the VP and I both agreed I was worth.  Given what they are probably spending on travelling nurses and contractors these days, I find that downright insulting.\n\nAnd, gee, I wonder why the hiring manager is so desperate for more people.  This position has been open for weeks and I keep seeing it get reposted.  But, hey, if you want to hire cheap labor, only to have them leave two years from now when they realize how underpaid they are, who am I to tell you how to run your company?\n\nIf you apply for a job here, expect to be lowballed by HR - it won't matter what you and the hiring manager agreed to.  It's a waste of your time and you should look elsewhere.", "Interview Questions": "They asked about my background and leadership style while managing different teams.  It was a very good, organic conversation."}, {"date": "2 Dec 2021", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lehigh Valley Hospital and Health Network (Easton, PA) in Dec 2021", "Interview Descriptions": "The interview process was easy and quick, you need to have a computer with a camera and audio set up. There was 5 questions asked and you are given enough time to think about the question and how you would like to answer the question.", "Interview Questions": "Why do you want to work for Lehigh valley health network?"}, {"date": "20 Jan 2022", "title": "Technical Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Dec 2021", "Interview Descriptions": "Online over zoom. I did have a second interview in person. I talked to the director of the floor and the educator. I was able to take a tour of the unit and meet some of the staff.", "Interview Questions": " What differs you from other applicants"}, {"date": "18 Nov 2021", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Penn, PA) in Nov 2021", "Interview Descriptions": "It was an online video interview. There were 4 questions and i had 3 minutes to answer each question.  It wasn't too bad. They were just generic questions that you get asked at every interviews. The phone call information session with kelly was very helpful.", "Interview Questions": "Was there a time when you had to adjust your communication style?"}], [{"date": "18 Oct 2021", "title": "Physician, Infectious Disease Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "short and simple  i was asked the proper questions to get hired and the persoqn giving the interview was super chill and nice the environment was also super welcoming so im hoping i got the job", "Interview Questions": "what makes you choose this career?"}, {"date": "5 Oct 2021", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Met with people at multiple levels in department and physicians group. Interviewed with multiple colleagues in division which was a bit exhausting. Toured 2 hospitals with a physician colleague. Everyone very friendly and helpful.  No dinner or lunch.", "Interview Questions": "What are you strengths and weaknesses? Would you consider traveling for work. "}, {"date": "29 Sept 2021", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Informal, comfortable and helped gain a better understanding of the nature of the work, adequately prepared me for my first day with no surprises.  Answered all questions appropriately and with enough detail.", "Interview Questions": "What interested you in the network?"}, {"date": "29 Jan 2022", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Lehigh Valley Hospital and Health Network (Bethlehem, PA) in Sept 2021", "Interview Descriptions": "I submitted an application through the LVHN website. A week later I received an email from Human Resources telling me I was being considered for the position I had applied for in a Cardiology office. The woman in charge of the hiring in the office called me the next day and asked me when I could come in for an interview. It was a Wednesday when she called and I told her I could come in on Friday. She said wonderful. On Friday I arrived on time. She called me in and was very pleasant. We just chatted a bit about the weather and our dogs and then she asked me why I wanted this particular position. I told her and she seemed pleased with the answer. She then went on to ask a few questions which were a little more difficult to answer. I had to think for a bit (about 30 seconds) before I answered a couple of them but overall I found it to be a good interview process and was very comfortable the entire time.", "Interview Questions": "Why do I want this particular position?\r\n\r\nWas there ever a time when you found a co-worker to be difficult to work with? If so, did you do anything to make the situation better? What did you do, if anything?\r\n\r\nWhat would you do if you were speaking on the phone with a current patient who wanted an appointment immediately and they become abusive when you tell them there are none available for at least 2 weeks?"}, {"date": "16 Aug 2021", "title": "Senior Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "The interview process was very efficient and pleasant.  Human Resources expedited an offer.  Interviewer was professional and polished.  The interviewer provided a very detailed overview of the position I was interviewing for.", "Interview Questions": "Hiring manager asked about my ability to handle difficult employee situations. "}, {"date": "9 Jul 2021", "title": "Revenue Cycle Trainer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "I had two Skype interviews. The first was with a hiring manager, and the second was with the same hiring manager and another employee. I did not receive any contact after interview #2 to state that I had not been selected.", "Interview Questions": "Demonstrate how you would train someone on something."}, {"date": "23 Jun 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Easy to arrange, comfortable, not intimidating. Got a tour of the unit. Got a chance to talk and meet with current staff members. Took advantage of the chance to job shadow before accepting the position.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "3 May 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "It was a very easy process and the interviewer made me feel very comfortable. I would just be yourself and make sure you show your love for nursing throughout the interview. It has been an awesome expiereince and didn't take too long.", "Interview Questions": "Why Lehigh Valley Health Network?"}, {"date": "1 Apr 2021", "title": "Community Vaccinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "The first phase is an online video interview where the computer prompts a question and then your response is filmed and submit. The next round consisted of a group zoom interview. A few of the hiring staff and about 6 other candidates met on zoom and answered questions about ourselves.", "Interview Questions": "Where did you do your clinical hours?"}, {"date": "26 Oct 2022", "title": "Diagnostic Imaging Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network in Mar 2021", "Interview Descriptions": "Very professional, fair and no pressure. It was more an exchange of information and questions regarding shift availability, benefits and job description. No 'trick' questions or unnecessary jab to put you on the spot.", "Interview Questions": "Q: What is your availability?"}], [{"date": "24 Feb 2021", "title": "PRN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "It was a typical interview for this position and I have no pros or cons to say. Everyone was professional and I left still wanting the position. That is all", "Interview Questions": "Describe a challenge you have overcome "}, {"date": "12 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "I first started with a group interview and then an individual interview with the unit director. During the individual interview they brought in one RN and one tech to ask me questions. I then shadowed a nurse on the unit for an hour.", "Interview Questions": "What are your strengths/weaknesses? Why do you want to work at LVHN? "}, {"date": "13 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Polite, explanatory, and their onboarding process is well managed with others as they due the I believe 3 times a month.  Overall the interview process was a quite simple background check, and ascertaining aptitude.", "Interview Questions": "Do you know anyone within the network?\n\nLVHN is huge on the aspect of their network, once they train and employ you they want to be sure you'll stay."}, {"date": "3 Feb 2021", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Video interview with nursing liason, asked questions about clinical experiences, give examples, impact of COVID, lasted about 2 hours. Important to dress professionally and give great detail in recalling experiences for examples", "Interview Questions": "Give an example of a time that you went above and beyond for a patient?"}, {"date": "10 Feb 2021", "title": "Patient Care Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (East Stroudsburg, PA) in Jan 2021", "Interview Descriptions": "Quick and straight forward.  Applied, received a call form HR to setup phone (COVID) interview with the hiring manager. Interview questions were relevant to the position and my experience with no pointless “tell me about a time when...” questions. I was offered the position within a couple of days of the interview.", "Interview Questions": "Tell me about your education (of others) experience. \r\nTell me about your nursing experience. "}, {"date": "24 Feb 2021", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2021", "Interview Descriptions": "First I filled out an application and then I was notified that they wanted me to do a video interview. Then I had a phone interview before I was hired. I applied on 1/27 and was hired 2/24", "Interview Questions": "They asked me to talk about my previous experience and then asked me if I had any questions for them. "}, {"date": "16 Feb 2022", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network in Nov 2020", "Interview Descriptions": "After submitting the online application, I was contacted within days for a group interview with other new grads. The first interview was through Zoom and everyone was asked the same questions, mainly questions about your personality and experiences. At the end of the first interview, everyone was asked their top 3 areas of nursing they would like to work in. The interviewers were honest about positions available and asked for extra options if needed. The second interview was with the managers/director of the floor/area of nursing you wanted to be hired in. Again the interview was more personality questions. I was asked no clinical scenarios because they said they would teach us everything we would need to know on the job, which was reassuring to hear as a new grad nurse. Overall it was a very pleasant experience!", "Interview Questions": "Q: Why did you become a nurse? Why do you want to work here? Why do you want to do ____ area of nursing? What is your experiences? "}, {"date": "23 Oct 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Oct 2020", "Interview Descriptions": "I applied online received an invitation for a virtual interview then I received an email that they would start to interview people next week and to please let them know if I wasn't interested in the position but 4 days later received an email thanks for your application but we decided to continue with other person. I'm so confused I never did my 2nd Interview.", "Interview Questions": "Tell me more about you and how do you handle this and that situation?"}, {"date": "26 Aug 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "5 people taking interview at a time and asking their prepared question sequentially.  Waiting was super long, they made me wait outside for more than an hr. Then they took almost an hr for interview.", "Interview Questions": "What did you achieve in your last job which you are very proud of? "}, {"date": "14 Aug 2020", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA)", "Interview Descriptions": "The initial group interview was extremely informative. Information was explained in a conclusive manner.  Was not a scary or intimating process. More so, an informational session. Come with questions and do not be shy.", "Interview Questions": "Asked about preference of units"}], [{"date": "28 Jul 2020", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "The interview process was short and relatively simple. I spent about 30  minutes with human resources and abut 30 minutes with the hiring physician. It was not an intimidating process.", "Interview Questions": "What would you like to accomplish here?"}, {"date": "7 Aug 2020", "title": "Technical Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network in Jul 2020", "Interview Descriptions": "relaxed, friendly, kind,caring, thoughtful, down to earth, phone interview, through on the questions. She made you feel at ease and more on a friendly scale then boss and employee. Cool", "Interview Questions": "the basic ones they ask anywhere "}, {"date": "31 May 2020", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Very nice. The people were nice. about 5 people were in the room. Mainly asked about what I knew how to do and if i have done projects before. They made me feel comfortable and were very nice to me throughout the process", "Interview Questions": "My experience and side projects"}, {"date": "19 Oct 2020", "title": "Process Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Lehigh Valley Hospital and Health Network in Jan 2020", "Interview Descriptions": "The interview process was comprised of two parts: a panel interview and a team based interview. Each process was comprised of a series of questions, like any traditional interview. Both interviews were scheduled within a few weeks of each other and the offer was sent closely following.", "Interview Questions": "Describe yourself in one word"}, {"date": "11 Jun 2020", "title": "Senior Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2020", "Interview Descriptions": "it was a very smooth process but it went on too slow. i wished they should expedite in future and not take so long. but once i had a phone interview it went on good.", "Interview Questions": "tell me about yourself"}, {"date": "6 Nov 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Oct 2019", "Interview Descriptions": "Interviewed over the phone, then with hiring manager, never heard anything back.  Called to follow up, messages never returned.  Was never contacted to say thanks but no thanks, we hired someone else, nothing.", "Interview Questions": "Tell us about yourself"}, {"date": "5 Feb 2021", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jul 2019", "Interview Descriptions": "Friendly and professional team; did not ask typical canned questions; seemed to genuinely enjoy their jobs, department and colleagues. Disappointed there was no communication or follow up from hiring manager / recruiter after the interview.", "Interview Questions": "What type of content would you post on social media to promote LVHN?"}, {"date": "16 Mar 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network in Jul 2019", "Interview Descriptions": "Interviewer came up with some great questions and i felt that they were very easy to talk to. Questions were compatible with the job I was applying for. Not anything out of the ordinary questions", "Interview Questions": "why do you feel you are the best fit did you ever encounter a negative situation with a patient and how did you handle it."}, {"date": "21 Mar 2022", "title": "Technical Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in May 2019", "Interview Descriptions": "Group Interview with other candidates, and one-on-one interview. Well-structured and you get to meet possible nursing managers that will work with you.  The group interview is half the day and really gives you an insight into what they are looking for.", "Interview Questions": "How do you deal with difficult situations? "}, {"date": "27 Apr 2019", "title": "PSR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA)", "Interview Descriptions": "Got called for an interview within a week of applying. They were very nice and friendly. They explained the responsibilities of the job and the hours of the job.", "Interview Questions": "Tell me about a time you had conflict with another employee and how did you handle it. "}], [{"date": "10 Aug 2022", "title": "Security Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Feb 2019", "Interview Descriptions": "Very calm easy going interview . Not high pressured like any typical interview a bunch of unnecessary questions. My interview was a one on one which made it more relaxing .", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "8 Sept 2020", "title": "Practice Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Hazleton, PA) in Jan 2019", "Interview Descriptions": "Three interviews, relatively laid back interview process for the type of position. One interview was a phone interview and the other was in person. I felt it was a fair process and that they vetted their candidates, as they should.", "Interview Questions": "How would you measure your success in this role"}, {"date": "17 Jan 2019", "title": "Cna/Med Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2019", "Interview Descriptions": "The interview was very intense. She made sure I understood the job discription clearly and asked me a few relatable questions. I was given a tour of the floor I would be hired on too than had the opportunity to ask my questions at the end. Very clean and professional. Definitely respect woman in power.", "Interview Questions": "Describe a situation that was hard to manage and how did you get yourself out of it!"}, {"date": "16 Dec 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Bethlehem, PA) in Dec 2018", "Interview Descriptions": "Very comfortable environment, office management is easy to talk with. I was asked my strength and weakness during the interview. The interview lasted less the an hour. Heard back 4 days later", "Interview Questions": "Where do you see yourself in 5 years "}, {"date": "19 Nov 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Very relaxing environment. didn't feel nervous because interviewer was very kind and open. Be ready to talk about yourself and how you would handle difficult situations. Parking was easy to find but be ready to walk through parking lots to get to building. arrive early", "Interview Questions": "Why do you want to work act Lehigh Valley?"}, {"date": "20 Jun 2018", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network (New York, NY)", "Interview Descriptions": "I met with the manager who asked P.T. based questions. A second interview was with HR who asked more general team Work questions. The next interview was a peer or group interview.", "Interview Questions": "Tell me about yourself."}, {"date": "28 Mar 2019", "title": "Physician Scheduler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Dec 2017", "Interview Descriptions": "Wait in lobby for someone to come down and get you. Take elevator up to 3rd floor and meet with 3 people in a see thru room with all glass doors so everyone walking by can see you. Very intimidating, not warm and friendly at all.", "Interview Questions": "Tell us a specific time you went above and beyond for a patient?"}, {"date": "27 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Group Interview with 4-6 other nurses and 1 Nurse Manager & HR Nurse Recruiter. They just throw the same questions at all of you. Everyone listens to each others responses and it creates this environment of nervousness and competition among nurses interviewing to see who \"looks better\" in their eyes. I did not like this interview arrangement and style", "Interview Questions": "Why do you want to work at Lehigh?\r\nStreghts and Weaknesses\r\nSituational type questions"}, {"date": "20 Jul 2017", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jun 2017", "Interview Descriptions": "Applied and heard back the next day. Group interview went well they only asked us each three questions each. There was five of us. Then we got to choose what unit we would like to work on. The second interview was with that unit director. That interview was also laid back instantly made a connection with the interviewer. It was more of a conversation than an interview. Seems like an amazing place to word I'm excited to get started.", "Interview Questions": "Your most memorable patient? Name a time you had constructive criticism and how did you take it? Why this hospital?"}, {"date": "25 May 2017", "title": "Med/Surg Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Interview was easy and extremely laid back. I instantly made a connection with the supervisor. She was awesome. I can't wait to get started. Interview was an hour discussion which ended with a tour of the floor where I also got to meet a few of the nurses.", "Interview Questions": "Tel mw about yourself."}], [{"date": "9 Sept 2019", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Bethlehem, PA) in Apr 2017", "Interview Descriptions": "Interview process depends on the department you're working at. Lehigh Valley Physicians Group and Lehigh Valley Hospital might not interview in the exact same way. New applicants probably have to go through more than one interview. Applicants who already work at the hospital have a less rigorous interview process-- but keep in mind that your present manager can hang onto you for a month if he or she wants to, and any prior \"write ups\" might count against you, so if you're looking within the network itself keep it to yourself as much as possible.   \r\nMy last interview for a department within the hospital was 2017, and it was much less formal than the first one I had in the 2000s.", "Interview Questions": "Typical interview questions. Honestly I can't remember them. Their online website does have a \"personality test\" if I recall. "}, {"date": "17 Jan 2017", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA)", "Interview Descriptions": "The day is long with interviews with multiple people.  The pros are meeting with a benefits coordinator.  The cons are the interviews being spread out over the complex which puts the whole day behind right off the bat.  Most of the people did not actually ask questions, they talked about the hospital and the practice a lot.  It was very repetitive.  The day ran so long I almost missed my train I had scheduled for 3 hours after the day was supposed to end.  They really should consider some group interviews. Another con is the arrangement-the recruiter is unfriendly and after saying they would reimburse travel expenses and asking for receipts, they did not reimburse anything.", "Interview Questions": "Tell me about yourself.  Why do you want to move to Allentown?"}, {"date": "27 Apr 2018", "title": "Technical Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2017", "Interview Descriptions": "First interview with nurse interviewer about 2-3 questions like “tell us about a time when” and “why do you want to work in healthcare” and then they talk to you about open units. Then a interview with unit director, same type of questions and shows you around the unit. Simple interview process very laid back.", "Interview Questions": "Tell us about a time when a coworker did not have the same values/beliefs as you and how did you rectify the situation"}, {"date": "17 Feb 2017", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2017", "Interview Descriptions": "i went in for a group interview with 9 other people first. Then it was broken down into what your interests are and then they let you know what positions have opening to interview for. The recruiter is awesome and is great about getting you set up in your field of interest. Then i interviewed for the floor i wanted.", "Interview Questions": "How would you handle a conflict with other staff members? "}, {"date": "30 Nov 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network (New York, NY)", "Interview Descriptions": "Applied a month ago and on their website it said I was no longer being considered for the position, but they called me a few weeks later and scheduled appointment. I went in and there were 3 staff members, asked me normal straight forward questions, very friendly which made it easy to relax. Interview lasted 40 minutes.", "Interview Questions": "What is one thing that you liked the most about your previous job?"}, {"date": "14 Aug 2016", "title": "Professional Clinical Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Received interview invite by phone. Panel interview in front of 5 staff members.  Everyone was very nice, but I have a very a our taste in my mouth due to the lack of communication and/or indication that I was not selected.  Totally unacceptable.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "29 Aug 2016", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Aug 2016", "Interview Descriptions": "I was contacted by email and asked to pick from a variety of dates to come in for a group interview. The group interview itself was very casual and relaxed. We went into a conference room and were told about the hospital and the GN opportunity. Both people present spoke to their history at the hospital and then asked us to tell them about ourselves, what made us choose nursing as a profession, etc. After a few more questions we were given a list of positions available for GNs and asked to choose which we thought we'd like the most. Those who made it through the initial group interview then had a second interview set up on another date with the unit director of their choice unit. \r\n\r\nThat interview was also laid back, with behavioral questions and a description of the unit and how they run. The research project required of BSN GNs was discussed, as well as the orientation process. I was asked why I became a nurse, why I was interested in the unit I selected, and where I hoped to be in a year.", "Interview Questions": "Describe your hardest day as a student nurse."}, {"date": "19 Jan 2020", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Lehigh Valley Hospital and Health Network (Philadelphia, PA) in Apr 2016", "Interview Descriptions": "process was long and tedious may be worthwhile if you are interested in the position. required two meetings and a phone screening. met with various personnel in the health care field. took a while to hear back but again consider the value of the opportunity", "Interview Questions": "Can you tell me about your experience ? "}, {"date": "13 Jun 2016", "title": "Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Feb 2016", "Interview Descriptions": "they call you in for a face to face interview. then if you are accepted they will call you with an offer and if you accept they will schedule your physical. you must do the physical and pass the drug test or you will not be accepted. they will also send you your acceptance letter with other things you have to do like your fingerprinting and background check. my process went by very quickly within a month but I think that was because they were rushing to fill the position. I had my interview on 2/28 for start date of 3/14.", "Interview Questions": "How would handle a customer that has been waiting long for an appointment and has a complaint"}, {"date": "16 Mar 2017", "title": "PSNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network in Feb 2016", "Interview Descriptions": "2 step process, interview with recruiter then director of chosen unit. The one on one interview is where I believe you get the chance to shine, so come prepared with questions about the organization, and how you can expect to see professional growth for yourself and the organization", "Interview Questions": "Describe a time you were challenged or had to demonstrate leadership"}], [{"date": "4 Dec 2015", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Submitted my application on a Monday, heard back Friday about an interview. It was supposed to be a group interview, but I was the only one that signed up for the time slot so my experience was a little different than others may have been. Initial interview very laid back, relaxed. Second interview is required.", "Interview Questions": "Name a time that you had to advocate for a patient or yourself."}, {"date": "12 Sept 2015", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "It was a group interview with about 6 other candidates. Question was asked and we all took turns responding to them. Very laid back. Next you choose what floor you wanted to interview for and interviewed with the director of that unit and a couple other staff nurses. From there you toured the unit. I received responses day of for both interviews.", "Interview Questions": "Describe a difficult clinical experience"}, {"date": "26 Aug 2015", "title": "Technical Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Applied online, successfully completed \"Teamwork & Observation\" test at CareerLink, received a phone call from recruiter within a few days regarding my \"preferences\" for employment (hours, shift, location)... received a phone call a few days later for an interview. Scheduled interview and received job offer 2 days later. Entire process took 3 weeks.", "Interview Questions": "Describe an experience where you couldn't make a customer happy and how you resolved the situation?"}, {"date": "6 Oct 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Lehigh Valley Hospital and Health Network (Reading, PA) in Aug 2015", "Interview Descriptions": "1st interview was in the middle of August. Did not heard anything back till the middle of September to come in for a 2nd interview. The manager was very down to earth and made the process easier. Received offer in October and negotiated the pay rate and they were open to my negotiation. Accept offer.", "Interview Questions": "What is your minimum pay rate that you will accept for this position?"}, {"date": "1 Oct 2015", "title": "Human Service Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Lehigh Valley, PA) in Aug 2015", "Interview Descriptions": "Simple yet direct questions. Two people did the interview.  Had a second interview with department head.  Asked about prior work experience,  criminal history, etc...Interviewers made you feel comfortable.", "Interview Questions": "Give an example of a time you went out of your way at your job?"}, {"date": "30 Jul 2015", "title": "Speech Pathologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "After applying and attending a invite only event for potential job opportunities I followed up and was invited for interview.  Interview was with SLP and OT and was very relaxed.  Following the interview I followed up with an email and never heard back.  It took months to find out that I was no longer being considered for the position.", "Interview Questions": "Tell me about your experience with handling a patient or family member who did not agree with your recommendations."}, {"date": "25 Sept 2015", "title": "EMS Leasion Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jun 2015", "Interview Descriptions": "group interview  round robin questions regarding the position stayed on topic question where about my experience and how I could help the hospital maintain EMS relationships.\r\n\r\nThe job was to help encourage EMS to see the hospital as a resource for training.", "Interview Questions": "how would you get EMS groups to work with the hospital"}, {"date": "22 Jul 2015", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in May 2015", "Interview Descriptions": "I applied for a career at LVHN before I attended a nurse recruitment event. During the event, we were able to meet with several nurse managers and explore different units. At the end of the event, we completed a survey in which rated our top three interests (ie. ED, Burn Unit, Med Surg).  We were told that the HR department would reach out to us about interview offers within one week of the event. I was contacted within one week by an HR representative, who asked me a few more in-depth questions about my desire to work at LVHN and the units I mentioned in the survey. The HR representative was able to arrange an interview with the nurse manager on my first unit of choice. Depending on when you apply and the availability of Graduate Nurse positions on the unit determines whether or not you will receive your first choice. The interview process was very relaxed and I was able to shadow an nurse on the unit the day of my interview. I promptly received a job offer within 3 business days. The entire process was very organized and prompt, and the employees were very friendly and helpful.", "Interview Questions": "Why would you like to work for LVHN?\r\nWhere do you see yourself in 5-10 years?\r\nDo you have any questions about our unit?"}, {"date": "3 Feb 2017", "title": "Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in May 2015", "Interview Descriptions": "Average interview, this position was for an internship just for the summer so it was easier than other job interviews I have had. Basic interview questions that I have been asked before.", "Interview Questions": "What do you do in a difficult situation with a client?"}, {"date": "1 Feb 2016", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2015", "Interview Descriptions": "You have to apply online. From there its goes to HR and if you qualify in general your application is sent to the hiring manager. You receive a call to schedule an interview. Depending on the position you will have a second interview. If you are hired you receive a call informing how much they will pay and whether you choose to accept the offer. From there they send instructions on everything that has to be done before your first day via email. If you ever have questions you can always call the person who initially contacted you or your hiring manager. It was an easy process.", "Interview Questions": "Tell me about a time that you had to take care of an upset patient. What happened and how did you handle it?"}], [{"date": "28 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "New nurses go through a 2 interview process. First is a group interview followed by a one on one unit interview with nurse manager if you make it through the group interview.", "Interview Questions": "Not fond of group interview. Only hospital I know that does this"}, {"date": "6 Oct 2014", "title": "Administrative Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Lehigh Valley Hospital and Health Network in Sept 2014", "Interview Descriptions": "Interview was very good and informative. Showed me the area I was going to be working staff was very friendly. My interview was very comfortable and friendly I just knew I wanted to work for this hospital I had read reviews and talked with employee who worked at Lehigh Valley and knew this is were I wanted to work.", "Interview Questions": "Something about home life and how I would handle."}, {"date": "28 Aug 2014", "title": "Administrative Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Phone call to discuss interests. Ome week later call to come in that friday for interview. Interview was easy, very friendly. Met the staff on the unit. The monday after that friday call from hr with offer. Accepted offer tons of paperwork and background check.", "Interview Questions": "tell me about the teams you have been on"}, {"date": "5 Aug 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Lehigh Valley Hospital and Health Network", "Interview Descriptions": "Hiring and interview process can take awhile but can also be fast. Graduate nurses are hired at certain times of the year. Groups of new nurses are hired at a time so they can go through the orientation process all at once.", "Interview Questions": "What influenced you to become a nurse? "}, {"date": "1 Feb 2014", "title": "Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Bethlehem, PA)", "Interview Descriptions": "Submitted application online.  \r\nPhone call to come in for an interview.  Interviewed by head of department, as well as VP overseeing the department.  Lots of general interview questions about education, experience, internship.\r\nPhone call to come in for second interview.  Interviewed by head of department, as well as the new director of the department.  More specific interview questions about what type of people I expect to work with, as well as patient care and research questions.\r\nPhone call from HR with job offer.", "Interview Questions": "Nothing difficult or unexpected.  Just honest questions and honest answers."}, {"date": "29 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Sept 2013", "Interview Descriptions": "It was very thorough.  First met with HR RN, who asked many good questions. Example: Tell me about an experience with a patient that was difficult.  Tell me about an experience that exceeded your expectations.", "Interview Questions": "N/A"}, {"date": "9 May 2016", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Lehigh Valley Hospital and Health Network in Mar 2013", "Interview Descriptions": "One interview with several people. Seemed like a standard interview. Nothing out of the ordinary. The questions were standard and not challenging at all.  The manager was more interested in getting people onboard quickly.", "Interview Questions": "Why are you interested in this position"}, {"date": "25 May 2015", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Sept 2012", "Interview Descriptions": "Very laid back, one on one. Very brief conversation with HR with information about the job to make sure I was still interested. Met with a supervisor within the security department and talked about the job, previous experience, interests, and a few situational questions. Not very formal, met in the lobby on some couches. Overall pleasant.", "Interview Questions": "Tell me about your experience."}, {"date": "14 Nov 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jun 2012", "Interview Descriptions": "They ask you a series of questions which are required by Human Resources. Not too hard. Just be prepared and honest. Human resources moved pretty fast regarding checking clearances and references. They were helpful and communicated well. Overall the process was easy going. Started job within two weeks of interview.", "Interview Questions": "Explain some of you skills and attributes that would benefit the case management department."}, {"date": "11 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Apr 2012", "Interview Descriptions": "Had a group interview for new nurse graduates, there was about 6 in my group. The first group interview was more to get a feel for personality and compassion. At the end of that group everyone choose the position they wanted from the open available slots. An interview was then set up with the manager of the floor chosen. This interview was easy overall.", "Interview Questions": "Why did you choose to go into the profession of nursing? "}], [{"date": "4 Nov 2012", "title": "Per Diem RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Apr 2012", "Interview Descriptions": "Rigorous. Lots of steps to go through but also lots of help available to navigate it. \r\nIt starts with an on-line assessment which seemed to measure your degree of cultural competence and tolerance. If you pass this, your references are thoroughly checked and you then go on to an in-person interview. \r\nIf hired, you go on to get a physical in the network, finger printed&cleared, and lastly, meet with HR to explain benefits. That whole process took about 6 weeks start to finish.", "Interview Questions": "The actual interview was very pleasant and casual as it takes place by the hiring unit manager. The difficult part was the general hospital orientation followed by a general nursing orientation. It's long and, as a nurse, you are expected to take a generalized pharmacology exam even if you are not giving meds in your position. To be fair, you are offered resources to help you through it and are offered retakes should you fail. In my orientation class, many experienced nurses had to retake this test at least once...including me. I recognize the need for such an evaluation, but it might make more sense to have it be unit specific. "}, {"date": "7 Oct 2012", "title": "Technical Partner Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in May 2011", "Interview Descriptions": "3.5 months! LVHN hired an outside firm to complete background checks. Numerous times I had to send te same documents to both the background company and LVHN, very frustrating. Interview was a breeze. Some report it was not so comfortable. They require one to interview with a unit director. However, that director will not be your boss!  After you are trained they throw you on a different unit with a director and management staff that have no idea who you are...it's like interviewing all over again!", "Interview Questions": "I was not expecting to have an assessment test. The test was conducted at the PA Department of Labor and Industry (unemployment office).  It was video and PowerPoint. It was almost demeaning. "}, {"date": "10 Aug 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Lehigh Valley Hospital and Health Network in Nov 2010", "Interview Descriptions": "Interview with HR to determine interests, interview with Unit Manager from Floor of interest. Was offered job in critical care unit.  Trained on unit day shift for 6 months, went night shift towards the end of that time and for two weeks trained on nights.  Additionally had Critical care classes and certifications to obtain.  Started as a graduate nurse.  Hired directly into critical care without med surge experience.", "Interview Questions": "How do you deal with difficult patients"}, {"date": "4 Jun 2011", "title": "Technical Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jan 2009", "Interview Descriptions": "The staff are nice and their working environment is so good. Their technology was focused on Windows systems. Not too much design projects. The employees were asked to use the tech tools well.", "Interview Questions": "If there is no projects to do, what do you like to do in the workplace?"}, {"date": "3 Dec 2012", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Lehigh Valley Hospital and Health Network (Allentown, PA) in Jun 2008", "Interview Descriptions": "Hired from contractor to full-time position.  Multiple rounds of in person interviews with different management and team members.  HR Process is not very solid, but once you get past the HR department, it gets much better.  Management will often omit details about things like required oncall or bonus structure, so it is best to ask.", "Interview Questions": "How do you see yourself working in a healthcare environment?"}]]