[[{"date": "28 Jun 2023", "title": "PSA/Patient Safety Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "You will get a call from a recruiter first and then they will set you up for an interview via zoom and you will have 3 people in the zoom interviewing you asking you questions .", "Interview Questions": "When was there a time when you were doing something and it went wrong and what did you do ."}, {"date": "20 Jun 2023", "title": "Sr. Regulatory Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "My interview was short at just 30 minutes. The interviewer was nice and didn't throw me any odd questions. I received enough information and had my questions answered during that time.", "Interview Questions": "N/A"}, {"date": "9 Jun 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "It was a laid back teams interview with managers and team members. People were kind and lasted approximately one hour. No interview with HR or any other departments besides the hiring department.", "Interview Questions": "What made me interested in COH."}, {"date": "31 May 2023", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City of Hope (Huntington Beach, CA)", "Interview Descriptions": "Interview was good I had to go through what felt like 4 interviews before I was finally told I got the job. The process is very time consuming and you had to meet with several different people.", "Interview Questions": "Why would you make a good fit?"}, {"date": "9 May 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "The process I believe is basic, first, you speak to the recruiter then two more interviews with Manager and supervisor. It takes a long time to process at least 2 months.", "Interview Questions": "What experience do you have, and why do you want to work at COH. Do you know anyone that works at COH."}, {"date": "18 May 2023", "title": "LVN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope (Rialto, CA) in May 2023", "Interview Descriptions": "My interview process started with a call with the DON who briefly went over my resume. He then scheduled me for a panel interview with himself, department manager, and charge nurse. Approximately a week later I got a call to interview with the head surgeon of the department. I interviewed with him and then had a background screening with the nursing recruiter. I received an offer about a week later.", "Interview Questions": "“Why City of hope?” “Tell me about yourself” “Why do you think you’re a good fit for the job”"}, {"date": "8 Feb 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "The recruiter spent the whole phone screening time giving me \"advice\" on what I should have done in my nursing career. She also told me my previous places of employment were terrible and that she told the hiring manager how bad they are. Completely unprofessional and I feel ruined my chances with COH. Not that I would want to work here any way. If this is the first face you see when applying here, I wouldn't want to work here.", "Interview Questions": "A recruiter, who is admittedly not an RN, told me what I should have done in my nursing career. Completely unprofessional and out of line."}, {"date": "10 Jan 2023", "title": "QA Associate I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "All interviews were via video call. Interviewed with 4 people in the call and they were all easy to talk to. Did not get offered a job but seems like a good team.", "Interview Questions": "What do you look for in a work environment?"}, {"date": "16 Feb 2023", "title": "Senior Project Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City of Hope in Jan 2023", "Interview Descriptions": "Went through a total of four rounds of interviews. Recruiter screening, call with Direcor then panel interview, and lastly a take-home case study. Communication and interview process at times wasn't the best and it did take a while to finish all the interviews. Everyone on the team was nice but overall it was a tough interview process I guess depends on which department project analyst you apply for. They all can be different.", "Interview Questions": "Why do you want to work here?"}, {"date": "31 Oct 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "Phone interview followed by site visit. The site visit was composed of a tour portion and an interview portion with all team members for the department. All around a very smoothly ran and straightforward experience", "Interview Questions": "Past experience, alignment of goals"}], [{"date": "31 Oct 2022", "title": "Contact Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Very easy simple and quick. It was two people who interviewed. Basic questions about call center jobs and how you’d handle different scenarios. I did the interview and about a month later I received an email saying that I got the position.", "Interview Questions": "How do you work in stressful situations"}, {"date": "9 Sept 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City of Hope", "Interview Descriptions": "I participated in the online hiring event. I had a follow up call with the hiring manager. It is a big organization so they just want to know if  you have experience with certain tasks. Not really about culture fit or personality fit.", "Interview Questions": "How do you report SAEs? What EDC have you used? "}, {"date": "11 Sept 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "I had two interviews with City of Hope. Then I heard nothing back. I also saw the position relisted months later. \n\nSeveral years earlier, I was contacted by an external recruiter working for City of Hope and the recruiter was extremely unprofessional. I won't interview with this hospital again. I see a lot of red flags here.", "Interview Questions": "Why do you want this position?\nWhat do you know about City of Hope?"}, {"date": "12 Oct 2022", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope in Sept 2022", "Interview Descriptions": "Interview process is about one week. All of the questions are about your resume and projects. HR is friendly and answer your all questions. I learned the culture of city of hope", "Interview Questions": "brief your resume and projects"}, {"date": "10 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "Recruiter was very friendly and made me feel comfortable. Only lasted about 20-30 minutes. Looks like there are 2 interviews, one with a nursing recruiter and another with the hiring managers. Make sure to review about their mission statement.", "Interview Questions": "Why City of Hope?\nGive an example where you showed compassionate care? "}, {"date": "29 Jul 2022", "title": "Cytology Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope (Irvine, CA) in Jul 2022", "Interview Descriptions": "Phone call from same recruiter - he told me the salary range was just at what I am presently making.  Scheduled interview with hiring manager.  I called back to confirm salary, as I could not leave my present employment for less and move to Irvine.  Recruiter said we should put on hold as compensation will not go as high as salary range.", "Interview Questions": "Your resume shows you have many years of experience..."}, {"date": "14 Jun 2022", "title": "RN I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope", "Interview Descriptions": "I first had a telephone interview where I was asked behavioral questions that started with, \"tell me a time...\". Then the interviewer told me that if selected, I would move on to the second interview where I would be interviewed by a panel of unit managers to which I was selected and then was offered a position.", "Interview Questions": "Tell me of a time you were given constructive criticism and how did you handle that?"}, {"date": "9 Jun 2022", "title": "RAII Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Interviewed with the PI and staff scientist through Microsoft Teams. Good experience and informative . They were transparent about the position and asked good questions! There are many labs there so the experience may be different depending on which lab you interview with.", "Interview Questions": "Why do you want to work at City of Hope. "}, {"date": "25 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "recruiter contacts first and then if they find you're a fit will schedule you to meet with the  hiring manager.  All in all about 30 minutes for each process.  Manager will ask specific questions related to the job and why you're interested in the organization.  Do your research on the organization and mission and values.", "Interview Questions": "Tell me about your approach to patient care?"}, {"date": "19 May 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope (Los Angeles, CA)", "Interview Descriptions": "informational , have your resume ready to walk through. Explain why your experience will help the organization \r\nFriendly conversation with the recruiter\r\nGood conversation and learned about the role and the hospital.", "Interview Questions": "Why do you want to work here"}], [{"date": "8 Jul 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope in May 2022", "Interview Descriptions": "Recruiter emailed me to confirm interest, then scheduled a full day of 4 back-to-back interviews each ~45 minutes long. Was told during the interview that they really liked me and would hear back soon. \r\n\r\nOne day after the interviews, the hiring manager emailed me asking for references. I sent her my best 3 references.  \r\n\r\nExactly two weeks later, I received the generic rejection letter. \r\n\r\nPlease don't ask candidates for references unless you have a true interest in hiring the candidate.", "Interview Questions": "Do you have experience with Natural Language Processing?"}, {"date": "23 May 2022", "title": "Senior Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope in May 2022", "Interview Descriptions": "During my first interview with the VP I was told I wasn't qualified for the role (which was strange that she called me because my resume accurately reflects my experience).  However, she wanted to consider my for another role and had the interview process expedited.  The next day I met with the Manager of the role I was interviewing for and the day after, a panel with three attendees.  As you can imagine, this took significant preparation for the company to just ghost after numerous follow-ups.  I was very disappointed.", "Interview Questions": "How I manage filling challenging roles?"}, {"date": "15 Jun 2022", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope (Duarte, CA) in May 2022", "Interview Descriptions": "It started with an online interview with the PI.\r\nThen they call me for an in-person meeting with the PI and the team I would be working with.\r\nIt was all very good, professional but welcoming.", "Interview Questions": "What was my life plan (5 years in the future)\r\nWhat do I want for my career?\r\nWhy City of Hope?\r\nWhy do I think I could fulfill the position?"}, {"date": "26 Mar 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope", "Interview Descriptions": "Described research interests and what skills I want to learn and what technical skills I had as well. There is a match process where you are matched to a mentor based on previous research experiences and whether the mentor would like to take you on as a research student.", "Interview Questions": "Why do you want to work in this lab?"}, {"date": "7 Jul 2022", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at City of Hope (Los Angeles, CA) in Mar 2022", "Interview Descriptions": "15-minute interview. Basically, questions that check your personality. Another question they ask is what you bring to the table from your experiences. Lastly, they ask what COH can do for you.", "Interview Questions": "Why did you choose to pursue your [specific major]?"}, {"date": "25 Jan 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at City of Hope", "Interview Descriptions": "I interviewed for a manager position and interaction with a director was absolutely the worst experience I’ve ever had in an interview.\r\n\r\nThe director line of questioning was aggressive and not appropriate given it implied EEO issues. I could not believe this person is in a director role given the negative attitude and unprofessional behavior on an interview.\r\n\r\nNeedless to say, I like many reviews on here, dodged a bullet for sure. Many yellow and red flags.\r\n\r\nHilarious “tell” when I asked about immediate challenges and recent successes; directors response was all negative and couldn’t point to a valuable success. Says it all about an org and a director that is just there to coast. Terrible experience.", "Interview Questions": "Tell me a little about yourself"}, {"date": "10 Jan 2022", "title": "Cls Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Was professional. Working with cancer patients. Great mission and cause. Selfless staff. Patient depend on us. Short staff like many places. Staff member go above and beyond the call of duty to ensure patient needs are met.", "Interview Questions": "Experience in the field was asked"}, {"date": "10 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope in Jan 2022", "Interview Descriptions": "Was a two part interview series, with last interview being a panel interview with 10+ people interviewing me. Wasn't too intimidating because everyone was really kind and made me feel comfortable", "Interview Questions": "Why do you want to work at City of Hope"}, {"date": "22 Dec 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "There we’re a couple interviews with different members of the team. Wasn’t hired in the end but everyone was professional and it was by video during epidemic. Everyone was very nice.", "Interview Questions": "Experience in working with certain situations and to give examples. Talking about resume and what we’re challenges. "}, {"date": "7 Dec 2021", "title": "Patient Safety Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "You meet with the manger of the staffing office. She asks you a couple question in regards to your work history and your knowledge about the healthcare system. This position is best for individuals who are lookin to get their foot in the door of healthcare.", "Interview Questions": "What do you know about City of Hope? "}], [{"date": "20 Jan 2022", "title": "Coordinator, Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope (Los Angeles, CA) in Dec 2021", "Interview Descriptions": "Initial phone interview with recruiter, followed by an interview with two department heads, followed by two panel interviews of 3-6 people each. \r\n\r\nThe process was all over the place. I got the vibe pretty quickly that the departments (HR & Development) were rapidly changing because of the constant cancellations and rescheduling. At some points there were certain key people who didn't even show up to the interview. Also my second interview ended up being with a person who started working at COH only a week prior. Luckily this person gave me a very good and transparent view of the department and its constant changes. I realized after all of the interviews that COH wasn't for me.", "Interview Questions": "How good are you at multitasking? Can you give examples? One lady in one of my interviews asked me this FOUR TIMES in one interview!!!! Rude!"}, {"date": "29 Jul 2022", "title": "Anatomic Pathology Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Irvine, CA) in Oct 2021", "Interview Descriptions": "Had an hour interview with Recruiter.  Position description noted Cytology or Histology experience.  I received call a few weeks later saying they only were looking for Histology experience - maybe change your position description?", "Interview Questions": "Years of experience.  Tell me about your management experience"}, {"date": "28 Sept 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City of Hope", "Interview Descriptions": "I was contacted by a recruiter via email on a Friday meeting to meet with the hiring manager and someone else that afternoon. I responded with some dates/times to meet with them (other than Friday afternoon). She ghosted me but then called me out of the blue a couple of days later to set up the hiring manager interview. I had the video call with the hiring manager who said that my salary may be out of their price range, but they will respond back to me in two business days and even if they are unable to meet it, I should keep connected. I did not hear from them--I followed up twice. The recruiting process is a joke, and I cannot take a company that works like this seriously.", "Interview Questions": "Why are you interested in this position?"}, {"date": "4 Sept 2021", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "ask questions, talk with PI. make a presentation for the group, have the lunch or dinner with the group, and then talk with each person from the group, talk with the HR and secretary.", "Interview Questions": "tell us about yourself and your research"}, {"date": "10 Aug 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Went great, got the job! Working for city of hope is a great place to start your career. They are supportive, pay well, and enable plenty of growth. Thankful for this opportunity and whatever comes next.", "Interview Questions": "Too many questions to list."}, {"date": "7 Aug 2021", "title": "Community Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Thoughtfully done.  Showed interest and engagement.  Thorough review of skills and experience.  Listened carefully to responses and asked appropriate follow up questions. Definitely a model for others to follow and to learn from.", "Interview Questions": "How was I a good fit for the position."}, {"date": "15 Jul 2021", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope (New York, NY)", "Interview Descriptions": "The human resource manager was late, rude and made inappropriate jokes. He did not provide any additional information about the job position and basically re-read the job posting which was vague.\n\nJob was underpaid for the job market and decided not to persue further.", "Interview Questions": "How many years do you have in Information Security?"}, {"date": "12 Jul 2021", "title": "RN New Grad Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "I had one phone interview with a recruiter, then a panel interview with nurse managers and current nurses on the floor that I applied to. All communication was swift and professional.", "Interview Questions": "Combination of background and situational questions"}, {"date": "30 Jun 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Very conversational and welcoming environment during virtual interview.  I was asked questions regarding my experience and why I would like to work on the specific unit that I applied for.", "Interview Questions": "How do you deal with death?"}, {"date": "5 Jun 2021", "title": "CRA I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Applied online, interviewed on the phone, and then onsite with the hiring manager. Quite a long process for an entry-level role. Interviewers did not seem interested in training new talent.", "Interview Questions": "What unique skills do you have?"}], [{"date": "22 May 2021", "title": "Director, Foundations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "I had two phone interviews (the first was an HR screen, and then one call with the hiring manager). They then brought me in for a half day in-person interview with 3 panels of potential peers and superiors.", "Interview Questions": "Why do you think you are qualified for this position?"}, {"date": "8 May 2021", "title": "LVN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (San Bernardino, CA)", "Interview Descriptions": "applied online, about two weeks later, had received an email to follow up for a phone interview to discuss resume and experience. Replied back to email and recruiter had called me to discuss it.", "Interview Questions": "what skills do i bring to the table as a nurse"}, {"date": "4 May 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "Initial phone screening with a recruiter for the organization that lasted about 15 minutes, then a one-one with direct manager that lasted about 30 minutes over Microsoft Teams, and then an interview panel with the department's leadership.", "Interview Questions": "What do you feel that you can contribute to the team?"}, {"date": "27 Apr 2021", "title": "Quality Assurance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Very straight forward. They ask about past experiences and how it will transition to the position. There was a good balance between experience/knowledge and personality questions. \nThere were 3 interview groups: \n1. Director of department\n2. Managers\n3. Associates from the team you would be working with. \n\nOverall, the interview process was a good experience. Usually you would get an interviewer that uses questions/scenarios to try and trick you.", "Interview Questions": "How do you feel about working in a position that is not related to your degree?"}, {"date": "12 Apr 2021", "title": "Patient Escort Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "2 interviews, both very easy. simple questions as to my experience and why i want to work there and what i will bring to the company.  they also wanted to make sure i was fine with the hours and my job role", "Interview Questions": "why do you want to work here"}, {"date": "30 Mar 2021", "title": "Research Associate I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "I was considered for two positions. One was in October of 2020. The hiring manager reached out to me directly and conducted a 30 minute panel interview. The connection was very bad on their end and I had to ask them to repeat some questions several times. They ghosted me afterwards so I did not get this position. The second time, I was contacted by a recruiter from talent acquisition who requested professional references for the hiring manager to review before conducting an interview. So I sent over my references. Then it was radio silence until three weeks later I received a generic rejection email.", "Interview Questions": "Tell me about yourself.\nWhat laboratory skills do you have.\nWhat classes did you take.\nTell me a time when you had to troubleshoot something.\nPlease provide 3-5 professional references."}, {"date": "26 Feb 2021", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Straightforward. Everyone was friendly and welcoming. Questions were more about getting to know me. Was able to meet the whole team and toured the campus a little bit. Was a very positive experience overall.", "Interview Questions": "Why are you interested in this field?"}, {"date": "16 Feb 2021", "title": "Member Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "It was a virtual interview  it was basic and common questions. It was not hard and it was very professional and it took aprox 15min and they mentioned they will call back within one week to let me know if they would hire or not.", "Interview Questions": "Tell me about yours self?"}, {"date": "8 Feb 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "2 part interview: first with recruiter over the phone \r\n2nd with nursing staff phone interviews \r\nRecruiter was very nice and warm, 10-15 min interview asking about typical personality questions, why’d you want to become a nurse", "Interview Questions": "Why did you want to make nursing your career? "}, {"date": "31 Mar 2021", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope (Irwindale, CA) in Feb 2021", "Interview Descriptions": "I applied on-line, and received an email reply a day or two later from one of the higher-ups in Talent Acquisition (recruiting) asking for my availability for an initial phone interview. I quickly replied back with my availability over the next few days, and into the following week.\r\n\r\nAfter a couple of days, I had not heard back, so I emailed again, reiterating my interest and again, providing my availability for a phone interview.\r\n\r\nNo reply to that, either.\r\n\r\nAt that point, I left it up them to contact me, and 2 months later, that same person still has not. That they were the ones asking me to interview with them in the first place, then disappearing, leaves me with a very poor impression of the organization and how it is run.", "Interview Questions": "no questions asked, except for my availability"}], [{"date": "24 Jan 2021", "title": "Senior Asset Equipment Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "HR emailed me and scheduled a time for phone interview\nwe scheduled at my suggested time\nshe was asking questions and taking notes. It was thorough and professional. I received the follow up emails with job description and condition", "Interview Questions": "current job\ndesired salary\nqualification regarding job that i was being interviewed for"}, {"date": "17 Jan 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "Asked behavioral questions and some professional questions, as well as some common questions such as when, can you start, your salary expectations, etc. Overall it was a very good  interview process", "Interview Questions": "The most challenging projects you have done "}, {"date": "6 Jan 2021", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "series of phone screens and final round (in-person, prior to covid) with matrix team which includes a tour of campus. found the offer process very unprofessional and contrary to the culture they espouse wrto prioritizing people over profits. good thing they took it out of their mktg materials..similar to others. i was given verbal offer and subsequently simply ghosted. how hard is it to be professional and respectful to others... my take away is their culture does not stand up to the facade", "Interview Questions": "what are examples of relevant projects"}, {"date": "4 Feb 2021", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA) in Dec 2020", "Interview Descriptions": "My first 2 interviews went well and were overwhelmingly positive. I actually was asked to complete 5 references after my 2nd interview (if that isn't a sign I would get the job I don't know what is). My last interview was with 2 pharmacists and it was quite the opposite of pleasant. Despite my eager, up-beat tone, my interviewers were both on their phones the entire time (let me also mention one of them was also late and coming in and out of the interview after being late). They would take turns asking me questions while being on their phones. They both did not crack one smile and spoke in VERY monotonous voices. In an effort to gain their attention, I tried speaking louder during one of the questions and they responded in a way that suggested I would not have good customer service skills. [Hello? It is not MY fault you're so busy on your phones during OUR interview. Excuse me for trying to speak up. I have outstanding customer service skills and several colleagues, who wasted their time writing my references, who can speak to those skills]. After our interview I sent thank you emails and even followed up regarding status updates weeks after. NOTHING. No one had the respect/decency to follow up with me after my SEVERAL interviews and 5 references... \r\n\r\nI'm glad I wasn't contacted, as I wouldn't want to work with people like this anyways.", "Interview Questions": "Give me an example of a time you went out of your way to help a patient with a problem?"}, {"date": "20 Apr 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Los Angeles, CA) in Nov 2020", "Interview Descriptions": "The recruiter was really slow at getting back to me but every interaction I had with her was great! She genuinely cared about getting the right fit for the team.", "Interview Questions": "Where do I see myself in 5 years?"}, {"date": "11 Nov 2020", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope in Nov 2020", "Interview Descriptions": "I applied online and almost a month later I got a call that was like an interview/phone screening. Then I got an interview and moved on to the next round. I am still awaiting the next round interview and hopefully all goes well!", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Oct 2020", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "The HR give a phone call for interview appointment, first interview with HR and second time with department. The whole process is very slow. You should focus on your department manager for more opportunity.", "Interview Questions": "Very basic info for first interview."}, {"date": "17 Sept 2020", "title": "Manufacturing Associate I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "Unlike other phone interviews, I was given a certain day without a specific time. I awaited the call that day and never received the call. I followed up and tried to arrange for another day with a specific time. I was only given a day without a time although I had made it clear that I was asking for a specific time. Again, I patiently awaited the call. I thought the interviewer had forgotten again given that the call came late in the afternoon . While she apologized, it came off as insincere. Never before had I encountered such unprofessionalism in an interview. When you go into an interview, you expect for the interviewer to follow the most fundamental of interview etiquette. It actually came off as if the interviewer believed that she was \"too good\" to compromise on a time ultimately giving me the impression that I would not want to work for someone who is uncooperative and presumptuous.", "Interview Questions": "The usual interview questions although the interview was brusque and the interviewer was condescending enough to bring the company's reputation into question. Does the company have standards and organize how their interviews are conducted? I ask this because most companies do and the unprofessionalism that I experienced here made it seem as if this company is the outlier.  How does this company ensure that fair hiring practices are followed?"}, {"date": "27 Aug 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "Principally they are just seeing if you fit the company culture. Be careful to avoid offering too many opinions. They want to know what pharma companies you've worked with and that you are comfortable reporting AE. using the CTCAE and abstracting data.", "Interview Questions": "Tell us how you would report this SAE? For example absolute neutropenia"}, {"date": "26 Aug 2020", "title": "Research Associate II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "I applied online recommended by their recruiter. I was interviewed by another research associate. There was a second round of interviews with the Principal Investigator.  The process took like 3 weeks.", "Interview Questions": "I was asked more about myself, how I was fit for the job, and why City of Hope. I was asked how I manage multiple tasks and my organization techniques. "}], [{"date": "4 Aug 2020", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "phone screening with recruiter, then a video interview with department director and manager. mostly was asked character questions than technical ones relating to the job. was friendly and professional. i am trying to meet 30 word min word count.", "Interview Questions": "generic interview questions about my character"}, {"date": "21 Sept 2020", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope (Duarte, CA) in Aug 2020", "Interview Descriptions": "Went through the initial phone screening with a recruiter. She explained that next steps would be to have an interview with at least a couple members of the team and could take at least a couple hours so the interview process here is pretty extensive. \r\n\r\nI was informed afterward that my interview went well but I did not make it past the first interview because the salary requirement I provided was a couple thousand above their range. My suggestion for future interviewees is to avoid giving a salary range and ask the recruiter for their range first.", "Interview Questions": "The recruiter went through each bullet point of the job description and asked if I had experience with that."}, {"date": "30 Sept 2020", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope in Jul 2020", "Interview Descriptions": "This position is for AccessHope(somehow related to CityofHope). HR contacted me after application online, then followed with phone screen and interview with manager and the team. HR is very responsive and helpful, but this position got cancelled eventually. Interview with team and manager is not very pleasant, they were late and seemed very impatient on the phone. There are discrepancies between what they are really looking for and  their job description. They are looking for a data scientist as well as a front end developer, but that was not mentioned in both screening and job description.", "Interview Questions": "- tell me a little bit about yourself\r\n- visualization experience"}, {"date": "18 May 2020", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at City of Hope", "Interview Descriptions": "Recruiter for CoH reached out to me on LinkedIn. Had a couple of phone screens, then actual interview with three different people, one that would be my supervisor. The next day I was extended a verbal offer, which I accepted. Then nothing... I reached out to the recruiter numerous times and she said the team was still deciding?? Umm so much for that verbal offer, glad I didn't tell my current employer anything. I was basically ghosted. Very unprofessional, I don't even want to think about how they treat their actual employees.", "Interview Questions": "Standard interview questions."}, {"date": "8 Jun 2020", "title": "Salesforce Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at City of Hope (Los Angeles, CA) in Apr 2020", "Interview Descriptions": "The interview process took place over the span of two weeks. First, there's a video screening to gauge your technical knowledge. Afterwards, should you move forward in the process, a phone interview is scheduled to talk a little bit more about your background such as the things you have done in your career relating to your job and a couple more technical questions.", "Interview Questions": "Name three differences between Salesforce Lightning and Salesforce Classic."}, {"date": "11 Oct 2020", "title": "Patient Safety Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at City of Hope (Duarte, CA) in Feb 2020", "Interview Descriptions": "They didn't contact me back or reply to my email about following up. I found out I was not selected after calling human resources multiple times. They did not bother to contact me or email me thorugh their site or any of my emails provided for them. It was really unprofessional. Maybe this job position is less important?", "Interview Questions": "What can you bring to this hospital?\r\nWhat are your strengths and weaknesses?\r\nShould a problem occur, what would you do to solve it?\r\nIf you don't know the anwer to the question, how would you find the answer?"}, {"date": "12 Feb 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope (Duarte, CA) in Jan 2020", "Interview Descriptions": "Applied online. Had a phone screen 2 weeks later. First on-site interview 1 week later. It was mainly 1-on-1 with the supervisors. Talked about research in detail. Asked for reference(s) 2 weeks later. Had another on-site interview 3 weeks later. It was a panel interview and more about work attitude, personality, and behavioral questions. Got an offer in 2 days.", "Interview Questions": "Talk about my research in detail. The study design, the methodology, the analyses, the findings, etc. You have to know what you have done very well. The second interview involved more behavioral questions."}, {"date": "19 Dec 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City of Hope (Duarte, CA) in Nov 2019", "Interview Descriptions": "Applied followed up with an invitation for video interview after a week.\r\n\r\nThe interview went as scheduled and was standard.\r\n\r\nNever heard back after a week, sent up a follow-up email but, silence since then.", "Interview Questions": "Describe one experience you had to take criticism?"}, {"date": "29 Oct 2019", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at City of Hope (Duarte, CA) in Oct 2019", "Interview Descriptions": "I started by interviewing with the director and pharmacy staff. The atmosphere was very casual and we spent the majority of the time speaking about the responsibilities of the position. We ended with a Q&A but generally I felt most of the \"standard interview questions\" were already done during the phone interview. For the on-site, they definitely focused on the fit and chemistry of the candidate.", "Interview Questions": "Why do you want to join City of Hope?"}, {"date": "26 Nov 2019", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at City of Hope in Oct 2019", "Interview Descriptions": "I was contacted by a recruiter. After applying for the role, we had a phone interview and it went well. I was told I'd be contacted to met with the hiring manager after they came back from vacation closer to the end of the month if they wanted to meet with me for the in-person interview. I followed up about 5 weeks later for an update and found out the position had a new recruiter assigned to help fill that role. The original recruiter reached out to me about a week later to let me know and also informed me the position had been filled.", "Interview Questions": "What's an example of a project you encountered difficult challenges with, but turned out successful in the end?"}], [{"date": "23 Sept 2019", "title": "RN III Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City of Hope (Duarte, CA) in Sept 2019", "Interview Descriptions": "The manager of the department with whom I met, was extremely friendly and professional. She explained everything that I had inquired about in full detail and even provided me with a tour of the facility.", "Interview Questions": "Why do you want to work here?"}, {"date": "2 Aug 2019", "title": "Senior Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at City of Hope", "Interview Descriptions": "Attention serious qualified candidates! This is coming from someone who has been to close to five different interviews for five different positions with COH! Do not waste your time here. COH is notorious for wasting people’s time and all of a sudden ghost on qualified candidates. Do yourselves a favor and read similar comments here and see how many other candidates have experienced the exact same behavior from COH hiring managers. When a COH recruiter admits that most  of their managers are in deed wasting people’s time you can tell this place is suffering from a serious organizational problem.\n\n\nTwo phone interviews for this particular position , after a month one in person ( after many calls and follow ups ) then they totally went ghost! This is the interview that the hiring manager asked me to download a free trial version of Tableau for him to finish the homework he sent me then he went completely ghost.\n\nDo not waste your talent and energy here!", "Interview Questions": "Some technical skills and soft skills questions \nHiring manager wanted me to download a free trial version of Tableau and do a homework he emailed me which is what I did to show him my Tableau skills then he said oh I had purposely included an error in the data set and I was expecting you to catch it, I didn’t finally understand whether he wanted to test my Tableau skills or catch data set errors"}, {"date": "17 Jun 2019", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "I received an email from one of the individuals in the lab about the position that I applied for. So far I did a phone interview and was asked a series of short answer questions. However, I will be going in for an in-person interview.", "Interview Questions": "What are your career goals? "}, {"date": "11 Jun 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope", "Interview Descriptions": "Phone Interview with the PI of the lab, then In person interview with each of the lab members, along with a lab tour. Overall a great experience and got to interact with a lot of cool people.", "Interview Questions": "Tell us about your future career/academic goals. "}, {"date": "4 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at City of Hope (Westminster, CA) in Jun 2019", "Interview Descriptions": "I applied online and got an email the next day to schedule a phone interview. I had a phone interview, very professional and nice. She didn’t make me feel uncomfortable at all. Afterwards, I was offered and in person interview. The in-person lasted around 30 mins with the unit manager, she was also very nice and welcoming. Offered the position around 1 week later.", "Interview Questions": "Describe a time you had a conflict with a coworker and how did you resolve it?"}, {"date": "10 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope (Duarte, CA) in Jun 2019", "Interview Descriptions": "There was an initial phone screen to get to know me as a candidate, and it was followed up by an in-person interview with three team members. The interview was very casual and comfortable, a very welcoming environment. After that interview I was informed that I would hear from HR about the next steps which involve on-boarding if an offer is made and accepted.", "Interview Questions": "What is your favorite part of being a clinical research coordinator?"}, {"date": "10 May 2019", "title": "Assistant Research Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "Phone screen, then on-site interview. My airfare was not reimbursed. The group members I met with were excellent. The faculty members whom I would work under were close-minded from the instant I arrived in the morning. I had all of the experience necessary, and came from a top lab with the resume to prove it, but the faculty were extraordinarily difficult to impress. I was repeatedly told that because I didn't have explicit experience with R, I would be difficult to train. I was also told that everyone already knows about my work and that it is not new. The number of times they mentioned how stressful grant writing was was very high - they seemed to feed off of that and find self-worth with how successful they were.\r\n\r\nIn reality, I think the people I interviewed with were bad eggs in a sea of probably great people, but my experience here was the worst I've ever had. Truthfully, I was not mad at the end. Rather than be upset about the $350 flight that was not reimbursed, I took solace in the fact that their specific scientific community is tiny, and I will absolutely cross paths with them again - likely to review one of their papers. I had 4 offers at other places so I was happy to leave City of Hope without an offer.", "Interview Questions": "One of the first things they asked me, in a serious tone, was \"why do you want this job? You could make a lot more money elsewhere.\" Also, \"it's extremely expensive to live in the LA area\" in a tone questioning why I would want to be there."}, {"date": "27 Jul 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at City of Hope (Duarte, CA) in Apr 2019", "Interview Descriptions": "I was contacted by HR who reviewed my resume on Linkedn.  HR conducted 30 minute phone interview.  After successful interviewed, forwarded to hiring senior director and VP.  Interviewed with both and went well.    Final interview was with consultant for the department who did not recommend me for the position.", "Interview Questions": "Asked to highlight current role and how the experience would benefit City of Hope."}, {"date": "2 Mar 2022", "title": "Summer Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope (Duarte, CA) in Apr 2019", "Interview Descriptions": "-Two interviews (one with the department you're applying for and the second one with HR)\r\n-Easy and asked generic questions \r\n-one on one interview \r\n-always ask questions at the end of the interview!", "Interview Questions": "Describe yourself \r\nwhy you want this internship \r\ncareer goals "}, {"date": "31 Jan 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope (Irwindale, CA) in Mar 2019", "Interview Descriptions": "Started at City of Hope as a Contractor via an agency initially.  I did a pretty stellar job and was later converted to a Full Time employee at the end of my contract date. Great company to work for!", "Interview Questions": "Why CoH?"}], [{"date": "13 Feb 2019", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at City of Hope", "Interview Descriptions": "I thought the interview went really well. I answered questions thoroughly and asked questions as well, one to which the hiring manager replied \"good question\". She was smiling and seemed as though she was interested in me and what I had to say. She also said compliments to the staffing agency to which she reported back to. I was also over-qualified for the position and although I thought it was a shoo-in, someone else got the job over me.", "Interview Questions": "Tell me about yourself?"}, {"date": "24 Apr 2019", "title": "Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at City of Hope (Duarte, CA) in Feb 2019", "Interview Descriptions": "Applied for multiple RAI positions and had a few initial interviews (most over the phone). Follow up interviews usually included a tour of the lab and an introduction to the head of lab/PI/other lab members and an overview of the research being done.", "Interview Questions": "What are your long term goals? "}, {"date": "26 Jan 2019", "title": "CRA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "two hours long. met with lots of people there in the department. Everyone was so kind and friendly. Interviews were very conversational and easy. All made me feel very comfortable, nothing was too stressful or nervous.", "Interview Questions": "why here?"}, {"date": "26 Feb 2019", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope (Duarte, CA) in Jan 2019", "Interview Descriptions": "Easy Phone screen followed by an in person interview.  I was interviewed by two associates who had a few questions prepared, HM arrived 15 min later, missing most of my opening summary. The HM only asked me one question almost designed to elicit a somewhat negative response. They said they would get back in two weeks, heard back a month and a half later. Generally unprofessional interview.", "Interview Questions": "What aspects dont you like about this position?"}, {"date": "5 Feb 2019", "title": "Gift Administrative Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at City of Hope (Irvine, CA) in Dec 2018", "Interview Descriptions": "Brief but wanted to make sure you are ok with micromanaging.  I go the job after the interview, received two weeks of training, dared to ask the manager a question and was let go", "Interview Questions": "What is your management style"}, {"date": "23 Oct 2018", "title": "DPS Clinical Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "First had a phone interview with the manager. Then had two web interviews with two separate doctors since I was not in the area that week. Everyone was very sweet but were a little disorganized.", "Interview Questions": "Basic Questions: tell me about yourself, strengths/weaknesses, tell me about a difficult situation and how you handled it, etc. "}, {"date": "23 Oct 2018", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope", "Interview Descriptions": "Basic behavior questions and not related to specifics about the job duties.   More concern about availability and hours.  Given a tour of the workplace after the interview.", "Interview Questions": "Available to work weekends and Holidays?"}, {"date": "26 Nov 2018", "title": "IT Security Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope in Sept 2018", "Interview Descriptions": "Phone interview, standard phone screen and with background experience questions. They wanted to schedule an in person interview for the coming week but ended up getting a rejection letter a few weeks later. They said they had chosen another candidate with more experience", "Interview Questions": "Tell us about your experience"}, {"date": "13 Mar 2019", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope in Jul 2018", "Interview Descriptions": "Very unprofessional recruiter and recruiting process -- I was totally ghosted by this company! Their recruiter was very smooth, very friendly and in constant contact during the interviewing process UNTIL waiting to hear for a decision, when he just disappeared!  All along, through 5 rounds of interviews, they led me to believe that I was \"the\" candidate.  As this was a senior position, you pretty much have to talk to everyone and their mother.  I spoke with the recruiter right after the last round of in-person interviews, when he called me to find out how it went.  He was super chummy and indicated that I would hear \"by Friday\" (same week as the interviews) and said something in the lines of me being their number one candidate and of how I checked \"all the boxes for what they were looking for\" -- Friday and the next three Fridays came and went and I never heard back from him or from anyone at City of Hope. Not even an email!  First time in my career that I have been ghosted! To satisfy my curiosity and to see what the recruiter would say, I called and he was \"what? I didn't call you? 'Are you sure I didn't call you?\" (YES! he did say so!) \"I thought I did!!\" blah, blah, blah.  I think he honestly was embarrassed that after all the song and dance of how I had \"everything that they were looking for\" they went with an internal candidate, which I think that ALL along, that was their intent and saw nothing wrong with wasting my time just so that they could check a box on some compliance form.  Based on this experience, I would not recommend City of Hope as an employer, as if this is how they behaved during the interviewing process, when everyone is in their best behavior, I can just imagine how they will be once you are \"in.\"  Thankfully, I landed on a much better role somewhere else.  I have no hard feelings towards City of Hope's mission, I was recently approached by another group for a charitable contribution, which I did, as while I don't respect the group I dealt with, their mission is still laudable.", "Interview Questions": "\"Why do you want to work at City of Hope?\""}, {"date": "15 Jun 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at City of Hope", "Interview Descriptions": "Interview process for nurses is a 2 part process. Initial Interview with nursing recruiter then a follow up unit specific interview after resume review.  Have not had 2nd interview yet will update later.", "Interview Questions": "If you had a cancer patient your age, how would you deal with the topic of death?"}], [{"date": "29 Mar 2019", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at City of Hope (Duarte, CA) in Jun 2018", "Interview Descriptions": "After two weeks of applying online I recieved a message for phone interview. Soon after phone interview I was called for onsite where 8 to 10 people took an interview. Within 1 week I got offer.", "Interview Questions": "Questions were based on experience "}, {"date": "19 May 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "One interview, very short, asked about experience level with cancer trials. Asked about experience with consortium trials, asked regarding pharma trials, experience level in screening, entering data, current job responsibilities.", "Interview Questions": "How would you prepare for an audit"}, {"date": "5 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope (Duarte, CA) in May 2018", "Interview Descriptions": "relaxed interview. not get chance to talk with other people in the lab. walk through the campus and learn the environment and facility. overall, it is a good impression of this place.", "Interview Questions": "what is your career goal"}, {"date": "9 Jan 2022", "title": "Lead Surfical Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA) in Apr 2018", "Interview Descriptions": "Takes forever to get in. Once you have interview they set it up with manager of dept. Then once hired it’s a 2 month process for health clearance and back ground check and mandatory orientation.", "Interview Questions": "What would i do if in a conflict. "}, {"date": "10 Jan 2018", "title": "Regulatory Affairs Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "Applied online in August received a call for phone interview a month later. Then I didn't hear back for a month about a face to face interview. Interviewed in person November. The interviews were fairly basic and not very complex. The communication lag time with the recruiters is an issue.", "Interview Questions": "Why regulatory affairs?"}, {"date": "15 Oct 2017", "title": "ERP Systems Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "Panel interview, with aleast 3 person, focused mostly on behavior type of questions, your answers are used against you to probed deeper down into yourself.  They are pretty good at getting into your head.", "Interview Questions": "What are your weaknesses "}, {"date": "9 Sept 2017", "title": "QA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at City of Hope", "Interview Descriptions": "I applied through my university's career center. Several weeks later I received a call to schedule a phone interview. The interview seemed to go well. I was told that a decision would be made within a week, but I never heard back. No responses to emails or phone calls.", "Interview Questions": "Tell me about yourself."}, {"date": "23 Oct 2017", "title": "Scientific Writer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Los Angeles, CA) in Sept 2017", "Interview Descriptions": "I spent one hour talking to the manager of the scientific writers for a PhD level position at City of Hope. After that, I spend an entire day on campus with around 6-7 individual thirty minute interviews. It was all relatively standard and went fine as far as I could tell. After following up, I waited to hear back from them. After taking a day off work and an hour of my time with this company, I was not even granted a response telling me I had not gotten the job. I followed up with the manager and she did not even respond. Given that a few of the people I interviewed with seemed to imply a high degree of beauraracy in the organization, I most likely would not have accepted any offer. However, the fact that they did not even respond after I gave them much of my time signifies to me a high amount of unprofessionalism. I would not recommend anybody give this organization their time.", "Interview Questions": "Depended on who the interview was with but mostly surrounded on the way in which I  write grant proposals. Most everything related to the job."}, {"date": "23 Oct 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope (Los Angeles, CA) in Aug 2017", "Interview Descriptions": "I submitted my application and about a week later I was contacted for a phone interview. The phone interview went pretty well and I was asked for an in person interview on site. The interview consisted of 1 panel interview with current research associates and 1 with the physician I would be working with. Both were pleasant and friendly.  This is where things got frustrating though. The interviewer ended the interview by telling me I would know within the next week of his decision. One week goes by, nothing. I emailed him to check in and reaffirm my interest, still nothing. 3.5 weeks later and I got a generic email informing me I did not get the job. The rejection stung, but the complete lack of communication was really frustrating.", "Interview Questions": "What are you most proud of on this resume?"}, {"date": "26 Jul 2017", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope (Duarte, CA) in Jul 2017", "Interview Descriptions": "Got phone call about 4 days after the online application from the administrative manager; then through email, they scheduled an on-site interview for around 2 hours. Then a week after, followed up with a second interview. Total process: 4 weeks+, Be patient.", "Interview Questions": "One time you almost lost a customer, but how did you salvage the situation?"}], [{"date": "27 Sept 2019", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at City of Hope in May 2017", "Interview Descriptions": "Quick easy process. The interview wasn't hard. They asked standard questions. There was no tour of the campus. It was hard to find the portable for the interview and it was locked. So I had to ask someone for help finding it.", "Interview Questions": "They asked the usual CRC related questions with multiple interviewers in the room. It was not a 1:1 interview "}, {"date": "18 Apr 2017", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "Applied online through City of Hope Career. Got phone interview from the P.I. 4 week after the application. Will receive on-site interview information through e-mail after the phone interview. Take weeks to process.", "Interview Questions": "Tell me something about molecular biology."}, {"date": "27 Apr 2017", "title": "RN BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA) in Apr 2017", "Interview Descriptions": "I interviewed with the nurse recruiter, she was very nice and professional.  I have a second interview with the unit manager. I cannot say I have an offer until I get my second interview. I will update.", "Interview Questions": "How would you handle taking care of a cancer patient that is your age?"}, {"date": "24 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at City of Hope (Duarte, CA) in Apr 2017", "Interview Descriptions": "Attended job fair, was then called in for an interview with three manager RN's.  Did not interview with staff.  Standard interview questions. There was no surprises. The interview lasted about 15 minutes.", "Interview Questions": "Standard interview questions.  No surprises"}, {"date": "19 May 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA) in Apr 2017", "Interview Descriptions": "Applied for the  position online. Received a response within a couple of weeks with interview a week after. Had a nice chat with the PI and he showed me around the lab. We talked about my qualifications and my experience. Overall, the interview was not so much about what I knew but my overall work process. Was offered the job but was forced to accept the position within 3 days despite asking for more time to consider other opportunities.  HR cited budgetary reasons.", "Interview Questions": "What is your 5 year plan?"}, {"date": "7 Mar 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City of Hope", "Interview Descriptions": "The City of Hope interview process was enjoyable. It consisted of several conversations between myself and the principal investigator before deciding if there was a fit with my skills and research interests.", "Interview Questions": "Are you willing to relocate?"}, {"date": "30 Mar 2017", "title": "Research Associate II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at City of Hope (Duarte, CA) in Mar 2017", "Interview Descriptions": "The interview process I had with a lab at City of Hope was pretty straightforward - one phone interview with HR, followed by an on-site interview with the PI and a few other researchers in his department.\r\n\r\nAlthough the interviews went as expected, I was very disappointed in the communication process afterwards.  The PI called me a week and a half after my on-site interview to tell me that he had spoken to all (all!) of my references, and that he really liked me as a candidate.  Although he did not give me a verbal offer over the phone, he told me HR would get in touch with me to go over the benefits offered with the job.  HR called me the next day, and after describing the benefits the representative said that they had not decided on a salary for the position yet, and that they would get back to me as soon as they figured that out.  A week later, HR emailed me to let me know that another candidate was hired instead.  I was surprised, and I felt like I had been led on.  I don't think HR should have discussed the benefits with me nor told me they were working on a salary if they were not sure I was the candidate they would offer the job to.  I also thought it was strange and a little unprofessional of the PI to follow up with me and make it seem as though he wanted to offer me the job.  I think the whole process should've been handled differently by both the PI and HR; I would've rather they refrained from contacting me until the very end when they told me I did not receive the job.", "Interview Questions": "Why do you want to work at a research institute like City of Hope instead of a job in industry?"}, {"date": "30 Apr 2017", "title": "Management Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Los Angeles, CA) in Mar 2017", "Interview Descriptions": "The first interview was great.  I truly enjoyed my conversation with the recruiter, she was professional and showcased the company well.  If the next steps of the interview are like the first one, this will be a great place to work because you can feel the culture of care.", "Interview Questions": "Tell me about your professional career for the last 7 years?"}, {"date": "7 Mar 2017", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at City of Hope (Duarte, CA) in Mar 2017", "Interview Descriptions": "The supervisor is a nice person and very accomodating. He introduced me to the lab personnels and the instruments used in the laboratory. He also gave me an overview of what they are expecting from me.", "Interview Questions": "Tell me something about your experience"}, {"date": "22 Dec 2016", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "There were tests I took to ensure I was able to handle the position then there was a phone interview with an executive member and finally a 1:1 interview. You have to know what you are doing because from the very start as a professional you jump right in. I'm fortunate to learn from the top leaders of the organization. They are really in the action of it all. You will never find any one of their execs behind a desk. They are on campus, in meetings and improving the hospital every day. I would be careful about the Directors some are real (will make sure you feel secured and happy to work for them by treating you and the others equally) and at least 1 director I encountered was fake (made others work harder and gave them promotions whenever they went the extra mile to do his dirty work)", "Interview Questions": "What do you look for in a company?"}], [{"date": "24 Nov 2016", "title": "Medical Records Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City of Hope (Lancaster, CA)", "Interview Descriptions": "Thorough, lengthy, unreturned calls back, problematic, hard log in for online application, multiple back and forth calls, misleading, not user friendly online application, overwhelming background experience with the company that CoH uses. telephone interview first then followed by face to face interview.", "Interview Questions": "Do not remember, standard questions 'what would you do in this situation' 'tell me about your most recent employer' 'why do you want to work here' 'how you overcame a situation' 'what is your best and worst trait' 'tell me about yourself' most were situational questions and what I would do to fix or how I would react. 'what duties you had at most recent employer'"}, {"date": "30 Sept 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City of Hope (Duarte, CA) in Nov 2016", "Interview Descriptions": "I contacted the Lab I was interested to wok in, scheduled a Skype interview with the Lab director. Everything went vey smooth also due to the director o the Lab who was vey friendly and professional.", "Interview Questions": "Why are you interested in working in my Lab?"}, {"date": "5 Apr 2017", "title": "Vice President Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at City of Hope (Duarte, CA) in Aug 2016", "Interview Descriptions": "From beginning to end the process was informative, organized and effortless.  They gave you all the information you needed up front for easy transition on the day of interviews.  Team you interviewed with from the group panel to the CEO, were briefed, ready and very prepared.  Respectful, honest and very open to any questions or concerns you had.", "Interview Questions": "Tell me something you learned through a recent difficulty at your current job."}, {"date": "18 Jan 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at City of Hope (Duarte, CA) in Apr 2016", "Interview Descriptions": "Informal, not many questions asked. I only spoke with the boss that was hiring for maybe 5 minutes or less. He had me speak with my would be supervisors. They asked a few technical questions.", "Interview Questions": "Regards specific biology related questions"}, {"date": "19 Apr 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Irwindale, CA) in Apr 2016", "Interview Descriptions": "Well organized throughout entire process.  Had phone interview and prior to in person interview, HR provided a detailed interview agenda and directions to arrive at the facility.  The only downfall was it took about 2 months to get extended a job offer.", "Interview Questions": "What is your greatest strength, What is your greatest weakness, How did you handle a difficult situation... etc"}, {"date": "5 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "No interview for primary round of process. The Academy directors screen for potential interns by reading only your written application that you submit online, based on grades, short essays, teacher recommendations, etc. You are notified if you pass to the second round - the interviews. Interviews are conducted directly with lab directors that you're interested in working for, vary individually in scope/depth/difficulty.", "Interview Questions": "Why the Academy?"}, {"date": "4 Feb 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at City of Hope (Baldwin Park, CA) in Jan 2016", "Interview Descriptions": "I was first screened by the recruiter via phone, then another phone screen by the hiring manager.  A week later I was brought in for one- on- one interviews with three leaders in the department.", "Interview Questions": "There were no difficult questions.  The interview was more of a conversation to access my knowledge and cultural fit.  "}, {"date": "26 Feb 2019", "title": "Medical Biller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at City of Hope (Duarte, CA) in Oct 2015", "Interview Descriptions": "Easy going, main questions, what their looking for and your experience, hours, location, productivity managed care and government. Knowledge  in billing workers comp policies and and HIPPA law, Readjng contracts, stopploss knowledge, high cost drugs knowledge, what do you need to bill and coding information", "Interview Questions": "Year of experience "}, {"date": "17 May 2016", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City of Hope in Sept 2015", "Interview Descriptions": "Overall interviewed with 7 different individuals. Started with a preliminary HR interview, an in person group panel interview, a phone interview and interview with senior management. Pretty intense interview process to meet with so many different individuals. \r\n\r\nHR tends to be slow and had to do a lot of follow up which made me skeptical about the position.", "Interview Questions": "Tell me about a process you help to implement."}, {"date": "7 Jan 2016", "title": "Research Associate I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City of Hope in Aug 2015", "Interview Descriptions": "Met with around eight different people who were a part of the lab. They all asked me what my goals were, where I see myself in five years, and what my educational background was.", "Interview Questions": "What is PCR?"}], [{"date": "29 Jul 2015", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "First was interviewed by phone and informally in person by the hiring manager. Then, went on site for multiple interviews with managers, managers from other departments and potential colleagues.", "Interview Questions": "How would you do this job?"}, {"date": "1 Sept 2015", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at City of Hope (Duarte, CA) in Jul 2015", "Interview Descriptions": "Applied online for Operating Room RN. I was told a few years back that when I had my BSN to reapply and that O.R. RN's will always be in need. I interviewed with the Management team along with a few staff. Typical O.R. type questions, (what procedures have you been involved in, do you scrub, dealing with surgeons, stress, etc..).", "Interview Questions": "Type of surgeries involved with, do you scrub? ASC vs. surgery inpatient setting. "}, {"date": "22 Jun 2015", "title": "Clerical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "I went to work at City of Hope as a temporary employee. After a few months there, I was asked if I was interested in the position. I said yes, and then the process to hire me began.", "Interview Questions": "What are your goals and plans"}, {"date": "26 Jun 2015", "title": "Director, Content Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope (Duarte, CA) in May 2015", "Interview Descriptions": "Algorithms are used to match candidates' resumés to job descriptions using keywords; Two phone screen interviews occurred, one with HR recruiter and the other directly with hiring manager; Process took 21 days time; This job has since been cancelled and is now reissued as a newspaper journalist-type position without a marketing focus.", "Interview Questions": "Nothing of a personal nature was asked; The main question was, \"How would you re-purpose the City of Hope Breakthroughs Blog to reach other audiences?\""}, {"date": "15 Apr 2015", "title": "Developmental Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City of Hope (Riverdale, CA) in Apr 2015", "Interview Descriptions": "I had to meet 2 different times for the position as well as take an analysis test of Microsoft Office. My first interview was scheduled with the hour Microsoft Office test. I then had a 1 on 1 interview. I was asked back about a week later to meet with 2 other people in the same division. This interview was approximately 45 minutes. Both interviews the individuals explained the position, what the office culture was like and what is required of the individual who takes the position. Moving forward, I was asked questions specific to the job description, such as, how good am I with managing multiple deadlines in a fast pace environment, do I have good organizational skills, and what am I looking to achieve in this position. I was also asked about my 5 year goal(s).", "Interview Questions": "How do you deal with dissimilar and at some times, difficult personalities?"}, {"date": "15 Feb 2015", "title": "Registered Nurse, BSN (New Grad) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at City of Hope (Los Angeles, CA) in Feb 2015", "Interview Descriptions": "The phone interview went through the basic interview questions that one would expect of a phone screen. It lasted 50 minutes. Upon successful completion, I moved onto the panel interview. The panel interview included the Unit Supervisor, and 3 clinical educators. They asked additional interview questions to see if i would be a good fit for the company. It was a relaxed environment.", "Interview Questions": "Describe a time when you had constructive criticism.\r\nWhere do you see yourself in 5-10 years?\r\nHow do you handle conflict?\r\nWhy should we pick you over the other candidates?\r\nTell me about yourself?\r\nWhy do you want to work here specifically?\r\nWhat bothers you or makes you upset?\r\nTell me a time when you helped someone in need?\r\nDo you have experience with patient death?"}, {"date": "9 Feb 2017", "title": "Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at City of Hope (Duarte, CA) in Feb 2015", "Interview Descriptions": "Applied through college and waited 3 months for an interview. Several lab members including  PI, research professor, and lab technicians have interviewed me. A brief tour of the lab and the facilities was good.", "Interview Questions": "What are your good and bad traits?"}, {"date": "3 Jan 2016", "title": "Helpdesk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at City of Hope (Duarte, CA) in Feb 2015", "Interview Descriptions": "Phone interview very basic. I got to the interview process after being referred by recruiter. This was a contract role so maybe not as in depth as a full time permanent position. I did a primary screen with recruiter and then a hiring manager. The interview was straight forward and standard.", "Interview Questions": "What ticketing systems do you have experience with."}, {"date": "13 Aug 2014", "title": "Administrative Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "1. Applied\r\n2. Phone interview - came within a week of applying\r\n3. In-person interview 2-3 weeks after phone interview - I talked with the interviewer for about 30 minutes and he just asked questions regarding my resume\r\n4. Interview lasted 1.5 hours - 30 minutes each with 3 people", "Interview Questions": "Nothing really unexpected; they usually ask about your experiences you have written on your resume\r\n\r\nIn regards to my work experience, one thing they asked was about a difficult situation and how I was able to overcome it"}, {"date": "31 Jul 2014", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "Paid Flight to the Campus, visiting the lab, talking with lab mambers and giving a talk, the ususal. Very organized and professional. Hotel was very nice. A lot of opportunities for talks.", "Interview Questions": "Not much of unexpected questions."}], [{"date": "17 Jul 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope", "Interview Descriptions": "The hiring process was fast. I applied online, received a phone call a few days later. I interviewed the following week and received and offer later that day! I guess I was lucky or they were really in need of someone. I interviewed with the director, assistant director, and few staff members. After I interview, I took a computer test to test by computer skills.", "Interview Questions": "None, they were pretty standard. Asked about my experience at previous positions and how that would benefit them."}, {"date": "17 Jun 2014", "title": "Regulatory Affairs Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at City of Hope", "Interview Descriptions": "Email communication followed by face-to-face interview. Very quick response from managers. Heard back from them in a week's time and the hiring process was also very quick. In total it took 2 weeks to start the internship", "Interview Questions": "Nothing out of the ordinary. They asked what is the reason for applying to City of Hope and why Regulatory Affairs"}, {"date": "5 Mar 2014", "title": "CRA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at City of Hope", "Interview Descriptions": "Not formal, spoke with about 5 different people over about 4 hours", "Interview Questions": "N/A"}, {"date": "22 Apr 2015", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at City of Hope (Monrovia, CA) in Mar 2014", "Interview Descriptions": "Initial phone call (30 minutes), phone interview (about 60 minutes), interview in person (with 6 recruiters in three sessions with 2 recruiters in each session, hiring manager, team members, boss' boss), lunch with 'to be boss'", "Interview Questions": "How would I live the company values and examples of situations supporting it; not much about how my experience from different industry would apply to health care, so I was proactive about that and I think it was a good idea."}, {"date": "5 May 2014", "title": "Medical Assistant/Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at City of Hope (Pasadena, CA) in Mar 2014", "Interview Descriptions": "Applied through Agency, it was very fast and interwieved the next day, pay is good, may start at $13, straight out of school for some.", "Interview Questions": "What is one of your weakness at work?"}, {"date": "20 Feb 2014", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at City of Hope", "Interview Descriptions": "Look online to find opportunities then a phone call from HR is the next step prior to coming in for a 1:1 interview and testing. If all goes well then an other interview is set up with people you may or may not be reporting to. Very confusing to the prospective employee.", "Interview Questions": "What was the job you liked least and why?"}, {"date": "10 Dec 2013", "title": "Fundraising Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at City of Hope", "Interview Descriptions": "Applied online and two weeks later had initial interview", "Interview Questions": "Everything was fairly standard. Be ready to relate why your experience will make you a good fit for the fundraising division of the company. "}, {"date": "19 Dec 2013", "title": "Desktop Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at City of Hope (Irwindale, CA) in Nov 2013", "Interview Descriptions": "The hiring is done through Insight Global as the recruiter. They like to test your skills first. The interview process is detailed, but please ask your questions to address any concerns.", "Interview Questions": "Usually the technical questions about your duties and the technology supported."}, {"date": "29 Oct 2013", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at City of Hope", "Interview Descriptions": "Very thorough process with a number of interviews with behavioral based interview guides.  Met with a number of different hiring managers in the process.  It was a long process.  I was surprised I was offered the job!", "Interview Questions": "What do you know about the organization.  Why do you want to work here.Lots of generic questions actually."}, {"date": "26 Aug 2013", "title": "Research Associate I Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at City of Hope", "Interview Descriptions": "I was asked to come in for an interview and during the process met with head of the lab and the post-doc I would have worked for.  They asked questions about my research background and skills.", "Interview Questions": "What is an example of a way you used knowledge and experience to solve a problem."}], [{"date": "13 Nov 2014", "title": "Philanthropy Position Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at City of Hope (Los Angeles, CA) in Apr 2013", "Interview Descriptions": "I was recruited for a position - begged to be part of senior management! The process was misleading - I should have realized something was suspicious when I didn't meet anyone in the department I would be working with upon joining the organization.", "Interview Questions": "There weren't any - I should have been leery at that point!"}, {"date": "27 Feb 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at City of Hope", "Interview Descriptions": "Making contact with the right individual with in the organization is going to be key to getting that interview.  The HR filters that review resumes are not going to pass along the qualified candidates.  You need to review contacts via linked in to find the right individual to submit your resume.", "Interview Questions": "Explain how your experience in the past directly relates to the position we are looking to fill?"}, {"date": "11 Oct 2014", "title": "Data Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at City of Hope (Duarte, CA) in Jan 2013", "Interview Descriptions": "Applied online, then got email from recruiter. Had to go in 3 times for interviews with different people (one doctor and two IT directors). Then one phone interview with C level executive.", "Interview Questions": "They seem to always ask if you know hl7. "}, {"date": "11 Dec 2012", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at City of Hope (Duarte, CA)", "Interview Descriptions": "I was contacted regarding a position via the phone. I had two interviews total with the manager (phone) and the director (in-person). The environment was very friendly and both interviews were more like back and forth conversations than a grilling interview.", "Interview Questions": "I was asked several gotcha questions in the form of \"wrong\" statements to see if I was paying attention. I politely corrected my interviewers and they were happy to see I 1) knew the answer and 2) spoke up."}, {"date": "20 Jul 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at City of Hope (Duarte, CA) in Dec 2012", "Interview Descriptions": "The Associate VP wanted me to be interviewed, vetted and hired prior to the end of the year, so once I was introduced, interviewed and background was checked the entire process length was 2-1/2 weeks.", "Interview Questions": "Why this job?  Where do you see yourself in five years?  Is that a firm salary amount that you're requesting?"}, {"date": "19 Jun 2015", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at City of Hope (Duarte, CA) in Nov 2012", "Interview Descriptions": "Went into interview knowing the hospital's mission. I was asked a lot about medical and work ethics. Lasted about 20 minutes. The director was nice. I didn't feel intimidated and there were no complicated questions.", "Interview Questions": "What would you do to solve a coworker confrontation?"}, {"date": "25 Apr 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at City of Hope (Duarte, CA) in Sept 2012", "Interview Descriptions": "The hiring and interview process is lengthy.  Once you apply do not expect a response anytime soon.  It took me over 3 months from interview to hire date.  The background took almost 2 months to complete.  The HR staff are very helpful and very responsive once the process has begun, it is worth the wait and the hospital is a great place to be.", "Interview Questions": "N/A"}, {"date": "14 Feb 2014", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at City of Hope (Duarte, CA) in Oct 2011", "Interview Descriptions": "Hiring and interview process are standard faire will a day long interview consisting of 8 people , with an initial phone interview. The interviews take 30min to 1 hour each. The hiring process consists of background check as well as a health screening.", "Interview Questions": "None really."}, {"date": "14 Oct 2015", "title": "CRA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City of Hope (Duarte, CA) in Sept 2011", "Interview Descriptions": "Applied on the company website. Received a phone call after 1 week. Scheduled an interview with the administrator. Had a written test for medical terminology and case review. Then, interviewed by a couple of PI's. The PI's just asked me about my previous experience.", "Interview Questions": "Where will you be in 5 years from now"}, {"date": "6 Feb 2013", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City of Hope (Duarte, CA) in Feb 2011", "Interview Descriptions": "need to interview with more than 5 professors. It will take more than a hour. Professor will ask about your personal interests and previous research experience. Finally, they will give you some time to ask them about their research.", "Interview Questions": "Most questions are predictable. Just be well prepared about your research experience and try to demonstrate strong interest in biology, especially something about medicine, therapy, cancer or diseases. "}], [{"date": "23 Jul 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at City of Hope (Duarte, CA) in Oct 2010", "Interview Descriptions": "Applied on Biocareers Sunday night and got a phone call from the PI early Monday morning. She said that she will hire me right after the interview. A little bit of technical questions regarding my previous work but she already did her homework reading my papers. Overall, easy interview.", "Interview Questions": "N/A"}, {"date": "20 May 2010", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at City of Hope (Duarte, CA) in Apr 2010", "Interview Descriptions": "everything from your initial communications with the company, organization and planning of the interview, number and type of interviews, and any advice you might offer to other interview candidates. Bonus points for your perceptions of the people, office, and work culture.", "Interview Questions": "Do you think you would experience culture shock?"}, {"date": "3 Mar 2010", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at City of Hope (Duarte, CA) in Jan 2010", "Interview Descriptions": "Contacted a person directly involved in the company instead of going through human resources, which made the process of interviewing and getting an offer more efficient. Love the environment and the philosophy behind their work", "Interview Questions": "What did you do in your last research position?"}, {"date": "7 Nov 2009", "title": "Clinical Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at City of Hope (Duarte, CA) in Nov 2007", "Interview Descriptions": "Panel interview with 4 clinical trials administratrors, 3 scientific research staff in research specific to position, and medical terminology test. Offer for interview was received by email. Follow up was expedient, likely due to the eagerness to fill position. Clinical trial administrators asked very general questions about skills and familiarity in clinical trials in oncology as a whole industry. Scientific researchers gave more insight in what would be entailed in the position on a daily and long term goals of the research project.", "Interview Questions": "Tell us about any challenges you had regarding getting along with others in the workplace?"}]]