[[{"date": "31 May 2023", "title": "Associate Human Rights Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNHCR (Geneva)", "Interview Descriptions": "There were 3 rounds: the first 1st round multiple choice exam on human rights statistics and background in the field; 2nd round was a open ended written exam on two different human rights topics; 3rd round was a competency-based interview with a panel.", "Interview Questions": "Describe a time where you managed multiple tasks at one time ? How did you do it ?"}, {"date": "6 Feb 2023", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNHCR", "Interview Descriptions": "Rendez-vous fixé en ligne. Il y a eu plusieurs interviewers. L'entretien a commencé presque 20 minutes après l'heure convenue. Il y a eu des problèmes de connexion et entretien précipité. Ambiance pas agréable au final.", "Interview Questions": "Pourquoi voulez-vous accéder à ce poste?"}, {"date": "29 May 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Geneva) in Sept 2022", "Interview Descriptions": "It was conversational. They were interested in hearing about past experiences. They were also looking to see about my goals and how those fit into the job description. Lastly, they cared to know about my skills and how they could be used to enhance the work for the position.", "Interview Questions": "Tell me about your past experiences."}, {"date": "24 May 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Geneva) in Feb 2022", "Interview Descriptions": "Friendly interview panel although candidate was picked before hand.....just making up the numbers. Five questions in total and interview lasted about 45 minutes.....no test beforehand which was strange....but each panel member was professional and welcoming", "Interview Questions": "How would you present something that's not in your area to an audience"}, {"date": "26 Apr 2023", "title": "Youth Engagement Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNHCR (Geneva) in Dec 2021", "Interview Descriptions": "HR reached out with a Microsoft Teams link for an interview, I accepted, interview took place with line manager to be and second person in the team, very friendly environment and positive feedback.", "Interview Questions": "Why do you want this role? What experience would you bring to the role?"}, {"date": "29 Dec 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at UNHCR (Geneva) in Nov 2021", "Interview Descriptions": "It was a panel of 3 members with diverse backgrounds with competency based interview. I answered them based on what was necessary for the project proposed  for work. I convinced them of my experiences to deal with similar situations.", "Interview Questions": "What are your 3 strengths and 3 weaknesses."}, {"date": "20 Dec 2021", "title": "Associate Public Health Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Geneva) in Sept 2021", "Interview Descriptions": "First did a written test for 1 hour   from the national Human resource  manager and after 2 weeks I was scheduled for an oral interview  by the staff from Geneva  Switzerland but I have not yet got any feedback from them.", "Interview Questions": "Questions on WASH, CORONAVIRUS 19, Cholera vaccination "}, {"date": "5 May 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNHCR (Geneva) in May 2021", "Interview Descriptions": "The interview was for a Livelihoods and Economic Inclusion Intern in Geneva. It lasted only 15 minutes, it was very short. I didn't even had a chance to talk about my previous experiences. It was conducted by 2 females, are Livelihoods Officers with many years of experience. The interviewers did not put on cameras, they did not ask me to put on my camera neither.", "Interview Questions": "Tell us about yourself and about your motivation for this internship.\r\nExpand upon your motivation to work for UNHCR, to work for refugees. How would you explain what UNHCR does with respect to Livelihoods and Economic Inclusion to a friend?\r\nWhat would your supervisor tell us about you? What are your strengths?\r\nWhat are your weaknesses?\r\nIt involved shortlisting candidates for recruitment. What is your experience in that area? What is your experience with managing multiple priorities?"}, {"date": "4 Oct 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNHCR (Geneva) in Mar 2021", "Interview Descriptions": "I had online interview. Very casual. There were two interviewers and they were based in different locations. They took turn to ask me questions and  did not ask any difficult questions. Everything about my motivation, my experience with the area they are hiring etc.", "Interview Questions": "Very casual and nothing special. They asked why do you apply, any experience in the program, how you deal with difficult situation etc."}, {"date": "24 Jan 2023", "title": "Senior Finance Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNHCR (Geneva) in Feb 2021", "Interview Descriptions": "The process takes very long time in average of eight months ...it includes test with no competency based interview .just to be listed as candidate for future temporary jobs after you succeed ..you never hear back from them ..this is very disappointing . It is an experiment that you hesitate to do it again . Applying for regular jobs is more difficult and you will never be short listed to take a test and interview phases . They make you feel incompetent .", "Interview Questions": "Direct Finance technical questions like forecast and budget."}], [{"date": "28 Apr 2022", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNHCR (Geneva) in Jun 2020", "Interview Descriptions": "Prepare for your Competency based Interview process (structured, behavioral or situational interviews) with an outlook to the specific skills required by the position .  Be ready with a lot of examples from your past professional experience.", "Interview Questions": "Can you offer an example form your career when you have to deal with a conflict in a team in order to ensure the success of the project? How did you manage it? How did it end? "}, {"date": "12 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNHCR (Geneva) in Nov 2018", "Interview Descriptions": "Web interview. Interviews are carried out by 3 panelists who will be related to your work inside the organisation. Commonly one of them is an intern, but not always. the process is generally very relaxed and the interviewers are not trying to put you in a difficult position", "Interview Questions": "Interview questions relate to the position. Read carefully the terms of reference because questions will focus on the skill needed for executing the tasks described there. they will also ask about previous experiences in similar circumstances."}, {"date": "19 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UNHCR (Geneva) in Aug 2015", "Interview Descriptions": "Very standard interview, some competency based interviews and some knowledge based interview. The application consisted of a CV and cover letter followed by an interview. Following the interview, I was informed within a couple of days that I had been successful.", "Interview Questions": "What are the biggest issues relating to refugee protection today? "}, {"date": "14 Oct 2014", "title": "Responsable Communication Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UNHCR (Geneva) in Sept 2014", "Interview Descriptions": "C’était une position contractuelle de moins de six mois. J’ai envoyé ma candidature le dernier jour, j’ai été sélectionné, puis appelé la semaine d’après et j’ai passé un entretien avec deux personnes. Elles étaient très professionnelles, très organisées et posaient de très bonnes questions. J’ai eu l’impression que je m’entendais bien avec les deux personnes conduisant l’entretien et leurs besoins étaient clairs. Finalement, une autre personne a été choisie avec une expérience directe au sein de l’UNHCR, ce qui est bien, car c’était un rôle contractuel intensif et court qui exigeait un démarrage rapide avec de l’expérience dans ce domaine.", "Interview Questions": "D’un point de vue de travail de subsistance, expliquez les plus grands défis du travail avec des réfugiés. "}]]