[[{"date": "15 Jan 2023", "title": "Program Associate II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Health Institute", "Interview Descriptions": "2 rounds -First round lasted about 30 min with a panel of 3 interviewers. They provided additional information about the program and then asked a series of questions with 5 minutes at the end for additional discussion -Second round was task oriented", "Interview Questions": "Q: Tell us about yourself. Q: Describe a situation when you have been responsible for undertaking several tasks at once. How did you manage? Q: Describe some project management tools that you have used previously. Q: With the recent events like the death of George Floyd, how do you plan to uphold and support a work environment focused on equity and mutual understanding?"}, {"date": "14 Nov 2022", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Health Institute", "Interview Descriptions": "I went through three rounds of interviews. Two were standard interviews with individuals in the department. Discussing my experience and qualifications. The last one was a writing skill assessment. The writing assessment was clearly going to be used for an event they had coming up. I think that they should have compensated individuals for that work.", "Interview Questions": "How do you prioritize your work?"}, {"date": "3 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Health Institute", "Interview Descriptions": "PHI forwarded my CV on to the contracted agency - (USAID) and the panelists were kind, PHI got back to me days later offering me the position. Background check with USG took some time to get approved.", "Interview Questions": "How have you incorporated DEIA into your previous positions? What do you look for in a manager/supervisor?"}, {"date": "10 Oct 2022", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Public Health Institute in Aug 2022", "Interview Descriptions": "The first step was an initial phone screen with director level staff that the role reported into and then a subsequent virtual panel interview with 3 total management and director level panelists. The overall process was positive. The communication was kind and clear throughout the process even though it took longer than it expected to get the final word (which is pretty typical).", "Interview Questions": "Q: How my experience related Q: How this position fit into my goals"}, {"date": "15 Jul 2022", "title": "Systems Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Public Health Institute", "Interview Descriptions": "Into interview - phone. Online panel interview. In person interview. Ultimately met with at least 30 people. Saw the office. Met the team I would be working with. Is this really not enough words?", "Interview Questions": "Describe your leadership style in 5 words"}, {"date": "26 Jan 2022", "title": "PM I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Public Health Institute", "Interview Descriptions": "Interviews/hiring it solely on the program itself i.e. program management and PI/PD, depending on how new the program is - it feels like start up culture. The program determines the amount of interviews/process.", "Interview Questions": "Storytelling about my experience in my past career and how I handled situations"}, {"date": "7 Oct 2021", "title": "Visual Communications & Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Public Health Institute", "Interview Descriptions": "3 Rounds of Interviews: phone screener; behavioral questions via panel; writing test; interview with team Director. It was a bit overkill of a process imo; overprepare is my best advice", "Interview Questions": "\"Tell me about a time\" questions related to teamwork, learning from mistakes, etc."}, {"date": "7 Feb 2021", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Public Health Institute", "Interview Descriptions": "They called to schedule my interview via Zoom. I interviewed with a panel and lasted over an hour, had time to ask questions about the role and get to know some of the team. Overall good experience.", "Interview Questions": "Mix of technical and leadership"}, {"date": "25 Jan 2021", "title": "Covid-19 Contact Tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Public Health Institute", "Interview Descriptions": "Quick, easy 30 minute interview. Questions were straightforward and was offered job right at the end of the interview.  Interviewer seemed a bit distracted, but overall the interview went smoothly.", "Interview Questions": "Describe an experience where you had to put yourself in someone else's shoes "}, {"date": "21 Jan 2021", "title": "Covid-19 Contact Tracer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Health Institute (Los Angeles, CA) in Dec 2020", "Interview Descriptions": "Simple easy virtual, about 20 min interview. Went over a lot of resume and experience. Also explained job role emphasis on hours.  This was pleasant but you need good internet and zoom.", "Interview Questions": "Are you able to work weekends? It’s required to work one. "}], [{"date": "10 Jul 2019", "title": "Senior Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Public Health Institute", "Interview Descriptions": "Application is completed online with a screening interview and panel interview with director and direct supervisor.  After the interview, sadly I did not get the position, but what really left a bad taste in my mouth was the duration and lack of a personalized notice. \r\n\r\n Close to three weeks after an interview, I received a stock email from the recruitment team.  Since I made it to the final interview stage, it rubbed me the wrong way.  In other positions, I've received emails from supervisors or at least the employee that reached out initially trying to fake gratitude for patience through the process.  Makes one wonder how much they value your time/effort.", "Interview Questions": "What do you know about {Program name's} Communications strategy?"}, {"date": "11 Jul 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Public Health Institute in Jun 2019", "Interview Descriptions": "1st interview by phone with supervisor to evaluate whether skillset fit the needs of the role. Supervisor spoke about the types of projects the Research Associate would be working on.", "Interview Questions": "Describe a research project that you've completed before"}, {"date": "30 Aug 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Public Health Institute", "Interview Descriptions": "I was called in to meet with the program director/principle investigator of the project I was applying to work for. They were very kind to me and called me back for a second interview with the rest of the team. I didn't end up getting that job, but they knew of another position opening up and said they'd recommend me. Sure enough, I ended up with the other job. Overall, it took them a while to get back to me and the whole process (between the two jobs I applied for) took about 2-3 months.", "Interview Questions": "Name 3 adjectives to describe yourself. "}, {"date": "25 Oct 2017", "title": "Program Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Public Health Institute (Oakland, CA)", "Interview Descriptions": "I had an in-person interview for this position. After sending a thank you email to the Director, I received a positive note back saying they enjoyed speaking with me and would be in touch soon about the process. Three weeks later, I check my online profile with PHI and see the position has been filled. I did not even receive a courtesy note to explain this. What an unprofessional hiring process. I think it says a lot about how I would have been treated as an employee. I will not be applying with this organization in the future and do not recommend to others.", "Interview Questions": "I was asked to explain my experience with program administration, budgets and evaluation."}, {"date": "3 Jan 2017", "title": "Research Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Public Health Institute (New York, NY)", "Interview Descriptions": "There was no formal interview for the position. The position was offered as a result of a strategic decision to integrate an external organization into the organization. All discussions between both organizations took place at a senior leadership level. The job was offered upon conclusion of those discussions.", "Interview Questions": "N/A"}, {"date": "20 Oct 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Public Health Institute (Oakland, CA) in Dec 2015", "Interview Descriptions": "one phone call interview and one on site interview and an Excel performance test. I had a phone call reached out by Senior Financial Analyst to schedule an on-site interview, after the onsite interview I had a Excel formula test, then a phone interview with the Director of Finance.", "Interview Questions": "What do I like to do in my spare time?"}, {"date": "12 Mar 2016", "title": "Global Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Public Health Institute (Washington, DC) in Feb 2015", "Interview Descriptions": "First you are interviewed by Oakland-based staff at GHFP, then a follow-up interview is conducted by the internship on-site managers. The first interview was conducted over phone and the second was a skype panel interview with three USAID employees.", "Interview Questions": "What is your interest in working for USAID"}, {"date": "16 May 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Public Health Institute (Oakland, CA) in Nov 2014", "Interview Descriptions": "Interviewed with three people. They asked the general questions you get asked during an interview, e.g. why do you want to work here, what are your skills and experience, etc.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Aug 2014", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Health Institute in Jul 2014", "Interview Descriptions": "When I was interviewed, there was a panel of three people that worked at the branch I was at in Sacramento.  That was the first time I had a panel of interviewers, but they were very nice and welcoming and didn't make me feel pressured at all when I was answering their questions.  They did expect me to answer questions specifically about telehealth, even though the application stated that you didn't need to have specific experience in telehealth.  I answered to the best of my ability and drew from past internships and experiences and education, and apparently that was good enough because I got the position! Make sure to have solid references that will give you a good recommendation, as well, because they contacted all three of mine.", "Interview Questions": "They asked me specific scenarios about how I would research different areas and fields of healthcare, specifically telehealth and telemedicine"}, {"date": "9 Apr 2014", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Public Health Institute (Sacramento, CA)", "Interview Descriptions": "It was a group interview with Operations Manager and Director and they asked me questions regarding my experience.", "Interview Questions": "Why do you want to work here?"}], [{"date": "1 Oct 2015", "title": "GHFP-II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Public Health Institute (Washington, DC) in Jan 2014", "Interview Descriptions": "I was contacted in the specified time-frame stated on website (eight weeks, I think). The interview process was conducted via telephone. I think there were four other candidates selected as finalists. The interview time-frame was 30 minutes. I would recommend being prepared with background information about the organization and the specific position you are applying for.", "Interview Questions": "Why do you want this position?"}, {"date": "30 Jul 2016", "title": "Bio Statistician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Public Health Institute (Emeryville, CA) in Aug 2012", "Interview Descriptions": "People were very nice and listened to what I had to say.   My experience in the field was extensive, so we had a lot to talk about in terms of substantive and technical issues.  It was probably the most enjoyable interview I ever had and I felt like part of a large, extended family.", "Interview Questions": "Is this position going to be satisfying for you?"}, {"date": "25 Dec 2014", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Public Health Institute (Oakland, CA) in Oct 2010", "Interview Descriptions": "I was called for a phone interview and then went it for a interview. The process was easy and transparent since I got called back when they said they would. I been with PHI for 4 years now", "Interview Questions": "What is your organizational skills like? "}]]