[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Inspirational company and great team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Mar 2022", "job_title": "Senior Project Manager in Munich, Bavaria", "duration": "N/A", "pros": "Approachable management, flexible working time, great team, fast growing company, very dynamic environment", "cons": "The company is growing fast with a high dynamic, this might not be for everyone"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Stay away", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Mar 2023", "job_title": "Project Manager in Berlin", "duration": "N/A", "pros": "The colleagues were very nice.", "cons": "This is the kind of company that will squeeze everything out of you during your 6 months trial only to kick you out after. They have no respect for people - a colleague had her contract terminated during pregancy, ouch. All contracts are on limited time only, with the lie that 'if all goes well, we'll continue the contract'. From hundreds of employees there's only a handful that passed that period, and those are in high management positions. They say they're open and want fresh ideas, yet nobody that speaks their mind or offers a solution that's not thought by a manager will have a long life in this company. People are kicked out in the manner of you see them today in the office doing great work, having good ideas and tomorrow you're told they're not with the company anymore."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Friendly Colleagues but chaotic environment", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 May 2023", "job_title": "Academic Recruiter in Hannover", "duration": "N/A", "pros": "- friendly and cooperative team members - flexible working hours - remote work in Germany and abroad", "cons": "- lots of fluctuation in the company - low salaries - every other day new visions for the company - excessive introduction of new and (innovative) tools that do not improve quality and efficiency of work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Better work-life balance promised and actually delivered", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Feb 2023", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "- My work-life balance is excellent now - I was promised this during my initial interview and I have to admit, IU delivered on this. As a result, I'm less stressed overall. - Ability to work from abroad. - I feel valued in my team and my workload is manageable. - My team is brilliant.", "cons": "Some teams do not have the same level of flexibility or manageable workload as my team has. There is a lot of stress in those teams (sales, course management, students office for example)."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible avoid !", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jan 2023", "job_title": "Marketing Operations Manager in Munich, Bavaria", "duration": "N/A", "pros": "Flexible working hours and remote.", "cons": "- toxic environment and toxic people (a lot of issues with colleagues mocking each other in their backs, comments about “other people being dumb”, pointing fingers for any issues most of the times on the wrong person instead of trying to find solutions, going to complain to management for things that shouldn’t be complained for (looking for someone to help outside of the team got me a complain to my manager from a colleague, because I tried too hard at my job to find someone WILLING TO HELP, because in this company they are not willing to help you, PEOPLE DO NOT HELP EACH OTHER). Non stop passive aggressivity, when it’s not clearly aggressive. Colleagues complaining all the time about the company and the fact that nothing works, first meetings being just a presentation of what terrible is happening in the company. People telling you to contact someone “but idk if he’s still here because you know the life expectancy in this department is pretty non existent”, that was told multiple times, and from my first week, because they fire or get tired of the toxic culture a lot. Clearly missing structure, a sane culture and a management that knows how to handle TERRIBLE FEEDBACKS. I left because management told me they can’t change culture, ok, but when everyone is toxic like this, do something instead of hoping to hire more toxic people fitting in. In the end they also fired my manager after only 2 months of being in the company, but the email to announce his dismissal was clearly not normal, as they mentioned publicly for the whole department to know that he was fired because “we didn’t like his work”, that’s confidential info! I reported all the above to HR and even more, and they will for sure do nothing."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "AVOID AT ALL COSTS", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jul 2021", "job_title": "Editor in Bad Reichenhall", "duration": "N/A", "pros": "-Flexible working hours\r\n-Opportunity to work from home", "cons": "-Management picks favorites and treats their friends different than the rest of the team, leading to different standards for different people\r\n-No accountability for management's mistreatment of employees and no internal structure to manage conflict\r\n-Unclear pay structure and low salary for Bavaria\r\n-Management failed to provide another team member any warning before her termination 5 months into her Probezeit, leaving her blindsided and in a very difficult situation with her apartment and finances\r\n-Editors are not valued or appreciated for the work that they do and are expected to tolerate verbal abuse from MV's (Modulverantwortlicher)\r\n-The company is focused more on growth than quality. Speed is valued over accuracy. As a result, the work is extremely high and you do not have enough time to finish everything without compromising quality."}], [], [], []]