[[{"date": "N/A", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "First, I had phone call with HR. Then, I met with the person who would be the manager of the role I was interviewing for. Then, I met with a couple other members of the group and the overall manager of the group and took a tour of the area of the hospital the position would work in. Finally, they told me their decision. They were all very nice.", "Interview Questions": "They asked me why I had applied for the position and also asked me to talk through a past project."}, {"date": "21 Jun 2023", "title": "Clinical Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "It was easy, had an interview with manager that lasted forty minutes and Human Resources that was about five minutes just to went over the Pat rate and benefits. They asked me to submit five references.", "Interview Questions": "Why do you wanna work here?"}, {"date": "8 Jun 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "First an individual from HR contacts you and schedules the 1st interview where she accesses soft skills overall. The 2nd interview consist of 30 mins with leaving CRC and the last 30 minutes with the project manager.", "Interview Questions": "An example of when you had to interact with an unpleasant customer and what did you do?"}, {"date": "7 Jun 2023", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Met with two managers then the research coordinator team. Very easy discussion and was given the chance to ask questions about the role, their experience and DFCI as a whole.", "Interview Questions": "Background, experience, who you are as a person, personal interests, outside of work activities"}, {"date": "26 Jun 2023", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Brockton, MA) in Jun 2023", "Interview Descriptions": "I had a disappointing experience with the application process for the Research Assistant, Bilingual in Spanish position. While I have always been enthusiastic about contributing to research and working with this company, my experience was negative. After submitting my application, it took approximately a month to receive a response for an interview, which I understood and remained excited about. However, during the interview at the Brockton, Massachusetts location, the interviewer displayed extreme rudeness, rushed through my responses, and asked an inappropriate question. Unfortunately, this led me to decide not to proceed with the interview. I acknowledge that this isolated incident does not reflect the company as a whole, as I still believe it is a great organization to work for. However, I believe it is important to share my experience to potentially benefit other applicants. Throughout my career, I have undergone numerous interviews and have never encountered anything negative or felt compelled to leave a negative review. However, in this particular case, I felt compelled to share my experience. I am uncertain whether I was a victim of discrimination, if the interviewer was having a difficult day, or what exactly led to this encounter. Regardless, I genuinely wish the company continued success and fervently hope that the research being conducted will make a positive impact.", "Interview Questions": "Why are you interested in working for this company?"}, {"date": "2 May 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The first interview consisted of meeting with supervisors, and they described the role. I was only asked basic questions and to give background on myself. Then, I had a phone call with HR where they went over the benefits packet, and asked me more logistical questions. The next interview involved 3 members of the team and they asked many experience based questions where I had to give examples. Then directly after that I met with two current CRCs and asked them questions about the role. The next day, I had a phone call with HR where they offered me the job. Overall, a very quick, low-stress interview process. The questions were very standard, and it definitely felt more conversation based with you being able to ask lots of questions about the role as well.", "Interview Questions": "Describe a time when you had to work with a difficult colleague."}, {"date": "1 May 2023", "title": "New Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "It was okay. Not very hard and not many questions to see what I was like as an employee more like me as a person instead. Didn’t seem professional at all", "Interview Questions": "What is one personal life experience I’ve faced"}, {"date": "11 Apr 2023", "title": "Marketing Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2023", "Interview Descriptions": "Had 2 rounds of interviews, one with HR and one with the hiring manager. The first one was pretty quick and the second was about an hour long. Pretty standard interview questions", "Interview Questions": "What do you like about marketing?"}, {"date": "26 Mar 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Had a quick phone interview which I thought went well. They never ended up getting back to me with any updates. They told me to email them if they do not get back to me, which I did. Still no response.", "Interview Questions": "Why are you applying to this position?"}, {"date": "17 Mar 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I was recruited and asked to interview with Dana Farber. It ended up being 4 interview rounds, going from intimate (hiring manager) to a larger group. The interviewers were friendly, but questions were difficult and due to 4 rounds got a little repetitive but was an overall positive experience", "Interview Questions": "Q: Methodology preferences Q: Experience with their specific softwares"}], [{"date": "29 Dec 2022", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "There were three rounds of interviews culminating in a team interview. The questions ranged from “tell me about yourself” to “imagine you are in xyz situation, how would you handle it?”", "Interview Questions": "Why are you interested in this job?"}, {"date": "13 Oct 2022", "title": "Lead Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Phone interview first and a 4 hour in-person interview. I asked about the salary range multiple times and kept receiving the same response of it depends on experience, etc. Then I was asked to submit references and I asked about the salary again. The next day, I received a template email from HR saying we have decided to move forward with other candidates. (Likely a low salary)", "Interview Questions": "I was asked about how my past work experiences would contribute to the role."}, {"date": "8 Oct 2022", "title": "Clinical Scheduling Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I was connected through a recruiter. It was a two round interview process and everyone was very nice! I was offered the job a few days after the second interview.", "Interview Questions": "How do you organize / multitask?"}, {"date": "10 Nov 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Oct 2022", "Interview Descriptions": "It was a great experience. I talked to great people during the interview process. Being able to join the zoom meeting was easy and not hard to do. The people respond fast when you apply to the interview and they are great people to interview with.", "Interview Questions": "Why do you want to work for us? What is your greatest strengths? What is your greatest weakness?"}, {"date": "2 Oct 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2022", "Interview Descriptions": "The interview process at Dana Farber was great. I found the interviewers to be very friendly, easy going, and conversational. The interview didn't last too long,  I got a follow up soon after,  and they communicated with me at every point. ", "Interview Questions": "Why do you want this job?"}, {"date": "31 Aug 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Dana-Farber Cancer Institute in Aug 2022", "Interview Descriptions": "The process took over 3 months. I had 5 zoom interviews with them, and they also checked my references. I’ve met with the manager, associate manager, 1 nurse, 2 CRCs and 1 physician. After all the interviews, I did not hear back from them. I reached out and there was no response. The staffs were nice during the interview process. The questions are not too difficult.", "Interview Questions": "What would you do if you cannot get in touch with someone in the department?"}, {"date": "28 Aug 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Aug 2022", "Interview Descriptions": "Pretty typical, nothing too difficult. Straight forward interview questions and all of the staff were friendly and eager to talk. Met with 2 current CRCs as well and the program manager.", "Interview Questions": "What makes you a good fit for this role?"}, {"date": "15 Jun 2022", "title": "CRC Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Great interview and kind people! We’re very understanding, friendly and helpful when navigating through the interviewing process. There was a phone screening and then an interview with multiple people where we talked about experience, what I’m looking for and what they need for the position", "Interview Questions": "What is my interest in research?"}, {"date": "23 Jun 2022", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2022", "Interview Descriptions": "The interview took about thirty minutes with the department manager. They asked basic questions and said they would contact me for further assessment. I got another call days later to come in again.", "Interview Questions": "Describe a situation where you stepped up as a leader."}, {"date": "9 May 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Meet with the Providers in your Department on a one to one basis. Also met with Manager and Nursing Director. Overall, fairly laid back experience but definitely interview to make sure that candidate is competent.", "Interview Questions": "Explain a situation you had with a coworker when there was a difference of opinion and how you handled "}], [{"date": "14 Jun 2022", "title": "Nursing Informatics Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in May 2022", "Interview Descriptions": "Video chat interview with the informatics director. She was very nice and told me about the position. Essentially she is looking to expand the nursing informatics team, since currently she is the only one. This position requires the candidate to travel to several different ambulatory sites and therefore requires the candidate have a car and driver's license. The informatics director is very nice and passionate about her work. Their sites use Epic EHR, and candidates are expected to have experience with Epic EHR use (particularly in ambulatory sites). The candidate will also be expected to participate in go-lives of new systems.\r\n\r\nI did not get an offer, but what was confusing was that I received an automatically generated rejection letter from HR while their careers website stated I was still under consideration. I tried to follow up to clarify what this meant, but HR was not clear in their response to me. It has been awhile since my interview and I have not heard anything since, so I am assuming that I did not receive an offer. If you are applying to this position, I recommend closely following up with HR.\r\n\r\nAlso, having an MA nursing license from the get-go is a requirement. I did not have one and although I am eligible to apply for one, I feel that negatively impacted my chances at this opportunity. Most informatics nurse positions only require applicants to be eligible for licensure in the organization's state (and apply for licensure after being hired) so please be aware of this requirement.", "Interview Questions": "Why did you choose to apply to Dana-Farber?"}, {"date": "23 Mar 2023", "title": "Clinical Scheduling Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in May 2022", "Interview Descriptions": "The interview process was very quick and easy. Within a week of doing the phone screen, I had an offer for the position. The interview itself was done with my former supervisor and a senior co-worker and it felt more like a conversation than an interview.", "Interview Questions": "Why are you a good fit for this role?"}, {"date": "21 Apr 2022", "title": "Stem Cell Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "The interviewers were very friendly and they got to know you on a personal level and not just a professional level. It was a group interview so it was a bit intimidating at first, but after getting to know them, the conversation just flow very easily.", "Interview Questions": "Why are you interested in this position?"}, {"date": "3 Jun 2022", "title": "preclinical invivo associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2022", "Interview Descriptions": "the interview process had 3 stages, one with the lab PI, one with the lab members, another interview with the PI, and lastly one with HR to go over offer", "Interview Questions": "what skills do you intend on bringing to the team?\nwhy do you want the job?\nany technical or coding skills "}, {"date": "15 Mar 2022", "title": "Assistant Director of Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I submitted an application online. Was contacted for a phone screen within two weeks of applying and then had a follow up call with the hiring manager. Was kept updated and knew exactly where I was in the process", "Interview Questions": "What was the largest gift you have solicited?"}, {"date": "11 Mar 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Very quick and personable. The questions were thorough, easy to prepare for and caring. While you have to speak to many people, it's a great way to get to know coworkers at various levels within the company. An offer was made very quickly after final interview.", "Interview Questions": "Tell us about a recent professionally challenging experience. "}, {"date": "8 Mar 2022", "title": "Research Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Applied mid December 2021. Hiring manager reached out to me the end of  December 2021 to schedule my first interview. January 2022 I had and interview with the Hiring manager, second round interview with Project managers, final interview with Hiring manager and director. I got offered the position the first week of February 2022. Overall the hiring process took a bout a month and a half from the initial submission of my application but was worth it overall!", "Interview Questions": "How do you stay organized? Tell me about yourself? Why do you want to work at Dana Farber"}, {"date": "29 Apr 2022", "title": "Research Assistant I—Population Sciences  Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2022", "Interview Descriptions": "I was really disappointed in my interview process at Dana Farber. It was for a research assistant I position in a small lab, so an entry level job for someone newly out of college or looking for experience. As someone who was newly out of college and really struggling to find jobs in the health world in Boston, the process really further discouraged me. At first it took about a month to receive any follow up from my application, which at that point I just assumed it had been a rejection since no reply seemed to be the norm for RA jobs here and at other hospitals I've applied to, so I was really excited to hear back at all. We scheduled for a short 15 minute informational call, which after I was feeling even more excited about the job, hearing more information about what exactly the lab was studying (the original positing didn't have much info about the specific studies and research -just general psycho social research on cancer outcomes and treatment experience). This phone call was with the current RA in the lab and went well, but she was also honest that  they had a lot of applications so I still wasn't expecting much (but felt the role would be perfect for me and thought the phone call went great). I followed up with a long email explaining more of my qualifications and interest and got a response about a week later that I would move onto the next round, this time a zoom interview with the current RA and the doctor in charge of the lab. Again, I thought the interview went great and was really excited, but still didn't get my hopes up too much as I knew there were a lot of applicants. The interview was nothing out of the ordinary with standard questions about my interest and experience and how I prioritize work, communication styles, etc. Both the doctor and RA were very nice and engaging and I was hopeful and excited after the interview. The RA told me that they would be in touch in a \"few weeks\" and that they would let me know definitely one way or another and lamented how she knew it was really frustrating being ghosted by employers, which was nice to hear. I sent another follow up email soon after to thank them for their time and recap the conversation etc. I quickly received a positive email back from the RA saying they enjoyed speaking to me, thanks for the note, and the would be in touch. About two days later I received an email from DF HR about references. This is where I feel the interview/hiring process became a little ridiculous and unfair to applicants. They asked me to provide 5 professional references for a \"short\" survey within 24 hours. This email was sent on a Friday afternoon... making 24 hours especially difficult. 5 references is a lot, I think 3 is usually standard and this is for an ENTRY level job straight out of college. I have not even had 5 bosses and didn't have 5 people at the drop of a hat to ask to fill out what DF referred to as a short survey. So, as I was really excited about this job, I was frantically emailing and texting old bosses, coworkers, and professors to ensure they would be willing to fill out this survey. Once I had 5 sure references, I put them into the system for them to receive the survey as an email. This took me about 36 hours (email originally said to please provide in 24 hours, but since the email was sent late afternoon on a Friday, I thought they might be more lenient about the 24 hour window, but I did receive a reminder email 24 hours stating that I had failed to provide the references and to please  do it ASAP). So after finding these 5 references and giving them all the instructions about what email they would receive and how to fill out the survey (which I had originally told them would be a SHORT survey because that is what the email told me - come to find out it was actually about a 25 question survey asking to rate me on a variety of topics and skills, with room for comments - which in my opinion is not what I would call a short survey and is not really the professional norm for what would be expected of references.) At this point, I'm frustrated, but also really excited because I thought if they needed my references this quickly, it meant I was most likely a final candidate and was really excitedly waiting for next steps. Well, I was wrong because after this DF ghosted me for a full month until I finally sent a follow up email to  restate my interest and ask if they were still in the hiring process or had concluded. I received a short email about 3 days later confirming they had hired someone. After I had scrambled to find references and had them fill out a long detailed survey, I was ghosted and rejected. Makes me embarrassed to reach out to references again for other jobs as it is clear I was rejected from this job and they already generously gave me their time on this long, detailed survey, putting me and them in an awkward position and making my further job search even more difficult.", "Interview Questions": "How do you delegate your time when facing multiple important tasks and projects? \nWhat is your interest and experience in this kind of work?\n"}, {"date": "25 Feb 2022", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Over the phone. Heard her typing the entire time it was very distracting and it was very cold interview ambiance. She wasnt very personable and also not communciative before or after", "Interview Questions": "Why this job? Why dana farber?"}, {"date": "21 Feb 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "It was very simple, describe your skills, get to know you kind of interview.  She described the work hours and how the process of the unit was.  It was maybe a 15-20 minute phone interview.", "Interview Questions": "Tell me your weaknesses, strengths, how do you administer chemo, what kind of patient population did you work with, what kind of cancers did you encounter, etc "}], [{"date": "17 Feb 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "The interview was around 45 minutes low. They asked about why I was interested in the internship and what I would like to do in the future. I asked questions at the end of the interview. The interview was more informal than I expected.", "Interview Questions": "Tell me more about yourself? "}, {"date": "10 Feb 2022", "title": "Regulatory Affairs Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Phone interview with the hiring manager. Manager asked behavioral interview questions to determine your experience. The entire process was an hour and the hiring manager was very professional. Overall positive experience.", "Interview Questions": "Tell me about a time someone disagree with our opinion even though your opinion was correct?"}, {"date": "28 Jan 2022", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Very casual and laid-back. Basically it was just a conversation with the supervisor. Didn't really ask your typical interview questions. Took about 15-30 minutes and I was offered the job on the spot.", "Interview Questions": "Why would you be a good fit for this position?"}, {"date": "2 Feb 2022", "title": "Clinical Scheduling Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Dana-Farber Cancer Institute (Somerville, MA) in Jan 2022", "Interview Descriptions": "a recruiter shared my resume with a supervisor at DFCI. she reached out to me to interview. straightforward interview questions & very nice employee! the day after the interview, she reached out to schedule the second round with the team i would be working with. they were wonderful to talk to and it was nice to hear some more insight regarding the position. that same day, they requested information from my references. they text or email a survey for your references to fill out and all their responses are compiled into one document that DFCI sees. my references submitted their information over the next 1-2 days and i received a job offer two days after submitting my references.", "Interview Questions": "How will you handle clients/cases that unexpectedly hit close to home?"}, {"date": "11 Apr 2023", "title": "Physician Assistant, PA-C Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2022", "Interview Descriptions": "The whole thing was very well put together. Benefits were well explained and the whole process was straightforward and organized . There were about 5 different interviews but everyone was so nice", "Interview Questions": "Why do you want to work at Dana Farber"}, {"date": "19 Dec 2021", "title": "Revenue Control Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Very straightforward but somewhat of a slow process. I applied for the job and didn't hear anything for several weeks. Phone interview was with a recruiter, then there is second interview to meet a few of the team members and the hiring manager.", "Interview Questions": "Lots of technical questions, background questions. "}, {"date": "17 Jan 2022", "title": "Research Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Dec 2021", "Interview Descriptions": "Overall the teams I could've been potentially working with seemed very driven, passionate, smart, and collaborative but the trouble came when I was finally told the salary which was very far along in the interview process. Way too low for what they require and I feel like it was a waste of time. They should be more transparent about it in the begininng", "Interview Questions": "why do you want to work at dana-Farber"}, {"date": "23 Dec 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 days. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Dec 2021", "Interview Descriptions": "had 2 interviews. straight forward questionnaires. met with the manager then with the whole team crcs. they all very nice. the whole process was within a week. hr reached out with an offer", "Interview Questions": "what is your long term goal?"}, {"date": "19 Nov 2021", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Interview process from start to finish was highly communicative, well thought out, and well organized.  Interviewees were punctual and asked great questions.  It was evident they were engaged in the conversation and cared about DFCI’s mission and culture.", "Interview Questions": "Why would you be a good fit here?"}, {"date": "17 Mar 2022", "title": "Practice Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2021", "Interview Descriptions": "Straight forward in terms of curiosity in terms of cultural fit, salary expectations, and previous work experiences. Also the interviewer was curious about how far I was willing to commute and other responsibilities not on the job description", "Interview Questions": "What are your salary expectations?"}], [{"date": "5 Aug 2021", "title": "Research Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Round 1 is screening with a member in the team\n1 week later you hear back if you've made it to round 2\nRound 2 is with an RA and senior team manager\nRound 3 is with the PI\n\n\nShould take about 3 weeks", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "17 Nov 2021", "title": "Clinical Scheduling Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Aug 2021", "Interview Descriptions": "I heard back from Dana Farber about two months after I applied. I first met with a recruitment coordinator who did an initial phone screen with me.   I then interviewed a week later with the clinical scheduling manager.  Both interviews were very pleasant and went well, although they were quite lengthy and the exact same questions were asked. The clinical scheduling manager quickly followed up the next day with me to schedule a third interview with two other clinical scheduling specialists with whom I would work. The two clinical scheduling specialists were not as friendly and seemed either uninterested or unprepared for my interview. Still, the third interview went alright. Followed up with the clinical scheduling manager to discuss next steps and never heard back. For a prestigious institution such as Dana Farber, not even bothering to send a reply email or following up with a phone call is the height of unprofessionalism and rudeness. Three lengthy interviews is a substantial block of time and misleading for potential job seekers. I would not recommend the interview process to others—it took about three months to finish the application and interview process only to not even receive an email saying that I was not moving forward to the next steps in the hiring process.", "Interview Questions": "Q: What are your strengths and weaknesses?\r\nQ: Tell me about why you think you would be a good fit for this position."}, {"date": "3 Aug 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Everyone was very nice and professional. So easy to talk to which helped to minimize the nerves. They made me feel like we were family and at that point further peaked my interest in the organization.", "Interview Questions": "What are you most passionate about? "}, {"date": "8 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Sat down and aksed a series of questions as to why i was interested in the field, if i had any previous experience, why i would be the best candidate, etc.", "Interview Questions": "Why are you interested in cancer"}, {"date": "6 Jul 2021", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "This interview was mostly about my experience using a range of relevant wet lab techniques by my direct supervisor; abilities and experience were the most important thing for this interview; boss later said that was all he was looking at in the resumes of applicants but I think this will really depend on your supervisor; interviews more have to do with what your supervisor is looking for and less of what the whole institution is like", "Interview Questions": "Do you have experience with cell culture?"}, {"date": "2 Jul 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute in Jun 2021", "Interview Descriptions": "I interviewed with 7 different people on the team. First with the manager, last with doctors on the team. All took place over the span of one week. Very efficient and enjoyable experience. Pretty much the same questions were asked every time. Was able to get a good sense of team dynamics.", "Interview Questions": "5 year plan? Why did you apply? What do you feel like you can bring to the table? Talk about previous experiences. Strengths and weaknesses."}, {"date": "16 Jul 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2021", "Interview Descriptions": "The process was organized and fast.  It was detail-oriented and everyone was very warm at different levels of interviews. I also got the opportunity to interview some members of the team. they shared their experience of working at DFCC which was helpful.", "Interview Questions": "What type of work environment do you prefer?"}, {"date": "8 May 2021", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I was interviewed by the Practice Manager first and then by the Director of Clinical Operations. They asked me to come back the next day and I was interviewed by five current employees.", "Interview Questions": "Strengths and weaknesses, difficult customer interaction, talk about yourself, why dana farber etc"}, {"date": "8 May 2021", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Very fun and honest she made it sweet I really enjoyed every moment so yeah if you want to work here I’ll say make sure the people are nice first", "Interview Questions": "why you wanna work here?"}, {"date": "20 Jun 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in May 2021", "Interview Descriptions": "Started with a phone screening with a recruiter/hr person.  Then an interview with the hiring manager and another person on the team.  Most questions were typical behavioral interview questions and asking about your background and past experiences.  They seem to be very interested in candidates with tableau experience.", "Interview Questions": "What technical skill is your biggest strength?"}], [{"date": "1 Mar 2022", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Apr 2021", "Interview Descriptions": "I submitted the application via Handshake and I got an email from the social media manager to set up a Teams meeting for an interview. Met with social media manager over zoom and then about a few days later, got an offer over email from her.", "Interview Questions": "Give a brief introduction and introduce yourself/describe yourself \r\nthen they ask Why are you interested in this specific position? \r\nWhy do you wanna work at Dana-Farber Cancer Institute?\r\nWhat do you know about Dana-Farber Cancer Institute?\r\nWhat are your Strengths? \r\nWhat are your Weaknesses? \r\nWhat are some leadership examples that you have participated in?"}, {"date": "19 Feb 2021", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The process was very informal and the interviewers were very friendly. First interviewed with a post-doc and the with PI of lab. They were both engaging and made me feel comfortable.", "Interview Questions": "Tell me about your research and coursework."}, {"date": "10 Feb 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The internship interview process was super straightforward - a phone call or two with the manager I spent the summer working for. It was more based on resume, interests, and getting-to-know-you than anything.", "Interview Questions": "Why do you want to intern here? "}, {"date": "10 Sept 2021", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Honolulu, HI) in Feb 2021", "Interview Descriptions": "The interview went very well. They have good and respectful communication. Their questions are straight forward. I highly recommend getting interviewed there. Nothing else need to be said about the interview.", "Interview Questions": "Mainly 'talk about yourself' questions. But the rest of the talking is from them."}, {"date": "10 Mar 2021", "title": "Research Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Feb 2021", "Interview Descriptions": "Both interviews were virtual. Started with asking about my personal experiences and why I would be a good fit for the lab. Interview questions centered around previous research and coursework. They also asked about my career aspirations and plans for graduate education.", "Interview Questions": "Tell us about your previous research experiences."}, {"date": "26 Jan 2022", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2021", "Interview Descriptions": "Very pleasant and thorough interview with the lab coordinator. The employer was timely and knowledgeable about the requires skillset. The second round of interviews was with the rest of the team.", "Interview Questions": "What is your experience with PCR?"}, {"date": "20 Jan 2021", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "First was an in person interview with multiple members of the team. This was followed by submission of 5 references, two of which should have had a managerial position over you.", "Interview Questions": "What similar job experience have you had in the past? \nWhy do you wish to work here? \nWhat is your 5 year career goal? "}, {"date": "29 Jan 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Jan 2021", "Interview Descriptions": "I had a phone screening and zoom interview with hiring manager. Everything seemed to be going great and we discussed and we discussed a third meeting with the PI of the study. I followed up the next day and never heard back. I reached out again and still did not receive a reply.", "Interview Questions": "Time when you experienced conflict, strengths and weaknesses, why Dana Farber?"}, {"date": "10 Feb 2021", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Cleveland, OH) in Jan 2021", "Interview Descriptions": "I was invited to interview with the P.I. soon after submitting an application. Interviews were relatively short and less formal than I expected; unfortunately, there were a lot of technical issues, so that likely did not help things.", "Interview Questions": "Why are you interested in our lab? "}, {"date": "29 Dec 2020", "title": "Clinic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Good, in depth, need to know job description and be confident for best results. You should also be prepared to describe how you handle stress, how you organize, and how you work work others.", "Interview Questions": "What is your favorite hobby?"}], [{"date": "7 Jan 2021", "title": "Clinical Trial Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Dec 2020", "Interview Descriptions": "Overall the interview was pleasant. Due to COVID it was performed via zoom with two other company employees. If you make it to the second round, you are interviewed with the PI", "Interview Questions": "Name 3 personalities that you don't get along with well and how you deal with that. "}, {"date": "9 Feb 2021", "title": "Clinical Research Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Nov 2020", "Interview Descriptions": "3 informal unstructured interview (30 min) with PI, Program Administrator, and Senior Research Project Manager. Asked for 5 references (skill set survey): 2 from supervisor, 3 from coworkers. All of this was asked before talking/discussing with HR further details such as hours, benefits, compensation.", "Interview Questions": "1) Where do you see yourself in 5 years?\n2) What are your career goals?\n3) Why do you want this position?\n4) Are you okay with working independently?\n5) Are you okay with the position being 40% meetings?"}, {"date": "4 Jan 2022", "title": "Clinic Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute in Nov 2020", "Interview Descriptions": "2-3 rounds typically. HR will screen you with a phone call, ~30 mins but often less. Then they pass you on to the floor that is hiring. Meeting with 2-4 other people who work on the team, often semi-casual and laid back. Good interview", "Interview Questions": "How do you work under pressure?\nStrengths and weaknesses?\nWhat would you do if the phone was ringing, there was a patient in front of you, and you had a provider behind you asking a question?\nHow do you feel about working in PPE?"}, {"date": "11 Sept 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The manager first went into details with me explaining the responsibilities of the this job and then she asked if I have any questions. She then also asked me questions about why I want this position and what I wish to get out of this position.", "Interview Questions": "Why did you want to work as a clinical research coordinator?"}, {"date": "14 Oct 2020", "title": "Clinic Coor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2020", "Interview Descriptions": "Initial phone call with Recruiter. Zoom interview with team, about 3 people. Call at the end of the week. Was a very straight forward process, asked mainly about background skills.", "Interview Questions": "Describe a time when you dealt with an unhappy customer/patient, how did you handle it?"}, {"date": "25 Aug 2020", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Was asked for zoom interview directly with PI due to COVID. It was pretty laid back and they just wanted to get to know your background essentially to see if you fit their criteria. I honestly didn’t feel like I was a good match because they mostly work with cancer cells of course them being cancer institute so I recommend you apply if you have a background working with that.", "Interview Questions": "Tell me about your research experience "}, {"date": "25 Aug 2020", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Aug 2020", "Interview Descriptions": "Following my application on their website, I received an email asking for an interview. The video interview  was with the lab PI, where I was asked to describe my previous experience and research at my undergrad lab.", "Interview Questions": "Research background questions and some general background of myself"}, {"date": "16 Jul 2020", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Had a couple quick phone interviews then an in person meeting with members of the lab and the PI. A lot of time passed between each of these steps so make sure you reach out -- I think there is a lot of bureaucracy and hoops that have to be jumped through even for entry level research assistants.", "Interview Questions": "Why are you interested in this role?"}, {"date": "18 Sept 2020", "title": "Clinic Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Jul 2020", "Interview Descriptions": "Had an initial phone interview/screen with a recruiter. Then went on to have a zoom interview with the practice manager, which went really well. Then, had to send in 5 references and had them fill out a survey. Didn’t hear anything for a little bit, so I followed up and did a 2nd zoom interview with the team leads. Didn’t hear anything after 2 weeks, followed up again, didn’t get the position :)). Would’ve been nice if they were better at following up with candidates or telling me earlier in the process, just my two cents.", "Interview Questions": "Why do you want to be a clinic coordinator?"}, {"date": "8 Sept 2020", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Jul 2020", "Interview Descriptions": "I was contacted for a phone screen and then did not hear anything back. I contacted the person back about the status and they said that position had been filled but would I like to be considered for similar positions in other departments; I said yes of course. \r\nTwo weeks later, I receive a request for references. They wanted five people to fill out a reference survey online etc. After I completed the references, I notified my contact person. She said she \"would forward it to the hiring team.\" I am writing this three weeks later with no update and no response to my inquiries. \r\nSince then they have continued to post similar job openings that I am more than qualified for; these positions don't require a degree which I have.", "Interview Questions": "Tell me about your experience. "}], [{"date": "23 Jun 2020", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "They are very friendly and it was a brief interview. They explain the job well and how your experience aligns with their requirements. They asked for a presentation on my research skills and experience and the projects I have done.", "Interview Questions": "What is your Research experience"}, {"date": "18 Jul 2021", "title": "Software Engineering Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute in May 2020", "Interview Descriptions": "The interview process was fairly smooth. It was around covid so there was some panic about hiring freezes but I ended up making the deadline. The interviwerers were nice and caring. Wanted you to succeed.", "Interview Questions": "They asked about past experiences"}, {"date": "16 Apr 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "First, I had a phone interview with a member of the research team. I was then invited to a video interview to meet the team (conducted virtually, due to COVID-19). Then, I spoke with a recruiter. I sent in 5 references for the position. I had to follow up to be told that the position had been offered to another candidate.", "Interview Questions": "What draws you to this position?"}, {"date": "5 Jun 2020", "title": "Statistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2020", "Interview Descriptions": "Like so many others, it came with a phone screen about 15 mins from an HR representative followed by an invitation to an in-person interview. Due to the COVID situation so everything was done on zoom. I talked with the PI and current statistician for a total of 90 minutes and can't say I feel anything wrong about the interview. After two weeks, I got contacted by the same HR for reference checking from 5 persons (2 managers and 3 co-workers) which was required to be submitted within one day.  Later, a denial letter saying they found someone more appropriate came after another two weeks. \r\n\r\nOverall speaking, their interview process is neither bad nor good but I just hated it when they asked for reference checking but rejected my application afterward.  Sorry for the trouble I caused to those five persons vouching for me.", "Interview Questions": "They gave me a real-time stat test to show my capability of data manipulation and statistical procedures."}, {"date": "20 Sept 2022", "title": "Data Scientists II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2020", "Interview Descriptions": "Very professional.  Behavioral questions.  Technical coding challenge.  Talked to multiple people on the team.  Positive experience overall.  Very professional.  Behavioral questions.  Technical coding challenge.  Talked to multiple people on the team.  Positive experience overall.", "Interview Questions": "Reverse a list of integers"}, {"date": "24 Jun 2020", "title": "Clinical Nurse Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Dana-Farber Cancer Institute in Feb 2020", "Interview Descriptions": "Many interviews between multiple sites, was made to seem as though I was going to get an offer then after being brought back and contacted by DFCI to apply for a job that they “want me for” I was strung along for months interviewing repeatedly and I was told to go ahead and get a MA license ASAP so they could move forward and I could be reimbursed after hire (I did that immediately) so I wasted $400", "Interview Questions": "How do you handle conflict "}, {"date": "6 Mar 2023", "title": "Data Scientist Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute in Feb 2020", "Interview Descriptions": "The interview process was good and smooth. There are two rounds of interviews in total. The first one go through resume projects, the second one is a presentation of past project.", "Interview Questions": "Introduce yourself Why choose healthcare"}, {"date": "7 Mar 2020", "title": "Research Data Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2020", "Interview Descriptions": "The process was around 3-4 weeks total. Started with a call from a project manager, followed with a 30 min phone call, then a 2 hour meeting with 4 people, ending with a screening from HR", "Interview Questions": "What is an example of when you faced adversity, and how did you respond?"}, {"date": "25 Jan 2021", "title": "Resource Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute in Jan 2020", "Interview Descriptions": "The interview process was quick and organized.  I met first in a one-on-one and then with the group.  It was professional and relaxed. I felt comfortable through the whole process.", "Interview Questions": "How do you best keep organized?"}, {"date": "12 Dec 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute in Jan 2020", "Interview Descriptions": "It was pretty informal and was about 45 minutes long. The interviewer asked a variety of questions and then gave time for the questions to be asked about the program.", "Interview Questions": "Why do you want this internship? "}], [{"date": "2 Feb 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2020", "Interview Descriptions": "I had a quick interview over the phone and lasted about 10 to 15 minutes. The recruiter asked several interpersonal questions and did not receive any feedback regarding the job opportunity. It was an ok experience over all.", "Interview Questions": "What would you do if you have a challenge while working on a project?"}, {"date": "13 Mar 2020", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2020", "Interview Descriptions": "I thoroughly enjoyed my interview with the pharmacy team on site, however, I did find HR’s business practices to be questionable. I had references from my earliest days in pharmacy all the way through my current employer. That being said, HR “requested” a reference from a company who had been bought out 10 times over. I had not kept in touch and wasn’t able to locate anyone to be a reference. Due to that, none of my references were considered. The others were completely overlooked for something that was out of my control and I don’t feel that was taken into consideration. I found that unfair to the SIX other references that really went to bat for me and believe in me to be completely overlooked over something so trivial. If DFCI HR sees this, please revise your business practices if you want good talent. Faulting someone for something completely out of their control is unfair and isolating. I will advise others in the industry to really think about what DFCI \nis offering prior to applying. Pay is very low and the skill trade off isn’t worth the low pay and bad schedule. Also, HR uses the same pharmacy reps across all sites. Please look elsewhere unless you’re only looking to stay a short amount of time in the role.", "Interview Questions": "Work history, skills acquired, I was not asked any behavioral questions."}, {"date": "4 Nov 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "After a preliminary interview with the group leader, I did an on-site interview for full day and had a chance to meet everyone in the group.  I talked to each person for about 30 minutes.", "Interview Questions": "Why do you want to switch fields to biology?"}, {"date": "18 Oct 2019", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I was the last to be interviewed by the head of the laboratory I was applying to work for. She was extremely pleasant and nice throughout. She showed me around the labs towards the end, but I did not get the position. I was not experienced in animal husbandry, which was a primary responsibility for the technician role.", "Interview Questions": "Tell me about yourself."}, {"date": "15 Oct 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Phone interview followed by an in person 2 hour interview. They were accommodating and laid back.  I met with 5 people in total, including my possible peers. The PI sought my opinion and recommendations to hypothetical team projects, issues.", "Interview Questions": "Unique input I would bring to the team."}, {"date": "11 Oct 2019", "title": "Regulatory Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Application HR phone screen, departmentvphone screen, in person department interview, reference check discussion with HR and withdrew application.  Very friendly bright high achieving staff. No faculty were there. Unique in references were requested first via email survey. Requested five references within 24 hours of receiving the emailed reference check form.", "Interview Questions": "Can you commit to more than one year oin what is considered an important but transitional/ early career role?"}, {"date": "20 Aug 2019", "title": "Licensing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "People were friendly and welcome. They tried to smoothen the process for you. First had two individual meetings with two seniors. Then was invited to meet the team on-site in several 1-1 meetings.", "Interview Questions": "Tell me about a time when you dealt with uncertainty/ambiguity.\r\nTell me about a time when you disagreed with a team member."}, {"date": "5 Jun 2019", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "The whole process took about a week. No phone interview.  There was a huge lack of communication between their hiring manager and the talent acquisition team which led to a negative experience. I received an email from the talent acquisition team asking about my availability for an on-site interview. I let them know about my availability and two days after, I received an email from the hiring manager asking why I didn't show up to the interview!!! I explained the situation and told him that I actually never received a confirmation email about the date or time of the interview. They rescheduled. When I got there, they were not ready at all! Hiring manager was running around and he was constantly checking his phone during the interview. When I asked him about the responsibilities of the job, he didn't give me a clear answer and changed the subject!", "Interview Questions": "Basic interview questions about your background and experience"}, {"date": "19 Jun 2019", "title": "Human Resources Analytics Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Jun 2019", "Interview Descriptions": "30 minute phone screen with HR, 1 hour phone interview with the manager, 4 hour in-person interview with the manager and other stakeholders. Most of the conversations were around the role and how my experiences would be relevant. Received some hypothetical situational questions, but nothing too difficult. Everyone was really nice and helpful.", "Interview Questions": "If you received a request that conflicts with people holding the info, how would you handle that situation?"}, {"date": "8 Dec 2021", "title": "Protocol Care Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Jun 2019", "Interview Descriptions": "I had a three step interview, one with the supervisor, some clinical coordinators, and then with a head doctor. A bit intimidating but the supervisor warned me beforehand. Overall i was able to get a better understanding of the role and was glad i got the offer.", "Interview Questions": "Why I was leaving my old job"}], [{"date": "13 Jun 2019", "title": "Data Analyst II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2019", "Interview Descriptions": "Applied in March via the website. Two months later got a phone call from the hiring manager and had a great conversation. Then I spoke with HR, and again, they were very welcoming and asked a lot of great questions and seemed very interested in my skills and experience for the role.  I was asked to submit 5 references within 24 hours of receiving the email. \r\nI was then asked to drive 6 hours to interview with the team of 9 people at my own expense. Interviews were very well scheduled and laid out.  I left the interview with a very positive experience and had fantastic conversations with everyone.  They all seemed very interested in me and spoke highly of me and what I would bring to the team. \r\nI followed up with a thank you email the next day.  Two weeks later, after not getting a response from my original email, I emailed again asking for an update. The hiring manager, Sarah, sent me a very generic email and said they are pursuing another candidate. After all of the effort, I expected a bit more courtesy. I would not apply to this company again.", "Interview Questions": "How would you handle a decision where you are being asked by two different people for data, but competing for different end results. "}, {"date": "5 Jan 2022", "title": "Research Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2019", "Interview Descriptions": "Pretty easy and straight forward, got to know the role a bit more and met with the department employees. It felt more like they wanted to know me more as a person than an employee", "Interview Questions": "Asked about my prior work and why I would be a good fit for this position"}, {"date": "30 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I applied online and was contacted two weeks after I submitted my application. The first interview was a phone interview, followed by a Skype interview with two project managers, followed by a final phone interview with the PI.", "Interview Questions": "Q: Why do you want to work at Dana-Farber? \r\nQ: Describe one challenge with your current position and how you overcame it?\r\nStandard interview questions! "}, {"date": "28 Apr 2019", "title": "Intake Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The interview process was much more casual than expected. In general, the in-person interview process was very conversational and friendly.  They really want to know your motivations for applying to Dana Farber Cancer Institute.", "Interview Questions": "Why do you want to work for DFCI"}, {"date": "5 Apr 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "They met me in the lobby, brought me to a conference room and we basically had a free flowing discussion about my background and what the position's responsibilities were. It was a friendly environment and everyone was easy to talk with.", "Interview Questions": "Why I was interested in the role?"}, {"date": "24 Jul 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2019", "Interview Descriptions": "The interview process was very smooth and professional. Demonstrated interest was expressed after the application process on the part of the employer, and HR was very quick to move the hiring process along.", "Interview Questions": "Why this research, how does your background and core values contribute to our goals?"}, {"date": "18 Apr 2019", "title": "Clinical Administrative Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2019", "Interview Descriptions": "The process was quick. One interview with the manager of the department. Then met with two people from HR. I was a little nervous but the women from HR were very nice.", "Interview Questions": "Basic behavioral interview questions. Nothing job specific. "}, {"date": "20 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The computer system is very tricky. It will deny many people through the system. I talk to people inside from dana farber, they agreed with that.  Make sure you say you do not sponsorship in the future. Otherwise, the system will automatically let you out.", "Interview Questions": "Do you need sponsorship in the future?"}, {"date": "7 Mar 2020", "title": "Clinical Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2019", "Interview Descriptions": "The interview was very casual.  They asked about my background, told me about the position, and then showed me around the floor.  I met with the Nurse Director and with the Lead Clinical Assistant.  I was offered the job within a week of my interview.", "Interview Questions": "Tell me about your background."}, {"date": "18 Apr 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2019", "Interview Descriptions": "I sat down in a conference room with 4 people, which included the Clinical Research Manager and Associate Director of Clinical Research.   The Director asked the typical interview questions and then the rest of the staff were able to ask me anything they liked.", "Interview Questions": "How do you work in a team?"}], [{"date": "20 Feb 2019", "title": "Revenue Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Phone screening and then an in person interview with 2 managers. Lasted 2 hours. It was quick and easy and the managers were very nice.  Asked for recommendations the day after. Received a job offer the day after that.", "Interview Questions": "Tell us about yourself."}, {"date": "19 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Feb 2019", "Interview Descriptions": "I received an email from the research manager with an interest in my application. We had a brief phone interview, which I thought went well, but I was not offered a  follow-up interview.", "Interview Questions": "Why do you want to work here? "}, {"date": "31 Jan 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Feb 2019", "Interview Descriptions": "The interview was very straightforward.  I was able to do the interview process virtually, due to being out of the country, and they were very accomodating (this was pre-covid).  I had two interviews before being offered the internship, one with my immediate supervisor and one with the director of the department I would be working in.", "Interview Questions": "They asked very standard interview questions, nothing I haven't heard before. \nExamples: \n- Describe your past education and job experience\n- Have you ever experienced a challenge? If so, how did you overcome it?"}, {"date": "21 Jan 2019", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Came in and there were 2 opportunities I was interested in so they let me apply for both.  The interviews were not bad and they were really a great chance to speak with the teams and learn more about internal processes.", "Interview Questions": "Strengths, weaknesses, multitasking. "}, {"date": "4 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2019", "Interview Descriptions": "Brief Phone interview with CRC, In-Person interview with Physician and other members of team. Followed up with reference check survey and phone conversation with recruiter. Had to input 5 different people. Then the waiting game came, 3 weeks later the offer came via phone call from the physician", "Interview Questions": "How would you describe your ability to handle stressful situations?"}, {"date": "21 Feb 2021", "title": "Director of Annual Fund Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2019", "Interview Descriptions": "There were a series of interviews, a combination of on the phone and in person. I met with the HR staff, hiring manager, and a panel of other staff members from the department. There was also a skills assessment as part of the interview process.", "Interview Questions": "What professional accomplishment are you most proud of? "}, {"date": "17 Oct 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2019", "Interview Descriptions": "The interview process took a long time. I met four different groups of people and was asked a lot of questions about organization and time management etc. It was an overall good and fair experience.", "Interview Questions": "What is a stressful situation you have been in and how did you handle it"}, {"date": "25 Jun 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2019", "Interview Descriptions": "It was pretty easy. Hire mostly recent graduates. Basic interview questions and ask you about your resume.  The process isn't difficult. The manger, other CRCs and MDs will interview you separately.", "Interview Questions": "Tell me about yourself? What are your strengths/weaknesses?"}, {"date": "18 Dec 2018", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Thirty minute phone interview following application submission. Role was competitive, and was first step of hiring process. Total process was estimated to be four to six weeks. Didn't get offer.", "Interview Questions": "What are former projects you worked on that relate to this role?"}, {"date": "18 Nov 2018", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "It was a standard process. I was first contacted to do a phone interview. It was then followed by an in-person interview, where I met the managers as well as the physician who was in charge of the clinical research program in the specific disease group", "Interview Questions": "What made you interested in this position? What are your strengths? What are you weaknesses?  Tell me about your past experience at XYZ."}], [{"date": "11 Dec 2018", "title": "Senior Clinical Research Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Oct 2018", "Interview Descriptions": "Got a quick email to request in in person interview.  Went for interview and it went well and was asked if I could stay for a second interview.  Was told a decision would be made within 2 weeks because they wanted to fill the role fast.  I checked back and there was a delay in the process.  After about a month a so I was told \"they decided to go in a different direction\".  Not sure exactly what that meant and the role is will on the website with a second financial analyst role available as well.  I wish they had better feed back on why I didn't qualify for the role.", "Interview Questions": "Why I was interested in this role."}, {"date": "25 Sept 2018", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Had a pre-screening interview with HR and a phone interview with the PI the following week. Soon after came in for an in person interview and got a job offer. The whole process took about 1 month.", "Interview Questions": "General questions about past research and techniques "}, {"date": "26 Jul 2018", "title": "Development Officer, Special Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Poor communication for such a strong organization. Jobs still posted on their website that have been filled for months. No application update statues or way of getting in touch with actual representatives.", "Interview Questions": "What type of work do you want to do"}, {"date": "30 Aug 2018", "title": "Administrative Support Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jul 2018", "Interview Descriptions": "Short and sweet basic interview questions, can be found on many reviews here. Two rounds of interviews, including meeting doctors you will support. Easy to answer questions if you know your resume well.", "Interview Questions": "How do you deal with stress? "}, {"date": "28 Jun 2018", "title": "Regulatory Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "After seeing my resume, they brought me in for an in-person interview that consisted of speaking with 2 different team members. All of the questions were fairly straightforward and were not tricky or technical. They emphasized the ability to stay organized and to communicate with different entities.", "Interview Questions": "Why Dana Farber?"}, {"date": "19 Jun 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "After going through a preliminary screening via a brief telephone interview, I was brought in and interviewed face-to-face with the head of the lab, and then several members of the lab afterwards.  They showed me around their lab and described what the position would entail and the general responsibilities of the job would be should I have gotten the offer.", "Interview Questions": "Where do you see yourself in the next five years?"}, {"date": "19 Jul 2018", "title": "Clinical Genomics Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Jun 2018", "Interview Descriptions": "A casual interview (skype) with hiring manager +1. They were keen on knowing my experience with cancer biology, whether I've taken cancer biology classes. They asked for writing samples and samples of my previous non-clinical  genetics reports.", "Interview Questions": "N/A"}, {"date": "1 Jun 2018", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in May 2018", "Interview Descriptions": "I was first contacted by the director of the specific lab I applied to via email.  I had a brief phone interview, and received an invitation to an on-site interview a week later (after I followed up with an email).  The interview was quite relaxed, and there were no difficult or unexpected questions.", "Interview Questions": "How do you interact with other members in a group?"}, {"date": "28 Apr 2018", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2018", "Interview Descriptions": "I interviewed in April first over the phone and then was invited in for a second in person interview. The first interview was with the supervisor and the second was with the supervisor and the team. The team was very friendly and made me feel comfortable. I have not heard back yet.", "Interview Questions": "What are plans you have for the future?"}, {"date": "10 Apr 2018", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2018", "Interview Descriptions": "I first had a 30 minute phone with the PI who was very pleasant and friendly. I was first asked to explain my research experience and the lab methods that I am familiar with. Then the PI explained the position and the research done in the lab. I discussed how my interests, goals, and abilities match the position. Then I was offered an in-person interview.", "Interview Questions": "Previous research experience? What techniques are you familiar with?"}], [{"date": "27 Mar 2018", "title": "Corporate Partnerships Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Very straightforward, HR phone screen, in person interview with the hiring manager and then a second interview follow up . I was told I was a strong candidate and then after following up multiple times after two weeks of no updates, I was told I didn’t fit the candidate description.", "Interview Questions": "Why Dana Farber?"}, {"date": "16 Mar 2018", "title": "Program Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "HR called and did a phone screen first. Then I came in to meet with HR. Then I came to meet in with the nurse director. Then I came in to meet the disease center clinical team.", "Interview Questions": "Why do I want this job"}, {"date": "11 Jan 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2018", "Interview Descriptions": "Initially applied for job and was reached out to by HR for a 20-30 minute phone screening. Was then asked to come in for in person interview, met with 7 people usually two at a time. Relaxed atmosphere, explained job and expectations well.", "Interview Questions": "Why do you want to work at Dana Farber?"}, {"date": "16 Jan 2018", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Dec 2017", "Interview Descriptions": "First met with Management, then with supervisors, then with potential coworkers.  They would go over the day to day activities and responsibilities and would weave in general questions about your personal abilities and experience.  They also ask you if you are willing to handle some of the negative aspects of the job.  Overall, the interviews are more conversational rather than directive and inquisitive.", "Interview Questions": "What do you want to get out of this job?"}, {"date": "24 Oct 2017", "title": "Inpatient Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "starts with a quick telephone interview to discuss opportunities in the company and open positions.   For inpatient, you get to shadow rounds with the teams in the morning and meet with the chiefs after for interviews.", "Interview Questions": "They ask you how you about your experience giving bad news, handling very sick patients, etc, dealing with cancer patients in general.  The rest of the interview is pretty standard questions about your experience, being a team player, etc.   They do hire a lot of new grads, so if you had a rotation in oncology, ICU or inpatient medicine, you're in great shape.  "}, {"date": "11 Oct 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Oct 2017", "Interview Descriptions": "Contacted by HR to set up a phone interview, then contacted by lab manager to come into the lab to meet lab members and tour the lab, was then offered the position", "Interview Questions": "Why do you want to work in this lab?"}, {"date": "25 Sept 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "I received an email from the lab manager asking for more information and references. The PI then requested a Skype interview, which was followed a week later by an in person interview with the laboratory manager.", "Interview Questions": "What are your career goals?"}, {"date": "18 Sept 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "1.  Screening interview with a member from HR.\r\nThe interview with the member of HR lasted approximately thirty minutes. The interviewer was very pleasant and asked non-technical questions.\r\n2. Interview with the PI in whose lab you would be working.\r\nThe interview with the PI lasted an hour and was more technical. The interview focused on research background, skills, interests, and the project in the lab.", "Interview Questions": "Why are you interested in this position? Why Boston?"}, {"date": "10 Mar 2021", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2017", "Interview Descriptions": "Required more than one onsite evaluation.  Sat with Manager, then peers, and then also medical team.  Did not compensate parking for all these visits.  They were looking for a longterm employee that would commit extra hrs into getting the work done.", "Interview Questions": "What qualities and experience do you bring to the table?"}, {"date": "27 Jan 2019", "title": "New Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Sept 2017", "Interview Descriptions": "I had a phone screening and then an in-person interview. The process was very straightforward and it did not take long for the hiring manager and the supervisor to get back to me. My in-person interview was less than thirty minutes long and received an offer an hour later.", "Interview Questions": "Tell me about your past work experiences"}], [{"date": "2 Jul 2017", "title": "Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Talked to a recruiter/ administrative assistant on the phone for some basic questions such as \"what are your 3 best skills\". Interviewed in person with head of department and then had an informal interview with person who was leaving that role.", "Interview Questions": "Describe your 3 best skills\r\nTell me about yourself"}, {"date": "27 Jun 2019", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Dana-Farber Cancer Institute (Brookline, MA) in Jun 2017", "Interview Descriptions": "2 to 3 hours. I was an internal transfer, so interviews were spread across multiple days in 30-60 minute intervals. Group interview with team. 1:1 interviews with direct manager and each of the two levels of management above.", "Interview Questions": "What are you passionate about?"}, {"date": "22 Jun 2018", "title": "Protocol Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2017", "Interview Descriptions": "It was good, but way too fast. They didnt care much about the interview rather than just getting me hired so i can do the work because they were tight on workload.", "Interview Questions": "How do you manage time"}, {"date": "8 Apr 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2017", "Interview Descriptions": "Standard interview procedure- two in person interviews and one interview over the phone. Whole process took only a week. The staff here is very friendly even during interviews. Over the phone interview was only general hr questions while the in person interviews asked more relevant questions. No questions were meant to trip you up however.", "Interview Questions": "Why do you want this role?"}, {"date": "13 Mar 2017", "title": "Administrator II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "3 rounds of interviews with the different departments you would be in communication with. It was typical cookie cutter interview questions. At least 2 hours. By the end it was exhausting being asked the same questions by the different groups.", "Interview Questions": "What was your biggest challenge and biggest accomplishment. What can you bring to this company? What are your long term goals?"}, {"date": "22 Mar 2017", "title": "Laboratory Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2017", "Interview Descriptions": "I saw the job posting and contacted them directly via email. An hour later they emailed back for an in person interview. After 2.5 hours of interview with a MD and a Deputy Director, they contacted my references right that day. The next day (Friday) I scheduled to interview with the PI on Monday at noon. Monday afternoon I was offered the position. It was a very smooth and efficient process.", "Interview Questions": "What do you want to be when you grow up?"}, {"date": "22 Aug 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2017", "Interview Descriptions": "Met with everyone in the lab briefly, and we discussed ongoing projects in the laboratory. Everyone was pleasant, receptive, and they gave me a tour of their facilities. Definitely be up-to-date on the relevant literature to  their lab's work and be prepared with questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "28 Feb 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "They have an extremely long interview process. They ask you to block out at least 2 hours to come in and essentially do what would be you first and second round interviews one after another.", "Interview Questions": "What was the worst boss you have ever had and why? "}, {"date": "22 Jan 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "One phone interview and two in-person interviews, held back-to-back. The phone interview was more or less just further explanation of the position. The first in-person interview was almost inappropriately informal - just sitting in a room with three other staff chatting. The second in-person interview was one-on-one and the interviewer asked a number of very simple questions.", "Interview Questions": "Tell me about yourself; What are your greatest strengths and weaknesses?; What are your career goals?."}, {"date": "11 Jan 2017", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Submitted my application, a few days later received an email from human resource to set up a phone interview. We set up a time. The day comes, the human resource woman calls me ahead of time to re-schedule the interview/make sure she has the right number, she tells me she'll call me back in a couple of hours. She never called back, didn't even email me. What a terrible way to do business. Was happy I accepted a position at another company instead.", "Interview Questions": "Was not asked any questions "}], [{"date": "20 Feb 2017", "title": "Lead Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2017", "Interview Descriptions": "I was contacted by a recruiter by email to fill out a prescreening questionnaire. After that I was informed my file has been sent to the department and if there is interest I would be contacted by email. I got a response from the department the next week and scheduled a skype interview. Things went well and interview lasted a little over an hour. I was told they need me to speak to the Lab head who was away on tour for a couple of weeks. But I was contacted the very next week to setup time to talk to the lab head. Again another skype interview. It was merely a formality I felt and things went great. I was informed there are additional candidates to be interviewed and they would get back to me in a week. But within 3 days I was offered the job and I accepted gladly.", "Interview Questions": "General questions about my experience. If I worked with animals, if I was ok with working on occasional weekends etc"}, {"date": "8 Nov 2018", "title": "Scientist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2017", "Interview Descriptions": "I had two interviews one through phone and one onsite for a position at Lurie imaging center. They invited me for an onsite interview, they were so lethargic that they did not even care for a guy who visited from west coast, many of those interviewers were absent on that day and that guy Nyegen and Lei Quin, were so ignorant of what they have been doing in their own imaging field, lack of knowledge.  I was not sure how these guys manage this center without even knowing basic knowledge of imaging and cancer.  \r\n\r\nWhen I went there for an interview, nobody knows in that center that there is a candidate, arrived for the interview. The interviewing guys came late than the candidate and it was a colossal total waste of time and energy,  They were so unprofessional and unethical.  A prospecting candidate for any position there should think twice before applying for the position there.\r\n\r\nI am glad now that i did not want to work under a kid like them for rest of my life.", "Interview Questions": "why are you leaving?"}, {"date": "2 May 2017", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Oct 2016", "Interview Descriptions": "it was relatively easy and standard postdoctoral research fellow interview for an academic position, i was invited to give presentation to research group, had 1:1 meetings with PI, other postdocs and graduate students. it was a full day process, and had lunch with all group. during the day, I was asked about my projects and my grad school life, and questions about my personality", "Interview Questions": "how to set up an assay about this?"}, {"date": "31 Aug 2016", "title": "New Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Aug 2016", "Interview Descriptions": "I was contacted for a phone interview by HR, and then brought in for an in-person interview with the same member of HR. The interview lasted about 45 minutes, and at the end of it she had me interview with my potential boss and the person who would be training me on the job. Those two interviews were about 30 minutes each. They then reached out to me via phone to discuss the interview, as I was being considered for multiple positions. After our phone conversation they offered me a position the next day.", "Interview Questions": "How do you stay organized?\r\nWhy do you want to work in this role?\r\nTell me about a time when you worked with a difficult patient.\r\nTell me about a time when you handled a coworker being difficult.\r\nHow do you think this clinical experience on your resume will prepare you for an administrative role?"}, {"date": "1 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Aug 2016", "Interview Descriptions": "Process started with a phone screen, then once that was passed there was one more phone screen and a morning of in-person interviews. The interview was easy and was based more on if your personality worked with the team, once they did the initial scan to make sure you were qualified.", "Interview Questions": "Tell us about yourself?\r\nWhy this company?\r\nFuture goals?"}, {"date": "10 Jul 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Very smooth and welcoming. I never felt uncomfortable or as if I was imposing on anyone. There are multiple interviews with the various PIs and current CRCs. Initial phone screening was smooth.", "Interview Questions": "Why should we hire you?"}, {"date": "31 Jul 2016", "title": "New Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2016", "Interview Descriptions": "I had an initial phone call with someone from HR, we then scheduled a time to meet in person. HR called back to schedule me an interview with the hiring manager of the department (it was scheduled for a little over a week later). I met with the hiring manager of the department for 30-40 mins, then during that same interview I met with who would be my co-workers if hired. A few days later I received a phone call from the hiring manager to set up another interview with one of the MDs in the department along with the program coordinator of NPCs. This last interview was mainly them telling me what they do and how they interact with the NPCs, it was my chance to ask them questions about the position. The next day I received a phone call from HR offering me a position. While I did meet with a lot of people, interviews were almost back to back because I had an empty schedule. The longest wait time between interviews was 8-9 days.", "Interview Questions": "They ask mainly behavioral questions. They will ask about what you want to do in the future, since they are aware that this is not a long term career."}, {"date": "24 Jul 2016", "title": "New Patient Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2016", "Interview Descriptions": "It was a phone screen. The interviewer went over my resume and asked questions about my different positions. I explained that I was using the different positions to showcase my skills; since at my last employer I wasn't able to show that I interacted with the public, used Word, Excel and Outlook", "Interview Questions": "If I understood the role"}, {"date": "22 Apr 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "2 phone interviews with disease group manager, and then 5 in person meetings/interviews with director, and several physicians in the group-  The people weren't trying to test you, but rather, see what kind of person you are, which was refreshing if you actually have interest in the field.", "Interview Questions": "What would you do if you saw someone do something unethical with regard to research practice ?"}, {"date": "21 Apr 2016", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "After a phone interview, the interviewer invited me to an on-site talk. The interviewer asked general questions such as why do you want this position and how my college experience was. The interviewer also showed me around the lab.", "Interview Questions": "Why do you want this position?"}], [{"date": "5 Apr 2016", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "I first applied to the institute and had contacted the principle investigator. This was followed by phone conversation with myself as well as two of my references. I was then asked to visit the laboratory and give a scientific presentation (about an hour long) on my research area. I got the verbal confirmation of job offer on the same day, and written job offer in next couple of days.", "Interview Questions": "Most of the questions were related to the science that I was doing. "}, {"date": "26 Sept 2017", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2016", "Interview Descriptions": "It was a very typical interview process. Basic questions and everyone is very nice.  It started with a phone screen and went on to 2 more rounds of interviews after that. Recruiters were easy to deal with and very accommodating!", "Interview Questions": "Why did you choose to apply for a Development role? "}, {"date": "16 May 2016", "title": "Clinical Research Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2016", "Interview Descriptions": "I liked the inviting and respectful environment. I was introduced to staff and had a conversation with them. \r\n\r\nThey are still interviewing candidates, so I don't yet know if I have been selected or not.", "Interview Questions": "Why I was interested in the position?"}, {"date": "31 Mar 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2016", "Interview Descriptions": "This process was really interesting. I initially Interviewed for the New Patient Coordinator job position. During the third and last interview the person who was interviewing me felt that a Clinical research coordinator job would be a better fit after a quick review of my resume.Which is interesting because I had only been applying for clinical research positions throughout my job search but I decided to be flexible and apply to the new Patient coordinator position. I was referred to the clinical research manager and within one week I got a quick phone screening with the manager. She invited me for an in person interview for the following week. The following week I went to the interview. I thought the interview went really well. One of the clinical research coordinator gave me a quick tour. I asked him many questions in order to show him my interest in the position At the end of the interview she invited me for another interview where I would be meeting with two doctors. Two weeks later (which is today) I came for my last round of interview. I met with the clinical research director. It was a brief interview. I ended up meeting with two clinical research coordinator they were very nice and provided a lot of information about the job. Finally I met with the last doctor who would interview me. It was more of a conversation but he did ask me basic questions about my goals and why I wanted to work here etc. Overall the interview went really well. A couple of hours after the interview, I got a call from HR with an offer. I am extremely excited about how fast they got back to me.", "Interview Questions": "What do you see yourself doing long term? "}, {"date": "21 Feb 2016", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Several round of interviews, via phone and in person. Everyone was relatively nice and welcoming. I met with the direct supervisor then two rounds with other people in the department. Extreme lack of diversity in the entire department", "Interview Questions": "Simple interview questions"}, {"date": "13 Feb 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "It is quite routine. There was a 30 min phone interview, followed by an one-day onsite interview including an one hour presentation and 30min personal interview for the whole day. After a few days, I was made an offer and I accepted it. Then I believe I have to go though background check. There is a mandatory health clearance requirement.", "Interview Questions": "Tell me about yourself, what do you know about ...?"}, {"date": "22 Jan 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2016", "Interview Descriptions": "There were two different phone interviews with the hiring manager. No interview with an HR representative. I then had two different days of in-person interviews with members of the team I would be working with as well as physicians.", "Interview Questions": "Why do you want this position?"}, {"date": "20 Feb 2016", "title": "New Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2016", "Interview Descriptions": "I applied online, received an email that someone from hr would call me for a phone interview, that went well and was then asked to come and meet in person. I meet with HR and then waited around to meet with the manager of the department I would be working with. I came in for another interview round and met with the manager as well as a current employee who spoke with me about a typical day, and I was able to ask questions. I received an email the next day as a thanks for interviewing but that they have chosen to pursue other candidates.", "Interview Questions": "Provide a specific example of when you had to advocate for a patient."}, {"date": "1 Mar 2016", "title": "New Patient Coordinator Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2016", "Interview Descriptions": "The interview process was a bit awkward- Applied online. After few days, I received an email to schedule a phone interview. The pre-screening  interview was easy, she asked basic questions such as how you handle customers, weakness and goals- Nothing difficult. After few more days, I received an email with a link requesting to submit a list of references with a questionaire. I felt this part of the process was out of the ordinary and strange. My references had to respond within 24 hours frame an automate questionnaire and provide feedback about my work ethics. When the questions were completed,  I received an email confirming a face- to-face interview. During the interview, the interviewer was very pleasant to talk to. The questions were based on how you deal with difficult customers/patients, flexibility in the workplace, multitask, organization skills,  stressful situations, how you deal with pressure, etc. I had the impression the interview went well, until few more days went by and I received an email with \"No offer\". At this point, I'm not sure what they are looking for.  \r\nThe process should be modified- They should ask for references when someone is being hired not during the interview process!", "Interview Questions": "Tell me a time when you demonstrated flexibility.\r\nTell me a time when you provide excellent customer service to a client/patient. \r\nHow do you handle multiple assignments or tasks?\r\n"}, {"date": "26 Feb 2016", "title": "New Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2016", "Interview Descriptions": "First, I met with a recruiter for an interview then I was sent to meet with another individual who supervises the position. Overall, every person I came in contact with at Dana-Farber was extremely friendly.", "Interview Questions": "Describe a difficult situation and how did you handle it?"}], [{"date": "11 Jul 2018", "title": "Clinical Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2016", "Interview Descriptions": "The hiring process was very organized. I met with Human Resources, they did an intense interview to see where I best fit. This was then followed by an interview with the program manager of my department and an interview by the staff", "Interview Questions": "What has been a stressful past experience? "}, {"date": "27 Apr 2017", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2016", "Interview Descriptions": "I initially interviewed for a temporary position to cover an employee's maternity leave. I went directly through DFCI and not a temp agency. I interviewed with the department director, as well as my direct manager. I only had one in person interview.", "Interview Questions": "They were interested in hearing about my plans for the future, as they expect employees to remain in their roles for about 2 years."}, {"date": "28 Dec 2015", "title": "Research Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Oct 2015", "Interview Descriptions": "Contacted for an interview and came in person to meet and review job.  They were very upfront about the nature of the work itself.  Most of the interview hinged on my personal goals, what I was looking for in a job and how Dana Farber could meet those needs.  I felt comfortable, listened to and like they were being up front and honest.  In the end it was not a good fit for my specific career aspirations.", "Interview Questions": "What are my career aspirations"}, {"date": "14 Sept 2015", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "The interview process was pretty straightforward. I met with what would have been my direct supervisor first. She asked me a bit about what I knew about Dana Farber, explained the department and the work the department does, how each department is organized, and gave me the opportunity to ask questions. After that I met with the other CRC's who were very nice, and asked me a couple of questions about my experience and why I applied, I then met with the Director, who asked similar questions", "Interview Questions": "Why do you want to work here?\r\nWhat are your long term goals?\r\nQuestions about experience and background"}, {"date": "21 Nov 2015", "title": "Clinical Administrative Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2015", "Interview Descriptions": "I did a phone interview then was asked to interview in person two different times. i never heard back either way. I had to call and email to find out, i did not get the job. Very unorganized hiring process. The right hand does not know what the left hand is doing.", "Interview Questions": "why do you want to work here?"}, {"date": "2 Dec 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2015", "Interview Descriptions": "I got the job internally, I was a current employee. I submitted my resume, interviewed with two managers together and then met with two senior clinical research coordinators to learn more about the job. The overall experience was a positive one.", "Interview Questions": "How did I handle a stressful situation at work?"}, {"date": "25 Feb 2016", "title": "Clinical Administrative Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2015", "Interview Descriptions": "Phone briefing to in person with HR and then met with two separate floors with openings. I was there for almost 3 hours meeting with different people. Had a final interview with one floor a few days later. The interviews were very informal.", "Interview Questions": "How are you with managing time when different things are going on around tou?"}, {"date": "23 Aug 2015", "title": "Human Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "The process took some time since the Human Research Department did their own hiring process. I applied online and a few weeks later was contacted for an in-person interview. The interview was pretty easy and relaxed and everyone there is extremely friendly. Despite being one of the top three candidates, I did not receive an offer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Aug 2015", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "I was contacted directly by the hiring manager and not HR. I was contacted via email and not via phone.  The interviewer spent a LOT of time talking, more than necessary. She explained the entire job description very thoroughly both other the phone and in person. The in person interview was about an hour of 1:1 conversation surrounding my skills and experience. She did follow a template of interview questions and took notes throughout.", "Interview Questions": "Do you feel comfortable working with individuals that may lose their battle with cancer?"}, {"date": "25 Jul 2015", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (New York, NY)", "Interview Descriptions": "I was emailed to have a 15-30 minute phone interview for a Research Technician position. It took about ten days for me to hear back from them. Instead of Human Resources contacting me, the Research fellow contacted me directly via email for a phone interview. We set up the interview on the day of contact. It was a thorough interview, asking questions on lab techniques and standard \"where do you see yourself in four years?\" and \"what are your two greatest weaknesses?\".", "Interview Questions": "Where do you see yourself in four years?\r\n"}], [{"date": "22 Jul 2015", "title": "Senior Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Involved a brief phone interview and was then invited for a face-to-face interview. I received great feedback and submitted my references the next week. A month later and I have heard absolutely nothing from DFCI and I have pretty much given up. After trying for 5 months to get a position and getting very little contact I am not encouraged by their process at all.", "Interview Questions": "Basic interview questions. Why I wanted the position. A lot of details about my previous job and how I could apply that knowledge."}, {"date": "24 Jun 2015", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Really wonderful interview process. Did phone interview with recruiter and then two in person rounds with hiring manager and other members of the team. Everyone was prepared, professional, and very kind. One of the most well thought out interviews I've done. They didn't try to make it difficult- if you are qualified for the position and your experience is a match, you should do fine.", "Interview Questions": "Why Dana Farber?"}, {"date": "22 Sept 2015", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Dana-Farber Cancer Institute (Stoneham, MA) in Jul 2015", "Interview Descriptions": "Interviewed on the phone for 20 minutes and was asked to come in the next morning for an interview with her.  She sounded very interested in me and all my experience.\r\nI arrived 20 minutes early for the interview.  Once she came out and walked me to her office she quickly went over the job responsibilities ( which we had already talked about and it was in the advertised job posting).  She didnt ask me any questions and just asked me if I had any questions. I asked some questions to keep the interview going.  I reiterated that I have done all of the job responsibilities before and how much I enjoy doing them.  Then she quickly said as she stood up \" ok then I will walk you out\".  I asked her if she wanted my references or all my letters of recommendations and she said \"no - I will be in touch by e-mail because we do everything electronically, as she opened her door to let me out.  I got the hint right away she for some reason did not want me - but the day before she was very interested.  Since I am a mature worker - I felt that could have been the reason.  I was very qualified for the position and i was unemployed because my previous employer moved to another State.  The same woman called me 3 weeks later and told me she liked my resume and would like to interview me, I told her she interviewed me 3 weeks ago already and there was dead silence.  Then she said \" let me call you back\". Of course she never called back.   If your a seasoned worker  be on guard for a job at the Stoneham location.", "Interview Questions": "She did not ask me anything once she saw me.\r\nOver the phone she asked me if I was good with computers. \r\nI told her i have been using different software on computers for years and\r\nAdapt very easy to new software applications."}, {"date": "10 Jun 2015", "title": "New Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2015", "Interview Descriptions": "The people at Dana- Farber want to make you feel good. The whole process of the in person interview was pain less. Most of the question were very straight forward. The question were very must  about how you would deal the different kinds of patients.", "Interview Questions": "What brings you in today?"}, {"date": "24 May 2016", "title": "New Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in May 2015", "Interview Descriptions": "After applying online from the DFCI job openings webpage I filled out a questionnaire, I received an email the next day to set up a phone interview. \r\nFrom there, they invited me to come in for an in-person interview. After that I waited about a week to set up another meeting with department managers.", "Interview Questions": "Describe a time you demonstrated flexibility\r\nDescribe a time you took initiative\r\nDescribe a time you demonstrated excellent customer service"}, {"date": "1 Jun 2015", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in May 2015", "Interview Descriptions": "I applied online through Dana-Farber job system. Then It took about 1 week for processing. I got email to set up call interview with the PI. I did not get offered for the on-site interview.", "Interview Questions": "N/A"}, {"date": "14 Apr 2015", "title": "Physicist/Scientist II (Imaging) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Initial Phone interview followed by on-site interview. Was not reimbursed for travel/lodging. \r\nEveryone was very courteous and nice. I gave a 30 min talk which was very well received, followed by individual interviews lasting 30 mins each. There were a couple of group sessions as well. \r\nThe group consisted of mostly young and friendly professionals - a good environment to be in. \r\nI had a good feeling I was a favored candidate for the position and everything went perfectly.", "Interview Questions": "What is your salary expectation?"}, {"date": "23 Sept 2017", "title": "New Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2015", "Interview Descriptions": "Interview process was long. I lived in NY. I first had a phone call with HR. Then had to drive MA to have two separate interviews with HR and the manager of a department. Then a few days after that I was thankfully in Florida and had a skype interview Skype otherwise I would've had to have driven back for the third and final interview. It seemed like a bit much for an entry level position.", "Interview Questions": "What do you know about the position you're interviewing for? "}, {"date": "5 Apr 2016", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2015", "Interview Descriptions": "The interview was easy - I had a phone screening with an HR recruiter. A short while later I had my first in person interview with the supervisor and an HR rep at the same time. The second interview is with the manager. I ended up having the second interview on the same day because the supervisor had a positive impression.", "Interview Questions": "If you didn't get along with a colleague, how would you deal with the situation?"}, {"date": "6 Nov 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2015", "Interview Descriptions": "Did a direct in-person interview with the lead investigator. Also met with every member of the team, including the hiring physician scientists for about 30 - 45 minutes each. Questions were largely behavioral as my skills had already been accessed. Follow up was made with references.", "Interview Questions": "Tell me about yourself. Why science? Why us? etc"}], [{"date": "5 Jan 2015", "title": "Scheduler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I got the interview through my staffing agency and went in right away. I was interviewed by two people at the same time. They asked mostly simple questions about why I was interested in the job, my prior experience, and how I would respond to working directly with cancer patients.They talked to me just as much as I talked to them during the interview.", "Interview Questions": "They asked me to describe a situation where I made an angry customer happy (something along the lines of that)."}, {"date": "9 Dec 2014", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I applied online and was called for an interview the following week. The interview itself was just one day and done with three individuals: the Program Manager (direct supervisor), the head of the Department, and the current Administrative Specialist. I met with each for about 30 minutes for a series of basic questioning.", "Interview Questions": "They gave me the breakdown of a typical day for the position and asked how I would handle it."}, {"date": "4 Jan 2016", "title": "Protocol Care Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Dec 2014", "Interview Descriptions": "Submitted my resume to the medical oncology department and heard back within the same week. Interviewed the following week and was offered the position a couple of days later. Went through the occupational health and HR clearance and began my new position withing about 3 weeks.", "Interview Questions": "Pretty basic questions. Where do you see yourself fitting in the institute? How do you see this position fitting in to your overall career goals?"}, {"date": "18 Oct 2014", "title": "Program Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "After applying online, I received a call from a preliminary interviewer who asked me questions about why I was interested in Dana-Farber. The call lasted 15 minutes or so. The next day I received a call from another interviewer, specific to the position which lasted about 10 minutes. After this I did not hear back and the position showed as filled online.", "Interview Questions": "What was your previous compensation? Were any of your previous positions part time?"}, {"date": "15 Oct 2014", "title": "Research Fellow/Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "Web job posting, two interviews, unofficial hire, and two months to get through the Harvard beaurocracy. The process wasn't complicated on my end but there were numerous delays with human resources", "Interview Questions": "N/A"}, {"date": "2 Oct 2014", "title": "Principal Research Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "First talked to the PI over the phone. Then, I was called-in for an in-person interview. This lasted about 25-30 minutes. Towards the end of the interview, I was offered the position. I didn't bargain for a higher salary, because the offered salary was more than what I was currently making. Accepted the position, later that evening one of the lab members called and said that I shouldn't have.", "Interview Questions": "Nothing that I can think of. Interview was fairly simple."}, {"date": "13 Feb 2015", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Sept 2014", "Interview Descriptions": "All in all took about a week. Applied online and was called a couple days later by HR. They set up the interview and I went in to meet with the Hiring Manager. After a couple days, I was called and offered the job! Such a great place!", "Interview Questions": "\"How do you handle yourself in high pressure situations?\""}, {"date": "7 Jun 2015", "title": "Stem Cell Lab Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Aug 2014", "Interview Descriptions": "Applied online - as called in for interview one week later. I met with supervisor in his office, he then took me to meeting room and got the entire department, the supervisor the read scripted questions. A few of the employees were bored out of their minds staring into space.", "Interview Questions": "I was prepared to talk about my previous experience with patient sample testing, skills in aseptic techniques, and why I was the candidate for the job. My preparation was USELESS! - all they asked were psycho questions - \"do you take risks\", \"what was the most spontaneous thing you ever did\", \"what was the most traumatic event in your life\". At the end the supervisor asked if anybody else had any questions, one lady asked me why I left a previous job, which was the only remotely work related question asked."}, {"date": "16 Jul 2015", "title": "Cell Processing Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Aug 2014", "Interview Descriptions": "The interview was just conversational. What I am interested in and what the job involves, any questions about it. Prior relevant experiences. Very large stress put on a 2 year commitment.", "Interview Questions": "Do you have any experience in a cGMP environment."}, {"date": "1 Jul 2014", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I applied through the DCFI human resources website and was contacted for an in person interview with the manager and assistant manager of the clinical research group. After the first round interview, I was invited to return for a second round interview with one of the managers and several of the current CRCs.", "Interview Questions": "Prepare for questions about working as a team and how you deal with challenging people."}], [{"date": "5 Feb 2015", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2014", "Interview Descriptions": "Invited for interview\r\n\r\nOne interview with manager and assistant manager\r\nDiscussed experience and my career goals\r\nAsked many questions about the position and the ins and outs of clinical research\r\n\r\nSecond round interview with manager and three current CRCs\r\nDiscussed how I deal with challenges and organizational skills", "Interview Questions": "Many questions about teamwork"}, {"date": "1 Jun 2016", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2014", "Interview Descriptions": "It was a very involved process that required several trips.  At the end of the interview process I had sat down with an upwards of 12 people to go over my background and qualifications for the position.", "Interview Questions": "How do you feel about working with patients that may often times be emotional and stressed?"}, {"date": "20 Nov 2014", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute in Jun 2014", "Interview Descriptions": "I learned of the position and submitted the application online at Dana-Farber Careers website. After about three weeks I was contacted via email to set up a phone interview. The phone interview lasted about 20 minutes", "Interview Questions": "Nothing unexpected."}, {"date": "19 Aug 2015", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Apr 2014", "Interview Descriptions": "First, you will be interviewed by the Managers of all Ambulatory Practice. Then, if they approve of you, you will be asked to interview with a floor-specific Practice Manager. In my case, I was asked to come back a different day to complete a third interview because the practice manager in my second interview was hiring for a position that I did not apply for.", "Interview Questions": "Tell me about yourself. "}, {"date": "20 Dec 2013", "title": "Bioinformatics Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Interview process was very hap hazard. The onsite was purely HR but they kept calling again and again with technical questions after the onsite interview.\r\n\r\nThe only good part was that they make you very comfortable during the interview.", "Interview Questions": "Very general questions were asked."}, {"date": "21 Mar 2014", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Dana-Farber Cancer Institute (Brookline, MA) in Oct 2013", "Interview Descriptions": "LONG process where I met with many many people, submitted writing samples and answered many questions. Had to meet with occupational health, get a flu shot and give them my very blood. Intense. I was recruited for this job as well so there was another layer of questions on top of their in house process. Took three months to get hired here.", "Interview Questions": "So many questions. I think the most difficult thing was having the endurance to get through the day. "}, {"date": "28 Sept 2013", "title": "Clinical Administrative Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Dana-Farber Cancer Institute", "Interview Descriptions": "I was set up with an interview for this position through a staffing agency. The interview itself was very short and dry (the recruiter had told me to expect this, as they frequently conduct \"rapid-fire\" hiring). The interviewer asked me a few basic questions (why I wanted the position, information about my past employment, etc.), and did not offer much personality to help the interview flow. All in all, the entire thing lasted about 10-15 minutes, and I did not get a very good impression afterwards. I wish the interviewer had taken more time and interest in the interview itself, as I feel the short duration and lackluster questioning played a pretty big role in why it did not go very well.", "Interview Questions": "What do you know about what this job entails?"}, {"date": "5 Mar 2014", "title": "Animal Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Aug 2013", "Interview Descriptions": "My interviewer first contacted me through email, where she explained the position in detail and set up a phone interview. During the phone interview, which was more difficult than the in person interview, she asked about my past experiences and other questions that seemed unrelated to my current job, such as what was the most admirable thing I've accomplished so far.", "Interview Questions": "What was my greatest achievement thus far in life."}, {"date": "22 Jun 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jul 2013", "Interview Descriptions": "Met with a manager, current employee, and physician. Had a phone screen with HR before landing an in person interview, and worked with HR during the onboarding process. There are required health screenings in order to work at DFCI, but HR helps set up these appointments. TB test, HBV titre, full immunization record. CORI check.", "Interview Questions": "Strengths and weaknesses, what makes me a good fit for the role"}, {"date": "30 Sept 2013", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Dana-Farber Cancer Institute in Jul 2013", "Interview Descriptions": "Applied online through the Dana website. Hiring manager contacted me two days later requesting more information. I checked in a week later, and was told they were beginning to schedule phone screens. The next three weeks there were many delays in e-mail communication, but finally an introduction meeting was made. Spent about an hour reviewing my resume and details of the position.\r\nThe next week I was asked to send in samples of my work, and the week after that we scheduled an interview. So, six weeks after initial contact I spent the day on site interviewing. I had 7 one hour sessions with 8 different people, it was an extremely long day. Overall I felt that the day went extremely well, and I was very much interested in the position.\r\nThis was when the already lengthy process got much longer. I was told it would be two weeks until they made a decision, so when two weeks went by and I had not heard from them I checked in. I was told they needed more time. Keeping the door open, I checked in with them every two weeks, typically not receiving a response to my e-mails. The responses I did receive told me to continue checking in. This was until finally, 10 weeks after interviewing on site, and a total of four months after initially applying to the job.\r\nDana-Farber sounded like a terrific place to work while I was there, but when I was not the lack of communication did not make it a disappointment to receive an offer.", "Interview Questions": "If you could create your own hospital, what would it look like?"}], [{"date": "13 May 2013", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA)", "Interview Descriptions": "Good process, clear and fast", "Interview Questions": "N/A"}, {"date": "22 Dec 2013", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in May 2013", "Interview Descriptions": "I went through the following steps: \r\n1. VERY brief phone interview (more of a conversation really), \r\n2. interview with department manager and meeting with a few potential co-workers, \r\n3. Interview with the research nurse, \r\n4. Interview with 2 doctors - the head of clinical research in my disease center and the head of the disease center as a whole, \r\n5. Got a happy call from HR.", "Interview Questions": "Why do you want this job? "}, {"date": "23 Jun 2017", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2013", "Interview Descriptions": "I was chosen after a total of 4 interviews. The first was over the phone. Then I came into meet the hiring manager. Then again to meet with the doctors I would be supporting. The final was to meet with staff I would work closely with.", "Interview Questions": "Why did I choose to apply there?"}, {"date": "27 Mar 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Dana-Farber Cancer Institute in Feb 2013", "Interview Descriptions": "Brief chat with the recruiter, then with a couple physicians. Was asked about my research background and where I want to go after this job. Spoke to other CRCs and heard back within 2 weeks.", "Interview Questions": "How do you function in a group"}, {"date": "14 Feb 2014", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Dana-Farber Cancer Institute in Dec 2012", "Interview Descriptions": "The interview process was pretty traditional. I had a phone screen followed by an in-person interview. They asked basic questions regarding my experiences listed on my resume and my knowledge with research and patient contact/", "Interview Questions": "None"}, {"date": "12 Mar 2012", "title": "Clinical Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2012", "Interview Descriptions": "I had an initial screening with an HR representative, then a follow-up phone interview with the hiring manager. A week or so later, I was asked to give an in person presentation about a recent project I'd worked. It was about 5-7 slides and lasted about 15-25 minutes, with questions. Then I had individual 1:1 interviews with each person from the panel, each lasting about 20-30 minutes. I was asked about project specific work, as well as some personality questions (i.e., do you think you'd fit in here, etc).", "Interview Questions": "Do you think you'd fit in here?"}, {"date": "27 Mar 2012", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2012", "Interview Descriptions": "The phone interview was standard interview questions. Why do you want to do research? Why do you want to work for Dana-Farber Cancer Institute? What are your career goals? Please describe your past research experience. Nothing out of the ordinary.", "Interview Questions": "After the description of the position, the interviewer asked if I had any questions"}, {"date": "19 May 2016", "title": "Research Fellow/Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2012", "Interview Descriptions": "Nothing special for a typical research fellow position. Prior communication with lab head as necessary, come in, private meeting with PI, 1 hr prior-research talk, one-on-one meetings with lab members. Also met with some professors from within DFCI who would be potential collaborators. Lunch/dinner with PI in private the same day. Heard back within a week with offer.", "Interview Questions": "What aspect of our work most excites you?"}, {"date": "12 Jan 2016", "title": "Environmental Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2012", "Interview Descriptions": "I worked as a contracted staff member here and was picked to have an interview for a full time job as a technician.  I was referred highly by my manager here and spent some time with Human Resources to determine what I wanted and where I wanted to go within the business.", "Interview Questions": "What do you like about yourself?"}, {"date": "29 Jun 2015", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Dana-Farber Cancer Institute (Brookline, MA) in Sept 2011", "Interview Descriptions": "It was pretty standard, though it required about three rounds (not including the phone interview). I met with entire team of about 8 people - sometimes individually, other times in groups. Most interviews were pretty average, but a couple were more difficult. I was quizzed on my writing/editing skills, and was put on the spot with a few questions about my understanding of nonprofit development and the department I was applying for.", "Interview Questions": "Describe a difficult situation in your last job and how did you overcome it?"}], [{"date": "14 Jan 2015", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute in Aug 2011", "Interview Descriptions": "Interviewed with the hiring manager than another team member and head of the group. The process was smooth and quick. The interviews were professional and seemed to be well thought out. One of the best processes I've been through.", "Interview Questions": "Rate yourself in these different categories 1-10: oral communication, written communication, job knowledge, personality, interpersonal skills"}, {"date": "12 Mar 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2011", "Interview Descriptions": "I had applied on line and immediately received an email to contact them for a phone interview. On the call we scheduled and interview immediately. I met with the lead pharmacist, then was able to spend plenty of time in the pharmacy getting a feel for what they do and the people, could ask questions and vise versa, then went and met with the HR manager", "Interview Questions": "What skills could I bring to the company"}, {"date": "29 Aug 2012", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jun 2011", "Interview Descriptions": "I sent an email inquiry for opportunity and the PI happened to be interested. So I was called for an phone interview after a few email discussion. Then an onsite interview was scheduled before I was hired.", "Interview Questions": "N/A"}, {"date": "20 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2011", "Interview Descriptions": "There were lots of interviews, phone calls  and follow up emails. It took awhile to get hired but worth the wait. Everyone was very friendly and informative in the process.", "Interview Questions": "N/A"}, {"date": "30 Jan 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2011", "Interview Descriptions": "Initial Contact was per eMail, directly to the supervising PI. The interview consisted of discussions with the PI and meetings with individual members of the group. In addition, a 40min presentation about the PhD project was given with a ensuing discussion. Overall, the interview was very pleasant and felt more like a discussion than a formal interview", "Interview Questions": "presenting work performed in humans, I was asked a lot about mouse models that could mimic the human disease"}, {"date": "30 Dec 2015", "title": "Clinical Administrative Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Jan 2011", "Interview Descriptions": "I interviewed on 5 separate occasions with 9 individuals for my first position with Dana-Farber. I met with each person individually as opposed to a panel-type of style. The interviews were fairly standard, somewhat more casual than I initially expected in terms of the types of questions asked by some.", "Interview Questions": "How would you handle difficult patients?"}, {"date": "5 Dec 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Feb 2010", "Interview Descriptions": "I interviewed with the PI, gave a talk, and then interview with all the members of the lab. The experience was really good.", "Interview Questions": "Any, they were very reasonable"}, {"date": "13 Nov 2013", "title": "Departmental Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Dec 2009", "Interview Descriptions": "I was called in by the department director for a personal interview.  I also met with individual that I would be replacing and training me.  I was given a tour of the department and a lengthy interview.", "Interview Questions": "\"Will you be able to effectively manage the excessive needs of this department while being a single mother?\""}, {"date": "13 Jun 2012", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Dec 2008", "Interview Descriptions": "I was hired within the company so my process will be different than those who are hired from outside of the company. It was laid back but professional and I was told of what the job would entail and since I had all of the qualifications I just had to answer a few questions my previous boss's had. I was referred to this new position by my manager of my other job since she knew I wanted to do more and she wanted me to excel more so she gave my name and next thing you know I got contacted by the new PI. Dana-Farber Cancer Institute is professional but they make you feel relaxed during your interview. They see the best in people and have good judgement on who works there.", "Interview Questions": "Why do you want to switch jobs?"}, {"date": "30 Nov 2012", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Oct 2008", "Interview Descriptions": "The interview was like any other postdoctoral interview: you give a seminar on your previous work, then meet the people of the lab and the PI. You discuss the project you would be working on, potential starting date, etc. Depending on the PI, you will discuss your career plans, which he/she may not agree with (for most PIs in the Harvard community, the only way to go is academia; industry or non-bench careers are, according to them, for losers...). You can get the offer at the end of your interview or it may come later. I never get the chance to negotiate salary or benefits; actually, the PI did not even offer to pay part of the cost of the trip...", "Interview Questions": "What are your career plans. Why this group / Dana-Farber."}], [{"date": "4 Jun 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Dana-Farber Cancer Institute (Boston, MA) in Mar 2008", "Interview Descriptions": "The interview process seemed a little unorganized.  HR and the hiring department did not seem to be on the same page for much of the time.  There wasn't much room for negotiation and there wasn't much flexibility given.  Somewhat understandable given the non-profit nature or the organization, but also difficult because it's hard to attract talent.", "Interview Questions": "What was an example of a challenging project you had to work on, what made it challenging, and what did you do to overcome that challenge?"}]]