[[{"date": "14 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Apr 2023", "Interview Descriptions": "Steady communication in emailing and quick turnaround to my supervisors. They asked general interview questions and required stories of experience/motivation. It is expected that you hold your own but very friendly, kind, and godly!", "Interview Questions": "One thing asked was, “when was a time within your previous experience that you had to solve a problem with another coworker”"}, {"date": "28 Jun 2023", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Dallas Baptist University (Dallas, TX) in Sept 2021", "Interview Descriptions": "This interview was laid back with no pressure. They were hiring student workers, so there was not a high bar set for qualifications and experience. Other interviews for similar jobs have not been this easy, but still nothing too rigorous.", "Interview Questions": "What's your experience in the field"}, {"date": "10 Jun 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Dallas Baptist University (Dallas, TX) in Mar 2021", "Interview Descriptions": "I put in an application. They took months to get back to me. A video interview was scheduled. The interviewer was not very good at questioning. I was not made more confident by the interview process, this is something that I am accustomed to.", "Interview Questions": "Tell us a little about yourself."}, {"date": "5 May 2022", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Jan 2021", "Interview Descriptions": "Past experiences with what have done with photography or videography and the explanation of the position. Basic questions regards to the purpose of work and why I want to get this job and which area I want to grow in", "Interview Questions": "Past experiences with what have done with photography or videography and the explanation of the position. Basic questions regards to the purpose of work and why I want to get this job and which area I want to grow in"}, {"date": "13 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Dec 2020", "Interview Descriptions": "It was easy. I went to career services, got an application, and it was just basic interview questions. What are your best qualities, worst qualities, what do you bring to the team, etc.", "Interview Questions": "What are your 3 best qualities?"}, {"date": "18 Aug 2020", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dallas Baptist University (Dallas, TX) in Apr 2020", "Interview Descriptions": "Short and concise. No personal questions just experience. Supervisor seemed nice. Office was clean and questions were simple. She did ask for my age which I thought was interesting. She also asked for my current salary.", "Interview Questions": "What is one of the best qualities about you. "}, {"date": "29 Aug 2022", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dallas Baptist University in Apr 2019", "Interview Descriptions": "There was an application that I had to fill out and then I had one interview round. The application took a lot of time getting back to me, but once it got through it was pretty quick from there.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Sept 2021", "title": "International Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Dallas Baptist University in Jan 2019", "Interview Descriptions": "ISS leadership was in transition, so I was interviewed by four different people, but they were all very kind and encouraging. It took weeks for me to get through the interviews, but it was worth it.", "Interview Questions": "I was required to \"help a student\" edit their paper as I would with a real international student."}, {"date": "18 Jun 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Jan 2018", "Interview Descriptions": "I met with the assistant director and we discussed expectations and requirements. this was not difficult it was very relaxed and more of a get to know you type of interview.", "Interview Questions": "Do you plan to stay and get your masters? \n\nIf so what in and what are your long term goals? "}, {"date": "6 Jan 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Nov 2017", "Interview Descriptions": "Interviewed with the leadership of the division I was applying for and was asked straightforward questions about my experience in relation to future goals. Answered several questions relating to prior work experience and situational awareness to handle different portions of the job responsibilities assigned to me.", "Interview Questions": "What are your strengths? Weaknesses? "}], [{"date": "9 Aug 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Jun 2017", "Interview Descriptions": "There were multiple interview. These included the assistant dean, dean and provost. Everyone involved was kind and interviews were actually enjoyable. The first time I can say that. The process was fairly lengthy but nothing extraordinarily difficult.", "Interview Questions": "Tell us about your involvement in your church"}, {"date": "23 Mar 2017", "title": "Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Sept 2016", "Interview Descriptions": "Very straightforward interview process. Consisted of one phone interview and a 30 minute in person meeting with the person who would be my highest accessible supervisor. Each asked questions about my personal goals, and prior experiences that make me right for the position.", "Interview Questions": "What was your biggest weakness? "}, {"date": "28 Oct 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Aug 2015", "Interview Descriptions": "Typical honest interview. The interviewer evaluated my resume and seemed to ask questioned based on what I wrote. I waited a couple of days and received a call to come back in where I was then offered the position.", "Interview Questions": "How do you handle stress and pressure?"}, {"date": "9 Apr 2015", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dallas Baptist University (Dallas, TX)", "Interview Descriptions": "Discussed the position with HR, then department head, and finally met with the university president. Personally my hiring occurred quickly, but I did see others take longer. Personality type and cohesion with existing employees was stressed just as much as technical competence, which was nice. Could take a week or two to hear back regarding status between steps, but again my personal experience went a bit quicker than others I witnessed later on.", "Interview Questions": "What are your life passions? What is your relationship with Christ like? etc."}, {"date": "22 Jul 2016", "title": "Cashier's Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Jan 2015", "Interview Descriptions": "The interview was very lengthy, and detailed. I was given speech after speech about how to be successful etc...they really do care about students wellbeing and livelihood. It took around 4 weeks to ever hear back from them though, but I did get a second interview with the VP of finance. The second interview felt like an interrogation of sorts. Overall a long and stressful process but they have to be thorough to hire good and capable people.", "Interview Questions": "They hounded me about keeping my grades up"}, {"date": "5 Dec 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in May 2013", "Interview Descriptions": "Started with direct supervisor, assistant director and head of department. Interview is not very complicated. They ask simple questions. Sometimes personal background, work experience, etc. They are very friendly when you do interview. Setting the interview time might take while. Very good experience with interview.", "Interview Questions": "Do you have any work experience?"}, {"date": "14 Jun 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Dallas Baptist University (Dallas, TX) in Mar 2012", "Interview Descriptions": "Hiring begins when you fill out a standard DBU application. The Information Technology dept. requires students to submit the application, personality test results, class schedule, unofficial transcript, and resume to the Support office. \r\n\r\nI was interviewed by 4 separate staff members over the 4 weeks after my submission.\r\n\r\nThe first interview was with 2 members of Support staff. They were the managers I would be working for if I was hired. It was good to meet them early on and get to know what the job would be like.\r\n\r\nThe second interview was with the associate vice president of the department. He was very relaxed and encouraging. He wanted to know my background and what I enjoyed about school and things of this sort. He was friendly and helped the interview feel stress free.\r\n\r\nThe third and final interview was with the vice president of the department. This was the most difficult interview since he is kind but difficult to read. I was fairly relaxed until he started asking hypothetical questions about my personality test including one question that was phrased as though there was a correct answer.  However the interview went well and I was hired at the close of it.\r\n\r\nI was able to start working the following week after filling out some minimal paperwork for payroll.", "Interview Questions": "I was asked if I would rather read a book or a poem on the last day of my life. It caught me by surprise and I answered a book to the surprise of the vice president who expected teh latter answer due to my personality assessment.  It was a bit discomforting after the interview since the question seemed to imply there was right answer and I had answered book since I am a speed reader and I could read a book in a day without issue."}]]