[[{"date": "5 Apr 2023", "title": "NCS Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Groundwork (London, England) in Apr 2022", "Interview Descriptions": "Very Casual, you get involved in ice breakers and lead one yourself. Act out scenarios and respond to the situations. Health and safety questions, safeguarding. Challenges to control behaviour we acted out too", "Interview Questions": "What experience do you have working with young people?"}, {"date": "20 Oct 2020", "title": "Home Energy Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Groundwork", "Interview Descriptions": "Interview via zoom with two senior members of groundwork south. They were friendly, and asked me straight forward questions. The interview ran over time which was a good sign. It took 3 days for them to contact me and offer the job", "Interview Questions": "Asked me how I had dealt with a safeguarding issue"}, {"date": "31 Mar 2021", "title": "Wave Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Groundwork (London, England) in Oct 2020", "Interview Descriptions": "25-minute interview  where the interviewer asked seven competency questions. Prior to this, I submitted my CV, cover letter and answered four questions as part of an online application regarding my motivation for the role.", "Interview Questions": "Why do you want to become a wave leader?\r\nHow would you deal with a disruptive young person within your group?"}, {"date": "22 Jun 2023", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Groundwork (Liverpool, England) in Mar 2019", "Interview Descriptions": "Application form, will not accept CV Face to face, visit to the centre, tour round Meet the manager, speak to colleagues and participants References and DBS taken up before offer made", "Interview Questions": "What do you know about the project How have you helped someone overcome a barrier How do you engage with hard to reach people"}, {"date": "25 Jul 2018", "title": "Assessor/Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Groundwork in May 2018", "Interview Descriptions": "Poor Planning & Poor Interview. \r\nLocation wasn't confirmed until 24 hours prior to interview. Interviewer was 10 mins late & just read questions from a sheet of paper. Called after 2 weeks for feedback; Left a voicemail, tried again a week later, left another voicemail. Never received a call back. \r\nExpected more from a company who specialise in getting people back in to employment!", "Interview Questions": "'Where would you go to find a group of unemployed people?' "}, {"date": "5 Oct 2020", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Groundwork (Wigan, England) in Apr 2018", "Interview Descriptions": "It was friendly, there were three staff interviewing you but it still felt supportive.  Before the interview, there was an application form, which staff had in front of them throughout the interview.  It was based in their office in Wigan.", "Interview Questions": "Tell us a little bit about yourself. "}, {"date": "29 Sept 2017", "title": "Employability Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Groundwork in Sept 2017", "Interview Descriptions": "The panel was lovely. It was a competency based interview. Questions were very relevant to the role.  Know your stuff abd do your research. A good experience.  I came second...so was dissapointed. However, they said they will keep me in mind for further roles, which is refreshing.", "Interview Questions": "How would you decide which programme is suitable for a candidate?"}, {"date": "10 Apr 2017", "title": "Senior Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Groundwork (Ipswich, England) in Mar 2017", "Interview Descriptions": "Telephone interview, face to face interview one week later.\r\nThe telephone interview followed an initial check on your background and then questions from a checklist of questions that were supplied previously. There was a calm and reassuring approach and plenty of time to answer questions.\r\nThe formal interview was with a panel of 3 and an observer from Change Agents.\r\nI was given a topic previously to present and suggest some actions if I was successful in securing the job which I was asked to deliver initially. I was also given a list of questions to be asked 15 minutes before the interview and provided a quiet area to look at these.\r\nThe interview took approximately 40 minutes and consisted of 8 questions about my skills and experience and how to deal with situations with time for me to ask questions at the end.", "Interview Questions": "What attributes can you offer if you were successful in obtaining the job?"}, {"date": "13 Dec 2021", "title": "Progression Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Groundwork (Coventry, England) in Feb 2017", "Interview Descriptions": "The interview was straight forward and free flowing. It was a 2 person panel interview and questions were asked separately. Overall they made you feel at ease and not too nervous.", "Interview Questions": "Can you tell us about your background"}, {"date": "21 Nov 2016", "title": "Project Support Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Groundwork (London, England) in Oct 2016", "Interview Descriptions": "Applied with a cover letter and CV at the end of September.\r\nHeard back within a week.\r\nAttended interview at London office at the start of October.\r\nInterview involved a short (30 minutes) Excel test - finding information from a database, organising information in a particular way etc - which was followed by the interview itself.", "Interview Questions": "Why do you want to work for Groundwork?"}], [{"date": "13 Feb 2020", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Groundwork in Jan 2016", "Interview Descriptions": "Face to face interview. Formal example based questions. Very professional and friendly environment. Good interviewers with great knowledge and experience of the company and the role. Application sent to the HR department & I was kept fully informed of the process and progress.", "Interview Questions": "What do you know about groundwork "}, {"date": "2 May 2015", "title": "Programmer Manager/Community Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Groundwork (London, England)", "Interview Descriptions": "Informal. There is always a question on policies and procedures, and you'll need to mention health and safety, risk assessments, child safe guarding, photo consent, equalities and diversity, etc etc. it will be likely that there will be a question on project management and managing multiple projects to time and budget, along with a question on experience of community development programmes.", "Interview Questions": "Good questions to capture exactly what the job entails. "}]]