[[{"date": "4 May 2023", "title": "Operations Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ombudsman Services (Warrington, North West England, England) in Apr 2023", "Interview Descriptions": "Recruiter interview, then 'informal call', then assessment day with around 10 others. Was pitched as looking for the culture fit. Long process to not receive an offer. Rather intense day with role play, leadership interviews, competency interviews, presentation. All whole around 15 leaders were assessing you throughout the day.", "Interview Questions": "What is your leadership style"}, {"date": "20 Mar 2023", "title": "Operations Leader Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Ombudsman Services (Warrington, North West England, England) in Mar 2023", "Interview Descriptions": "Very slow process. From the first informal meeting, it took over 3 weeks to be invited to an assessment day. The assessment day really didn't allow candidates to showcase their skills as it was very rushed and seemed unorganised. The moment we arrived no-one seemed to know the log-in details for the WIFI, which was necessary for us to undertake the assessment. Took over 15 mins for someone to find out what they were. Was offered a positon but not at a salary anywhere near what I'm currently on. Also seemed like they use the advertised position to get lots of candidates in and then offer them lower salaries and positions. Spoke to a number of people afterward and they had a similar experience. A little bit of a con.", "Interview Questions": "In the face-to-face interview process, the questions asked were: Give me an example of where you have had to implement policies and procedures? What would you do if you disagreed with a policy? Would you challenge this and how? Have you worked in the regulatory industry?"}, {"date": "16 Jan 2023", "title": "Dispute Resolution Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ombudsman Services (Belfast, Northern Ireland) in Jan 2023", "Interview Descriptions": "2 stage interview process. One with 2 x managers and one with 2 x senior leaders. Was fairly straightforward with quite basic questions. Made to feel relaxed throughout both interviews. The banding for this role was advertised between £25k-£35 with potential up to £40k. When offered the job, it was to my horror, despite disclosing my salary expectations that HR offered me £30k. I have to be honest, I was prepared to take a step back in my career and I would be doubtful there was any more experienced candidates than myself. I was then offered £32k which was still less than my current salary. All in all, a shocking experience. Why advertise a banding if you ain't prepared to max it for standout candidates (something I was described as during the interview process).", "Interview Questions": "Questions about the values Questions about working to targets Questions about working as a team Customer service questions"}, {"date": "21 Jan 2023", "title": "Dispute Resolution Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Ombudsman Services in Aug 2022", "Interview Descriptions": "Interviewed during an assessment centre in August, then was telephoned about 3 weeks later despite being told at the interview I would be called within a week, to be told I had really impressed everyone who’d met me but that due to a change in the way a contract was performing they had no position to offer me but would be in touch within a couple of months when this changed to offer me a job. \n\nThen about 3 months later, the role was being advertised again so I contacted the recruiter who had called me, to ask if I was still being considered for the role but was ignored. I then applied again for the role to be turned down due to the calibre of applicant! At least be professional enough to just turn people down if you don’t want to offer them a job instead of stringing people along and waste their time. Very unprofessional, long winded and disappointing process.", "Interview Questions": "N/A"}, {"date": "15 Aug 2021", "title": "Communications Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ombudsman Services (London, England)", "Interview Descriptions": "Rubbish, nonsensical, and very short. Did not respect the candidates trouble in attending the interview. Did not respond again when they said they would and felt like a disorganised process.", "Interview Questions": "What do you apply for temp?"}, {"date": "9 Feb 2021", "title": "Energy Investigation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Ombudsman Services in Feb 2021", "Interview Descriptions": "Applied online. 1st interview over video call was straight forward with 1 person to understand your work history and to see if you are worth shortlisting. 2nd interview was done by 3 people, again over video call. Questions were about the company, and how your previous experiences could benefit the role. There was a chance to ask questions at the end.", "Interview Questions": "What do you know about the company?"}, {"date": "3 Aug 2021", "title": "Investigators Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Ombudsman Services (London, England) in Sept 2020", "Interview Descriptions": "It was a longer interview process! Clearly taken very seriously! I was successful! But it was a three stage process. The first stage was telephone! Second stage was writing a letter and the third stage was an interview to discuss the letter\r\nYou wrote.", "Interview Questions": "They asked me about my past experience and how it relates to what they need."}, {"date": "15 Mar 2017", "title": "Enquiry Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Ombudsman Services", "Interview Descriptions": "Telephone Interview followed by online test and a face to face interview.\r\nQuestions started around a CV walk through and what skills i had to apply to the role. This then was followed by competency based questions, tell us a time when...\r\nThe interview was very friendly and easy to follow and the team kept me regularly updated. \r\nThe online test was difficult make sure you have a nice quite room to complete this to avoid distractions. \r\nFace to face interview show personality and really sell yourself.", "Interview Questions": "Describe how you deal and communicate with difficult people?"}, {"date": "18 Aug 2017", "title": "Enquiry Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ombudsman Services (Daresbury, England) in Feb 2017", "Interview Descriptions": "Very structured and easy to process through. Telephone interview followed by a skills screening and assessment. Questions were typical to the role and with good preparation reasonably easy to complete. The recruitment team were easy to contact and made the process simple to follow.", "Interview Questions": "How you deal with conflict?"}], [{"date": "13 Mar 2016", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Ombudsman Services (Warrington, North West England, England)", "Interview Descriptions": "Initially applied through an agency getting a call from OS several days later. Very friendly and informative initial chat before being asked to attend a F2F interview that consisted of a technical test before a formal, yet relaxed interview.\nSeveral days later asked to attend another phone interview which again was relaxed and informal.", "Interview Questions": "What word would you use to describe yourself personally ?"}, {"date": "19 Dec 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ombudsman Services (Warrington, North West England, England) in Feb 2015", "Interview Descriptions": "Interviewed by 2 people. Was relaxed, not 'corporate', so a little bit surprised to discover how corporate it was when I started.  Interviewer mainly went through cv and chatted about my past experience", "Interview Questions": "N/A"}, {"date": "12 Aug 2015", "title": "Investigation Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Ombudsman Services (Warrington, North West England, England) in Aug 2014", "Interview Descriptions": "Attend the company premises and was interviewed by two people. They asked for several examples of what I had done and was advised of what the role entailed. Other than than what was on the company website I new very little, however the website was informative.", "Interview Questions": "What do you know about the company?"}, {"date": "1 Dec 2017", "title": "Learning and Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Ombudsman Services (Warrington, North West England, England) in Mar 2013", "Interview Descriptions": "A lengthy two page written document as to why I was suitable for the job, followed by a 20 minute training delivery session on a topic of my choosing and then an hour long interview", "Interview Questions": "Why was I suitable for the role?"}]]