[[{"date": "3 Feb 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy College", "Interview Descriptions": "Zoom platform, convenient and not longer than an hour. EXPERIENCE IS NECESSARY be confident and prepared for the interview.  Behavioral questions may also be asked. I only had one interview.", "Interview Questions": "Tell me about your experience and hows it fit the current role?"}, {"date": "20 Apr 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy College (Dobbs Ferry, NY) in Aug 2021", "Interview Descriptions": "The interview process went well until they became vague at the end and did not update me on what their timeline was for hiring. I drove five hours for an in person interview all for them to not have the decency to notify me about when they were planning to make a decision. They never got back to me after this interview.", "Interview Questions": "What ideas do you have for outreach initiatives?"}, {"date": "19 Mar 2021", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy College", "Interview Descriptions": "There were initially 3-4 rounds of interviews, one with the Director, another with students  and another within the college community. It was very straightforward and much needed to invest in the best candidate that they needed.", "Interview Questions": "Do you have any experience working in a residence hall community "}, {"date": "11 Jan 2021", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy College", "Interview Descriptions": "Great, formal and professional.  Overall not a bad process and it was a great higher ed. start for anyone interested in higher ed. There is not much more to say.", "Interview Questions": "Tell me about yourself and your interest in the role. "}, {"date": "15 Mar 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy College", "Interview Descriptions": "This institution is a for profit school masquerading as a private institution. It was a great interview; I enjoyed the time I spent with the individuals who interviewed me. However, they were putting on airs about what the job was and what they were selling in terms of the position. I had read glassdoor prior to applying for the job so I went into the interview knowing what to expect. It is all about numbers with Mercy, they do not care about the quality of students. It is all about the quantity, they want/expect you to be beyond flexible with your schedule. I was told the position would be 9-5, they informed me I would need to do weekends and sometimes adjust my schedule to work at least 2-3 days a week hours such as 12-8. The admissions department is out of control; they are running that department as if it was a business. They have over 40 employees in the department who all come from a business background with no higher education knowledge or experience. It is a group think mentality, it’s all about meeting your numbers. During the interview they also indirectly asked me if I had other applications out, and if I was interviewing with other institutions. They wanted to make sure that they were going with a candidate that was going to commit to Mercy because individuals have accepted in the past went through training and then left because they received another offer. If you want to work in higher education I would stay away from this school, they are a for profit school. As well, you would be reporting to assistant directors who have little to no experience in higher education and  were only hired because of nepotism. I have yet to hear back from Mercy on the position.", "Interview Questions": "Why do you want to work for Mercy?\r\n"}, {"date": "20 Feb 2018", "title": "Student Affairs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy College", "Interview Descriptions": "I participated in phone interview and then skype interview. I was offered a skype interview because I lived on the other side of the country. I appreciated their flexibility. For the skype interview, I was asked questions by both my manager and the VP of Student Affairs. The overall experience was very positive, and they asked targeted questions that sought to identify my goals and whether I would be a good fit for the college. The college highly values their mission. It was very important to depict how I would fit into the mission.", "Interview Questions": "If we were working together a year from now, what is something we will have accomplished together? "}, {"date": "9 Dec 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Mercy College (New York, NY) in Jan 2018", "Interview Descriptions": "It was a one step interview. I was noticed through the Turbo program. It was a face to face interview with the school of business dean and some potential coworkers. More conversational interview setting with some formal questions.", "Interview Questions": "Tell me about your past work experience. What is your experience with Microsoft office. "}, {"date": "10 Nov 2017", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mercy College in Nov 2017", "Interview Descriptions": "I was called by a member of the team where she told me more about the position and asked to set up a phone interview. One was scheduled however when it came time for the interview I sat waiting for a call. 15 minutes later I reached out the the person who initially contacted me and left a message as there was no answer. It is now two weeks and several phone calls later and I have still not heard a word from Mercy College.", "Interview Questions": "Never had any questions due to not having an interview "}, {"date": "7 Aug 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Mercy College (Dobbs Ferry, NY) in Aug 2017", "Interview Descriptions": "Spoke with Dean and her assistant. They were extremely pleasant and welcoming which helped calm my nerves. After a while, we just began talking about my traveling and what inspires me.", "Interview Questions": "What did you think you can offer the school/department?"}, {"date": "20 Mar 2017", "title": "Adjunct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy College", "Interview Descriptions": "Not much of an interview.  I met with several faculty members and was asked several questions about my experience and teaching philosophy.  I was informed that I would receive a call if they were interested.  They called back several hours later.", "Interview Questions": "What is your teaching experience?"}], [{"date": "27 Aug 2018", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Mercy College in Sept 2016", "Interview Descriptions": "I met with 2 different people and then a group of executives at different times over a 3 month period.  Very long but easy going process. I was not able to begin until my BS degree was complete due to their policy. Very low salary offer bu tuition remission offered after only 3 months of employment", "Interview Questions": "Why did you apply for this job?"}, {"date": "26 Jun 2016", "title": "PACT Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Mercy College", "Interview Descriptions": "First interview with the Associate and Assistant Director of PACT. Second interview with the Dean of student affairs. Interview was set up where it felt more like a conversation than just answer a list of questions.", "Interview Questions": "What are some trends in higher education that you are passionate about?"}, {"date": "24 Aug 2017", "title": "PACT Cousnelor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mercy College (Dobbs Ferry, NY) in Jun 2016", "Interview Descriptions": "Met with a few of the current employees. They ask questions about your background and give you a description of the job. Very informal to a certain extent, we all sat in a conference room. The interview did not last very long. Had a follow-up interview with upper management before receiving an offer.", "Interview Questions": "Why do you want to work at Mercy with students?"}, {"date": "4 Sept 2017", "title": "Admissions Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy College (Dobbs Ferry, NY) in Apr 2016", "Interview Descriptions": "I applied online and the process took about a month in total. I had my phone interview set up with the front desk person, and then I was called in for an in person interview at Mercy College (Dobbs Ferry). They were about 30 minutes late to my in person interview.", "Interview Questions": "Why do you want to work at Mercy College?"}, {"date": "25 Aug 2015", "title": "Admission Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy College", "Interview Descriptions": "Their process was quick. Heard back within two weeks of applying online. Had two phone interviews. first was an initial meeting. The second they basically offered the position but wanted me to know up front that the salary was low, which ultimately made me not proceed.", "Interview Questions": "How did you find this position? "}, {"date": "30 Jun 2015", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy College", "Interview Descriptions": "Absolutely horrendous. The entire interview process was a joke. Between having both of my skype interviews rescheduled last minute (literally minutes before my interview), and having each interview barely last 15 minutes the entire process just seemed extremely unprofessional. The actual interview was easy, but dealing with the organization was frustrating. I ended up taking off for the interviews and then they ended up having to reschedule.", "Interview Questions": "\"Why do you want to work in Admissions?\"\r\n\"Why do you want to work at Mercy College?\"\r\n\"Would you be comfortable driving around to different High Schools recruiting students?\"\r\n\"What do you think the most challenging aspect of this position would be for you?\""}, {"date": "2 Oct 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Mercy College (New York, NY) in Jun 2015", "Interview Descriptions": "application form, followed up by HR phonecall for availability etc, initial interview by HR for 30 minutes plus testing for one hour, followed by 2nd interview that was 30 minutes", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jun 2015", "title": "PACT Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy College (Dobbs Ferry, NY) in May 2015", "Interview Descriptions": "Went to the main campus. Interviewed with two Assistants and then two Directors. The Assistants stuck to the script and asked the questions on their list. They were very direct and stern. Waited for about a half an hour for the interview with the Directors which was more conversational and genuine.", "Interview Questions": "Tell me about yourself.\r\nWhat is a project that you completed that you are proud about?\r\nA higher education trend that you are passionate about?\r\nWhat are the top needs for first generation college students?\r\nA time when you had a disagreement with your co-workers or working a part of a team\r\nHow much are you looking for as a salary? ..job pays 35,000 are you ok with that?"}, {"date": "28 Mar 2015", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy College", "Interview Descriptions": "HR scheduled my first interview incorrectly and had to cancel day before, which I took off from work for. Never left voicemail for me about this. Had to call the morn of. Interviewer seemed very unorganized, disrespectful, and unprofessional. I declined the offer after researching on Glassdoor.", "Interview Questions": "My experience in the field, one character quality I would use to describe myself, etc"}, {"date": "5 Feb 2015", "title": "Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy College (Dobbs Ferry, NY)", "Interview Descriptions": "No assistance with travel to and from the on-campus interview. No offer to cover *any* costs, no pick-up at the entrance or escort to the exit, not even a map to assist with directions. All interview-related payment & planning done entirely by me, the candidate.", "Interview Questions": "During the brief interview with the Dean, she asked me directly about my salary expectations. Although money was not what I had intended to discuss, I answered with my best estimate of the average academic salary in my field. Her response? \"We can't afford you.\""}], [{"date": "1 Jul 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy College (Bronx, NY) in Jan 2015", "Interview Descriptions": "It was a fairly easy interview. They didnt ask any tough questions. The interview didn't feel scripted. It was super laid back and felt more like a conversation with a friend. However, I left feeling unsure until I got the email with the offer.", "Interview Questions": "What are your strengths & weaknesses"}, {"date": "21 Jan 2014", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Mercy College (Dobbs Ferry, NY) in Sept 2013", "Interview Descriptions": "Human Resources Dept. had no idea this position needed filling; online application form was an illogical, antiquated nightmare, suitable only for those who stayed in the same job or same kind of job for years at a time--like in the 1950s! There was no way to include other kinds of information, & they won't accept paper. Submitting CV to them was useless. I contacted academic departments directly & got 3 positive responses! Interviewed on Friday, started teaching Tuesday, with not enough information.", "Interview Questions": "N/A"}, {"date": "24 Jun 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy College (New York, NY) in Sept 2013", "Interview Descriptions": "Email correspondance, meeting, large delay in being hired... as I had many other options to teach courses. There was no introduction to the chair of the department, I was being interviewed by a math professor. This seemed quite strange, and only later did I see that dozens were hired as adjuncts-- just for a semester or so. The posting for the job has remained on several sites since the hiring of all these professionals, and this is very strange and disrespectful.", "Interview Questions": "What was your background in writing"}, {"date": "24 Feb 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy College (Dobbs Ferry, NY) in Aug 2012", "Interview Descriptions": "Submitted resume, and got a call. Initial interview conducted over the phone.  Follow-up interview with dean was face to face.", "Interview Questions": "None. "}, {"date": "26 Jun 2014", "title": "Admissions Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy College (Dobbs Ferry, NY) in Jul 2012", "Interview Descriptions": "Sent the application and got called after one week for a 2-to-1 interview. They wanted to make sure I was an outgoing and well spoken person, and whether I would have been able to provide detailed and accurate information to students and establish a strong bond with them.", "Interview Questions": "The questions I was asked were behavioral and not technical. Overall the interview process was easy."}]]