[[{"date": "N/A", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Versiti", "Interview Descriptions": "I applied online and in about a week I received a call and had a phone interview shortly after I set up an in-person interview. The interview process was not hard, was asked questions about certain situations", "Interview Questions": "Tell me about a time there was something you didn't agree with at work and how you handled it"}, {"date": "10 May 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Versiti (Grand Rapids, MI)", "Interview Descriptions": "The first interview was pretty quick and easy, after about 30 minutes they tell you if you advance to the next level or not. The second interview was pretty lengthy I interviewed with 3 people its pretty relaxed and I found out the same day that I got the job.", "Interview Questions": "They ask a lot of past experience questions."}, {"date": "28 Jun 2023", "title": "Technical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Versiti (Indianapolis, IN) in Apr 2023", "Interview Descriptions": "Participated in three interviews for a writing position. I was never asked for writing samples (the purpose of the job). Once, I was interviewing for the last round, two retired, and returned-to-work ladies made fun of my previous work experience. They made jokes and mocked my prior experience stating that hopefully someone \"would give me a chance.\" This lead me to feel completely judged for my age and disregarded as a professional. I received a do-not-reply email informing me I didn't get the job. This was impersonal and I would never work here after this experience.", "Interview Questions": "Do you use Microsoft Word?"}, {"date": "14 May 2023", "title": "Summer Intership Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Versiti (Milwaukee, WI) in Feb 2023", "Interview Descriptions": "Quick and Brief. Spent about thirty minutes asking questions. We had the interview process over zoom since the job was going to be remote. They were very kind and straight forward.", "Interview Questions": "How did you resolved a conflict with a coworker?"}, {"date": "24 Aug 2022", "title": "Accounting Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Versiti", "Interview Descriptions": "It was generic, I talked to staff from both the finance and accounting departments. Overall just the common questions, except one trickier. Wasn't difficult but need a good reaction to some uncommon questions.", "Interview Questions": "how many golf balls can fit into a bus? "}, {"date": "19 Apr 2022", "title": "Blood Processing Specialist  Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Versiti (Milwaukee, WI) in Apr 2022", "Interview Descriptions": "It was a phone interview.  The person asked me a lot of questions about organization, teamwork, and flexibility. The interviewer was very professional and helped me with clarifying the questions. I wasn't prepared so I did not get the job.", "Interview Questions": "\"Tell us about a time you had a technical disagreement with a co-worker. How was it resolved?\"'\n\n\"Describe a time you went above and beyond at work for a customer.\"\n\n\"What’s a Time You Disagreed With a Decision That Was Made at Work?\"\n\nSome question about organization and being detail-orientated."}, {"date": "11 May 2022", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Versiti (Grand Rapids, MI) in Mar 2022", "Interview Descriptions": "Very fast interview, pretty simple questions. They offer job shadows and there was seemingly a lot of room for growth within the company. The interview included a phone interview and then moving on to the hiring manager interview over zoom and then a job shadow. Which followed a job offer.", "Interview Questions": "Why would you be a good fit to work at versiti?"}, {"date": "20 Apr 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Versiti in Mar 2022", "Interview Descriptions": "Applied online. Quickly had a recruiter interview and then a follow-up interview. The recruiter was pretty brash. Basically, the entire interview was her stating \"ok but have you ever done this skill\" followed by me stating that I had, reiterating what was in my application and then giving further details. The hiring manager interview was just as uncomfortable. I seriously felt like she just had an argument with someone before and took it out on me. Imagine a ticked off teen skyping with their parents. That was the feeling. So awkward. Can not recommend.", "Interview Questions": "What are your long-term career goals? "}, {"date": "19 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Versiti in Mar 2022", "Interview Descriptions": "Interview was quick and relaxed! You meet and interview with 5 different people, and one of those meeting is to meet the team that you would be working with.  They were very flexible and made you feel comfortable throughout the whole process.", "Interview Questions": "How did you resolve a conflict in a previous job?"}, {"date": "28 Jan 2022", "title": "Sales Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Versiti", "Interview Descriptions": "Really nice hiring manager! I thought it was a good opportunity, but wasn't right for me at the time.  She was warm to me and expressed that she wanted me for the job.", "Interview Questions": "What's your goals with this position?"}], [{"date": "14 Dec 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Versiti", "Interview Descriptions": "super unprofessional. I scheduled a phone interview with their talent acquisition, who failed to call me at our time. when I expressed concern, I received a new invite for an hour later without acknowledgment of the missed interview and without asking me my availability (which was not then since I had class after what was supposed to my original interview time). we rescheduled for later in the week, interviewer seemed to not know much about the job I was interviewing for and was rushing our conversation. pay was only going to be $12/hour for a graduate level internship. just very unprofessional and would not recommend.", "Interview Questions": "tell me about your resume"}, {"date": "19 Nov 2020", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Versiti", "Interview Descriptions": "The interview process was quick. They were nice but seemed impersonal. Seemed like they wanted to rush through the process as fast as possible, not sure why. It was okay.", "Interview Questions": "Why do you want to work for them?"}, {"date": "23 Nov 2020", "title": "Facilities Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Versiti in Nov 2020", "Interview Descriptions": "After receiving a email request for interview, I scheduled a phone screen using a link within the email. The interviewer called late due to another interview lasting longer than the scheduled time. The phone screen lasted approximately 10 minutes.", "Interview Questions": "What attracted you to this job?"}, {"date": "18 Apr 2020", "title": "Digital Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Versiti", "Interview Descriptions": "I applied online and had a phone screen, then was invited to interview with the hiring manager and her boss. \r\n\r\nThe interview was okay. The job description was different every time I talked to someone. What was posted was not what they were looking for. The phone screen alluded to that, but it became clear in the in-person interview that they had changed what they wanted after posting the job. (However, I was still qualified, albeit less excited about the position and concerned about the shifting job description.) \r\n\r\nAnd then I was ghosted. After that interview, I was never contacted by any of the three people I had contact with (HR phone screen + 2 interviewers).", "Interview Questions": "Nothing unusual -- general questions about experience and software/technology I've worked with."}, {"date": "5 Dec 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Versiti", "Interview Descriptions": "It was around a 30 min in person interview. The most confusing part was figuring out the entrance for the downtown Milwaukee location.  The people there were very nice but closed off.", "Interview Questions": "Why did you pick your major/university?"}, {"date": "18 Dec 2019", "title": "Supervisor Donor Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Versiti in Dec 2019", "Interview Descriptions": "Very smooth and timely process! Was called the same day I submitted an application to schedule a phone interview. Interviewer was friendly and followed up promptly. On-site interview was great, but difficult. In front of a panel and needed to do a presentation. After that, was invited to job shadow to ensure the position was for both me and the company. Received an offer that same day!", "Interview Questions": "What is the vision of Versiti?"}, {"date": "25 Nov 2019", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Versiti", "Interview Descriptions": "1 phone interview, 1 in person interview with a blood center supervisor. Basic questions about what my future goals are, why I want to work there, how would I describe myself, how well do I work on a team, and then a few questions on situations and how you would respond.", "Interview Questions": "Have you had any traffic violation is the past 3 years? "}, {"date": "17 Nov 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Versiti", "Interview Descriptions": "Phone call interview first, then interview on job site. Very easy questions and very nice person who interviewed me over the phone. Overall a very great experience so far, I wouldn’t complain.", "Interview Questions": "Describe a time when a co-worker was upset with me and I had to resolve the issue. "}, {"date": "13 Jan 2020", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Versiti (Indianapolis, IN) in Nov 2019", "Interview Descriptions": "The hiring process was very smooth.  The recruiter was very thorough and made sure the position was going to be a good match for both Versiti and myself.   During the 1:1 interviews, I was able to interact with the executives with ease.", "Interview Questions": "What was my ability to achieve success assisting at the executive level?"}, {"date": "15 Nov 2019", "title": "Regional Donor Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Versiti (Indianapolis, IN) in Oct 2019", "Interview Descriptions": "Web interview held after a phone screen interview.  This was conducted with two staff from Versiti in conjunction with the Talent Attraction Specialist.   The initial phone interview was around 45 minutes.  The second interview was a scheduled 45 minute web interview.  The followup was consistent and timely.", "Interview Questions": "How would you describe your management style?"}], [{"date": "12 Sept 2019", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Versiti", "Interview Descriptions": "Interview  was Simple and quick with your standard interview questions. Be open and honest and you’ll be perfectly fine. I didn’t find the questions difficult to answer at all.", "Interview Questions": "Why do you feel you’re a good candidate"}, {"date": "18 Feb 2019", "title": "Lead Customer Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Versiti (Aurora, IL) in Jan 2019", "Interview Descriptions": "Brief interview,general questions in regards to previous work history.Expectations for the positions,”retail hours” (10am-8pm & weekends) \nDescription for this position was more inbound calls VS outbound calls \nCompensations was brought up by interviewer  13.50/hr as a lead.Interviewer mentioned it was a steady consistent job,anyone looking for job security and is ok with compensation amount would be a great fit", "Interview Questions": "Hours are 10am-8pm with rotating weekend shifts,is that something you are ok with ?"}, {"date": "2 Dec 2019", "title": "Cerified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Versiti (Milwaukee, WI) in Dec 2018", "Interview Descriptions": "It was an very easy interview. I was basically asked about my other job experiences, my education background, and also my driving record. They also asked questions as far as how would I handle certain situations at the job.", "Interview Questions": "What would you be most successful at while working at versiti?"}, {"date": "11 Jan 2019", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Versiti (Gobles, MI) in Nov 2018", "Interview Descriptions": "First, there is is phone interview, then a one on one in person interview. After that, you should receive a phone call within a week after the second interview, to let you know that you are hired. At least, that is how it is SUPPOSED to be. There is zero communication with anyone that you converse with. The phone call interview told me that I’ve passed and will receive an email for the next process. No email came. I had to call Michigan Blood multiple times for over a week until I finally got an email denying the second interview when I was told I was moving forward. Once again, another 5+ phone calls and I finally was able to get a one on one interview. The one who interviewed me also told me I was an amazing candidate and that I should receive a phone call letting me know when I start. Never heard from anyone again! Numerous phone calls and emails later, the email that was initially sent to me denying my second interview was resent to me as if I never got my second interview! The process with talking to people at the home base in Wisconsin as well as the other branches in Michigan is absolutely disastrous and unprofessional. It’s clear they do not care about their possible candidates regardless of how many spam notifications I receive from the three job searching apps I use. If you’re looking for a blood drive to work for, this one should be at the bottom of your list.", "Interview Questions": "Describe what you would do if you and another coworker had a disagreement."}, {"date": "17 Oct 2018", "title": "Human Resources Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Versiti (Aurora, IL) in Oct 2018", "Interview Descriptions": "I had a 10 am appointment with the only remaining HR person in the department. She kept me waiting as she struggled to put in employee hours for payroll. She seemed stressed out and told me both the HR Partner and Generalist left after the merger. She didn’t make eye contact me with almost as she seemed defeated in her position. I actually felt sorry for her. The culture seems like a hot mess with the merger.", "Interview Questions": "She read off a list off redundant questions that were asked in the 80s"}, {"date": "30 Aug 2018", "title": "Production Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Versiti", "Interview Descriptions": "HR will first contact one for a phone interview screening process and then again if they wish to set up an interview with a potential supervisor. A supervisor will then interview one for about 30min. and then take one on a tour of where they might potentially be working.", "Interview Questions": "Describe a time where no matter what you did you could not please a customer?"}, {"date": "9 Oct 2017", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Versiti (Milwaukee, WI) in Mar 2017", "Interview Descriptions": "Online application process, phone screen with talent acquisition, in person interview with the director.   Didn't have any issue with the interview process or questions asked, but never heard anything back one way or the other.  Having done recruitment for a decade and knowing that a regret letter is nothing more than clicking on a box to generate a form letter, it is a poor reflection on the Blood Center when a candidate takes the time to apply, complete a phone screen and then come in to interview, the organization doesn't follow through with a click to send that candidate a regret letter.  With an applicant tracking system, which clearly they have, that should never happen.  It makes the organization look disorganized and lack a general ability to communicate.", "Interview Questions": "Behavioral interview questions.  Tell me about the most complicated employee relations issue you have ever dealt with in your career."}, {"date": "27 Dec 2016", "title": "Phlebotomist/Blood Collection Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Versiti (Indianapolis, IN) in Dec 2016", "Interview Descriptions": "The interview was great. She was very kind and straightforward. She told me about the company and their valves. she told what department or area I will be working with. Which was the mobile truck going to blood drives with different companies. and the hours vary with each blood drive. you will get your schedule three weeks in a advance after you are finished training which can last up to 90 days. the interview took less than thirty minutes.", "Interview Questions": "We have some times long hours because of the company and their hours and shifts. sometimes you can start as early a 4 am and sometimes stay as late as 11 pm. Are you comfortable with that?"}, {"date": "13 Sept 2016", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Versiti (Milwaukee, WI)", "Interview Descriptions": "Long hiring process, applied several times finally got an interview, one was on the phone then with supervisor, supervisor was nice explained the position and was off track for a moment", "Interview Questions": "Are you ok with varied hours?"}, {"date": "23 Aug 2016", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Versiti (West Bend, WI)", "Interview Descriptions": "Very good interview they ask alot of questions regarding experience and outcome of situations I did an over the phone interview and a group interview.  Staff was very nice and easy to talk to made me feel welcome and wanted for the position", "Interview Questions": "What was a time you had a hard time with a client?"}], [{"date": "29 Jun 2016", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Versiti", "Interview Descriptions": "Behavioral interview with HR, the lab director, and a lab tech. The interview was about 30-60 min long, and a second interview was to follow. Instead, they called me the next day and offered the position over the phone, followed by an official offer by email. The overall interview was relatively laid back in nature.", "Interview Questions": "Tell us about yourself; how does your background fit with this company?"}, {"date": "11 Mar 2016", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Versiti", "Interview Descriptions": "straight forward, 3-20 min or so interviews but that will vary per which position you apply. Hr does an initial screen and if it looks good than the team for the position  will bring you in to do an in person interview. You will probably talk to the PI, and HR person and maybe another coordinator or research scientist.", "Interview Questions": "research experiance?"}, {"date": "10 Sept 2016", "title": "Marketing & Customer Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Versiti (Milwaukee, WI) in Jan 2016", "Interview Descriptions": "Phone screen followed by an in person interview with three people. The office was crowded and cramped with moving boxes. Very old fashioned facility and very behind the times with technology and ways to interact with donors. No one offered me water even though I was there for 3-4 hours. Very strange.", "Interview Questions": "Tell me about a time you brought new ideas to an organization. "}, {"date": "11 Nov 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Versiti", "Interview Descriptions": "Interviewed with Director and two supervisors, it took about an hour and then had an additional interview with one lady in HR it only took about 15 minutes. They called me a week later and offered me the position.", "Interview Questions": "How doo you handle stressful situations?"}, {"date": "6 Jul 2016", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Versiti (Milwaukee, WI) in Jun 2015", "Interview Descriptions": "I interview with several faculty.  We talked about my past research, what I wanted to do in the future.  They generally talk about the projects that they are working on.", "Interview Questions": "Most of the interview was them talking about their research.  They also asked for me to tell them about myself."}]]