[[{"date": "14 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Holy Cross Hospital Fort Lauderdale", "Interview Descriptions": "Don’t forget to bring resumes, you will be interred by the nurse managers and leads on that particular unit. Everyone was very kind and open about what the day to day consisted of on the floor.", "Interview Questions": "Why do you want to be apart of Holy cross? "}, {"date": "2 Jun 2022", "title": "New RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Holy Cross Hospital Fort Lauderdale", "Interview Descriptions": "Was quickly roped in to the interview process by promising to interview for a highly liked unit,  only to find out when arriving at the interview \"new grads don't get spots there.\" And subsequently offered to interview for MS floor.", "Interview Questions": "I declined to interview with this unit."}, {"date": "29 Mar 2022", "title": "Nurse residency CVICU Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Mar 2022", "Interview Descriptions": "Phone interview with a recruiter that lasted about twenty min. The recruiter asked general questions to determine whether she wanted to schedule a meeting with floor managers. The offer situation yet to be determined after April 1st interview. I am doing this review for the ability to access the Glassdoor website . ", "Interview Questions": "3 areas I fell strong about in myslef. "}, {"date": "24 Mar 2021", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL)", "Interview Descriptions": "Easy going first shift supervisor and manager asked a few questions. It was in a small office upstairs. Hiring manager made the process easy. I got a call back quick and they were readily available when i had questions.", "Interview Questions": "Tell us about your self\nHow do you communicate with others"}, {"date": "8 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Holy Cross Hospital Fort Lauderdale", "Interview Descriptions": "Very organized interview.. full of questions.. Received the offer with HR the same day.. Not much more to say.. interview process was very simple.. Didn’t have to go through multiple panels", "Interview Questions": "What can you contribute to patient care and safety on this unit?"}, {"date": "4 Dec 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Hospital Fort Lauderdale", "Interview Descriptions": "Very friendly and comfortable. No compliments. Loved the atmosphere working in this hospital. I can tell I will be working here for a while. And possibly apply to any other position offered.", "Interview Questions": "please look online for interview questions.  "}, {"date": "12 Jul 2019", "title": "Charge Entry Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL)", "Interview Descriptions": "I was called by the hiring manager and interview was set up.  Asked me some questions and proceeded to offer me a the job and salary.  Stared about a month later.  HR was very disorganized", "Interview Questions": "Why do you think you are qualified for this position?”"}, {"date": "8 Apr 2019", "title": "Patient Access Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Holy Cross Hospital Fort Lauderdale", "Interview Descriptions": "Submitted application via website.   Two weeks later had a phone interview with a follow up in person interview with the Director of Patient Access.  Was offered the position one weeks later", "Interview Questions": "Tell me what makes you different"}, {"date": "1 Mar 2018", "title": "PBX Operator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Mar 2018", "Interview Descriptions": "Absolutely amazing! Everyone was welcoming and Curteous. Even the valet guy welcomed me and prayed that I would have a great interview. An amazing experience that I’ve never had at an interview before.", "Interview Questions": "N/A"}, {"date": "14 Apr 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Holy Cross Hospital Fort Lauderdale in Mar 2017", "Interview Descriptions": "The it interview process was very Streamlined and efficient. The culture of holy Cross was reflected in the interview process in that it wasn’t meant to scare or intimidate you, just to find if you are a good fit for the holy Cross family.", "Interview Questions": "What caused you part ways with your last job?"}], [{"date": "31 Aug 2021", "title": "Staff Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Feb 2017", "Interview Descriptions": "Informative  and collaborative versus adversarial. Started with an HR interview. Once you pass that screen the next interview is with the Director, area supervisor and some staff members. Offer was given at the interview.", "Interview Questions": "Why have you changed jobs frequently. Why do you want to leave your current job"}, {"date": "3 Mar 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL)", "Interview Descriptions": "I was interviewed with dept manager/director and 3 technologists. I was later told that they have only interviewed 3 other people this way. Techs should NOT be part of the interview process.", "Interview Questions": "Technique, positioning, OR\r\nPersonal questions (very inappropriate)"}, {"date": "1 Sept 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Mar 2016", "Interview Descriptions": "the interview process was very through and self epxplantirory. it was very easy and fast however the hireing process was very long.  there was nothing really to it, but i got an offer on the spot so that was good.", "Interview Questions": "explain to me one time you expierenced a mad customer"}, {"date": "2 Oct 2016", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Hospital Fort Lauderdale in Jul 2015", "Interview Descriptions": "I interviewed with HR then was called back to interview with the the manager. The interview only took about 5-10 mins the most. The manager only asked me one question, which should of been a red flag. He then proceeded to showing me around. As he showed me around he went on to saying well try to not to get into any gossip. I thought that was kind of odd but it was also a red flag.", "Interview Questions": "can't remember the question that was asked"}, {"date": "28 Nov 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Holy Cross Hospital Fort Lauderdale (Miami, FL) in Apr 2015", "Interview Descriptions": "First you will have an one to one  interview with a recruiter and there you submit all required documents.They will ask work experience and general questions.On that spot they tell you how much you will get paid.  After that you will have an interview  with a unit nurse manager and some other nurse staffs.", "Interview Questions": "What is your personal strength and weakness?\r\nWhy did you  apply for this position?\r\nWhat would you do if you... type of question"}, {"date": "28 Aug 2017", "title": "Staffing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Jan 2015", "Interview Descriptions": "HR asked basic questions then sends you across the street to interview with the hiring manager.  From there, the manager breaks down what the job entails and to see if you're able to handle being berated by upwards to 12 people, who are out-ranking, saying that they need more staff.", "Interview Questions": "How do you handle non-stop stressful situations?"}, {"date": "4 Jun 2014", "title": "Environmental Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Jun 2014", "Interview Descriptions": "Initial Interview was easy, typical questions about your previous employment history and asking about your personality and future goals. Had a second interview immediately with the hiring manager where he did the majority of the talking basically explaining the job in detail", "Interview Questions": "Describe A Time You Went Above And Beyond To Achieve Something?"}, {"date": "25 May 2018", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Mar 2014", "Interview Descriptions": "In person interview process with HR rep after applying electronically, was called back within two weeks for followup interview with office manager and office coordinator. Background check and Drug screening performed.The entire process took about 2-3 weeks.", "Interview Questions": "Tell us about a time you provided excellent customer service?\r\nWhat can you tell us about Holy-Cross?\r\nWhy do you want to work here?"}, {"date": "30 Dec 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Holy Cross Hospital Fort Lauderdale", "Interview Descriptions": "The nurse recruiter was awesome. Made you feel relaxed didn't even know I was being interviewed", "Interview Questions": "Give examples of when you were a patients advocate but had to defy a drs order"}, {"date": "2 Aug 2016", "title": "Materials Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Nov 2013", "Interview Descriptions": "GREAT! They asked me about my previous experience. They wanted to know how effective my communication was and if i would be able to keep time management. I smiled a lot and was sincere.", "Interview Questions": "What would i do if i disagreed with an employee."}], [{"date": "11 Aug 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Feb 2011", "Interview Descriptions": "It was relaxing and educational process which I was able to discuss openly about my skills and learn about the organization. I was giving a tour of the department I would be working. I was explained the benefits.", "Interview Questions": "I was asked my experience and my future goal with the organization."}, {"date": "30 Jan 2012", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Holy Cross Hospital Fort Lauderdale (Fort Lauderdale, FL) in Apr 2010", "Interview Descriptions": "I applied online and received an email from HR requesting a phone interview. The phone interview with HR lasted approximately 20 minutes and I was then scheduled for a phone interview with the VP. That phone interview lasted approximately one half-hour. I was then invited to come in for personal interviews the following week. I met with the VP once more and had a subsequent interview with another financial analyst. I was also given a computer skills test.\r\nOverall, I had a mixed experience with the interview process. On the one hand, kudos for their responsiveness and communication throughout the whole interview process. They will not waste their time or yours and will keep you well informed. On the other hand, in the Finance Dept, they were very serious and stoic and that could be intimidating. Specifically in my case, once I got to the real details of my what my day to day work would be, I knew this was not right for me...but they knew it too, and no time was wasted.\r\nOne last note and my only complaint: A computer skills test should be done on a computer, not on printouts.", "Interview Questions": "Why do you want to work for Holy Cross Hospital?"}]]