[[{"date": "23 May 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Great! They asked very reasonable questions and were very kind during the interview. I appreciated that they asked about my strengths, weaknesses, and personality. The interview went smoothly for the HRS student.", "Interview Questions": "When is a time you struggled? Can you name a time where you ethics came into the workplace?"}, {"date": "14 Apr 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Interview was productive and not too long. The questions were mainly about my future and how I may act in certain situations. I thought the process was not only needed, but beneficial for my future growth.", "Interview Questions": "Share a time where you had to use conflict-resolution."}, {"date": "5 Apr 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Ohio State has the standard interview process for physics grad schools. You submit an application and if you are approved, there's an open house you can attend before you make your decision. There was no formal, sit-down interview.", "Interview Questions": "N/A"}, {"date": "8 Mar 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Super easy and straight forward. The interviewers were super nice, and did interviews over Zoom. Questions included your hobbies, availability to volunteer, how you work with people, and what you want to get out of the opportunity.", "Interview Questions": "Why do you want to become a volunteer?"}, {"date": "12 Apr 2023", "title": "Student Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Mar 2023", "Interview Descriptions": "The atmosphere is easy and comfortable. They will first ask some questions about dealing with customers, mostly about your attitudes and they will give you a scenario to test your reaction toward something. Then they will ask if you have any question about the position or something else.", "Interview Questions": "Q: What if your customer wants a burger but we run out of burgers? What would you say to your customer?"}, {"date": "24 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Every internship or work experience I've had through Ohio State has come after a very professional interview. The interviewers ask questions related to the job, but also questions to see if you would fit into the culture you would be working in.", "Interview Questions": "What skills can you bring to the table?"}, {"date": "23 Feb 2023", "title": "Maintenance Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "I wasn't as hard as you'd think. I was nervous but I had to remember I'm interviewing them to see if they fit my standards as an employer. I made sure I had an equal amount of control in the interview. Ask questions related to your job. Make sure you know what they are asking in relation to your work experience.", "Interview Questions": "General maintenance questions. Leadership and management style. Experience with conflict. Experience with contractor interactions. Following rules and policies."}, {"date": "13 Feb 2023", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "I had a hour-long virtual interview over Zoom with the position’s direct manager, the unit’s director, another designer and an integrations specialist. It included both personal and technical questions and outlined the role and expectations.", "Interview Questions": "Why are you interested in this position ?"}, {"date": "9 Feb 2023", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Process went pretty smooth, I believe I did the interview on Zoom since it was during covid, just met with one of the managers and heard back within two weeks.", "Interview Questions": "Describe excellent customer service experience."}, {"date": "3 Feb 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Went through multiple rounds of interview with materials prepped etc., was told a timeline at every stage that wasn’t kept at all and after the panel interview there was little to no communication for months", "Interview Questions": "What would you bring to a potluck"}], [{"date": "11 Jan 2023", "title": "Office Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Interviewed by 2 people in person. The people were the only 2 who worked in the SNAPPED program. Interview about getting to know each other followed by a test on Outlook to see how you handle communicating with a team to get information and pass directions.", "Interview Questions": "Tell me about yourself and what you understand about the position."}, {"date": "5 Jan 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Very transparent it wasn’t like your typical interview it felt very personal even though it was through as Zoom. I applied and then I got called in for an interview two days later they offered the position a week later so overall, it took me about a month to get into my position!", "Interview Questions": "What are my weakness and strengths?"}, {"date": "1 Feb 2023", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2023", "Interview Descriptions": "Contacted by a new professor at the university. Short (20) minute interview. He stated that he is looking for domestic applicants, primarily students who are already attending the Ohio State University.", "Interview Questions": "Asked about research background, research interests."}, {"date": "13 Mar 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at The Ohio State University in Jan 2023", "Interview Descriptions": "This is super easy and there is no interview at all. You just have to submit your resume and they will most likely hire you. This is a very nice job to have on your resume.", "Interview Questions": "Please send in your resume."}, {"date": "8 Dec 2022", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Reached out to faculty via email and sat down to discuss my qualifications and interest in the position - got an offer soon after interview. Overall the interview process was pleasant and pretty casual.", "Interview Questions": "Why do you want to work with us?"}, {"date": "11 Feb 2023", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Dec 2022", "Interview Descriptions": "Professor asked if I would like to TA, and I said yes. I had already gotten to know him through the semester, so this probably made me a shoe-in to be a TA", "Interview Questions": "Would you like to TA for my class?"}, {"date": "17 Nov 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Typical interview questions like how did you handle a stressful situation, what are three characteristics that you want to bring into this position? How do you delegate tasks to your teammates?", "Interview Questions": "What was your most difficult task?"}, {"date": "15 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Applied online. Heard back a few days later via email. There was an initial phone call followed by multiple zoom interviews followed by in-person interview, and then a telephone call with the hiring manager and Human Resources.", "Interview Questions": "Past work experience. Current classes"}, {"date": "4 Nov 2022", "title": "SNAP-Ed Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Great, I felt comfortable and the ladies were very nice. I didn't feel intimidated and was given plenty of time to think about the question and answer it to the best of my ability.", "Interview Questions": "How well do you adapt to change?"}, {"date": "30 Nov 2022", "title": "Athletics Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Nov 2022", "Interview Descriptions": "This was by far the worst interview of my life. This interview was so terrible that I am leaving a review literally for the first time in my life. OSU flew me out. I heard nothing for two weeks and THEN I found out I didn't get the job due to a Instagram post. AND I STILL haven't gotten an email saying that I didn't get the job. This is absolutely no shade towards the person who got the job, but entire shade towards OSU for being entirely unprofessional. Bad vibes the whole time.", "Interview Questions": "I don't remember I was too annoyed with the people being on their phone's while they were interviewing me."}], [{"date": "25 Jan 2023", "title": "Academic Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University in Nov 2022", "Interview Descriptions": "Applied through WorkDay. Was contacted by the Pharmacy College's HR rep. They asked me general questions. The HR rep didn't know specifics about the position which made things a little difficult. The next round was with the Director of Academic Programs for that specific college. She was very personable. I didn't end up making the final on campus round, but was notified quickly and respectfully.", "Interview Questions": "A lot of questions about how to handle emotional conversations with students."}, {"date": "28 Oct 2022", "title": "Student Job Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Group interview. You will be in a group with 4 or 5 people. You all will come to a place, there are 5 interviewers. Each of them will ask at least 1 question.", "Interview Questions": "What are your strength and weaknesses?"}, {"date": "12 Oct 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "In person interview with the lab manager and PI. Interview took weeks to schedule and it was weeks afterwards before I heard back from HR with a salary 5/hr less than what the lab agreed was reasonable and they had “confirmed would work through HR.” They then wouldn’t budge on this.", "Interview Questions": "What would you bring to our lab as an individual and as a team member?"}, {"date": "3 Oct 2022", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "They had three interviews in lab, group, and conference room setting and one presentation for the whole group. They invited all candidates in the same meeting too which was a little odd but it went well.", "Interview Questions": "Why do you want to join us What’s your future goal"}, {"date": "28 Oct 2022", "title": "Office of Student Life Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Oct 2022", "Interview Descriptions": "Overly complicated process that should have been a red flag from the start. I need to start off by saying I have had many positive interactions within the university’s various departments; however, this was not one. Interview was moved multiple times due to their scheduling conflicts, apparently the entire team needed to be present for the two-part interview. I just rolled with it thinking maybe it really is a tight team and critical everyone be there. I went in with high energy and extremely excited while I looked around at the team staring off into space paying little to no attention while I answered common boilerplate questions. I have never been put in such and odd interview situation and it really seemed like I was the only person excited too actually be there. I just felt very discouraged after so much prep and importance was placed on the team needing to be there. At the end I was told I would need to “turn-n-burn” projects and the work would only need to be average at best. It struck me a bit odd, but I tried to take it as they just have a heavy workload and wanted to iterate that. Overall, I was not offered the position, thought I would have thought prior experience with the brand and a genuine love for the university would have meant something. After following up I was not even giving the decency of a reply, having been a part of the university for so long and a past student I find this to be rather rude and unprofessional. Again, I have had many positive interactions within the various university departments, however something is off here and be protective of your time and energy.", "Interview Questions": "Just common questions regarding workflow and juggling multiple projects."}, {"date": "16 Sept 2022", "title": "Content Marketing Strategist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Ohio State University in Sept 2022", "Interview Descriptions": "Interview went well and was smooth - was a 1 on 1 interview and typical questions were asked. Position was completely remote with the option of having a desk anywhere from 1 - 5 days a week. If you wanted a desk for under 3 days a week, you could chill in the public spaces on campus to work. Great interviewer, very casual and easy.", "Interview Questions": "How do your current skills pertain to this role?"}, {"date": "29 Mar 2023", "title": "Risk Management Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Ohio State University (Columbus, OH) in Aug 2022", "Interview Descriptions": "The process took about 4-6 months. One phone screen and two rounds face to face interview. Each process took weeks and I thought they are not longer consider me anymore.", "Interview Questions": "What is Risk? and how do you define it."}, {"date": "28 Jul 2022", "title": "Staff Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Met with the director of labs for two interviews first one was on Zoom and the second was in person. Took a tour of the labs and layout of the floor then went into the office for the interview,", "Interview Questions": "Mostly related to experience and knowledge of the lab I was trying to teach."}, {"date": "21 Jul 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University", "Interview Descriptions": "A short ~20 minute phone interview first, then a zoom interview--one hour with the directors/associate directors, then another hour with the other research associates, then 30 minutes to complete a task.", "Interview Questions": "What is a unique strength you have?"}, {"date": "14 Jun 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "I had two phone screens and an on-campus interview that was scheduled for half a business day. I had the chance to meet with team members, supervisor, and boss's boss.", "Interview Questions": "Q: How do you prioritize conflicting project timelines."}], [{"date": "14 Apr 2023", "title": "Student Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Ohio State University (Columbus, OH) in Jun 2022", "Interview Descriptions": "Applied through Workday and got an email within a few days. They were very accommodating as to where you want to be interviewed. The interview was very relaxed, with no pressure on it.", "Interview Questions": "What do you think of diversity?"}, {"date": "6 May 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "First round was HR screen to ensure eligibility- then phone interview with committee chair-in person interview with committee and individuals-job talk, tour campus, meet student, potential collaborators, labs, department- decision letter--performed background check", "Interview Questions": "5 year plan regarding research programs; teaching philosophy; service plan, etc\r\n"}, {"date": "3 Mar 2023", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University in May 2022", "Interview Descriptions": "It was very casual more like a general conversation about why you wanted the job and a little bit about you interests. We went on tangents about general life things and it was super comfortable.", "Interview Questions": "Why do you want to be a TA for this subject and not another one?"}, {"date": "19 Apr 2022", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Very smooth and quick process. They were very helpful through everything. I would recommend looking towards this employer if you are looking for a new job or career path. You will not be disappointed by your decision.", "Interview Questions": "Steps and processes I would implement if selected to streamline production"}, {"date": "15 Apr 2022", "title": "Rad Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "It was short and to the point. I don’t want to do this. I’m only looking for salaries listed in the website and I’m just typing this to fill the minimum word requirements.", "Interview Questions": "What is your experience in this field"}, {"date": "7 Apr 2022", "title": "Student Vehicle Operator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Interview was very easygoing, and consisted only of talking to one person in their office for around fifteen minutes. Heard back within a week after and had a good experience overall.", "Interview Questions": "\"Please tell me about yourself\"\r\n"}, {"date": "31 Mar 2022", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "The interview consisted of 2 rounds with managers and department chair, very behavioral and culture focused, with one technical question about balance statements. First round was remote and second was on campus.", "Interview Questions": "How have you been able to balance remote and in person life since the pandemic? "}, {"date": "29 Mar 2022", "title": "Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Great, very responsive and helpful people and process. Well supported and seamless process for interviewing for this position at Ohio state university. Very happy with how it turned out and who I worked with.", "Interview Questions": "Tell us about your experience."}, {"date": "17 Mar 2022", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Lasted two months and had three rounds of interviews, the first was a phone interview with an hr rep and the second and third were in person with the team", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "I was interviewed by my current manager. My current position was looking for people who are willing to participate and learn the workings of a lab. We had a really nice discussion about all the research the faculty was currently working on. I asked a lot of questions about her work and she was genuinely happy to share her knowledge.", "Interview Questions": "Describe a time when you had to deal with a difficult situation/failure."}], [{"date": "11 Mar 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Two times of interview. In the first time, just one professor interview me. In the second time, there are four professor give me the interview.  The question is not too hard to answer.", "Interview Questions": "Why do you come to this school"}, {"date": "3 Mar 2022", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Not a very friendly interview . The panel had a set of questions in front of them and asked the questions as though they were formal exam questions.  It wasn’t like the rest of my interviews with other companies.", "Interview Questions": "Mostly technical questions about the field. "}, {"date": "27 Sept 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (El Paso, TX) in Mar 2022", "Interview Descriptions": "Industry standard interview process with lots of back and forth question and answering. beside a lot paperworks need to be completed before the hiring process. overall it was  a easy process.", "Interview Questions": "what are my research interest"}, {"date": "25 Apr 2022", "title": "Exhibit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2022", "Interview Descriptions": "Had a very quick follow up after submitting application. \nWithin three weeks had a zoom interview with six staff members and had received the interview questions two days prior to the call.", "Interview Questions": "What appeals to you about this role"}, {"date": "19 Sept 2022", "title": "SNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Feb 2022", "Interview Descriptions": "I applied online for the student nurse assistant position and then received an invite for an online interview that was recorded, I though it would be with a person but it was not, and it was a series of 8 questions, 1 minute to think in-between.", "Interview Questions": "Rate the hospitals 1-3 from first choice to last choice and why?"}, {"date": "27 Jan 2022", "title": "Video Assistant Football Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "No interview was done. Simple email process back and forth. Show your interest, come to practice and try out and you were hired. You don’t even meet the director. Pretty easy and straightforward", "Interview Questions": "Why would you like to do this job?"}, {"date": "23 Jan 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Lima, OH)", "Interview Descriptions": "A huge committee asking almost impossible to prepare for questions for $16/hr. Had to give a 30 minute presentation on OSU. Very difficult interview process for the pay. It would have been better if they were to let the interviewees present on a topic they felt comfortable with to truly showcase presentation skills.", "Interview Questions": "Give a 30 minute presentation on why a diverse audience should attend OSU "}, {"date": "21 Jan 2022", "title": "Education Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Zoom interview about 30 minutes just asking education-related questions and scenarios. Two people on the interview panel. Very friendly and very conversational in tone. The second interview was set up much the same way with the same people and one other. Very nice and made me feel at ease.", "Interview Questions": "Describe a time you dealt with a difficult colleague. "}, {"date": "8 Jan 2022", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Straightforward questions, felt the interviewers could have been more prepared in all three interviews/5 different interviews. Questions seemed to be pulled from the same questionnaire, as I was asked the same questions by different people multiple times.", "Interview Questions": "Where do you see yourself in 5 years? 10 years?"}, {"date": "15 Feb 2022", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Jan 2022", "Interview Descriptions": "first round was just getting a lot of information about the functioning of the team and the department on a day to day basis. next rounds would be interviews and technical questions.", "Interview Questions": "why are you interested in this role?"}], [{"date": "19 Sept 2022", "title": "Teacher´s Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at The Ohio State University in Jan 2022", "Interview Descriptions": "The interview process was very smooth! They just asked if I was comfortable grading papers, handling student info, if i could stay organized and submit grades by deadlines. I was already a student when hired so I believe this helps", "Interview Questions": "Are you comfortable handling students grades?"}, {"date": "13 Dec 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Very casual interview. It lasted 15 minutes max. They asked pretty standard questions and gave a lot of information about the position. They asked maybe 5 questions total. The application was also pretty straightforward.", "Interview Questions": "How do you handle conflict?"}, {"date": "6 Nov 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "I applied and then I received an email to ask if I would like to interview and they offered a few proposed times. I followed the exact instructions on the email and went then and sat in the room as requested. He asked me questions about the population, LGBTQIA+ interactions, and more.", "Interview Questions": "You are not sure of a youth's pronouns, what do you do?"}, {"date": "4 Nov 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Telephone interview screening with director. followed up with a campus interview with director, other manager and peers. Discussions and questions with each person or group. HR representative was very helpful navigating the process.", "Interview Questions": "I was asked about my work, both technical and as a leader."}, {"date": "1 Oct 2021", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "In-person interview. Lasted about an hour. Pretty laid back in my opinion. It was a set of 2 interviews. Supposed to be 3 but one had an appointment during my interview. Passed that interview and got an offer the next day.", "Interview Questions": "Experience with cloud services and general previous experience."}, {"date": "7 Oct 2021", "title": "Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Oct 2021", "Interview Descriptions": "zoom, held 1. phone 2. group 3. 1 on 1 with director. Nice people and good employer. ran on time. asked a lot of questions. very relaxed environment. questions were basic but meaningful to job. gave you plenty of time to ask questions.", "Interview Questions": "how do you handle stress"}, {"date": "29 Sept 2021", "title": "Resident Advisor (RA) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "It was extremely nerve racking. I was interviewed by 3 people, all asking questions that did not necessarily pertain to the job itself.  I believe that they wanted to see how I reacted under pressure.", "Interview Questions": "If we’re to be selected to be an RA, what would you do differently to improve the diversity and inclusion of all of the residence?"}, {"date": "6 Sept 2021", "title": "Student Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "1 interview that was not very difficult. They are always looking for student associates in every different aspect of the university. I did not find the hiring process to be difficult at all.", "Interview Questions": "Why are you interested in the position?"}, {"date": "12 Apr 2022", "title": "Student Technology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Sept 2021", "Interview Descriptions": "Easy questions were asked about availability, working with technology in past, and any past experience working on campus. Working a minimum number of hours isn't always required but it's a good campus opportunity in terms of pay.", "Interview Questions": "Q. What does your availability look like?"}, {"date": "15 Aug 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at The Ohio State University", "Interview Descriptions": "There was a Zoom Interview with potential advisors and a look at undergraduate transcripts. Most importantly we talked about overall career goals and past experiences within the desired field of study.", "Interview Questions": "Q: how did you get started In Your field of study. \r\n\r\nQ: what makes you passionate about your field of study? "}], [{"date": "9 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University (Columbus, OH) in Aug 2021", "Interview Descriptions": "It was a lengthy process with a video submission, in person interview with multiple groups, and a thorough reference check. It took a long time before I heard back and received an offer.", "Interview Questions": "Tell me about yourself. What are your 5 year career goals."}, {"date": "10 Aug 2021", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Aug 2021", "Interview Descriptions": "After being notified of being selected as a semifinalist, I submitted video answering interview questions (why I wanted to work there, my experience, etc.). I then had an in-person interview with two panels of faculty and stakeholders.", "Interview Questions": "Tell me about yourself and your background. "}, {"date": "10 Feb 2022", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Aug 2021", "Interview Descriptions": "I spoke with the person hiring for about 10 minutes going over basic info regarding the course, some technical questions related to the course, and then I asked some questions of my own..", "Interview Questions": "Q: What is a high pass filter?"}, {"date": "12 Jul 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Jul 2021", "Interview Descriptions": "Interview was virtual over zoom and ran very professionally. Nurse case managers were easy to communicate with and asked relevant questions, while providing insight on job responsibilities and task. Smooth process and I was very impressed with both Units I interviewed with.", "Interview Questions": "Most were behavior based questions. "}, {"date": "6 Jun 2022", "title": "Inventory Control Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Jul 2021", "Interview Descriptions": "Multiple rounds.\nI was reached out by Office Staff Coordinator at Wexner Medical Center to schedule the first round (30 minutes on MS Teams) to be interviewed by Sr. Process Engineers.\nThen they rescheduled it because they wanted to change the position title to Resource Planning Analyst. Then they rescheduled it again as they wanted to change the job description.\nThen I met the same two people again for an hour-long interview for a more in-depth discussion.\nThen I was requested to meet in person to meet the same two people again in person, at OSUWMC as a follow-up interview at my own expense. I had to take a day off from my current job, and drive 3 hours (oneway) early morning to reach for the interview at 8.30 am. After spending a whole day doing literally everything but not a legit interview I WAS GHOSTED by those two process engineers.\nNEVER HEARD BACK FROM EITHER. I HAVE CALLED/EMAILED THEM A MILLION TIMES BECAUSE I DESERVED TO HEAR A REPLY. IT WAS FINE IF I DIDN'T GET A JOB BUT A REPLY SHOULD BE APPRECIATED.", "Interview Questions": "In-person Interview: Tour the OSU-WMC and meet and greet the team and various people working collaboratively with this position. She took me to one of the inventory rooms and asked \"What will you do to make this room better?\" "}, {"date": "28 Jun 2021", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Typical interview, not very long, 1 round on the spot did not feel like it was tough and was hired on the  spot as a student at OSU roughly 20 minutes", "Interview Questions": "Give me a time you problem solved"}, {"date": "25 Jun 2021", "title": "Summer Student Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Technical questions mixed with behavioral questions. Basic situational driven question looking for your thought process development and previous knowledge, experience.  Just one round of in person interview with level 1 and level 2 manager", "Interview Questions": "Describe a non technical problem that you solved using your technical background"}, {"date": "14 Jun 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Phone interview with the prospective boss followed by a full day on-campus visit. Talked to almost every lab’s PI in the department. Everybody was friendly. Was asked to give a short presentation about previous work.", "Interview Questions": "What are the technical skills that you mastered and what would you like to learn?"}, {"date": "12 Jun 2021", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "overall it was two interviews, and they were both with zoom video call! the first one was with the supervisor and then presenting in front of  the whole research group", "Interview Questions": "-General behavioral questions\n-Research questions "}, {"date": "2 Jun 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Basic resume review questions. Was interviewed by two people in the research focus area. Resume review was just a clarification of skills presented on the resume. Nothing too technical or behavioral.", "Interview Questions": "What is your availability like over the year?"}], [{"date": "8 Aug 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at The Ohio State University in Jun 2021", "Interview Descriptions": "The intervews are virtual now, which is nice. The inter view are fairly laid back, but there are multiple interviewers and I did have to do 3 interviews before getting rejected. However, my resume was passed on and I got to interview for a similar position in another department.", "Interview Questions": "Tell me about yourself? Where do you see yourself in this job in the next year?"}, {"date": "4 May 2021", "title": "Admin Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Interview was a set of 2 zoom interviews. Both with set questions but allowed for time to have open discussion afterward. Pleasant experience and there were a total of 3 people interviewing me. Clearly explained title and position objectives.", "Interview Questions": "How do you prioritize and manage your time?"}, {"date": "8 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at The Ohio State University (Columbus, OH) in May 2021", "Interview Descriptions": "Ask about your past experience related to the research area. You need to speak English fluently and attend the weekly meeting. You need to know at least R and Python to do the work.", "Interview Questions": "Past experience, current school year, work time"}, {"date": "15 Apr 2021", "title": "Recruitment Host for Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "They honestly brought me in and treated me like family. Through this position I have made valuable connections that I can rely on in the future. I am honestly grateful for them.", "Interview Questions": "What was a time when you faced a difficult situation and how did you face it/overcome it? "}, {"date": "12 Apr 2021", "title": "Executive Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Very long and drawn out. Process took several months and then a delay in contacting candidates.  Very engaged leaders, some with difficulty seeing past there own experiences. Think approach is", "Interview Questions": "What is the strategic vision?"}, {"date": "17 Mar 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Smooth, but took a while to start. And actual hiring took much longer.  Met with immediate boss and head of department. Both interviews were easy and had no issues. Only issue was that I asked questions about upward mobility but I was not given much feedback.", "Interview Questions": "Relevancy in the field of work, education, aptitude, application of degree and skills to work. "}, {"date": "8 Mar 2021", "title": "Financial Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "-A phone interview with HR that was focused on background, education, and experience \n-Followed by a phone interview with the Operations -Team.  This included management and senior leadership about specific questions in regards to resume.  \n-Followed by a in person interview with leadership team.  This was a panel interview and included 6 people from the surrounding departments.", "Interview Questions": "Why do you feel like you would be a good fit?"}, {"date": "4 Jan 2023", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Mar 2021", "Interview Descriptions": "I had my interview with two of the professors whom I chose as my supervisor. They were very friendly and the questions were mainly about the SOP, They also double-checked my proficiency in Software.", "Interview Questions": "How do you want to practice the broad field of behavioral design?"}, {"date": "7 Apr 2021", "title": "Director of Nursing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Mar 2021", "Interview Descriptions": "My first call was with the HR recruiter. My follow up was with the current director and with 2 managers and a  nurse educator. It was a Zoom meeting. All the interviewers took turn asking questions", "Interview Questions": "1. How did I hear about the position?\n2. Tell me about a time when I had to collaborate with multiple departments\n3. How would I work towards alleviating nurse burnout?\n4. What types of projects have I worked on?\n5. Tell us about your leadership style\n6. What types of leadership rolls have you had?\n7. Tell us about your experience\n8. What questions do you have for us? "}, {"date": "2 Feb 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "The actual interview for the position was not too bad, they ask basic questions and there's a scenario based activity but it is all basically common sense, so you should be okay", "Interview Questions": "Why do you want this position?"}], [{"date": "8 Mar 2021", "title": "Ph D Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Feb 2021", "Interview Descriptions": "The interview process was  divided into three phases: program introduction, Group interviews, and Individual interview.  I would describe the faculty as friendly and interesting and the students as close knit and friendly.", "Interview Questions": "Why do you want to peruse a degree in School counseling "}, {"date": "26 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "interview with professor you will be  working with; the outcome is maily based on your previous works like publications, presentation on conferences and background; sometimes a proposal on related field will be helpful.", "Interview Questions": "State our background and research interest"}, {"date": "25 Jan 2021", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University", "Interview Descriptions": "The interview process involved me meeting with three individual Lab managers and then selected to be interviewed by one. After this they showed me around the lab and offered me a position.", "Interview Questions": "Why do you want to join this lab?"}, {"date": "12 Jan 2021", "title": "ODI Graduate Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University", "Interview Descriptions": "I was referred to the role by an employee. The interview process was fast and easy. I got feedback about whether or not I got the job that same week.", "Interview Questions": "Most questions were geared towards past experiences and ability to do job duties. "}, {"date": "8 Jan 2021", "title": "Maintenance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "2 rounds, both very relaxed. Included background check and drug test. It would be hard to not get the job offer, seems to be based on comparability with the hiring managers", "Interview Questions": "How do you feel about cleaning up urine"}, {"date": "3 Feb 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Jan 2021", "Interview Descriptions": "\"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.\"", "Interview Questions": "\"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.\""}, {"date": "26 Jan 2021", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Jan 2021", "Interview Descriptions": "It was easy. Talked about my research a little. The faculty member introduced me to the surroundings of OSU and some outdoor activities I can engage in when I start my Ph.D. program (OSBP)", "Interview Questions": "What was your research experience?"}, {"date": "29 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Jan 2021", "Interview Descriptions": "The interview process was very thorough and competent. They asked me questions that were relevant to my experience and the role itself. The interviewers were very respectful and great listeners!", "Interview Questions": "What interests you in this role?"}, {"date": "18 May 2021", "title": "Revenue Cycle Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Jan 2021", "Interview Descriptions": "Good. Nice staff. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral. Typical interview questions. Mostly behavioral.", "Interview Questions": "Typical interview questions. Mostly behavioral. "}, {"date": "17 Nov 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Met with the professor and course leads in a group interview session. Was a very straightforward process and questions were primarily focused on course expertise. Some focus placed on character since a TA would be involved in administering a test. There were also questions about approaches to study hour sessions.", "Interview Questions": "How would you handle a student who asks for the answers to problems during a study hour session?"}], [{"date": "9 Dec 2022", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Nov 2020", "Interview Descriptions": "Lengthy but informative. The recruiter and hiring manager did a great job of communicating throughout the process. Recruiter was available for all questions asked. Overall it was a positive experience, especially in the time of COVID and virtual interviews.", "Interview Questions": "Why is was looking to leave my current position."}, {"date": "15 Jan 2021", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Nov 2020", "Interview Descriptions": "Very relaxed and comfortable interview process for the student writer role. Interviewers asked for a writing sample ahead of time to test capabilities. easy to get a hold of and quick response time.", "Interview Questions": "What do you know about writing in a journalistic style?"}, {"date": "30 Sept 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Show your interest and give many reasons on why you want to do it. Also do very well in the class because that will show your ability to succeed as a teaching assistant", "Interview Questions": "Why do you want to be a TA?"}, {"date": "25 Aug 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "The interview Took 15 minutes. It was very casual. They asked questions about how you manage to work with other people, how to solve conflicts, ask if you have customer service experience, etc.", "Interview Questions": "How did you manage conflict with other people?"}, {"date": "3 Feb 2022", "title": "Server/Waiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Columbus, OH) in Aug 2020", "Interview Descriptions": "The interview was good. It was conducted over the phone and was fairly easy and painless. Your typical interview as I was asked pretty common interview questions that you could easily prepare for.", "Interview Questions": "How would you deal with a workplace conflict? "}, {"date": "16 Feb 2021", "title": "CSE TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Aug 2020", "Interview Descriptions": "there was no interview process. i showed interest to my past professor and emailed him about this opportunity.  i was accepted very easily because i had a good grade in the class during the past semester and was interested and good at the topics needed to teach.", "Interview Questions": "there were no interview questions"}, {"date": "4 May 2021", "title": "Academic Peer Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Newark, OH) in Aug 2020", "Interview Descriptions": "They asked me about how school was for me and if I would want to help others be successful. We talked about my experience and schedule. It was a short and easy interview.", "Interview Questions": "How has college been for you?"}, {"date": "14 Jul 2020", "title": "GIS Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University", "Interview Descriptions": "Generally easy. Interview with senior members of the GIS Team. Interview focus more on experience with GIS. It would be great if you have previous work experience in the field that you could speak of.", "Interview Questions": "Are you familiar with topology?"}, {"date": "25 Sept 2020", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in May 2020", "Interview Descriptions": "One interview after sent in resume, very nice and very straight-forward process and will get back to school quickly too, was just a casual conversation about the job and the duties", "Interview Questions": "If I was available to stay with them for multiple semesters"}, {"date": "19 Apr 2020", "title": "Medical Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "prior phone conversation that was followed by an in-person interview a couple of months later after verification of submitted documentation and evaluating compatibility. The in-person interview was friendly, constructive and transparent", "Interview Questions": "where do you see yourself in 10 years"}], [{"date": "7 May 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Mar 2020", "Interview Descriptions": "No interview. Just an easy multiple choice test with various scenarios you may encounter in the job. The main goal was to see what type of employee you would be by providing your gut instinct responses.", "Interview Questions": "If you had X, Y, and Z to do, in which order would complete the tasks?"}, {"date": "26 Feb 2020", "title": "Student Job Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Interview was fair and in an positive environment. They had the supervisor and student manager interview me. They had me come in for an in person interview and updated me via email afterwards. It was an overall good experience!", "Interview Questions": "What are your strengths?"}, {"date": "14 Nov 2022", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Feb 2020", "Interview Descriptions": "Interview consisted of a zoom call with a current RA and Hall Director. Questions ranging from past experience to what programs you would plan as an RA. You are asked to list your placement preferences afterwards", "Interview Questions": "Tell me about a time in which you had to hold someone accountable"}, {"date": "2 Jan 2020", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Apply online through an application. You answer a few short answer questions. If you make it to the next stage, there is a quick in person interview. It is very casual and the people are very friendly.", "Interview Questions": "Tell me about a time who dealt with a conflict."}, {"date": "19 Mar 2021", "title": "Line Cook Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Jan 2020", "Interview Descriptions": "We have a lot of rain in June.\nThe memory we used to share is no longer coherent.\nShe could hear him in the shower singing with a joy she hoped he'd retain after she delivered the news.\nIt's not often you find a soggy banana on the street.\nHe always wore his sunglasses at night.", "Interview Questions": "Writing a list of random sentences is harder than I initially thought it would be.\n"}, {"date": "11 Feb 2022", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2020", "Interview Descriptions": "You scheduled and interview for an hour slot. Took about 40 minutes with time for questions for the people interviewing you. Two people conducted the interview, they took notes of responses to the questions.", "Interview Questions": "Give an example of what a good leader looks like? "}, {"date": "4 Oct 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Jan 2020", "Interview Descriptions": "Typical interview process. Took a couple months to get through. Overall everyone was nice and respectful. Nothing crazy or out of the ordinary. I did a presentation for students, faculty and others. I answered questions about my presentation and typical interview questions. Positive experience overall.  Not sure what else to say about the interview process.", "Interview Questions": "Why do you want to work for OSU?"}, {"date": "14 Dec 2019", "title": "Pharmacy Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Organized and coordinated with my rotation schedule. Met all the people, who were very nice. Interviewed in three rounds with different people. Asked questions about teaching opportunities. Asked questions about teaching opportunities. Asked questions about teaching opportunities. Asked questions about teaching opportunities.", "Interview Questions": "Situational questions based on pharmacy experience"}, {"date": "10 Dec 2021", "title": "Student Facility Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Nov 2019", "Interview Descriptions": "The interview started with a group activity, then broke into fairly quick individual interview.  Overall took about an hour.  Dress is professional.  It was conducted by RPAC supervisors, and felt very conversational.", "Interview Questions": "How would your background/experiences help you to be successful in this position?"}, {"date": "1 Oct 2019", "title": "Senior Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Great  process, easy to answear. Straightforward \r\nScreening phone interview onsite 30 min multiple rounds followed by hr. It was very difficult  for me. Great work experience", "Interview Questions": "Tell me about yourself"}], [{"date": "26 Sept 2019", "title": "Peer Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "I was called in after a few weeks of applying. Questions in the beginning were pretty basic then I was asked to pick from a list of subjects to go through a “mock peer tutor” session with so they could assess my tutoring skills.", "Interview Questions": "How would you respond to a student asking you to do all the work for them"}, {"date": "24 Jan 2020", "title": "Funding Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Sept 2019", "Interview Descriptions": "Process was swift clear and very professional. They were quick to respond to my resume. They were quick to conduct a phone screen. They were quick to conduct a face to face interview. There was a little lag in the results of the face to face.", "Interview Questions": "How did I hear of the position"}, {"date": "26 Jun 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Sept 2019", "Interview Descriptions": "The interview process was simple and the questioning did not take all day. They are just getting a sense of what kind of person you are and your work ethic and your previous skills.", "Interview Questions": "Q: What are your strengths?\nQ: Any past experience with customer service?"}, {"date": "28 Aug 2019", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Basically, you just need to jo to the interview and let them know that you are able to handle the job and you are better than your peers, then you get this.", "Interview Questions": "How do you work with a co-worker that you do not like?"}, {"date": "2 Feb 2022", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Athens, OH) in Aug 2019", "Interview Descriptions": "Interviewed with the Associate AD of marketing and sales. He wanted to know why I was interested in the position and what I would be able to bring to the team.", "Interview Questions": "Why are you interested in being an intern with the marketing department?"}, {"date": "17 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University", "Interview Descriptions": "Referred to position and then one in person interview. Smooth process and those in the office are always willing to help you out. Training after that was very simple and the on boarding was smooth as well. Training's are a bit tedious but nothing too bad.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Jul 2019", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2019", "Interview Descriptions": "I received a call back from the department I applied for about 2 weeks after I initially sent in my application. I had a phone interview first, the following week had an in person interview, and the week after that I had interviews with the team manger, lead researcher, and the over sight doctor. Received a job offer two hours after my final interview. \r\nThey called my references after the last interview. Overall about a 3 week process. My start date will be 3 weeks after my initial hire date. Pretty easy process.", "Interview Questions": "What are your greatest strengths and weakness. "}, {"date": "7 Feb 2020", "title": "Class Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2019", "Interview Descriptions": "The interview process was not existent, I was only expected to send in my resume as well as the grades I have gotten for the class I am helping with.", "Interview Questions": "What did you receive in the class?"}, {"date": "27 Jun 2019", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Process was fast and easy, had one interview with a manager and was hired and brought in a little over a  weeek later. Have been working there a little over a year now.", "Interview Questions": "Tell me about your responsibilities at your last position"}, {"date": "20 Jun 2019", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "The entire interview process took two weeks. It consisted of one interview over the phone/video chat and several emails. They also asked me to submit my writing and photography portfolio.", "Interview Questions": "Tell me about yourself. "}], [{"date": "6 Jun 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Ohio State University", "Interview Descriptions": "There were 1 phone interview, 2 in office interviews, and 2 panel interviews. There were several weeks between each level of interviews and the process took over 4 months till getting selected and then another month to get background check and a start date.", "Interview Questions": "very broad questioning"}, {"date": "24 May 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jun 2019", "Interview Descriptions": "Really casual interviews with principal investigator, lab manager and lab members. in the interview , you will be asked about your career plan, what you hope to learn from this position and what do you think you can contribute.", "Interview Questions": "Your short term and long term career plan"}, {"date": "8 Jul 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University (Columbus, OH) in May 2019", "Interview Descriptions": "Applied for position on-line.  Received a call from OSU administrative staff to set up an interview via Skype, since the P.I. was moving here from out-of-state.  After Skype interview, I received an email asking me to get a background check, I responded to the email and once the background check had cleared, I received a phone call from the admin. staff to offer the position.  After a phone conversation with the P.I. to discuss roles/responsibilities and compensation a little further, I accepted the position.  A formal offer letter was then emailed, which required to be signed and returned.  Upon receipt of my acceptance, an orientation was scheduled and start date confirmed.", "Interview Questions": "How would you handle a set back in your research project?"}, {"date": "15 Apr 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Weekend long interview process with faculty meeting and students meetings. A bit draining with all of the different meetings, but very interesting. Included tour of Nationwide children’s hospital. Some aspects were fairly disorganized. But it is mostly student run, so that is to be expected", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "5 Oct 2019", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Apr 2019", "Interview Descriptions": "Long wait to set up interview . The interviewers were prepared and professional. I was told how long to wait before they will get back to me. They shared that there were several people being interviewed for the position.", "Interview Questions": "Fair questions "}, {"date": "14 Jan 2023", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Mar 2019", "Interview Descriptions": "It was a relatively straightforward interview. It was mostly based on behavioral questions, and some functional questions for working the desk, as well as some fun questions to get to know you more as a person. Very run of the mill student employee interview", "Interview Questions": "Describe a time you worked well with a team"}, {"date": "16 Jan 2019", "title": "Energy Model Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Interviewed with 2 managers in Lincoln tower. Whole interview was pretty casual and took about 30 minutes. Asked mostly about my interests in energy management/being green. Didn't expect a lot of experience, just a willingness to learn. Received an offer a couple days later.", "Interview Questions": "Why are you interested in energy management?"}, {"date": "19 May 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2019", "Interview Descriptions": "very time taking 2-3 months- It was 3 rounds. One phone, one video screening/home test and 1 in person.\r\nFriendly, but long process. Need to have lot of patience and should not be in a hurry to get a job ASAP", "Interview Questions": "Explain why this role and why OSU"}, {"date": "25 Feb 2019", "title": "Desktop Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2019", "Interview Descriptions": "I did phone interview and called for on site panel interview. After on site panel interview another interview with director. He told me you will get call form one of manager or from HR. After that never heard back almost 2 months.", "Interview Questions": "Tell me about your self?"}, {"date": "3 Nov 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Jan 2019", "Interview Descriptions": "Very easy straight forward interviewing questioning about strengths and weaknesses. Asked different scenarios and how I would handle a disagreement in the workplace. The manager was very easy to communicate with and talk to and it made the interview very less nerve racking.", "Interview Questions": "What is a strength and weakness?"}], [{"date": "18 Mar 2019", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Jan 2019", "Interview Descriptions": "Interview was super relaxed. You are basically for sure going to get the job. During the interview they ask you a couple questions regarding your time management and how you work with others but other than that they get your open availability and schedule you for orientation.", "Interview Questions": "How do you manage your time?"}, {"date": "26 Apr 2023", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at The Ohio State University (Columbus, OH) in Jan 2019", "Interview Descriptions": "You will first complete a video interview first, then an in person interview with hiring manager, meet the team and then finally receive an offer from the team through HR.", "Interview Questions": "Name one weakness and strength?"}, {"date": "4 Nov 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at The Ohio State University in Jan 2019", "Interview Descriptions": "It was an in person interview. I was asked various basic questions so interviewers would get a better sense of who I was, and briefed on the projects I'd be potentially working on and asked about my general interest.", "Interview Questions": "What makes you a qualified candidate for this position?"}, {"date": "12 Dec 2018", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "The professor basically send you an email if you did really well in the class. Then they ask for your schedule and try to match you up with the correct class.", "Interview Questions": "N/A"}, {"date": "12 Dec 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "the interview process was ok but it did take a long time. also the process itself took long. interviewers were nice and friendly.  they asked several questions from the list.", "Interview Questions": "why did you apply?"}, {"date": "30 Oct 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 months. I interviewed at The Ohio State University", "Interview Descriptions": "Applied mid May - they finally sent me an automated rejection almost 6 months later, \n\nThanks for nothing. I would apply with the expectation of hearing back 6-8 months later. Good luck! I’m sure they are losing good talent with their molasses recruiting style.", "Interview Questions": "Why are you interested in OSU"}, {"date": "30 Jan 2020", "title": "Dining Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Oct 2018", "Interview Descriptions": "Wanted to get to know you, not very stressful, calm environment, told me a lot about the role, got back to me super fast and they were good about training me for the role during the process", "Interview Questions": "basic behavioral questions "}, {"date": "27 Sept 2018", "title": "Bucks Go Pro Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Group interview, a little intimidating at first but ask typical and applicable questions. Be sure to mention your interests because towards the end they'll recommend a department for you. Great opportunity to get your foot in the door for student athletes.", "Interview Questions": "What does being a buckeye mean to you?"}, {"date": "3 Oct 2018", "title": "Manager, Government Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Aug 2018", "Interview Descriptions": "There were several rounds, all of which were organized and professional on their end.  I interviewed directly with the department and did not deal with HR at all. The interview questions were not your standard questions and were specific to our field and practical applications to the position.", "Interview Questions": "What was my favorite aspect of college-- since they are a university"}, {"date": "26 Aug 2019", "title": "Research Budget Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University in Aug 2018", "Interview Descriptions": "A long process. Two process interviews. One and one with manager and one with the team. A long process. Two process interviews. One and one with manager and one with the team.", "Interview Questions": "Talk about a time when a problem a rise and your manager was not there?"}], [{"date": "28 Aug 2018", "title": "GP Admissions Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Aug 2018", "Interview Descriptions": "In typical OSU fashion (in my experience), I applied for the position 6/25/18 and wasn't asked to interview until 8/1. My interview was on 8/10 and have yet to be reached out to by the director of the department; I was told by someone else that I didn't get the job. I marked the interview as difficult only because I was under the impression that 2 people would be interviewing me, but when I got there I learned that I'd be interviewed by 5 people. I would go on to find out that my anxiety was evident negatively affecting my chance at being hired.", "Interview Questions": "What frustrates you? What motivates you? How do you like being coached? Why should we give you the job? "}, {"date": "30 Jul 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Briefly introduced what I have done and what I want to achieve. Asked some questions about my education and project experience, then I passed.  Talked a little about what I am gonna do after that.", "Interview Questions": "What's your interest?"}, {"date": "12 Jul 2018", "title": "Accounting Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Standard interview with lots of question about past jobs and experiences on the job.  Interviewed with 3 different staff and then went to lunch.  After lunch met with the human resource department", "Interview Questions": "What are your salary expectations?"}, {"date": "5 Oct 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2018", "Interview Descriptions": "Pretty straight forward, but competitive with other students. Depending on the departments, requirements and the process varies. Either can apply online or can see job posting on the boards.", "Interview Questions": "What are the skill sets and what am I studying?"}, {"date": "15 Jul 2019", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2018", "Interview Descriptions": "topics for questions\r\n- previous patient care\r\n- evaluation of time management\r\n-how to handle difficult work related situations\r\n-conflict resolution\r\n-strengths and weaknesses (reflection on both)\r\n- the biggest struggle I anticipated working on this floor", "Interview Questions": "What did your previous experience with healthcare related work?"}, {"date": "25 Jan 2022", "title": "Graduate Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University in Jul 2018", "Interview Descriptions": "I did not really have an interview process for my graduate research associate position so there isn't much else I can include in this section. Being a doctoral student, they needed students to help teach and grade assignments.", "Interview Questions": "I didn't really have an interview process for my position so there isn't much else I can include in this section."}, {"date": "16 Dec 2018", "title": "AV Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Jun 2018", "Interview Descriptions": "One of the student managers was tasked with interviewing me. All the student managers really just want to hire you, as long as you seem capable of learning and performing the job you should be able to get it. AV experience will go a long way, otherwise all you have to know is some basic troubleshooting, which you've probably already learned by fixing a TV remote, playing a video game, or fixing just about any problem.", "Interview Questions": "What was one time where you were working on a team and you struggled to work with one of its members? Describe how you handled the situation."}, {"date": "29 May 2018", "title": "Project Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "I applied via the OSU website. Shortly after the post closing date, I was excited to hear from a recruiter. We scheduled a phone interview. The phone interview was short, sweet, and pleasant. After that, my info was passed to the hiring manager for review. I was thrilled to hear that I was picked to interview.  \r\n\r\nI was informed who would be in my panel interview (names, titles) which helped, so that I could look everyone up on LinkedIn. Panel interviews are cringe-worthy (and cruel in my opinion), and I personally don't do as well when there are 3+ people. In this case, there were 6 people (including the recruiter).  I understand that hiring managers like to do this because they want the opinions of other people who’ll work with the person, but I feel it was done to excess here. Only barely 3 of those people really should've been there, it seems. \r\n\r\nI will say, the parking situation is horrendous. I was given a map showing which lots to park in, only to arrive and find the closest lot full. I found openings in the farther lot, and had to figure out how to pay for parking. This involved downloading the Parkmobile app and creating an account, etc. (Would’ve been nice to be told of in advance, so that I could've had it done prior.) After all that, I had to walk a 1/2 mile (not exaggerating) in heels and a skirt, in cold weather. Salt in the wound: when I reached the building, I saw Visitor Parking right outside, which I could've used, but wasn’t told about. \r\n\r\nOnce inside, my recruiter greeted me, and we stood waiting for our giant meeting room to free up. The interviewers started to trickle in and stand with us awkwardly. I was trying to thaw out, plus ignore the pain in my knees from the walk, while trying to be professional and social, and not say anything stupid - fun stuff! Usually when you interview, you don't stand around socializing at first, so this was a new one. \r\n\r\nOf course, once the room freed up and we got started, it broke the ice and we got on track. The interview felt a bit...forced...as panel interviews often do. They went around the table, each person getting to ask a scripted question. A few of the interviewers seemed a little bored to be there (I don't think they thought they needed to be there either).\r\n\r\nBy the end of the time slot, I felt really good. I felt like I had warmed everyone up and really jived with the hiring manager especially. The recruiter escorted me out, and she said they were finishing interviews by EOW and she'd be in touch next week, etc. \r\n\r\nI did all the proper thank-you's, and was so hopeful the next week for my phone to ring. It did not.  I emailed the recruiter politely (after about 7 or 8 business days) for any updates on the decision. No reply. \r\n\r\nAt this point, I was in the dark - no clue if they’d decided to not hire after all, had to delay the hiring, etc. I read from other Glassdoor reviewers that they experienced the same, only to get a call a few months later that they got the role. I doubted that would happen here, but you never know. I decided to discontinue following up, and just let it go. The recruiter had been in fast, open contact with me previously, so I knew that if they wanted to reach me, they would.\r\n\r\nI only know that the position is filled because the status of my application finally changed to “Position Filled” in the OSU employment portal. \r\n\r\nTo be honest, I’m really disappointed in OSU. I couldn't even get the respect of getting an email back from my recruiter in response to my follow-up - not even some canned email saying, \"Oh sorry we had so many great candidates to choose from, and it was a tough decision, but we decided to go with someone else.\" To be cut off like that, with no reply at all, is very disrespectful and unprofessional. Especially after I've taken my time to be there, paid 5 bucks in parking, walked a mile total in the cold (wearing heels!), and sat through a panel interview. What a shame.", "Interview Questions": "What was a time you failed, and what would you have done differently?"}, {"date": "25 Feb 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in May 2018", "Interview Descriptions": "The interview process was very well organized and straightforward. They operated like a well-oiled machine. First I was greeted by the director, then I gave a presentation that they asked me to prepare. From there, the interview committee took turns asking me questions in a round-robin style.", "Interview Questions": "What is your vision for the organization?"}, {"date": "14 Apr 2021", "title": "Fiscal Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University (Columbus, OH) in May 2018", "Interview Descriptions": "Typical interview questions.  Talked about myself, experiences and skills related to the position.  Also talked about my interest in working for the University.  Pretty straightforward if you have interviewed anywhere else.", "Interview Questions": "What are some challenges you have faced, and how did you overcome them?"}], [{"date": "15 Sept 2019", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University in Apr 2018", "Interview Descriptions": "Applied online first and wait for over a month to receive the email response to schedule the interview. \r\n2 hours of Skype call about previous and current research projects. received offer about 2 weeks later.", "Interview Questions": "describe the previous project in full detail"}, {"date": "20 Jun 2018", "title": "Sales Recruiter Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Dayton, OH) in Apr 2018", "Interview Descriptions": "Process started by applying online. Was contacted that same day about a phone interview. Phone interview lasted 30 minutes. Was your basic interview and went well. Was brought in for an in person interview. I determined the position was not for me.", "Interview Questions": "What makes you believe you'd be successful in this position?"}, {"date": "3 Mar 2018", "title": "Application Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Just 4 of them meet me in a conference room, very friendly talking. And no hard feelings even if I can not answer their question. Technical questions is only about the concept of something, but I failed to answer that.", "Interview Questions": "What is REST？\r\nHave you ever use JS?"}, {"date": "3 May 2018", "title": "Office Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Ohio State University (Columbus, OH) in Mar 2018", "Interview Descriptions": "The interviewers spoke about the opportunity and duties expected for the position. They then asked several questions about my experience and personality. There were maybe two sheets of questions and two people interviewing.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "5 Apr 2018", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at The Ohio State University (Columbus, OH) in Mar 2018", "Interview Descriptions": "Was billed as a screening interview. Turned into a conference call with three decision makers... I wasn't prepared for that as I've applied for dozens of jobs each week. Could barely hear anyone on the speaker phone. The lead interviewer was rude and had a bad attitude from the start.", "Interview Questions": "Dumb questions. Why are you passionate about student recruitment? Who cares? I just need a job. \r\n"}, {"date": "2 May 2019", "title": "Cybersecurity Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Mar 2018", "Interview Descriptions": "Basic behavioral questions along with what team I would want to work on if I got the job. Other than that there were no technical questions and the whole thing was very easy to do.", "Interview Questions": "Describe youself"}, {"date": "21 Feb 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University", "Interview Descriptions": "Very laid back and cordial.  Relaxed environment. Friendly. Reasonable questions. We sat down and just had a conversation about goals and direction and fit.  \r\n\r\nGreat place. would work there again.", "Interview Questions": "Tell me about yourself. "}, {"date": "5 Feb 2018", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "You have to write Multiple essays on diversity and community.\r\nIn person interview with a hall director and a current RA.\r\nPersonality based questions that focus on community. They ask alot about inclusion. \r\nFeedback by February.", "Interview Questions": "How would you encourage  diversity and inclusion in your community."}, {"date": "12 Feb 2018", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Feb 2018", "Interview Descriptions": "series of questions related to my employment history, human interaction in these roles, how would you describe yourself, talked briefly about what the positions requires\r\nseries of questions related to my employment history, human interaction in these roles, how would you describe yourself, talked briefly about what the positions requires", "Interview Questions": "work history specific to the position\r\nany work relationship issues\r\nseries of questions related to my employment history, human interaction in these roles, how would you describe yourself, talked briefly about what the positions requires"}, {"date": "13 Jun 2019", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2018", "Interview Descriptions": "The interview was very casual and faced pace. Two interviewers with one predominantly speaking and one mainly taking notes. Asked many questions from your application and mainly asked for elaborations.", "Interview Questions": "Why do you feel like a good fit for this role?"}], [{"date": "3 Jan 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University", "Interview Descriptions": "Had a 30 min interview block, and was brought into the Resident Manager's office where I was asked questions by both the resident manager and another office assistant. They took notes on their sheet, while I orally answered questions and it took a total of about 15 minutes.", "Interview Questions": "When was a time you were part of a team and were successful? "}, {"date": "11 Mar 2018", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2018", "Interview Descriptions": "The process took 4+ months. I applied online and the received an email for a face-to-face interview. The interview day itself was horrible because of accident that made me late to the interview. That completely threw me off and effected my interview. The group of men that I interviewed with were very nice. Asked me if I needed anything. I loved talking to them but blew the tech challenge which was disappointing.", "Interview Questions": "How would you obtain requirements from a customer?"}, {"date": "5 May 2018", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at The Ohio State University in Jan 2018", "Interview Descriptions": "Pretty laid back. I applied for lab monitor position that worked really well with my class schedule. They just asked if I had any experience with computers hardware or software. Being a CSE major made it really easy & I got the job.", "Interview Questions": "What is your experience with build computers?"}, {"date": "23 Jan 2019", "title": "Resident Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Jan 2018", "Interview Descriptions": "It was stressful but everyone seemed very nice and welcoming. It was stressful but everyone seemed very nice and welcoming. It was a one on one interview after an application online that many were cute from.", "Interview Questions": "What’s a time that you solved an argument?"}, {"date": "29 Mar 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Ohio State University (Houston, TX) in Jan 2018", "Interview Descriptions": "it was so cool lots of free food and nice hours. would highly rrecomend to anyone looking for a job. twelve out of ten love my life go sports ok more words bye", "Interview Questions": "whats your fav color"}, {"date": "23 Apr 2019", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Jan 2018", "Interview Descriptions": "We had some checklist that we need to do and learn. The checklists are catered to give us a better understanding the jobs as a Student Manager would do and also give us a training.", "Interview Questions": "If one of your workers are slow or distracted and this will affect the daily quota that you need to reach by the end of day, how would you approach this problem? "}, {"date": "17 Dec 2017", "title": "Mid-Level Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Dec 2017", "Interview Descriptions": "It was informal and fairly easy.  I got the sense that they were not interested in me almost immediately.  It was a panel interview -- 3 white males in a male-dominated industry.  The HR generalist explained that they were interested in my qualifications since my experience fit the position.  However, shortly into the interview a member of the panel asked me to discuss my experience in an area that was not noted in the position description.  I addressed his question in detail and as I directed my answer to the other 2 on the panel, I was shocked to see one of the panel members reading (texting?) on his phone and paying no attention during the interview.  The director was on his phone throughout the 40 minute discussion.  In general, I found the panel members to be rude, aloof, and inexperienced at conducting an interview.  This is certainly not what I would expect from a university -- especially Ohio State.  Needless to say, I saw no point in writing a \"thank you\" email to anyone on the panel and I withdrew my interest immediately -- in the position and Ohio State University.", "Interview Questions": "Why do you want this position?"}, {"date": "25 Mar 2019", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Dec 2017", "Interview Descriptions": "Phone interview took about 30 min. They mostly just asked about your availability and told you about the role. I was referred by another employee so I don't know if this is the standard interview procedure. There is a 2 day orientation on campus.", "Interview Questions": "Talk about you previous teaching experience."}, {"date": "1 Nov 2017", "title": "Process Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University", "Interview Descriptions": "It was just a meet and greet. Job was not a fit for retirement.  More jobs than expected are actually “hired”before the job is ever posted.  These “meet and greets”help to determine what kind of position may be posted.", "Interview Questions": "Why do you want to work in retirement. "}, {"date": "5 May 2019", "title": "Senior Operations Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Ohio State University (Columbus, OH) in Nov 2017", "Interview Descriptions": "Took almost 7 months and was absolutely ridiculous. Honestly took the job and turned down two others because it was sold to me as this amazing opportunity and after 8  months of rigorous interviewing I thought - hey - this must really be the real deal.", "Interview Questions": "Describe a difficult situation "}], [{"date": "11 Oct 2017", "title": "Patient Access Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University", "Interview Descriptions": "I was in a room with one woman (there should have been more but I was there so early), she asked me standard interview questions. It was very formal and the woman who interviewed me was a supervisor, but wouldn't have been my supervisor so it felt strange. The first step was a digital interview which was also strange.", "Interview Questions": "How do you motivate people?"}, {"date": "5 Oct 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at The Ohio State University (Columbus, OH) in Oct 2017", "Interview Descriptions": "The interview was held in the Resident Managers office with him and another Office Assistant. It was relatively informal and he seemed very interested in what I had to say. Pretty enjoyable experience, only took about 20-25 minutes.", "Interview Questions": "How would you maintain privacy and confidentiality in regards to residents?"}, {"date": "13 Sept 2017", "title": "Computer Systems Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "good and very pleasant very nice people with great patience and communication. Provide timely update to candidates. Overall the experience was very nice. And I am a osu alumi go bucks!", "Interview Questions": "N/A"}, {"date": "15 Sept 2017", "title": "Student Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Sept 2017", "Interview Descriptions": "Applied online. They replied within 2 days to set up an interview. They asked some pretty hard questions for a pretty simple job that was only 15 hours a week.", "Interview Questions": "Give an example of when you had a lot of tasks to do, but not a lot of time to do it"}, {"date": "20 Mar 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Sept 2017", "Interview Descriptions": "My colleges referred me this opportunity.\r\nThen the team leader emailed me and then asked for a onsite interview.\r\nTook 30 mins, general interview question about the CV, and some behavior questions. Everyone was very friendly and easy to talk.", "Interview Questions": "Why do you apply for this position"}, {"date": "2 Sept 2021", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Sept 2017", "Interview Descriptions": "Four steps:\r\n\r\nA phone interview with the hiring manager \r\nAn interview with the team I’d be working with \r\nWritten skills test \r\nAn interview with the boss of my boss \r\n\r\nEveryone was friendly.  The phone interview was easiest, just asking about me and telling me about the position. The second was a couple hours long and involved about seven people! Everyone was really nice, though. By the third, the executive admitted he was just about convincing me to take the job. I enjoyed it overall.", "Interview Questions": "Tell us about a time you overcame a challenge and what resources you used to do it."}, {"date": "2 Apr 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Sept 2017", "Interview Descriptions": "Very quick and easy process with nice staff. Very friendly and nice environment. Employer was very professional and asked very intriguing questions.  Asked if I could work night shifts to accommodate for class schedule.", "Interview Questions": "Can you work night shifts"}, {"date": "11 Jul 2017", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University", "Interview Descriptions": "There was no real interview process for this position.  The employer just required that you were an Electrical and Computer Engineering student and that you took the labs and performed well in them.", "Interview Questions": "Whats your name?"}, {"date": "20 Sept 2018", "title": "Sales Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2017", "Interview Descriptions": "Submitted online application.  Telephone Interview. Manager Interview. Team Interview. Called every week for 3 weeks. Then, telephone call stating another candidate had been hired. There was not further follow up after this time.", "Interview Questions": "How much sales experience do you have? In particular, sales, hotel, meeting planning and event coordination.? "}, {"date": "8 Jun 2017", "title": "Field Station Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Interview process was very easy. Asked simple questions about your experience and how you get along with others. Heard back the next day if I was offered the job or not. You want to be able to work the whole season 6 months. they don't want people who are working half the season or just summer.", "Interview Questions": "how long are you available for? "}], [{"date": "14 Dec 2017", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jun 2017", "Interview Descriptions": "I showed up and left a resume for them to review. They contacted me back to inform me that I had gotten the job. I also happen to know they would have contacted me if I had NOT gotten the job. We scheduled an interview that fit with my schedule and and I came in. After that came several weeks of filling out paperwork and waiting for things to happen.", "Interview Questions": "How to fix a problem, handle an upset customer, etc. I assume they change it for every person."}, {"date": "3 May 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "Overall it went smoothly. The interviewers are very nice. They ask lots of detail questions about the research and techniques. So be prepared to know your job duties well.", "Interview Questions": "tell me about yourself "}, {"date": "30 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in May 2017", "Interview Descriptions": "Very casual and comfortable interview with two people from the department. Only lasted 20 minutes and the questions asked were straightforward and easy to answer. Asked a few hypothetical/scenario type questions, but nothing too daunting or complex. Overall a very easy and pleasant interview, and they basically offered me the position at the end of the it all.", "Interview Questions": "What has prepared you to work with a diverse group of people?"}, {"date": "15 Jan 2021", "title": "Senior Lecturer In English Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in May 2017", "Interview Descriptions": "The interview was reasonable and what I'd expected, given the job description. I should add that I was coming from the inside, which made it easier. (I'd already worked there.)", "Interview Questions": "How I would teach a class. "}, {"date": "6 Apr 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Met with the program leader and the professor that I would be assisting. There was very little else to do. Probably the most difficult part was discovering the program and going to find the people that could help me. I spoke with many professors until I located the program that had an open slot for me.", "Interview Questions": "Why I wanted to do research, how my class schedule would affect me, if I had enough time available to put 10 hours per week in."}, {"date": "9 Mar 2020", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Apr 2017", "Interview Descriptions": "I had an in-person interview. Questions asked were behavioral, given an offer the following day. Parts of the interview involved describing what CDME does, and projects that they have created that is being used today.", "Interview Questions": "What is your greatest weakness"}, {"date": "29 Apr 2017", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Apr 2017", "Interview Descriptions": "Applied online. Received a phone call to interview about a week later. Received an in-person interview a week or so after that. Offered a position one week from in-person interview.", "Interview Questions": "How do you respond to changes in policy or procedures? "}, {"date": "31 Jul 2017", "title": "Training Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University (Columbus, OH) in Apr 2017", "Interview Descriptions": "What interview? They post a job with very specific qualifications and then don't call the people who have those very specific qualifications. I had a brief chat with the hiring manager - then...ghost.", "Interview Questions": "Why are you interested in this job?"}, {"date": "12 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Apr 2017", "Interview Descriptions": "I applied online. the process was relatively straightforward, I received an email that asked me to schedule an in-person interview with my supervisor. It was a very standard interview with behavioral questions that tested fit and my past work experiences. Low pressure and casual.", "Interview Questions": "Tell me about yourself"}, {"date": "28 Mar 2017", "title": "Resident Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "It lasted about 45 minutes and was a professional but friendly atmosphere. This is dependent on the interviewer because though all the questions are standard, the interviewers are almost always going to be different.", "Interview Questions": "Why do you want this position? "}], [{"date": "21 Mar 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Applied online, was emailed back about interview times, set up interview time, 20 minute interview with a hiring manager, got an email that said I got the job within a few days.", "Interview Questions": "Describe a a time where you displayed leadership"}, {"date": "17 Sept 2017", "title": "Front Office Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University (Carrollton, OH) in Mar 2017", "Interview Descriptions": "Online application followed by panel interview of 5 current emoloyees, 3 in County, 2 out of County.  Each person asked their own questions. Required submission of 2 to 3 skills assessments. Interview lasted about 45 minutes.", "Interview Questions": "If one of the office personelle was busy, and a customer wanted to speak with them, how could I respond to customer respectfully?"}, {"date": "27 Feb 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University", "Interview Descriptions": "I applied and heard back quickly from hiring manager. I was first interviewed by the manager, and then the administrator of the department I applied for. Both the manager and administrator were helpful in making sure I had directions on how to get to location and made me feel comfortable. Overall, very positive experience and no surprising questions.", "Interview Questions": "Tell me about a situation where you encountered conflict and how did you handle it. \r\nGive example of a time when you had to work with others that were different from you. "}, {"date": "26 Aug 2020", "title": "Buckeyebox Maintenance Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Feb 2017", "Interview Descriptions": "Initially received the offer from a previous professor. Afterwards I was able to meet with university research assistants and talk to them about what the position was about. They told me it was unpaid.", "Interview Questions": "Hour's im available and times to start working"}, {"date": "19 Jan 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "they asked me a lot of behavioral questions, they asked me about my personal accomplishments, what I do best, what I do not do best. what are my strengths? what are my weaknesses? How have you shown leadership within the company already?", "Interview Questions": "How would you handle a situation where the line is out the door and you are down an employee?"}, {"date": "11 Jan 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Administrative HR staff in Psychology Dept interviewed me and made attempts to get me to side with them vs. faculty and students. Created negative perception of faculty and some individual staff. Not confidence inspiring or a nice welcome.", "Interview Questions": "How do you deal with difficult people? "}, {"date": "21 Jun 2019", "title": "Graphic Design and Marketing Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jan 2017", "Interview Descriptions": "It was very pleasant! They were extremely easy to work with and respectful of my time and needs. The team I spoke with was very laid back and flexible with interview times. We had a conversation that was relaxing and comfortable. They were clear and concise about what they needed out of me and also wanted to know what I wanted/needed from them as a team. They called me after my second interview/after completing the project for them and were very kind. They encouraged me to apply in the future, that it was a very difficult decision between choosing myself and the other candidate.", "Interview Questions": "They asked me to design a project for OSU itself in the interview process."}, {"date": "13 Aug 2017", "title": "Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at The Ohio State University in Jan 2017", "Interview Descriptions": "The hiring process went every fast. Human Resources will not return your calls. The interview is a panel interview. Little much when you think your walking into a two or three person interview.", "Interview Questions": "What is OSHA"}, {"date": "6 Dec 2017", "title": "Student Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Jan 2017", "Interview Descriptions": "The interview was an In-person interview. Most of the questions asked were about the food service and hospitality sectors. Some personal questions were based on time and conflict management. The interview also consisted of making me familiar with the processes around the building.", "Interview Questions": "Describe an excellent dining experience?"}, {"date": "7 Jan 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Jan 2017", "Interview Descriptions": "Digital  Interview I did not like it.  Had a lot of problems setting up,  After I got all the problems worked out I did not want to do the interview.", "Interview Questions": "Why I want to leave my current employment "}], [{"date": "28 Feb 2019", "title": "Student Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jan 2017", "Interview Descriptions": "Submit student cook application online and wait for the director to contact you, then you will have a personal interview and it takes around 15 minutes. After 2 or 3 days, you will receive another confirmation email  that you need to turn in some documents and start to work.", "Interview Questions": "why you want to work at Courtside? "}, {"date": "13 Apr 2017", "title": "Building Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Dec 2016", "Interview Descriptions": "I met with a group of three people .  The position was between me and one other person after the interviews.  The other candidate was chosen because he had a little more direct experience.", "Interview Questions": "Describe your current job"}, {"date": "19 Sept 2017", "title": "HR Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Dec 2016", "Interview Descriptions": "Initial contact was a telephone screen from the HR department.  A week later the HR contact called to schedule another telephone interview with the manager and Director of Department.   I was then contacted by HR to schedule a face-to-face interview with the manager, technical manager, Director of the department.", "Interview Questions": "How do you juggle multiple priorities?"}, {"date": "11 Nov 2016", "title": "Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University", "Interview Descriptions": "An 1-hour algebra test, explain problems in detail. (imagine that interviewers are the students you will help in the future)                                            a", "Interview Questions": "explain how to give hint on a problem from textbook"}, {"date": "26 Mar 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Nov 2016", "Interview Descriptions": "Submitted application online, received offer to interview within a week, brought in for a very relaxed approximately 30 minute interview with two individuals. Was offered the job within the week of the interview.", "Interview Questions": "What was your favorite and least favorite part of your previous job?"}, {"date": "26 Oct 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Nov 2016", "Interview Descriptions": "Simple process. I emailed my cv to the professor. He didn't reply. I then went to his office slide a hard copy of my cv and a summary of my strength into his door. He hired me as an hourly paid employee at first. and then offered me funding several months later.", "Interview Questions": "He didn't ask me many questions because he just needed to hire me as an RA to do some simple work at the beginning. "}, {"date": "12 Oct 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Columbus, OH) in Nov 2016", "Interview Descriptions": "The interview was fairly simple. I was told about all the things I would have to do in the position, and I was then asked why I thought i would be a good fit for the position. Standard stuff", "Interview Questions": "tell me about yourself"}, {"date": "9 Oct 2016", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University", "Interview Descriptions": "General process ask me why you apply for this job, 1:1with professor, you have to have high GPA on your major courses, test your customer service skills because you will face lots of question from student. be patient", "Interview Questions": "N/A"}, {"date": "18 Apr 2017", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Oct 2016", "Interview Descriptions": "Straightforward questions partaking to help desk experience. More than anything looking for competency, and sociability. Most if not everyone there was just trying to find someone who could work well with a team. You will be working closely with a lot of other faculty, and students. The things you will be doing would be learned on the job, so just being able to be social is important. Smile and look normal, and you should be good to go.", "Interview Questions": "Tell us a little bit about your resume? Have you ever dealt with customers? How are you with working with computers?"}, {"date": "6 Sept 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University (Columbus, OH) in Sept 2016", "Interview Descriptions": "Very short (about 20 minutes) interview with the Resident Manager of that hall. Asked mainly behavioral questions. Very casual and friendly interview. Interview process is competitive, not as much as the RA, but it is a good job.", "Interview Questions": "Why do you want to become an OA?"}], [{"date": "18 Sept 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Sept 2016", "Interview Descriptions": "Very quick and to the point. I enjoyed how pleasant and genuine it felt. They will ask about your proficiency with software and customer service. They will also want to test your interpersonal communication skills,a s you will be working with a lot of different backgrounds.", "Interview Questions": "How have you handled an unruly customer in the past?"}, {"date": "24 Oct 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Sept 2016", "Interview Descriptions": "Formal, with Resident Manager who is also a student. Resident Advisor or Building Manager (non-student) may also be present during the interview process. Formal dress but a relaxed environment, usually in your own residence hall.", "Interview Questions": "What makes you think that you are a good fit for this position?"}, {"date": "22 Aug 2019", "title": "Post Doc Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Sept 2016", "Interview Descriptions": "Met with advisor and lab leaders then took a tour of the lab. Asked questions in advisors office and asked questions by leaders amping the group. Met the group and they asked questions.", "Interview Questions": "How will you benefit the lab. What can you bring? "}, {"date": "11 Sept 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Aug 2016", "Interview Descriptions": "just a basic interview. very personable and relaxed. Just casual and basic questions.  they were very short staffed so it was easy to get hired. just a basic interview. v", "Interview Questions": "tell me about yourself"}, {"date": "26 Sept 2016", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Aug 2016", "Interview Descriptions": "very relaxed atmosphere. It is expected that you are relaxed and answer questions honestly. It is in your interest to do so because they will expect whatever you say in your interview to be forreal and on top of it you interact with those that are interviewing you every day.", "Interview Questions": "When was one time that you showed you had leadership?"}, {"date": "8 Jul 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Called within 24 hours of submitting my resume. I had a 50 minute phone interview that was very friendly and not too complicated. I was very qualified for the position as I have been doing the same work for many years, but did not move on to the next round for panel interview. I had to email the phone interviewer to find out about my status and they responded 4 days later. I followed up for feedback to improve candidacy, but they did not respond to this.", "Interview Questions": "Walk me through your resume"}, {"date": "12 Apr 2017", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Ohio State University (Columbus, OH) in Jul 2016", "Interview Descriptions": "Application portal online. Was invited for in-person interview 4-6 weeks later. Didn't hear anything for 3-4 months during which I reached out to the interviewer twice. After some time I saw the position re-post. Guess I didn't get the job, I didn't contact interviewer again.", "Interview Questions": "How do you motivate different types of people?"}, {"date": "23 May 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "1. Applied online at jobsatosu.com\r\n2. Invited for in person interview via telephone/e-mail (60+ applicants - interviewed 5)\r\n3. Interview with two staff members and HR employee\r\n4. Heard back one week later and was told that I had a lot of experience but they wanted someone who had more experience working with faculty members at OSU or another university (non-staff members like professors)", "Interview Questions": "What experience do you have working and interacting with faculty members at the university?"}, {"date": "28 Aug 2020", "title": "Steward Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in May 2016", "Interview Descriptions": "I applied online. The hiring manager called me a week or two later and we had an informal phone interview, and afterwards he offered me the job. They sent documentation via email the next week.", "Interview Questions": "How do you deal with difficult customers?"}, {"date": "21 Apr 2016", "title": "Resident Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "There is an app., essay, and an interview process in front of 2-3 people. It was stressful, but the people are nice. It was stressful, but the people are nice.", "Interview Questions": "Tell about a time when you overcame a challenging situation."}], [{"date": "15 Sept 2016", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Apr 2016", "Interview Descriptions": "The interview process was very simple. Come prepared with a basic resume (or in some cases the one you previously submitted is enough). Usually another student is doing the interview so it feels very laid back; however, this definitely does not make it any less serious. A big part of the interview was the interviewer giving a hypothetical situation with a customer and asking you how you would handle the situation. They are especially looking for strong leadership skills.", "Interview Questions": "What are your strengths?"}, {"date": "11 May 2016", "title": "Security Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Apr 2016", "Interview Descriptions": "I tested for my abilities and experience in this type of work. I was then contacted by a supervisor who set up an interview within the week. I sat before a board of 5 very professional and experienced public safety employees who, in a very relaxed environment asked me specific questions and for examples of my past experiences. This was rather refreshing being that they were not the usual interview questions.", "Interview Questions": "Described past security experience."}, {"date": "7 Mar 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Cleveland, OH)", "Interview Descriptions": "Panel Interview ending with a demonstration. Consisted of myself and three of the department heads. They asked the typical interview questions, and ended with a 8 minute demonstration on how to make a peanut butter and jelly sandwich.", "Interview Questions": "Would you be able to keep control of your presentation even with young children?"}, {"date": "29 Mar 2016", "title": "Residence Hall Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Mar 2016", "Interview Descriptions": "I did a first round in person interview with Ohio State. It was a really simple and straight forward interview. Alll of their questions were based on their 4 core values - community, learning, inclusion, and wellness. There was one question for each value, and it was basically \"How do you incorporate x into your work?\"", "Interview Questions": "How do you incorporate wellness into your work?"}, {"date": "26 Jan 2020", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Mar 2016", "Interview Descriptions": "Just a quick meet and greet with the Dietetics lead after a review of your resume. Interviewer was very kind nice but it took a while to confirm the interview itself.", "Interview Questions": "Are you a student?"}, {"date": "17 Mar 2017", "title": "PGY1 Pharmacy Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Feb 2016", "Interview Descriptions": "After submitting a written application, I interviewed on site during a tour of the various residency positions within the OSU Residency Program. I had a chance to observe each of 3 various primary practice sites, as well as interview with the current residents and residency preceptors and director.", "Interview Questions": "Why do you want to complete a community pharmacy residency?"}, {"date": "15 Mar 2016", "title": "Resource Planning Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2016", "Interview Descriptions": "The process started with a phone interview. The recruiter said he would present my information to the hiring team. I was selected for an in-person interview. The interview was scheduled for 2 hours. I met with the whole team in the interview. I was asked to bring a work sample. It has been over a month but I have not heard back even after a follow up email. I assume I was not selected.", "Interview Questions": "Give an example of working in a cross-departmental project."}, {"date": "7 Oct 2017", "title": "Web Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Feb 2016", "Interview Descriptions": "The interview was an hour long, asked very basic questions of coding languages pertaining  the job. Was not given an offer immediately, but was emailed fa couple months later asking me if I still was interested in the position, which I was.", "Interview Questions": "What is the difference between private and public classes in Java?"}, {"date": "26 Aug 2018", "title": "CFAES - Project Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jan 2016", "Interview Descriptions": "Easy. Group interview. I believe that they were seeking a warm body to fill a vacancy. It did take a long time to actually move the process along. The team was very inviting. Just seemed like a \"get to know you\" session.", "Interview Questions": "Q: Tell us about yourself."}, {"date": "28 Jun 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Jan 2016", "Interview Descriptions": "It took about half an hour and they asked  general  behavioral questions including please introduce your self and why did you want to apply for the position and so on. The process was smooth", "Interview Questions": "What's your weakness?"}], [{"date": "9 Mar 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Jan 2016", "Interview Descriptions": "Asked professor if they had research opportunity.  The professor I emailed had a position and my qualifications fit the position.  They want to know if you are really interested in researching in the group and that you want to go to graduate school.  In my case I would like to do both.  Great opportunity.", "Interview Questions": "What interested you in this research group?"}, {"date": "24 Sept 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Dec 2015", "Interview Descriptions": "Interview process is easy and simple. You fill out an online form and the manager calls you if they like your answers or if you have relevant experience. Then there is a short 10-15 mins interview asking basic questions. the manager will let you know if they want you or not right then. You start working soon after that. you have a 2 day oreintation for which you get paid and also some skills training for which they pay you.  It a simple process overall.", "Interview Questions": "WHy do you wnat work here?\r\nwhy do you like dining services?\r\nhave you worked in dining servies before?\r\nhave you worked as a sales person before?"}, {"date": "25 Nov 2015", "title": "Systems Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "I was interviewed by the senior team of the research lab who were working on the major grant that is being hired through.\r\n\r\nI came in with resumes for everyone and we began. I was asked a series of questions varying from technical expertise to personal hobbies. \r\n\r\nAt the end, I was told to keep my ear out for a call for my references.", "Interview Questions": "How do you handle high pressure situations? "}, {"date": "23 Nov 2015", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "They had a two cut process. One was online application and another was a in person interview. The in person interview weigh significantly as you must answer key points and you are rated right after the interview. There were many applicants for this position. I also had to interview with a potential Hall Director in order to see if I would be a good fit with them. After this was completed I was given an offer.", "Interview Questions": "What makes you want to be a RA/CA?"}, {"date": "18 Dec 2015", "title": "Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Nov 2015", "Interview Descriptions": "Short and sweet sit down. Lengthy certification and training process. The head trainer has a very strong background in sports and fitness, so there is also a practical process where you have to prove your skills through demonstrative effort. You must also pass the certification exam and achieve a satisfactory score on the entrance exam while also providing certification in CPR/AED.", "Interview Questions": "What do you do when your client feels sick?"}, {"date": "19 Jan 2016", "title": "Director of Youth and Family Education Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Oct 2015", "Interview Descriptions": "There was a one-on-one interview with a woman who would be my immediate supervisor. After that interview, there was a panel interview with five women asking me questions. The panel interview was intimidating, and three out of the five women kept poker faces the entire time. The overall experience was not awful and I was surprised to learn that I did not get the job.", "Interview Questions": "One thing the panel asked me was have I had trouble with people of color on the job and, if so, how did I handle it."}, {"date": "29 Dec 2015", "title": "Media Relations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Ohio State University (Columbus, OH) in Oct 2015", "Interview Descriptions": "The interview process was very formal, at first, compared to what I'm used to. An assistant set up the interview with me via phone and email, set ample documents about an interview itinerary (that was a first), parking, etc. Once I met with the two folks I was interviewing with, though, it was less formal and comfortable. They were very professional, seemed genuinely interested in me and what I was saying. It was also more of an intellectual conversation, rather than being grilled. I appreciated their professionalism while also being sociable and welcoming.", "Interview Questions": "What type of people do you not work well with?"}, {"date": "6 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Sept 2015", "Interview Descriptions": "Applied online then brought in for an interview. The employees were friendly and easy to get a long with. I can see how it is very competitive to get a job with Ohio State.", "Interview Questions": "What is your favorite book to read?"}, {"date": "9 Dec 2015", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Sept 2015", "Interview Descriptions": "The interview was a standard on campus interview. they asked about major and sills for the job. They asked about any past experience that could be helpful. They asked about other things like schedule and understanding of task and the like.", "Interview Questions": "What makes you a team player?"}, {"date": "2 Nov 2015", "title": "Dining Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Aug 2015", "Interview Descriptions": "Asked some basic question by manager and hand in your schedule time sheet.Then they will ask where do you want to work and which type of working you prefer, also they would tell you the training and working hour if you are hired", "Interview Questions": "Do you have previous experience working at dining service"}], [{"date": "30 Sept 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Aug 2015", "Interview Descriptions": "very short and sweet. A few common questions regarding strength and weaknesses and position at the university with your future Resident Manager, then you were out of there. Everyone was super freindly, not intimidating at all", "Interview Questions": "Name one weakness"}, {"date": "25 Jul 2015", "title": "Nurse Navigator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Telephonic and then face to face meeting. we reviewed my history and why I wanted to work at that site. We discussed the position and the requirements needed for the job.", "Interview Questions": "why should they hire me."}, {"date": "11 Jun 2015", "title": "Graduate Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University", "Interview Descriptions": "No interview required, so it was really easy. Only have to submit paperwork (tests, essay questions?, letters of recommendations), and if pass the screening, get offered a position. At least for my department (physics), will then be given the opportunity to come to the open house, where they try to convince you to attend Ohio State. Basically, a few days of tours, free food, and getting to know the faculty/ other students.", "Interview Questions": "N/A"}, {"date": "11 Jun 2015", "title": "Systems Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at The Ohio State University", "Interview Descriptions": "Talked to the department heads as well as the dean of the individual college.  It was an informal chat where they discussed my prior experience, my interests, and what I could contribute to the college.  They were very friendly and there was little to no pressure.", "Interview Questions": "What made you want to apply for this position?  "}, {"date": "9 Dec 2015", "title": "Building Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jun 2015", "Interview Descriptions": "A brief phone call was made to me and we discussed some of the aspects of the business and my qualifications for the job.  There was no follow up and the only reason I knew that I didn't get the job was because they changed the positions listing from \"searching\" to \"filled.\"", "Interview Questions": "Do you know what it means to be a five star hotel? "}, {"date": "23 Mar 2018", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in May 2015", "Interview Descriptions": "Rather difficult to get a call back when you enter your application through the traditional portal; it helps if you know someone who works there. I had one phone call with the manager and then was called in for an interview. After the interview, I sat down with members of the staff and they asked me routine questions and allowed me to ask them more questions about the overall environment.", "Interview Questions": "How well can you deal with stressful situations"}, {"date": "12 Sept 2016", "title": "Welcome Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in May 2015", "Interview Descriptions": "There is a group interview process. The main idea is to see if you can effectively communicate with others and have the knowledge of the campus and the cities.\r\nThe next step is to let the group take turn to answer the questions, the questions are all the subjects that relates to life experiences", "Interview Questions": "If your activities encounter the unanticipated bad weather, what you will do?"}, {"date": "17 Sept 2018", "title": "Apple Certified Mac Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in May 2015", "Interview Descriptions": "Simple, one time interview. Straight up questions. Easy questions that tested a general working knowledge of the skills that would be required to discharge the duties of the position. No tricks.", "Interview Questions": "\"what is your experience, in general, with repairing hardware?\""}, {"date": "18 Apr 2015", "title": "Assistant Professor Clinical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "they take great care of you, scheduling all your travel arrangements. applied on line, then talked to recruiter then chair of dept division. then went out for interview. offer followed soon after", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "19 Oct 2016", "title": "Systems Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Apr 2015", "Interview Descriptions": "The hiring process took a very long time. Just over a month from the time the application is submitted to the time I accepted the offer. The online application process was very tedious. There are several questions to fill out, plus filling out all the previous job experience and salary information. When I was called in for an interview, I met several managers who sat around a table with me and asked me several questions. That can be a bit unnerving if you are not used to several people interviewing you at the same time. A lot of the interview was about personality. How well can you interact with the clients and with the team. Some of the interview was about previous experience.", "Interview Questions": "How do you feel about telling people No?"}], [{"date": "2 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Apr 2015", "Interview Descriptions": "Very informal and easy. I came in for a ten minute interview that went over my resume and qualifications. They asked some behavioral questions and that was at all. The interview was at a dining hall. I was hired on the spot. If you seem like a good person they will hire you right away and you will start training very soon.", "Interview Questions": "What would you do if there was ever a conflict between a worker and a customer?"}, {"date": "8 Mar 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University", "Interview Descriptions": "I went in for the interview and the supervisor told what the job entailed and asked me a few general questions. He had basically decided to hire me before I even came in for the interview. If you are fortunate to e-mail or contact at the right time, you've pretty much got the job because there are no real qualifications. It's just an entry level job.", "Interview Questions": "What experience I had previously"}, {"date": "5 Apr 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Mar 2015", "Interview Descriptions": "I just had to submit my resume along with my preferences as an email to the Graduate chair and then they shortlisted by CGPA. After this i had a discussion with the professor where he asked me some basic questions", "Interview Questions": "What are your subject preferences and Why"}, {"date": "8 Feb 2017", "title": "CSE Lab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Mar 2015", "Interview Descriptions": "Over the phone, when are you available to start, started immediately. I think they should require an assessment of some sort or increase the minimum grade requirement in order to have this position. A lot of my coworkers are not skilled in this course and therefore cannot help students", "Interview Questions": "When are you available to start"}, {"date": "14 Feb 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University", "Interview Descriptions": "Two interviews. There was an online application that I filled out. \r\nI was contacted by a member of the research team to schedule an interview. \r\nThe first interview lasted about an hour and the second interview lasted 45 mins. No update on salary.", "Interview Questions": "Why do you want this job?\r\nWhat do your days consist of?"}, {"date": "18 Feb 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "It cannot be called an interview since it is just a free conversation about what you like. Like what do you think of something. I cannot remember what the question is. But it is a great interview.", "Interview Questions": "Do you have programming experience?"}, {"date": "25 Sept 2015", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2015", "Interview Descriptions": "The interview went about 25 mininues. They will asked about the introduction of yourself. Then you just go over the information on the resume. The most important question is about the planning of your academic career. Make sure to mention about the research plan, thinking about applying the master degree.", "Interview Questions": "What course are you taking right now?"}, {"date": "23 Oct 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2015", "Interview Descriptions": "It was fairly relaxed but informative. I learned more about that studies that the research team was involved in. I also discussed about what my role would be in the team, what types of things I would be learning, and what else I needed to do. I was informed that I needed to get a background check which took quite a long time since I'm not American.", "Interview Questions": "Would you be comfortable shadowing a psychologist and sitting in on assessments?"}, {"date": "5 Mar 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2015", "Interview Descriptions": "Position was for Fisher College of Business. Applied online and heard from them really quickly - within a day - which from what I've gathered is pretty amazing since everyone says OSU tends to have a slow hiring process. Interview was scheduled for about a week later with a director and associate director. The staff was extremely friendly and easy to talk comfortably around. They were very team oriented and presented a fun fast-paced work environment. Asked quite a few questions but were also very informative and it was nice that they told me exactly what they liked about my resume from the get-go so I knew what skills to focus on when I answered. At the end, they said they would be in contact with me within a week or two because they were hoping to hire quickly. It's been almost a week - fingers crossed.", "Interview Questions": "Tell me about yourself. "}, {"date": "17 Feb 2017", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at The Ohio State University in Feb 2015", "Interview Descriptions": "Application process was fairly lengthy with many essay questions about the pillars of the department (community, inclusion, wellness and learning). After application was reviewed, offered an interview that consisted of ~10 questions gauging how you would perform in the position and your understanding of the roles and responsibilities of the job", "Interview Questions": "Talk about a time when you worked with someone different than yourself"}], [{"date": "5 May 2016", "title": "Cafe Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Feb 2015", "Interview Descriptions": "it was through an on line application. then i got an email informed me to schedule  a face to face interview with the manager. i got the offer that day through an email as well. it was very fast and easy.", "Interview Questions": "when will you be available to work"}, {"date": "25 Jan 2015", "title": "Systems Specialist Business College Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University in Jan 2015", "Interview Descriptions": "From the time of the application to the time of an actual first interview was about 3-4 weeks. Interview was good and conducted in a professional manner. The questions were all about what you would expect for the position. If you do your homework you should be fine as long as someone's friend isn't pegged for the position.", "Interview Questions": "There really wasn't a real difficult question, for this position but there were a couple of active directory questions but there were basic"}, {"date": "9 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Jan 2015", "Interview Descriptions": "Since I was on campus at that time, I emailed the professor that I am interested in and scheduled a face to face interview in the office. After a few days, I received the offer.", "Interview Questions": "What is your research experience?"}, {"date": "14 Mar 2017", "title": "Career Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2015", "Interview Descriptions": "Initial phone interview with a panel. Second interview was over skype, also with a panel. Third interview was in-person. First with executive director, then with hiring manager, then a presentation to a large group. I was asked to present on a topic relevant to the role.", "Interview Questions": "How would you advise a student wishing to change careers?"}, {"date": "16 Jun 2016", "title": "Window Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jan 2015", "Interview Descriptions": "It is very easy. After you submit your application online, you might receive an email from the supervisor. During the interview, she or he will ask general questions about you, what kind of CSE courses you have ever taken, and your available time and day.", "Interview Questions": "What kind of CSE courses have you ever taken?"}, {"date": "27 Feb 2017", "title": "Banquet Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Jan 2015", "Interview Descriptions": "Interview process was very easy. The manager was very friendly and i got the job right on the spot. Just asked me what days i could work and how many hours i was looking for.", "Interview Questions": "When would you want to start working "}, {"date": "30 Dec 2014", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at The Ohio State University", "Interview Descriptions": "Initially you need to fill out the application form online\r\nThen you need to Call and fix appointment for interview\r\nInterview would be mostly towards behavioral type of questions\r\nOnce the Interview is done you will be sent either an offer letter or a reject letter based on your performance in the interview\r\nOnce you get the offer letter you need to complete the paper work to get the starting date", "Interview Questions": "What makes a team sucessful"}, {"date": "6 Apr 2015", "title": "Project Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Dec 2014", "Interview Descriptions": "A consulting firm assisted with the hiring process, which included an over the phone interview and in person interview with the staffing agency, then interview with the company and after the consulting firm performed background checks and drug testing", "Interview Questions": "specific experience with fiber outage"}, {"date": "27 Jul 2015", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Dec 2014", "Interview Descriptions": "Well there was not much an interview process for me.  Went to the advisor's office, talk a little about what I did at graduate school, went over the project they wanted me to work on, and I signed the one year contract.", "Interview Questions": "Tell me the project that you enjoyed the most? "}, {"date": "21 Dec 2015", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Dec 2014", "Interview Descriptions": "I was persistent and applied for the job more than once in order to get an interview. There was one 1:1 interview with the future boss. It was very straightforward and easy. Asked the basic interview questions. Need a keen eye for detail. I was offered the position a couple weeks after the interview and started within the month.", "Interview Questions": "What is your biggest fear?"}], [{"date": "27 Oct 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "It was one to two months after I applied online that I got the interview. I think there were well over 100 applicants and less than five interviewees. I was interviewed by two managers and one support staff. They were incredibly welcoming and I heard back within two weeks.", "Interview Questions": "The standard: What are your greatest strengths and weaknesses."}, {"date": "23 Oct 2014", "title": "Member Service Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Submit your resume online and then you will receive a email from the manager to tell you fill out a survey and then they can know more about you. The interview is easy and all behavioral questions and it is a group interview.", "Interview Questions": "No Difficult question. "}, {"date": "19 May 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Oct 2014", "Interview Descriptions": "The interview process consisted of a typed application that was handed in. Afterwards, a smaller pool of applicants was asked to come in to interview. The interview was with the AHD and another office assistant. The questions were all behavioral.", "Interview Questions": "How would your friends describe you?"}, {"date": "30 Sept 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at The Ohio State University", "Interview Descriptions": "I interviewed with Travel, Pcard and Expediting Department. It is not hard. The manager just asked me the past working experience, graduation day and the hobby. She is very kind and encourage me to talk more about myself. I really love my job. I worked in the Expediting team and have great working experience to prepare for the future full time job.", "Interview Questions": "N/A"}, {"date": "16 Sept 2014", "title": "Student Grader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "There is no interview for this position. The only requirement is that you need to get an A in the this course that you are going to grading on, and you'd better have enough when student keep asking you same questions", "Interview Questions": "N/A"}, {"date": "8 Sept 2014", "title": "Rigger/Stagehand Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at The Ohio State University", "Interview Descriptions": "My roommate was approached by Aaron Thomas and was asked if he would be interested in a job down rigging shows at the Schottenstein Center. This job opportunity was then relayed to myself where I then went in for a person interview. Here Aaron asked me a few questions about my past job experiences, did a background check, and hired me. It was a very comfortable laid back interview.", "Interview Questions": "The only one I could possibly think of would be when he asked me if I was afraid to be 100 feet in the air walking the rafters. I already knew this would be part of the job but I guess hearing it in person definitely made my stomach drop for a second."}, {"date": "13 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Sept 2014", "Interview Descriptions": "Just talk about my research experience and how could I contribute to the project. The possible topics which were undergoing were also been introduced to me. And I have to chance to actually choose the topic that I felt interesting.", "Interview Questions": "What courses have you taken?"}, {"date": "6 Aug 2014", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "many applicant the year before, must be punctual with dates. it helps to have friends / acquaintences in University Housing. I knew one of the directors. Once the initial screening happens, the group interviews come. they screen out mass amounts of people thorough watching team building events and how you lead and can play nice with a team. after group interviews are individual interviews with housing directors that liked you in the group sessions. this is the time to be punctual to the T and dressed to impress. they want personality!", "Interview Questions": "how many golf balls would it take to fill this room?"}, {"date": "24 Jul 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "I interviewed for the position four months after submitting application (cover letter, CV, research statement, teaching statement- ~15 pages in total). I received the offer a few weeks after the interview and was officially hired after negotiations after another two weeks. I started work a few months later.  The entire process was about eight or nine months from the time I applied to my start date.", "Interview Questions": "What was my reason for not publishing more?"}, {"date": "12 Jul 2014", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "I applied online and was granted an in person interview. Everyone was extremely kind and welcoming. I sat with three of the leadership team and had a fine conversation. They asked me questions and allowed me to ask questions of them. Very friendly, much more conversational than I expected.", "Interview Questions": "The most unexpected question was their interest in my travels from my business semester abroad, which had been noted on my application. It wasn't particularly difficult, rather it caught me off guard that it would be of interest to them."}], [{"date": "12 May 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University", "Interview Descriptions": "Inperson interview with the Chair of the department, another faculty member and a rep from HR. Lasted about an hour. Was offered the position three days later after they checked my references.", "Interview Questions": "N/A"}, {"date": "29 Sept 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in May 2014", "Interview Descriptions": "We talked about my class schedule and past experience. The supervisor is very nice. And then we talked a lot about my school life, hobbies and many interesting things. It was a very relaxing interview process.", "Interview Questions": "What is your hobby?"}, {"date": "14 Nov 2015", "title": "Ross Mathematics Program Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in May 2014", "Interview Descriptions": "No formal Interview process, just asking about your math classes and math experience. As well as rec letters.\r\n\r\nThey also wanted you to write an essay answering questions about yourself such as your interest, hobbies, background and math classes taken.It helped if you had done the program before so you could just tell them about the math classes you have taken this year and what you were working on at the moment, as well as your major.", "Interview Questions": "Describe your mathematical background."}, {"date": "8 May 2018", "title": "CPC Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in May 2014", "Interview Descriptions": "Telephone interview with HR.  The had me come in to interview with the manager in person.  During the in person interview the tested my coding skills.  HR called to offer the position.", "Interview Questions": "What can you bring to Job?"}, {"date": "18 Apr 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "It was cool. No hard questions. To the point. work related only", "Interview Questions": "What additional non-research based responsibilites can you handle"}, {"date": "9 Sept 2016", "title": "Reseaech Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Apr 2014", "Interview Descriptions": "The interview process was straight forward.   They accomodated foe rescheduling.  Asked questions about management and organizational skills,  software knowledge and past work experiences with similar work.", "Interview Questions": "How would yiu determine thw priority of project if you are given multiple projects at one time?"}, {"date": "30 Aug 2017", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Apr 2014", "Interview Descriptions": "Face to face in depth question and answer process with regArd to my knowledge of the course content. After asking specific subject questions I gave detailed answers with regards to the subject matter and how I would present it to students.", "Interview Questions": "My specific knowledge of specific course content."}, {"date": "31 Mar 2014", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "We just had a conversation and dicusssed the future and how we will proceed. Went through a demo after. It was easy. Was kinda surprised by it.", "Interview Questions": "Can you code?"}, {"date": "12 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at The Ohio State University", "Interview Descriptions": "interview with seniors on staff then panel interview with other workers", "Interview Questions": "what is one of your short comings"}, {"date": "26 Jul 2017", "title": "Senior Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Ohio State University (Columbus, OH) in Mar 2014", "Interview Descriptions": "Disorganized. Interview schedule not provided until night before my flight out, including being asked to present on a requested topic. Did not allow enough time for various meetings or present any sense of what they wanted out of the position. Overall, a lack of professionalism and administrative competence was on full display—canary in the coal mine..", "Interview Questions": "What type of institution would you ideally see yourself working for?"}], [{"date": "27 Feb 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Had to apply online first.  General information, and a few broad essay questions that focus on diversity, problem solving, etc.  If you do well with that (and there is no reason you shouldn't), plus you have a 3.0+ GPA, you get to the interview.  The interview questions are behavioral in nature, dealing with conflict mediation, diversity, stress, etc.  After that, you have the RA class.  It used to be that one would be hired after the class; now you will be hired before.", "Interview Questions": "There were no hugely technical questions.  Just be prepared for answers to conflict mediation and diversity.  Think about the position, and be honest in your answers."}, {"date": "6 Jul 2017", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University (Columbus, OH) in Feb 2014", "Interview Descriptions": "Discuss my learning experience for the course. Prove problem solving skills and sense of responsibility.  Discuss my learning experience for the course. Prove problem solving skills and sense of responsibility.", "Interview Questions": "How do you like the course?"}, {"date": "21 Apr 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Feb 2014", "Interview Descriptions": "Group meeting presentation, ask what are the expectation, show my ppt, ask question, and they showed me the lab and the department, tell me about their research, and ask about my previous experience.", "Interview Questions": "Any question for them?"}, {"date": "23 Mar 2015", "title": "Compensation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Feb 2014", "Interview Descriptions": "There is only one-time interview because it's only a internship. I heard from them within a week. It was pretty quick. The manager is really nice. The recruiter was pretty nice on answering all the questions that I have.", "Interview Questions": "your experience in HR"}, {"date": "4 Mar 2017", "title": "Clinical Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Feb 2014", "Interview Descriptions": "Very relaxed process with relevant questions and excellent interaction.  Met with all the relevant people and found all of the interviewers to genuinely be interested in answering my questions and addressing any concerns.  Overall excellent experience.  No complaints.", "Interview Questions": "What was your main motivation to become a doctor?"}, {"date": "18 Sept 2018", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Feb 2014", "Interview Descriptions": "Schedule appointment with professors in charge of lab and senior phd students working there. The interview asked questions related to past experience and motivation to study and a focus on details.", "Interview Questions": "N/A"}, {"date": "25 Jan 2014", "title": "Administrative Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University", "Interview Descriptions": "Applied online. I received an email a few weeks later for an in person interview with the hiring manager and another person from the department. They were all standard questions to see how you would fit in with the position. I thought I did a pretty good job highlighting my strengths and showing them why I would be great for the job, but I guess they found another person who was even more fitting (or so I was told in an email from the hiring manager).", "Interview Questions": "What would make you stand out from the other candidates?"}, {"date": "1 Jun 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at The Ohio State University (Columbus, OH) in Jan 2014", "Interview Descriptions": "Poorly organized and unprofessional. I've seen  students welcomed more warmly and with a greater sense of purpose. Terrible first impression. There was nothing difficult about it other than overlooking clear indolence and poor administrative practices.", "Interview Questions": "There was nothing difficult about it other than overlooking clear indolence and poor administrative practices. There was nothing difficult about it other than overlooking clear indolence and poor administrative practices. There was nothing difficult about it other than overlooking clear indolence and poor administrative practices."}, {"date": "19 Mar 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at The Ohio State University (Columbus, OH) in Jan 2014", "Interview Descriptions": "Fast interview. They just asked a few generic questions and about experience. Just answer them with common sense. If you´re a student you will almost certaintly be hired. All in all the hiring process took a little bit more than a week.", "Interview Questions": "Have you worked in a diverse environment?"}, {"date": "15 May 2017", "title": "Physics Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University (Columbus, OH) in Jan 2014", "Interview Descriptions": "The interview was very informal, quick, and painless with the manager of the tutoring operation. I spoke briefly about my experience with the Physics department at Ohio State, as well as some other coursework and research I had done.", "Interview Questions": "No technical questions were asked. We really only discussed my experience  at Ohio State."}], [{"date": "21 Jan 2016", "title": "Grader/Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Jan 2014", "Interview Descriptions": "The manager will look at your transcript see if you get A level grade, and if yes, you basically hired and you can choose a time preference on schedule. Then you sign several contract and if you are international student, you need to apply for SSN and fill out some off-tax form.", "Interview Questions": "What's the grade of this course when you took it."}, {"date": "19 Feb 2014", "title": "IT Help Desk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Dec 2013", "Interview Descriptions": "The interview was by committee with five managers. Be prepared. They have standardized questions that each of the members ask. Most of the questions were behavioral. There is also three role playing questions.\r\n\r\nThe role playing is based on how you think through a problem. I didn't do well on one of the questions; actually missed it completely. The real reason they do it is to see how you think things through. Getting it right or wrong isn't the point.", "Interview Questions": "The second role playing question dealt with a pop-up blocker. The interviewer acted like a customer that couldn't make a response to a forum."}, {"date": "18 Sept 2015", "title": "Entrepreneur-in-residence Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Dec 2013", "Interview Descriptions": "It was a promotion within the university and required networking with a lot of the Deans and Senior Administrators within the university. The interview process was a lot of questions around technology commercialization and technology transfer. Following this 1-on-1 questions, I was given a tour of the research facilities on the campus, had several meetings with campus leadership as well as with entrepreneurial focused student organizations. The entire process of the interview was 2 weeks from the time I began the process to an offer letter.", "Interview Questions": "Explain the licensing agreement types between Federally funded research and privately funded research?"}, {"date": "26 Nov 2013", "title": "Student Services Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University", "Interview Descriptions": "It takes months to hear from them after filling out the application online.  You will go through two interviews.  The first being with several staff members that you will be working with.  The second interview is with the Director.  They require a Bachelor's degree, but you will find that the supervisors may not have a degree.  It is a long and drawn out process.", "Interview Questions": "You will be hired based on your personality and ability to follow the rules."}, {"date": "13 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Nov 2013", "Interview Descriptions": "The position requires networking with professors who can support you. I found the lab I work in by going over all the different labs on the department website and narrowed them down to three that sounded interesting. I did some background research and emailed the professor about open potions for funded research.", "Interview Questions": "What do you want to do and why do you want to work in this lab."}, {"date": "23 Oct 2013", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Ohio State University", "Interview Descriptions": "Interviewed which each of the 6-person team for about an hour. Mostly behavioral questions.", "Interview Questions": "How do you manage parent expectations for a program?"}, {"date": "7 Oct 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "You first need an admit, once admitted you can send an email to the professor you are interested to work with and wait for his reply. Do send your resume. Mention you past experiences and how is your background fit for the research. If selected expect that sometimes your professor might switch your position with teaching assistantship.", "Interview Questions": "Every professor in every university is different, it would be better to meet his/her student before meeting with the professor itself."}, {"date": "4 Oct 2013", "title": "Systems Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Phone interview then On-Site interview with whole team. After that, having hands-on test with desktop", "Interview Questions": "Customer Services scenario.  "}, {"date": "26 Aug 2015", "title": "Telecounselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Ohio State University (Columbus, OH) in Sept 2013", "Interview Descriptions": "Phone and in person interview. We were interviewed in a group and by a group panel. Very good work environment and was shown around the office. Very good interview in general.", "Interview Questions": "Asked situational questions"}, {"date": "22 Sept 2015", "title": "Admissions Office Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Sept 2013", "Interview Descriptions": "Just asked about major, why I am attending OSU and hours of availability. That was back in 2013. Now they ask more questions. They got a new manager. She will ask basic behavioral questions like group experience.", "Interview Questions": "Why here at OSU and what is your major?"}], [{"date": "11 Jan 2017", "title": "RPAC Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Sept 2013", "Interview Descriptions": "It was an audition process in which you performed a brief routine in front of a panel of judges. You were able to create your own routine/select your own music that you wanted to perform.", "Interview Questions": "It was an audition process in which you performed a brief routine in front of judges."}, {"date": "20 May 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Aug 2013", "Interview Descriptions": "It was extremely simple. I applied online, and sent my chief of staff an email with the copy of my resume and a cover letter. In about two weeks, I had received an email to set-up an interview. My interview was on a Wednesday, and I knew by the following Monday whether I was hired of not.", "Interview Questions": "In all honesty, the questions were extremely simple. It was team-building based, since student staff always works together. They wanted to see whether or not we were truly interested in the job or not. Overall, extremely simple. I would not worry at all. Just be yourself and show interest. "}, {"date": "1 Mar 2016", "title": "Lab Animal Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Ohio State University (Columbus, OH) in Jul 2013", "Interview Descriptions": "The interview process was a pain initially.  Was not reimbursed for parking costs and had to park in the garage far away from the building. Was asked a lot of stupid questions not pertinent to the job itself. I was told that was room for advancement when there actually was not.  I was offered the position a week later by email.  It was straight forward and uncomplicated.", "Interview Questions": "What was your biggest challenge at your last job and what did you learn from it?"}, {"date": "20 Sept 2013", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Powell, OH) in Jul 2013", "Interview Descriptions": "Skype interview", "Interview Questions": "The interview team consisted of four highly educated adults who for whatever reason asked the same questions an hr person from a department store asks the potential part-time associate.  Asked how in the past had I handled delivering bad news or how would I respond to a negative comment  questions seem shallow and unprepared. And no I did not get the job.  The HR did email me that I didn't make the first cut but to keep trying which I did sincerely appreciate."}, {"date": "30 Dec 2015", "title": "Production Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Jul 2013", "Interview Descriptions": "Basic interview questions, directed at college students. Nothing out of the ordinary. Asks basic question about previous employment, experience, volunteering, etc. Will ask you to name examples of experiences and to list your academic studies, extracurricular activities, hobbies, etc.", "Interview Questions": "Name one time you went out of your way to help a customer..."}, {"date": "6 Jun 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Ohio State University", "Interview Descriptions": "two rounds interview. The first round is basic background interview, and the second round is group interview where three candidates get to know the entire team and get asked questions", "Interview Questions": "What do you think is entrepreneurship?"}, {"date": "22 May 2013", "title": "Senior Systems Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "Phone interview with HR, then face-to-face technical interview. Second interview was for making an offer", "Interview Questions": "\"Describe how you would work with difficult people\""}, {"date": "15 Apr 2013", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The Ohio State University", "Interview Descriptions": "Initial contact was an informal connection with a recruiter.  Application is made by way of their online system, but I also identified and directly contacted the hiring manager.  Their process drags on at times and I interviewed with several people, but never more than once with the same person.  The primary interview was with a group of staff, including the recruiter and the individual who would supervise the position, along with two others.", "Interview Questions": "It was a standard interview.  They used a prepared list of questions.  None were overly difficult, challenging or out of the ordinary."}, {"date": "6 Apr 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Apr 2013", "Interview Descriptions": "Typical customer service questions such as how you would handle a difficult patient, an employee who has violated patient privacy, a difficult manager.  What is the one reason you would like to work in this position.", "Interview Questions": "How would you handle a difficult patient who is becoming irate with you on the phone?"}, {"date": "18 Oct 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Apr 2013", "Interview Descriptions": "the interview is brief, and the PI did't ask to many questions, I asked several questions during interview, and i got offer in 1 week after the interview. I was asked to tell PI more about my skills, and also do I have any idea of the lab development and management", "Interview Questions": "why do you want to work here"}], [{"date": "28 Feb 2013", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Ohio State University", "Interview Descriptions": "Audition and good academic standing was required to receive a scholarship from the Men's Glee Club.  You also had to be an active participant in the group itself.  This group can end up being a personal and profession support system for any young professional.  Other responsibilities come if you run for office of the organization.  This is a difficult process and requires political campaign and a well written speech in order gain favor from your peers.", "Interview Questions": "He might ask you to sight read.  "}, {"date": "23 Apr 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Mar 2013", "Interview Descriptions": "Met with panel of teaching staff as well as directors of early learning center. After,  I was taken on a tour of the facility.  I was encouraged to ask as many questions as possible and observe the various classrooms. I remember thinking I fumbled my words but I was offered the job a few days later!", "Interview Questions": "Talk about educational theorists you have interest in and why."}, {"date": "20 Jul 2015", "title": "Graduate Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2013", "Interview Descriptions": "Overall the interview was really good. I interviewed with about 6 people in one room which was intimidating but everyone was really nice and a couple of them I had met previously. Interview didnt last long and no odd questions were asked.", "Interview Questions": "What is your theoretical approach?"}, {"date": "16 Nov 2015", "title": "Law Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Feb 2013", "Interview Descriptions": "Submit my resume and then I had a call back interview with two people. They asked general interview questions. The interviewers were kind and did not try to intimidate me.", "Interview Questions": "They asked how did I become interested in law and questions about my previous employment."}, {"date": "6 Oct 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2013", "Interview Descriptions": "it was smooth and consistent to the interview process in higher education. I appreciate the transparency of the process. There was no surprise if you have a clear idea of what you are doing and what higher education is about. the colleagues were professional and everything went as planned.", "Interview Questions": "they asked about my degree"}, {"date": "10 May 2016", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Ohio State University (Columbus, OH) in Jan 2013", "Interview Descriptions": "Apply online then they call you for interview with your potential manager. Discussion of job duties and your job qualifications and experience.  Good and easy interview process.  Good environment.", "Interview Questions": "Questions dealt with your prior experience."}, {"date": "17 Aug 2015", "title": "Human Resources Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Columbus, OH) in Jan 2013", "Interview Descriptions": "Online application followed by a phone interview with 6 people.  I then had to make a presentation to the student employees and the staff, this was followed by a interview with senior leadership, then one on one with hiring supervisor followed by director  I had informal meet and greet with student employees and other staff", "Interview Questions": "What are your strengths why do you want this job how are you qualified"}, {"date": "9 Dec 2012", "title": "Operations Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 12+ months. I interviewed at The Ohio State University (Corvallis, OR)", "Interview Descriptions": "Sit up straight, say something original but relevant to the position, act interested and know why you want it. It is important to make eye contact and act confident and act confident but not cocky.", "Interview Questions": "What you would do if someone got seriously hurt."}, {"date": "13 Sept 2012", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH)", "Interview Descriptions": "The person who interviewed me was very nice. She was a Director of HR. There was an initial phone interview (by the same person), and then I met her in person.  I didn't get the job, but she called me personally to let me know.  All of the questions were mostly behavioral interview questions.", "Interview Questions": "Explain how you convinced someone to do something that they didn't want to do.  What was the result?  Would you have done anything differently? "}, {"date": "22 May 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Columbus, OH) in Sept 2012", "Interview Descriptions": "The manager of the dining hall conducted the interview at the front of the house. It lasted maybe 30 minutes. There were about 6 questions. At the end of the interview, he gave his feedback and offered me a job and asked what my availability was. He said he likes to give immediate feedback when he interviews prospective employees. I know that not every hiring manager is like that.", "Interview Questions": "Tell me about a time when a problem arose at work, and how you helped to solve the problem."}], [{"date": "26 Mar 2014", "title": "Climbing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Ohio State University (Columbus, OH) in Aug 2012", "Interview Descriptions": "I emailed the coordinator my resume and cover letter. It definitely helps to know someone who already works there, but it's still very possible to be hired if you don't. Usually two people interview you, but sometimes a 3rd (I know from experience). Very laid back, don't be afraid to make jokes.", "Interview Questions": "Give an example of a difficult task you were faced with and how you overcame it. What did you learn from your experience?"}, {"date": "26 May 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2012", "Interview Descriptions": "First, an online application (jobs are typically posted for one week, opening and closing on Sundays). Second, a phone interview. Lastly, an in-person interview in the office in which I would be working. Interviewers included my future supervisor, an office manager, and another representative from the office. The interview took around an hour and was fairly relaxed and conversational. I did provide a short presentation based on a prompt that was provided when the interview was scheduled a week or two prior.", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "1 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Ohio State University (Columbus, OH) in Jun 2012", "Interview Descriptions": "Laid back conversation with professors who want to employ you. Typically related to your own research interests and skill set. My experiences have been very positive on the whole. Professors typically want to help you develop and have an incentive to see you build your research agenda.", "Interview Questions": "Tell me about your research interests"}, {"date": "4 Mar 2016", "title": "OCIO PPMO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at The Ohio State University (Columbus, OH) in Jun 2012", "Interview Descriptions": "Fairly comprehensive, fair, presentations required. there were separate meetings with various senior leaders. the format was free form - questions and discussion. I was asked to describe my past work experience, why I left my last employer. They were hospitable - I was flown in and treated well.", "Interview Questions": "how would I implement resource management"}, {"date": "21 Sept 2016", "title": "UNIX Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jun 2012", "Interview Descriptions": "Was formal and simple. Had telephonic and then personal interview. There was technical round and HR. They asked few basic questions. Lessons learnt from your previous job, what i liked baout my previous jobs and what I didnt etc. What is my expectations and how do I deal stress and annoying co-workers etc", "Interview Questions": "Brief your employment history ? why should we hire you ? Few Unix questions like OS, few basic commands that I use etc. Reason for leaving and reason for choosing this position."}, {"date": "25 Mar 2014", "title": "Student Alternative Media Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Ohio State University in May 2012", "Interview Descriptions": "The interview was conducted with the 3 employees that would be directly involved with my job responsibilities.  I knew the interviewers well and I believe that they had already made the decision to hire me, due to the fact that they knew my capabilities.", "Interview Questions": "None that were not expected."}, {"date": "21 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Ohio State University (Wooster, OH) in Apr 2012", "Interview Descriptions": "I was recommended to a professor hiring a research assistant by another professor I had worked with. I emailed with him and then met with him and was offered the job.", "Interview Questions": "They asked about my familiarity with common lab tasks (like using a balance, for example)."}, {"date": "22 Oct 2013", "title": "Windows Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Mar 2012", "Interview Descriptions": "I did well in the class, so my professor approached me toward the end of the quarter to ask if I wanted to work for her.  I told her I was interested, and she had me contact the the supervisor of the Windows consultants.  My professor sent her recommendation of me, and I scheduled a time to meet with the supervisor for about 10 minutes.", "Interview Questions": "Why do you think you will be good in this position?"}, {"date": "16 Jun 2015", "title": "Library Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2012", "Interview Descriptions": "Email invitation for a Skype interview within 2 weeks after the job is closed. 1 Skype interview, 1 Physical interview afterwards. Background check. I remember background check took some time.", "Interview Questions": "They do customize questions according to the jobs. So prepare yourself. For my job, I was asked about my experience, projects I worked on, how I overcame a difficult situation at work, etc.\r\nI applied for a couple of other positions within the organization as well without success. As you can imagine, there will be many applicants for one opening."}, {"date": "6 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at The Ohio State University (Columbus, OH) in Feb 2012", "Interview Descriptions": "Auditioned in February and then came to a full day callback two weeks later. Was offered a spot the following week. Then had to apply to the University and send in a portfolio/resume.", "Interview Questions": "What type of art do you like to create?"}], [{"date": "21 Jul 2015", "title": "Athletic Camp Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Jan 2012", "Interview Descriptions": "It mostly just consisted of the background check and also included an inquiry as to my athletic background. It is really all about a personal connection to the staff. Make sure to showcase any previous coaching experience.", "Interview Questions": "Have you worked with kids before?"}, {"date": "7 Aug 2012", "title": "Information Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Dec 2011", "Interview Descriptions": "Very long and lenghty interview process. Took over a month for my position due to the amount of applications submitted.", "Interview Questions": "None that were too different than any other job."}, {"date": "12 Jul 2015", "title": "Program Assistant- Fisher College of Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Columbus, OH) in Oct 2011", "Interview Descriptions": "Interviewed with department administrative associate, then called back for an additional interview with the dept chairperson and another administrative associate. Offered position over the phone the same day of second interview.  The whole process took probably one month.", "Interview Questions": "How would you be welcoming to students?"}, {"date": "17 Aug 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Oct 2011", "Interview Descriptions": "The interviewing process was fairly competitive but not as much so as for the RA position, and overall quite forgiving of people who may not have previously had a lot of work experience, which I think is/was a good thing. I really appreciated the connection that was already being established both by the OA staff manager (who was also an undergraduate student) and the building managers (who lived in the same building and were either graduate students or paraprofessionals).", "Interview Questions": "How would you handle possibly awkward (drunken, angry, fighting with a partner, breaking quiet hours) in the most positive way possible?"}, {"date": "10 Nov 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Columbus, OH) in Sept 2011", "Interview Descriptions": "I got an email back from the manager in the Rare Books library and she set up an appointment. I was interviewed right in the rare books room. It took about 20 minutes and she asked me basic behavioral interview questions. I was offered the job on the spot.", "Interview Questions": "They asked what type of books I am interested in."}, {"date": "2 Sept 2014", "title": "Graduate Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University in Jul 2011", "Interview Descriptions": "You submit your application and then if accepted, you interview them.  Not at all like industry.  The key is finding a professor you like.  There are no questions in the interview, it is more like a talk about what you want to research and your interests and goals.  You just to have apply online and have a good resume with good grades and undergrad research.  It is nothing like applying for an industry job.", "Interview Questions": "The application asks why you want to go to grad school and what your interests are.  That is the hardest question because your answer should be about a page single spaced.  It can't be \"I like learning\" or something of that nature.  "}, {"date": "18 Jun 2015", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2011", "Interview Descriptions": "First interview with the staff and then second interview with faculty members.  They asked questions regarding my skills and expertise. They asked questions that would reveal the type of person I am to work with.", "Interview Questions": "Why did you chose this place to work."}, {"date": "22 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Ohio State University (Columbus, OH) in Jun 2011", "Interview Descriptions": "Met with supervisor through a referral. Met once in person on-campus and was asked a serious of questions for about a half hour.  The supervisor oversaw the entire operation.", "Interview Questions": "Asked a serious of simple questions regarding ability to follow directions.  Basic competence and ability questions."}, {"date": "6 May 2013", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jun 2011", "Interview Descriptions": "Once you take your math placement test to see where you stand going into your freshmen year of school, if your score is high enough, the math center coordinator may contact you asking for you to apply. You will fill out the simple application and they will review and get back to you about the interview. If selected, you go in to the math center for your interview and they will have a one-on-one interview session with you to access your math abilities. In my group, we had to perform a problem on the board for a group of both potential tutors and the staff. Not that difficult though because they know that we are students and this will not be a permanent job.", "Interview Questions": "We had to get in front of the group and solve a random math problem given to us."}, {"date": "12 Apr 2014", "title": "Graduate Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Jun 2011", "Interview Descriptions": "on-site interview and a phone interview", "Interview Questions": "why do you leave your former employer?"}], [{"date": "10 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in May 2011", "Interview Descriptions": "2 months after submitting applications I was called in for interview. It was on the unit that was hiring with the manager of that unit. There were other nurses interviewing the same time slot. In between the interviews a staff member was reprimanded and left the office crying, which was a little concerning.  I was called back the following week and offered a position and given orientation start date.", "Interview Questions": "Can you give an example of a time you had to deal with conflict and how you dealt with that? "}, {"date": "15 Aug 2012", "title": "BIM Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in May 2011", "Interview Descriptions": "Job was posted on the Engineering Career Services website through the university. I sent my resume via email after reviewing the content and requirements of the position. They called me back a few weeks later and were interested in an interview. Attended and was extended the job a few weeks afterward.", "Interview Questions": "What kind of teamwork experience do you have?"}, {"date": "13 Apr 2015", "title": "Graduate Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Ohio State University (Lawrence, KS) in Apr 2011", "Interview Descriptions": "I applied online on the OSU website, and search through the faculty member who is doing research on my interested topic. I send a email to the professor and he replied me with several questions.", "Interview Questions": "GPA and GRE score"}, {"date": "17 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at The Ohio State University (Columbus, OH) in Mar 2011", "Interview Descriptions": "Searched OSU job board and emailed the professors who advertised. I was contacted back almost immediately asking to set up a one on one interview with the professor. Met with the professor in his office where we discussed my roles as a research assistant.", "Interview Questions": "What makes you interested in my field of research?"}, {"date": "5 Sept 2012", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Mar 2011", "Interview Descriptions": "It is pre-selected; however, I believe that the initial phone interview plays an important role in graduate assistant selection.", "Interview Questions": "Not applicable"}, {"date": "11 Jul 2011", "title": "Engineering Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jan 2011", "Interview Descriptions": "The recruiter called me during evening, there is a 12 hours time difference between two countries. He asked every line and every word on my resume. It took more than 3 hours to finish the interview. The position is immediate, they want me to work there in the following month. I was not able to do so.", "Interview Questions": "What is the first project after I got my BS degree?"}, {"date": "11 May 2014", "title": "Ag Tech I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Ohio State University (Wooster, OH) in Aug 2010", "Interview Descriptions": "the interview and hiring process is slow!  Took a month after i sent in my resume to get an interview, then another month before I found out I had the job. The interview was a laid back one, with just 2 other people. But I have been to a few other interviews with the university where there were more than 5 people in the room.", "Interview Questions": "conflict"}, {"date": "17 Aug 2010", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Jun 2010", "Interview Descriptions": "I was interviewed in a large conference room by several individuals. They were all easy going and friendly, so it wasn't a bad experience. They asked simple, general questions, most likely to find out more about my personality than the actual answer to the question. They interviewed 3 people in the span of 2 weeks, then called me and told me I got the job.", "Interview Questions": "Why do you want this position?"}, {"date": "17 Jun 2014", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in May 2010", "Interview Descriptions": "This is extremely hard to say, as there appears to be no valid process since about a year ago, when an unqualified \"Lecturer\" was put in charge as \"Director\".  He seems to care about only 2 things to hire someone: 1) you should be a tech wizard, and 2) you should \"like\" him (or at least appear to).  Unbelievable, right?  That's what all of the older personnel say...", "Interview Questions": "Are you a computer wiz?"}, {"date": "15 Dec 2013", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Mar 2010", "Interview Descriptions": "The interview process was very long, the all day", "Interview Questions": "Why do you want to come and work at OSU"}], [{"date": "8 Jun 2012", "title": "Events Manager/Program Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Dec 2009", "Interview Descriptions": "Very informal discussion with the Manager of the Patron Services, as to wether i would stay or go.  It was my decision to leave as i already have a full time job.  Really enjoyed the peeps in Admin & in the technical workings of the Wex.  Very professional & knowledgeable group, who really know how to put on a first class show, at least while i was there.  I am not certain if the same staff is currently still there at this time.\r\nWork culture is very university oriented & they are great at being very flexible schedule wise.  A great place to intern as well as use as a launchiing site for other untiversity endeavors.  great location on main campus @ OSU.  Hourly rate is competitive with other part-time & temporary positions in the area.", "Interview Questions": "What is your experience in working with front of house or patron services?"}, {"date": "8 Mar 2013", "title": "Engineering Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at The Ohio State University (Columbus, OH) in Sept 2009", "Interview Descriptions": "No process, just contact professor.", "Interview Questions": "What are your interests?"}, {"date": "24 Oct 2009", "title": "Facilities Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at The Ohio State University (Columbus, OH) in Jul 2009", "Interview Descriptions": "Initial communications through proactive networking;  required to also apply online;  an interview was  promptly scheduled;  panel interview and participants were uninformed, did not have my resume and tried to apply behavior based interviewing questions ineffectively; one interviewer who was a direct hiring manager  was confrontational, lacked professionalism, and common courtesy;  culture lacks communications;  they need to be more conscientious of how the organization is represented;   ensure timely and clear communications; extended an offer 2+ months later after a series of internal circumstances partially due to policy and union affiliation policy", "Interview Questions": "\"What do you think of people who don't show up to work?\""}, {"date": "12 Jun 2009", "title": "Clinical Data Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Ohio State University in Mar 2009", "Interview Descriptions": "Very disappointing.  The person who interviewed me was very suspicious about why I was leaving my previous position, asked for details, and then seemed really turned off by the details (I was coming from a department with ethics problems all the way up the chain of command, and I did not want to be a part of that).  He was very suspicious about me.  He seemed resentful to have to hire a new person-- because the previous person had gone on maternity leave and decided not to return (what WAS she thinking?  Obviously you should return to your hateful workplace even if you don't think it's the best thing for your new baby) and asked me where I saw myself in 5 years, which I thought was a bizarre question for a gopher job (I see myself as senior gopher?).  Now I realize it was code for \"do you plan to have babies?  I don't wanna deal with maternity leave\".  I am young, female, and engaged, so OF COURSE he must think the next thing on my list is to have a bunch of babies.  (It's not, but so what if it were?  Does he think it's his right to require that people not have children?)  He also wanted to know whether I had problems with my \"attendance\", which I found insulting.  I explained that in a year's time I had taken 1.5 days of vacation.  After being asked about my qualications/background I was told that I was more than qualified, that \"anyone could do this job\".  Of course, when I got the rejection email, I was told that they chose someone whose background was more suitable.  Whatever; it's hardly the environment I would want to work in.", "Interview Questions": "Why are you leaving your previous position?"}, {"date": "19 Sept 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Ohio State University (Phoenix, AZ) in Feb 2009", "Interview Descriptions": "I found a professor's research webpage. His interests aligned with mine and so I send him my resume. I was at a different city at the time into which the Professor happened to fly in the same month. We arranged an interview at the Starbucks of an airport.", "Interview Questions": "The professor quizzed me on several technical aspects of a journal paper I was a co-author of. Most of them were manageable. He asked me what exactly my contribution was in that paper and why I was not first author on it."}, {"date": "28 Jun 2011", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at The Ohio State University (Columbus, OH) in Feb 2009", "Interview Descriptions": "The interview process was an amazing experience. I talked to the professor who runs the laboratory and also to the research scientists. Everyone was very respectful and considerate. The questions were mostly about my previous research experience and lab techniques, as well as why I am interested to join this lab.", "Interview Questions": "What type of project would you like to work on?"}, {"date": "23 Aug 2009", "title": "Account Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at The Ohio State University (Columbus, OH) in Sept 2008", "Interview Descriptions": "Sit down with the manager, he asks about your leadership skills as well as how comfortable you are talking to new people", "Interview Questions": "What kind of sales experience do you have "}, {"date": "16 Sept 2012", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jul 2008", "Interview Descriptions": "Recruited by Dept. Chair. Interview was very informal.", "Interview Questions": "N/A"}, {"date": "20 Nov 2012", "title": "Typist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at The Ohio State University (Columbus, OH) in Jun 2008", "Interview Descriptions": "When I first applied to OSU, I submitted a paper application.  Several weeks later, I received a call asking me if I would like to come in for a test.  A few weeks after that, I was contacted by phone to come in for an interview.  I interviewed at the department that was hiring and was hired on the spot.", "Interview Questions": "I think answering the required salary question is always the most difficult.  You don't want to ask for more than they are willing to pay but you don't want to sell yourself short either."}]]