[[{"date": "4 Mar 2023", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle University (Seattle, WA) in Feb 2023", "Interview Descriptions": "Applied directly through the University website and received a phone screening call within 2 days. After the call a request for a Zoom interview was sent over. After the Zoom interview I received a call the next day and was asked if I was interested in accepting a position.", "Interview Questions": "Why do you want to be apart of Seattle University?"}, {"date": "15 Nov 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Seattle University in Oct 2022", "Interview Descriptions": "Firstly I said hi to everyone in the meeting room; then I introduced myself about what major I am taking, what professional experience I had, etc. After that, I answered few questions from them.", "Interview Questions": "1. Introduce yourself. 2. Why interested in this position. 3. Tell us how you arrange an event."}, {"date": "21 Jun 2022", "title": "Graduate Assistant - Athletics Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle University", "Interview Descriptions": "Two Zoom interviews, basic interview questions with a few open ended questions about where you see your career long term. Friendly staff,  no trickery or off the wall questions in the process. Talk about how you can add value not what sports you played growing up!", "Interview Questions": "How does this job relate to your long term career goals?"}, {"date": "6 Oct 2021", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle University", "Interview Descriptions": "The first round you interview with the entire marketing team answering a series of questions. If you make it to the second round you’ll be assigned a project to be completed within about a week. After that week, you’ll meet with the team again to present your work and answer a series of questions.", "Interview Questions": "Tell me about a time you used an ineffective communication method and what you learned. "}, {"date": "14 Sept 2021", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle University", "Interview Descriptions": "They had me provide a lesson plan on a subject area and gave me 20 minutes to teach it to a group of 10. This was a lot of fun.", "Interview Questions": "Design a 20 minute lesson on X subject and convey it to a team of staff and faculty. "}, {"date": "6 Mar 2021", "title": "Human Resources Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle University", "Interview Descriptions": "It was a very straight forward  interview with specific questions related to the job description and  it was a good experience. Interviewer was very friendly communicating expectations and explaining the rol.", "Interview Questions": "Best way to communicate: In person, by email, or phone?"}, {"date": "16 Dec 2020", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Seattle University", "Interview Descriptions": "Simple and like a conversation.  They give you the questions beforehand so that you can prepare.  The interviewer I had was extremely low key and personable.  She helped to make the process go smoothly.", "Interview Questions": "Have you tutored or did something similar in the past? Describe."}, {"date": "25 Aug 2020", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle University", "Interview Descriptions": "Start with application and within couple weeks, the hiring managers reach out to do a in-person interview. The interview is about half hour, with general interview questions, and I got the interview result couple weeks after the interview.", "Interview Questions": "Why you want to be a tutor"}, {"date": "29 Mar 2021", "title": "Student Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle University (Seattle, WA) in Apr 2020", "Interview Descriptions": "Very basic, they would ask questions regarding your ambitions as well as how you would act in situations with students. Nothing related to business perspective. Along with that, much of the time the interviewers give a lot of perspective themselves which make it a wholesome conversation rather than an interview,", "Interview Questions": "What do you feel is the most important thing for first year students?"}, {"date": "27 Jun 2020", "title": "University Advancement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Seattle University (Seattle, WA) in Feb 2020", "Interview Descriptions": "Applied for a role with University Advancement. Interview process consisted of a 30 minute phone interview with the hiring team, then around 2 weeks later in person interviews. The in person interviews lasted for 2 hours and consisted of a panel interview with around 8-10 people (!!!) for an hour, then individual interviews with team members. After in-person interviews they checked my references and decided not to offer me a job.  The process took around a month from start to finish. \r\n\r\nI would have preferred more clarity in terms of references and where I was in the process. Since I used my current employer as a reference it put me in a difficult position when I realized there was still another person in the process. If I had known that, I would have used other references. The reference criteria was also pretty strict and tough for me as a recent immigrant to America.", "Interview Questions": "Tell me about yourself"}], [{"date": "26 Dec 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle University", "Interview Descriptions": "Quick and easy. Double interview - first with assistant director and then with the director. Pretty straight forward questions asking about previous experience. Everyone was super nice, very professional, kind and welcoming.", "Interview Questions": "Can you describe a time you dealt with someone difficult and what did you do to get through that situation"}, {"date": "12 Jun 2019", "title": "Facilities Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Seattle University (Seattle, WA)", "Interview Descriptions": "The interview was informal. Staff was very nice and asked a lot about teamwork. The interview process was very fast. I filled out an online application and then went into the office for an in-person interview.", "Interview Questions": "If you were a fruit, what fruit would you be? \r\n"}, {"date": "16 Feb 2022", "title": "Student Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Seattle University (Seattle, WA) in Dec 2018", "Interview Descriptions": "Sat down in a small office in the upper floor of the lobby, had a 30 min long interview with two of the staff. The head of security and an another worker.", "Interview Questions": "Tell us about yourself?\r\nWhy are you interested in the job?"}, {"date": "30 Oct 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Seattle University (Seattle, WA)", "Interview Descriptions": "1) Phone Interview\r\n2) In person interview with three different staff members \r\n3) A presentation on a topic of your choice complete with powerpoint. \r\n\r\nIt was very friendly but obviously rigorous. The entire office sits in on your presentation so the pressure is definitely on.", "Interview Questions": "Design a presentation about the relevance of social media in higher ed"}, {"date": "21 Jan 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle University (Seattle, WA)", "Interview Descriptions": "I had a brief phone interview with the Associate Dean at the time. I was invited in for an in-person interview as well as a follow-up interview. The first interview was with a panel of three women whose roles were supported by the AA position. The second interview was with the AD and the dean's assistant", "Interview Questions": "What is your favorite pizza?"}, {"date": "11 Jan 2021", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle University (Seattle, WA) in Jan 2018", "Interview Descriptions": "Straight-forward and friendly. I applied online and received an invitation to interview 1-2 weeks later. I met with two nurse practitioners who conducted the interview. It was an enjoyable experience.", "Interview Questions": "Describe a time when a patient asked for antibiotics, but it was not indicated for their condition. How did you respond? "}, {"date": "1 May 2018", "title": "Grounds Crew Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 10 months. I interviewed at Seattle University (Seattle, WA) in Jan 2018", "Interview Descriptions": "They asked a bunch of good questions. They wanted to know if I knew how to use a shovel and a rake. Have I ever driven a tractor or pulled weeds.", "Interview Questions": "What is the best way to hold a rake when you are raking leaves?"}, {"date": "23 Jun 2017", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Seattle University", "Interview Descriptions": "I got a phone interview first, which took about 30 minutes. One week later, I met a panel of three people on campus. Overall, the process was very relaxed and they asked about the experiences and technical skills related to this particular position. They also asked several regular behavioral questions.", "Interview Questions": "The mission of Seattle University and how your personal goals align with the mission of SU."}, {"date": "29 Apr 2017", "title": "Senior Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle University (Seattle, WA) in Mar 2017", "Interview Descriptions": "The interview process was pretty standard. I went in for a formal panel interview with five people and had an informal follow up interview with four. It took approximately a month from first interview to receiving my offer.", "Interview Questions": "The questions were also pretty standard. How do you stay organized? What do you do if you are working on one project and someone needs something done immediately?"}, {"date": "16 Feb 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Seattle University (Seattle, WA) in Mar 2017", "Interview Descriptions": "All I did is contact with the professor worked with, and had a face to face interview mainly focus on previous projects I did and courses I took and also some skills we need for the research.", "Interview Questions": "Previous projects"}], [{"date": "7 Jul 2017", "title": "Laboratory Stockroom Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Seattle University in Dec 2016", "Interview Descriptions": "Applied online by messaging Lab manager about  the listing. After a few days, I was asked to do a quick 15 min. interview with the the Laboratory Stockroom Supervisor and Laboratory Stockroom Manager.", "Interview Questions": "Why do you want this job?"}, {"date": "7 Nov 2016", "title": "Senior Operations Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Seattle University (Seattle, WA) in Oct 2016", "Interview Descriptions": "I applied for a different job at SU. A lady emailed me back saying that I was not selected for that job. She said after looking at my resume she said I apply for Sr. Operations Assistant and provided a link to the job posting. I did so. A few days later I received an email asking for a phone interview. A week later I received an email that I did not get the job.", "Interview Questions": "What do you know about Seattle University?"}, {"date": "27 Apr 2016", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Seattle University", "Interview Descriptions": "Interview process was straight forward. Employer was looking for someone who could quickly implement tasks and work well in a team environment. Important to know how to use Microsoft Office applications as well as CRM systems.", "Interview Questions": "Tell me about yourself."}, {"date": "12 Jan 2016", "title": "Desk Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Seattle University", "Interview Descriptions": "I had to apply on their online application; I got phone call from a senior administrator; I was invited to their office; I was interviewed; I waited probably 4 days until I got a call from them again.", "Interview Questions": "What would I do when I have spare-time?"}, {"date": "6 Jan 2019", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle University (Seattle, WA) in Sept 2015", "Interview Descriptions": "I applied online and got a call to set up a phone interview with the 3 members of the team I would be working with. The phone interview consisted of mostly general questions about my previous work history and why I wanted to work there. \r\n\r\nRight after I was called in for an in person interview with the same 3 team members. They asked more job role specific questions, a lot of \"do you have experience with...\" and \"tell us about your customer service skills...\", etc. \r\n\r\nThe whole process took a while, but they checked in with me throughout the process and let me know I was still in the running before offering me the position.", "Interview Questions": "Why do you want to work for Seattle University?"}, {"date": "13 Mar 2018", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle University (Seattle, WA) in Sept 2015", "Interview Descriptions": "I went into a room was interviewed by three supervisors. They asked me generic interview questions, such as, what are your strengths and weaknesses? Overall it was not that difficult of an interview.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "3 Jun 2015", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Seattle University (Seattle, WA) in Apr 2015", "Interview Descriptions": "I was contacted shortly after the position closed and set up a phone interview. I was then asked to come in for an interview.  I met with 3 individuals as part of a team. They were friendly and polite. The interview lasted 45 minutes and they took turns asking questions.", "Interview Questions": "The questions were straight forward and included a few \"what ifs\""}, {"date": "12 Apr 2015", "title": "Financial Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Seattle University in Mar 2015", "Interview Descriptions": "About a month and a half after I applied I got an email from the hiring manager asking if I was still interested. A week later she got back to me again and arranged a phone interview. It was only 30 minutes (no opportunity to go longer - she even gave me a 3 minute warning) and she very obviously had a standard set of questions she had to ask everyone. A couple days after that I was invited to a second round of interviews. This one took about 1.5 hours. First I interviewed with the hiring mgr and another mgr in the department for about an hour. They had a mix of situational and direct questions. Then I was walked over to another department where I met with a VP that I would also be working with. Two days later they checked my references. About 4 days after that she got back to me offering the job. It required a background check. No negotiations at all.", "Interview Questions": "What are your plans for the first 30 60 and 90 days in the position and how will you make an impact?"}, {"date": "19 Jan 2015", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle University", "Interview Descriptions": "I applied via the Redhawk Network with a resume and cover letter. I received an email that week from the office manager. We scheduled an in-person interview for the next week. After that I was offered the job a few days later.", "Interview Questions": "Tell me a time when you failed, what are your strengths and weaknesses, are you comfortable working with strong personalities, what is your job experience, why do you want to work here... etc."}, {"date": "3 Dec 2015", "title": "Lead Accounting Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Seattle University (Seattle, WA) in Jul 2014", "Interview Descriptions": "Easy, they hired every applicant and just gave each of us less hours, which is kind of aggravating.  Also several of the tutors don't have good English skills, and don't actually want to tutor, they just want to hang out and study and get paid for it, and are actively hostile when people show up needing help.", "Interview Questions": "Bog standard behavioral, followed by, do you want the job."}], [{"date": "3 Jun 2014", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Seattle University", "Interview Descriptions": "An application is submitted through the HR website.  They took about a month to respond.  A brief phone interview -- about 30 minutes took place.  I then heard back about a day later that I had been selected for an in-person interview.  The in-person interview was about 3 hours and involved group and individual sessions with would-be coworkers, supervisor, director, and other university employees.", "Interview Questions": "Name one of your biggest career mistakes.  How did you handle the situation?"}, {"date": "13 Jan 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Seattle University (Seattle, WA) in May 2014", "Interview Descriptions": "I applied online with an employee referral. I had a 30 min phone interview with the supervisor and then came in to the office for an in person interview with the supervisor and another employee. The process took about 2 weeks.", "Interview Questions": "The Mission is very important at SU. What part of the Mission statement of the university do you identify with?"}, {"date": "13 Jul 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Seattle University (Seattle, WA) in May 2014", "Interview Descriptions": "Submit via online, they actually do contact you back if they are interested.  Screened via phone call then go in for an in person interview with the team you would be working with.  Each member of the team interviews / meets you and if they like you, you get a call back with a job offer.", "Interview Questions": "What is your weakness?"}, {"date": "2 Jul 2015", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Seattle University (Seattle, WA) in May 2014", "Interview Descriptions": "For my interview, I met with both the chair of the department and the administrative assistant. The situation was very informal and straightforward. I was asked questions about my work history and my tentative future availability. The whole experience was exceptionally friendly and low-stress. Because of this, I felt I was able to share more of my personality and be more open with the interviewers, which seemed to be a benefit as this was a forward-facing role.", "Interview Questions": "Have you ever been in a situation where you have needed to work as a group, but your peers did not cooperate? How did you handle the situation?"}, {"date": "11 Dec 2013", "title": "Temp Custodian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Seattle University", "Interview Descriptions": "Process took 2 days. Interviewed in June, applied online and got an interview the next day.", "Interview Questions": "No difficult questions. Basic interview"}, {"date": "10 Nov 2013", "title": "Family Engagement Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Seattle University", "Interview Descriptions": "Phone panel", "Interview Questions": "It was hard to gain rapport on a phone with interviewees for this position."}, {"date": "5 Apr 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Seattle University (Seattle, WA) in May 2013", "Interview Descriptions": "I went on 13 different interviews to get my position. It seemed very unorganized and like no one was really sure why we were all participating in the interview over and over and over.", "Interview Questions": "How do I feel about this interview process?"}, {"date": "16 Jan 2014", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Seattle University (Seattle, WA) in Jan 2013", "Interview Descriptions": "Interview was conducted over the phone over the course of an hour.  I spoke with a shift supervisor and an assistant director.  Questions ranged from previous experience to role playing potential scenarios.  They're looking for people that can be cool under extreme pressure (most extreme scenario: some one has a firearm) but is also okay with the monotony of patrolling a small campus in the middle of the night.", "Interview Questions": "\"How to you destress? There are some fairly stressful situations on the job and there usually is no warning about how often they occur, when they occur, or what they might be.\""}, {"date": "13 Jun 2015", "title": "Payroll Assistant/Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Seattle University (Seattle, WA) in Jan 2013", "Interview Descriptions": "I applied online: employment application, resume, cover letter. The administrative assistant called me and scheduled a day for an in-person interview. \r\n\r\nI came in, she asked me a series of questions, and I left a copy of my cover letter, resume, and references.", "Interview Questions": "Who was your last employer?"}, {"date": "3 Sept 2012", "title": "Administrative Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Seattle University (Seattle, WA)", "Interview Descriptions": "For academic jobs, that process is fairly traditional. For staff jobs, much of the questions will explore your awareness and commitment to the university mission.", "Interview Questions": "Be careful about questions exploring how you might change things because the interviewers may or may not want change."}], [{"date": "29 Sept 2016", "title": "Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Seattle University (Seattle, WA) in Jun 2012", "Interview Descriptions": "Submitted resume and cover letter electronically; provided the names of several references; spoke with a former Seattle University editor on the phone to ask about her experiences there and for advice on the interview. I had an hour-long, one-on-one interview with the person who would have been my boss.", "Interview Questions": "I was asked lots of appropriate and pertinent questions about applicable experience, what made me want the job and what ideas I had about changes that I'd like to make or ways in which I wanted to expand the publication's reach and applicability to its audience."}, {"date": "14 Jan 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Seattle University (Seattle, WA) in Nov 2011", "Interview Descriptions": "1. Fill out and submit an application\r\n2. Interview appointment\r\n\r\nThis is an on campus job so the process was pretty simple. I filled out an application available at the front desk of the office then submited it at the front desk. The following week I received an interview appointment. I realized from the email that the environment was pretty casual. On the day of interview, however, i dress semi formal. My boss was dressing business casually. She was very friendly and we talked about how I can use my teaching ability to help other students with their academic goals.", "Interview Questions": "If a tutee was having a bad day and was mad and crying, what would you do?"}, {"date": "16 Oct 2015", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Seattle University (Seattle, WA) in Sept 2011", "Interview Descriptions": "Applied online through the Redhawk Network. Required I complete a formal application with basic information, availability (part-time job), and brief questions regarding customer service and personal work ethic. Application asked for particular examples to support your descriptions. Key question included, Why do you think you would be a good fit for this position? and, Why should we hire you over other applicants?", "Interview Questions": "Why do you want to be a front desk assistant? How will you embody the mission and culuture of Seattle University through this role?"}, {"date": "5 May 2014", "title": "Women's Head Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Seattle University (Seattle, WA) in Sept 2010", "Interview Descriptions": "Hiring was done entirely through the Club Team Officers with a very minor and informal paperwork session done on campus.", "Interview Questions": "A situational question about what I would do if two different groups of athletes were in trouble and were equal distance from me."}]]