[[{"date": "2 Nov 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cuyahoga Community College", "Interview Descriptions": "Fair. Interviewed with coordinators first, and then met with discipline experts. Checked my knowledge of best tutoring practices. Toured the tutoring area. Received the job offer fairly quickly. Onboarded with ease.", "Interview Questions": "Diversity questions, customer service questions"}, {"date": "28 Nov 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cuyahoga Community College (Cleveland, OH) in Oct 2022", "Interview Descriptions": "The process was quite clear and very regimented. First interview was with four different people in a round table format. The second interview was with two people. The entire process was done virtually.", "Interview Questions": "a lot about prior experience"}, {"date": "11 Aug 2022", "title": "Research Project Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cuyahoga Community College (Cleveland, OH) in Jan 2022", "Interview Descriptions": "Had multiple interviews with people from several different department. The interview was very formal and highly structured--almost seemed like a script . The interviewers were more interested in data management and business intelligence than in academic research per se.", "Interview Questions": "What data sources would you use to determine labor market demand?"}, {"date": "31 Oct 2021", "title": "Senator-at-large Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cuyahoga Community College", "Interview Descriptions": "It was very welcoming and the collective is very nice. The budgeting was not as good.  However, working for free I loved it. That is all. The students at campus very welcoming as specially at western campus.", "Interview Questions": "What plans do you have for the work?"}, {"date": "12 Sept 2021", "title": "Customer Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Cuyahoga Community College", "Interview Descriptions": "Very straightforward. There's a standard list of questions that must be asked of every candidate. No curveball questions. Mostly about work experience, possible scenarios, and future goals. If you're honest about your resume, you should be fine.", "Interview Questions": "What does diversity mean to you? "}, {"date": "6 May 2021", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cuyahoga Community College (Cleveland, OH) in Apr 2021", "Interview Descriptions": "12 questions total from 6 different interviewers that lasted  a little over one hour long even though I was told it would be 45 minutes. Also included a teaching demo that lasted 15 minutes.", "Interview Questions": "What attracts you about working at a community college"}, {"date": "1 Nov 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cuyahoga Community College (Cleveland, OH) in Apr 2021", "Interview Descriptions": "Short and direct with dates to align with my current scheduling priorities.  Helpful team of staff, whom display a positive work culture.  Shared information on a variety of topics and roles as well as a path of progression.", "Interview Questions": "Why are you interested in this particular opportunity?"}, {"date": "2 Feb 2021", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cuyahoga Community College", "Interview Descriptions": "The hiring supervisor called and asked a few questions before inviting me to interview, he called again to invite me for second interview with his superior, Hr called with job offer", "Interview Questions": "Diversity and inclusion related questions "}, {"date": "19 Nov 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Cuyahoga Community College (Cleveland, OH) in Nov 2018", "Interview Descriptions": "I met with a panel of interviewers who asked me a variety of questions related to the position. The biggest frustration was the uncertainty created by how long the whole interview to hire process took.", "Interview Questions": "What are some of your weaknesses?"}, {"date": "17 Jul 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cuyahoga Community College (Cleveland, OH)", "Interview Descriptions": "Interview panel was very courteous & prompt. The questions seemed relevant to the job.  The interviewers were open to my questions, which is not the case with all employers. Expected turnaround on a decision was reasonable.", "Interview Questions": "What did you like most& least about current or previous jobs"}], [{"date": "30 Aug 2022", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cuyahoga Community College in Feb 2018", "Interview Descriptions": "I received a call to set up an on campus interview.  I had 2 people conduct the interview- the department supervisor and main program manager.  It look about 40 minutes.  It was actually not too bad.", "Interview Questions": "What does diversity mean to you?"}, {"date": "21 Aug 2017", "title": "Concierge Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cuyahoga Community College (Cleveland, OH)", "Interview Descriptions": "I applied online, got a call within a week and had a brief conversation on the phone with hiring manager about the position.  Brought in for a 3-5 person panel interview.   Got the job.", "Interview Questions": "Describe a time where you went above and beyond "}, {"date": "19 Jul 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cuyahoga Community College (Cleveland, OH)", "Interview Descriptions": "I applied approximately three months before receiving a call from the head of the department asking me to come in for an interview.  During the interview, it was clear that I basically had the job after about 10 minutes of casual conversation, very little of which was directly about my qualifications as an educator and more about my industry experience.  This interview occurred about two weeks before my first class started.", "Interview Questions": "Describe your professional experience in the industry."}, {"date": "9 Jul 2017", "title": "Human Resources Coordinator (Contract) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Cuyahoga Community College (Cleveland, OH) in May 2017", "Interview Descriptions": "I was contacted by a staffing agency.  Interviewed the the HR manager and another person from the team I would be working with.  They were both very nice.  The manager told me what the job entailed and asked questions about my background and behavioral type questions.  I took samples of projects that I worked on.  I think she was impressed by that.  I also took a recommendation letter from my former supervisor.", "Interview Questions": "What interested you about Tri-C?"}, {"date": "2 May 2017", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cuyahoga Community College (Cleveland, OH) in Jan 2017", "Interview Descriptions": "The process took 2 months. I applied online and followed up a month later. After a week, they called me in to interview. Schools are very slow when it comes to the hiring process. The job on the website did not match what they presented in the interview. I was annoyed by this but did not show it. At the end, I asked them to explain the day-to-day further, and I asked more questions about what I would be doing. I must have given away I was not interested because I got no call despite the interview going well. I am glad I did not get a call because the position was not right for me. They really need to write more appropriate job descriptions. Not sure if HR is to blame or the department.", "Interview Questions": "They wrote down the interview questions on a piece of paper. Typical questions about what I have done in the past and my experiences. Nothing too hard. But be prepared to answer diversity questions."}, {"date": "25 Aug 2016", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cuyahoga Community College", "Interview Descriptions": "Applied online. Received an email approximately 1 month later requesting an on-campus interview. In-person interview with a panel of 4 staff members. Rotated around when asking questions. Lasted for 1 hour. Questions included topics related to diversity, handling situations with different populations of students, how best to serve specific populations of students, and why I had interest in the position and school.", "Interview Questions": "Tell us about a situation you've had with a \"difficult\" student and how you handled that situation."}, {"date": "4 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 months. I interviewed at Cuyahoga Community College (Cleveland, OH) in May 2016", "Interview Descriptions": "Unorganized, unprofessional, disrespectful\r\nWhen I was called to interview (which was five months after I applied), I asked for the names and positions of my interview team. I was told I would have to wait for the interview to find out. When pressed, I was told the scheduler didn't know. I called the administrator's office to which this position would be reporting and was given false information. At the interview, I was asked many vague questions and some inappropriate questions. When i pointed this out, I was told not to tell anyone and then later was told it didn't make a difference because the College had several influential legal professionals on their board and staff. I was told that the College can fire anyone at will, thus circumventing any discrimination charges.", "Interview Questions": "What is my definition of diversity?\r\nWhat would I do if a student came into my office distressed that the Dean had bullied him/her?\r\n"}, {"date": "10 Aug 2020", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cuyahoga Community College (Cleveland, OH) in Apr 2016", "Interview Descriptions": "Group panel interview from various departments. Took turns asking questions. You can expect 12-15 questions. That was the first level. The second level was just two people interviewing you. Interview with the dean and president.", "Interview Questions": "Several questions on diversity "}, {"date": "6 Sept 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Cuyahoga Community College (Cleveland, OH) in Mar 2016", "Interview Descriptions": "It is an on campus interview, each interviewee has 5 minutes to communicate with potential employers. The interviewer is quite friendly and nice, she asked me to introduce myself at the beginning and then started to ask some questions on working history. The whole interview process is relaxing, the interviewer has bright smiles which made me less nervous.", "Interview Questions": "Could you tell me more about your working experience at ...?"}, {"date": "11 Aug 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cuyahoga Community College (Cleveland, OH)", "Interview Descriptions": "got a call from the administrative assistant\r\nshe walked through the basic overview of the position\r\ncame in for the interview with the supervisors\r\n2nd level was with the director\r\nwaited 4 weeks to hear back - HR finally called and wanted me to start on Monday\r\n\r\nNo salary negotiation accepted.", "Interview Questions": "describe your experiences with diversity (paraphrase)"}], [{"date": "19 Aug 2015", "title": "Program Manager, Learning Outcomes Assessment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cuyahoga Community College (Cleveland, OH) in Dec 2014", "Interview Descriptions": "What I loved about the interview is that for the on-campus portion, all of the questions were presented to me on a sheet of paper.  That way, as I was answering each question to the committee, I could refer back to the sheet to ensure that I wasn't missing anything.", "Interview Questions": "How do you define diversity?"}, {"date": "14 Jul 2014", "title": "Laboratory Assistant (Biology) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cuyahoga Community College", "Interview Descriptions": "When I was contacted about this job, I had actually forgotten that I had applied and what job it was for because it took quite a while for them to contact me (months). The process after that took another month, but I was well informed throughout the entire process. The interviewers were very down-to-earth and the environment was very comfortable. I was contacted two weeks after the interview (which was in line with what I had been told after the interview. So no complaints there). After being hired, I started the job a week later.", "Interview Questions": "What is your understanding of diversity and how have you benefited from it?"}, {"date": "11 May 2015", "title": "Work Force Economic Development Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cuyahoga Community College (Cleveland, OH) in Mar 2014", "Interview Descriptions": "A general panel interview group. Four to five individuals. The VP of the specific branch you're applying for. Your direct supervisor and other managerial employees, two to three, will be there with general questions about your application, resume, and hypothetical scenarios.", "Interview Questions": "How could you improve the culture of the college in a year? Three years? Five Years?"}, {"date": "9 Mar 2015", "title": "Budget Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cuyahoga Community College in Jan 2014", "Interview Descriptions": "I applied online. In around one or two weeks received a phone call to schedule a face to face interview. The face to face interview was pretty short, around 30 minutes. I was interviewed by two persons. This was the initial round of interviews. If you pass this round then you will have the second interview with financial managers. Most of the questions where behavioral and had nothing to do with the job responsibilities. The questions were like: tell me how you deal with conflict? or how good you are at using excel? In around a week or two I got an email that I am not selected for the next interview in the hiring process.", "Interview Questions": "How good are you at working in divers environment?"}, {"date": "19 Apr 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cuyahoga Community College (Cleveland, OH) in Nov 2013", "Interview Descriptions": "Applied for the position in October. Interviewed in early November. Received an offer mid-December, but did not hear from HR until mid-January and that's only because I reached out to them. Completed drug screen and background check in mid-January and began in early February.", "Interview Questions": "Had to provide detailed knowledge about the department in which I would be working."}, {"date": "1 Jul 2013", "title": "Program Coordinator I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Cuyahoga Community College", "Interview Descriptions": "Name a time exeplified teamwork and great leadership", "Interview Questions": "Please list some examples of diversity in cuyahoga community college "}, {"date": "16 Jan 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cuyahoga Community College in Jan 2013", "Interview Descriptions": "I was interviewed by the Assistant Dean, and then was called back to be interviewed by the Dean and two other faculty members. It was very professional, and they asked hard but pertinent questions.", "Interview Questions": "What is your greatest strength as an instructor?"}, {"date": "20 Aug 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cuyahoga Community College (Parma, OH) in Aug 2012", "Interview Descriptions": "There were two rounds of interviews.  First faculty interviewed the candidates.   They recommended two candidates to talk to administration.  I was one of the final candidates.  They didn't even have the common courtesy to inform me I did not get the job.  I heard about it when the selected candidate was introduced to faculty.  No one ever contacted me directly.", "Interview Questions": "How would you promote student interns?"}]]