[[{"date": "13 Feb 2023", "title": "Campus Field Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Cru", "Interview Descriptions": "Very personable during interview, even though they have a long application. People interviewing you definitely want to get to know you and your heart behind applying for this job. It’s more of a conversation than a classic interview asking a bunch of scenarios and experiences to “prove” you are worthy of the job.", "Interview Questions": "What is something that the Lord has done or used in our life to cause you to want to join staff with Cru?"}, {"date": "21 Dec 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cru", "Interview Descriptions": "The interview process went very well and was streamlined. I appreciated how kind, informative and communicative they were in the process. I had two interviews, and then after the second, the HR director called me and offered me the position.", "Interview Questions": "They asked me about my administrative experience."}, {"date": "4 Oct 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cru (London, England) in Mar 2022", "Interview Descriptions": "1. Telephone: ask about personal profile, industry knowledge and motivation\r\n2. Case study: will give you one week to finish a case study about relevant fields. Need to present afterwards.\r\nThere will be several managers at the final round of interview", "Interview Questions": "Basic motivation and industry knowledge and competency questions"}, {"date": "14 Apr 2021", "title": "International Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cru", "Interview Descriptions": "The interview process for me was a little different because of the pandemic, but I had a phone call with my interviewers. They stuck to questioning me from my application. Many of the questions that they asked, I had already answered on the application.", "Interview Questions": "One of the things that I was asked was a theological point about Trinity. "}, {"date": "6 Dec 2020", "title": "Digital Content Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cru (Orlando, FL)", "Interview Descriptions": "This was a multi-tiered process with an initial phone call, a first interview with HR and relevant staff, and a second interview with more staff. This was all conducted via telephone or video call due to COVID-19.\n\nThe process was quite slow, with weeks separating each step.\n\nI was not offered this position I was not given an explanation as to why nor was I offered an explanation. I had to reach out to the HR person via email to ascertain the status of my application.", "Interview Questions": "I was asked questions about my work competency, my work history, my religious convictions (this is a religious non-profit) and questions about certain social views."}, {"date": "14 May 2019", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Cru (Orlando, FL) in Apr 2018", "Interview Descriptions": "First offer a free weekend preview at the HQ, have different staff members explained what are their daily operations, afterward candidates are broken into small groups according to their interested area. Followed by a Phone interview, where department senior asked question about your motivation to work with Cru.", "Interview Questions": "Why would you like to work at Cru's HQ"}, {"date": "15 Mar 2018", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cru (Orlando, FL) in Mar 2018", "Interview Descriptions": "The first interview was via Google hangout, and the second was in person. Everyone at the facility was very nice. They give you an excel evaluation to start off, then you interview with department heads , and then a peer interview.", "Interview Questions": "Explain to us how you came to know Christ. "}, {"date": "5 Jan 2018", "title": "Campus Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cru", "Interview Descriptions": "Well vetted interview process, lengthy written application with phone/in-person interviews to clarify. High standards for integrity and truthfulness. Ultimately make decision that keeps in mind what would be best for the potential staff person in their faith and professional development.", "Interview Questions": "Please explain your convictions regarding evangelism and discipleship."}, {"date": "15 Jul 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Cru (Denver, CO) in Jan 2018", "Interview Descriptions": "The interview starts with an application that allows the applicant to express themselves, work style, development goals, and spiritual background.  Later a staff member will walk through the application and determine if the intern will be hired.", "Interview Questions": "What are some ways you hope to grow spiritually over this internship?"}, {"date": "13 Apr 2017", "title": "Donation Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cru (Orlando, FL)", "Interview Descriptions": "There are four meetings overall. The first time you enter into the building you'll take an alpha-numeric test. The next three are with various supervisors in which you will be asked a series of questions about your job history and how it relates to this position + why you'd be a good asset and background.", "Interview Questions": "What is your office working experience? Working in team environment, attention to detail, ability to be fast and efficient. Explain how you we're saved, why do you want to work here, work history and how it relates to process. Given mock scenarios to see how you would handle them."}], [{"date": "23 May 2017", "title": "Email Campaign Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Cru (Orlando, FL) in Mar 2017", "Interview Descriptions": "Was brought in for a panel interview with the department head, two human resources staff members and the team director. They were very hospitable and friendly. The interview was approximately 1 hour and we discussed everything from my personal testimony on how I became a Christian, what I do in my personal time, where I go to church, ministry experience and calling, and my desire to serve. They also asked more profession oriented questions about my past marketing experience and why I had jumped from job to job within a few months. They emphasized the need for personal initiation with projects and not having to depend on a manager to constantly give direction and feedback.", "Interview Questions": "Can you tell us how you came to know Jesus Christ as your Savior?"}, {"date": "19 Jan 2017", "title": "Campus Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cru", "Interview Descriptions": "Written resume and phone call interview. Had to answer a series of questions online with a couple referrals and then had a phone call interview. I was involved in the organization before I applied so it was a relatively easy process.", "Interview Questions": "What are your theological views?"}, {"date": "8 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Cru (Orlando, FL)", "Interview Descriptions": "I first had a phone interview with a member of HR and the Program Manager. Then had an in-person interview with 3 people where I was asked a lengthy list of questions regarding my previous work experiences, current spiritual experiences, and future goals in the position.  This interview required passing of computer skills testing beforehand.", "Interview Questions": "Describe a situation in a previous job where you experienced a difficult customer and how did you solve the problem?"}, {"date": "20 May 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Cru (Orlando, FL)", "Interview Descriptions": "The interview was setup by a recruiter. I went in to meet 2 members of the team who were both excellent people. We talked about my education, my personal projects, my work experience, and why I wanted to work for them. Everything went great; received an offer not long after.", "Interview Questions": "Why did you want to go down this career path?"}, {"date": "2 Aug 2014", "title": "Regional Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Cru (Atlanta, GA)", "Interview Descriptions": "It was a good process.  Filled out an application and was interviewed by two Cru staff members.  Was able to ask clarifying questions about working with Cru.  After completing interview I received a call a few weeks later informing me of acceptance to Cru staff.", "Interview Questions": "N/A"}, {"date": "7 Apr 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cru", "Interview Descriptions": "filled out an application", "Interview Questions": "They asked me about my pornography use"}, {"date": "28 Mar 2013", "title": "Warehouse Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Cru", "Interview Descriptions": "I have worked for Cru twice, in the same location.  The first was as a college student.  I worked in their warehouse over Christmas break.  The second time was two years later, so I simply walked in and asked if they were hiring again.  They were thrilled.  So, there was not much of an interview process.  Network.  Network.  Network.", "Interview Questions": "Hey, do you want to come work for us again?"}, {"date": "29 Sept 2012", "title": "Senior Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Cru (Knoxville, TN)", "Interview Descriptions": "Standard written application and oral interview with a male/female pair. The process was basically like this: talk with a local staff member about an application, complete the application and gather references, submit to a regional office, schedule a 1:2 people interview, follow-up phone call if necessary, wait for an acceptance letter. With acceptance comes a placement to a team which could be your first preference but could also mean being placed where the organization has needs. (This general process was years ago. I think all applications are now centrally processed in Orlando, Florida but I am not certain.)", "Interview Questions": "Have you struggled in the past with viewing pornography?"}, {"date": "25 Sept 2012", "title": "Desktop Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cru", "Interview Descriptions": "They have a 5 step process.\r\n1) who you are Christ. \r\n2) spiritual traits. what you stand for\r\n3) technical questions.\r\n4) meet and greet with ITC teams.\r\n5) the offer it self to you. HR questions.", "Interview Questions": "a lot of questions about sacrifice"}, {"date": "30 Jun 2016", "title": "Campus Minister Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Cru (Austin, TX) in May 2012", "Interview Descriptions": "There is a thorough vetting process, getting into the details of your relationship with Christ. I appreciate the different aspects of your health: stewardship of your body, living by convictions, and seeking out an ongoing relationship with God. It was a good opportunity to remind myself of why I was choosing to step into ministry. It was also helpful to interview face to face.", "Interview Questions": "How do you respond when things do not go well?"}], [{"date": "13 Aug 2016", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Cru (Newport News, VA) in Feb 2012", "Interview Descriptions": "The interview process was actually called a \"preview\" so I didn't really know that I was coming in for an interview...I just thought I was taking a preview of the ministry. After I arrived, I was taken to each department for about 5-10 minutes and introduced to that department head who explained what they did (ex. National, International, Finance, HR, Resources, Prayer, Marketing). Then I finally ended up in the office of my supervisor who had a copy of my resume. That's when the job interview and offer actually took place.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Oct 2015", "title": "Campus Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Cru (Orlando, FL) in May 2011", "Interview Descriptions": "assess your spiritual and leadership level and skills.  There were many give an example questions.  also how stable you are in all aspect of your life since its more of a calling instead of just a job.", "Interview Questions": "A lot of spiritual questions"}, {"date": "20 Feb 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cru in Sept 2010", "Interview Descriptions": "Very simple online background test which gets in to personal life and theology. After submitting my application I was notified via email and had a short phone interview with a current staff member.", "Interview Questions": "How are you currently building your faith?"}]]