[[{"date": "17 May 2023", "title": "Lighting Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pensacola Christian College (Pensacola, FL)", "Interview Descriptions": "Based on values such as: Belief, family, music, and ethic. It was a conversational interview and they typically hire students from within the company. They already possessed your files such as: disciplinary file and academic file.", "Interview Questions": "What is my goals and what do I expect from the company?"}, {"date": "1 May 2023", "title": "Front Desk Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Pensacola Christian College", "Interview Descriptions": "You submit an application that you can only get through recommendation. If you get the interview you are contacted with date/time/location. The interview process is a very broad one meant to assess your soft skills mostly. I would say it is one of the more calming interviews I've had.", "Interview Questions": "How would you/have you handled conflict/confrontation."}, {"date": "1 Apr 2022", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pensacola Christian College", "Interview Descriptions": "Mine was over the phone. Asked alot of \"loyalty\" and religion questions. They follow the STAR procedure alot. they were very up front about things though. Be prepared to follow up with personal information. All of this was relatively standard.", "Interview Questions": "What do you think of today's music? "}, {"date": "29 May 2021", "title": "Video Editor/Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pensacola Christian College", "Interview Descriptions": "In person, short 10 minutes to go over qualifications, my skill set, and job responsibilities. There were two ladies interviewing me in the conference room, and it was a very friendly conversation.", "Interview Questions": "Are you proficient in the Adobe suite?"}, {"date": "5 Nov 2022", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pensacola Christian College (Pensacola, FL) in Jan 2018", "Interview Descriptions": "PCC knew of my work ethic but wanted to know if I would be a good leader to my student workers spiritually. The interview was like none I had ever had before but it was nice to see the genuine care for not only myself but also their staff and faculty.", "Interview Questions": "Are you saved? Explain when and how. What type of music and movies do you listen to/watch? Are you okay with attending church on campus?"}, {"date": "19 Oct 2017", "title": "Promotions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pensacola Christian College (Pensacola, FL) in Apr 2017", "Interview Descriptions": "I filled out a staff application during the spring semester of my senior year of College. 2 weeks after submission, I was interviewed face-to-face for the position. Questions were pertinent to the job and the goals/values of the Company.", "Interview Questions": "What skills do you bring to a promotional position?"}, {"date": "20 Jan 2017", "title": "IT Department Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pensacola Christian College (Pensacola, FL)", "Interview Descriptions": "The interview was solely with a male Employee Services staff person with no one from my future relevant department present, and after hire, I found out that my future team leader was not even privy to my resume or any skills or experience in it. Nor ever after as well. I have found out afterward that the Employee Services Department wields incredible power at this organization and is quite inflexible and lacking in member care - the number one trait desired in employees is compliance. With hiring at PCC, the priority seems to be filling an empty position and total compliance to the Employee handbook vs. what are your skills and how would you benefit the organization and vice versa. Forget career progression possibilities. You are shown a high quality, informative video presentation of the organization's history and founders. Church attendance at the on-campus Campus Church is absolutely a job requirement and you will fill in attendance slips each week (and they are checked by HR) so forget personal choice or responsibly choosing your own place of worship. During the interview it felt like signing on here was relinquishing much of my personal dignity and freedom of choice in exchange for a paycheck. Much of this was explained as necessary due to it being a ministry - never mind that to a Christian, every job they always work at is/should be automatically that. Also of concern should be the fact that every full-time hire is for at least a one-year contract even for all support jobs and the explanation is that your leaving would impact the school schedule. And if you happen to not be applying exactly before the start of the Fall semester then they'll tack on the remainder of that year until July PLUS one year. Because they can. There is no negotiating anything or flexibility within the interview - which is an accurate preview of the overall work environment that follows. Also, although the company can terminate you with a normal 2 weeks notice, all employees must not only give a 6-month notice (in January) but can only then leave in July (when all employee contracts stop/restart) without being considered a \"contract-breaker\". Be very aware of this going into any interview or accepting a position. Also, I recommend carefully read the entire Employee Handbook before deciding.", "Interview Questions": "Are you in complete agreement with the Employee Handbook in all areas (dress, personal beliefs and standards incl. music, etc.)"}, {"date": "26 Jan 2017", "title": "Dining Services Assistant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Pensacola Christian College", "Interview Descriptions": "There really wasn't much of one. They already knew me and made their decision based off of that. Your reputation and history there, particularly as a student, has a big affect on how they see you. If you were a trouble maker there isn't much room for grace or a second chance because they already have a preconceived notion you are up to no good.", "Interview Questions": "N/A"}, {"date": "16 Jan 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Pensacola Christian College (Pensacola, FL)", "Interview Descriptions": "Interview with Vice President of Academic Affairs. It was fairly easy and honestly has very little bearing on whether you will be accepted unless you graduated from somewhere else, as it is all based on your standing as an undergrad. A major thing that bugged me, but probably shouldn't have surprised me considering the overall environment of the school, is that your answers are expected to parrot PCC's beliefs and were often misleadingly phrased.", "Interview Questions": "What is your philosophy on music?"}, {"date": "14 Feb 2017", "title": "Pressman Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pensacola Christian College (Pensacola, FL) in Dec 2016", "Interview Descriptions": "there was no interview, there was just an application that we have to fill out regarding our personality.\r\nalso at the end of section we have to talk or describe about ourselves.", "Interview Questions": "tell me about yourself"}], [{"date": "13 Feb 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pensacola Christian College (Pensacola, FL) in Oct 2016", "Interview Descriptions": "They just ask you questions about your values.  In fact, they most likely pre-screen who they bring in for an interview based on the applicant's Christian testimony (applicants provide your testimony to them when applying).", "Interview Questions": "What are your values and do they align with the mission of PCC?"}, {"date": "15 Feb 2017", "title": "Service Position Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Pensacola Christian College (Pensacola, FL) in Sept 2016", "Interview Descriptions": "Asked questions related to how well I match with the \"Ministry\". Wanted my salvation experience and stuff like that. Very much focused on the \"Ministry\". Was mentioned a TON during the interview that this was a \"Ministry\" for others. Otherwise a pretty basic interview. Had nothing related to my actual skills and ability.", "Interview Questions": "Please share your salvation testimony."}, {"date": "12 Feb 2019", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Pensacola Christian College (Pensacola, FL) in Sept 2015", "Interview Descriptions": "One round interview. First, you filled an application from the HR office. then, get called for interview after a couple weeks. another couple weeks, you will get offered a contract that needs to be signed in a week.", "Interview Questions": "How do you got saved?"}, {"date": "4 Jul 2019", "title": "Audio Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Pensacola Christian College (Pensacola, FL) in Mar 2015", "Interview Descriptions": "I was asked to apply for a specific job. I put in my application and was immediately asked to interview. I set up an interview for a week or so later. The interview was with Don Brewster who spent 90% of the interview asking me questions about my spiritual life and music convictions. I felt like this was completely unnecessary, but I'm not surprised that this is how they conduct interviews.", "Interview Questions": "What are your personal music conviction?"}]]