[[{"date": "14 Dec 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Abbott Northwestern Hospital", "Interview Descriptions": "The interview was overall nice, hr called me one week ago to schedule the phone call. Great conversation. I was being ask what is the challenging moment for you when giving care to a patient.", "Interview Questions": "what is the challenging moment for you when giving care to a patient"}, {"date": "29 Aug 2020", "title": "General Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Jul 2020", "Interview Descriptions": "Two phone calls, first with recruiter. Second with manager. They said that was it, no in person interviews. Then, recruiter emailed me that by the end \"of the week\" we will have \"more to come\" since I was considered for four open positions. No follow up email. Contacted recruiter several times and the answer was always the same: \"Oh, I'm so sorry; I know the manager is so super busy these days. I'll reach out to her and see what is the response.\" This went on for several weeks. I decided to withdraw since it was obvious the recruiter was acting very fake and candy coating the fact that a strong lack of communication existed between the two management levels. The overly fake response by the recruiter was very stupid and immature. The interview was scheduled about a month after the application and resume were submitted. Quite obvious the over all corporation has a real lack of communication. The experience was only a prelude as to what I could imagine being an employee.", "Interview Questions": "Using the STAR approach (S for Situation, T for Task, A for Action and R for result) how did you handle a difficult customer? "}, {"date": "17 Jun 2019", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Jun 2019", "Interview Descriptions": "Arrive early, check in at volunteer desk. They note what time you arrive, this is part of the process. Be ready to answer questions, they have a form of questions to ask. You go to the floor you are interviewing for and get a tour.", "Interview Questions": "What is LPN scope of practice "}, {"date": "28 Sept 2020", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Abbott Northwestern Hospital (Fremont, CA) in Jan 2018", "Interview Descriptions": "It was pretty simple, just a short application and 10 min interview. I talked to someone at the career fair who helped to push my application along and help me land the interview. There wasn't too much competition so wasn't too hard to get the role.", "Interview Questions": "Tell me about yourself? What did you do last summer?"}, {"date": "17 Jul 2017", "title": "Infection Preventionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Abbott Northwestern Hospital", "Interview Descriptions": "First round was an in-person interview with one individual. Second round is a panel interview with 3-4 infection preventionists, quality director, and hospital infectious disease epidemiologist. Took about 3 weeks after first round to be notified of second round selections.", "Interview Questions": "They asked many of the basic interview questions, but then also asked about specific infectious disease experience and project management experience."}, {"date": "29 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Oct 2015", "Interview Descriptions": "Great interview process. I was contacted by HR who asked me a few questions about my preference as to what kind of area I would like to interview for and after a short discussion she matched me with a floor where I was interviewed by the nurse manager. It was a one on one interview process with behavior style and personal questions. Very easy to discuss topics with the manager. Heard back from HR within a few days with the result of the interview. Would recommend interviewing at this hospital.", "Interview Questions": "Tell us about a conflict you had with a coworker and how you handled the situation."}, {"date": "27 May 2015", "title": "PAs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in May 2015", "Interview Descriptions": "First started off with a phone interview within a few weeks of applying online for the position.  Nothing out of the ordinary, the Supervisor did most of the talking about the role and the duties.  Did not really ask me any questions about background or experience.  After speaking on the phone for 15 minutes, I was offered  to come in the following business day because of the weekend.  For the in person interview, I showed up early like I always do for interviews.  Probably 20 minutes prior to the scheduled time.  I sat and waited maybe 10-15 minutes passed the scheduled time when I was approached by the supervisor.  We went back to the office and again it was more of a laid back feel. Discussed schedules, departments, tools and resources need to work, start date, and even salary.  I honestly thought I had the job but a few days later, I received an email stating I was not chosen.", "Interview Questions": "Typical interview questions.  Nothing new or things that may stump someone."}, {"date": "21 Feb 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Nov 2014", "Interview Descriptions": "Laid back, comfortable. The interview felt more like a conversation rather than a question and answer format. We were in a small room sitting around a round table. It was me and then two managers.", "Interview Questions": "Why would you be a good addition to our team?"}, {"date": "9 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "I was contacted by HR to schedule an interview by 3 person panel.  The recruiter or HR rep asked about my history as a nurse and what i knew about Allina etc.", "Interview Questions": "how do you start your day on the floor"}, {"date": "10 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Abbott Northwestern Hospital", "Interview Descriptions": "I submitted an online application but did not hear back, in fact I received and email saying \"no thank you, a union member got the position.\" I happened to know someone who worked in the department I applied to and they went to the hiring manager. The hiring manager then had HR pull my application for an interview. As part of the competency assessment, I took an online simulation assessment. After passing that test, I was given an in-person interview with the hiring manager. I was offered the position on the following work day from the HR rep.", "Interview Questions": "The simulation test was unexpected. It involved real-life RN dilemmas and an analysis of vital signs and physical assessments."}], [{"date": "18 Sept 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Sept 2012", "Interview Descriptions": "Basic questions with two supervisors, talked about scheduling what the job entails and then about me and my qualifications. They were easy to talk to and did very well at explaining what the job entailed. They asked serious questions about me and my work ethic.", "Interview Questions": "What makes you want to work for a hospital"}, {"date": "5 Nov 2013", "title": "Environmental Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Apr 2009", "Interview Descriptions": "it was a average interview process, i enjoyed questions and i had abilities as well.", "Interview Questions": "N/A"}, {"date": "27 Mar 2009", "title": "Physician Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Abbott Northwestern Hospital (Minneapolis, MN) in Dec 2007", "Interview Descriptions": "called recieved from department manager, we set-up a date to meet. Day of the meeting chat about the position, questions & answers, expectation, meet up with other managers and staff, salary & benefits negotiations. I accepted the position and started a week later prior to orientation & excellian training.", "Interview Questions": "Did you havea negative work history ? why are you leaving your current employer?"}]]