[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "If you want to make a difference, this is the place!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Mar 2023", "job_title": "Direct Support Professional (DSP) in Manhattan, KS", "duration": "N/A", "pros": "Flexible schedules, good pay, stellar training opportunities, clients are the best part as they are just the absolute best! Atmosphere is generally light-hearted and friendly and the people who work here are phenomenal at what they do. Everyone cares about everyone!", "cons": "Not necessarily an easy job, can be difficult at times, and it can be rough when we lose a client."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Absolutely Loved Working Here.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Jan 2023", "job_title": "Resident Advisor in Manhattan, KS", "duration": "N/A", "pros": "The best thing about working for this company are the clients. The work can be taxing at times but its a job worth doing. BLDC also has job training as well as some certifications you can transfer to another job if you chose to leave. Full time has some good benefits, also you have the opportunity for overtime.", "cons": "As with any job, sometimes you get lazy coworkers which can make the job a bit harder. Split shift hours can make it a bit difficult to do because there is only a small window to get things done for your daily life."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Job", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jan 2023", "job_title": "Residential Advisor in Manhattan, KS", "duration": "N/A", "pros": "Love the clients and work hours.", "cons": "Short staffed on weekends most of the time; but plenty of extra hours available if wanted."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Clients/ Poor Management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jan 2022", "job_title": "Residential Advisor in Manhattan, KS", "duration": "N/A", "pros": "You get to build fulfilling relationships with amazing clients and their families. The clients here really challenge your perspective and will make you smile and laugh every single day. When working in a group home, you get to help build and experience a family dynamic in the house.", "cons": "Quality caregivers will be taken advantage of. Reading past reviews, it appears that communication and respect given to employees by higher staff has been an issue for at least four years. Employee turnover is very high and I can attest that it is due to a lack of respect. Getting shifts covered is unlikely, even if necessary. Some staff is very lazy and when concerns are voiced, they are often ignored (even when pertaining directly to the care of the clients). I completely understand the high turnover rate after how I have been treated, and would likely be a part of this statistic if it weren’t for the wonderful clients."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Can be a bit much", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Jan 2022", "job_title": "Residentail Advisor in Manhattan, KS", "duration": "N/A", "pros": "time and a half pay for overtime\r\nflexible schedule for students\r\nnice people", "cons": "lack of communication\r\nfavoritism from management\r\nover worked\r\nnot very appreciated"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Mar 2021", "job_title": "Residential Advisor in Manhattan, KS", "duration": "N/A", "pros": "Clients are great, decent benefits", "cons": "Poor upper management, very bias"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "RA", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Jul 2016", "job_title": "RA I in Manhattan, KS", "duration": "N/A", "pros": "For the most part, the clients are great, and if you have your heart in the right place then you will fall in love with most of them. The clients and the fun RA 1s see what make this job worth anything.", "cons": "The management IS TERRIBLE!!!! They are so drama oriented and RA 3s spend all there time trying to find someone to push in front of the bus. They smile at your face and stab you in the back. No one is properly trained! The hours are HORRIBLE. Only RA3s are full time even though RA1s will work 30-40 hours a week. They blacklist ppl. Nearly impossible to get a raise. $9 is not enough for your dignity and self respect. HORRIBLE AND DANGEROUS JOB,"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Current, soon to be former employee!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Jul 2016", "job_title": "Ra1 in Manhattan, KS", "duration": "N/A", "pros": "The clients are amazing! They're the only reason I have stayed at this organization for so long! Working with them and getting to know them makes the job so enjoyable and fulfilling. It breaks my heart to be leaving them, but the organization itself is horrible! (Great values and mission, but they don't follow through with it!) I love my coworkers, as well! I've made some very good friends working here!", "cons": "After working here (for near a third of my life) I will be leaving for so many reasons! They are not family oriented at all. For instance, I needed to change shifts to accommodate changes with family at home, put in for a transfer and was denied. Which is a shame because they can't keep staff for anything. They keep raising the wage, but it's not worth staying. They don't offer medical to part timers, though most of the positions are part time and part timers work more than full time hours on most days because of the lack of coverage. Managements horrible! My manager has absolutely no clue what she's doing, and she's the one that's supposed to be training me. I've been trained wrong and had to go to other managers or RA2s or 3s (who also plan to leave the company) for the correct training. My clients have been left behind and put on the back burner for so long simply because they don't live in a group home owned by BLDC. They expect me to do my job, but don't give me the resources to do so. For instance, we have gone paperless. All our documentation is electronic. This happened over a year ago. I have yet to be given a laptop to work on at my clients home. When I need to do paperwork, I have to go sit in a 5'x9' vestibule where everyone clocks in and out at. No a.c./heat. Just between 2 glass doors. Always filled with flies from people coming in and out during the day. Not pleasant. It's not really about the clients anymore. It's a giant power struggle, \"who's in control\", kinda deal. All they care about anymore is how we look on paper for CARF (accreditor). They come every 3 yrs, so every 3 yrs it's a cluster of madness trying to make sure everything's up to date and in the system when really there's no reason to not be on top of all that at all times. All the managers are awful. Its not about \"how can I help you to be more efficient in your position?\" its, \"I'm gonna start writing memos and DAs and this will go in your performance appraisal!\" I would never recommend this job to anyone, and that's sad because I love the clients and they deserve so much better!!!!! I pray that BLDC gets bought out by a better organization that can do/give better for the clients! Not to mention, they waste money senselessly, but then we have clients that bring home $2 paychecks every 2 weeks because they don't provide/find work for them. Sad huh, who can live off of that? Which leads me to the process of requesting money from payees. The clients rarely get their money by the time they need it, then staff have angry clients they have to de-escalate because they can't do/buy what they want/need. Its all crap, simply put. Wish it wasn't, hasn't always been, but it just is. Good luck to anyone wanting to work there."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Rewarding Work, Awesome People, Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Jun 2013", "job_title": "Anonymous Employee in Manhattan, KS", "duration": "N/A", "pros": "Getting to know wonderful people and making a difference in their lives; participating in fun outings and activities (discounted movie tix for staff!); raises, bonuses, generous referral program; friendly, helpful upper mgmt and cool coworkers; laid back environment; invaluable life experiences", "cons": "Hygiene etc (if that stuff bothers you... which it won't after a while); the usual office politics"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Compnay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Apr 2016", "job_title": "Residential Advisor in Manhattan, KS", "duration": "N/A", "pros": "I stated working here over a year ago and have loved every day. It is truly rewarding when you see your clients succeed at life and at work. The clients are what keep me coming back to work every day. The pay is great.", "cons": "Always looking for more people to work and sometimes it can be really hard to find someone to cover a shift for you. You also get a lot of requests to work extra hours which can be taxing to always have someone to ask you to cover a shift."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Big Lakes", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Sept 2018", "job_title": "Residential Staff in Manhattan, KS", "duration": "N/A", "pros": "Helping people with developmental disabilities is very fulfilling and I think that they are a very underserved population and I was able to build some great relationships with people that truly needed people to care about them.", "cons": "High staff turnover, management does not take the time to care for their employees, they run their staff into the ground while keeping them at \"part-time\" employment. Company only seems concerned with making money and not with putting people with disabilities in the best possible situation for them to thrive."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "It’s an okay place", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2020", "job_title": "Direct Support Professional in Manhattan, KS", "duration": "N/A", "pros": "Great clients, great coworkers, flexible hours", "cons": "Bad management, unorganized, not helpful when wanting to switch shifts"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Residential Advisor I", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Oct 2016", "job_title": "Anonymous Employee in Manhattan, KS", "duration": "N/A", "pros": "closely work with clients in their home. develop communication skills. really rewarding. compensation is barely above minimum wage", "cons": "It definitely feels as though management doesn't care about you as an individual. They just want shifts to be filled.  Very very long hours."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Aug 2011", "job_title": "Residential Advisor I in Manhattan, KS", "duration": "N/A", "pros": "Great job for students in the area", "cons": "Very hands on position where you are responsible for people's hygiene"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Lack of Communication", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Jul 2018", "job_title": "Direct Support Professional in Manhattan, KS", "duration": "N/A", "pros": "Flexible hours, awesome clients, awesome coworkers", "cons": "Disrespectful management, petty management, do not treat employees fairly"}]]