[[{"date": "6 Jun 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of the People (Pasadena, CA)", "Interview Descriptions": "More of writing constructive feedback. Then face to face meeting happens to check for working in online culture. Gradually some domain knowledge is tested and lastly the process moves to Indian consultancy -Vandey", "Interview Questions": "How would you share about importance of your domain to someone who is not from your domain?"}, {"date": "23 Apr 2023", "title": "Volunteer Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of the People (Atlanta, GA)", "Interview Descriptions": "The process is like a class room setting. I like this because this is also the platform that the university uses. There are recorded videos that help you become acclimated with the platform. If you make it pass this and become a volunteer instructor, you can always go back to the videos as reference.", "Interview Questions": "Do you have experience with online platforms"}, {"date": "22 Jan 2023", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of the People", "Interview Descriptions": "The interview process was simple and straightforward, I would say it was an ideal interview. It was structured, organized, and to the point. Left feeling as if it went well.", "Interview Questions": "What is your teaching experience?"}, {"date": "2 Dec 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of the People", "Interview Descriptions": "Easy process. All electronic transfer of transcripts as well as the introduction to the learning system. Generally, hr is pretty prompt about answering questions and emailing the information needed to move forward in the application process.", "Interview Questions": "The mostly asked about credentials, availability, and working with a diverse population."}, {"date": "29 Oct 2021", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of the People (Austin, TX) in Oct 2021", "Interview Descriptions": "It was a pain just to go through all detail of the applications and modules and test and samples.  If you want this job you need to work hard  on the modules but it does not guarantee the jobs", "Interview Questions": "All web base interview with postings review and examples. Very long"}, {"date": "20 Jan 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of the People", "Interview Descriptions": "Interview began with an assessment of subject knowledge and teaching preference.  The second step of the interview process included taking a course on teaching which assessed teaching abilities and university knowledge.  Once the course was completed I was informed almost immediately if I was hired.", "Interview Questions": "How would you interact with students across the globe with varying needs and levels. "}, {"date": "28 Feb 2019", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of the People (Pasadena, CA)", "Interview Descriptions": "At first, the position looked good and respectable to volunteer to teach people who wanted an online Moodle education for a hundred dollars a course..  Apply online, phone interview, fill out forms, take quizzes, watch boring videos, and write essays.", "Interview Questions": "Look over these recent Moodle transcripts of  last year's course, pick a question that was asked and answer it. Also present a supplementary lesson. ...After looking over most of  the actual  transcripts of the Moodles for the course I was to teach , I was horrified at what a waste of time this whole course is! The nonsense that was going on. The stupidity and the waste of a real opportunity to learn. I want no part of this joke. They are even charging $100 a course to the students as well as collecting grant supports, donations, etc. "}, {"date": "20 Oct 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of the People", "Interview Descriptions": "The interview process was fairly straightforward. There was a main interview conducted over the phone followed by roughly two weeks of training. The training was a bit intense, but it is completely doable as long as you have at least some experience within an online classroom.", "Interview Questions": "Have you taught online before?"}, {"date": "4 May 2018", "title": "Part-Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of the People in Jul 2017", "Interview Descriptions": "Received an email that they had enough volunteers and suggested some other opportunities. About a year later reached out via email saying they were now looking for more volunteers and if I was still interested. Had a phone call. Asked for references. Provided with hiring documents shortly later. All completed within 2 weeks.", "Interview Questions": "Tell me about your teaching style."}, {"date": "14 Jun 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of the People (Pasadena, CA) in Apr 2017", "Interview Descriptions": "Brief phone call followed by months of nothing.   Then email contact and some very short notice \"get this done in 1 week or less\" online training.    The online training used Moodle course and lots of online videos.   Although this Glassdoor review makes me give a city in order to submit the review, everything was actually done online and by emails.", "Interview Questions": "If you were a new crayon in the crayon box, what color would you be?"}], [{"date": "24 Jan 2018", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of the People (Pasadena, CA) in Apr 2017", "Interview Descriptions": "Need to fill out a questionnare as part of a Phase I of interview; Phase II was a skype interview with the director of HR; General questions about teaching style and aspirations; Questions regarding past relevant experience and qualifications;", "Interview Questions": "What will be your philosophy of handling students from different cultures?"}]]