[[{"date": "30 May 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Petersburg College (Saint Petersburg Beach, FL)", "Interview Descriptions": "It was not a good experience. I got the job but you can not be yourself or let people know they are wrong or made a mistake. The job was NOT what I was told it would be.", "Interview Questions": "Just look the questions up on google. They are those."}, {"date": "27 Aug 2020", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Petersburg College (Saint Petersburg, FL) in Jun 2020", "Interview Descriptions": "I had a Zoom interview with two individuals from the Workforce Institute.  The interview was standard and friendly with common questions regarding teaching experiences and styles.  Neither individual had the professional courtesy to follow up with me to state that the position was filled.", "Interview Questions": "Standard adjunct instructor questions: describe your teaching style, how would you handle a specific situation, etc."}, {"date": "17 Jun 2019", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Petersburg College (Clearwater, FL)", "Interview Descriptions": "Phone interview followed by 1-hour in-person interview with four people. Giving this a \"thumbs down\" because they never informed me that I did not get the job, but I assumed as much after waiting a month. It's extremely rude to interview someone and never contact them again. Makes me suspect they would not have treated me well as an employee, either.", "Interview Questions": "Typical interview questions"}, {"date": "23 Feb 2019", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Petersburg College", "Interview Descriptions": "Panel with other IDT personnel. Will need to show a live version of a course developed by you. ( or someone else, they have no way of knowing the truth). The director makes final pick although she’ll claim differently in front of you.", "Interview Questions": "How well do you work with difficult  faculty "}, {"date": "29 Jan 2019", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Petersburg College", "Interview Descriptions": "The interview was upfront and quick lasting about 15 minutes give or take. I was brought into one of their conference rooms being interviewed by 3 of their staff members rotating questions. Entire atmosphere was very relaxed, straightforward and on point.", "Interview Questions": "I was asked some small technical questions and overall expectations. "}, {"date": "6 Nov 2018", "title": "Instructional Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Petersburg College (Saint Petersburg, FL)", "Interview Descriptions": "I had a good experience interviewing with SPC. Everyone was kind, polite, and welcoming. For an Instructional Support Specialist position at the Writing Center, they interviewed me in a panel discussion, but it was never stressful and I always felt comfortable. They then asked me to review a sample essay and demonstrate how I would give feedback as a tutor.", "Interview Questions": "They asked me to review a sample essay and demonstrate what feedback I would give the \"student.\" "}, {"date": "16 Mar 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at St. Petersburg College", "Interview Descriptions": "Spoke with the dean and academic chair of the department. Discussed my resume, interests in teaching and teaching philosophy. Honestly, it was so many years ago that I forget all the details.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Aug 2017", "title": "Accounts Payable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Petersburg College", "Interview Descriptions": "Positive! They were very friendly, and easy to talk to. The questions were straight forward, and easy to answer as a result. I had a great experience working for them, I only left to go back to school.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Apr 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Petersburg College", "Interview Descriptions": "5 levels of interviews including faculty group meeting. A pleasant experience considering they were interviews! A good group of people. Positive leadership. I'm glad that I got this job and would encourage anyone to apply here.", "Interview Questions": "Why do you want this job?"}, {"date": "17 Jan 2017", "title": "Student Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Petersburg College (Saint Petersburg, FL)", "Interview Descriptions": "I showed up 20 minutes early, and then sat outside my supervisors room until I was called in. I was interview by two supervisors in a private environment. The interviewers made several comments about my similar work history, and then proceeded to ask me questions. I was then told I would be informed If I got the Job and then went on my merry way.", "Interview Questions": "What would you do if a confrontation between students arose? "}], [{"date": "18 Jul 2016", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at St. Petersburg College (Saint Petersburg, FL) in Jul 2016", "Interview Descriptions": "The interview process was thorough, detailed and engaging for this OPS position.  The position was formalized in a set appointment and pre-determined location.  The interview process allowed for multiple introductions and questions.", "Interview Questions": "Do you know what the job entails?"}, {"date": "1 Jul 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at St. Petersburg College (Tarpon Springs, FL) in Apr 2016", "Interview Descriptions": "It was very relaxed, and basically consisted of making sure I met the qualifications to be a student assistant. By that I mean, the 6 credit hours per semester, making sure I can work 15 hours a week, and that's pretty much it. She wanted to make sure I'd at least be there for more than one semester, so they wouldn't have to hire anyone else and retrain any time soon. She also suggested that I volunteer around the lab for a couple of weeks in order to get a feel for it. She mentioned that some people have trouble working with the chemicals and that it makes it hard for them to work in the lab.", "Interview Questions": "How many credit hours will you be taking this coming semester?"}, {"date": "1 May 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Petersburg College in Aug 2015", "Interview Descriptions": "I submitted my application and within a month received a call from the Chair at St. Petersburg,  I went in for an interview and was offered a position at the end.", "Interview Questions": "Describe your teaching pedagogy and examples for overcoming challenges with adult learners."}, {"date": "17 Aug 2017", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Petersburg College (Tampa, FL) in Feb 2015", "Interview Descriptions": "Group phone interview where they asked about related technical experience. They asked what were my reasons for wanting to change jobs and talked about the relocation process. No face to face interview was conducted.", "Interview Questions": "Group phone interview where they asked about related technical experience. They asked what were my reasons for wanting to change jobs and talked about the relocation process. No face to face interview was conducted."}, {"date": "1 Mar 2015", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Petersburg College (Clearwater, FL) in Feb 2015", "Interview Descriptions": "It took a long time.  I got a call back about week after I first responded but did not have the interview until almost three months later.  They sent me a letter of what I was required to bring which included a presentation I had to create using ppt. and some of my previous ID work.  I had a three panel interview and had to give a presentation first about customer service.", "Interview Questions": "What was one your most difficult challenges to resolve at your previous job?"}, {"date": "25 Mar 2018", "title": "Instructional Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Petersburg College (Saint Petersburg, FL) in Jan 2015", "Interview Descriptions": "quick interview process. easygoing staff. it helps if you start working at the college as OPS since interview questions are related to the college. It is important to be familiar with the program that the student use to be able to do good in the interview", "Interview Questions": "how to help multiple student at the same time "}, {"date": "15 Jun 2019", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Petersburg College (Seminole, FL) in Jan 2015", "Interview Descriptions": "Basically it was pretty easy. I applied then had to take a math test. After passing the  math test I was then given the interview. Basically just asked how I would work with students in order to ensure they understood mathematical concepts.", "Interview Questions": "What would you do if there’s multiple students who needed help."}, {"date": "13 Dec 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Petersburg College (Largo, FL) in Nov 2014", "Interview Descriptions": "There wasn't much of an interview process. I provided my resume online and they called and asked about my class schedule and date availability. That was it and then they offered me the job.", "Interview Questions": "What days are you available to work X hours?"}, {"date": "1 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Petersburg College (Saint Petersburg, FL) in Aug 2014", "Interview Descriptions": "For most positions within the college, you will be contacted by the head of the department you are applying to.  They will set up the interview.  For most positions, it will be a panel interview.  There were four people at mine; the dean, the academic chairs and the academic coordinator.", "Interview Questions": "What if we ask you to complete a task you don't know how to do?"}, {"date": "22 Nov 2014", "title": "Instructional Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Petersburg College (Clearwater, FL) in Aug 2014", "Interview Descriptions": "The interview process starts out with a phone interview with the director and two professors that lasts about thirty-minutes. If you get past the phone interview, then the next step is a face-to-face group interview with the director, his boss, three professors, and ultimately the campus provost has some final questions at the end. The latter meeting took me about two-hours.", "Interview Questions": "The group interview is a rather long, comprehensive meeting with a lot of different questions asked that one would normally expect during a job interview, which results in many things being covered in the process. The last question they asked me was the one that threw me off the most, which was \"Now, [my name], do you have any questions for us?\""}], [{"date": "17 Nov 2018", "title": "Senior Instructional Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Petersburg College (Tarpon Springs, FL) in Jun 2014", "Interview Descriptions": "Most interviews are a committee of about 5 people who ask questions. There is no set list of questions, it depends on the committee. If there are many applicants, sometimes there is a phone interview.", "Interview Questions": "They asked if I was available to work weekends."}, {"date": "14 Nov 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Petersburg College in Mar 2014", "Interview Descriptions": "Filled out online application (very long and detailed).  Applied to open posted positions on SPC Employment website.  Was phoned to interview.  Interviewed.  Then requested to return to do presentation and was offered position.  The longest part was getting all paperwork and background check information cleared.", "Interview Questions": "No gotcha questions or surprises.  All professional"}, {"date": "22 May 2014", "title": "Student Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Petersburg College (Saint Pete, FL) in Dec 2013", "Interview Descriptions": "Pretty straightforward. Interviewed with the Provost, his assistant & one other person. No questions out of the ordinary. Felt very relaxed during the interview, great bunch of people to work for.", "Interview Questions": "Nothing out of the ordinary."}, {"date": "26 Aug 2013", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at St. Petersburg College", "Interview Descriptions": "I originally was told about the position through an acquaintance. Having someone on the inside put in a good word for you can go a long way. As for the interview process itself, be prepared to wait a long time. Up to 6 months, to hear back. The interview process is very long and they are required to interview multiple people multiple times. So don't be surprised if you get asked to come back 3 times or so.", "Interview Questions": "There was nothing out of the ordinary. As usual, the more you know about the job, the better."}, {"date": "12 Jun 2015", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at St. Petersburg College (Seminole, FL) in Aug 2013", "Interview Descriptions": "I took a written test (very straight forward), which tested my ability in various math subjects. And then the real interview began when I was asked to explain the questions on the test I had just taken. The interview process isn't too difficult it really just depends on how you answer the questions and if they were correct. How clear, or if you were confusing. Which may affect how you tutor actual students. (The interview questions may vary, this is what I had gone through for Math tutoring, but there are other subjects to tutor in as well.", "Interview Questions": "Could you explain this question to me? (It depends on the subject you are tutoring in, they may ask your experience, why you think you're qualified, da da da). My question pertained to my ability in answering questions for students."}, {"date": "6 Jan 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Petersburg College (Tarpon Springs, FL) in Dec 2012", "Interview Descriptions": "Send in your resume, head to in person interview with head of department. It is not very difficult if you are qualified and know what you are talking about.  There is a background check that includes finger prints.", "Interview Questions": "What kind of experience do you have with the subject you are teaching."}, {"date": "22 Jan 2010", "title": "Mathematics Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Petersburg College (Seminole, FL) in Jun 2009", "Interview Descriptions": "Was looking for a math tutoring position at a local college and contacted the hiring manager to schedule an interview.  The hiring manager response very quickly and the interview was more like a friendly conversation.  She gave me a tour of the building and even got a photo ID on the same day.", "Interview Questions": "Why do you want this position ?"}]]