[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Ideal organization for a ministry job opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Jul 2023", "job_title": "Sr. Talent Acquisition Partner in Manila, Manila", "duration": "N/A", "pros": "I have very positive and healthy relationships with my managers and co-workers in my team. I feel connected, valued, loved and known. My manager encourages us to upskill and improve our role functions in the right way. He is also welcoming with listening to new ideas from his subordinates. Executives, directors and managers are very humble. Staff members are giving their 100% because they know that they are well taken cared of especially in the spiritual aspect.", "cons": "I'm sure that as the organization is expanding and serving more children, there will be more changes in everything to respond and address the current needs of our children. Just hoping that all members of the organization will be able to adjust and embrace the changes positively."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Upholds the Christian Values", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Nov 2021", "job_title": "Anonymous Employee in Manila, Manila", "duration": "N/A", "pros": "1. Considerate to the employees' needs\n2. Provides good benefits and offers additional incentives (i.e., free counseling, flexible schedule during pandemic, etc.)\n3. Not result oriented at the expense of employees physical/mental health", "cons": "Some teams can be preoccupied with their work and become quite exclusive"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "best child sponsorship and child development organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 May 2021", "job_title": "Senior Human Resources Business Partner in Manila, Manila", "duration": "N/A", "pros": "values employee engagement and clear staff and leadership expectations", "cons": "long and tight screening process"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Decent place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Mar 2018", "job_title": "Field Office Staff in Asia", "duration": "N/A", "pros": "Opportunity to meet some new people from many different backgrounds, ethnics, nationalities.  A workplace that provide opportunity for spiritual growth in Christianity values.", "cons": "The great core values of the organization are not fully implemented by the people managers, unfortunately.  There's relatively no clear and no objective measurement on employee's performance appraisal.  If you have good relationships with the people managers, then you will be taken care of, otherwise you would be on your own.  Lack of (almost no) recognition and lack of (almost no) rewards for the employees.  No matter how good you perform your works, that would be considered as part of your roles and business as usual (BAU).  There is no promotion and career path at all.  Once you are in a certain position, then you will be there all the way throughout your career life.  Unless you apply for a more senior position (if available and if approved by your direct supervisor and the user), then you will stuck on the same position for the entire life of your career in that organization."}]]