[[{"date": "21 Jun 2023", "title": "Patient Care Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Augusta University (Augusta, GA)", "Interview Descriptions": "I was basically already hired before they interviewed me. They asked a few ice breaker questions and then asked why I wanted to work on that floor. I was interviewed by the Nurse Manager and the Assistant Nurse Manager.", "Interview Questions": "They had me pick a number between 1 and 50 and then looked at their list of questions and asked that number. I believe mine was about a hero in your life."}, {"date": "12 Apr 2023", "title": "Supply Chain Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Augusta University", "Interview Descriptions": "Long, multiple interviewers overall and expanded period of time. There was little to no time to catch your breath, and seemed that it was more trying to see if you would handle the stress of just constantly having to be on.", "Interview Questions": "How do expect to make a difference in the first 180 days?"}, {"date": "27 Feb 2023", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Augusta University", "Interview Descriptions": "It was straight forward and pleasant. I found their interviewers to be very professional and kind. I will say that the location was obscure, difficult to find, and I had a little difficulty getting in contact with the interviewers.", "Interview Questions": "How well do you work in a fast-paced environment?"}, {"date": "5 Feb 2023", "title": "RN Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Augusta University (Augusta, GA) in Jan 2023", "Interview Descriptions": "It was a two-part interview with the director and Manager, then with the team. They ask questions concerning the care coordinator/case management position. Most of all, they wanted to know if I could handle pushback from doctors and patients.", "Interview Questions": "How good are you dealing with patients and staff pushback?"}, {"date": "2 Jun 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Augusta University", "Interview Descriptions": "The interview process was very informative and was exactly what I expected. No curve balls and straight to the point. With that being said, remain diligent for diligent for your interview process.", "Interview Questions": "What is your biggest strength to contribute to the team?"}, {"date": "21 Apr 2022", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Augusta University in Mar 2022", "Interview Descriptions": "I had 3 interviews on Zoom. Everyone that  I interviewed with was super nice, laid back. Very easy process and just spoke about work history and previous experience.  The interviews were very short also", "Interview Questions": "Tell me about yourself?\r\nExperience with  clinical trials?\r\nPrevious job duties more in detail?"}, {"date": "16 Feb 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Augusta University (Augusta, GA) in Jan 2022", "Interview Descriptions": "simple, straightforward. people there are kinda desperate for lab workers so if youre available thats the end of that. The interview was short, maybe half an hour. good luck everyone!", "Interview Questions": "Availability and experience with subject"}, {"date": "7 Jan 2022", "title": "OR Scheduling Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Augusta University in Jan 2022", "Interview Descriptions": "Three panel was in the interview. They was very nice and explain the job duties to me. Also, ask me about the shift and the hours that the person will be working.", "Interview Questions": "Where you see yourself in 3-5 years?"}, {"date": "13 Apr 2022", "title": "Deputy Chief Diversity Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Augusta University (Columbus, GA) in Dec 2021", "Interview Descriptions": "The interview process was in three phases.\r\n\r\nThe initial phase was done over the phone and conducted by the Diversity and Inclusion Assistant. The questions were straightforward regarding background, education, and skills applicable to the position.\r\n\r\nThe second round was a panel. There were multiple Diversity and Inclusion Assistants and again, there were no real curve balls from a question standpoint. All of them were pleasant and allowed ample time to answer questions. The questions were largely reminiscent of the first interview.\r\n\r\nThe third interview was virtual and with the Chief Diversity Officer. She was cordial enough and asked many questions regarding getting the office to an acceptable level as they were relatively new and trying to get to a point where they could justify the salaries of staff and positively influence the alumni base as there was much historical strife.\r\n\r\nYou may draw your own inferences from the composition of the office, but ALL SIX members of the office are female and identifying as such. Four are African-American (including the eventual person hired for the position) and two are from Central Asia. \r\n\r\nAgain, draw your own conclusions about the Chief Diversity Officer's idea of what a \"diverse\" office looks like, but if you are a qualified male or a female who is not a minority, then you should probably curb your enthusiasm regarding joining the team. The composition of the office makes it easy to see why alumni relations are strained and the university administration should recognize that the Office of Diversity and Inclusion manifests very little of both.", "Interview Questions": "Detail some of your experience in grassroots DEI activity."}, {"date": "30 Nov 2021", "title": "Campus Recreation Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Augusta University (Augusta, GA) in Aug 2021", "Interview Descriptions": "Submitted an application online, then was told a date and time for an in-person interview. It was a relaxed setting and the interviewers were very friendly. Very easy, personal questions.", "Interview Questions": "Tell me about your experience at ______."}], [{"date": "23 Aug 2021", "title": "Contracts Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Augusta University (Augusta, GA) in Jul 2021", "Interview Descriptions": "Informal conversation to discuss role and describe environment. Interviewer was someone in HR department. Friendly conversation. Ultimately did not get job based on required education. As an educational institute they prioritize degree over experience.", "Interview Questions": "Tell us about yourself as a professional"}, {"date": "27 Jun 2021", "title": "End User Device Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Augusta University", "Interview Descriptions": "Applied on a Wednesday\nHad a phone interview on a Thursday\nand was offered the job on Friday\n\nHad a urine screening the following week\n\nthey asked technical and situational questions that you will usually hear", "Interview Questions": "How will you be an asset to the team?\n\nWhen was a time you had to deal with an upset user?\n\n"}, {"date": "19 Feb 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Augusta University", "Interview Descriptions": "Sat down with nurse manager and discussed job duties and basic requirements and experience. Overall easy going and simple interview. Paperwork requirement is comparable to other jobs of similar types", "Interview Questions": "What is the highest level of education obtained?"}, {"date": "19 Jan 2021", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Augusta University", "Interview Descriptions": "Overall, interview went well. The interviewer was open to questions from me and seemed to answer honestly. I felt like we had good conversation about job duties and career expectations. Overall good experience.", "Interview Questions": "What are your career goals?"}, {"date": "11 Sept 2020", "title": "CyberSecurity Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Augusta University", "Interview Descriptions": "3 rounds of interviews in the same day. Started with the AVPs, then the engineer team lead and director, then finally the CIO. due to covid, everything was done virtually", "Interview Questions": "They asked about prior security experience in the the enterprise environment. (Patch management,  vulnerability management, MDM policy)"}, {"date": "20 Sept 2020", "title": "Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Augusta University (Augusta, GA) in Aug 2020", "Interview Descriptions": "I applied through an referral.  The process took about a month.  The Lead email me about doing an application for the position. I filled an application online, the status came back \"Considering\".  About 2 weeks, I got an call from the Lead about an interview for Wednesday @1pm.  I went to the interview. The interview considered of three people (1-Manager and 2-Leads). The interview went very well.", "Interview Questions": "What will be the biggest challenged in this position from the current position I am in now?"}, {"date": "7 May 2023", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Augusta University (Augusta, GA) in Jun 2019", "Interview Descriptions": "Interviewed with multiple faculty members, one-on-one. All-day process followed by dinner. Members had different levels of preparedness. All were welcoming and collegial. Each interview was about one hour in length.", "Interview Questions": "1.Why select this area? 2.Goals here? 3.Why leaving other position?"}, {"date": "12 Feb 2020", "title": "Digital Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Augusta University (Augusta, GA) in Apr 2019", "Interview Descriptions": "The process was very personable. I was interviewed by the CIO as well as his admin for my first round. I was then brought in to interview with the Division of Communications and Marketing. Both were not intimidating and felt east going.", "Interview Questions": "If i asked you to write a digital strategy for our division how whould you start?"}, {"date": "15 Oct 2019", "title": "Residency Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Augusta University (Augusta, GA) in Aug 2018", "Interview Descriptions": "You will interview with multiple levels within the department to include the program director. Depending on the size of the department you may interview with the chief residents as well.", "Interview Questions": "Do you have experience in this field"}, {"date": "21 Aug 2018", "title": "Nurse Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Augusta University (Augusta, GA) in May 2018", "Interview Descriptions": "It was rigorous, but necessary; great experience! The process was in three stages, each round was progressively difficult and ended with a presentation. Best part; I got to meet many of the people I would be working with. I enjoyed the process. It taught me that I was truly ready for the job!", "Interview Questions": "Hardest thing I ever had to do in my career "}], [{"date": "18 Aug 2020", "title": "Digital Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Augusta University in Mar 2018", "Interview Descriptions": "Very brief and simple interview process. It was a panel interview with 3 different people that after I accepted the job I didn't even work with. All three were super nice though and made me feel comfortable and relaxed.", "Interview Questions": "How do you handle stress? "}, {"date": "27 May 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Augusta University (Augusta, GA) in Feb 2018", "Interview Descriptions": "I was offered the job, no interview. I then had to complete the process through the HR department, which was time consuming process and tedious. I had to complete a background check as well.", "Interview Questions": "N/A"}, {"date": "7 Nov 2017", "title": "Bed Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Augusta University (Augusta, GA) in Oct 2017", "Interview Descriptions": "Apply for Bed Management Rep position in September.  Received a call from the Bed Management Lead person within one week (October) to schedule an interview for October 12.  Interviewed with the Bed Management Supervisor and Lead person.  The interview consist of 10 questions.  The Bed Management Supervisor was very please with my experience.", "Interview Questions": "How do you deal with conflict between co-workers?"}, {"date": "5 Aug 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Augusta University (Augusta, GA) in Aug 2017", "Interview Descriptions": "Management calls you I recieved my call  at 7 pm on a Saturday night from a number I didn't recognize and they left a message and I called back immediately they also have he send you an email", "Interview Questions": "My availability and credentials for the position "}, {"date": "4 May 2017", "title": "Office Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Augusta University (Augusta, GA) in Mar 2017", "Interview Descriptions": "I applied online and then I was contacted by someone in the department about coming in for an interview.  The interview was supposed to be with two individuals from the department but it ended up being with only one.  The interview lasted about 30-40 minutes.  I was contacted about a week later to come in for another interview.  However, I declined due to the maximum hourly rate that they were willing to offer.", "Interview Questions": "How do I feel about change?"}, {"date": "12 Sept 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Augusta University in Dec 2016", "Interview Descriptions": "Short sweet and to the point. It was a very good experience to see how kind and facilitating the interviewer was. Interviewer was very direct, and asked simple questions alluding to character and ability to do the job properly.", "Interview Questions": "How do you handle difficulty?"}, {"date": "30 Nov 2017", "title": "CSR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Augusta University (Augusta, GA) in Sept 2016", "Interview Descriptions": "Standard interview process.  During the on boarding process I completed the basic paperwork, photo id, background check, and obtain a parking permit.  Orientation for my department was 1.5 day.", "Interview Questions": "Are you flexible to work rotating shifts?"}, {"date": "16 Jul 2016", "title": "Library Assistant, Summerville Campus Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Augusta University (Augusta, GA) in Jun 2016", "Interview Descriptions": "I applied online via AU's job board. I received a call from the library, but oddly enough the caller left no message. I should have left it at that, but being the self-starter I am--I email the name attached to the number about the position & discover that was actually the main librarian in charge of the particular department I applied for. He responded & promptly set up an interview within the same week. The interview ended up being a panel consisting of the main librarian & two potential co-workers. The interview itself seemed easygoing & the questions were not difficult, but there were times when the main librarian seemed to \"mumble\" questions & I may have misunderstood what he asked. Not sure if that was just the way he talked, or he was genuinely disinterested in hiring me. The interview ended in less than half an hour, or maybe just at / around 30 minutes.\r\n\r\nEDIT : Turned out he was genuinely disinterested in hiring me. Why even set up the interview? Not only that, but this guy ignored a follow-up email I sent to inquire about the position. I'm beyond annoyed, but very glad I didn't receive the job. I left this library for a reason the first time, & I'm remembering very clearly why I did.", "Interview Questions": "What is your experience with handling money?"}, {"date": "20 May 2018", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Augusta University (Augusta, GA) in Jun 2016", "Interview Descriptions": "Came for first visit - very informative met many stakeholders inside and outside my department.  Invited to dinner with chairman and several coworkers.\r\nSecond visit came  with spouse -  had community tours.  Very positive process.\r\nTook a bit long to receive final contract.\r\nVery helpful HR department for on-boarding", "Interview Questions": "What skills will you bring.  "}, {"date": "27 May 2016", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Augusta University", "Interview Descriptions": "The interview was about a hour long. I interview with the Department manager (my boss) and the Chair of the department. He asked basic questions...nothing hard. If you worked in a medical or dental setting before, then the questions should be easy to answer.", "Interview Questions": "Do you have experience with scheduling?"}], [{"date": "9 Jul 2016", "title": "Desk Operation Specialist (Emergency) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Augusta University in May 2016", "Interview Descriptions": "I had an interview with one staff member (Supervisor). The interview was good, she ask the basic questions. The supervisor was very friendly and explain to me about the job .", "Interview Questions": "Can you explain to patients about their insurance?"}, {"date": "30 Jun 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Augusta University (Augusta, GA) in Jan 2016", "Interview Descriptions": "Called to interview over the phone at first. That went well so was scheduled to speak with asst manager and charge nurse. I went in for an interview with 2 of management. Process was not difficult. The interview was an average interview", "Interview Questions": "Tell me about yourself , How do you handle stress , What type of experience do you have , Why do you want to work here, What helps you stand out among your peers"}, {"date": "30 Dec 2019", "title": "Occupational Health and Safety Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Augusta University (Augusta, GA) in Dec 2015", "Interview Descriptions": "The interview process is pretty good. It was 6 different interviews in 1 day! Some were with management and some were with people in the same position I was applying for. The interviews with other OHSTs were very comforting and enjoyable. They gave all of the inside scoop on the job. All in all, it was a great process.", "Interview Questions": "Are you a team player?\r\nHow would you handle a difficult situation?"}, {"date": "31 Dec 2015", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Augusta University (Augusta, GA) in Dec 2015", "Interview Descriptions": "I applied on the GRU website for Unit Clerk position. One week later I received an call from the hiring manager to schedule an interview for the 8 West Perioperative department. Had an interview with 4 panel/group. About 2 weeks I received an email from the HR recruiter. The recruiter sent me reference form to have 3 past supervisor to fill out.", "Interview Questions": "What does customer service mean to you?"}, {"date": "10 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Augusta University", "Interview Descriptions": "Initially had a phone interview with the Laboratory Manager and eventually had a phone interview with the Primary Investigator. The initial conversation was learning more about the research being done in the laboratory. The final interview was a cursory question and answer session looking to see what knowledge of the subject matter I had.", "Interview Questions": "Are you familiar with pulmonary hypertension?"}, {"date": "29 May 2015", "title": "Administrative Assistant, Department of OB/GYN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Augusta University (Augusta, GA) in May 2015", "Interview Descriptions": "Poorly organized and interviewed by low level staff, not the department manager as I was told I would see. I met with two people, one of which read questions verbatim from a script, and the other person barely added anything else. I felt like I provided very good answers, answers that have impressed other departments, and in this instance my words simply fell flat. I didn't get a good vibe from them at the start, and felt like they were sizing me up instead of asking me probing questions to ascertain my skill set. Plus, neither one gave a good hand shake, or held my gaze when I looked at them in the eyes.", "Interview Questions": "If I was to pick up the Sunday newspaper and read the headline about myself,what would it say? "}, {"date": "4 Aug 2018", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Augusta University (Augusta, GA) in Feb 2015", "Interview Descriptions": "Phone interview after one week with hiring manager. Then on site interview with department people in a month, had lunch and dinner with different groups. On site lasted all day, very tight schedule", "Interview Questions": "Why are you interested in this job, why do you want to come here"}, {"date": "8 Jan 2015", "title": "Facilities Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Augusta University", "Interview Descriptions": "The hiring process took sometime Because of the nature of the job. I had to interview with a panel. I also had three additional interviews with customers on campus that are serviced by the department. I feel that the hiring process was very fair..", "Interview Questions": "All of the question were very fair."}, {"date": "23 Oct 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Augusta University", "Interview Descriptions": "Just like most of postdoc hiring processes. I directly contacted the PI and we schedule a lab visiting and presentation. And I went to the site. The Postdocs of the lab showed me around, answered my questions such as the niceness of the PI and the publications of the lab. Then I gave a presentation of my work to the lab and institute. And then had one-to-one talks with PI and several of the professionals of the institute.", "Interview Questions": "For postdoc job there is no unexpected questions. You just show what you did before and what knowledge and techniques you have so far. Since we are all very professional and the community is very small. We already knew each others' work before. "}, {"date": "4 Oct 2014", "title": "Admissions-Upper Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Augusta University", "Interview Descriptions": "Met with 3 employees...not too difficult but waiting for an interview for 6 months.  Almost forgot I applied.  Three different views of what was expected from Admissions position.  Not true idea of what was expected.", "Interview Questions": "N/A"}], [{"date": "4 Feb 2015", "title": "Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Augusta University (Augusta, GA) in Sept 2014", "Interview Descriptions": "After applying online, I got a call for an interview within a week. I interviewed twice, then was offered a position. I was hired from the outside. The university touts hiring from within, but during my interview I was told the internal candidates were terrible. I was introduced to the department Chair, and we just had a nice, normal conversation for 5 minutes. I am overqualified for the job by leaps and bounds, and I look forward to posting when I am eligible.The position is a basic, get-your-foot-in-the-door office job. The people I work with are nice.", "Interview Questions": "Simple questions, background info, previous experience, etc."}, {"date": "13 Aug 2014", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Augusta University in Jul 2014", "Interview Descriptions": "Filling out the web application was easy enough as with most applications, received a cal right away for an interview two days later.  Felt pretty comfortable with the interview which included two individuals.  Straight forward, felt I did well.  Then a test came at the end of the interview which included information specific to the college which of course I'm not privy to which didn't seem right as they told me the results would be part of my packet.  At the end of my interview I was told if I was a final candidate, Human Resources would contact me.  HR did, a week later, for further testing which lasted over two hours.  Typing, proof reading, basic excel and data input.  Two days later I was called for a second interview with just the manager this time.  Again, no hard ball questions, in her office instead of a conference room.  She told me I was one of the three final candidates that she had to make a decision.  She showed me the database that was used, asked me if I had any questions and gave me a tour, literally introducing me to every employee on the team and telling me what they did and cross trained in so I was aware as I would cross train as well.  I truly felt I had the job.  That was over a month ago, I haven't heard a word.  I contacted HR, who claimed they didn't know.  I contacted the hiring manager who said I would here from HR.  I saw the name of who was hired on HR's homepage.  Not a good way to do business.  I wonder if the other two candidates received the same treatment??", "Interview Questions": "No difficult questions other than the test asking questions about the company that had not been trained yet."}, {"date": "1 Nov 2014", "title": "Staff R N Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Augusta University in May 2014", "Interview Descriptions": "phone interview with the CEO,Nursing director, and Nurse manager. Discussed my medical background and answered senerio questions. Discussed salary, opportunities to move up into another position, type of patients and accomodations for the patients.", "Interview Questions": "N/A"}, {"date": "20 Nov 2014", "title": "Residency Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Augusta University in Mar 2014", "Interview Descriptions": "Initial contact was via website.  After about 4 weeks, I was contacted by phone for a short interview.  I was asked about my resume and asked some behavioral questions.  After the telephone interview I was scheduled for an onsite interview.  I interviewed with two physicians and the practice manager. The people I met with were very professional and seemed to enjoy what they did.", "Interview Questions": "I was asked about an action or decision that I regretted."}, {"date": "9 Dec 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Augusta University", "Interview Descriptions": "No hiring or interview process for my department.  I believe some other departments give tours and interviews.", "Interview Questions": "There were no interview questions."}, {"date": "30 Oct 2013", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Augusta University (Augusta, GA)", "Interview Descriptions": "The interview process did not explain fully the demands of the job, which was a very stressful, abusive position. I was also not told about the many times I would be asked to work over at he last minute.", "Interview Questions": "The questions were standard, they were just not in depth, did not explain the demands of the job. I should have looked at the haggard faces of the employees that worked there."}, {"date": "3 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Augusta University (Augusta, GA) in May 2013", "Interview Descriptions": "Applied online and got an interview request the next week. I arrived at the PI's office the next morning on time and had to wait nearly an hour for the PI. Interview was conducted by another research assistant (I did not know her job title at the time) while the PI checked emails. Standard interview questions. Received a job offer the next week.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Sept 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Augusta University in Jan 2013", "Interview Descriptions": "I applied online and got a call to interview in person. I got there, we chatted about my experience, about my future plan, and then got some information on the current position. After a few days, I was told that I got the position.", "Interview Questions": "any lab experience"}, {"date": "21 Aug 2015", "title": "IDX Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Augusta University (Augusta, GA) in Oct 2012", "Interview Descriptions": "I did very well on the phone interview, which earned me a second, in-person interview. I came prepared, but it was not a warm, welcoming environment. There was an interview team of 5 people, who asked various questions to determine how much I knew about the overall IT Department. I told them upfront that I didn't know everything about their department, but I am a quick learner, AND that I know the program IDX inside-out (which was sole duty of position). I sent thank-you emails hours after the interview, but I never heard back from them. I waited a week and called HR for a status update, which they didn't have. I probably called HR 4 times total, in about 6 or 7 weeks to check the status, and then I gave up. Probably 7 MONTHS later, I received a generic \"pursuing other candidates\" email. I was/am a current employee, they could have treated me a lot better than they did.", "Interview Questions": "What do you know about IDX?\r\nDo you work with medical staff often?"}, {"date": "27 Jul 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Augusta University (Pelham, GA) in Jun 2012", "Interview Descriptions": "there is a board that interview you then you have to have a drug screen, back ground check and lie detector test and if  you past all those then you get hired if you have the skills they are looking for", "Interview Questions": "How do you feel about working around inmates?"}], [{"date": "26 Oct 2015", "title": "Office Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Augusta University in Nov 2011", "Interview Descriptions": "Basic interview process. I had two interviews one with the manager of the department and the other with my actual supervisor.  There questions were not out of the norm. The basic tell us about yourself and where do you see yourself in a few years. It's a really slow process from the time of my application and my actual interview and hiring. I had actually  forgot applying for the job by the time I received a call. You negotiate your salary with human resources.", "Interview Questions": "Do you take things personally? "}, {"date": "4 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Augusta University (Augusta, GA) in Mar 2011", "Interview Descriptions": "I interviewed in 2010. I was given lovely accommodations in the nicest hotel in downtown Augusta for 2 nights, as well as all meals and transportation comped. The interview process was really only an hour and a half in the later part of the morning, where a current student escorted me to three different interviews around campus that were a half hour each. Some candidates were accepted prior to attending the Interview day. The rest of the day was introduction to the program, touring labs, and asking researchers questions.", "Interview Questions": "How do you think psychology research will help you in a medical research lab?"}, {"date": "14 Dec 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Augusta University (Augusta, GA) in Feb 2010", "Interview Descriptions": "Online application. One on-site interview. Very warm reception. Faculty and staff are helpful and insightful.", "Interview Questions": "N/A"}]]