[[{"date": "28 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hawaii Pacific Health (Honolulu District)", "Interview Descriptions": "The interview process entailed one virtual interview, the application is pretty straightforward online. I then received an email to sign up for an interview time—one on one interview that lasted 45 minutes.", "Interview Questions": "Tell me a situation where you showed leadership"}, {"date": "6 Oct 2022", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Phone interview, to in-person interview. Once you pass the in-person interview, depending on how fast they need a CMA in the department, they will get back to you in about 1 month.", "Interview Questions": "How would you be able to benefit in this department?"}, {"date": "30 Sept 2022", "title": "RN Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hawaii Pacific Health", "Interview Descriptions": "For these interviews, you really need to know yourself, strengths and skills. Interviews can be with one person only or it can include multiple people for a group interview, good luck! ", "Interview Questions": "What are your strengths that would help in this position?"}, {"date": "28 Dec 2021", "title": "RN Interview Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Process took almost 2 months. I first took an RN Pharmacology Test and Skills/Cognitive Test with a passing score above 80%. \r\n\r\nI was then offered to set up an interview through Zoom due to the pandemic. Questions were related to experiences, and were a little above average. I was hoping it wouldn’t be as challenging due to it being a new grad RN opportunity.", "Interview Questions": "Tell me a time you did not agree with a peer. What happened and how did you handle it? "}, {"date": "4 Nov 2021", "title": "Health Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Three round application process:\n1) Send in Resume, and Essay Question\n 2) Video submission to answer question (only 2-3 trials to answer question\n 3) Live online video Interview\n- very time consuming, must be prepared, have instances of experience to explain", "Interview Questions": "State a prior challenging experience you had and how to overcome it"}, {"date": "11 Dec 2021", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Nov 2021", "Interview Descriptions": "Interview Process during the pandemic was through a video platform.  I applied on the HPH’s career website, received a call from HR 1-2 weeks to verify my previous work experiences, education, CNA license, BLS certification, salary expectation, and estimated start date.  1 week later, received a call from the unit manager to schedule a video call interview, which lasted 30 mins during the interview.  \r\nReceived an offer 1 week after the interview, did a CNA skills assessment 30 questions test with a passing grade of 80%. Background check for 2 weeks and then health assessment. One month before the start of employment.", "Interview Questions": "Why would you like to work for this hospital? \r\n\r\nWhat are your weakness and how would you improve it? \r\n\r\nTell me a time when a patient/customer was upset and how did you handle it? \r\n\r\nGive an example of a mistake you did at work and how did you fix it? \r\n\r\nGive an example when your supervisor didn’t approve your work ethics? "}, {"date": "26 Aug 2021", "title": "ER RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Jul 2021", "Interview Descriptions": "Very easy interview process! The interview was conducted with two emergency room managers who were both very approachable and friendly. The questions were based on patient experiences and what you beleive you bring to the table as a nurse.", "Interview Questions": "What is your view of teamwork in the ER?"}, {"date": "12 May 2021", "title": "Patient Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hawaii Pacific Health", "Interview Descriptions": "I was interviewed with a management and peer review team and it was a little intimidating at first.  Everyone was very nice and made me feel comfortable.  Interview consisted of behavioral questions and also skill based", "Interview Questions": "How do you handle a difficult coworker"}, {"date": "12 Apr 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI)", "Interview Descriptions": "Before COVID, relatively easy. I meet with the manager of the department and two supervisors. After meeting with them, I met with another worker in the department who became my partner.", "Interview Questions": "Why do you want to work in our department?"}, {"date": "28 Apr 2021", "title": "Contact Center Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Mar 2021", "Interview Descriptions": "If you got an interview then congratulations! You've just gotten through the toughest HR because they pick and choose not by talent and skill but by who they think they like. An HR coordinator is the one in-charge of hiring for this position. Something I wasn't used to as I've never gone through a company where a coordinator has that much power. HR gives vague answer if you ask them questions so I ended up rephrasing a question in 3 ways just to try to get an answer, but I still failed. They don't know much about the position they are hiring for.", "Interview Questions": "Why do you want to work here?"}], [{"date": "8 May 2021", "title": "Summer Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in May 2020", "Interview Descriptions": "The process was smooth; my interviewer made sure that I was comfortable and valued my responses. Interview was held online due to Pandemic circumstances, but before that, interviews were held in person.", "Interview Questions": "Tell me about a time when you went above and beyond for a customer"}, {"date": "6 Mar 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Hawaii Pacific Health (Honolulu, HI)", "Interview Descriptions": "Applied online. Received call regarding my qualifications, and confirmed an online video interview once they decided my qualifications were reasonable. Online video interview was with HR only and was mainly “would this schedule work for you” and “when can you start” and “how much would you like to make”.  When I mentioned wanting higher base pay than I get currently on the mainland, the HR rep seemed peeved that I mentioned cost of living being higher and told me I didn’t do my research. I have been researching for weeks in general and for this job for days. Any other questions I had would have to directed at a nursing manager and not the HR rep on the call.", "Interview Questions": "Are you okay with rotating shifts?"}, {"date": "17 Feb 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Applied online. Did a video interview, then 2 logic/cognitive tests, a pharmacology test, and then in-person interview. In person interview lasted about 1hr mixture of behavioral and scenario questions.", "Interview Questions": "Tell me about yourself, why nursing?"}, {"date": "28 Dec 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Nov 2019", "Interview Descriptions": "The process was personable and easy going.  Preparation is particular towards the job you are applying for, there is not much of a 1:1 behavioral analysis type of interview.  Management within the department have great experience and would make great mentors.  Personnel are continuously working and engaged while lacking a common uptightness in such an environment, refreshing.", "Interview Questions": "What do you like most about the job?"}, {"date": "31 Aug 2019", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Aug 2019", "Interview Descriptions": "I had five separate interviews for a Marketing Manager position (counting the first screening interview by HR) over a three-month period. I liked the 10 different individuals I met over the course of all the interviews and was interested and inspired by this position. However, the final interview and way in which I was told I didn't get the position (it was down to me and one other) were incredibly unprofessional.\r\n\r\nAt the third interview, there were six people in the room, one on the phone, which was overwhelming. I enjoyed the conversations with everyone during the process, during the final interview I was told it was down to me and one other, that clearly I was qualified for the role, but they needed to ensure they chose the right person. Because of that, the final interview had a very different feel, as if they were nit-picking and laser-focused on what they felt were my negatives. \r\n\r\nFor example, I was told I wouldn’t be able to do “graphic design” work in this role, and how would I feel about that. In the first interview, we’d talked about how this role wasn’t about work like that, I knew that and I didn’t expect to be doing any graphic design work, that was already discussed. So I had to explain that I never expected I would be doing graphic design work in this role. The final interview felt like I was constantly defending myself, and defending things I’d said in interviews 1-4. I hope this isn’t the case, but it felt like they’d already chosen the other candidate and wanted the final interview with me simply to confirm that choice by inventing and digging for negatives. \r\n\r\nAfter the final interview, I was told I’d hear from them by the end of that week. After two weeks, I got an auto-generated generic email from HR “no-reply” address saying I didn’t get the job, there were many qualified candidates, please try again. That’s not the way you inform a candidate who’s been through a three-month process, had five interviews with you and was down to your final two. Really bad form, especially for a health care company whose mission to about caring for people's wellbeing.", "Interview Questions": "Tell us about your prior marketing experience."}, {"date": "25 Nov 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Apr 2019", "Interview Descriptions": "Very professional and pleasant.  Was interviewed by panel of doctors  and business manager. They started off by telling me about the job. Then, asked me \"tell me about yourself.\"  You have to sell yourself.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 Apr 2019", "title": "Clinical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health in Mar 2019", "Interview Descriptions": "The interview process was long. They called me for an interview a week after I submitted my application. They called me for another test after 3 weeks. I didn’t meet the range requirement for the position. They wanted me to check back with them later on.", "Interview Questions": "What is your long term goal at Hawaii Pacific Health?"}, {"date": "11 Feb 2019", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "I applied to several online postings and only received one call back from the HR rep. She seemed very busy and didn't give me the time of day. Even though she called me, I had to explain what job I applied for, the Job posting number etc... She then said she would talk to the manager about me and see if I was a good fit and she said she'd \"call me right back.\" I finally gave up waiting after unanswered emails and no call back from her. Very disappointing with how  they treat their applicants, they make you feel replaceable and unworthy.", "Interview Questions": "What type of patient diagnosis did you have on your last unit?"}, {"date": "19 Jan 2022", "title": "Front Desk/Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Jan 2019", "Interview Descriptions": "It was pleasant, and professional. Definitely quick because it was during a hiring event. They expressed the desire for flexibility and questioned transportation and the requirement to float to other offices.", "Interview Questions": "Basic questions but they were aware that I had just graduated. They also expressed the requirement to float to other satellite offices."}, {"date": "28 Aug 2019", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hawaii Pacific Health in Dec 2018", "Interview Descriptions": "The application goes through HR > Hiring Manager > Supervisor. Interview is about 15-30 min long. They ask mostly behavioral type questions. Nothing specifically regarding the specialty you are entering. HR will call if job is offered.", "Interview Questions": "Describe a time you went above and beyond for a patient."}], [{"date": "20 Apr 2018", "title": "Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Apr 2018", "Interview Descriptions": "I was interviewed by the director and supervisor in that department.  I was very nervous at first but they both were so nice and so down to earth.  I felt very confortable answering all their questions.  They were very informative of the job description and even mentioned and re assured me that they will help me.", "Interview Questions": "The reason I was quitting my previous Employer"}, {"date": "27 Aug 2017", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "In-person interview after applying online. Called back a few days later to offer the job. Rather long but very comprehensive onboarding process.  Here's a note: timeliness is VERY important to HR throughout the entire healthcare system. Be early, NOT on time for every shift, every interview, & every meeting with HR. This is extremely important.", "Interview Questions": "How do you handle workplace conflict?"}, {"date": "24 Jul 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI)", "Interview Descriptions": "Received call from department manager.  Had an in-Person interview with manager onsite.  Asked to come back and review with other department managers.  Several weeks later I received a formal offer.  It took approximately three weeks then for HR to complete background checks, drug testing, etc.", "Interview Questions": "Do I feel that fairness to employees is important?"}, {"date": "22 Jul 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Jul 2017", "Interview Descriptions": "Applied online and I called the HR to inquire about a job and they directed me to a person who I got a little interview. took the skills test and passed it. They interviewed me about the job and said a hiring manager will contact me.", "Interview Questions": "How did you hear about us?"}, {"date": "25 Jun 2017", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health (Honolulu, HI) in May 2017", "Interview Descriptions": "First was a telephone interview. Then you'll get invited to come in in person. 2 weeks later drug testing and PE. If you pass? Then wait for the invite to come in to join the group orientation.", "Interview Questions": "What would you do when there's another employee that act inappropriately to your department?"}, {"date": "6 Aug 2018", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI) in May 2017", "Interview Descriptions": "Formal interview. You need to prepare for the interview. The interview questions are not easy, There is a list of questions from a sheet the unit manager will ask you. The manager will write down your answers as you answer.", "Interview Questions": "Why do you want to work at HPH"}, {"date": "26 Feb 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hawaii Pacific Health in Apr 2017", "Interview Descriptions": "I applied online. The first was a video recorded interview where you answer a couple questions, mainly about leadership experience (you have unlimited number of retakes). A few weeks later, they scheduled a video call interview with HR. This one was more behavioral.", "Interview Questions": "Tell me about one time you went above and beyond when dealing with a customer."}, {"date": "6 Nov 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hawaii Pacific Health in Mar 2017", "Interview Descriptions": "Automated Interview - Not the hardest, standard questions. Requires you to submit a video of yourself. \r\nOnline Interview - Interview over Skype, HR was very nice and was more about behavioral questions.", "Interview Questions": "Talk about yourself"}, {"date": "15 May 2017", "title": "Critical Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health in Mar 2017", "Interview Descriptions": "The interview was not stressful and  it was done in a quiet area. The interviewer was not intimidating but rather down to earth when asking the questions. Due to my school and work schedule, I did not get an offer.", "Interview Questions": "The interviewer asked two questions about getting to know you and asked for healthcare examples of challenges you encountered. "}, {"date": "1 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Here is the process: apply online, Interview w HR Recruiter, take a pharmacology test, take a logic-type test, interview w panel of unit managers, then wait for the offer", "Interview Questions": "How do you keep up with your education? What is the last book or journal you read/tell me about it. "}], [{"date": "16 Dec 2016", "title": "Supply Chain Management Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Very relaxed, semi-structured interview.  Two interviews conducted with multiple interviewers present on one occasion.  We introduced ourselves then moved on to company and position information.  Subsequent follow-on questions followed.", "Interview Questions": "What are some strengths about yourself?"}, {"date": "12 Jul 2016", "title": "Clerical Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Jul 2016", "Interview Descriptions": "Called for a quick phone screen, then called later to set up an interview time. They were flexible and willing to meet at a time best for me. Interview was pretty standard. I would suggest looking for key words in the job posting because they ask about those pretty often. As well as your skill set that makes you a good fit for this position. After the interviewer walked me around there facility.", "Interview Questions": "What do you know about this company, and what do you know about this positioin.\r\n\r\nWhy would you be a good fit here."}, {"date": "3 Sept 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Apr 2016", "Interview Descriptions": "It's a one on one interview process. They call your name and you are taken to their office where interview is conducted. Once your in the office they begin asking you several questions. After they finish their interview they ask if you have any questions for them. I asked my interviewer how she came to her position.", "Interview Questions": "Tell me about Hawaii Pacific"}, {"date": "8 Apr 2017", "title": "Critical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Mar 2016", "Interview Descriptions": "First I got called for a skills test! Which included basic EKG interpretation and a nurse aide skills test which both were quite frankly pretty simple.(I'm a paramedic). After that I spoke with a HR representative and was contacted a few weeks later by the hospital managers. Which I came in for the interview a few weeks after that. After my interview I waited two more weeks to have HR call me back and I got a confirmation job offer. Then, a orientation that took all day and the rest of the week was at the hospital.", "Interview Questions": "What was one thing that you have done for your patient that put you above and beyond your job responsibility?"}, {"date": "24 Jul 2015", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Behavioral questions for the most part. Had to go through the HR weeding out process (meeting minimum requirements with education and experience), then hiring manager contacted me for two interviews. Pretty standard stuff. Got an offer a few weeks later.", "Interview Questions": "Behavioral questions."}, {"date": "1 Feb 2016", "title": "Health Careers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hawaii Pacific Health (Honolulu, HI) in May 2015", "Interview Descriptions": "I submitted an application in April. I got called for an interview night in May with ~70 other students. We were showed a video about Hawaii Pacific Health, then we interviewed one-by-one with various HR employees. Interview was short (20-30) minutes. I heard back from them at the end of May.", "Interview Questions": "Tell us about a time you made a difficult decision."}, {"date": "10 Dec 2014", "title": "Administrative Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hawaii Pacific Health in Nov 2014", "Interview Descriptions": "Called in for a skills test that covered MS Outlook, Word and Excel. Once completed, had a brief Q&A with HR. Was told that they are considering an internal candidate but still wanted to go ahead with meeting other potential candidates. As of today (3 weeks later) am still awaiting some kind of update (was told that the entire interview/hiring process can sometimes take months).", "Interview Questions": "Nothing difficult or unexpected about the questions asked. We talked about previous/current job duties as well as availability."}, {"date": "3 Sept 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 9 months. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "As a consultant, had many \"interviews\" at every level of the company in diverse departments.  Met with prospective colleagues in department up to senior executives.  Felt very comfortable at every level.  People very friendly and sincere.  Good fit for me and company.", "Interview Questions": "Would I work as a full time employee and not a consultant."}, {"date": "4 Jul 2015", "title": "Desktop Security Technical Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Apr 2014", "Interview Descriptions": "One interview with one person, the director of Information Technology.  Was advised of s second and third interview, as is customary anywhere. Was contacted within 2 hours of initial interview and immediately offered the job, providing I was able to begin work with one days notice.", "Interview Questions": "Why did I not want to pursue a degree (instead of industry certifications.)"}, {"date": "2 Nov 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hawaii Pacific Health", "Interview Descriptions": "Initial contact and progress went well.  Initially everything is done via computer. Interviews can be conducted via phone. Managers are approachable and Human Resources doesn't stop you from speaking to them prior to applying for job.  Human Resources dept not pleasant, respectful or welcoming. Many times they appear to be scolding a perspective or new employee.  They are the \"store front\" of Hawaii Pacific Health - their communication should command respect and not be reprimanding.", "Interview Questions": "The interview was standard.  Nothing out of the ordinary.  The manager was open to receiving and answering questions regarding the unit, hospital and healthcare system"}], [{"date": "18 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Jul 2013", "Interview Descriptions": "I had the managers number as well as nurse recruitment.  I had to place several calls to the manager and nurse recruiter to be able to get an interview scheduled.  I interviewed for the nursing position with the manager and two supervisors.  It was about 30 minute interview and focused mostly on behavior based questions.  I placed a few calls again to HR to determine if I would be offered the position and about a week after the interview, HR responded and I was offered the position.", "Interview Questions": "Describe a time when you had to work with a family that had a different culture background."}, {"date": "8 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Mar 2013", "Interview Descriptions": "They asked a lot of behavioral questions. None of the questions were too hard. They checked more so on your attitude in answering them. As a high school student that had yet to learn about prepping for the interview process, I thought it was just a questionnaire and I was still accepted. You'll be spending a lot of one or one time with a lot of the doctors so having a friendly and enjoyable personality is a big must.", "Interview Questions": "What classes do you enjoy the most?"}, {"date": "4 Oct 2012", "title": "Department Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hawaii Pacific Health (Honolulu, HI)", "Interview Descriptions": "It helps to know someone, use key words in order for their software system to pick your resume. Interview process is usually two to three levels. First meet HR then meet department heads and theN the person you will report to.", "Interview Questions": "Expect behaviour type questions. "}, {"date": "15 Mar 2013", "title": "Nurse Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Hawaii Pacific Health (Honolulu, HI) in Aug 2012", "Interview Descriptions": "The receptionist gave me a call asking me to go there for an interview with their HR. The day of the interview, I got there a bit too early so I was told to wait. The receptionist had me take some online skill test. After I took the test, he asked me to wait so that the HR can interview me. He then came back saying that the HR is in a conference and wouldn't be able to do the interview. So he ask me to call the HR tomorrow instead.\r\n\r\nI called the HR the next day but the HR wasn't picking up nor returning my calls. After a few days, the HR finally called me. She said to \"apply for a different position\" instead. She didn't told me directly that I wasn't qualified, she told me to re-apply again. \r\n\r\nWith an experience like that, I did not re-apply again.", "Interview Questions": "I didn't had the chance to meet with an HR because she was at a conference at the time they set the interview schedule."}, {"date": "6 Jun 2016", "title": "RN ICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Hawaii Pacific Health (Aiea, HI) in Jan 2012", "Interview Descriptions": "Went thru HR, easy. Had interview with nurse manager. All went well. I got notice right then that they would hire me. I was hired and went off to orientation plus 3 orientation shifts with a preceptor.", "Interview Questions": "Gave me some ICU scenarios and asked how I would treat."}, {"date": "10 May 2015", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Hawaii Pacific Health (Lihue, HI) in Apr 2011", "Interview Descriptions": "I had a interview with the CEO who quit the next day. Then met with the Physician and Office Manager. Then was told that the CEO would contacted. I was offered the position and the CEO called me to notify me. I was in computer training for 2 days and did a online test. Then sent to get my drug screen at a lab outside the hospital.", "Interview Questions": "Can I handle the responsibility ?"}]]