[[{"date": "22 Feb 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yuma Regional Medical Center", "Interview Descriptions": "The first round was a 15mins phone screening. Very standard with no difficulty. The second round was an hour behavirol interview asking about your previous experience. Questions like: Teamwork experience, Conflict resolution, Tell me about a quantitative project you have done.", "Interview Questions": "Questions like: Teamwork experience, Conflict resolution, Tell me about a quantitative project you have done."}, {"date": "20 May 2022", "title": "CHRO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Yuma Regional Medical Center", "Interview Descriptions": "Met with CEO and Exec Leadership group. Also met with some clinical leaders and members of the Dept,. Consistent use of behavioral based questionns. These were used by executives as well as HR professionals", "Interview Questions": "Tell us about a time where you had   to implement change"}, {"date": "10 Feb 2022", "title": "Inteviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yuma Regional Medical Center (Yuma, AZ) in Oct 2021", "Interview Descriptions": "Interview process has always been great. Super nice people and I don't ever wait too long to get seen. It felt like a was having a regular conversation instead of being interviewed.", "Interview Questions": "Q: What is the reason you would like to work for this company?\r\nQ: What skills are you able to offer us that will benefit the company?"}, {"date": "22 Feb 2021", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yuma Regional Medical Center", "Interview Descriptions": "Initial 30 minute phone interview. If you are selected past that they will fly you out with all accomodations. You will meet with the team and tour the hospital. Great, smooth process.", "Interview Questions": "Why do you want to work at Yuma Regional Medical Center?"}, {"date": "16 Nov 2018", "title": "Corporate Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Yuma Regional Medical Center (Yuma, AZ) in Nov 2018", "Interview Descriptions": "HR coordinator called within an hour of my application to set up a telephone interview.  After a brief phone interview with her, the next step was a Go-To meeting with the CHRO.  He was awesome and I was so excited!.  Followed by on site interviews with a few more than 10 people.  Very interesting interview questions and some pretty good rapport.  It seemed an offer was forthcoming.  Some concerns were the amount of time spent there -  the group seemed to be rightfully concerned with whether or not someone would really relocate, but the arrangements did not allow much free time to explore alone as, after a morning full of interviews, a lunch with potential colleagues and then a tour with a realtor, I was wiped out. I was also ill the whole time and pressing through to make a great impression, and with the time difference, it wasn't easy to muster the strength to explore the night before or the night after.  Also, was concerned that two HR positions within the reporting structure were vacant, although this should not have posed a problem to us as professionals.  About a week later, I was emailed by the CHRO that an offer was made to a Recruiting Manager and she would reach out for an additional interview.  She was very inflexible, called when I was at work, provided a very (one day) small interview window, began texting but then left days without responding when I texted her back.  Since I wanted to make sure the team knew I was still interested, I replied to the CHRO via email that we were working on getting something scheduled.  Within a short window of time, this new manager, who hasn't even started yet, texted me that they decided to move on with other candidates and thanked me for \"reaching out\".  As if all the hours invested were a mere reaching out.  Also, they checked my references before the offer phase  and before the interview phase was completed. Very inconsiderate.", "Interview Questions": "Discuss an accomplishment of which you are most proud."}, {"date": "10 Dec 2017", "title": "Histology Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yuma Regional Medical Center (Yuma, AZ) in Jul 2017", "Interview Descriptions": "Three people were seated at a table and it was not clear who they were or why they were in on the interview.  The guy who greeted me at the elevator gave me a look up and down. It was a very awkward feeling and they talked about me as if I wasn't there. Very unpleasant people and they didn't really listen very well to my answers.", "Interview Questions": "You are starting slides on the H&E staining process and as you come out of the third bath and into the 4th your solution turns milky. What is the problem and how is it fixed? "}, {"date": "29 Jun 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Yuma Regional Medical Center in May 2016", "Interview Descriptions": "Blunt and rude, had applied for many positions on the website (close to 30 over 4 months) before getting a call back. Recruiter asked if I had at least 5 years nursing experience, said yes 4 years LPN and 1 as RN. Told I didn't qualify for positions because LPN didn't count but couldn't get new grad position because I had 5 years when they would do pay scale matrix ?!?", "Interview Questions": "Do you have at least 5 years experience as a nurse? - For a new grad position applied for"}, {"date": "31 Jul 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yuma Regional Medical Center (Yuma, AZ) in Apr 2016", "Interview Descriptions": "I applied for the job online on the hospital's website and I got a call from HR within 2 days.  I applied to multiple positions  so the recruiter gave me the option to pick my top one to contact. The director of the floor I wanted to interview on called me a few hours. and I interviewed a couple days later.", "Interview Questions": "Tell us about a time when something unexpected happened to you and how did you handle it?"}, {"date": "21 Apr 2015", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Yuma Regional Medical Center (Yuma, AZ) in Jan 2011", "Interview Descriptions": "I met with a panel of management.  I met there qualifying requirements asked of me.   28 years of back grown in the field that I was applying for.", "Interview Questions": "What qualifying attributes can I offer?\r\nCan I work weekend's and holidays? \r\nCan I help teach new co-worker?\r\nIf ever need to can I work overtime?"}, {"date": "13 Jan 2011", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Yuma Regional Medical Center (Yuma, AZ) in Jan 2010", "Interview Descriptions": "YRMC was very proactive in calling and following-up in all aspects of the hiring processes. HR was very courteous and was very patient in the process. They provided clear instructions, expectations, and next steps. The interviews were straight forward and read from a standardized script. \r\n\r\nI would be careful to accept all the great positives with a grain of salt. I suggest asking your interviewer to honestly layout the negatives aspects of the job and organization.", "Interview Questions": "Do you know how hot it gets in Yuma? "}]]