[[{"date": "29 Jun 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Sacramento (California, MD)", "Interview Descriptions": "They asked a lot of technical questions and they wanted to know strengths and weaknesses. They also asked behavioral questions that were very scenario based. And asked for hobbies. It was all virtual", "Interview Questions": "They asked me why I wanted this job"}, {"date": "8 Apr 2023", "title": "Payroll Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CSU Sacramento (Sacramento, CA) in Mar 2023", "Interview Descriptions": "The interview process was great! I heard back within 2 months for an over the phone interview! The questions were pretty fair for an interview regarding the position… Overall, I would have to say that this stage of the hiring journey was thoroughly enjoyable and timely.", "Interview Questions": "What is your ideal working environment? Larger/busier or relatively small/quiet)"}, {"date": "30 Aug 2022", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at CSU Sacramento", "Interview Descriptions": "Held through Zoom with pandemic during first days at semester. Interviewed by one while other monitored. Lasted for about 30 minutes. It was relevant to know about your Federal Work Study position beforehand as well as major and plans to graduate.", "Interview Questions": "Describe your recent leadership experience. "}, {"date": "21 May 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at CSU Sacramento", "Interview Descriptions": "Average interview. No phone screen, straight to group zoom call. They did not respond with a rejection afterwards, but I didn't want the position anymore so I don't care if they ghosted", "Interview Questions": "(can't recall, they were mostly basic + scenario qs)"}, {"date": "28 Mar 2022", "title": "Student Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "The interview process takes a very long time. It took around two months from the application close date to my first interview, and then another 3 weeks for a second interview.", "Interview Questions": "Generic interview/scenario questions. Pulled straight from the job description."}, {"date": "17 Mar 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "My interviewer  (who I would be working directly with and under) and I reviewed responsibilities and discussed strategies and skills. I believed the process to be fair and upfront about what was expected and the pay to expect.", "Interview Questions": "What previous experience have you had that used the same skills."}, {"date": "14 Feb 2022", "title": "Front Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at CSU Sacramento in Nov 2021", "Interview Descriptions": "30 minute interview with building supervisor. It came in a very  laid back environment which made it easier to just have the interview. After they asked the questions I had time to ask questions on my own about the shift.", "Interview Questions": "Questions around timeliness, data security, and diversity. "}, {"date": "22 Oct 2021", "title": "Fiscal Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "First, it was the phone interview and then there would be an on-site written exam held within the university. The onsite written exam has 6 sections. Including excel function, etc", "Interview Questions": " there would be an on-site written exam hold within the university "}, {"date": "13 Sept 2021", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "The interview consisted of answering some prepared questions on my teaching experience and teaching preferences. It also included a mock mini lecture on a basic topic of my teaching subject.", "Interview Questions": "How would handle a student who is having trouble completing a writing assignment, because its subject is something really sensitive to the student?"}, {"date": "2 Jul 2021", "title": "Administrative Support Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CSU Sacramento", "Interview Descriptions": "Very straightforward behavioral interview questions and a test of excel skills and email etiquette. Wen’t through an HR interview followed by a panel interview with different teams.  The process took about over a month.", "Interview Questions": "How do you handle competing demands of workload. "}], [{"date": "1 Dec 2021", "title": "Group Fitness Instructor Zumba Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Apr 2021", "Interview Descriptions": "It wasn’t stated before the interview that they wanted verbal cueing (which is not typical for Zumba). They interviewed via zoom. They also said they wanted “inclusive” classes for people of all types of abilities, but when I let them know I was willing to get certified in a class that is accessible (IE wheelchair dance) they didn’t respond. They said they were going to put me on the sub list and wanted me to teach, but just stopped responding altogether.", "Interview Questions": "If I am ok with teaching hybrid classes and am vaccinated, I said yes to both. "}, {"date": "7 Apr 2023", "title": "Graduate Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CSU Sacramento (Sacramento, CA) in Apr 2021", "Interview Descriptions": "Met with three different supervisors in one Zoom meeting. They took turns asking questions and giving me student scenarios. They made me feel very comfortable and helpful when I was stuck on some answers. Overall, really supportive.", "Interview Questions": "What do you do if you don't know the answer to a question?"}, {"date": "12 Jan 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "Straight forward process.  Applied in person and got an interview date within few days. Had two interviews wih mostly behavioral question. Within the same week got job offer and started the next week.", "Interview Questions": "Behavioral questions were asked during the interview."}, {"date": "23 May 2020", "title": "IT Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "It was fun, people were really professional when asking questions with non-judgemental attitude.  You need a strong background with solid knowledge because questions are toughs. So make sure you allow yourself sometimes to review the criteria in the job description.", "Interview Questions": "Have you experienced with Higher Education IT?"}, {"date": "14 Feb 2020", "title": "Front Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CSU Sacramento (Sacramento, CA)", "Interview Descriptions": "Phone interview 15 minutes total. Interviewed by the Resident Life Coordinator for the building applied to and the Desk Manager. Primarily asked for your availability and your familiarity of campus resources", "Interview Questions": "Asked your availability and familiarity with campus resources "}, {"date": "7 Mar 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at CSU Sacramento (Sacramento, CA) in Jan 2019", "Interview Descriptions": "Call you to make appointment, they hand you interview questions before the interview, very easy, and you can get a call back the same day. They ask you about being a student and how it relates to work, depending on what you do.", "Interview Questions": "Q: What is your major and how will it help you in this position"}, {"date": "29 Jun 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CSU Sacramento", "Interview Descriptions": "Interview was easy, Got a call from HR one day after I applied. I went there and the interview was easy not so difficult. Got a call from HR that I am hired two days after interview.", "Interview Questions": "Nothing much just basic stuff"}, {"date": "26 Jun 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Sacramento", "Interview Descriptions": "Fair interview questions. Includes your basic questions such as why should we hire you? What are your strengths? What are your weaknesses? Describe a time when you had to overcome an objective?", "Interview Questions": "What are your strengths? "}, {"date": "20 Jan 2019", "title": "Instructional Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at CSU Sacramento (Sacramento, CA) in May 2018", "Interview Descriptions": "There was no interview. The Instructional Student Assistant position was open to highly achieved students. Basically, the department hired students with a very high GPA. However, I did get a call from a hiring manager to tell me that I am still in the process.", "Interview Questions": "N/A"}, {"date": "27 Sept 2021", "title": "Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CSU Sacramento (Sacramento, CA) in May 2018", "Interview Descriptions": "There is no technical question. They asked mostly about teaching methods and learning techniques. There are two routes of interview and several training sessions. The overall experience is good and student-friendly.", "Interview Questions": "How do you plan to teach?"}], [{"date": "3 Apr 2018", "title": "IT Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at CSU Sacramento (Sacramento, CA)", "Interview Descriptions": "The interview required a panel interview with a presentation. The interview was about an hour and a half long with 5-panel members.  It was a standard process where the panel members went round robin and asked a question each.", "Interview Questions": "What are some of the challenges you experienced when you were met with resistance? "}, {"date": "3 Nov 2022", "title": "PAL Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Apr 2018", "Interview Descriptions": "The PAL program focuses on your want to help other students. The ability to problem solve interpersonal conflicts is a must, as there may be times that students do not get along and come to you for help. the interview consists of a few \"what would you do\" questions where they give you a scenario and you have to answer. There may be a conflict between students, a failing student, a bad home-life, and you need to tactfully explain how you would handle the situation. Remember you are not a tutor, and that you instead are leading students to the answer using the PAL method. Be able to hold your position as a leader and peer to your students simultaneously, which is the hardest part, and you will do fine on these questions.", "Interview Questions": "Who are you and what are your goals? will PAL help these goals? Why do you want to join PAL program? Multiple \"what if\" scenarios"}, {"date": "18 Dec 2017", "title": "Sa Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Sacramento (Midtown Post Office, GA)", "Interview Descriptions": "Great place to work..awesome people and work environment. general questions, good team work questions, general questions about resume and your experience. the process was very simple, applied online and got a call from the manager. she took interview on basic questions.", "Interview Questions": "N/A"}, {"date": "6 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Oct 2017", "Interview Descriptions": "Great interview, I was interviewed by three people in a conference room. It was pretty straightforward, they had a list of questions that they asked me that ranged from behavioral too situational. They asked me about my experiences as well and would say the interview lasted just about an hour. From the time I also applied, I heard back about two weeks later about an interview which I had the following. I learned a lot about the school and enjoyed the interview.", "Interview Questions": "Have you had multiple assignments going on at one time and how did you handle it?"}, {"date": "15 Feb 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CSU Sacramento (Sacramento, CA) in Oct 2017", "Interview Descriptions": "Process was quick and easy. The interviewers were really nice, asked a lot of behavioral questions and also about my previous jobs. They described how the team works and asked me why I would fit into their team", "Interview Questions": "Use 3 words to describe yourself"}, {"date": "27 May 2021", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CSU Sacramento (San Francisco, CA) in May 2017", "Interview Descriptions": "The interview process was rather intense. I needed to be able to answer questions in regards to various concentrations outside of the two subjects of interest. To be fair, I was really only interested in two concentrations, but if I had looked and seen what they were hiring for that may have helped me be better prepared.", "Interview Questions": "How many hours a week in college did you spend as a TA?"}, {"date": "17 Mar 2018", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in Apr 2017", "Interview Descriptions": "CCE there were 3 interviewers in the panel for technical job. some are scenario based and technical. it was 30 min long interview and questions are mostly based on computers and projectors.", "Interview Questions": "how and from where do you start if the computer is not working"}, {"date": "13 Apr 2017", "title": "Analyst/Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Mar 2017", "Interview Descriptions": "I had a single 1 hour interview with four people around a conference table.  I felt like I was just attending a meeting. The interviewers were relaxed and simply went through a list of questions in a round table fashion.  They all had the same list.", "Interview Questions": "I was asked a number of questions  to describe experiences relating to working to timelines and the extent of my experience with Oracle and Peoplesoft, among others.  Because I did not have deep knowledge, I wasn't asked specific technical questions.  I should mention that in preparation for this interview, I purchased online training on Peoplesoft: SkillsVine \"Learning Peopletools\".  It was hugely helpful and the facilitators allowed me to get a copy of a virtual instance of Peoplesoft's Campus Solutions to play around with. Hence, I had a very good idea of the technologies used and could speak on a general level competently.  One last point, when I was offered the position, the pay was pretty low so I asked if I could negotiate a higher salary and found out I could. :-)  Don't be afraid to ask.  You might get what you ask for."}, {"date": "17 Mar 2017", "title": "Administrative Support Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Mar 2017", "Interview Descriptions": "Interviewed at the College of Continuing Education, very friendly and talkative, panel interview with 3 interviewers that worked in the college.  Process took about 1 1/2 hours.  I was told the select process could take up to 1 month before they decide on their candidate.", "Interview Questions": "What is your experience working with a budget, how do you define customer service (followed by give an example of when you gave great customer service and when you didn't give great customer service.), Describe how to manage a heavy program load while observing protocols."}, {"date": "21 Mar 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CSU Sacramento (Sacramento, CA) in Jan 2017", "Interview Descriptions": "Panel interview.  May differ depending on what department is hiring for the position.  There were 5 total people interviewing me in a room.  You're given the questions before being called in to practice your responses.  About 12-15 questions asking about experience in previous occupations, about what the job listing is looking for in terms of tasks/duties.  They take turns asking the questions in the same order on the paper.  They take notes as you answer.  Thats about it.  They are very nice and want you to be comfortable.\r\n\r\nOnly negative: they take a LONG time to move the process along.", "Interview Questions": "Experience using office equipment, computer programs, prioritizing tasks.  Situational questions such as \"what would you do if you knew you would not be able to finish an assignment on time?\"."}], [{"date": "8 Sept 2016", "title": "EOP Scholar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA)", "Interview Descriptions": "Sent in resume with cover letter, scheduled an interview that turnout to be in a group fashion. They would present one question and then allow everyone the interview group to provide their own answer for it. The order was not controlled so someone could answer the question first one time and go last the next. The whole thing was just short of an hour.", "Interview Questions": "The questions were focused on African Americans in the education systems such as \"How would you help African American students be successful during their time here?\""}, {"date": "18 May 2016", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Apr 2016", "Interview Descriptions": "I was approached via email around 2 weeks after I'd applied for the posting. I had a brief phone screening with a person in the same position as the one I'd be interviewing for. This person would be my liaison through the remaining part of the process. After the phone screening, my contact emailed me back within a week to ask for me to participate in a skype interview with other members of the development team (I was located in Sun Valley, Idaho at the time). I participated in the skye group interview and felt confident I would be asked to proceed to the next round. I was contacted shortly after, and sure enough, was asked to interview via skype with the hiring manager, and the supervisor for the position. I really wanted this position so I offered to travel down to Sacramento to participate in person. They made sure I knew they couldn't reimburse my expenses, but said they'd be thrilled to meet me in person.\r\n I came down for the interview, toured the campus a day prior to the meeting, and showed up on time for the interview. I interviewed with one woman, who was the VP of Development in the university advancement team. The interview lasted about 45 minutes and I thought I did well. She mentioned that she would have a decision by the end of the week (this was Monday), but that it may take HR a little longer to contact candidates. I returned home to Idaho.\r\nAfter the next few weeks, I followed up with my contact twice. Once he told me the decision process was still underway and asked me to verify i had submitted references. The second time he told me all the paperwork had been turned over to HR and that it was in their hands now.\r\n1 week later I followed up with the HR department and managed to contact the HR analyst who was working on the position. She told me it could be 1-2 more weeks before all candidates hear something.\r\n1 week later I received a very brief email explaining they had chosen another candidate. I thanked them for following up and asked if there was anyway I could receive some feedback on why I wasn't selected. I still have not received a response, and its been two weeks.", "Interview Questions": "Standard interview questions"}, {"date": "21 Mar 2016", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at CSU Sacramento (Sacramento, CA) in Jun 2015", "Interview Descriptions": "Process took 2 days, maybe I was lucky. I submitted my resume though career connection of Sac State and got a call to come in for interview on Monday. This is a student assistant jobs. My boss met me in front of the building and walked me through the lab. Questions are fairly easy", "Interview Questions": "Q: how to troubleshoot a hard drive?\r\nQ: Identify the IP address of the machine\r\nQ: Identify all the components in the Desktop"}, {"date": "7 Apr 2015", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at CSU Sacramento", "Interview Descriptions": "They are group interviews with a panel of directors from A&O. They will set you up with a group interview. You all sit in front of the directors. They give scenarios you put yourself in and what you would do or say. The group interview then answers one by one. They will call you to let you know if you received the job or not.", "Interview Questions": "If a family arrived late and were angry with getting lost and finding parking- how would you answer it?"}, {"date": "24 Mar 2015", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Mar 2015", "Interview Descriptions": "Two phone interviews. easy, pleasant and to the point. Asked simple questions and I gave simple but elaborate answers. Was contacted promptly with a second phone interview a week later and began training an additional week later.", "Interview Questions": "How Have you overcame workplace problems in the past?"}, {"date": "13 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in Feb 2015", "Interview Descriptions": "Usually 3 people in the interview panel, ask about 10 questions. Formal interview but they make it relaxed and really try to make you comfortable and get to know you.", "Interview Questions": "What qualifies you for the position"}, {"date": "30 Jan 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Sacramento", "Interview Descriptions": "They don't do much in terms of an interview. Be ready to answer some simple questions. They have a tough time finding people so it was really simple. That is about all there is to it. Good luck.", "Interview Questions": "None of the questions are hard"}, {"date": "8 Nov 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CSU Sacramento (Sacramento, CA) in Jan 2015", "Interview Descriptions": "Got an email from the department supervisor, inviting me to interview during certain time periods. He then reconfirmed through email. Showed up to interview 15 minutes before it and while in the interview panel, they asked a lot of questions that pertain to the job description. For instance, tell me about your past experience with the use of Peoplesoft: Common Financial System?", "Interview Questions": "What is your knowledge about databases?"}, {"date": "23 Mar 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at CSU Sacramento in Aug 2014", "Interview Descriptions": "First of all I submitted my resume and cover letter to employer for student assistant position. Then I was called for 1:1 interview. He scheduled interview two days later as he was examining different candidates for the same position.", "Interview Questions": "OOPS concepts, UML diagrams, Design patterns, past experience"}, {"date": "13 Nov 2015", "title": "SSP II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in Apr 2014", "Interview Descriptions": "Panel interview: varied questions. Panel was warm and inviting, I would recommend other candidates to apply. I feel that its an easier process if the panel already has a working knowledge of your professional skills and abilities.", "Interview Questions": "What is your experience with student services?"}], [{"date": "17 Dec 2016", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Sacramento (Sacramento, CA) in Jan 2014", "Interview Descriptions": "Interviewed by a small panel and of relevant senior employees. I did not feel much pressure during the interview e.i. they did not grill me with crazy questions or try to catch me off guard.", "Interview Questions": "They asked if i knew what a DNS and IP address was even tho the job title did not specify web experience and they prefaced the question saying that my answer would not effect whether i got the position. They were only curious. "}, {"date": "13 Aug 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at CSU Sacramento (Sacramento, CA) in Mar 2013", "Interview Descriptions": "Applied online, received a call, interview with manager and his panel of two other people. Each asked a question taking turns. Manager sat and watched most of the interview.", "Interview Questions": "What experience do you have working with people?"}, {"date": "15 Jan 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CSU Sacramento (Sacramento, CA) in May 2012", "Interview Descriptions": "If you took the class \"Writing Center Internship\" and passed the class, all you have to do it submit an application to the English Department. You must submit with the application a letter why you wish to be employed at the Writing Center and how you will help the students there become better writers.", "Interview Questions": "N/A"}, {"date": "5 Jan 2016", "title": "Dock Master At CSUS Aquatic Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at CSU Sacramento (Sacramento, CA) in Feb 2012", "Interview Descriptions": "Asked a couple question about what equipment I was familiar with at the facility. Asked some more questions about personal things. Must be in a lifeguard class and a boating safety certified (very easy to obtain).", "Interview Questions": "Pick 5 people (from the pictures given) and tell me how would you tell them not to drive a boat if they came hungover to work or still drunk?"}, {"date": "21 Nov 2013", "title": "Freshman Composition Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at CSU Sacramento (Sacramento, CA) in Nov 2011", "Interview Descriptions": "This process is for CSUS Master's Students in the MA Composition, Literature, Creative Writing, English, and TESOL programs wanting to apply to teach freshman composition. These are the majors that are qualified to teach this Graduate Teaching Associate position. First, there will be an announcement that goes out in the Spring Semester asking for applicants. Fill out the application with a personal statement. Then, if you are chosen, you will receive a call for an interview with a follow-up letter confirming your interview. On your interview day, show up at least 30 minutes early. When I interviewed, it was inside a nice conference room on an upper floor of the University Union building. I sat at the head of the table while the four people interviewing me sat at around the table. Each person took a turn asking me a question. The interview lasted about 30 minutes. One of the teachers interviewing me smiled nicely the whole time. Two looked neutral, and one looked unhappy. They had a specific set of questions they would ask all applicants. Mostly questions about our teaching philosophy, how we would present certain topics, how we would handle different situations, the order we would present things in, group work, etc. You need to know current composition teaching beliefs, practices and pedagogy. Also, be expected to answer a question about what theorists influenced you the most and why (you can't go wrong with Paulo Freire and his critical pedagogy and Freirean teaching methods). You will also be asked to address the issue of second language learners in the composition classroom. Once the interview is done, you will hear back in 1-3 weeks about whether or not you were given the job. If you got the job, you will be given choices of class times to teach, and you will be expected to create your outline for the semester and your prompts, peer review forms and grading rubrics (4 prompts in total - basically your whole writing sequence). Everything else you create and plan as the semester progresses. I truly enjoyed working here. Good luck!", "Interview Questions": "1) Who is the theorist that most influenced you and your teaching philosophy? 2) How would you address second language learning issues (ESL) and theories in your classroom?"}, {"date": "30 Jul 2011", "title": "IT Print Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CSU Sacramento (Sacramento, CA) in Jun 2011", "Interview Descriptions": "The interview was a little shocking in that it was against a panel of 5.  They did provide a handout of the questions they were going to ask a few minutes beforehand however, which made it a little more comfortable.  Afterward, a tour of a facility was provided.  The process afterward took a very long time; a little over a month before contact was made with a rejection notice in the mail with nothing as to why.", "Interview Questions": "Describe a specific incident where you felt most proud in your career."}, {"date": "7 Dec 2010", "title": "Database Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in Nov 2010", "Interview Descriptions": "Got an interview offer by email, regarding they are looking for some one who knows about databases - Oracle. Was invited for face - face interview and asked about my past database project and what database I have worked on? They liked my skills and knowledge about database. Email them after 10 days and they told me I have been selected, but the HR process would take time as most of staff was on Thanks Giving Holiday.", "Interview Questions": "How to write PL/SQL queries? How to optimise the performance of the database?"}, {"date": "12 Sept 2012", "title": "Student Assistant - IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in May 2010", "Interview Descriptions": "Good. Asked me couple of simple question related to debugging things n fixing the computers.. how to check n/w connection. Changing default configurations.", "Interview Questions": "Nothing was difficult in the question or situation. They were friendly"}, {"date": "12 Aug 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at CSU Sacramento in Mar 2010", "Interview Descriptions": "Easy hiring process. Online resume submission through career center, interview with Program Director and took a short writing sample test. Waited out a week before getting a call back that I got the job. First day of work consisted of filling out all the required paperwork. Payroll, the official job application, etc.", "Interview Questions": "Talking about myself and why I'll be a good fit."}, {"date": "11 Feb 2010", "title": "Night Shuttle Driver/Dispatch Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in Jul 2009", "Interview Descriptions": "First off, you can only be hired for this position if you are enrolled at CSUS with a 2.0 GPA and 3 years of driving experience.  Initially I called to see if I would be disqualified from a driving position because I had gotten a speeding ticket the year before.  I was told that as long as that was it, I could still apply but they were currently full.  I came in and filled in an application, then a few weeks later was called in for an interview because someone was graduating and needed to be replaced.  The interview took about 45min.  He had me leave the room so he could call my references.  He offered me the job after speaking to them.", "Interview Questions": "What did you do when you had an unsatisfied customer? Describe a specific situation."}], [{"date": "18 Apr 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at CSU Sacramento (Sacramento, CA) in May 2009", "Interview Descriptions": "Basic interview questions. What is your motivation for wanting to work in this department? What do you do on campus? What experience would help you in this position?", "Interview Questions": "What motivates you?"}, {"date": "18 Aug 2010", "title": "Note Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at CSU Sacramento (Sacramento, CA) in May 2009", "Interview Descriptions": "I was asked all basic questions like \"tell about yourself\". Then I was asked to take notes of a lecture that was played on the tape recorder.\r\nIt went for about 10 minutes.\r\nThen i was selected for the position.", "Interview Questions": "Tell about yourself."}]]