[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Volunteer Legal Advocate", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Sept 2016", "job_title": "Owner, Aretz & Chisholm Immigration in Quito", "duration": "N/A", "pros": "There is absolutely no better way to understand the workings of international refugee law without seeing it first hand, and no better way to learn to appreciate the strength and resolve of a refugee without hearing their story in person, in their native language. I was so proud of my supervisors, my work, and my colleagues. I was stretched and challenged in ways that are very uncommon for recent law school graduates; working for Asylum Access was the perfect way to launch my legal career.", "cons": "It was financially difficult to work abroad without compensation, but well worth it. By it's very nature, the VLA position is one of in depth training and once-in-a-lifetime experiences. It taught me a great many lessons and skills that helped me find the right position after returning from my time in Quito. I also think it is wise to require a 6 month commitment, but not to encourage a stay much longer than that (as a VLA)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Dream job in the making", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2016", "job_title": "Communications in Quito", "duration": "N/A", "pros": "I've worked with Asylum Access Headquarters (HQ) for four years now and in that time I've witnessed an impressive growth spurt as the organization's expanded to several new countries. Through the process I've never seen a team work so hard to offer its employees the highest quality support and benefits possible.\r\n\r\nI'll admit, in the beginning the pay was low and benefits were few. But the organization's model and strategic approach is solid. The people I have had the pleasure to work with are honest, down-to-earth, dedicated, communicative and extremely professional.\r\n\r\nAfter sticking with Asylum Access HQ for four years, it's really paying off. My job description and salary have been improved significantly based on my interests and needs. I can work remotely and still feel like I'm part of a team. Finally, I feel like there is still a lot of room to grow within the organization in the years to come, and I definitely can't complain about the amount of paid time off we get.", "cons": "- It can be hard to feel connected with staff and volunteers in other countries and their achievements. \r\n- In my line of work and likely because I work remotely, there is a lot of computer time, which is exhausting.\r\n- Late night meetings with our team in other timezones sometimes make it difficult to maintain a work/life balance. That said, there is flexibility around work schedules."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Communications and Development Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2016", "job_title": " in Quito", "duration": "N/A", "pros": "This internship offered me the chance to gain experience and skills in a wide variety of different tasks in communications and development.  My managers were friendly and supportive, always providing clear guidance on what was needed and were available when I gad questions. They provided constructive and encouraging feedback after I completed work. The work environment is professional but relaxed and I had tge chance to meet and work with people from diverse countries.  Its a great place to meet friends. Also with the alumni network you can get updates about upcoming job vacancies in the field. Overall I think it is an internship where you can get hands on experience in a growing international organization doing very worthwhile work.", "cons": "Quite a lot of independent working is required so using your initiative is necessary. As a growing organization many staff are very busy, causing strain and difficulties in retention. Some systems are not fully consolidated so there are inefficiencies but as an intern you may be asked to so work on this which gives an interesting insight into the fundamentals of the organization."}], []]