[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A Leader in International, Non-Profit Education", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Dec 2022", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "- Average to High-End Salary for a Non-Profit in International Education - Great, comprehensive benefits - Hugely supportive team and office -Comprehensive organizational structure -Responsive leadership - Hugely competitive in the international education field - beating IIE with top-tier programs -Great cultural changes with developing tech, integrating more DEIA+ opportunities, and launch of inter organizational \"communities\" -Solid work-life balance and team leaders that respect your time -Change from traditional pay-scale structure to merit-based performance pay increases", "cons": "- Specifically for my position (marketing for the Fulbright Specialist Program), there is a need for interaction between Global Learning and IIE. Due to the break between the Fulbright Specialist Program and Fulbright Scholars/Students programs, there is a huge wall called competition that makes it difficult to do what I need to do - While the salary is great for a non-profit, it's practically a poverty-level wage when you're living in DC (things are so expensive here!)"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "A Great Place to Start in International Exchange, but Catastrophically Mismanaged and Rife with Poor Priorities", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Jun 2023", "job_title": " in Washington, DC", "duration": "N/A", "pros": "Meaningful work, good PTO, intetresting programs, very flexible WFH, variety of work within programs", "cons": "Inappropriately low pay for the DC area causing incredible turnover. Organization-wide staffing issues due to turnover. Disorganization due to staffing issues. Management within programs often focuses on superficial program aspects rather than ensuring core, logistical functions are running smoothly (finances, actual programming, record-keeping, etc) General lack of interest in innovation and change. Clear lack of insight and empathy into the needs and desires of program participants. Chosen partner companies (mainly for logistics such as participant travel) are chosen for cost-effectiveness rather than efficacy to the detriment of staff and participants. Often unclear communication standards."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Benefits are not ideal", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 May 2023", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "- in the city close to metro", "cons": "- horrible pay - mismanagement"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "No room for growth, no raises either", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Jan 2023", "job_title": "Senior Program Associate in Washington, DC", "duration": "N/A", "pros": "Supervisors care, your colleagues are friendly, the work introduces you to some powerful individuals at the State Department", "cons": "Director that took charge was not keen on DEI, they did not want to advocate for hiring more POC, during the BLM movement they used the SPA to investigate how the minority employees were doing instead of addressing the issue head on to the entire team, making the employees feel like they were being spied on instead of valued. There are no opportunities for real growth after a certain level, unless you want to get a Master's degree. You will not get paid more thatn $50k as a PA, and since your salary is paid for by a grant you will not be able to negotiate a pay increase."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Good but not great", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Apr 2023", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "Not hard work Fun coworkers Cool networking opportunities", "cons": "Poverty pay limited advancement opportunities Senior management is....questionable"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Way too much overtime and low pay/No investment in staff", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Oct 2022", "job_title": "Program Manager in Washington, DC", "duration": "N/A", "pros": "Really dedicated people who work so hard.", "cons": "Very poor investment in staff. I watch good people leave all the time for better jobs and the people who can't get something better stay because they don't have options. HR is a joke and is no advocate for staff.\nThe work culture is one of constant overwork with more and more being asked of people as staff leaves and is not replaced. There is almost no support for onboarding new people so they don't know how to do things, but can't find help from supervisors or other team members. Finance is woefully understaffed along with every other position. They used to be a good company, but now the mission lives only in the people in the middle with the upper levels so out of touch and everyone too overworked to have a life. \nToxic environment. Very bad for life, even though messaging from the top is all about work-life balance. It's not possible if they don't take care of the employees they have."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great Potential - Poor Management and Pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Oct 2022", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "Lots of opportunity to work on other projects and teams. Interesting and challenging work. Overall, amazing staff.", "cons": "Poor pay for the market/DC area. Limited upward mobility, managers do not know how to manage people and just have been at the organization for a long time. They are knowledgable and skilled, but not with managing people. Lots of overwork and gas lighting from leadership."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Retention nightmare signals all you need to know", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Oct 2022", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "The most junior level staff are genuinely mission-driven, hard-working, caring and collaborative.", "cons": "Severe lack of diversity, performative approach to DEI, almost zero non-white leadership leads to echo-chamber culture. Minor changes are celebrated and back-patted without contributing to a better environment for any staff. Staff are chronically over-worked, under-paid, and shuffled around to do multiple people's jobs at a time. Contracts are constantly lost making staffing even tighter. Truly a traumatic workplace experience with endless frustrations and total burnout."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Strong, diverse organization with impactful work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 May 2022", "job_title": "Writer/Editor in Washington, DC", "duration": "N/A", "pros": "Overall, the organization works hard to deliver upon its mission, and I personally find it deeply rewarding to be a part of this impactful work. The Marcom team, in particular, is full of talented, kind, and collaborative individuals who work together seamlessly on interesting projects. Senior leadership listens to employee needs/wants, the work environment is incredibly flexible to allow for work-life balance, and there's also ample room to expand and develop new skills.", "cons": "Org: Large and complex, so it might take a bit of time to fully grasp everything, but everyone is patient and willing to educate.\nMarcom: There's a lot of great projects to work on at once so the workload can get heavy, but everyone works together to make it all happen."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Very Pleasant and Modern Work Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2022", "job_title": "Junior Graphic Designer/Marketing Assistant in Washington, DC", "duration": "N/A", "pros": "Coworkers were very friendly and helpful. The workload is fast-paced but reasonable. Project diversity is solid, rarely gets too boring. The projects we worked on felt very important to the world. You can feel good morally, working on them. Above average benefits and competitive pay. World Learning also throws amazing office parties!!\r\n\r\nIf you're interested in helping the effort of educating women and children who otherwise would not have the opportunity this is the place to work.", "cons": "Hard commute if you live outside DC\r\nRemote work was not an option... may be different now\r\nSometimes there are international meetings that you have to go in super early for."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good for entry-level work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 May 2022", "job_title": "Marketing Communications Associate in Washington, DC", "duration": "N/A", "pros": "I met some great people here and generally speaking, enjoyed the work. The people at mid and lower levels are great, full of passion and talent. My specific position has allowed for a lot of exploration of new skills and mentorship within my department. Figuring out the return to work plan has been fairly flexible and my dept leadership is keen on getting everyone’s feedback. (Not sure what it’s like for other depts though.) There’s a good amount of interesting projects to work on. Getting to see programs in action and their impact is great! Paid holidays, good vacation time, and retirement match.", "cons": "World Learning wants to be globally minded but have yet to figure out a system where employees can be more mobile/live abroad/work where and how they do their best. Work has changed so much in the last few years but HR and leadership seem very stagnant and too traditional for me. Not nearly at the level of innovation that they should be. Inefficient systems, siloed communication. Lots of jargon, especially at the upper levels.\r\n\r\nHigh performance isn’t really rewarded as much as it could be. I’ve received various empty promises and had things fall through, probably because there’s no promotion, hiring, or pay transparency. I’ve also had some projects handed to me and my teammates in the name of “professional advancement” but it’s really just work well above our pay grade with little to no guidance or training.\r\n\r\nI learn a ton from my coworkers and enjoy my time here for the most part, but the higher up positions are the super well paid people who seem to be fine with just keeping the status quo as long as they’re making the rich, out of touch board members happy. Senior leadership is also where you’ll find a lot of discrepancies with what the org says are its core values. Lots of talk, but doesn’t ever seem to be much tangible action. Ridiculous that they still don’t share salary ranges for open positions. I know good DEI work takes time but like… this is too much time. And if you ask HR about any changes all you get is “we’re working on it, it’ll happen at some point… maybe.”\r\n\r\nI def would not have stayed working here as long as I have if I weren’t for a great manager relationship and a few key coworkers and fun projects that have made it worthwhile overall."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Come work for WL!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Aug 2022", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "- Fulfilling work \n- Great connections\n- Organization that actually fulfills aspects of their mission", "cons": "- Sometimes lack of communication between divisions\n- Sometimes disorganized"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "NOT experiencial learners", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 May 2022", "job_title": "Project Manager in Burlington, VT", "duration": "N/A", "pros": "great mission, dedicated staff, and opportunities to learn from the global south.", "cons": "A bully in senior management, as well as evidence of misogyny. Inarticulation of the vision - trying to be something else. Disregard for local staff, lip service only to diversity, equity, and inclusion."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work and make a difference", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jun 2022", "job_title": "Writing Center Coordinator in Brattleboro, VT", "duration": "N/A", "pros": "Welcoming, global impact, close community", "cons": "Small, often understaffed, departments tends to lead to wearing many hats"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "You CAN do similar work and get paid MUCH better elsewhere", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Mar 2022", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "cool projects, international teams, opportunity for travel, autonomy. You make so little with eight years of experience you qualify for DC housing tax breaks! =)", "cons": "lack of work-life balance and severe \"grind\" culture for little pay (you can make more money at a lower job level at competitive organizations). Higher education valued over experience."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Program staff rock, management does...not.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Feb 2021", "job_title": "Senior Program Associate in Washington, DC", "duration": "N/A", "pros": "Excellent, capable, and mission-oriented program staff, nice new workspace (opened shortly prior to COVID-19 pandemic), holiday week off, flexible telework policies (in place prior to pandemic), pre-tax transit benefits, decent health insurance.", "cons": "Management is out of touch with staff needs. Opportunities for advancement are not cultivated for staff, it's left up to chance for who leaves or stays on teams. Programs are highly silo-ed with little to no effort at upper levels to better integrate staff. Salaries are LOW with very minimal increases for the rare promotion. Benefit cuts at outset of the pandemic were severe (suspension of retirement matching which I hear is yet to be re-instated being a big one). The CEO comes off - blatantly - as insincere with a head-in-the-clouds demeanor. Management ignored and then largely rebuffed (after consistent attempts to get them to listen to) efforts to change time off policy to allow staff to not use vacation time for non-Christian religious observances (Easter always falls on a weekend and Christmas week is time off for all staff). For an organization that seeks to promote intercultural understanding and peace around the world, this is unacceptable. \r\n\r\nI could go on. The staff are great but upper management isn't going to take care of you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "I have one of the most incredible experiences!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Feb 2022", "job_title": "Digital Facilitator in Washington, DC", "duration": "N/A", "pros": "I worked with WorldLearning as a digital facilitator in the past summer. It was an incredible experience where I made friends with my colleagues, my students and the rest of the worldlearning staff.", "cons": "I did not experience any cons working at worldlearning."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work, learn and grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2021", "job_title": "Marketing Officer in Washington, DC", "duration": "N/A", "pros": "It is a very rewarding and interesting experience to work in World Learning, even during the global pandemic. The company and people are trying to make a difference in the world, not just working for the paycheck. So there is always a passion and desire to make things better. There is a great sense of camaraderie within the organization and an awesome purpose (to create a more peaceful and just world through education, development, and exchange), something that we badly need in our world now. It is strange to see negative reviews here. The World usually reflects what we project, so maybe some negativism here is inability to see the light. I can only speak for myself and I enjoy working at World Learning. \r\n\r\nI work with teams in Vermont and DC, and it is a great pleasure. It is a tough time for all of us, but my colleagues and the senior management team are trying to make it better. They are hardworking, dedicated, motivated, and most importantly reasonable. I am very grateful for their contribution to my professional growth.", "cons": "There is always an opportunity to grow, and World Learning is on the right path."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent mission-driven non-profit", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "15 Mar 2022", "job_title": "Senior Program Officer in Washington, DC", "duration": "N/A", "pros": "Great co-workers, opportunities for advancement, high-quality, mission-driven work", "cons": "Not enough collaboration across teams"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Na", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2022", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "Easy to communicate with and open team mentality", "cons": "At times vague approach with tasks"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic Management and Little Transparency", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jul 2021", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "I met and worked with some great colleagues passionate about the work. Overall, I found that working at World Learning was a solid way to get my foot in the door in the international NGO field and develop valuable professional experience.", "cons": "Having moved to a new company with transparent, non-hierarchical communication, supportive and friendly management, highly effective onboarding and training processes, and room for internal mobility, I feel like leaving World Learning was akin to leaving a toxic relationship.\r\n\r\nAs many others have said, your experience at World Learning significantly depends on your team and your manager. Unfortunately, I found my team environment to be quite toxic. My managers did not advocate for me and misinformed me about company policy regarding promotions/raises and taking time off. On an interpersonal level, I found that my managers were often belittling, undermining, and insincere. Frustration from overwork or disorganization was clearly channeled downward. Half of my team left in less than six months this past year due to the extreme lack of opportunity for growth, limited mobility, and low pay. The management structure seems to reward those who discourage employees under them from seeking advancement and opportunities, and push out those who attempt to rock the boat. The lack of transparency from the top down and hierarchical communication structure makes it incredibly difficult to navigate this organization and sometimes even inhibits your ability to work efficiently. Having to go through very specific communication channels to make a request or ask a question about policy (your supervisor forwards your inquiry to their supervisor and so forth), feels very disempowering (my rank is too low to ask the right person this question?) and once again, limits transparency by excluding you from these conversations that directly concern you. In general, my department seemed to promote a culture of fear around contacting HR directly with questions about company policy or position advancement, allowing management to shut down any requests open discussion about these topics.\r\n\r\nTalking to colleagues from outside of my team, we found disturbing pay/annual raise discrepancies between us. There was little consistency or reasonable explanation for these discrepancies between the same positions on different teams, and no transparency for the process of receiving a promotion (or rejection for that matter). \r\n\r\nI never felt like I was properly trained to do my job. Although I eventually learned to do my job well, I was really left to sink or swim from the beginning, causing a lot of unnecessary stress. I felt like I was inconveniencing others by asking for help. I also found, shockingly, that some tasks or responsibilities I was assigned, no one else on my team had institutional knowledge of how to do, largely due to high turnover and routine brain drain, leaving me to spend significant amount of time figuring out these processes from scratch. Most alarmingly, I felt that the lack of consistent training and standardized processes left gaps regarding privacy and confidentiality of our clients, as well as general client care. I felt like my lack of official training in these areas was a huge disservice to our clients.\r\n\r\nDiversity & Inclusion is woefully underprioritized at World Learning. Talk of diversity and inclusion was very often reactive rather than proactive, with little transparency around efforts to improve or institutions/resources in place to encourage Diversity & Inclusion. This is critically important for an international NGO in the 21st century, especially one that has been known to underserve staff members of color and promote white saviorism abroad in the past.\r\n\r\nAs others have pointed out, the rollback of benefits due to COVID-19 was disruptive and, once again, not transparent. Our annual cost of living adjustment was cancelled for two year in a row, vacation time rollover was cancelled, professional development funds were suspended, and 403b matching was cancelled. At first, the latter two expenses being cancelled made sense due to the massive loss of income, but after finances were (supposedly) stabilized and our benefits were not reinstated, it felt like a prolonged excuse not to give us vacation time or cost of living adjustment without an honest explanation.\r\n\r\nIt's also worth noting that most of the positive reviews of this organization in the last year are from middle or upper management, including new hires. I've found this laughably insincere and believe this illustrates the dishonesty in management at World Learning.\r\n\r\nIn summary, depending on the team you join, working for World Learning may be worth it if you're just looking to get your foot in the door, but make sure to having an escape plan in mind if you find yourself in a situation similar to mine."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stuck in a cycle of leadership transition and instability", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2021", "job_title": "Program Manager in Brattleboro, VT", "duration": "N/A", "pros": "inspiring co-workers. programs are great for participants and those of us that work on them.", "cons": "Leadership has gone through multiple transitions over the last few years. Its really disconcerting. Lots of instability before covid and only worse during covid. If our organization didn't get the PPP funds we did, we'd likely be collapsing or having to use more of the unrestricted endowment funds that the organization has already been digging into. I won't be here for long and will miss my colleagues, but its toxic at the leadership level. I am also concerned that donors see on the organizational 990 that World Learning finds a way to come close to a break even budget but net assets are going down--and not just because of depreciation--and revenue in general is going down (collapsed in 2020 with covid). If the organization loses more donors or it loses any of its government contracts, then its likely to shrink tremendously or collapse--just my hypothesis but its pretty tenuous. SIT graduate institute is already a failed school (not philosophically, but financially and the leadership is inept)."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poverty wages...", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Feb 2021", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "The government funded work is going to get a boost with the Biden Administration. My cube mates if we were still in cubes. Being able to telework.", "cons": "Try making it in DC on the wages they pay for program associates. Its terrible. I have to live with 6 people and one bathroom. Really. DC is so expensive. And I'm not one of the privileged white savior rich kid types that can make it so easy here in DC. Its hard being BIPOC in this organization, particularly with the patronizing language of the leadership and no chance to advance (and professional development has been cut repeatedly over the last few years--even before Covid). The Diversity Abroad evaluation that is happening is just going to gloss over the issues and sit on a shelf like all the 'plans' the leadership comes up with. They say there aren't going to be more layoffs...but everyone knows its likely to happen again before the end of 2021. SIT is running a huge deficit that hurts the whole organization because they're 15 years behind the rest of the field and have a degree program that's worth nothing (and no, adding a PhD program doesn't elevate SIT...just makes it look even more like a ripoff than before)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Top of the Industry in Culture & Values", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Jul 2021", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "I worked at World Learning for nearly 4 years and it was the best place I have ever worked. I came in as a mid-career. I know several co-workers who came in as interns or early career and quickly moved up the hierarchy. There are a lot of leadership development opportunities within the organization from leading a working group to being promoted into management. That promotion ability does depend on your program, but in the 4 years I was there several colleagues were promoted at least once, and many times twice in that time period. \r\n\r\nThe work and office culture was one of the best I've ever experienced. Other organizations I've worked for talk a good game, but World Learning walks the walk. There will be times you work after hours or have busy weeks, but managers are flexible about work/life balance when those busy times are over. In non-Covid times there are lots of opportunities to take part in after hours fun if that's your thing, or not if that's your thing too. Many of my friends outside of work came from my time at World Learning even though we've all since moved on. \r\n\r\nUltimately, like any organization there will be pros and cons, but the office culture, work/life balance, in-house professional development, and org focus on living their values made World Learning one of the best places I've worked. And I don't say that lightly.", "cons": "Like any non-profit, especially one funded by government contracts, the pay is not what you'll find in for-profit industry (it's pretty standard for non-profit though and I've worked in several). World Learning does pay more than their competitors and what they can't pay in higher salary or Cadillac benefits, they make up for in work/life balance and culture where they can. One con is that this can be limited based on your manager, though they try to make most flexibility standard across programs/teams/managers. If you bring up any issues in this area, leadership will listen and try to institute fair policies though, like any organization, it can seem slow moving.\r\n\r\nYour job satisfaction can depend on your manager, like any organization there were a few colleagues I knew having a hard time because of who their manager was or because of which project they worked on. If it was a project issue, those colleagues made lateral moves to other departments/projects as new funding is always coming in and opportunities open up. If dissatisfaction was manager-based, colleagues often did the same - moved laterally to new teams or projects. World Learning is like any organization where there are some bad managers, but I had a pretty central view of the organization and gauge the bad:good ratio to be about 10:90."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Dec 2021", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "great team, professional development opportunities, commitment to diversity and inclusion, great organizational culture, valuable impact", "cons": "Nothing I can think of, it was a great experience to work at world learning."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No job security, low pay, poor leadership, lack of focus and direction", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2021", "job_title": "Administration in Washington, DC", "duration": "N/A", "pros": "Remote work possibilities. The friends and colleagues that are mission driven and here for the right reasons.", "cons": "Cronyism is rampant. Upper management is more worried about themselves and there's a constant CYA mode that people are in because of the lack of trust in the org. The organization's DEI work is all a facade. Its pretty toxic. The financial situation is bleak. SIT is going to be another new england based higher ed institution that closes because they can't get their act together and are running a major financial deficit and have been for years."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Mission driven/client focused", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Nov 2021", "job_title": "Project Manager in Washington, DC", "duration": "N/A", "pros": "Program staff are mission driven and have a strong sense of purpose and value team culture.", "cons": "Depending on your funding source, your client maybe USG funders, which ultimately dictates your work culture as the client comes first."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Looking for another job...", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Feb 2021", "job_title": "Program Manager in Brattleboro, VT", "duration": "N/A", "pros": "Not much except for some colleagues and the mission.", "cons": "There is no job security. The organization's financials have been a problem for years and Covid has made an even deeper hit. There have been layoffs of people every year since 2018 because of budget shortfalls. This is by no means the fault of the staff, it is the leadership that cannot get the organization aligned and after three years of 'leading' the organization have shown they cannot turn it around. The infighting and toxicity is bad. There is a lack of trust throughout the organization. Leadership is always trying to put on a good face but can't get any initiative right--including any attempt they've made at DEI initiatives--total lack of authenticity."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Meaningful organization with inclusive and forward-thinking employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Mar 2021", "job_title": "Anonymous Employee in Brattleboro, VT", "duration": "N/A", "pros": "Progressive people with inclusive values. The organization is dedicated to doing meaningful work around the fields of international education and development. It's great to be a part of a team that is committed to values of social justice, sustainability and intercultural communication.", "cons": "Like many organizations in the non-profit sector, sometimes resources are scarce and people might be stretched thin on occasion. But I also feel like the administration recognizes this and is understanding about what we can do."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Pleasant place to work; healthy work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Apr 2021", "job_title": "Executive Assistant in Washington, DC", "duration": "N/A", "pros": "Friendly and mission-driven staff. Inspirational stories from those impacted by our programs. 5% matching for 403b. Time off between Christmas and New Years. Leadership that seeks feedback and is committed to DEI work. Remote work policy is great. Work/Life balance is fantastic. Opportunities to be creative.", "cons": "Though competitive within the industry, it's a non-profit so salaries can be low. Makes up for it with mission-driven work and 5% match helps. More engagement opportunities with staff and leadership during a virtual environment is needed."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "No work life balance", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Aug 2021", "job_title": "Office Manager in Washington, DC", "duration": "N/A", "pros": "Being off during Christmas and New Year \nThe abilty to learn several positions due to understaffing\nRare for the Office Manager to work weekens unless emergency", "cons": "Little to none as it pertains to organization\nSenior leadership struggles to give acurate direction\nVery hgh expections or so little pay"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jul 2021", "job_title": "Budgets and Contracts Coordinator in Brattleboro, VT", "duration": "N/A", "pros": "DEI orientated, kind and helpful coworkers, I have developed a lot professionally.", "cons": "I cannot identify any cons so far."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Leaving World Learning", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Mar 2021", "job_title": "Senior Program Officer in Washington, DC", "duration": "N/A", "pros": "Colleagues, travel when it is happening, the support we provide for youth around the globe.", "cons": "Very little direction for the organization. Silos everywhere. I'm looking for another job and will jump as soon as I find anything."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Deteriorating Nonprofit", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jun 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Mission, peers, program teams, time off at end of December.", "cons": "Pay and benefits are minimal compared to better run nonprofits. Exec pay is bloated compared to everyday staff. Leadership is toxic. DEI efforts are a facade. Financials only keep looking worse even through they say we're coming out of covid. Highly unstable organization."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "World Learning and SIT fantastic place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Mar 2021", "job_title": "Manager in Brattleboro, VT", "duration": "N/A", "pros": "New global masters degree programs are aligned with critical global issues. Innovative approaches and new academic leadership is inspiring. Engagement with global development programs is inspiring. Leadership is working as a team to build the future.", "cons": "A lot of work to be done. And the pay is to be expected for a nonprofit and academic org."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The sound of air from a balloon", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Mar 2021", "job_title": "Director in Washington, DC", "duration": "N/A", "pros": "Excellent, mission-driven program staff. Technical staff that know what they're doing. The work we do with youth around the US and the globe.", "cons": "Leadership without a keel. No vision that's clear and in line with any strategy for years. We just do whatever someone thinks will bring in funding. SIT Graduate institute is floundering with its enrollment for years and Covid is like the last wind from a deflating balloon."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great values!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Feb 2021", "job_title": "Program Officer in Brattleboro, VT", "duration": "N/A", "pros": "I like their values and my colleagues - it feels like we all share the same mission", "cons": "It's difficult because we do international education and the world has closed down right now."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Committed Staff & Strong Leadership", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Mar 2021", "job_title": "Director in Washington, DC", "duration": "N/A", "pros": "Leadership cares about the staff and guided the organization through the pandemic. Committed to equity, inclusion and diversity with new initiatives coming on line. Access to advanced degree programs is a great perk! Work / life balance very good.", "cons": "None to share right now."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great mission coupled with excellent benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "8 Feb 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "- Great mission and excellent programs\r\n- Stellar reputation with donors\r\n- Various IT/ERP systems and processes\r\n- Christmas week off\r\n- Great newly renovated office in DC", "cons": "- Impact of COVID on programs/compensation (hopefully temporary)"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Flexible Work & Good People", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Feb 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "- Flexible work schedule (most departments)\r\n- Decent Benefits (very low insurance premiums, front-loaded PTO)\r\n- Genuine people\r\n- Awesome CFO (one of the most talented people I've met in my career)", "cons": "- Some grey areas about roles/responsibilities \r\n- Staffing shortages"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Wonderful colleagues, ghastly senior management…", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "4 Feb 2021", "job_title": "Faculty in Brattleboro, VT", "duration": "N/A", "pros": "Colleagues at SIT/World Learning are committed and mission-driven.", "cons": "Recent leadership (2017-current) lacks leadership skills. They are condescending and colonial in their relationships with faculty and staff around the world. They promote a toxic work culture ripe with paternalism and power hoarding. There is a constant sense of urgency and defensiveness with fear of open conflict. They promote quantity over quality and embrace the concept that progress means more."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible leadership...organization sinking", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2021", "job_title": "Associate Director in Washington, DC", "duration": "N/A", "pros": "My team, the program teams, the passion of the every day person.", "cons": "The leadership, the layoffs, the platitudes from management that things will get better...but they've gotten continually worse for three years. The smart people are leaving."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Mission-driven with a commitment to positive change", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Mar 2021", "job_title": "Administration in Washington, DC", "duration": "N/A", "pros": "Great leadership, strong ethics and values, wonderful programs, global presence", "cons": "Increase efforts to communicate the positive messages"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Working Experience", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Mar 2021", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "Talented staff who are friendly, collaborative, and innovative", "cons": "Competency of management depend on what project team you are a part of"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Leadership Changes", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Apr 2021", "job_title": "Partnership Manager in Brattleboro, VT", "duration": "N/A", "pros": "Great students & staff. Inspiring programs", "cons": "Top level decisions impacting daily operations."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Feb 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Interesting work, transparent leadership, and nice colleagues", "cons": "Too much work due to turnover of staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Good culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2021", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "People, mission, benefits, telework flex", "cons": "Salary and extra hours work"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Disappointing leadership, lack of opportunities for staff", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Jun 2020", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "-Staff are some of the hardest working and nicest people who are truly passionate about international exchange.\r\n\r\n-You get to work on programs that do have a significant impact on connecting people through cross-cultural exchange.", "cons": "-WL does not invest in the hardworking and underpaid staff - Most employees work long hours without overtime pay and truly believe in the mission of the organization. Professional development and opportunities for advancement are severely lacking. \r\n\r\n-Favoritism is rampant and promotions lack transparency and a fair process. There are no standard rubrics for promotions nor objective panels to evaluate employee accomplishments. Promotions are subject to significant bias. \r\n\r\n-Senior Management likes to virtue signal on issues relating to diversity and inclusion (ex. social media posts on BLM), but maintains the status quo. Several employees, including BIPOC have spoken out about these internal management and cultural issues and Senior Management refuses to enact any MEANINGFUL change to support BIPOC employees. The numbers do not lie, look at the racial make-up of the WL board and senior management. There has been an exodus of BIPOC employees over the past 1-2 years because of the difficulty of promotions or the indifference of management in enacting policies that advance diversity and inclusion."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Time for new leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2021", "job_title": "Divisional Vice President in Washington, DC", "duration": "N/A", "pros": "The people doing the work.", "cons": "The leaders that take credit for the work that everyone else does."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great organization to start your career in international development", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Jun 2014", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "You will have the opportunity to work with some really great, passionate, and enthusiastic people. The culture of World Learning in DC is friendly, inviting, and non-competitive. They value hard work and the staff regardless of level. There is room for personal and professional growth in the organization, especially if you start off as an intern or Program Assistant. You can make your way up to Program and Senior Program Officer with time and dedication. Depending on the team and project there is opportunity to travel internationally which has its perks. There is always international groups coming and going in the office so you also meet very interesting people around the world. Vacation and benefits are good, and salary is competitive to DC development orgs. World Learning recognizes all national holidays and is even closed for the whole week of Christmas to New Years, so you don't have to use any vacation time.", "cons": "Many times there is a culture of favoritism shown by senior management. It would be wise to get on the good side of the managers and directors early on. You do have fend and lookout for yourself, so if you want a raise or title change then you have to go after it. If you want to be noticed, then you need to make it apparent to do so."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "An organization in transition", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Nov 2016", "job_title": "Manager in Washington, DC", "duration": "N/A", "pros": "World Learning is a family friendly employer in that they generally allow flexible hours and have recently instituted a telework policy that allows approved employees to work 1 day/week at home.  While my personal manager is very flexible on this, I know of others who are inherently suspicious to telework and aren't inclined to trust employees to implement this honestly.  \r\n\r\nIf you are willing to work hard and play the system, World Learning is an employer that will provide you with new opportunities to grow professionally.\r\n\r\nDowntown location is highly convenient.\r\n\r\nThere are some excellent individuals who work here.", "cons": "World Learning, in practice, isn't always aligned with its values. They have grown in recent years, but this growth has led to ineffective strategy development and a cadre of senior managers that demonstrate an inability to think strategically and effectively implement new initiatives in a timely manner.  Decision making is emotionally and relationship driven.  This leads to a stressful working environment.  \r\n\r\nFrustrations across junior staff are high and visible.  There is no internal professional development."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "White Savior Complexe", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Oct 2020", "job_title": "Program Manager in Washington, DC", "duration": "N/A", "pros": "Made some great friends here", "cons": "Management is old and not accepting of the inevitability of change"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Gossip Mill", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Feb 2020", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "There's a small handful of kind and visionary people here - however, they're boxed out of management and continuously leaving to pursue a better workplace where they will be appreciated. The only benefits are getting to work with some of these people for the time being and flexibility. Some actual programs are making a difference in the world. Carol, the CEO, has a great vision. Decent health insurance.", "cons": "Gossip, gossip, gossip. You can be a respected asset on your team, only to be spoken poorly about the moment you put in notice. I've witnessed it multiple times. It's hard to trust management when there is constant gaslighting, rumors, and a lack of communication internally. No upward mobility, and a week off at Christmas is not a substitute for a livable salary in the DC-meto area. There have been recent layoffs, so I would not be too comfortable here long term."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good people and mission, poor leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Sept 2016", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Great employees that genuinely want to live out the organization's mission\r\nFlexible telework policy\r\nExtended PTO over winter holidays", "cons": "No culture of accountability, especially among senior staff\r\nLittle investment in junior and mid-level staff, especially in terms of professional development opportunities\r\nCompletely opaque decision-making\r\nSenior leadership naive about the industry’s competitive landscape and viable growth strategies \r\nFails to capitalize on field staff expertise or networks\r\nResistant to change and business-minded approaches \r\nLow compensation"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great or absolutely horrible, depending on your supervisor and team.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jan 2015", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "The younger staff at the organization are wonderful and a lot of fun to work with. If you are interested in learning to work on US government grants and contracts this is a good organizations to work for, particularly if you are interested in professional and educational exchange programs.", "cons": "There are a lot of individuals with poor management skills that have been promoted into senior management positions, which is worsened by an overall lack of transparency in hiring and promotion practices. My immediate supervisors were generally always great to work for, but poor management within the overall organization made it hard to enjoy the day to day. There is also little room for growth and advancement and little appreciation for those who go above and beyond the call of duty."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Forward-focused organization with a friendly culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 May 2014", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "It's great to work for an organization working for positive change in the world. Projects involve people from all over the world, and the people who work here are interesting, fun, and extremely competent. Lots of opportunities for professional development, lots of internal mobility. Positive, fun work environment.", "cons": "The structure of projects means that people advance only to fill vacancies, and some projects don't have much turnover at the program officer level. You need to show initiative in order to advance. Entry-level pay is modest but comparable to other organizations."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Program Associate", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Oct 2015", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "Fellow employees are pretty great to work with across the board. World Learning tends to have an open and welcoming office environment with motivating work without being competitive.", "cons": "Program Associate level jobs pay at such a low rate (and managerial quality is so scattered) that people don't stick around for very long. This means seemingly endless rounds of interviewing for new Program Associates and a work culture that can change completely within the space of a few months, lacking consistency."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Your experience will depend what team or project you are working on!", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jul 2018", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "Good and collaborative working atmosphere on most teams; where input from all levels is welcomed and professional development is fostered.", "cons": "Not all teams allow for professional development, especially at the Intern or Program Associate level.  Opportunities or advancement are minimal within teams, resulting in a lot of turnover at the Program Associate level."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Review of WL", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Nov 2016", "job_title": "Admissions Counselor in Brattleboro, VT", "duration": "N/A", "pros": "-Co-workers/colleagues are friendly and supportive\r\n-Fairly laid back environment \r\n- Great scenery\r\n- Work is meaningful", "cons": "- Pay is poor at the lower level positions and little to no pay rises\r\n-Neo-liberal policies bizarrely enough in SIT Study Abroad even though their programs espouse the exact opposite\r\n- Upper management is not good at retaining good talent due to their policies and lack of financial rewards for their employees nor room for upward mobility\r\n-Location could be seen as a con depending on the person"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great place for a first job", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Feb 2013", "job_title": "Associate in Washington, DC", "duration": "N/A", "pros": "good camaraderie with junior staffers. Nice location in DC. Numerous professional networking opportunities with people from all corners of the globe.", "cons": "long hours and low salaries for associates. no bonuses. They job really depends on which manager you draw as a boss. Many of them are good people who are just ill suited for the job. My first manager was perving on me during my first day of work and had to be transferred. My second manager, who lasted only a few months, was a super cool person, but totally unmotivated. My last manager was even worse."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Tops", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Oct 2017", "job_title": "Field Representative in Field, NM", "duration": "N/A", "pros": "WL's knowledge of the education and exchange field is second to none. People have a real sense of mission and are not just chasing money. Inclusion is a value that WL lives in both its project work and its own staffing. I've worked for a half dozen development organizations, many of which I really enjoyed.  WL's people and processes are as good as any of my previous employers.", "cons": "Sometimes we underestimate ourselves, in my opinion."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Program Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 May 2016", "job_title": "Anonymous Employee in Brattleboro, VT", "duration": "N/A", "pros": "Interesting work.  Wonderful students at the Graduate Institute.  Satisfying place to work if you can take initiative and are a self-starter.", "cons": "Hit or miss depending on your department.  Seems to be little interest in developing talent or opportunities for current employees at the Brattleboro site.   HR did not have a handle on what was going on in individual departments resulting in some extraordinarily poor treatment of certain employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great first job in DC; fun workplace with education exchange programs", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Jul 2013", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "Enjoyed meeting all the international participants; lots of young people make for a fun environment; learn about ECA programs up close; gain understanding about international exchanges", "cons": "Salaries in this field in general are just low, and this is on par. Also, it can take a while to advance beyond your initial hiring position"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Volatile senior managment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jul 2016", "job_title": "Dean in Brattleboro, VT", "duration": "N/A", "pros": "Great study abroad programs and country staff around the world\r\nSolid mission\r\nLong history of innovation and progressive experiential content", "cons": "Extremely high turnover, particularly in senior management\r\nIneffective human resources - no recourse for management gaffes or inappropriate decisions\r\nVery insular - VT staff does not solicit input from experienced staff in 45+ countries"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Bad pay, no room to move, poor management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 May 2014", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "casual work atmosphere, no micromanagement, good work/life balance, interesting work", "cons": "Bad pay - not on par with competitors\r\nNo room to move (unless you are buddy-buddy with your manager which is rare)\r\nPoor management"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great staff, disappointing leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Mar 2020", "job_title": "Project Management in Washington, DC", "duration": "N/A", "pros": "Passionate colleagues doing incredible work, lifelong friends, strong benefits. Great for someone starting their career", "cons": "Lack of transparency from senior leadership, emphasis on projects over people, staff feel disposable, revolving door for HR department"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Amazing Global Work - Long Hours - Under Paid", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jun 2018", "job_title": "Youth Programs Associate in Washington, DC", "duration": "N/A", "pros": "Good experience and exposure\r\nAmazing co-workers\r\nWonderful global work\r\nIncredible connections to global network", "cons": "Transition of presidents/CEOs/ other leadership in the last 7 years or so\r\nMuch of the funding came from strict sources; no real room for creativity. \r\nNo overtime or bonuses, however, expected to work long hours."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Wonderful coworkers! Senior management needs help...", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "23 May 2017", "job_title": "Anonymous Employee in Brattleboro, VT", "duration": "N/A", "pros": "Most (99%) of the people and students you will work with are amazing and the Brattleboro campus is beautiful! The benefits at World Learning are great!", "cons": "CEO is a joke\r\nInternal communication is severely lacking\r\nNo accountability\r\nAnnual review process is not tied to compensation\r\nInternal training of employees needs to be worked on"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Working for a large organisation with programs all over the world", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "29 Feb 2016", "job_title": "Manager in Washington, DC", "duration": "N/A", "pros": "The School for International Training changes peoples lives.", "cons": "The staff often need more support than they get and benefits are minimal"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Program Officer", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jun 2017", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "International development and education projects, flexible working hours, diversity", "cons": "People in the management position are there by mistake. They lack substantial managerial skills, which makes everyone feels demotivated.  Favoritism and no opportunities for advancement."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent work with a great mission", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Aug 2016", "job_title": " in Washington, DC", "duration": "N/A", "pros": "Knowledgable and talented colleagues \r\nAmazing work and mission\r\nStrong strategy and planning that was made clear and understandable to employees\r\nFair salaries for industry", "cons": "None as far as I experienced."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "great place", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2020", "job_title": "Research Assistant in Washington, DC", "duration": "N/A", "pros": "work/family life balance, benefits and time off, wonderful supervisor", "cons": "low pay, hard to move up in the company"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Very Limited Upward Mobility", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Jul 2020", "job_title": "Operations Coordinator in Washington, DC", "duration": "N/A", "pros": "Great colleagues. Office made an effort to host social holiday parties.", "cons": "Very low pay, very few opportunities for promotion."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Program Officer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Dec 2018", "job_title": "Program Officer in Washington, DC", "duration": "N/A", "pros": "Great environment, good location, flex time and work from home options, good benefits", "cons": "Limited opportunities for growth within the organization"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Heart's in the right place, but lacks caring leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Oct 2008", "job_title": " in Brattleboro, VT", "duration": "N/A", "pros": "Mission, passion, the people, the students", "cons": "Poor communication systems, low morale"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Well meaning association stuck in the 20th century", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Aug 2018", "job_title": "Supervisor in DC Ranch, AZ", "duration": "N/A", "pros": "True opportunity to enact business process change...friendly people..hot employees", "cons": "Low low pay, antiquated structure."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Aug 2017", "job_title": "Program Associate in Washington, DC", "duration": "N/A", "pros": "Enjoyable Staff\r\nGreat Benefits \r\nUnique Programs", "cons": "Limited Advancement Opportunities\r\nNo other cons"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Finacne Officer", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jan 2017", "job_title": "Finance Officer in Washington, DC", "duration": "N/A", "pros": "good environment to work in", "cons": "needs a better training process"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Mehh... better NGOs out there", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Sept 2017", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Great Location and that's about it.", "cons": "Low pay; no upward mobility; lacks integrity"}]]