[[{"date": "12 Mar 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters in Feb 2023", "Interview Descriptions": "Very easy process and supportive team members. Answered any questions you may have and excited to have you on the team. The orientation and tour was great. The facility was nice and welcoming. Each area has a different theme which is great for the kids.", "Interview Questions": "Why would I like to be a volunteer at CHKD?"}, {"date": "9 Sept 2022", "title": "Patient Access Tech II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "The hiring process took about 20 days. I applied at the end of July and I received an offer mid August. It was a 1 round interview and I was really informed about to role and what was expected of the person chosen for the role. I was interviewed by 2 ladies and they were very informative and nice and made the interview very relaxing.", "Interview Questions": "Tell me something about yourself that is not on your resume?"}, {"date": "15 Jul 2022", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Jul 2022", "Interview Descriptions": "About 45 min long interview with the practice manager going over basic interview questions about teamwork and how you work under-stress. Super chill and cool people. They were more concerned on how you work well you work with a team and a lot of questions revolves around that.", "Interview Questions": "What would you do if there were conflict with colleagues "}, {"date": "3 Jun 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters in May 2022", "Interview Descriptions": "The interview process was very informal and easy-going. The two interviewers asked me about my education and work history, my aspirations, and how I learned about the position at CHKD.", "Interview Questions": "What is your educational background?"}, {"date": "7 Aug 2022", "title": "Sleep Technologist RPSGT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Of The King's Daughters (Chesapeake, VA) in May 2022", "Interview Descriptions": "It only took about a week for them to reach out to me. I was actually coming to the area to scope it out before moving and the lab manager decided to meet with me on a Saturday while I was in town. Everyone I met was very nice and professional. The interview was pretty laid back and comfortable. They eased my anxiety quickly.", "Interview Questions": "Why was I leaving my current job?"}, {"date": "2 May 2022", "title": "Patient Access Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Apr 2022", "Interview Descriptions": "It was very welcoming, I felt it was easy to talk to them and answer questions, they gave me plenty of time to talk and discuss things. The atmosphere was inviting and I enjoyed the process.", "Interview Questions": "What are two strengths and one weakness about yourself?"}, {"date": "19 Jan 2022", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "Easy, quick brief questions about background experience\r\nstrengths and weaknesses\r\nQuestions about commuting, availability\r\ncertifications if any\r\nquestions to ask or concerns, benefits, etc. \r\nexperience with CP patients, AT/AAC experience\r\nwhere do you see yourself in 10 years", "Interview Questions": "What made you want to be a speech language pathologist"}, {"date": "12 Jan 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Hospital Of The King's Daughters (New York, NY)", "Interview Descriptions": "Applied and received a call the next day for an interview. The interview was pretty laid back, asked normal questions you would expect in the healthcare field. Told me what to expect working there, how the day would go etc. I received the call about 6 days later with an offer.", "Interview Questions": "How will you handle terminally ill children?"}, {"date": "21 Oct 2021", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "Pretty calm interview. Staff was very polite and engaged in with interviewee. Staff was also very informative and positive. Staff explained the ins and outs of the position(s), and offered different scenarios of what happens on the job and what is expected of all employees.", "Interview Questions": "What is your educational background?"}, {"date": "11 Nov 2021", "title": "Patient Access Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Oct 2021", "Interview Descriptions": "Very informative\nTook two weeks to get the good news that I was hired \nStart date was a months and a half out \nHR kept me involved with every step \nBackground, drug screen and references are required\n3 panel interview", "Interview Questions": "What makes you a excellent candidate for this role "}], [{"date": "9 Sept 2021", "title": "Health Information Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "The interview was straight forward. They asked about the jobs, experience on my resume and my credentials. Also, how do you handle difficult situations, work ethic, knowledge of HIPAA and customer service.", "Interview Questions": "Describe a difficult situation and how did you handle the situation?"}, {"date": "26 Oct 2022", "title": "PATIENT REGISTRATION TECHNICIAN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters in Feb 2021", "Interview Descriptions": "The interview process was very laid back and simple for the office I was with. The atmosphere was pleasant and the people were very kind. In the interview they asked the basic questions along with some scenario questions that were relevant to the role and the type of behavior they were looking for.", "Interview Questions": "If you’re with a patient and your phone rings and the supervisor needs you, what do you do?"}, {"date": "30 Nov 2020", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Nov 2020", "Interview Descriptions": "It was pleasant and easy going, everyone was very nice.   The manager was very professional, allowed me to ask a lot of questions and she had answers to evey question I had. She gave me a tour of the clinic, introduced me to the staff that was there and at the end ask once again if there was any questions I had", "Interview Questions": "How long have I been in my current field?"}, {"date": "10 Mar 2020", "title": "Health Information Tech II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Feb 2020", "Interview Descriptions": "I interviewed in Norfolk, VA. The process took 2+ weeks. Received an email asking to setup an in person interview. During the interview I was not asked any questions as they are more welcoming to interviewees who describe themselves as well as their backgrounds and what their goals are. 99% of the interview was detailed with what the expectations were for the position of hire. A week later I did not receive a response but upon checking my application status it showed that the position for which I applied for was filled. Assuming I was no longer in the run, I received an email regarding the management team I met with that they wanted to consider me for the Health Information Tech I position. I agreed to for them to pursue me and she said she’d reach back out. The next day she called and advised that they wanted to extend an offer to me for $13.55/hr. I professionally declined the offer by email as I have medical terminology and health administration background experience already and did not want to be offered at the lowest rate that was not based on degree and/or background experience.", "Interview Questions": "Tell us about yourself."}, {"date": "14 Jan 2019", "title": "Psychometrist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "Two Skype interview followed by in person. Met with the psychologist and medical director. Toured facilities and met referral agents. I was out of state at the time, making Skype the optimal interview medium.", "Interview Questions": "Experience"}, {"date": "22 Aug 2020", "title": "Lab Sys Facilitator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Jan 2019", "Interview Descriptions": "I applied on the company website. Their recruiting Dept called me and ask a few questions. They said they were the. Be forwarding my information to management. I waited about a week and heard nothing. So I went to the hospital and the Dept in which I was looking to get hired. I spoke with the manager and he asked a few questions. Ice back the next day for my interview.", "Interview Questions": "Why do you want to work here? "}, {"date": "12 Feb 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Jan 2019", "Interview Descriptions": "I felt like the hiring process was easy. I applied online,  went in for my interview, and received a reference check email all within the same week. The recruiter reached out to me the next week with a job offer. If you submit your reference checks the same day of receiving the email, I think the process will go a lot faster because thats exactly what I did.", "Interview Questions": "What made you decide to become a Nurse?"}, {"date": "22 Aug 2018", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Aug 2018", "Interview Descriptions": "Multiple Choice spelling test and essay handed for completion before meeting with hiring manager. The interviewer went over the application, inquired about previous work history, experience, and skill sets.", "Interview Questions": "What is the reason you’re leaving your current position at your current employer. "}, {"date": "26 Aug 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in May 2018", "Interview Descriptions": "After submitting my resume, I went for an in-person interview with the director of the department. The discussion was about 20 minutes of looking at my resume and asking basic questions about what was in print. After being hired and working for 2 years in the department, it was very evident the questions were not tailored to the position.", "Interview Questions": "Do you like math much?\n\n"}, {"date": "20 Mar 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA)", "Interview Descriptions": "My interview process was very informal.    I met everyone in the department even though I had not been hired.   Everyone was very friendly and informal.", "Interview Questions": "How much was I expecting to earn?"}], [{"date": "7 Nov 2017", "title": "Buddy Brigade Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Oct 2017", "Interview Descriptions": "Great communication!  Responded quickly with informative email and interview for volunteer program was scheduled within a week!  Interview was friendly and informative.  Second interview has already been scheduled to meet my therapy dog.", "Interview Questions": "What organization is your therapy dog certified?"}, {"date": "18 Oct 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Oct 2017", "Interview Descriptions": "Easy; Good Explanation of Job position. Friendly and Interview time was prompt. Gave me an opportunity to ask any questions. Received feedback on all questions answer. Specific on what they were looking for in an applicant.", "Interview Questions": "What as One question that was asked during the interview?"}, {"date": "31 Jul 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "Applied online. Within a week, HR called me to schedule an interview and was based on my timeframe and availability. I was offered the position informally during my interview, with a formal follow up call one week after with details of position.", "Interview Questions": "What did you learn about CHKD from reading our wesbite?"}, {"date": "24 Jun 2021", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Of The King's Daughters (Newport News, VA) in Jul 2017", "Interview Descriptions": "Mix of general/typical interview questions and some clinical questions. Provided tour of therapy offices. Felt more like a conversation rather than a stressful interview. Interviewed with manager for my therapy discipline.", "Interview Questions": "What types of populations do you enjoy working with?"}, {"date": "13 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in Oct 2016", "Interview Descriptions": "Very easy process. Interview focused more on what I could expect if I decided to accept position. No difficult questions. Interviewer provided a tour of the facility and staff. Offered position by the time I left", "Interview Questions": "Only asked questions about my resume/cv"}, {"date": "26 Nov 2016", "title": "Rehab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Of The King's Daughters (Virginia Beach, VA) in May 2016", "Interview Descriptions": "The supervisor of the Sports Medicine Department interviewed me and he was very friendly. He asked about my schooling and what classes I took related to physical therapy. We also talked about my personal training experience. Then he asked my availability and whether I would be going back to school anytime soon. It was very informal and relaxed.", "Interview Questions": "Why do you want to be a rehab aide here at CHKD?"}, {"date": "2 Feb 2018", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Nov 2015", "Interview Descriptions": "The interview was about 30 minutes with 3 of the managers I would be working for.  It felt more like a conversation than an interview which was a good. They asked me a few  questions but more so told me about the job duties and requirements.", "Interview Questions": "What is your five year goal?"}, {"date": "12 Aug 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Oct 2014", "Interview Descriptions": "I was called to do an interview and was interviewed within a few days onsite. Then I was called a few days later with a job offer and to come in and complete paperwork and take a drug/nicotine test.", "Interview Questions": "I don't remember a specific question but they were all fairly average questions. "}, {"date": "8 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Jun 2013", "Interview Descriptions": "Just went interview. Had to obtain some immunizations along with a physical.  I also had to complete OSHA and CLIAA. The interview process also consist of a drug screening. Also CPR certification.", "Interview Questions": "Why did I become a medical assistant "}, {"date": "20 Jan 2013", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's Hospital Of The King's Daughters", "Interview Descriptions": "HR did a wonderful job setting things up.  The interview was done in a quiet and comfortable are. Felt the interviewers did listen to me.  Felt the employees loved it at CHKD.", "Interview Questions": "N/A"}], [{"date": "3 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Of The King's Daughters (Norfolk, VA) in Jul 2012", "Interview Descriptions": "Submit application online, then was called to come in to meet with Human Resources.  Once that was deemed good to continue, met with the unit manager.  Was offered a job quickly and given a start date.", "Interview Questions": "Describe your past work experiences."}, {"date": "4 Apr 2011", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Children's Hospital Of The King's Daughters (Newport News, VA) in Oct 2009", "Interview Descriptions": "You need to know someone who works with the organization to get in for consideration.", "Interview Questions": "They don't ask a lot of questions. They will give you a tour of the office, even if you do not get the job."}, {"date": "28 Dec 2011", "title": "Clinician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Children's Hospital Of The King's Daughters in Jan 2009", "Interview Descriptions": "I applied hrough Human Resources after calling several times I was granted an interview. I was placed in a small room wth the management team for about an hour. Asked what I could do to help the organization.\r\n The interviewers had a list of questions that they went over.  I was asked a series of questions and based on my answers we continued to other questions.  I felt that the questions were a little to impersonal and did not thoroughly let the interviewee devlve into my character.", "Interview Questions": "Why do you want to work for our organization?"}]]