[[{"date": "8 Jun 2021", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "I applied on the AMITA company website.   Someone emailed me to schedule a phone interview through her online calendar.  I had an initial screening with a recruiter over the phone.  \r\n\r\nThis person seemed very unprofessional.  I had to email her to remind her about our scheduled call - she called me 20 minutes late sounding very frazzled and distracted.  \r\nDuring the call, she was rude, condescending, very short.  Rather than asking me what I might be able to contribute to this job position if hired/what I was open and willing to learn, she was very eager to point out any reason why she thought I was not a good fit for this position.\r\n\r\nIt was very clear to me within the first couple of minutes of talking to this person that this is not a company that I want to work for.", "Interview Questions": "Why do you want to work here?"}, {"date": "16 Mar 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "There were a few short questions about yourself and work ethic and a competency question regarding which patient you would prioritize in a certian situation. Very smooth and done over the phone", "Interview Questions": "What is a good excuse for being late?"}, {"date": "30 Sept 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "Interview was easy, straightforward. Within 1 week I received a call from HR after I submitted my online job application  that was very casual with no interview questions asked. I then met with the hiring manager who was also very easy going but unorganized. She would often jump to other questions without acknowledging them", "Interview Questions": "Why should we hire you?"}, {"date": "3 Dec 2021", "title": "Benefits Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Hospital and Medical Center (Iowa City, IA) in Aug 2020", "Interview Descriptions": "I submitted a resume online and was called in to meet with two HR leaders.  They met with me together for about an hour.  They told me the process would move quickly and I would hear back from them the following week.  Unfortunately, they never called me back and did not take any of my follow up calls.", "Interview Questions": "General questions about my previous jobs and current interests."}, {"date": "28 Jun 2020", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "there are 2 rounds, HR phone call and manager on-site interview round. it was well organized and it went smoothly. Yet it could take a few weeks to hear back the final decisions", "Interview Questions": "do you prefer tech or business analysis"}, {"date": "16 Mar 2020", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "first-round phone talk with HR,\r\nask about your experience as an RN, some general interview question like why choose this hospital, what you want from this position, how do you deal with conflicts, salary expectations. Then you will have an interview with  head nurse", "Interview Questions": "talk about your experience as an RN"}, {"date": "6 Nov 2019", "title": "Clinical Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "In person interview with a tour of the facility, phone interview and HR interview.  Everyone was polite and asked professional questions.  I got a response about one week after the interview.", "Interview Questions": "How much compensation are you looking for?\r\n"}, {"date": "3 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Mercy Hospital and Medical Center (Chicago, IL) in Oct 2019", "Interview Descriptions": "I went to a career fair they held. It was a very easy interview, talked to two different managers. They asked pretty basic questions and it didn't feel like a high pressure situation. It was very relaxed. I got offered a job on the spot.", "Interview Questions": "What does nursing mean to you? "}, {"date": "16 Sept 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "Meet with HR, then meet with your interviewer. Presented certifications and license. It was a comfortable setting. Everyone was very nice and polite. I felt very welcomed. I do wish I was offered a tour, but I was not, so I don’t know how the hospital is set up and what patient rooms look like.", "Interview Questions": "Tell me about yourself\r\nWhy did you decide to become a nurse\r\nWhy this unit"}, {"date": "5 Mar 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Hospital and Medical Center (Aurora, IL)", "Interview Descriptions": "Phone interview with a recruiter going over the position and then my resume one week and the next was with the manager at the hospital on the floor I would be in.", "Interview Questions": "Describe a time when I had difficulty with a coworker. \r\n\r\nAMITA stands for .... describe how you will apply that to your practice. "}], [{"date": "2 Mar 2017", "title": "Registered Nurse Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Mercy Hospital and Medical Center (Chicago, IL)", "Interview Descriptions": "Spoke with HR, and Director. They were straightforward and honest. The interview lasted about 45 minutes. I was informed when a job came up which they were in the process of opening became available I would be called. I was called a few months later.", "Interview Questions": "What reason did you leave your last job?"}, {"date": "27 Sept 2016", "title": "Clinical Pharmacy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Mercy Hospital and Medical Center (Chicago, IL) in Jun 2016", "Interview Descriptions": "I had applied for a PRN position, and the outsourcing employment company reached out to me asking if I would be interested in the Clinical Pharmacy Manager position. After completing the phone interview with the recruiter, I was asked to come in for a face-to-face interview. I met with the current director, who was extremely awkward, unfriendly, and did not answer any of my questions very well. He also sounded as if it was the first time he was looking at my CV. I followed up with the director and recruiter to thank them for the interview, with no response.", "Interview Questions": "What management experience do you have? \r\n\r\nWhat projects have you initiated? \r\n\r\nHow do you measure your performance?"}, {"date": "25 Sept 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mercy Hospital and Medical Center (Chicago, IL) in May 2015", "Interview Descriptions": "I submitted my application online. .  You have to complete a personality assessment after you complete the application. \r\nAfter I was called for an interview it took almost 3 weeks to try to schedule it.  \r\nHR interviewed me then I met with the leader.  I wish the interview was more of a panel interview so I could have gotten a better feel of the organizational culture.  Meeting with one person is risky because you don't necessarily get to see how people interact with each other.   \r\nThe process was almost too easy.", "Interview Questions": "HR asked:  the typical what do you know about the organization.  why do you want to work here. \r\nExecutive I met with asked me one question about my prior experience.  The rest of the time she talked about herself."}, {"date": "4 Sept 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy Hospital and Medical Center (Chicago, IL) in Nov 2014", "Interview Descriptions": "Met with Human resources interviewer and director of the department and manager. Pretty standard procedures. It went fairly smoothly and got a call with a job offer that same day.", "Interview Questions": "Do you know the hospitals mission statement?"}, {"date": "24 Mar 2014", "title": "Clinical Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Mercy Hospital and Medical Center (Chicago, IL)", "Interview Descriptions": "okay, the nurses were nice. But I was a little nervous, because I was interviewed by two nurses.", "Interview Questions": "The questions weren't hard at all."}, {"date": "22 Oct 2015", "title": "Professional Biller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Mercy Hospital and Medical Center (Chicago, IL) in Sept 2013", "Interview Descriptions": "Laid back but must have some familiarity with coding.  Asks questions about the hospital that have nothing to do with the position.  Research the company and its history beforehand.  Would not worry too much about it.", "Interview Questions": "What is your favorite part of the hospital?"}, {"date": "22 Apr 2013", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Hospital and Medical Center", "Interview Descriptions": "There is some time that passes between you submitting your computerized application and being called for an interview. HR dept is small and seem to have difficulty keeping up with all of their responsibilities. Generally first interview is in HR with HR personnel and then if you are to be considered for a position you will be called for a second interview and meet with the direct hiring manager. Mercy generally uses group interviews so be prepared to have a group of your would be peers to ask you questions. These are generally formal questions that are typical of interviews.", "Interview Questions": "Tell us about your weaknesses and strengths. Tell us why we should hire you. Typical behavior questions"}, {"date": "10 Feb 2014", "title": "Emergency Room Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy Hospital and Medical Center (Ardmore, OK) in Mar 2013", "Interview Descriptions": "After submitting an application online, you will be contacted by someone from human resources to come in for an interview with the supervisor(s) of the department you have applied. After you are interviewed, if you are a potential fit for the company, you will be asked to shadow someone in the department you may work in. Then if you are a fit with the other employees, they will send you an official offer letter. Then you will go to new co-worker orientation which is held every other Monday. Then you will start your orientation in the department you will be working in.", "Interview Questions": "Where do you see yourself in 5, 10, 20 years?"}, {"date": "19 Dec 2013", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mercy Hospital and Medical Center (Chicago, IL) in Aug 2009", "Interview Descriptions": "My interview was many, many years ago. So, I don't remeber exactly how the procedure went. However, I do remember thinking that the interview process was not as bad, as I had originally thought it would be. The woman who interviewed me was very nice, and easy to talk too. I remember her asking very basic questions about me, and my experience. I also had the luxury of meeting the manager to the department, in which I was applying. She seemed very freindly, and made me feel at ease with her. I remember that after the interview process, I received a call directly from the manager offering me the position. The time period from the time of the interview, until the time of the actual call I would say took approximately one, week. Another week can be added to that if you would like to include the time I waited for the drug screening as well.", "Interview Questions": "N/A"}]]