[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sinking ship", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 May 2022", "job_title": "Volunteer in Santa Cruz de Tenerife", "duration": "N/A", "pros": "A Small community environment, sometimes", "cons": "No diversity. Long hours. Poor leadership. No transparency. Lack of care for people's time, or the way delays affect people's life plans. HR is so back logged, once your on a ship, all the bells and whistles about member care go out the window. No follow through on promises made to improve. Way to many cooks in the kitchen and nothing gets done. So many wasted resources. No professional growth"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Enjoy a safe environment and a tax-free salary!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "2 Jul 2015", "job_title": "Teacher in Barcelona", "duration": "N/A", "pros": "You have a tax free salary. Also, Saudi Arabia is extremely conservative with guards everywhere, so at least you  feel safe.", "cons": "At work, you feel like you are in a prison. \r\nYou are not allowed to congregate. Expats have no teacher rooms, only cubicles and some offices.\r\nYou have surprise inspections of your records, your classroom, and your office/cubicle. \r\nYou have fingerprint sign in. \r\nYou deal with security guards at every entrance, on every floor, in every building.\r\nYou can be searched.\r\nYou show ID when you come and again when you leave. \r\nYou are moved around campus constantly, every semester.\r\nYour Lead Teacher is your warden. She is the only person you know and have contact with. \r\nYou have no voice and you are punished for contacting people other than your warden/LT.\r\nJust like inmates, your warden has favorites and if you're not one, too bad.\r\nYou get your instructions in an auditorium with your fellow expat inmates, and no questions allowed.\r\nYour mistakes are recorded in a file and your punishments are classified by mistake. More mistakes, worse punishment.\r\nClipboard ladies walk around to make sure you're in your class or cubicle.\r\nYou are divided into cliques by what you look like - black, white or brown. Almost no crossover.\r\nYou come and go on a bus with your fellow \"inmates\". Pushing, shoving, bad language on your bus. \r\nBut at least you are safe!"}], []]