[[{"date": "12 Jan 2022", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Goucher College", "Interview Descriptions": "The interview process was not overly formal and yet professional. I got great communication from faculty about the position I was applying to as well as helpful information from about departmental changes over time and the overall direction of the college.", "Interview Questions": "What technical program experience do you bring to the position?"}, {"date": "1 Sept 2021", "title": "Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Goucher College", "Interview Descriptions": "A great, but comprehensive, interview process consisting of several rounds and interviewing with many prospective future colleagues.  Everyone was very nice.  Higher ed is very collaborative, so get prepared to meet lots of people!", "Interview Questions": "How much writing experience do you have?"}, {"date": "14 Jan 2022", "title": "Compliance and Risk Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Goucher College (Towson, MD) in Sept 2021", "Interview Descriptions": "Team interview of 5-6 individuals who collaborate with the incumbent. Initial session was remote, second interview on campus in person. Supervisor included in initial group session, but separately during second.", "Interview Questions": "Experience with diversity and inclusion work. "}, {"date": "7 Jul 2021", "title": "Post Bac Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Goucher College", "Interview Descriptions": "The interviewer was very malicious and belittling. Despite program credentials, I would not go here. I had several third author papers, and she asked, \"Do you think they would make you a first author in an upcoming paper?\" in the most hateful way possible. Oddly, I had nightmares after my interview.", "Interview Questions": "Do you think they would make you a first author in an upcoming paper?"}, {"date": "11 May 2021", "title": "Videographer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Goucher College", "Interview Descriptions": "Super long interview process. Two rounds of interviews. Both were fairly easy and met with different members of the team.  The questions were exactly the same which was a little odd, didn’t seem like much energy was put into the interview process on their end. Interviews were scheduled two weeks a part and after the final interview there was radio silence for two and half weeks before letting me know the position was offered to another candidate. For such a simple interview process I would’ve appreciated an expedited decision. All-in-all, from first the interview to final decision was a month process.", "Interview Questions": "Tell us about a time when you received negative feedback and how did you apply it."}, {"date": "13 Jan 2021", "title": "Information and Records Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Goucher College", "Interview Descriptions": "There was a phone screening interview  with an assistant director that asked general experience questions. Then two weeks later I was asked to do an additional phone interview. In the phone interview I spoke with the Director who asked questions about experience and interest in the specific position.", "Interview Questions": "What do you know about this position? "}, {"date": "21 Mar 2020", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Goucher College (Towson, MD)", "Interview Descriptions": "On the one hand, the interview process was relatively swift and effortless, and certain people with whom I interacted appeared to be pleasant and affirming.  The campus also is compact, relatively nice and accessible.\r\n\r\nConversely, the interview schedule was disjointed (I am used to having all committee members in one room, as opposed to meeting with them separately) and lunch consisted of a formal interview in a public dining room instead of a relaxed conversation that would have allowed me to eat the food in front of me.  Moreover, my presentation entailed providing short responses to questions that I had been asked during previous sessions.  \r\n\r\nFinally, I had the misfortune of interacting with the person to whom I would have reported via a video call.  She had just been hired but was slated to start later in the year and had reportedly posted a link to the job for which I was interviewing on her LinkedIn page the day before my campus visit.  Despite the senior role that she would occupy at Goucher College, this person was quite condescending and obnoxious (microaggression personified?); she denigrated my references, wanted to know why a former supervisor had not been listed (I deliberately chose individuals with whom I had worked at liberal arts colleges, as the only supervisor relevant to the role had retired) and blithely dismissed my candidacy because I did not belong to a professional association of which she apparently is an active member.  Her tone was insulting and accusatory, and when she was done, the boss-in-waiting abruptly ended the call.\r\n\r\nMy time at Goucher was bewildering to say the least, and the lack of clarity regarding simple questions that I posed, the bizarre interview schedule, my interesting interaction with the boss-in-waiting, lack of intentional staff diversity and issues regarding the institution’s fiscal health were warning signs that I could not ignore.", "Interview Questions": "Why are you interested in working at Goucher?"}, {"date": "7 Jan 2020", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Goucher College", "Interview Descriptions": "There was a phone conversation with an assistant director that lasted about 30 minutes. After the phone interview, there was a panel interview with the financial aid office. Each member of the office asked a question.", "Interview Questions": "Why did you choose Goucher?"}, {"date": "9 Jun 2017", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Goucher College", "Interview Descriptions": "Applied online process total 2 months two interviews. Human resources staff and department staff very professional and nice.  Sat with three people, second interview same. Basically the same questions asked both interviews.", "Interview Questions": "What do you know about Goucher College?"}, {"date": "19 Nov 2016", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Goucher College (Baltimore, MD)", "Interview Descriptions": "Very easy interview process. I introduced myself to the man in charge and built a personal relationship with him over time, at which point he was more than willing to offer me a position. I went in for an interview and he hired me based solely on the fact that I arrived wearing a suit. He then asked for my availability. That was it.", "Interview Questions": "What's your availability"}], [{"date": "19 Jan 2016", "title": "Coordinator/Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Goucher College (Baltimore, MD)", "Interview Descriptions": "Very thorough interview process. Initially received a call from an HR Associate who told me about the pay and benefits to see if I was still interested. From there I scheduled my in person interview which was a 4 hour, on campus interview that included 3 rounds of panels. The first was with the staff I would be directly working with, the next was and open session where the constituents I would be working with could come and pseduo-interview me, and then ended with a meeting the head of HR to go over benefits, pay, and any other employment-related details further. From there I had a 3rd follow up phone interview with my direct report and the head of HR once more to confirm further details.", "Interview Questions": "General questions, nothing too rigorous. Most of it dealt with how I would lead the program and institute the changes that needed to be made as well as create policies and procedures."}, {"date": "16 Apr 2018", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Goucher College in Aug 2014", "Interview Descriptions": "There was a Group Interview, and then Individual interview with 2 people from the Admissions office. One was a current Ambassador, and the other was an Admissions advisor. It went fairly well, and it was my dream job on campus since before I attended.", "Interview Questions": "Why do you want to be an ambassador?"}, {"date": "25 Sept 2015", "title": "Test Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Goucher College (Baltimore, MD) in Jan 2014", "Interview Descriptions": "they brought me in and interviewed me but in general it wasnt' the hardest thing, everyone was really nice and I can't think of anything bad to say other than It's hard balancing work sometimes with school\r\n\r\n interviewed me but in general it wasnt' the hardest thing, everyone was really nice and I can't think of anything bad to say other than\r\n interviewed me but in general it wasnt' the hardest thing, everyone was really nice and I can't think of anything bad to say other", "Interview Questions": "What&#039;s your experience?"}, {"date": "22 Sept 2015", "title": "Assistant Controller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Goucher College (Towson, MD) in Apr 2011", "Interview Descriptions": "Several interviews took place. Initial interview with the controller, then with the Director and the HR Director. Then the staff interviewed to you. If an offer was made you had another meeting with the HR Director.", "Interview Questions": "Explain some of your working experience"}, {"date": "7 Jan 2014", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Goucher College (Towson, MD) in Jul 2010", "Interview Descriptions": "Faculty positions are listed on job boards, applications are submitted electronically, notifications are sent for phone interview for initial interview, follow up with in person interview with search committee members, Provost, students and college President. A job talk is required along with lunch or dinner with key members of the department.", "Interview Questions": "The most difficult question is what is your pedagogical approach to teaching in this discipline?"}, {"date": "5 Feb 2010", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Goucher College (Towson, MD) in Jun 2009", "Interview Descriptions": "Submitted resume and cover letter online.  Received a phone call to schedule an interview about two weeks later.  Arrived for the interview and was led into a conference room.  A panel of 4 women interviewed me.  Each person asked several questions in turn.  I also was able to ask questions to them.  Interview lasted about 45 minutes.  About 1 week later I received a phone call saying I did not get the job.", "Interview Questions": "Why are you the best candidate for the job?"}, {"date": "6 Nov 2012", "title": "Marketing Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Goucher College (Baltimore, MD) in Mar 2008", "Interview Descriptions": "Many, many meetings filled with politics. Incredibly invasive and nit picking process for what turned out to be a low level job (though it wasn't billed as such) drawn out for months. Not very nice interviewers.", "Interview Questions": "N/A"}]]