[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Feb 2019", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "Strong mission and vision\nPassionate team of people\nExcellent board of directors\nEquipped with required funding to grow", "cons": "None! It’s honestly one of the best workplaces!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Do not work here!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Jan 2023", "job_title": "Services in Calgary, AB", "duration": "N/A", "pros": "As a non-profit the mission of the organization is going towards the greater good which makes it fulfilling to work here and they do help people so many people and making a difference. It's an inclusive workforce for sure. Plus the employees (not leadership or the CEO) are genuinely talented and amazing people.", "cons": "This is the classic boomer workplace that thinks they can solve issues with \"let's throw a pizza party!\"... I'm serious. \r\n\r\nThe culture is absolutely terrible. First and foremost, the CEO and senior leadership do not care about work life balance. They go back on their promises. They are beyond fake. They force \"in person culture\" and set their own narratives that are completely toxic. I've seen people cry, scream, & storm out many times.\r\n\r\nRead the negative reviews on this page about the company, we are all saying the same thing. Horrible culture. Bad leadership. Not listening to employees. Losing half the workforce every other year."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great experience, learned a lot.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Mar 2021", "job_title": "Manager in Calgary, AB", "duration": "N/A", "pros": "Nice people, good pay, good benefits. The work is meaningful.", "cons": "Weak CEO and no accountability across leadership team. A group of untouchables. Leading by fear, no transparency."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Missed potential", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jul 2019", "job_title": "Anonymous Employee in Calgary, AB", "duration": "N/A", "pros": "Brilliant, inspiring staff. It's an amazing place to work alongside such talented and smart people. Everyone really cares and puts their all into everything they do.", "cons": "Management and executives don't know how to manage people and fully utilize what staff are offering to the mission. Management and staff don't trust each other and there is a loss of credibility of management that happens in cycles - the longer you are there, the more cycles you experience. I see the positive reviews written by \"current\" staff, and I think they are written by new staff who have not yet been through the wringer a few times. It'll come in various excuses from Management (staff don't have the full picture, etc), but it's not true; staff just get trained not to trust themselves. The lost potential breaks your heart after awhile. If only CAWST actually was what they say they are - a constantly learning organization. It hurts to say it, but they are not learning at all, and it's because of management."}], [], []]