[[{"date": "5 Mar 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Northern Colorado (Greeley, CO) in Jan 2023", "Interview Descriptions": "Very thorough interview process to help both the candidate and employer to determine if candidate is a good fit for the job. First round interview consisted of 30min video call and then 2nd round in-person interview for a full day on campus.", "Interview Questions": "Tell us about your experience in generating revenue from internal and external funding sources within the U.S. higher education context. Please give a detailed example."}, {"date": "26 Sept 2022", "title": "Junior Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Northern Colorado (Denver, CO) in Sept 2022", "Interview Descriptions": "Really unorganized interview that focused on small Google-able details over real world skill. I wasn't asked enough about my projects or skillset. Most of the things in the qualifications list for the role weren't even discussed. I was given guidelines ahead of time about what the interviewer would be looking for by a recruiter, and none of that was actually asked or covered. They are hiring for a junior role but seemingly want mid level output for junior pay. Please just talk to your interviewee like a person and discuss experience rather than grilling them on buzzwords. Disappointed but I think I dodged a bullet.", "Interview Questions": "What are the pros and cons of a grid vs flexbox?"}, {"date": "19 Aug 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Northern Colorado in Jul 2022", "Interview Descriptions": "I applied online with a cover letter and resume. It was a typical rigorous application process like for most higher ed jobs. \n\nDid an audio interview over Zoom with a three person panel for about 20 minutes. \n\nReceived rejection shortly after.", "Interview Questions": "Why are you interested in the Instructional Designer position with IDD at UNC?\n"}, {"date": "9 Jul 2021", "title": "Retention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Northern Colorado (Loveland, CO) in Jun 2021", "Interview Descriptions": "I interviewed for a position with the Extended Campus and made it as a finalist without receiving the position. The staff who interviewed me were so kind, caring, and ensured that I was fit for a role regardless of my status with this specific position. Great people in that department.", "Interview Questions": "N/A"}, {"date": "18 Feb 2021", "title": "Campus Tourguide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Northern Colorado", "Interview Descriptions": "Very impressed with the enthusiasm of the staff. Very lively and interpersonal people. In depth questions relating to the job itself. Would highly reccomend trying an interview with them woowhoo", "Interview Questions": "How does your previous roles help in this one"}, {"date": "7 Jul 2019", "title": "Director of Administration and Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Northern Colorado", "Interview Descriptions": "I was texted by the manager asking if I wanted to interview then had a phone interview and a skype interview. The skype interview involved 2 people from the staff both of which didn't pay much attention to me. One was late to the interview and then was on their phone most of the time and the other was on their computer. The questions that I was asked were intense and no matter what I said I could tell they didn't care and were not interested. I ended up getting an email at 12:30 in the morning a week later saying I'd be better off volunteering.", "Interview Questions": "I was read a passage from an author and then asked what my energy level  is based off that author."}, {"date": "18 Sept 2020", "title": "Assistant Vice President of Marketing and Communication Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Northern Colorado (Colorado Springs, CO) in Jan 2019", "Interview Descriptions": "I had a phone interview with a recruiter. The recruiter was very informed about UNC and was very encouraging about my candidacy. The timeline to make the cut for the first round of interviews was very short.", "Interview Questions": "What interested you in this position?\r\nWhat are your strengths and weaknesses for this position?"}, {"date": "6 Feb 2019", "title": "Athletics Compliance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Northern Colorado (Greeley, CO) in Dec 2018", "Interview Descriptions": "The interview process was quick and straight forward but ultimately a complete waste of my time. They ended up hiring a significantly less experienced candidate with less education who had been there previously.", "Interview Questions": "What would you like to accomplish in the first month, first three months?"}, {"date": "14 Oct 2018", "title": "DieteticSupervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Northern Colorado (Greeley, CO) in Mar 2018", "Interview Descriptions": "I had a series of interviews beginning with a phone screen. Then I interviewed with a full panel over the phone. My references were checked after the phone interview, despite sending in the requested letters of reference. Finally, I had a day-long interview and audition. It immediately started with a rapid fire interview session with 4 employees, followed by teaching a class on fat soluble vitamins, followed by interviews with various dept. heads, and finally gave a presentation to the decision-makers on how I would do my job. After all that, I never heard back from the job. I followed up a month later and they told me they forgot to contact me but they went with the other candidate.  I was given about 2 weeks during my own dietetic internship to prep, while the other candidate had 2 months.  This was for a part-time position for very low pay and  the benefits would have cost me 25% of my paycheck.", "Interview Questions": "Name a time when you had to give a negative performance review to an employee. "}, {"date": "17 Oct 2017", "title": "Finance Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Northern Colorado", "Interview Descriptions": "Had to be recommended by professor then interviewed with the tutoring office. Had all behavioral questions, was super easy. Met for training a couple weeks later. After this was able to start tutoring.", "Interview Questions": "Behavioral questions"}], [{"date": "5 Mar 2017", "title": "IT Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Northern Colorado", "Interview Descriptions": "The process was quick enough. I got several red flags during my interview that likely would have discouraged me from accepting an offer had one been extended. The hiring manager seemed inept and unprepared. Getting a rejection letter in the mail from an IT department struck me as outdated and misguided.", "Interview Questions": "Tell us about your most recent performance evaluation. "}, {"date": "3 Sept 2016", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Northern Colorado (Greeley, CO)", "Interview Descriptions": "I got the chance to be interviewed by a team supervisor and the department head. Both were nice and professional. I got lots of technical questions along with some scenarios on how to handle it. All in all the interview went very well.", "Interview Questions": "What's your weakness?"}, {"date": "14 Jul 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Northern Colorado (Greeley, CO) in Jul 2016", "Interview Descriptions": "It was very private and personal. Very friendly and objective. Helpful and understanding. I felt very comfortable and my interviewer took a lot of time to go over everything with me. Also it was the fastest process I have ever experienced.", "Interview Questions": "Tell me about a negative experience you once had and how you handled it!"}, {"date": "12 Apr 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Northern Colorado", "Interview Descriptions": "Pretty Easy, Submitted Application and ten was asked to come for an interview either in-person or over Skype had an offer made a couple weeks later. Questions were pretty standard and easy, they tend to be pretty specific to the position so make sure you have read the job description to prepare.", "Interview Questions": "Why are you interested in this position?\r\nDescribe you management philosophy?\r\nHow would you handle a staff member who was not meeting their job requirements?"}, {"date": "8 Apr 2016", "title": "Adjunct Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Northern Colorado", "Interview Descriptions": "Outside of the position I am currently in, another position I applied for was similar to many others with the exception that during the initial phases of the employment application there was a requirement for a statement of research interests. When moving on toward the interview, I was chastised (and disqualified) for the position based on my discussion of research items on my statement of research interests, when the department specifically was looking for a lecturer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jul 2017", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Northern Colorado (Greeley, CO) in Feb 2016", "Interview Descriptions": "The process was Delightful, the faculty were engaging,  the interviews were comprehensive, the leadership was transparent -- yet there is a disconnect at the university level. They aren't exactly sure where they are headed or lack the confidence to achieve greatness. Individually, the people would not have been any better, but as an institution there was a lack of ambition to work together, make decisions together, and go for the gold.", "Interview Questions": "How I could make their program better"}, {"date": "24 Aug 2016", "title": "Intramural Sports Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at University of Northern Colorado in Apr 2015", "Interview Descriptions": "You'll meet with the director, the graduate assistant and some older staff members. You apply online and then show up for the appointment that you've made. It wasn't super formal, mostly because of the laid-back work environment.", "Interview Questions": "Lots of emergency scenarios, rule enforcement, and field use questions."}, {"date": "7 Apr 2015", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Northern Colorado (Greeley, CO) in Mar 2014", "Interview Descriptions": "I did a phone interview, and then three and a half hours of in-person interviews with various constituents. There were long gaps between stages but the follow up after each stage was quick. I did a phone interview, and then three and a half hours of in-person interviews with various constituents. There were long gaps between stages but the follow up after each stage was quick.", "Interview Questions": "What are your key skills?"}, {"date": "22 Feb 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Northern Colorado", "Interview Descriptions": "Students are trained with a course on how to teach college students in the educational psychology department.  Those who are ed psych students typically have first priority in teaching psychology courses.", "Interview Questions": "What is your personal teaching philosophy?"}, {"date": "10 Jul 2015", "title": "Res Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Northern Colorado (Greeley, CO) in May 2011", "Interview Descriptions": "Comical - Apply online. Must have grades etc. Talk with 2 current RAs and a HD. They ask hilarious questions about your appreciation for culture etc. Not \"can you do this job?\" \r\n\r\nAs long as you're a good person, and you actually show sincere interest, you have a good shot.", "Interview Questions": "Do you know anyone that is gay? How do you handle that? (No joke, that is how they worded it)"}], [{"date": "18 Jan 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Northern Colorado (Greeley, CO) in Mar 2010", "Interview Descriptions": "Was strange. The guy called me and bragged about his own achievements.", "Interview Questions": "How do you use technology in the classroom?"}]]