[[{"date": "29 Apr 2023", "title": "Student Life Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "Phone screening Interview with hiring manager Performance Task Team Interview Final Interview Reference check What I noticed was a mix of folks who are on the direct team and who are at the national level doing the interviews. Each interview lasted about an hour. I was also interviewed by students, not sure if that happens at every center.", "Interview Questions": "What’s one thing your supervisor would say your good at and an area of growth"}, {"date": "21 Apr 2023", "title": "Finance Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at College Track in Feb 2023", "Interview Descriptions": "I had a series of interviews. The HR and CFO was friendly. A strange interview. I was told I got rejected because I came across as too result driven. Ummm, how is that a bad thing?", "Interview Questions": "How do you show authenticity?"}, {"date": "28 Nov 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "They asked the same three questions asked about previous three jobs. It was difficult to get a sense of their values or share meaningful examples. The questions were a regurgitation of my resume.", "Interview Questions": "What were your roles and responsibilities?"}, {"date": "4 Nov 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "The prices was nice and they asked relevant questions. Interviewers made you feel welcomed. Everything seemed simple and easy to understand. They explained more about the job and duties and tasks.", "Interview Questions": "What is your experience working with youth?"}, {"date": "12 Oct 2022", "title": "Student Life Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Track (Washington, DC) in Jun 2022", "Interview Descriptions": "Standard interview process however there was some confusion regarding scheduling. I was tentatively scheduled for a next round interview only to be told a couple days later that they weren’t moving forward with my application. Got my hopes up for no reason.", "Interview Questions": "Commitment to DEI as it relates to the role and org mission"}, {"date": "3 Feb 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at College Track", "Interview Descriptions": "The interview was prompt and thorough. Many steps but just listen to the interviewer and you will do great. It was a group interview and they made us do lessons and challenges to complete within a timeframe.", "Interview Questions": "How would you go about helping a student if you didn’t know the answer?"}, {"date": "30 Nov 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "Applied online and was contacted by College Track's 3rd party talent sourcer.\n\nI cannot recall in any prior interviewing experience being invited to interview to be told that the hiring managers likely wouldn't consider my lack of experience.\n\nDespite having over 5 years' recent C-level support experience and additional 5  years' in other administrative roles, when I asked what stood out on my resume to invite me to interview, she responded that she interviews everyone.\n\nI felt like the interview was an interrogation, she was extremely rude and condescending.\n\nShe kept asking me the same questions. \nWhy do you want to be an EA? ( I have established this as a career many years ago)\n\nWhat makes you think you'll continue being an EA?\n\nBut do you think you want to be an EA in the long term?\n\nIn referring back to a position, I held over 10  years ago at the start of my administrative career, she asked what makes you think you won’t go back to being in \"previous industry\"?  (irrelevant question)\n\nI was excited about the position until I spoke with this person--who really shouldn't be conducting them. I emailed her a few days later and withdrew.", "Interview Questions": "What makes you think you'll continue being an EA?\n\nBut do you think you want to be an EA in the long term?"}, {"date": "4 Oct 2021", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "The team there was knowledgeable, thorough, and courteous, though they took some time to schedule and follow up. Overall it was an okay experience. I would have appreciated feedback with regard to why I was not hired.", "Interview Questions": "What would I do to foster press placement?"}, {"date": "19 Jul 2022", "title": "Academic Affairs Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track in Sept 2021", "Interview Descriptions": "it is a very comprehensive process with 5-6 rounds, meeting with directors, site director,  national director, colleagues, students, performance task survey. The  questions are stock interview questions some of which are somewhat strange. Interview is very casual.", "Interview Questions": "what are your weaknesses?\r\nwhat are your strength?\r\ndescribe a time when you dealt with a difficult situation.\r\n"}, {"date": "24 Jul 2021", "title": "Academic Affairs Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at College Track", "Interview Descriptions": "I started with a one-hour long phone interview with the Academic Affairs Director. She let me know during this interview that she would like to invite me for a second interview. The second interview was with her and the Academic Affairs National Director. It was about an hour, and they mostly asked questions about my professional experience.", "Interview Questions": "What grade would you give your supervisors and why?\nWhat caused you to leave your previous place of employment?"}], [{"date": "25 Mar 2021", "title": "College Completion Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "Three rounds of interviews. \n1. Phone interview with their hiring consultant\n2.  Take home assignment + 1hour interview with Director\n3. Final interview: 3 sections (With team, With Directors, Lastly with Students)", "Interview Questions": "\nStructure of Final Interview: \n60 minutes- Interview with Team\n30 minutes- Performance Task Review with members of the  Team\n30 minutes- Student Panel\n15 minutes- Break\n60 minutes-Interview with College Completion Director & Site Director"}, {"date": "13 Mar 2021", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at College Track (San Francisco, CA)", "Interview Descriptions": "Applied when I was 47 (a while back)  and was told, well it takes a lot of energy... I shared that I had a lot of energy - i did triathlons.  Her response. \"um, k\" It became a sort of conversation where I began to get the message that I had to prove to her that I was physically able enough. It felt super weird. Since I had moved to LA and was contemplating coming back to SF, she went on to say that I wasn't aware of the level of traffic, and busy-ness of the City.   She made it clear that she thought I just could not handle having energy or a city (though I was in L.A.) It was just weird.  It was 100% clear that she just thought I was too old to do the job.  Super weird experience.  Oh well, went on to run four divisions of a school in the middle east, my own nonprofit and ran a 5k to boot.  Had just been looking for an interim gig to contribute while I was in the US. I was very qualified.  I have never had an experience like that before or since.", "Interview Questions": "see above.  the interview level of difficulty based on the odd, ageist approach, not the content"}, {"date": "28 Feb 2021", "title": "College Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "First there was a phone call, then a video interview where you stimulate a weekly coaching call where other coaches pretend to be students. There was a lack of consistency with instruction. the email said I had x amount of time the interviewer said completely different instructions. Based on that, I was not able to move forward (Because I followed their instruction) there is another phone interview with a higher up but that did not matter, as I was rejected because of the 2nd stage.", "Interview Questions": "What would you do if students were not engaged. "}, {"date": "3 Feb 2021", "title": "Site Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track (Oakland, CA)", "Interview Descriptions": "1-2 phone interviews followed by 1-2 on-site interviews; final portion was a more in-depth on-site to assess “fit”. Overall, it was fine, but communication was disorganized, questions didn’t really address competencies of the position, and more than 1 interviewer was very unprepared.", "Interview Questions": "How do you handle issues of equity and belonging in the workplace."}, {"date": "16 Sept 2020", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "I applied online on the website. I was reached out by a recruiter for a phone screening. I received an email from the company to complete a performance task. Afterward, i was invited in for an in-person interview.", "Interview Questions": "What do you hope to get out of this role?"}, {"date": "13 Jul 2020", "title": "College Completion Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "The process was pretty straightforward. I applied online and heard back within a couple of weeks to schedule a zoom call. I was on the call with two members of HR. We spoke for about 1 hour (45 minutes alotted). At the end of the call I was told I would be sent assessment materials by end of week or Monday of the next week. I followed up after the call, but heard nothing back for over 3 weeks, at which point I received an automated (not personalized) email saying the process was over).", "Interview Questions": "Mostly asking about past experience."}, {"date": "25 Oct 2019", "title": "Director of Academic Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "The initial in-person interview was informative and it provided a tour of the site. However, the first outreach emails regarding interviewing lacked detail and to be quite honest, professionalism. The following take-home assignment was disorganized, disconnected, and had broken links. It was framed as a data project but contained absolutely no data to work from or touched on using data in the least. After reaching out about the broken links and being told they weren't needed, which was likely untrue, I attempted the assignment anyway, providing extensive detail and what data points would support the project. If the take-home was any indication of how the team and site were run, then they are in need of some serious attention to detail. I never heard back after completing the assignment, which again is unprofessional considering that I was ton I was one of 7 candidates being considered out of 200+ applicants. I had also been asked to participate in the next round of interviews at my initial interview but got zero follow up.", "Interview Questions": "N/A"}, {"date": "17 Mar 2020", "title": "Academic Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at College Track (Aurora, CO) in Jul 2019", "Interview Descriptions": "1-1 interview, followed by panel interview, and then another 1-1 with the regional director. Between the 2nd and 3rd interview, will be asked to complete a performance task. Two days before your start date, you may get a call putting your start date on hold. But, you'll also probably never have a start date...", "Interview Questions": "You'll walk through your work experiences and highlight how they're applicable to the position you're applying to. "}, {"date": "12 Jun 2019", "title": "Operations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at College Track (Suitland, MD) in May 2019", "Interview Descriptions": "I had to complete a 1-question scenario-based assessment. Afterward, I was scheduled for an hour interview with the manager. It was a panel interview, which was fine with me. However, one of the individuals in the panel was rude and lackluster. She didn’t even give me the chance to elaborate on my knowledge and skills, and gave me strange looks. I did not feel I was overqualified for the position. The interview was less than 30 minutes, which was disappointing and somewhat insulting for the type of position I applied to. The manager in the panel promised she would follow-up with me. It’s been more than 3 weeks, and I got no response. The manager went ghost, and did not provide me an update. No response “IS” a response. If they leave candidates hanging dry like this, they will do the same to employees on the job. Candidates beware of their lack of communication and rude/lackluster panelist.", "Interview Questions": "Tell me about a time you made a mistake. How did you handle it."}, {"date": "11 May 2020", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at College Track (San Francisco, CA) in Nov 2018", "Interview Descriptions": "I applied online and was scheduled for a 30 minute phone interview. I was told that I would hear back about next steps in about a week and never heard back. I received an automated rejection message from their system months later. Very disorganized and unprofessional.", "Interview Questions": "Why do you want to work here? "}], [{"date": "27 Nov 2018", "title": "Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Track (Watts, CA) in Jul 2018", "Interview Descriptions": "(1) Send in resume/cv to the appropriate department director\r\n(2) If you move forward, the director invites you for a video conferencing interview (~30 minutes)\r\n(3) If you move forward, the director sends you some data about their fiscal year (attendance, ACT scores, grades, possible scenarios with students - both good and bad). They ask you to respond to some questions about the information and create a lesson plan for a 30 minute session within 3 business days. \r\n(4) If you move forward, you are invited for an on-site interview and a 20 minute demo-lesson.\r\n(5) Job offer!", "Interview Questions": "What would people say is the most difficult thing about working with you?"}, {"date": "15 Sept 2018", "title": "Site Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at College Track (New York, NY) in Jul 2018", "Interview Descriptions": "Submitted Resume and emailed some 3 weeks later by recruiting firm to have a 10 min. introductory conversation.  I was invited for a more in-depth 20 minute interview by recruitment firm owner.  Interview was collegial and professional.  Recruiter was honest that they already had a lead candidate who was assigned a \"project\" but that he would be back to me in the next few weeks if I was to be called for a next step.", "Interview Questions": "Background Inquiry as to how it relates to position applied for."}, {"date": "16 Jan 2018", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track (Hutto, TX)", "Interview Descriptions": "Came to interview arriving on time.  I was asked to wait a moment for the office manager.  Then I was asked to come into her office. She was a nice lady and treated me with respect asking appropriate questions. I was pleased.", "Interview Questions": "What do you have to contribute to this company?"}, {"date": "24 Jul 2019", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Track (Suitland, MD) in Apr 2018", "Interview Descriptions": "Phone interview \r\nIn person - Met with three people. The manager, recruiter and founding director. They asked questions in relation to my experience and how I would handle certain task on the job. Very comfortable environment", "Interview Questions": "Describe a time where you inspired someone to do better?"}, {"date": "24 Feb 2016", "title": "College Completion Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at College Track (Oakland, CA)", "Interview Descriptions": "I applied online and was then emailed to do a phone/Google Hangout interview.  The questions were simple and easy.  After the interview, the hiring consultant based in Oakland said I would be contacted within a week to see if I was moving forward in this position or not.  I was not notified.  In fact, I had to reach out to find out that I was no longer being considered.  I don't mind not going forward but I do mind when hiring managers do not follow up on their own time lines.  \r\n\r\nOutside of that the interview itself was informative and Hee Won was pleasant.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "11 Nov 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at College Track (New Orleans, LA) in Sept 2015", "Interview Descriptions": "I applied for another job and was asked if I would consider another position that was full time. I said yes and interviewed for it. The interviewer looked at my resume and asked general interview questions. It was very simple and easy. I was offered the job and started the paperwork.", "Interview Questions": "What makes you want to work at College Track."}]][[{"date": "29 Apr 2023", "title": "Student Life Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "Phone screening Interview with hiring manager Performance Task Team Interview Final Interview Reference check What I noticed was a mix of folks who are on the direct team and who are at the national level doing the interviews. Each interview lasted about an hour. I was also interviewed by students, not sure if that happens at every center.", "Interview Questions": "What’s one thing your supervisor would say your good at and an area of growth"}, {"date": "21 Apr 2023", "title": "Finance Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at College Track in Feb 2023", "Interview Descriptions": "I had a series of interviews. The HR and CFO was friendly. A strange interview. I was told I got rejected because I came across as too result driven. Ummm, how is that a bad thing?", "Interview Questions": "How do you show authenticity?"}, {"date": "28 Nov 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "They asked the same three questions asked about previous three jobs. It was difficult to get a sense of their values or share meaningful examples. The questions were a regurgitation of my resume.", "Interview Questions": "What were your roles and responsibilities?"}, {"date": "4 Nov 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "The prices was nice and they asked relevant questions. Interviewers made you feel welcomed. Everything seemed simple and easy to understand. They explained more about the job and duties and tasks.", "Interview Questions": "What is your experience working with youth?"}, {"date": "12 Oct 2022", "title": "Student Life Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Track (Washington, DC) in Jun 2022", "Interview Descriptions": "Standard interview process however there was some confusion regarding scheduling. I was tentatively scheduled for a next round interview only to be told a couple days later that they weren’t moving forward with my application. Got my hopes up for no reason.", "Interview Questions": "Commitment to DEI as it relates to the role and org mission"}, {"date": "3 Feb 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at College Track", "Interview Descriptions": "The interview was prompt and thorough. Many steps but just listen to the interviewer and you will do great. It was a group interview and they made us do lessons and challenges to complete within a timeframe.", "Interview Questions": "How would you go about helping a student if you didn’t know the answer?"}, {"date": "30 Nov 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "Applied online and was contacted by College Track's 3rd party talent sourcer.\n\nI cannot recall in any prior interviewing experience being invited to interview to be told that the hiring managers likely wouldn't consider my lack of experience.\n\nDespite having over 5 years' recent C-level support experience and additional 5  years' in other administrative roles, when I asked what stood out on my resume to invite me to interview, she responded that she interviews everyone.\n\nI felt like the interview was an interrogation, she was extremely rude and condescending.\n\nShe kept asking me the same questions. \nWhy do you want to be an EA? ( I have established this as a career many years ago)\n\nWhat makes you think you'll continue being an EA?\n\nBut do you think you want to be an EA in the long term?\n\nIn referring back to a position, I held over 10  years ago at the start of my administrative career, she asked what makes you think you won’t go back to being in \"previous industry\"?  (irrelevant question)\n\nI was excited about the position until I spoke with this person--who really shouldn't be conducting them. I emailed her a few days later and withdrew.", "Interview Questions": "What makes you think you'll continue being an EA?\n\nBut do you think you want to be an EA in the long term?"}, {"date": "4 Oct 2021", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "The team there was knowledgeable, thorough, and courteous, though they took some time to schedule and follow up. Overall it was an okay experience. I would have appreciated feedback with regard to why I was not hired.", "Interview Questions": "What would I do to foster press placement?"}, {"date": "19 Jul 2022", "title": "Academic Affairs Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track in Sept 2021", "Interview Descriptions": "it is a very comprehensive process with 5-6 rounds, meeting with directors, site director,  national director, colleagues, students, performance task survey. The  questions are stock interview questions some of which are somewhat strange. Interview is very casual.", "Interview Questions": "what are your weaknesses?\r\nwhat are your strength?\r\ndescribe a time when you dealt with a difficult situation.\r\n"}, {"date": "24 Jul 2021", "title": "Academic Affairs Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at College Track", "Interview Descriptions": "I started with a one-hour long phone interview with the Academic Affairs Director. She let me know during this interview that she would like to invite me for a second interview. The second interview was with her and the Academic Affairs National Director. It was about an hour, and they mostly asked questions about my professional experience.", "Interview Questions": "What grade would you give your supervisors and why?\nWhat caused you to leave your previous place of employment?"}], [{"date": "25 Mar 2021", "title": "College Completion Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "Three rounds of interviews. \n1. Phone interview with their hiring consultant\n2.  Take home assignment + 1hour interview with Director\n3. Final interview: 3 sections (With team, With Directors, Lastly with Students)", "Interview Questions": "\nStructure of Final Interview: \n60 minutes- Interview with Team\n30 minutes- Performance Task Review with members of the  Team\n30 minutes- Student Panel\n15 minutes- Break\n60 minutes-Interview with College Completion Director & Site Director"}, {"date": "13 Mar 2021", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at College Track (San Francisco, CA)", "Interview Descriptions": "Applied when I was 47 (a while back)  and was told, well it takes a lot of energy... I shared that I had a lot of energy - i did triathlons.  Her response. \"um, k\" It became a sort of conversation where I began to get the message that I had to prove to her that I was physically able enough. It felt super weird. Since I had moved to LA and was contemplating coming back to SF, she went on to say that I wasn't aware of the level of traffic, and busy-ness of the City.   She made it clear that she thought I just could not handle having energy or a city (though I was in L.A.) It was just weird.  It was 100% clear that she just thought I was too old to do the job.  Super weird experience.  Oh well, went on to run four divisions of a school in the middle east, my own nonprofit and ran a 5k to boot.  Had just been looking for an interim gig to contribute while I was in the US. I was very qualified.  I have never had an experience like that before or since.", "Interview Questions": "see above.  the interview level of difficulty based on the odd, ageist approach, not the content"}, {"date": "28 Feb 2021", "title": "College Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "First there was a phone call, then a video interview where you stimulate a weekly coaching call where other coaches pretend to be students. There was a lack of consistency with instruction. the email said I had x amount of time the interviewer said completely different instructions. Based on that, I was not able to move forward (Because I followed their instruction) there is another phone interview with a higher up but that did not matter, as I was rejected because of the 2nd stage.", "Interview Questions": "What would you do if students were not engaged. "}, {"date": "3 Feb 2021", "title": "Site Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track (Oakland, CA)", "Interview Descriptions": "1-2 phone interviews followed by 1-2 on-site interviews; final portion was a more in-depth on-site to assess “fit”. Overall, it was fine, but communication was disorganized, questions didn’t really address competencies of the position, and more than 1 interviewer was very unprepared.", "Interview Questions": "How do you handle issues of equity and belonging in the workplace."}, {"date": "16 Sept 2020", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track", "Interview Descriptions": "I applied online on the website. I was reached out by a recruiter for a phone screening. I received an email from the company to complete a performance task. Afterward, i was invited in for an in-person interview.", "Interview Questions": "What do you hope to get out of this role?"}, {"date": "13 Jul 2020", "title": "College Completion Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "The process was pretty straightforward. I applied online and heard back within a couple of weeks to schedule a zoom call. I was on the call with two members of HR. We spoke for about 1 hour (45 minutes alotted). At the end of the call I was told I would be sent assessment materials by end of week or Monday of the next week. I followed up after the call, but heard nothing back for over 3 weeks, at which point I received an automated (not personalized) email saying the process was over).", "Interview Questions": "Mostly asking about past experience."}, {"date": "25 Oct 2019", "title": "Director of Academic Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Track", "Interview Descriptions": "The initial in-person interview was informative and it provided a tour of the site. However, the first outreach emails regarding interviewing lacked detail and to be quite honest, professionalism. The following take-home assignment was disorganized, disconnected, and had broken links. It was framed as a data project but contained absolutely no data to work from or touched on using data in the least. After reaching out about the broken links and being told they weren't needed, which was likely untrue, I attempted the assignment anyway, providing extensive detail and what data points would support the project. If the take-home was any indication of how the team and site were run, then they are in need of some serious attention to detail. I never heard back after completing the assignment, which again is unprofessional considering that I was ton I was one of 7 candidates being considered out of 200+ applicants. I had also been asked to participate in the next round of interviews at my initial interview but got zero follow up.", "Interview Questions": "N/A"}, {"date": "17 Mar 2020", "title": "Academic Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at College Track (Aurora, CO) in Jul 2019", "Interview Descriptions": "1-1 interview, followed by panel interview, and then another 1-1 with the regional director. Between the 2nd and 3rd interview, will be asked to complete a performance task. Two days before your start date, you may get a call putting your start date on hold. But, you'll also probably never have a start date...", "Interview Questions": "You'll walk through your work experiences and highlight how they're applicable to the position you're applying to. "}, {"date": "12 Jun 2019", "title": "Operations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at College Track (Suitland, MD) in May 2019", "Interview Descriptions": "I had to complete a 1-question scenario-based assessment. Afterward, I was scheduled for an hour interview with the manager. It was a panel interview, which was fine with me. However, one of the individuals in the panel was rude and lackluster. She didn’t even give me the chance to elaborate on my knowledge and skills, and gave me strange looks. I did not feel I was overqualified for the position. The interview was less than 30 minutes, which was disappointing and somewhat insulting for the type of position I applied to. The manager in the panel promised she would follow-up with me. It’s been more than 3 weeks, and I got no response. The manager went ghost, and did not provide me an update. No response “IS” a response. If they leave candidates hanging dry like this, they will do the same to employees on the job. Candidates beware of their lack of communication and rude/lackluster panelist.", "Interview Questions": "Tell me about a time you made a mistake. How did you handle it."}, {"date": "11 May 2020", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at College Track (San Francisco, CA) in Nov 2018", "Interview Descriptions": "I applied online and was scheduled for a 30 minute phone interview. I was told that I would hear back about next steps in about a week and never heard back. I received an automated rejection message from their system months later. Very disorganized and unprofessional.", "Interview Questions": "Why do you want to work here? "}], [{"date": "27 Nov 2018", "title": "Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Track (Watts, CA) in Jul 2018", "Interview Descriptions": "(1) Send in resume/cv to the appropriate department director\r\n(2) If you move forward, the director invites you for a video conferencing interview (~30 minutes)\r\n(3) If you move forward, the director sends you some data about their fiscal year (attendance, ACT scores, grades, possible scenarios with students - both good and bad). They ask you to respond to some questions about the information and create a lesson plan for a 30 minute session within 3 business days. \r\n(4) If you move forward, you are invited for an on-site interview and a 20 minute demo-lesson.\r\n(5) Job offer!", "Interview Questions": "What would people say is the most difficult thing about working with you?"}, {"date": "15 Sept 2018", "title": "Site Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at College Track (New York, NY) in Jul 2018", "Interview Descriptions": "Submitted Resume and emailed some 3 weeks later by recruiting firm to have a 10 min. introductory conversation.  I was invited for a more in-depth 20 minute interview by recruitment firm owner.  Interview was collegial and professional.  Recruiter was honest that they already had a lead candidate who was assigned a \"project\" but that he would be back to me in the next few weeks if I was to be called for a next step.", "Interview Questions": "Background Inquiry as to how it relates to position applied for."}, {"date": "16 Jan 2018", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Track (Hutto, TX)", "Interview Descriptions": "Came to interview arriving on time.  I was asked to wait a moment for the office manager.  Then I was asked to come into her office. She was a nice lady and treated me with respect asking appropriate questions. I was pleased.", "Interview Questions": "What do you have to contribute to this company?"}, {"date": "24 Jul 2019", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Track (Suitland, MD) in Apr 2018", "Interview Descriptions": "Phone interview \r\nIn person - Met with three people. The manager, recruiter and founding director. They asked questions in relation to my experience and how I would handle certain task on the job. Very comfortable environment", "Interview Questions": "Describe a time where you inspired someone to do better?"}, {"date": "24 Feb 2016", "title": "College Completion Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at College Track (Oakland, CA)", "Interview Descriptions": "I applied online and was then emailed to do a phone/Google Hangout interview.  The questions were simple and easy.  After the interview, the hiring consultant based in Oakland said I would be contacted within a week to see if I was moving forward in this position or not.  I was not notified.  In fact, I had to reach out to find out that I was no longer being considered.  I don't mind not going forward but I do mind when hiring managers do not follow up on their own time lines.  \r\n\r\nOutside of that the interview itself was informative and Hee Won was pleasant.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "11 Nov 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at College Track (New Orleans, LA) in Sept 2015", "Interview Descriptions": "I applied for another job and was asked if I would consider another position that was full time. I said yes and interviewed for it. The interviewer looked at my resume and asked general interview questions. It was very simple and easy. I was offered the job and started the paperwork.", "Interview Questions": "What makes you want to work at College Track."}]]