[[{"date": "9 Jul 2023", "title": "Research Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Expertise in work, how to perform experiments, create timelines and how to stick to it. Deliverables by the timeline that is given from the professor. Otherwise be able to explain why.", "Interview Questions": "What expertise did i possess"}, {"date": "27 Jun 2023", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "She is very friendly and understanding. Firstly, she asked me about myself and what I know about the project. Secondly, she asked about my commitments, skills, do i accept change. Lastly, she asked about my resume.", "Interview Questions": "How has your volunteering helped you grow as a person?"}, {"date": "23 Jun 2023", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Jurong West New Town, )", "Interview Descriptions": "After being shortlisted, HR sent an email with interview details. The interview was a panel interview with HR, hiring manager, and a team member. Following that, we are given an offer letter (it took some time)", "Interview Questions": "Broad range questions like tell us about your experience, a challenging situation you faced"}, {"date": "25 May 2023", "title": "First Assistant Mananger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Jurong West New Town, )", "Interview Descriptions": "The interview process took quite a while. There are many layers of reporting hence the entire hiring process took about a month. Just go in with an open heart and answer all the questions honestly.", "Interview Questions": "Strengths & weaknesses, career path, interest"}, {"date": "23 May 2023", "title": "Academic Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Engaging in a rigorous and comprehensive interview process, I showcased my expertise in education management, curriculum development, and team leadership. With a focus on aligning my experiences with NTU's strategic goals, I demonstrated my commitment and enthusiasm for the Academic Affairs Lead position.", "Interview Questions": "Describe what you've learnt from your previous roles"}, {"date": "5 Apr 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Interview was with a group of management level executives in the department via MS Teams. They were genuinely keen to find out about what I did previously and explained the role clearly.", "Interview Questions": "How do you manage a difficult situation at work?"}, {"date": "3 Apr 2023", "title": "Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "The interviewers are professionals and they are friendly. However, one thing is there were more than 2 interviewers in the room and it made you nervous. Afterall, the interview went well. The receptionist was very approachable and friendly too. She even guided you how to get to MRT station from the campus.", "Interview Questions": "N/A"}, {"date": "10 May 2023", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Apr 2023", "Interview Descriptions": "I was interviewed by a panel of staff. The questions were a mix o f traditional interview questions and questions specific to the job. The panel was on time but I had to remind the HR of the meeting link (since it was done online).", "Interview Questions": "What makes you the best candidate for the role? What's the reason you are applying for this role? Whata are your research interests?"}, {"date": "8 Jun 2023", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Apr 2023", "Interview Descriptions": "Face to face interview of more than one hour. There were more than three interviewers. Various scenarios were given to test the interviewee's responses based on past experiences. Interviewers were incisive and able to pinpoint on minor details.", "Interview Questions": "What would you do if you were in situation X?"}, {"date": "10 Mar 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Nanyang Technological University", "Interview Descriptions": "Average. The interviewers could not articulate why they needed me to go down for a physical interview. Prior to this, we already had a virtual interview. There was no proper closure, e.g. not even a rejection.", "Interview Questions": "Able to cope with high workload"}], [{"date": "3 Mar 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Overall took about 30minutes over zoom. There were three interviewers with two or three other administrative staff as observers. The interviewers are all faculty members of the school (LKC Medicine), including the director of the PhD programme. Overall it was a pleasant experience as the interviewers were quite friendly and encouraging.", "Interview Questions": "1. Introduce yourself and why do you want to do a PhD? 2. Why NTU/LKC? 3. Why this specific research field/topic? ( questions mostly related to the research proposal you submit during application) 4.Describe an example where you face failure and how do you overcome it?"}, {"date": "2 Mar 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "1. Introduce myself, like the undergraduate school, master experience. 2. Introduce past research experience based on my resume. 3. Talk about the future research plan 4. Briefly talk about supervised-learning, semi-supervised learning, and unsupervised learning. 5. Ask them questions", "Interview Questions": "1. Introduce past research experience based on my resume. 2. Talk about the future research plan 3. Briefly talk about supervised-learning, semi-supervised learning, and unsupervised learning."}, {"date": "17 May 2023", "title": "Managerial Trainee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Mar 2023", "Interview Descriptions": "Got cancelled after being insisted to go through physical interview after a phone interview. Claims to be premeir and flexible, but action speaks louder than words, definitely not at all.", "Interview Questions": "When will you be available for an interview in campus?"}, {"date": "10 Apr 2023", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Nanyang Technological University in Mar 2023", "Interview Descriptions": "The interview is nice and lab profs are patient. you can briefly introduce your project and your understanding in relevant field. Talk about what your expectation is in the future.", "Interview Questions": "what's KL divergence use in VAE"}, {"date": "20 Feb 2023", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Interviewers were really friendly and seemed genuinely interested in welcoming someone new on the team. They even discussed the probability of future projects that are more suited to my interest.", "Interview Questions": "What topics are you interested in?"}, {"date": "10 Feb 2023", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "It was a quick chat with the direct supervisor, the head librarian. Nothing much. But system might be different cause they were restructuring when i was leaving. Need to ask current student assistant.", "Interview Questions": "N/A"}, {"date": "31 May 2023", "title": "Management Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Jan 2023", "Interview Descriptions": "Pros \r\n- time lapse between each recruitment round is rather short (1-3 weeks), process is efficient \r\n- HR contacts applicants throughout the entire process by phone, which shows sincerity \r\n\r\nCons \r\n- too many round in the recruitment process, and the duration for each round is way too long (last 2 round were around 2-4h each) \r\n- too traditional of a recruitment system, especially with the physical psychometric round being packed with so many activities. \r\n\r\n4 rounds in the recruitment process (physical HR interview, online IQ test, physical psychometric test, final tea session with senior management). Took around 2 months in total from initial interview to final offer. Was told that there were around 180 applicants in 2023. \r\n\r\nNote that HR prefers to contact applicants via phone (i.e., calling) rather than through email. \r\n\r\nFirst round / physical HR interview - typical screening by HR, comprehensive discussion surrounding your resume. HR seemed very tired (probably depends on the timing of your interview), and wanted straight-to-the-point answers. Things like, \"tell me about this project you did...\" or \"share more about this internship experience you have...\". \r\n\r\nIf you have progressed to the next round, it might take around 2 weeks to hear back. \r\n\r\nSecond round / online IQ test - this test was sprang on the applicants suddenly, because HR said that the next round proceeding the first interview would only be a physical psychometric assessment. Hence, applicants only had 1-2 days to complete the IQ test. However, more than enough time was provided in terms of the test's time limit and the it mainly consisted of numerical questions. \r\n\r\nThird round / physical psychometric assessment - mind-blogging and strange assessment that seems a bit traditional. Consisted of group case study (tied to university context), role play (literally), individual case presentation. Was one of the most tiring physical assessment I had done. Most of the staff present looked very angry and sad (maybe because of the timing of the sessions) but the mood livened up during the roleplay activity. \r\nDue to the nature and intensity of the physical assessment tasks, one might expect that the compensation would be quite high because of the rigour that NTU seemingly requires of their management associates. Disclaimer is that the physical assessment round lasted for 4 hours. \r\nDuring these activities, you would be able to tell that the staff typically face challenges of: \r\n- unlimited tasks but limited time \r\n- expectation from management surpass actual capabilities \r\n- frequent negative feedback from customers (aka students) \r\n- a few more but I forgot about them already \r\n\r\nFinal round / physical tea session with senior management - consisted of 4 sections in a room. Each section had around 8-10 chairs arranged in a circle (no table in between). A few chairs taken up by candidates, the other chairs were occupied by the senior management. \r\nSenior management included individuals such as the C-suite, director etc. There were around 16-20 senior management present. They split into 4 groups to sit with different sections. After around 20 mins, the time would be up, and the senior management would rotate to a different section. \r\n\r\nQuestions typically included, \"why do you want to join NTU?\", \"do you know that you can't make a lot of money at NTU, so why do you choose us?\", \"where else have you applied?\", \"compared to NTU, the places that you applied are bigger companies, so how do you choose among them?\", \"where do you see yourself in 5-10 years time?\". Honestly, a lot of the questions made it seem like there is no future at NTU.... Also, each group of senior management asked almost the exact same thing, so you just have to pretend to be a broken record that day. \r\n\r\nAnother thing that disappointed me greatly was when it was the candidates' turn to ask questions, some senior management were flabbergasted that they were being \"interviewed\". But isn't recruitment a 2-way street these days? In the end, left this session feeling extremely drained. \r\n\r\nOffer was given around 2-3 weeks after the final round.", "Interview Questions": "N/A"}, {"date": "20 Apr 2023", "title": "Research Engineer 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Dec 2022", "Interview Descriptions": "Interview was simple, casual, friendly. Two rounds of interview were held - technical and organizational. Interviewers were easy going and very helpful for any doubts I had. Interviews were generally quickly processed and not much waiting period.", "Interview Questions": "Why did I want to work in the lab?"}, {"date": "3 Nov 2022", "title": "Senior Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Oct 2022", "Interview Descriptions": "It was great experience and smooth interview process. No pressure feeling during the process. In totality, the hiring process takes about a month.  The testimonial from the referees are required before issuing the LOA.", "Interview Questions": "Tell me about yourself and what’s your next target?"}, {"date": "19 Sept 2022", "title": "Computer Services Technician - Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Great, smooth interview process despite it being virtual interview. Interviewer was polite, pleasant, pre and post communication through email was clear and concise. Will recommend my friends to be shortlisted for a NTU interview.", "Interview Questions": "Why did u want to join NTU"}], [{"date": "7 Sept 2022", "title": "Engineering Bursary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "I was asked questions about donors.\r\nThere were 5 to 6 professors as interviewers.\r\nIt was online.\r\nI don't know what else to type, so hello everyone. i just want to read some stuff.", "Interview Questions": "who is the donor for the bursary?"}, {"date": "23 Nov 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Sept 2022", "Interview Descriptions": "Applied for the data scientist position at the Energy Research Institute. Went through 2 rounds of interviews with a verbal offer. Waited close to 2 months for the offer letter. Finally emailed the hr on the status only for them to say that the hiring manager has decided to move on with other candidates. No emails were sent updating me on this. Wasted my time. Extremely Unprofessional.", "Interview Questions": "Asked about simple DS concepts, past projects"}, {"date": "16 Jun 2023", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Sept 2022", "Interview Descriptions": "2 times interview. one with Director and one with Leader. Interviewers asked general questions and some related previous company experience. All are Professors in University, very friendly. Not much difficult", "Interview Questions": "Ask about your experience why you leave current company what do you know about our work? Explain their work for you"}, {"date": "31 Aug 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "The interview was through a zoom call because it was during  covid and it was smooth and nothing uncomfortable .  The professor asked about my area of interest and was keen to help me find a way to grow from the job as well", "Interview Questions": "Specific to the professor that you will be helping out for and the topic of their research "}, {"date": "24 Aug 2022", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Depending on the project, sometimes essay writeup required. A panel of at least 3 personnels - 1 or 2 professor, 1 admin usually HR and a Research Fellow will be conducting the interview", "Interview Questions": "Why did you apply for the job?"}, {"date": "18 Sept 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Aug 2022", "Interview Descriptions": "Virtual panel interview with two people. Getting the job interview took one month and getting the hiring decision took another one month. There was a mix of general interview questions and questions specific to past work/assignment experience. Some required very specific answers that cannot be found on the job description. Currently waiting for contract for a week.", "Interview Questions": "Tell us about a time when you’ve face difficulty doing group work and how did you overcome it?"}, {"date": "1 Jul 2022", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "PI is the one who interviewed and made the decision. I only went through one round of interviews with the PI. We talked about my past research experience and achievements and discussed future research projects. Overall the interview is very efficient and professional.", "Interview Questions": "Why do you want to join our group?\r\nWhat experiences and skills do you think you can bring to our group?"}, {"date": "12 Jun 2022", "title": "Senior Executive Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "1 round of interview that asked about strengths and weaknesses, career expectations and why do you want to join them. It was conducted via microsoft teams and there was no face-to-face interview.", "Interview Questions": "What are your strengths and weaknesses. "}, {"date": "20 Aug 2022", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Jun 2022", "Interview Descriptions": "Applied through the job portal, was called after 2 months to arrange and interview thereafter 3 months later still no updates with regards to the job application. Be prepared to be ghosted by their HR.", "Interview Questions": "Why do you want to work for NTU?"}, {"date": "13 Apr 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Just one round of interview,  together with the HR director and Hiring Manager, but talked for more than one and half hours.  Quite short processing time. Overall a nice experience.", "Interview Questions": "All normal questions expected for a job interview"}], [{"date": "27 May 2022", "title": "Research Engineer II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nanyang Technological University (Singapore) in Apr 2022", "Interview Descriptions": "The director come to me via email, had a short zoom meeting, after worth is the on site meeting with two director, asked ant technically issue and mgt skills. They will share the job overview in future and what they planned to do.", "Interview Questions": "To describe what will the BMS system sensor monitor and under which standard."}, {"date": "4 Jul 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Apr 2022", "Interview Descriptions": "Sharing of industrial experience and career planning to academia. There was also a round of research laboratory which you can have a glimpse of their research focus and current projects.", "Interview Questions": "Research aspiration\r\nCurrent job offer - in case they offer part time package. "}, {"date": "15 Mar 2022", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Nanyang Technological University", "Interview Descriptions": "Zoom interview was held with the Project supervisor and Co-supervisor. Asked on prior experience and knowledge relevant to the project. Knowledge on coding was advantageous. Basic biological lab skills were also helpful.", "Interview Questions": "What is your prior experience in the lab setting like?"}, {"date": "22 Oct 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Mar 2022", "Interview Descriptions": "They ask me to introduce my work. And then asked a few details about my research projects, including the background, motivation, methods and results. 5 interviewers were there with one senior PI and four fellows. I believe they will decide to recruit me because I have a publication in Science.", "Interview Questions": "Can you present your project?"}, {"date": "27 May 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Nanyang Technological University (Singapore) in Mar 2022", "Interview Descriptions": "Actually I just talk with my supervisor and then decided to continue following him as RA when I finished my Master of Engineering career in the beginning of the last semester.", "Interview Questions": "What's your future plan and how to achieve"}, {"date": "27 Feb 2022", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University", "Interview Descriptions": "HR contacted me after receiving my resume. Scheduled first-round interview in the following week. HR scheduled a second-round interview the next day. Took about 1.5 months to move from the second interview to finally start my first day.", "Interview Questions": "Why are you interested in this job"}, {"date": "22 Feb 2022", "title": "Professional Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Simple, in-person interview. Laid out the scope vaguely as this was an opportunity to be exposed to as much as possible within the industry. Overall, brief interview and passed through a single round.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "10 Feb 2022", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Mainly depended on the funding availability and your education level up to bachelor's degree, nothing much necessary. No research background is required for this stage. Just a general talk with the PI about the topic.", "Interview Questions": "What courses have you taken"}, {"date": "18 Aug 2022", "title": "Senior Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Feb 2022", "Interview Descriptions": "Short 45 min interview with the whole team (director, assistant director, manager etc). About 4 to 5 interviewers were present. Each interviewer took turns to ask questions. The highest position holder - director shared details about the job.", "Interview Questions": "Using one word, describe what an engineer means to you? "}, {"date": "8 May 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2022", "Interview Descriptions": "Standard questions, asked about why I left my previous company and what do I look for as my career aspirations. More on sharing on latest job experience and skills set that can value add to the organisation. Written assessment relevant to position applied for. One interview and from being shortlisted to job offering took about a month for them to prepare the salary package (timeline quite standard for public oeg, edu sector).", "Interview Questions": "N/A"}], [{"date": "29 Mar 2022", "title": "Operations Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2022", "Interview Descriptions": "Applied via Jobscentral, submitted resume and cover letter. I received a call in the three working days confirming interest in the position and asking for basic information before receiving an email to arrange for a video call interview next week.", "Interview Questions": "Asked for expected salary and prior experience"}, {"date": "18 Feb 2023", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University in Jan 2022", "Interview Descriptions": "A few stages in the interview was involved but the outcome was not communicated till the end. Not sure what was being looked out for. The interviewer was nice and friendly.", "Interview Questions": "Level of interest in the upcoming job role"}, {"date": "14 Jun 2023", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Pioneer) in Jan 2022", "Interview Descriptions": "Easy and straightforward. Only one round of interview with hiring department which include the director and team lead. Written assessment via email after the interview, related to the job portfolio which is necessary as its highly relevant and applicable for the job mostly.", "Interview Questions": "Why choose NTU. What is your career outlook. What do you hope to see in the department. What do you value most or good to have in the department/team."}, {"date": "16 Dec 2021", "title": "Senior Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Interviewers were friendly. While they asked tough and technical questions, they still appeared warm and sincere. Overall vibes were familial and showed teamwork and warmth. Done in a conducive environment.", "Interview Questions": "What are the goals of the company?"}, {"date": "29 Nov 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Nov 2021", "Interview Descriptions": "Simple and fuss free. But HR seems slow at getting back. \nMainly focused on salary requirements, seems unwilling to pay a higher salary even though PI is keen on hiring.", "Interview Questions": "Is the location okay?\nSalary requirements"}, {"date": "12 Nov 2021", "title": "Asst. director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Nanyang Technological University (Singapore) in Nov 2021", "Interview Descriptions": "Almost informal. Nice people. There were 2 profs on the interview panel who were eager to ask questions. Nice atmosphere. It was all  set up about four days in advance and gave me plenty of time to prep.", "Interview Questions": "Would coping from your current job to this one be a problem?"}, {"date": "13 Mar 2022", "title": "Research Centre Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Nov 2021", "Interview Descriptions": "A face to face interview session  with Centre director and HR. The interview comprised of  basic interview questions asking about candidate's educational qualifications, work experience, strengths and weaknesses of candidate, and HR related questions.", "Interview Questions": "Q: How does your previous work experience relate to the job role you have applied for? "}, {"date": "27 Mar 2022", "title": "Senior Account Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Nov 2021", "Interview Descriptions": "One round interview with direct supervisor and the supervisor department lead. They will briefly talk about the role and the challenges in this position.\r\n\r\nStraight forward interview process, nothing difficult in the interview session.", "Interview Questions": "The common interview question you can find in the internet."}, {"date": "7 Jun 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Nov 2021", "Interview Descriptions": "The admission result is determined by the committee. They emailed you the interviewer, make sure you look into the interviewers to find something to talk about. Overall great experience. I highly recommended!", "Interview Questions": "Why do you chose NTU instead of other U.S universities for PhD? "}, {"date": "8 Oct 2021", "title": "Senior Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Nanyang Technological University", "Interview Descriptions": "The HR staff did not even try to give me a salary that compensated the role well. It was only when I refused to accept the offer that they relented a little. Negative experience in terms of salary negotiation.", "Interview Questions": "Why do you want to work at NTU?"}], [{"date": "17 Aug 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "You are asked to present the tutorials in front of the interviewers. After that, they will ask you questions regarding your Physics knowledge. This is to make sure you have the foundations needed to teach the students", "Interview Questions": "How do you solve this question using Newton's Law?"}, {"date": "18 Sept 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Aug 2021", "Interview Descriptions": "interview people ask you questions about data processing methods such as PCA and machine learning models, such as k nearest neighbor, support vector machine, logistic regression, linear regression, multilinear regression, etc., and background.", "Interview Questions": "N/A"}, {"date": "6 Jul 2021", "title": "Finance Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University", "Interview Descriptions": "Applied online and get the call from HR. Arranged with a group interview. The interviewers were generally very cold and protective. Not willing to share more. 1 round interview only. Ask common interview questions.", "Interview Questions": "Why do you like to join NTU?"}, {"date": "20 Jan 2022", "title": "Senior Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jul 2021", "Interview Descriptions": "Very open and frank interview followed by an online technical presentation to the lab personnel.  Overall a good experience of interaction and open discussion on both technical and personal matters", "Interview Questions": "More technical questions related to the job nature and also on research experiences "}, {"date": "25 Jun 2021", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "went for a big interview with all the managers of the library (pre covid time face to face interview), all interviewers were friendly and questions were standard, nothing particularly special", "Interview Questions": "what do you see yourself in five years"}, {"date": "25 Jun 2021", "title": "Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "would you like to be a broke student and be in debt for the first 2 years of your work life? I am a very happy student at ntu i hope that this review helps", "Interview Questions": "what is your favorite good"}, {"date": "25 Jun 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Easy, mostly asked about your research experience. Share your projects and techniques you know. The professor was very friendly. Benefits depends on your performance. Every research group work style is different, can check before if you have known someone from the group.", "Interview Questions": "Share your research experiences and projects."}, {"date": "9 Jun 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University in Jun 2021", "Interview Descriptions": "It was a pleasant talk with the professors. Introduced the project to me and asked questions related to my previous research project. Asked about my career plan and general admin stuff.", "Interview Questions": "Previous research experience"}, {"date": "8 Jul 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nanyang Technological University in Jun 2021", "Interview Descriptions": "Friendly conversation with the research team and smooth interview. Questions were more inclined towards seeing if the candidate is fit and has the necessary skills for the project role. \r\n\r\nQuestions asked:\r\n1) Tell me about yourself.\r\n2) What can you contribute to our research?\r\n3) What did you do for your FYP?\r\n4) Tell me about your internships.\r\n5) Share about a project using Python.", "Interview Questions": "Tell me about yourself?"}, {"date": "7 Jun 2023", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Jun 2021", "Interview Descriptions": "The virtual interview process mainly focuses on field-related topics. I was given around 10-15 minutes to present their previous experience. Some questions may touch on personal aspects to gain a better understanding of the candidate.", "Interview Questions": "Can you elaborate on the techniques or methodologies you have utilized in your previous research that are relevant to our project? Will you be relocating alone or with family? Do you have the ability to work independently and take ownership of your research projects?"}], [{"date": "7 May 2021", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "General interview questions like “Tell me about yourself, and why did you choose to apply for NTU” were asked followed by a written assessment to gauge the interviewee’s ability to handle the requirements of the job", "Interview Questions": "N/A"}, {"date": "5 May 2021", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "HR forgot to send interview link until I called to remind her half an hour before the interview. Interviewers appeared bored (i.e. one of them was resting his head on his hand and using his computer during the interview) and they didn't even ask me the first question. I have to self-initiate to share about myself and past work experience. Overall, the process was quite awkward as there was not much interaction between the interviewers (i.e. one of the interviewers has to call the colleague who is staring at the computer to answer my question after an awkward silence). Interview process only lasted ten minutes.\r\n\r\nSuggestions:\r\nIf a candidate has already been chosen for the position or you no longer have interest in a candidate, it would be better if you called up the interviewee to inform on the latest changes as interviewee will usually spend time to prepare for interviews.", "Interview Questions": "Why do you want to apply for this role"}, {"date": "22 Jul 2021", "title": "Counsellor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in May 2021", "Interview Descriptions": "Received a call from HR within a month of application. Interview was done with 2 head counsellors, outcome for progress to 2nd interview made know after 2-4 weeks. Interview done via Zoom", "Interview Questions": "How can you contribute to the team?"}, {"date": "12 Jul 2022", "title": "MSC Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Jurong West New Town, ) in May 2021", "Interview Descriptions": "This is an online interview. Two professors raised questions in Chinese and English. The topics covered past  studying and researching experience. And future career plan is also included. The whole interview lasts about 30 minues.", "Interview Questions": "Why do you study abroad and choose Singapore ?"}, {"date": "16 Apr 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Personal discussion of goodness of fit to the role. Asked mostly about previous experiences, hard skills etc. Relatively smooth process, and met team leaders. Response was relatively fast too, 4-5 days after.", "Interview Questions": "How will your experience in the past help you given your understanding of your role?"}, {"date": "13 Apr 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "It was conducted on zoom and there were 2 attendees, the process was smooth. They had various departments that handled the hiring process. Team is small and seems good to work with", "Interview Questions": "Why did you choose to work with us?"}, {"date": "10 Mar 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Apr 2021", "Interview Descriptions": "The position I interviewed for was actually Senior Executive but because I am a diploma holder, I was offered for Executive position instead.\r\n\r\nThe first interview was great as I was referred by my friend. There are total of 3 interviewers, 1 faculty, 1 senior assistant manager and 1 HR. All of them are really friendly and asked simple standard questions about myself, the job description and my past job experiences.\r\n\r\nHowever, I am not expected to have 2nd interview. It was with the admin head and assistant manager from other team (not the one I should be reporting to). Overall experience was quite bad and unprofessional lol but nonetheless I still got the offer.", "Interview Questions": "First interview consists of standard questions like tell me more about yourself, what is your job past experiences and etc.\r\n\r\nSecond interview asked further but more specific questions on things that were not listed in the job scope (which I found out later that they are actually planned to put me on other roles rather than what I was actually interviewed for).\r\n\r\nBasically, I interviewed for role A but ended up doing role B work LOL what a joke."}, {"date": "23 Mar 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "I interviewed with the Division of Chemistry and Biological Chemistry at NTU. Had to talk about one's past and present research, as well as proposed future research plans. During the interview, my impression was that the search committee had been hurriedly put together, as the committee chair who was apparently leading the interview was surprisingly unfamiliar with the format that was given to me. Also, it appeared to me that the Singaporean core in this division/dept was very weak. Perhaps this could be something for the MoM and TAFEP to look into at some point.", "Interview Questions": "A combination of technical questions and general questions."}, {"date": "25 Mar 2021", "title": "Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Online. The interview is nothing too difficult to manage - just usual preparation would suffice. Be tech savvy for online interview platforms too. But be prepared for some duration of wait for the results to come back.", "Interview Questions": "Why do you want to work here? "}, {"date": "16 Mar 2021", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Two staged interview process.\r\n\r\nFirst stage: someone from the team interview\r\n\r\nSecond stage: someone from another team \r\n\r\nAfter that, talked to management and Human Resource. \r\n\r\nInterview was done in a relaxed manner, and was short.", "Interview Questions": "Explain the redundancy for localisation "}], [{"date": "6 Mar 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Two rounds, one with the prof (more technical) one with a postdoc (less technical). The overall process was pretty easy, one was online and one interview was in person. The prof looked at the projects that I've done before to determine if I had the right skills. The only downside was the HR processing part after I got an offer (HR took 2 months to process my application - which was apparently normal from what I heard when I asked around).", "Interview Questions": "Motivations, tech skills sets, etc and other stuff"}, {"date": "27 Feb 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "The interview was fine and it was easy to talk to the interviewers. My experience was great and it felt very comfortable talking to them. The questions they asked was quite easy to answer.", "Interview Questions": "Some technical questions related to the job."}, {"date": "16 Feb 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Smooth and professional. Overall it was a good learning experience. Interviewers were quite frank but nice, smart, reasonable. They asked me to prep a presentation and asked me a lot of questions.", "Interview Questions": "What can you offer the program"}, {"date": "21 Mar 2022", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Feb 2021", "Interview Descriptions": "It was a relatively short interview (20 mins), the interviewers seemed nice but never heard from them again. Questions asked were pretty generic, and seems like they prefer people with the system usage for work day.", "Interview Questions": "Why are you keen in applying for this role?"}, {"date": "26 Jan 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "HR and technical interview with the unit your are working in. The questions are quite standard but I think it really depends on the institute you are working for and under who.", "Interview Questions": "Tell me about yourself"}, {"date": "15 Jan 2021", "title": "Admin Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "They were quite quick to arrange the interview - it was quite straightforward regarding my commitment and also telling me the job scope. They got back to me soon asking for personal particulars to proceed with the application.", "Interview Questions": "As it was a temp job, they just asked if I was comfortable with the job scope while updating me about it"}, {"date": "7 Jan 2021", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "It will be depending on the PI you choose. Basically, your previous research experience will be asked. Seconldy, why do you prefer our lab? how do you find our lab?", "Interview Questions": "1. how do you think you previous experience can contribute to my lab"}, {"date": "1 Jan 2021", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Applied under the Student affair office. First interview (a short writing test -non skill related too) scheduled 3 weeks after sending resume, second interview 5 weeks after first interview. \r\nI dont think they know what they are recruiting for. A junior role but want someone who can do everything and know them inside out during interview stage. they think they are very knowledgeable, but admits that they are manual processing. Insist on physical interview still.", "Interview Questions": "What do you think you can offer in first year of employment."}, {"date": "11 Nov 2021", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2021", "Interview Descriptions": "Conducted online, with a few interviewers. So long you know your stuff, it is not difficult. Reasonable. Two stages though. It may take quite a while before the offer is being given, so do have some patience with their HR.", "Interview Questions": "It depends on which unit you apply to. So unable to advise here. "}, {"date": "15 Apr 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Nanyang Technological University (Singapore) in Dec 2020", "Interview Descriptions": "It was good. they asked me about my experience and told me what I will be doing and stuff. Pretty standard questions. just be urself. Also its good to include ur linkedin. talk about urself be real. apply through school portal", "Interview Questions": "what have you done so far in uni?"}], [{"date": "27 Jan 2021", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Dec 2020", "Interview Descriptions": "Talk about how you can contribute to the school community. What are your skill sets, value add that is able to fit into the school's progression to become a top university in Singapore", "Interview Questions": "what are your skill sets?"}, {"date": "21 Apr 2023", "title": "Senior Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University in Dec 2020", "Interview Descriptions": "Interviews with immediate RO. Then interview with the management. It was quite smooth. Both interview was done virtually. After that HR will prepare the remuneration benefits. Everything was done via workday.", "Interview Questions": "What I choose this job?"}, {"date": "3 Nov 2020", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Friendly and asked lots of technical questions. The hiring process quite long, need to wait after 2nd interview. The Prof are smart, need to revision what you have learned in the past.", "Interview Questions": "Explained Analog circuit "}, {"date": "30 Oct 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Smooth and pleasant interview, the professor requested additional explanation regarding past research projects. Went through 2 interviews with the prospective professors within the grant projects and followed with administrative stuffs with HR", "Interview Questions": "Past research"}, {"date": "4 Oct 2020", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "It was an online meeting, and took about 20 minutes. The interviewer looked at my CV beforehand so we didn't go into introduction, etc. Mostly talked about what sort of research the position was for.", "Interview Questions": "Did you work on any research projects in the past?"}, {"date": "17 Feb 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Oct 2020", "Interview Descriptions": "Overall relatively smooth and responsive, considering the pandemic situation. Around three months between notice of interview and confirmation job. Interview itself is panel-based and with good preparation one should be able to do well.", "Interview Questions": "Why did you choose to apply for this position? "}, {"date": "28 Sept 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Nanyang Technological University (Jurong West New Town, )", "Interview Descriptions": "It was a simple interview as i have worked with them during my internship and projects. Cannot really comment much but overall was easy. Hiring process was a little longer than expected due to some unexpected hiccups but not too bad.", "Interview Questions": "What is your short and long term plan ?"}, {"date": "24 Sept 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "The first round was with a professor, the second round was with graduate students in the lab. They asked some basic questions. Both of the interviews were done over zoom.", "Interview Questions": "Why do you want this job?"}, {"date": "10 Sept 2020", "title": "'Admin Executive' Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Relax environment. The interview process last about 30 mins. Mainly explaining what is the job scope about and what is the challenges faced for this role. No test needed. The interviewer is friendly and easygoing", "Interview Questions": "Tell me more about yourself "}, {"date": "30 Mar 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Nanyang Technological University (Singapore) in Sept 2020", "Interview Descriptions": "The interview goes two rounds with professor and scientist in lab. Both of them are nice and friendly. The questions are based on my experiences and research projects done in past. Also explain about their project and possible outcomes they want in future.", "Interview Questions": "Relating with my previous research"}], [{"date": "18 Sept 2020", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Aug 2020", "Interview Descriptions": "they will ask you to tell about yourself, then elaborate. \r\nHe will ask you what are your strengths and weaknesses.\r\nthen he will explain that they have a big project and what are you going to do with it\r\nfollowed by some more questions. and lastly Q & A. He will then tell you that he will follow up with HR before droppping the call. they will ask you to tell about yourself, then elaborate. \r\nHe will ask you what are your strengths and weaknesses.\r\nthen he will explain that they have a big project and what are you going to do with it\r\nfollowed by some more questions. and lastly Q & A. He will then tell you that he will follow up with HR before droppping the call", "Interview Questions": "what are your strengths and weaknesses? what are your strengths and weaknesses?"}, {"date": "29 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Aug 2020", "Interview Descriptions": "Thirty min brief interview about the post and few personal questions regarding your whereabouts.\r\nGenerally online for now, either in teams or google meet. The questions will be on basic python, and the artificial intelligence part.", "Interview Questions": "Explain the difference between Alexnet , VGG, Resnet."}, {"date": "16 Mar 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Jul 2020", "Interview Descriptions": "Submitted resume via jobportal and attended 2 interviews with the potential Principal investigators to understand the research interest. There was another round of formalities with HR afterwards. Overall good benefits and health insurance, but the employment type is contract.", "Interview Questions": "Tell me about your final year project?"}, {"date": "7 Feb 2021", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Nanyang Technological University in Jun 2020", "Interview Descriptions": "Video interview for research projects on using machine learning. Projects were about process parameter optimisation for metals and polymers. Applied through the university and received an interview offer within 5 days. Received offer within a week of the interview.", "Interview Questions": "What relevant technical skills you have that are relevant for the internship?"}, {"date": "12 Aug 2022", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University in Jun 2020", "Interview Descriptions": "Professor asked the basic questions: some technique questions; some questions about the future planning; some questions about the career development; some questions about the previous experience; some questions about the education background.", "Interview Questions": "What is your academic plan?"}, {"date": "1 Sept 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in May 2020", "Interview Descriptions": "Pretty straight to the point, clear and concise Internship Interview. One round only.\r\nInterview panel was friendly and approachable.\r\nIt was an online interview over zoom in lieu of the Covid19 pandemic.", "Interview Questions": "Why did you apply to NTU Satellite Research Centre?"}, {"date": "30 Jun 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Boon Lay, ) in May 2020", "Interview Descriptions": "it wasn't good . interviewers repeat the same questions. though answered they were expecting a model answer..thus, difficult to please them. HR took so long to inform the outcome as well until have to chase. this was not professional.", "Interview Questions": "why do you want this job?"}, {"date": "10 Apr 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "- Standard research position interview on current and past projects: what were your contributions, tools/technologies used, biggest hurdles, etc.\r\n- In-depth discussion about past publications: same as above\r\n- Questions on general / broad field applying to, e.g. Machine Learning", "Interview Questions": "Talk about your most recent paper"}, {"date": "13 Feb 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University in Apr 2020", "Interview Descriptions": "There was a 1 to 1.5 hour written test on scenario writing for social media, followed by a panel interview (online) with the head and associate director.  \r\nThe HR did not bother to send a rejection email. I just never heard from them about the position.", "Interview Questions": "Why do you want this position "}, {"date": "29 Oct 2020", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Apr 2020", "Interview Descriptions": "The interviewers will explains the job scope and a brief introduction of NTU,  they post questions that is relevant to the job you applied for. Quite friendly and easy going interviewers I have experience", "Interview Questions": "Tell us more about the experience you have in your previous company."}], [{"date": "7 Mar 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Nanyang Technological University", "Interview Descriptions": "Requirements: lab work and data analysis; work report and literature review; experiments process and chemicals purchase; waste collection and bio-safety; collaboration and training junior researchers; good communication and positive attitude.", "Interview Questions": "You should improve the skills on introduction writing."}, {"date": "8 Mar 2020", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "Ph.D. work presentation for 30 min then questions and answers for 30 min from my Ph.D. work and some basic chemistry topics, then a discussion about the new job's role and projects work.", "Interview Questions": "related my phd work"}, {"date": "3 Oct 2020", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Nanyang Technological University (Singapore) in Mar 2020", "Interview Descriptions": "Apply via the online portal. After shortlisting (took 3 weeks) two professors took interviews over video conferencing. It was a good interactive interview process. Finally, after almost six months of interview received the offer.", "Interview Questions": "About my Ph.D. research work. Discussed the problem and wanted to know my viewpoint to approach it. Also asked how the work done during my Ph.D. would help to solve the problem."}, {"date": "25 Feb 2020", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "I applied for a posting on the company job portal. I received an invitation for an interview after some correspondence. The interview was about 30 minutes. I was sent an offer letter a few weeks later.", "Interview Questions": "Tell me about yourself."}, {"date": "4 Oct 2020", "title": "Project Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Feb 2020", "Interview Descriptions": "Sent an application online and they emailed me to arrange a call. The interview was with a professor and a doctoral student and they mostly explained what the job is about.", "Interview Questions": "Do you have any experience in research?"}, {"date": "11 May 2021", "title": "Manager, Office of Student Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University in Jan 2020", "Interview Descriptions": "Interviewers had a good set of questions, back and forth sharing of experiences. Lady interviewer was rather unprepared, asked about hobbies and stuff. In the end they looked for a colleague so you must be a good fit in the organisation. They never called me back and HR was hyper unprofessional and did not reply to my thank you mail and follow-up. They basically ghosted me. Rather unprofessional coming from a highly ranked university. Although most Singapore companies are guilty of ghosting, I had expected more of my alma mater.", "Interview Questions": "Tell me what are your hobbies ?"}, {"date": "1 Jan 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "firstly you  submit your resume and wait for the interview. Interview is face to face and based on your lab experience and knowledge. You can show your final year project data.", "Interview Questions": "what is your lab experience"}, {"date": "15 Jan 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2020", "Interview Descriptions": "It was just the postdoc and I in the meeting room. She was very nice and polite throughout and offered to show me the lab and took me to meet everyone in the lab. Described the project that the successful candidate will be working on, the techniques involved, contract duration and start date etc. \r\nI appreciated how she first brought up at the start about honesty and willingness to learn. Basically explained to me that she was looking for someone that is willing to learn and ask questions.", "Interview Questions": "Tell me about yourself and your project. "}, {"date": "23 Mar 2023", "title": "MEng Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Dec 2019", "Interview Descriptions": "Was a decent interview. Lasted 30-45 mins. Questions were relevant to my experience and focused on my approach, methodology of work. For example I was asked a question regarding some work I did some years back and how I chose to implement my ideas and why I did it.", "Interview Questions": "What was your role in software for Electric motor? Follow up: How did you implement xyz protocol"}, {"date": "27 Oct 2020", "title": "ASEAN Scholarship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Sept 2019", "Interview Descriptions": "The interview process is not a very tense one, it is an easy interview in which you just talk in the way you feel the most comfortable with. And the interview only last for about 10 minutes, it is just a process to get to know more about you.", "Interview Questions": "Can you describe your personality?"}], [{"date": "27 Aug 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Nanyang Technological University", "Interview Descriptions": "First of all, I send an email with my cv to the professor. Then, the professor replies to me in two hours and asks me for some transcripts like GRA and TOEFL. Also, we scheduled a skype meeting two days later.  During the meeting, we go through my whole resume and talked a lot about the research topics the professor is doing and the ones I will be joining. A quite nice talk (sure, depends on the professor you are contacting...).", "Interview Questions": "go through the resume. asked details of each research project during undergraduate."}, {"date": "2 Aug 2019", "title": "NTU Shared Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Received call for interview and the HR team is prompt and responsive which definitely gave a positive impression. At the first interview, met with your direct supervisor as well as a HR personnel. The second interview was conducted by senior management from the Office of Finance. On the overall, it was a pleasant experience.", "Interview Questions": "Can you give a brief introduction about yourself...such as your experience and where you are currently working?"}, {"date": "23 Jul 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Nanyang Technological University", "Interview Descriptions": "Panel interview with director, deputy director, assistant director, manager and HR. \n\nFriendly, nothing intimidating, approachable interviewers. Nothing much on technical or critical questions asked. Mainly asked about the ability to work and the willingness to learn and perform.", "Interview Questions": "What are you 3 strengths and 3 weaknesses?"}, {"date": "5 Jul 2019", "title": "Research Fellow Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "interview with the professor who has the project. Asking about your background , the research has been done and the papers published. The professor will introduce the project background to you.", "Interview Questions": "are you interested in the project?"}, {"date": "2 Jul 2019", "title": "Senior Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "The interview lasted about half hour and questions are standard one and some are really outdated for example can you give us your previous employers testimonial, etc. \r\nThe job offered can be totally different as what stated in the ads.", "Interview Questions": "Share with us your experience"}, {"date": "16 Jun 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Asked core tech questions. Asked background and details about student mentoring. Asked about expectations and career plans. Asked about aspirations and collaborations. Asked about reasons for relocation. Asked about non technical interests.", "Interview Questions": "What is the long term plan?"}, {"date": "2 Jul 2019", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Nanyang Technological University (Singapore) in Jun 2019", "Interview Descriptions": "Stringent process with at least 2-3 rounds of interview and a written test. Then you meet with the RO for interview and for senior position a final clearance interview.", "Interview Questions": "What is your greatest achievement "}, {"date": "18 Jul 2022", "title": "ASEAN Undergraduate Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Apr 2019", "Interview Descriptions": "The process was relaxing and the interviewers were very friendly. It was more like a casual conversation that they want to know more about me and my personal background. It took just merely 5 to 6 minutes in total.", "Interview Questions": "What is your plan if you are not awarded the scholarship"}, {"date": "21 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Skype interview. Asked about grades, asked about prev work experience, research or otherwise. Short duration, focused on transcript and CV. Less of aptitude testing questions, more based on judging fit with the current project. Explained the current project in short.", "Interview Questions": "What is your prev experience?"}, {"date": "13 Mar 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Two interviews and the second interview included written answers to questions given during the first interview.  Thereafter, there was a 1 month wait for the job offer and contract signing.", "Interview Questions": "What are the relevant knowledge i have to the job?"}], [{"date": "17 Mar 2021", "title": "Scholarship Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Mar 2019", "Interview Descriptions": "Interview was conducted through Skype and only lasted for about 10 minutes. The panel wanted to know more about yourself and why you are qualified for the scholarship. Financial background is also one of the considerations.", "Interview Questions": "What are some breakthroughs in your field of study"}, {"date": "27 Mar 2019", "title": "Senior Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Nanyang Technological University (Jurong West New Town, ) in Mar 2019", "Interview Descriptions": "normal, old school interview. photocopy every cert. hr sit in all the interviews. have to travel to ntu which is far. not easy to navigate around ntu especially without a car. but very quiet & friendly environment. heavy crazy traffic at peak school hours. but overall it was a snooth interview. HR staff was nice. answers all my qns", "Interview Questions": "past & current job"}, {"date": "24 Sept 2020", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nanyang Technological University (Singapore) in Mar 2019", "Interview Descriptions": "I Emailed the PI, I was called for interview. I was asked to write a research proposal, Then was told to do a presentation for the group about my previous work. It was lengthy process. Then documentation also took a long time.", "Interview Questions": "past work experience and basic knowledge test"}, {"date": "20 Feb 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "It's okay, just normal interview process. The interviewer asked me to introduce myself and describe projects that I did in school, work related experience and question me if I can work under stress. Interview process is short, took around 20 mins", "Interview Questions": "What do you see yourself in 5 years time"}, {"date": "1 Feb 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "there are totally second rounds for interview. The first interview is to talk about your working experience and education with your hiring manager. And the second interview is to talk about the company culture and expected salary with HR.", "Interview Questions": "what is your learning experience with e-Learning systems "}, {"date": "11 Jan 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Feb 2019", "Interview Descriptions": "Depends on the professor. If the Professor who is hiring for the role deems you fit, then its fine. I was working in MAE and on the intersection of manufacturing and material science. Had past experience in another lab doing that so it was very helpful. It was a joint cross-border research project which required me to do a lot of experimental work for novel manufacturing techniques.", "Interview Questions": "What did you do in your master thesis."}, {"date": "22 Feb 2019", "title": "Project Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2019", "Interview Descriptions": "I received the job posting through an email blast and applied by sending my resume and cover letter to the current Project Officer. Within a few days, I was notified that I was shortlisted for interview with the Professor and the current Project Officer. They were very friendly and as long as you prepare well for the interview it shouldn't be too difficult.\r\n\r\nThey offered me the position within a week from the interview and gave me another week to decide on whether I wanted to take up the offer.", "Interview Questions": "How do you usually spend your week and manage your time?"}, {"date": "12 Feb 2023", "title": "Research Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2019", "Interview Descriptions": "Basically know what is your project about. Depends on professor. Simple and casual process, and ask why this project, why not other. if all is good. Should get the job. Very objective based and not too much of general questions.", "Interview Questions": "What are the problems to a certain project"}, {"date": "16 Dec 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "It asked typical interview question like tell me more about yourself, reasons I am interested to join the company and they tell me more about the job I am applying for.", "Interview Questions": "Tell me more about yourself "}, {"date": "7 Mar 2021", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Dec 2018", "Interview Descriptions": "it was a comfortable and relaxing process, and the interview was quite short as it only last about 30 minutes. The interviewers were friendly as they were smiling throughout the whole interview process.", "Interview Questions": "Describe your and past working experience"}], [{"date": "5 Nov 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Relatively straightforward. Asked me to introduce myself and later asked about my previous research experiences and my technical and skills set obtained previously. Discussed about my thesis as well.", "Interview Questions": "Where do you see yourself in 5-20 years time? "}, {"date": "21 Mar 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Nanyang Technological University (Jurong West New Town, ) in Nov 2018", "Interview Descriptions": "Usual interview process, with the focus on research plan for the remaining career/contract in NTU. They would also like to know about what you have done in the previous posting. Individual strength and weaknesses will be questioned as well.", "Interview Questions": "What's my research interest."}, {"date": "27 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "It was a really easy interview.  Not nerve-wrecking at all and managed to talk to a few employees while waiting for my supervisor/professor.  Sometimes I guess what you write in your resume is what takes the cake and not so much your interview skills.", "Interview Questions": "Why are you interested in this area of research? "}, {"date": "13 Sept 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Introduce your interests and what type of projects you are interested to do and learn more. Project/research basis\r\n\r\nIntroduce your interests and what type of projects you are interested to do and learn more. Project/research basis", "Interview Questions": "N/A"}, {"date": "16 Nov 2018", "title": "Project Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Sept 2018", "Interview Descriptions": "Interviewer who came to escort an interviewee before me took notice I had arrived an hour early. When it was my turn, I sat across from the 3 interviewers with a large table in between which kept me from initiating to shake their hands. Seated in the centre was the professor who did not look at me throughout the questioning perhaps to judge my response as he changed his demenor towards the end, when they decided to offer me the role.", "Interview Questions": "Explain to us your research ventures."}, {"date": "29 Nov 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Aug 2018", "Interview Descriptions": "Went through 2 rounds of interview. The first interview was with the PI where she asked questions relating to research interest and general background experience. Once she saw that I seemed to be a possible fit in the team, I went for my second interview where I met the rest of the research team. Overall it was okay, not too difficult but they will ask several technical questions so please come prepared!", "Interview Questions": "What is your research interest?"}, {"date": "26 Aug 2019", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Jul 2018", "Interview Descriptions": "Really great, fantastic, fair. just be prepared. Interviewer interested about work experience, just be confident and outspoken. Strength and weakness standard question, just be yourself and answer truthfully and honestly", "Interview Questions": "Strength and weakness qn. "}, {"date": "19 Feb 2022", "title": "Sales Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jul 2018", "Interview Descriptions": "Interview was done within 2 weeks from applying. It was a bit of formality, but the rest were to know about my educational and professional background like why I wanted to join this office, what interested me about this job, what are my current job scope and responsibilities. Took about 25 mins for the interview.", "Interview Questions": "What were my strengths and weaknesses? What interest you about this position? Why did you choose to apply for this job? You have an interesting education background, why did you choose to try something different from what you have studied?"}, {"date": "5 Jun 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "There were two rounds of skype interview in total after my application has been reviewed. The first round was interviewed by the current supervisor and the second round was interviewed by the director.", "Interview Questions": "Why you think your background match this position?"}, {"date": "20 Jan 2022", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jun 2018", "Interview Descriptions": "Presentation of previous research work and publications to the Project Investigator. They ask a few technical questions and discuss on how certain process can be improved. More like a meeting then an interview.", "Interview Questions": "When can you start the job? Describe how will you contribute to the project?"}], [{"date": "28 May 2018", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Nanyang Technological University", "Interview Descriptions": "I was an undergraduate in the same school, so I applied in-person, interviewed 2 weeks after the application with professor; then I submit the online application to school, get call for interview with the school associate dean for some very basic questions", "Interview Questions": "very basic questions"}, {"date": "3 Feb 2021", "title": "Senior Executive Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in May 2018", "Interview Descriptions": "Very engaging and happy that it was a two way communication process! The interviewers are very friendly and are happy to share more about the job. It does feel like the rapport between the interviewers and myself start there.", "Interview Questions": "Describe myself, share my experiences as a student and from my previous job."}, {"date": "1 Aug 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in May 2018", "Interview Descriptions": "Standard Interview consisting one round. A few behavioral questions as well as few technical question. Job was offered in about 2 weeks however had to stay long time for  employment visa to be sorted.  Job Accepted", "Interview Questions": "Tell me about yourself?\r\nWhat made you want to switch to research?\r\nWhat interest you about the job?\r\n"}, {"date": "11 Oct 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Apr 2018", "Interview Descriptions": "It was a pleasant exchange of information with the interviewers on all the past teaching and research experiences. There are some discussions on teaching and assessment issues in different systems.", "Interview Questions": "Why do you choose this institution?"}, {"date": "27 Mar 2018", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "The Hiring and Interview process took a bit of time. There are several different steps involved in the hiring process that include application forms, testing, interviewing, reference checks and health exams.", "Interview Questions": "Engineering Questions"}, {"date": "22 Mar 2018", "title": "Research Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "It was a telephonic interview and was conducted by a professor from NTU. The questions involved some technical questions from undergrad projects and some from my work. The interview process was fairly smooth.", "Interview Questions": "Describe your undergrad experience"}, {"date": "6 Jun 2019", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Mar 2018", "Interview Descriptions": "it is good and easy interview, taking one hour to completed the interview, there would be 6 interviewer attend the session together, the hr staff will also attend, they are friendly to interviewee,", "Interview Questions": "what is your interested?"}, {"date": "20 Oct 2018", "title": "Assist Finance Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Nanyang Technological University in Mar 2018", "Interview Descriptions": "Applied online, department is Rolls Royce interviewed by director, finance manager and hr about 1 hour. It’s consider very difficult interviewed, also done a lot of reference checks and have to do medical check up. Benefit was quite ok while the salary package are based on your last draw or current pay.", "Interview Questions": "What’s your greatest achievement in your last job ?why quit ?"}, {"date": "3 Apr 2018", "title": "Nanyang Scholarship Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Mar 2018", "Interview Descriptions": "It was a very friendly and welcoming session with 2 professors, 1 in-charge of admission and another for scholarship. Both posed the standard interview questions like \"tell us more about yourself\", \"tell us more about your leadership experience\" and \"why did you apply for this scholarship\". The session was more to understand you and publicise their scholarship. In fact, quite some time was spent on introducing the scholarship and its benefits...so need not be too nervous!", "Interview Questions": "Why did you opt for your (first choice)?"}, {"date": "14 Apr 2018", "title": "Assistant Professor/Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at Nanyang Technological University (Singapore) in Feb 2018", "Interview Descriptions": "Very friendly staff and organised interview process. The interviewers even gave me an office to prepare myself before my presentations and interview with the panel. I had an bunch of meetings with faculty members over two days and found them to be very honest and enjoyable to speak with.", "Interview Questions": "What my current role is and my teaching experience."}], [{"date": "20 Jan 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "interviewed by professor and then post-docs from future team. The interview process is relaxing, mainly asked past project experience and some technical details. No math or coding test, mainly on project and research experience.", "Interview Questions": "What role did you do in the previous project?"}, {"date": "24 Jan 2018", "title": "Research & Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2018", "Interview Descriptions": "First round: HR round (Background check) (Person to person)\r\nSecond round: Technical (Only shortlisted candidates were called on a different day after a month). The interview was through video conferencing by a specialized team on the area. The area which I was interviewed was assigned prior based on the preference marked in the online application form while applying for the company.\r\nThird round: Personal call to Japan and a final interview (expense compensated) if cleared after the second round.", "Interview Questions": "Describe the recent project that I completed"}, {"date": "21 Mar 2019", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Jurong West New Town, ) in Jan 2018", "Interview Descriptions": "The process is simple. Search on the school's website for job openings, email the supervisor in charge and shortlisted candidates will meet for an interview. There is a written chemistry test, followed by an interview and a practical laboratory test.", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Mar 2021", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Nanyang Technological University (Singapore) in Oct 2017", "Interview Descriptions": "Long process, takes very long to move, face-palm experience. The Prof and director were not professional at all. Seems like they need training  to reskill their interviewing skills.  Be prepared to be ghosted after your final round and them calling you after 3 months to see if you are still available. No wonder, the roles are always open. Lack talent attraction strategy and talent retention strategy.  Never again.", "Interview Questions": "Tell me about yourself and why you are suited for this role"}, {"date": "8 Sept 2017", "title": "Senior Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Interview was focussed on technical aspects, interviewers were friendly", "Interview Questions": "Technical questions related to project"}, {"date": "17 Jun 2019", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Nanyang Technological University (Singapore) in Sept 2017", "Interview Descriptions": "Interview was done on Skype by the (then) prospective supervisor and a campus visit. A few months later I got the official offer from the HR. I then accepted the offer.", "Interview Questions": "(Paraphrased from the actual interview)\r\nDescribe your previous research projects.\r\nWhere do you see yourself in 5 years' time?\r\n(The interviewer asked about a few things on my CV)."}, {"date": "20 Jun 2018", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Aug 2017", "Interview Descriptions": "the interview is usually conducted by three staffs, accompanied by human resources. the process takes about half an hour. it is generally casual, and includes questions on the background of the applicant.", "Interview Questions": "what is your past research experience."}, {"date": "13 Mar 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Aug 2017", "Interview Descriptions": "It was brief and straight to the point. I was interviewed by the director and some of the employees of the team. It made me understand the dynamics of the job and culture.", "Interview Questions": "Are you able to do what is required?"}, {"date": "1 Aug 2018", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Jul 2017", "Interview Descriptions": "Describe your self, what are your strengths and weakness. What are the attributes u can bring to the company and how u help yr new company. The interviewers are friendly and nice.", "Interview Questions": "What are yr skill set?"}, {"date": "4 Sept 2017", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Jul 2017", "Interview Descriptions": "Was called down for the interview about 2 - 3 days after the application. Interview questions were not too tough and the interviewers were quite detailed on their explanation. However, the post-interview stage was appalling as the HR did not respond or update anything despite sending them an email and a phone call follow up. As HR professionals, effort should made to ensure that applicants are not kept in the dark.", "Interview Questions": "Strength and weakness"}], [{"date": "28 Jun 2017", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Nanyang Technological University", "Interview Descriptions": "Ask to write an email on paper based on the 2 problems they gave, just to see how you will respond on email. Just read up on their website, all information are there, even quotation prices for merchandise they bought \n\nInterview for 1 hour, interviewers were friendly but be specific on your salary, else they will mark you as dishonest for hiding information from them and you will just be wasting your time and effort with them. \n\nTeam culture seems good but a dictatorial leadership, no negotiation, no freedom, just do as you are told. If you are looking for just a job, this is perfect. If you are looking for a career growth with the power to control your fate, go else where. \n\nOffice infrastructure is old fashioned, dust on chair and lighting is slightly dark. \n\nBase salary is low if your grades are not good. High leave payout of 21 days.", "Interview Questions": "Tell me about yourself"}, {"date": "7 Feb 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Jun 2017", "Interview Descriptions": "Face to face interview with the lab manager and prof in charge, followed by some short intro about their current project and discussion on how my research experience would help with their current work. Overall it was a quite pleasing process", "Interview Questions": "How was your skills in XXX"}, {"date": "13 Jul 2017", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Jun 2017", "Interview Descriptions": "The hiring process was easy, through email. However the interview was rather tough with a panel of 5 interviewers. It was a thorough interview with questions more on relevant work experiences instead of personal questions.", "Interview Questions": "Tell me about your strength and weaknesses "}, {"date": "26 Sept 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in May 2017", "Interview Descriptions": "about one hour and my boss's team members asked me some questions according to my resume, then they tested me some exam about the programming language such as C++ and C,in order to understand whether I know the language or not.", "Interview Questions": "can you describe the project you did during your master period"}, {"date": "24 Jun 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Nanyang Technological University (Singapore) in Apr 2017", "Interview Descriptions": "The whole interview is quite easy. They are looking for the unity3D game developer. I was asked to make a presentation about the previous experience about the u3d development and knowledge about computer graphics. It took about 1 hour to complete.", "Interview Questions": "Are you familiar with Unity3D, Maya, and other graphic tool?"}, {"date": "15 Aug 2019", "title": "Exhibition Project Manager (Gillman Barracks) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Apr 2017", "Interview Descriptions": "Easy straightforward. 2 step process. Second interview is with the main HR at NTU campus.  Interviewers were straightforward and honest in providing feedback to candidate. The offer was made within a week of the second interview. The package details are very clear.", "Interview Questions": "Why do you want this and are you willing to hear OJT"}, {"date": "2 Mar 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 8 weeks. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "interviewed by director of department and professor,everything goes well,so not many thing talk about, after interview ,spent long time (about 2 months)then got the official offer  that is really hard time", "Interview Questions": "about some skill for the position"}, {"date": "24 Jul 2017", "title": "Phd Position Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Nanyang Technological University (Singapore) in Mar 2017", "Interview Descriptions": "Very casual interview with supervising Professor. Mostly about personal character. Brought me around to meet the team of PhD Students that I will be working with, and allowed me to talk to them and understand more  on this position.", "Interview Questions": "Why choose to further studies rather than taking a year or two first to explore working in the industry?"}, {"date": "22 Jul 2019", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Nanyang Technological University in Mar 2017", "Interview Descriptions": "Two separate interview session were conducted. The first interview was with the direct manager, where he will ask some questions related to work experience. The second involved the higher management.", "Interview Questions": "Why do you want to apply for this job?"}, {"date": "18 Aug 2018", "title": "Event Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Nanyang Technological University (Singapore) in Jan 2017", "Interview Descriptions": "Rather casual interview process, nothing personal was asked. They are more interested in your capabilities than mindset, beliefs etc. Be presentable for the interview as events staff have to mingle with lots of important international figures who are here to attend conferences", "Interview Questions": "What is your highest qualification?"}], [{"date": "31 Jul 2017", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Jan 2017", "Interview Descriptions": "The window between first and second interview was 5 months apart, and reason they gave was HR lapse. Interview by the director and a professor. Waited for about 20 minutes before got called in to the meeting room. Everything went smoothly, but the wait for 2nd interview took ages.\r\n2nd interview was just with director, and it was pure chit chat, and nothing about work. The predecessor left a long time ago, but no proper documentation and archive was left behind.", "Interview Questions": "Tell me about yourself."}, {"date": "18 Aug 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Nanyang Technological University (Singapore) in Jan 2017", "Interview Descriptions": "Professor call a meeting online and discuss about the job. And then he ask about the software I have mentioned. His assistant is also in the meeting,and ask nothing. The whole meeting took about 30 minutes and they are all friendly.", "Interview Questions": "What is talk more about the subjects you are interested in?"}, {"date": "14 Mar 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Nanyang Technological University (Singapore) in Jan 2017", "Interview Descriptions": "No interview was done. They only checked all my education background, plus my CV and my language skills. They also asked for a reference from the professor that would have been my supervisor.", "Interview Questions": "No question"}, {"date": "20 Nov 2016", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Given a written test with the following questions: Why do you want to join? How does your previous experience contribute to the position? After that, interviewed by the Big Boss (High ranking Professor), followed by immediate boss and the HR of the department", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "10 Jan 2017", "title": "Accounts Payable Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Dec 2016", "Interview Descriptions": "There were 2 interviewers. Interview questions were answerable and quite standard. However, the interviewer do not respect you as an interviewee. One was busy using her laptop and another put you down and said nasty words which indirectly insulted you. It was the most unpleasant interview I had ever went for.", "Interview Questions": "What do you know about accounts payable?"}, {"date": "18 Nov 2016", "title": "PhD Research Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 7 weeks. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "After filing the application package, the division secretary arranged an interview with me via email. It was via Skype online. The interview was the last step for screening of application.", "Interview Questions": "The interview was pleasant. My professors were nice and patient, no picky questions. Questions were mainly about past research experience and understanding."}, {"date": "8 Nov 2016", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Professor conducted one-to-one interview. Previously, i was a student under his supervision. Therefor, the whole process is more like causal chating. My interview process is not the normal procedure, there is noting more i can tell about it.", "Interview Questions": "only some background questions. Previously, i was a student under his supervision. Therefor, the whole process is more like causal chating."}, {"date": "16 Mar 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Nov 2016", "Interview Descriptions": "There was only one Interview with my to be supervisor. He asked me about general concepts in my field of research and some other technical questions. I got my offer letter within an hour after my interview. I believe it was more of a talk for formalities sake.", "Interview Questions": "Why Operations Research?"}, {"date": "20 Oct 2016", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Oct 2016", "Interview Descriptions": "I applied via taleo (online portal) and received an interview invite a week after. I was informed thru e-mail that the interview process would entail a 1 hour written test, followed by an hour long interview with the managers and director. \r\nThe written test is timed. It was done on a laptop, presumably to access excel competency. Also, there were several essay questions to complete (which were relevant to the job scope). After that, it was meeting with the panel of interviewers. Interviewers were quite friendly, and the questions asked are quite typical. It felt more like a conversation than a question-answer session, while preserving a professional and formal setting. Just do your part, be prepared, and besides putting your best foot forward and hoping for the best, it's wise to use it as an opportunity to gauge how compatible your prospective employers with your work style and expectations as well.\r\nOverall, a good experience for me, as I find that no interview experience is ever gone to waste. It has been 2 weeks post-interview, and I have not heard from them, so I am assuming that there is currently no offer, although the impression I was left with was that I would have been selected. A final point to note is that the type of interview structure would vary, depending on which school/office you are interviewing with.", "Interview Questions": "Questions may largely vary depending on how you answer, but most were the typical ones, such as\r\n-Tell me more about yourself\r\n- Hobbies, what you do in free time\r\n- How would your friends describe you\r\n- How do you manage your time\r\n- What do you do when you face difficulties at work?\r\n- How much do you understand about what this job entails?\r\n- How do you find NTU? (cos I'm an alumni)"}, {"date": "20 Nov 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Nanyang Technological University (Singapore) in Sept 2016", "Interview Descriptions": "Sent an email detailing past administrative and photography experience. It's not for a particularly difficult job, just admin and receptionist work. Then I emailed and spoke on the phone to see when I could come in and tried to booked in as many hours as a could that matched my school schedule.", "Interview Questions": "Have you had any admin experience before?"}], [{"date": "2 Nov 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Jurong West New Town, ) in Sept 2016", "Interview Descriptions": "Application made online (Mail to concerned professor).\r\nFace to Face Interview with Professor and RF's.\r\nAnd then a Lab Visit where I will be working.\r\nBasic Interview Questions. Checked my interest for research.", "Interview Questions": "Mostly Casual. Brief description about education and work experience."}, {"date": "29 Jun 2016", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "I was early for the interview and was allowed to proceed. I was given a written test to complete first. Shortly after, the interviewers came and then the real interview began. Everything was timely and organised. The entire process took about 45-60min.", "Interview Questions": "Do you like your current job? If so why are you leaving?"}, {"date": "28 Jun 2016", "title": "Senior Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University", "Interview Descriptions": "HR arranged the interview. Arrived at the interview early and was allowed to proceed with the interview early too. After doing a short test, the interviewers came and proceeded with the interview. The entire process took about an hour.", "Interview Questions": "Are you sure you really want this job?"}, {"date": "23 Jun 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 3 months. I interviewed at Nanyang Technological University", "Interview Descriptions": "One interview with a panel of four.\nHad to conduct lesson which was observed by two faculty members. Questions were fair and closely related to the job scope. Overall, a good experience.", "Interview Questions": "How do you think you can contribute to the academic group and the university (based on your expertise and experience)?"}, {"date": "16 Mar 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Nanyang Technological University (Singapore) in Jun 2016", "Interview Descriptions": "The interview was a casual discussion of various possibilities of collaborating expertise between myself and the Research center, unlike a formal one. The panel consisted of two people who were interested to collaborate with me. Hence we had an exchange of ideas among us.", "Interview Questions": "Commitments on the duration of stay in Singapore beyond the contract period. "}, {"date": "6 Apr 2016", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University", "Interview Descriptions": "Job posting was NTU website, Send CV. takes less than 1 week..on-site interview X2 (Technical background/ Salary negociation). overall takes 1 month to get offer letter.Job posting was NTU website, Send CV. takes less than 1 week./.go through on-site interview X2 (Technical background/ Salary negotiation). Time to time SMS contact. Overall takes 1 month to get offer letter. Pleasant experience for interview", "Interview Questions": "go through my CV about technology where I can apply for them\r\nExplain about their project and my interest."}, {"date": "3 May 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nanyang Technological University (Singapore) in Apr 2016", "Interview Descriptions": "The interview was conducted by two scientists - a research fellow and a postdoc.I was asked questions based on my skilled list in my resume. I was asked to talk about my last experience. Common things like what I did there. I was informed in the first round there are 12 candidates. After which, 2 will be picked for the final interview with their professor.", "Interview Questions": "Rate your independence level and confidence to properly use the advertised lab equipments."}, {"date": "1 Jan 2019", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Feb 2016", "Interview Descriptions": "The hiring process involves the screening of the resume and a direct chat with the professor.  The professor checks the applicants publication record. If the applicant has publications in  top-tier journals, he will get a call for personal interview.", "Interview Questions": "The professor like to check whether your working style matches with his style or not. Next, the publications are the biggest factor in the selection process. If they are good, and prof is comfortable working with you, you will be hired."}, {"date": "30 Mar 2017", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University in Feb 2016", "Interview Descriptions": "Interview goes smooth. Just me and prof, interview about my experience and my previous career. Quite boring and nothing special. I dont know what to say. Just give a damn reviews to become member here. Sorry", "Interview Questions": "Ok what is your mother name"}, {"date": "30 Mar 2016", "title": "Administration Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Jan 2016", "Interview Descriptions": "Simple interview. Just some questions about tell me more about yourself, why do you want to take up this position and what are some skills that I have that are relevant to the job scope. The whole interview process is very informal. I did not really prepare anything for the interview.", "Interview Questions": "Tell me more about yourself"}], [{"date": "1 Nov 2018", "title": "Deputy Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2016", "Interview Descriptions": "Very casual and to the point. questions about Resume and past experience followed by job description and more technical questions. Got the opportunity to ask questions at the end of the interview. Very receptive and interactive interview", "Interview Questions": "Describe the challenges you faced in your previous job and how did you address them"}, {"date": "7 Sept 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 months. I interviewed at Nanyang Technological University in Jan 2016", "Interview Descriptions": "Be there for less than half year. Not so huge pressure. But everything is just depending on your boss (PI).Didn't got interviewed, and got the offer directly. They just ask for refer letters. Depending on your PI.", "Interview Questions": "N/A"}, {"date": "4 Mar 2016", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Jan 2016", "Interview Descriptions": "I was interviewed by a Professor and a senior engineer in charge of this collaborative project between NTU and industry. Interview lasted 30 minutes. At first, I was asked to introduce myself, followed by standard questions on why I applied for this job. Then, i was asked whether i have skills or previous experience that would be relevant to this project.", "Interview Questions": "Why am I interested in Robotics and particularly in this project?"}, {"date": "24 Oct 2015", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Nanyang Technological University", "Interview Descriptions": "The application is very simple, first i send a email to there and 2 weeks later, they arranged an interview for me. My future supervisor interviewed me. We talked about the project. Interview session is very relax, casual and short (less than 15 mins).", "Interview Questions": "What is your long term goal? "}, {"date": "4 Oct 2015", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "I have attended an interview at Admission and financial aid office(Student service centre). There were 4 interviewers including Director, manager and assistant manager. I regret going for this interview as I think they did not respect the candidates. There were laughing and joking among themselves and asking irrelevant qns. I felt insulted and annoyed and I hope they will reflect on their behaviour.", "Interview Questions": "What do you think about foreign talent?\r\nWhy do you prefer this position over working for public sector?\r\nWhat do you know about this dept?"}, {"date": "19 Apr 2016", "title": "Researcher In School of Computer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Nanyang Technological University (Singapore) in Oct 2015", "Interview Descriptions": "Emailed my CV to potential professor(PI), and got response within the same day to answer some questions about my background. Then the prof arranged a face-to-face interview in the office (which could also be done by Skype).\r\n\r\nThe interview process was in a very relaxed atmosphere. The focus was on my past working experience and projects. So try to make it clear about what you have done in the past, and prepare 1-2 project in more details, e.g. what was the project, what technology in the project could be transferred to the new project in future. And also there were some general questions such as why do you want to work in Singapore and why do you want to work in the university. At the end of the interview, I was asked to provide 2 referees to send my reference letters.\r\n\r\nAfter the prof received my reference letters, I was asked to do a small project to demonstrate my expertise in the field, and of course the project was not to difficult and was related and similar to the future work. So please do not be afraid of that. Just believe in yourself.\r\n\r\nWhen I finished that small project, the prof and I met again in the office, discussed the details about that work. And I got an immediate offer orally by the end of the day, followed by HR process and paper work. However, the HR process was extremely time consuming, and I waited 3 month for the official offer letter by the university, in which the salary was fixed and there was no negotiation. Please be aware that if you are a foreigner like me, there is another formality set by ICA/MOM/government, which consumes at least 2 weeks as well.", "Interview Questions": "Describe past project experience. Key skills related to future work."}, {"date": "22 Sept 2017", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Oct 2015", "Interview Descriptions": "Got the call after 1 month after applying.  Interview was called by the supervisor. It lasted about 45 minutes. Got the offer letter after 2 months. It was pretty easy. overall took 3 months", "Interview Questions": "Mostly discussion on future works."}, {"date": "9 Apr 2019", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Sept 2015", "Interview Descriptions": "The interview was conducted through skype, unfortunately the video did not go well due to slow internet connection. This may be my issue. The recruiter was so humble that he immediately called m in my mobile and continued. Its a great surprise for me that recruiter of such a ranked university could be so cooperative. It was not an interview, it was my learning session, job seekers should experience that.", "Interview Questions": "Technical but basic"}, {"date": "28 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore) in Sept 2015", "Interview Descriptions": "Emailed to apply and got a response within a week. HR personnel set up interview for the next week with the professor-in-charge. Interview was semi-casual, with a sitting in HR personnel and professor of the program. Try to ensure you fit into the job scope. process was friendly and efficient", "Interview Questions": "What are your long term job goals?"}, {"date": "26 Aug 2015", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "There was one on one interview process in the morning. This is very technical and the questions are directly related to previous experience in research. Then, there is a little bit of laboratory tour and safety explanation. That week, the human resource contacted me to go over the contract and all the necessary details.", "Interview Questions": "The usual technical question related to previous experience and some behavioral questions"}], [{"date": "26 Oct 2016", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Nanyang Technological University (Singapore) in Aug 2015", "Interview Descriptions": "first, we have the project assignment, which is for data analysis aspects, require to finish it in a few days, and then review the result, reply the question according to the problems. later have face to face interview process, the employer is quite nice, and process comfortable", "Interview Questions": "do you have experience in the data analysis"}, {"date": "13 Jul 2017", "title": "Mso Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in Aug 2015", "Interview Descriptions": "Had to sit before a panel of 4 interviewers. Atmosphere was quite relaxed as the interviewers wore t shirts and slacks.\r\n\r\nAfter the first interview, I was asked back for a 2nd interview before the directors of the organisation. Context was quite the same.", "Interview Questions": "What is your career objective?"}, {"date": "30 Jan 2018", "title": "Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Nanyang Technological University in Jun 2015", "Interview Descriptions": "formal with no human resource representative. Conducive and comfortable.  panel interview. need to write an essay to test your command of english. took about 30 minutes.  requires second interview with director.", "Interview Questions": "why did you choose to have a career switch?"}, {"date": "5 Nov 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Jun 2015", "Interview Descriptions": "the interview started with a technical background discussion and research interests. having done a research degree in relevant field, it was quite easy to explain on a straight forward basis. This created a positive opinion on the candidate,", "Interview Questions": "Thermodynamical knowledge"}, {"date": "20 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in May 2015", "Interview Descriptions": "applied online. I was required to make one presentation and there was one round of interview. Every thing was based on my previous experiences and projects. Technical questions were easy. There were 4 interviewers. One professor and 3 other research fellow.", "Interview Questions": "Questions about Kalman filtering and object recognition. Basic questions of SIFT"}, {"date": "18 Sept 2019", "title": "Senior Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Nanyang Technological University (Singapore) in May 2015", "Interview Descriptions": "A panel of around 4 professors from different schools was formed and they decide whether to hire me or not, the panel consists of senior academicians  they are in general quite friendly", "Interview Questions": "What is your teaching statement"}, {"date": "25 Mar 2015", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Nanyang Technological University", "Interview Descriptions": "the process was very quick and easy to handle with . many of the candidates will be there for interviewing. if only the professor is into your topic description and your working ethics. it's simple to pass the test and interview questions.", "Interview Questions": "what is the project topic about"}, {"date": "15 Mar 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Nanyang Technological University", "Interview Descriptions": "There are 2 rounds of interview, the 1st is by the school committee, the 2nd is by the supervisor. After the 1st interview, if you passed. your potential supervisor will contact you and give you the second interview.", "Interview Questions": "Tell me about your past research experiences"}, {"date": "1 Aug 2016", "title": "Senior Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 9 months. I interviewed at Nanyang Technological University (Singapore) in Jan 2015", "Interview Descriptions": "I send my application to several PI and got a skype interview fairly quickly with one. We went through my professional background and also my family situation. We then discussed the position that would be soon available. I finally started 9 months later because of some delay in getting the grant for the project.", "Interview Questions": "Please describe your research background."}, {"date": "20 Apr 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nanyang Technological University (Singapore) in Jan 2015", "Interview Descriptions": "two rounds. first round with direct boss, talking about the project. second round with the direction of the centre and direct boss. both are light-hearted. Not much technical details or questions. but the recruiting process last quite long, about two months. after interview there were HR processes, which were very slow.", "Interview Questions": "past working experience; skills and subjects learnt in college. "}], [{"date": "18 Nov 2019", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Nanyang Technological University in Jan 2015", "Interview Descriptions": "The supervisor (Professor) conducted the interview with me in person. He asked questions about my PhD project and my skills. He also asked about my expectations of the applied position.", "Interview Questions": "What did you do for your PhD project?"}, {"date": "10 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Nanyang Technological University (Singapore) in Jan 2015", "Interview Descriptions": "You will likely be asked questions about your teamwork skills, your interpersonal relations, your management style or your ability to work in a diverse environment. Review the job posting again and try to anticipate other likely areas of questioning, and prepare honest and concise answers that highlight relevant aspects of your work history and life experience. Remember that there may be questions you did not anticipate: when this happens, breathe and take a moment to think through your experiences to find the best answers.\r\n\r\nOn the day of the interview, dress appropriately and arrive early, calm and mentally prepared. Bring a list of references if you did not already include them in the resume you submitted. And, most importantly, don’t forget to relax and be yourself.", "Interview Questions": "N/A"}, {"date": "28 Sept 2015", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nanyang Technological University (Clementi New Town, ) in Dec 2014", "Interview Descriptions": "My interview was very fast.... about 5 mins. Very relaxed and casual. The HR manager and your direct boss will interview you. In fact I thought I might not be able to get this job because the interview was barely 5 mins.", "Interview Questions": "They didnt ask relevant questions most of the questions were very casual eg like how are your friends doing...?. Have they found jobs? etc. This is because I graduated from the same sch and I was fresh graduate at that time."}, {"date": "15 Apr 2017", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Oct 2014", "Interview Descriptions": "Two rounds of interview. First round is by hiring manager and second round by panel. First round was quite direct about related job experience. Second round will be questions on Job and past work experience. Second round might involve staff from other departments", "Interview Questions": "Experience in selected job criteria"}, {"date": "25 Sept 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Nanyang Technological University", "Interview Descriptions": "I found the job announcement online and contacted my future supervisor via email. After a couple of days he responded and we arranged an interview. it was a Skype interview.  Took about 30 minutes. I got offer after a month or so.", "Interview Questions": "There were no unexpected or difficult questions. There were about my PHD thesis."}, {"date": "11 Jun 2015", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Nanyang Technological University (Singapore) in Aug 2014", "Interview Descriptions": "the all interview is very simple, first i send a email to there and a month later, they arranged an interview for me. the interviewer is just one --- the team leader. I just made a slide and report to him about what i will do in this project. I didn't talk much, interviewer will control the whole process. don't worry just be relaxed.", "Interview Questions": "What do you understand the wave energy."}, {"date": "19 Jul 2014", "title": "Project Officier Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "Very general questions in the interview, introduction to yourself, the project you have done, why you are interested in this position, show some understanding of the project. It is very simple interview, and going on very nicely. quite a good experience", "Interview Questions": "N/A"}, {"date": "10 Jun 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Nanyang Technological University", "Interview Descriptions": "Phone Interview and questions were related to research work.  Expectations for the project was discussed.  In general, the interview was fine but only because my area of expertise matched with the project.\r\nTook almost 4 months from the interview date till receiving the official offer.", "Interview Questions": "N/A"}, {"date": "15 Oct 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Jun 2014", "Interview Descriptions": "Nice and easy, it was in 2 rounds, the panel was efficient and to the point. The questions were technical and more towards previous experience and skills, the HR recruitment process was good and fast. The orientation and joining was also smooth.", "Interview Questions": "Previous expeience, techinical field related questions"}, {"date": "20 Apr 2014", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Nanyang Technological University", "Interview Descriptions": "Waited for more than 1 week after immediate offer during interview, and asked to assume duty the next day.  No chance to negotiate salary.", "Interview Questions": "N/A"}], [{"date": "8 Apr 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "For research positions, they are on project to project basis. The discretion is given to the PI (Principle Investigators) to hire based on their projected budget. Your salary is pretty much fixed within a range unless you have exceptional skills that is required by the project.\r\n\r\nInterviews for the RF position is often more of understanding how you can fit with the project and the ability to carry out the research independently and manage the project for the PIs. You are required to have a lot of discipline and ability to carry out work without much supervision. And that is the key to getting hired in any research", "Interview Questions": "How do you think you can contribute to this project?"}, {"date": "14 Sept 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Apr 2014", "Interview Descriptions": "I applied for the position from overseas and went through 4 Skype Interviews with the prof.  where we discussed about my past research and the position to assess wether I was a matched. The interviews were interesting and technicals and we proceed with the description of the package (there wasn't room for negotiation). Once I accepted the offer, NTU applied for my Employment Pass which was granted within a month.", "Interview Questions": "I have been asked about my past research"}, {"date": "10 Mar 2018", "title": "Doctoral Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Feb 2014", "Interview Descriptions": "Single interview with the Associate Chair of Research of the School. Most questions were about prior research work, and plans for doctoral research. No typical \"HR\" questions were asked.", "Interview Questions": "Why do you think this project is worth pursuing for doctoral research?"}, {"date": "25 Mar 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Nanyang Technological University (Singapore) in Jan 2014", "Interview Descriptions": "The initial communication is well and quite easy.\r\nThere is only on interviewer, which is the supervisor and Professor in NTU.\r\nThe questions are quite relative to the requirements in website. \r\nEnglish is easy to understand.\r\nThe following steps are medical examination, register in NUT human resource, working in lab.", "Interview Questions": "N/A"}, {"date": "23 Nov 2013", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Following application and review of CV, NTU invited me for a campus visit. All candidates give a research seminar and go through a full day of interviews with many members of staff.", "Interview Questions": "The questions were all straightforward.  At this level, the matching of research interests and background to position already limits the applicant pool.  "}, {"date": "25 Oct 2013", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Oct 2013", "Interview Descriptions": "Need reference from professor  to get the job. Really depend on the professor though.\r\nDepend on your luck cos I got the job offered by prof so practically no interview needed.", "Interview Questions": "Nothing much. They are looking for skills."}, {"date": "21 Oct 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Oct 2013", "Interview Descriptions": "Requested CV by the professor in the concerned department through his personal assistant. CV sent to  the personal assistant. After verification of CV, i was informed to get ready for a Telephonic interview. Telephonic interview was done by the concerned professor after a week getting the notification. The interview was smooth.", "Interview Questions": "More about the technical aspects on the technology I was working"}, {"date": "13 Apr 2015", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Sept 2013", "Interview Descriptions": "The interview took place in the Professor's office and two interviewers were present. It was a short interview of about 20 minutes; a semi-casual interview process, and the interviewers were friendly. Questions were asked to assess my eligibility and interest for the job. The HR personnel took relatively long to contact me after the interview.", "Interview Questions": "Why do you want this job?"}, {"date": "27 Aug 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Nanyang Technological University", "Interview Descriptions": "One round of interview with professors and research fellows. Basic questions including your research interest, past experience in related area, and willingness to continue a phD study. Normally it is more welcomed for candidates that have plans to be a phD; but there is exceptions, depending on the job. It takes one to two month from submitting application to getting noticed.", "Interview Questions": "Professional questions may be quite specific and require a good knowledge of the area."}, {"date": "29 Jul 2013", "title": "Software Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Nanyang Technological University (Singapore)", "Interview Descriptions": "Interview was good. They asked technical questions on .net", "Interview Questions": "N/A"}], [{"date": "13 Jul 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nanyang Technological University (Jurong West New Town, ) in May 2013", "Interview Descriptions": "Interview was taken by Professor and salary was negotiated right away.\r\nNormally people with valuable work experience and high academics are called for interviews.\r\nIf you are a fresh graduate then your marks are enough to be interviewed. If you are interviewed and salary is negotiated at the same time then you should be happy because you are selected.\r\nIf you are experienced then previous company's reputation as well your academics are important. If you are experienced then there will be review of your skills. And after few days only you will get to know whether you succeeded or not.", "Interview Questions": "Why did you come to Singapore?"}, {"date": "13 Apr 2013", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Nanyang Technological University", "Interview Descriptions": "First, you have to apply online for the position you are interested.\r\nSecond, after online submission, you also need to send the hard copies of your CV and other documents for support.\r\nThird, you have to attend an exam if you dont have TOFEL or GRE\r\nFinally, you may be asked to attend an interview, either online or face to face.", "Interview Questions": "N/A"}, {"date": "6 Aug 2015", "title": "Undergrad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Nanyang Technological University (Singapore) in Mar 2013", "Interview Descriptions": "The prof knew my prof, so had an exchange program with one of their students.\r\nHe looked at my resume saw that I had relevant project experience. The process was fairly informal, was an undergrad internship so not much grilling of the candidate.", "Interview Questions": "Why do you want to work in Computer Science"}, {"date": "6 Feb 2013", "title": "Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Nanyang Technological University (Singapore) in Oct 2012", "Interview Descriptions": "If contract programmer through consultancy only.", "Interview Questions": "N/A"}, {"date": "16 Dec 2012", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Aug 2012", "Interview Descriptions": "Depending on who you report to, generally the interview process is quite easy", "Interview Questions": "N/A"}, {"date": "21 Mar 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Aug 2012", "Interview Descriptions": "Very straighfwd process. Applied through a referee, got shortlisted for a project. Recvd an email from  the the the manager and and had a short interview. Came back a couple of times to talk to the rest of the team and then the director. Eventually got an offer 1.5 months after the interview and accepted it", "Interview Questions": "Mostly technical and experience related questions?"}, {"date": "23 May 2016", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Nanyang Technological University in Jun 2012", "Interview Descriptions": "The principal investigator arrange the interview and ask about my past experiences. When everything was fine, they proceed to do security clearance and sent me the offer letter. Upon acceptance, i had to go and do a lengthy body checkup.", "Interview Questions": "What was your past experience ?"}, {"date": "17 Apr 2016", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University in Jun 2012", "Interview Descriptions": "Interview for PhD candidature was over skype. Positive experience. Interviewer was a professor who was very friendly and patient. He wanted to know about the previous projects I have been part of during undergraduate studies", "Interview Questions": "strengths and weakness?"}, {"date": "14 Dec 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nanyang Technological University (Singapore) in May 2012", "Interview Descriptions": "The interview was relatively painless. I was living abroad at the time, so it was conducted via Skype. I was interviewed by three faculty members, who gave the interview an informal relaxed feeling, just trying to get a sense of my experience, research interests, and motivations for wanting to be a postdoctoral fellow at NTU.", "Interview Questions": "The research I proposed in my application was very much qualitative research, but I was asked in the interview to provide a way that I could provide a quantitative dimension to it, which was something that I, being a very qualitative researcher, had never considered."}, {"date": "27 Oct 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Nanyang Technological University (Singapore) in Apr 2012", "Interview Descriptions": "tedious, need to submit a proposal incl. some literature, two references (so you need to contact professors who taught you), bachelor and masters result slips, GRE and IELTS (for non-English-native), an application form, etc.", "Interview Questions": "what research topic or method do you have in mind?  (see if it's in line with any professor's interest - so do your homework and check out division's faculty background)"}], [{"date": "24 Feb 2016", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Mar 2012", "Interview Descriptions": "The interview is with the supervisor. The prof asked me to write a research plan by reading and picking one or two of his publications. After that he will ask for face to face interview before deciding.", "Interview Questions": "What you plan to do after 5 years"}, {"date": "28 Nov 2016", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Nanyang Technological University in Feb 2012", "Interview Descriptions": "I received an email and a phone call from HR regarding the interview. Interview was conducted by 3 ppl... the HR and 2 managers from the dept. They asked about my background and the job on offer.\r\n\r\n2 week later, I was called again for another interview. This time, I was asked some technical questions by another staff.\r\n\r\nI received an official offer a month later.", "Interview Questions": "Q. Are you ok with doing tasks outside your job scope?"}, {"date": "12 Sept 2016", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Feb 2012", "Interview Descriptions": "Good and strict hiring process. There are few parties attended interview from HR, business manager and project leader. Candidates are given overview about role and responsibility for job. Job itself provides alternative options for different career paths.", "Interview Questions": "What is your passion about this job"}, {"date": "21 Jan 2013", "title": "Research Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Jan 2012", "Interview Descriptions": "Need to find appropriate professor and research topic", "Interview Questions": "Do you have novelty?"}, {"date": "15 Oct 2015", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Jan 2012", "Interview Descriptions": "simple application with cv and personal statement. one interview which was straightforward about your interests and goals. the interviewers were professors so yu can get technical about the work you plan to do", "Interview Questions": "what will you get out of this program?"}, {"date": "9 Jan 2012", "title": "Project Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Jan 2012", "Interview Descriptions": "experienced engineer will be preferred", "Interview Questions": "what is your research plan"}, {"date": "6 May 2016", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Jan 2012", "Interview Descriptions": "interview is quite simply. most thing is based on your CV and your ability to do the project, publish paper and so on. Its quite individual, very much depend on your prof.", "Interview Questions": "Most is based on your CV and the project which you apply for"}, {"date": "24 Sept 2015", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Nov 2011", "Interview Descriptions": "Interview was pretty simple. There was only a HR representative from the school and my prospective supervisor in the interview. Questions asked were fairly straightforward.    Depending on the position that you are interviewed for, you may be asked to do an essay test (approximately 30mins).", "Interview Questions": "What do you in your free time?"}, {"date": "22 Dec 2012", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Nanyang Technological University (Singapore) in Nov 2011", "Interview Descriptions": "Interview by a very toxic director who share about her fight with another director from her department. Appear to me that she is trying to get me to side her, right from the start.", "Interview Questions": "I could not comment much on fight that was existing in the department."}, {"date": "16 Apr 2013", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nanyang Technological University in Aug 2011", "Interview Descriptions": "I was fairly easy. The professor already wanted to hire me before the interview so he only asked me briefly about my experiences and all the information he needed to fill out his interview form. After that, I was offered the job in the next few days. The whole hiring process is pretty simple and efficient.", "Interview Questions": "N/A"}], [{"date": "8 Jan 2013", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nanyang Technological University (Singapore) in May 2011", "Interview Descriptions": "First, the professor called me for an interview. It was standard questions such as\r\n1. Why are you applying for this position?\r\n2. Why do you want to leave your job?\r\n4. Describe your previous experiences that related to this position\r\n5. What is your weakness?\r\n6. What is your Strength?", "Interview Questions": "The professor ask me to describe in very detail of my previous project about embedded system."}, {"date": "25 Sept 2015", "title": "Nanyang Scholar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Apr 2011", "Interview Descriptions": "Single round of 1:3 Panel Interview. They will have your application form which includes your educational transcript and all other relevant data. They may refer to it and ask you questions from your past school records e.g. CCA, CIP, GCE 'A' Level grades. They may ask about why you chose the course to study in NTU. They may ask personal questions like your hobbies, career aspirations. It was rather free-flowing so you may be able to steer the conversation to your advantage if you mention an interesting story and they will want to find out more.", "Interview Questions": "I see that you have a friend from XXX Junior College, also applying for Nanyang Scholarship. If I only had one scholarship left, who should I give it to, and why?"}, {"date": "2 Nov 2012", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Nanyang Technological University (Singapore) in Mar 2011", "Interview Descriptions": "Face to face interview with supervisor", "Interview Questions": "Question related to your field of study"}, {"date": "3 Mar 2013", "title": "Research Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nanyang Technological University in Mar 2011", "Interview Descriptions": "Why did you choose to pursue a PhD degree instead of looking for a job directly after graduation?\r\nWhat do you think it's the most important skills that a research student should have?", "Interview Questions": "N/A"}, {"date": "23 Sept 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Nanyang Technological University (Singapore) in Feb 2011", "Interview Descriptions": "got the job info from Prof's webpage, then email my cv to prof, after 1 day, ask me to interview. ask previous working experience and what projects you have done, because this research is focus on game app, so prof ask some 3d,2d engine also.", "Interview Questions": "introduce yourself and share some working experience of you"}, {"date": "6 Nov 2010", "title": "Research Associate for Biomedical Engineering Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nanyang Technological University (Bedok New Town, ) in Oct 2010", "Interview Descriptions": "Before the interview, the professor asks me to create a table consistings of my skill lists (lab, computational skills) and their lovel of competencies. On the day of the interview, the professor asks me a few questions based on my CV (what is ur previous experiences) which she thinks it would match with the job requirements.", "Interview Questions": "Can you do cell culture? If you were asked to set up a laboratory experiment, which is similar to the one that you did in your previous company, can you do that?"}, {"date": "5 Aug 2014", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Nanyang Technological University in Sept 2010", "Interview Descriptions": "Supervisor interview with peer review.\r\nInterviewers will often take the time to guide you through the programmer's expectations and address your queries, so use these opportunities well.\r\nOn the day of the interview, show up punctually looking smartly dressed, unless you want to give the impression that the interview is just a means to an end for you to land a spot in university.", "Interview Questions": "Well prepared before interview"}, {"date": "3 Apr 2014", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Apr 2010", "Interview Descriptions": "normal interview", "Interview Questions": "N/A"}, {"date": "29 Oct 2012", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Nanyang Technological University (Singapore) in Feb 2010", "Interview Descriptions": "My previous boss recommended me to my current boss (both are colleagues), so I got the interview. The interview process itself was straightforward. I described my expertise and they matched with the requirements of the position. There was not much negotiations on the benefits, since the salary was from a research fund (hence fixed and limited amount of money allocated).", "Interview Questions": "Nothing unexpected or difficult question"}, {"date": "4 Jul 2012", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Nanyang Technological University (Singapore) in Dec 2008", "Interview Descriptions": "get called directly from supervisor. I was not in Singapore at that time, so there was only a phone interview. various questions were asked including basic and advanced questions. questions were all related to the project. so there is no direct comparison for different interviews. asked to provide 3 published papers to prove the ability.", "Interview Questions": "describe one major contribution of the published paper"}], [{"date": "3 Sept 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Nanyang Technological University (Singapore) in Jan 2008", "Interview Descriptions": "Need to contact the corresponding professor, or PI for the job openings. Interview might be taken. Then the application would be submitted to school for approval. This process might take 1-2 months. An oral presentation might be required to present your past research experience. The audience might be students or even professors in the division.", "Interview Questions": "Since this is a research position, more will be on your personal skill sets, and your goal and passion. "}, {"date": "6 Jun 2010", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Nanyang Technological University (Singapore) in Jan 2008", "Interview Descriptions": "Why do you want to pursue a PhD? What do you know about our research? What was your experience? When can you start work", "Interview Questions": "What do you know about our research?"}]]