[[{"date": "7 Sept 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Quick and easy; 30 min video call through Microsoft. Interviewer clarified that it was a screening interview and that there will be 2 to 3 more rounds of interview moving forward. Explained the job requirements and responsibilities and asked about schedule. I was looking for a part-time commitment, but it seemed like they were set on recruiting someone who would stay at least 2 years in their longitudinal study. Other interview questions were pretty basic.", "Interview Questions": "Why are you interested in this research?\nWhat previous experiences have you had?\nTell me about a conflict in the workplace and how you resolved it. "}, {"date": "10 Feb 2022", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "There was an initial phone screen call to discuss the position and interest in the position. The second call (zoom) was the full interview in which I spoke with the director of the program I had applied for, and two other supervisors. Standard psychological interviewing questions were asked with questions about prior experience, etc. Upon review, I was contacted with an offer for the position. When trying to negotiate the salary of the position, I was immediately and rather rudely told that my values no longer aligned with the values of the company, despite during both the interview and the offer indicating that I was exactly who they wanted to join their team. (I.E. I tried to negotiate a higher salary with options for alternatives such as a few more days of PTO and other incentives, nothing ostentatious but a solid market average for that position, and either because of my gender or my race/ethnicity or both, or the fact that I dare ask for market appropriate pay, I was immediately met with disgust and turned down).", "Interview Questions": "Discuss you previous related work experience and how that would contribute to your ability in this role?"}, {"date": "12 Aug 2021", "title": "Senior Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Aug 2021", "Interview Descriptions": "Right from the get-go the interviewers gave me a vibe that they weren't interested in me. I was met with suspicion for having an advanced degree and applying to such a crappy position. I guess they were being honest in some sense. One of the interviewers literally asked me \"are you sure you want to do this job with your qualifications?\" Needless to say, that set the tone for the entire interview and I was dying to get off the call. They ghosted me, as expected, but I'm relived. The only point of me doing this interview was to practice for more promising positions. I would of declined them if it went any further. Many of the reviews on Glassdoor note how low their salaries are.\n\nOn a more comical note, or sad one - depending on how you look at it, I asked them how do they like working there. And one of the individuals bragged that there is free parking, which is hard to get in Maryland... Sure, I get it. But I was expecting them to try and persuade me with something more convincing for wanting to be there. \n\nThe questions aren't too aggressive. They ask typical ones like going through your previous experiences on your resume and asking you if you would be prepared to relocate and do specific job duties.", "Interview Questions": "Going through your past experience.\nAre you comfortable working with children with disabilities?\nPart of the job requires you to get training in phlebotomy, are you comfortable doing that? "}, {"date": "28 Jun 2021", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "The interview process was via telephone and it was very thorough. I had a great time speaking with the recruiter. She made it a very lax experience and seemed to care about me as person versus just hiring me as an employee. She was able to speak well about the details of the company and answers a lot of my questions. It was very pleasant.", "Interview Questions": "What was background experience in research? "}, {"date": "15 Feb 2021", "title": "Community OUtreach Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Phone screen followed by in person interview with two people. In person interview was under an hour, sounded like they were still defining what this role would be. Lots of questions about how I would handle public speaking and presentation. Interviewers were warm but fast-talking, not always letting me finish my answers.", "Interview Questions": "How would you handle working out of the office and in the community 80 percent of the time?"}, {"date": "4 Feb 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "A less formal interview. Two co-PI, zoom interview. Chat with the project goal and timeline and your research experience. Ask a few questions related to your experience, basically those behavioral questions", "Interview Questions": "Walk us through your CV"}, {"date": "26 Oct 2020", "title": "Behavior Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "It was a very easy interview. I enjoyed it .They seemed to be interested in what I could potentially do for the company. I liked that about them. I did not feel like I could not be myself them. It felt like I was belonging to a family", "Interview Questions": "What are some challenges that you can describe yourself going through? "}, {"date": "6 Jul 2020", "title": "SLP-CF Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "The interview was pleasant. They asked great questions and tested skills by asking case-study questions as well as asking about specific interventions. The interview was modified due to COVID-19 and may be different for future candidates.", "Interview Questions": "What is something you learned from high- school?"}, {"date": "22 Apr 2020", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD)", "Interview Descriptions": "2-3 hours long, exhausting, and hard. Be prepared for lots of very detailed clinical scenarios to solve and a written portion that it SUPER long but you onlly get 15-20 minutes for. Some people don't finish that. There's no way to prepare aside from having lots of diverse peds experiences in grad school or past jobs. More importantly though-- don't work here as an SLP! you'll hate it here and the department is awful", "Interview Questions": "What have you enjoyed/not enjoyed about past clinical supervisors?"}, {"date": "1 Feb 2021", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Silver Spring, MD) in Oct 2019", "Interview Descriptions": "Very informative! I was asked questions while touring the various classrooms. I also got to speak to some staff and interact with some students as well in the classroom I was eventually placed in. Great experience.", "Interview Questions": "Q: Why do you want to work at Kennedy Krieger?\r\nQ: Do you have any experience with lesson plans and implementation?"}], [{"date": "3 May 2023", "title": "SLP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Sept 2019", "Interview Descriptions": "A few hours of meeting with different people, touring facility, answering questions about experience, and then being put in a room and asked to respond to case study questions. Questions were around procedures, standardized testing, referrals out, etc", "Interview Questions": "Who would you refer to if a child had sensory difficulties"}, {"date": "13 Jun 2021", "title": "Care Center Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute in Aug 2019", "Interview Descriptions": "The interview was conducted with 3 women on the panel. They ask a few questions and had exceptional pronunciation. They asked questions about my previous job,\r\nWhy I was leaving and what I could offer the company", "Interview Questions": "What’s your greatest strength? \r\nWhy do you think you’re a ideal candidate for this position. "}, {"date": "21 Aug 2020", "title": "Clinical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute in Jun 2019", "Interview Descriptions": "Brief 15 minute interview. Asked very expected questions, very kind recruiter that seemed excited about her job. Answered all of my questions, but maybe seemed to brush over the more important aspects that seemed like there were lots of concerns about in previous Glassdoor reviews.", "Interview Questions": "Why do you want to work at Kennedy Krieger?"}, {"date": "8 Aug 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jun 2019", "Interview Descriptions": "Met with one of the vice principals. Easy to talk to. Had a couple sheets of paper that they were asking questions from. After each answer, they would write down & make note of each answer. Interview lasted less than an hour.", "Interview Questions": "How would you assess that the students understood & learned the lesson you gave?"}, {"date": "16 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "It was a painless process overall. I applied online and was offered an on-site interview fairly quickly. On the day of the interview, I spent a couple hours meeting with various people within the department. The interview questions were pretty basic. I did have to complete a medication competency test. I was offered the job within the same week.", "Interview Questions": "Tell us about yourself and why you are interested in this role."}, {"date": "22 Apr 2019", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Had to go through two interviews so they can sit down and explain to you how miserable the job is and hope you show up for the second interview...\r\n\r\nthen they give you a tour of the unit and pretty much lie about everything that goes on, acting like the workers who are sitting around are acting as back up when they're really just on their phones.", "Interview Questions": "How have you responded on your worst shift ever?"}, {"date": "11 Mar 2019", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Mar 2019", "Interview Descriptions": "Very easy process. We started with a phone screening then went on to a in person interview two days later where I met with the recruiter. After the interview, I took tests on word and excel knowledge.", "Interview Questions": "What I knew about the company and why I chose this "}, {"date": "27 Sept 2022", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jan 2019", "Interview Descriptions": "It was good they asked questions I answered and I answered and did a trial of work day and visited the unit it was a good experience I had a tour of the unit and did two interviews and met the pt", "Interview Questions": "How did you hear about us"}, {"date": "31 Aug 2018", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Aug 2018", "Interview Descriptions": "I applied online and received an email the next day for an interview. My interview was the following week. I was told I would hear back within 2 weeks. I received an email the next day with my job offer.", "Interview Questions": "Difficult situations \r\nStrengths and weakness\r\nUnderstanding of IEP"}, {"date": "5 Jul 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jun 2018", "Interview Descriptions": "The interview process was pretty easy. It started with a phone screening. A week later, I went in for an interview with the HR department. They didn't contact me until about 2 weeks after that so I thought I didn't get another interview.  I went in for the second interview with 2 people and they were super nice and friendly. They described exactly what I'd be doing if I got the position. The interviews that I had lasted about 15 minutes each.", "Interview Questions": "Weaknesses, Strengths, Where do you see yourself in 5 years"}], [{"date": "12 Jul 2019", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Apr 2018", "Interview Descriptions": "Recieved a call within a week of application and was hired/oriented within a month. The interview was straightforward and fair. Very relaxed and friendly. The focus was on my experience and education then my personality and ethics as pertained to the student population.", "Interview Questions": "How do you handle stressful situations and working with others as a team?"}, {"date": "7 Jun 2018", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Apr 2018", "Interview Descriptions": "Interview process was extremely intense, understandably so knowing their level of expectations. A big chunk of the interview is you getting a tour of the facility as well as talking about pay and benefits. This was a HUGE con to me. Obviously, when interviewing typically you REALLY want the job, there is no need to \"sell\" us the position by giving us the amazing salary and benefits package before letting us know if we made it to the next round of interviews.", "Interview Questions": "Being timed "}, {"date": "29 Sept 2017", "title": "PTA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Asked questions about clinical experience and preferences on your treatment style, if you would rather work independently or as a team member, toured facility, saw equipment and different treatment settings, observed therapists working with patients, asked questions, talked about research opportunites and continuing education opportunities.", "Interview Questions": "What is one of your strengths"}, {"date": "20 Sept 2017", "title": "Ph Interen Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Hiring process was a bout 3 months. First you get through the first round and then the second round is a phone interview which was about 30 mins long and ask mostly behavioral questions and what kind of research you would like to do. Overall, the experience was not bad as I thought the process would actually take longer", "Interview Questions": "what are you strength and weaknesses\r\n"}, {"date": "20 Sept 2017", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Sept 2017", "Interview Descriptions": "I applied online and within the hour I received a call to do my first phone interview. The questions were your basic: where do you see yourself going, what are your goals, why do you think you'd be a good fit, salary expectations, etc. I spoke with Jocelyn and she made me feel very comfortable! I then came in a few days later for a second interview where I was asked the hypothetical type questions: if you were _______, how would you handle it? etc. I then did testing for Word, Excel, and typing. Keep in mind, at least for admin positions, they only test for your basic competency!", "Interview Questions": "When is a time when you did something wrong at work? How did you handle it?"}, {"date": "3 Aug 2017", "title": "Assistant Teacher II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jul 2017", "Interview Descriptions": "The interview was very laid back and made you comfortable, everything about the company was explained including benefits from the very beginning and then went into regular questions from a sheet a paper which I am sure is apart of the hiring process to include in your file. Overall, very easy going interview and a tour of the building was given afterwards following the question what do you think?", "Interview Questions": "General Questions: Asked about your previous work history, types of environments you've worked in with kids, and some challenges or behaviors you've had to deal with in the past. "}, {"date": "14 May 2020", "title": "Special Education Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kennedy Krieger Institute (Washington, DC) in Jul 2017", "Interview Descriptions": "I applied through linkedin and met with the director at an off-site location. We chatted over the requirements and my experience for about an hour. I got a call with an offer a few days later once my references were contacted.", "Interview Questions": "What is your experience with Universal Design for Learning?"}, {"date": "1 Jul 2017", "title": "Clinical Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jun 2017", "Interview Descriptions": "The first interview was with a group.  It provided information about the job and company.  At the end of the interview there is an activity with instructions.  The second interview is one on one.  The person giving the interviews was friendly and willing to answer questions.", "Interview Questions": "What are your short term career goals?"}, {"date": "10 Apr 2017", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Went for a tour of the school and was completed interview with two staff members. The questions surrounded experience with working with children and adolescents with autism and behavioral issues. The staff were friendly and the interview lasted about 1 hour.", "Interview Questions": "What is an IEP?"}, {"date": "22 Apr 2017", "title": "Clinical Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Apr 2017", "Interview Descriptions": "The interview was broken up into two sessions. The first one composed of learning a how to work with the patients at Kennedy Krieger, which you will get quizzed on later. During the first session you will be with other potential employees whom are also applying for the same job as you. The second one is a traditional one-on-one interview.", "Interview Questions": "N/A"}], [{"date": "12 Jan 2017", "title": "Clinical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Nov 2016", "Interview Descriptions": "I was called in for an interview expecting a traditional interview. The first part of this process was more informational - I learned about the position, Kennedy Krieger, and the amazing benefits package. I was with two other interviewees during this time. Individually we were asked to role play with the recruiter. At the end I was asked to schedule the second interview. The second interview was in ways more traditional. I was put in a room by myself to fill out a written questionnaire. After I was done the recruiter asked me logistical questions and took me on a tour of the Neurobehavioral Unit.", "Interview Questions": "How does this position align with your career goals and interests? "}, {"date": "14 Sept 2016", "title": "Clinical Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "This was easy. Because I was an intern, the person I worked with recommended me for the position. I was called in for an interview one week after my internship ended and my orientation began the following week. During the interview I was asked questions about 3-step prompting which I was already familiar with. She explained the salary, gave me writing prompt and then gave a tour of the neurobehavioral unit", "Interview Questions": "How would working here help with your career goals?"}, {"date": "14 Mar 2017", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at Kennedy Krieger Institute in Sept 2016", "Interview Descriptions": "Applied online, got a call back to schedule interview. Interview in downtown Baltimore, you need to get a visitor's pass. Interview was a one on one, She shows you a video and asks you what you think?", "Interview Questions": "Questions about availability and such and talks about pay and training period."}, {"date": "9 May 2016", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Referred by an employee. \r\nAsked to send in CV. \r\nQuick phone interview asking basic biographical questions. Asked to come in for an interview.\r\nOn-site interview was about 1.5 hours which included a tour, session with a current employee (more about seeing what working at KKI was like), and a interview with the manager. The interview with the manager involved talking about relevant skills, previous work experience, and behavioral skills.", "Interview Questions": "Why do you want to work at KKI?\r\nTell me about your previous work experience. \r\nWhat is your research experience? Have you been published? What was your research about?"}, {"date": "16 Jun 2016", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in May 2016", "Interview Descriptions": "After the second interview, I was told I would hear back within two weeks. I never heard back whether I had made the next interview. After contacting the recruiter, she said she would find out the answer from the director the second interview was with, but then never got back to me about it. Extremely unprofessional and very poor communication for such a renowned organization.", "Interview Questions": "Basic interview questions: strengths, weaknesses, work style, situational questions. "}, {"date": "17 Jan 2016", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Met with the investigator I would be working for and we went to a nearby coffee shop. It was fairly casual and the position was described, along with a few of the projects I would be working on.", "Interview Questions": "What experience do you have that qualifies you for this position?"}, {"date": "6 Jan 2016", "title": "Clinical Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kennedy Krieger Institute (Baltimore, MD)", "Interview Descriptions": "The interview process was quick and simple. Was initially contacted via email about scheduling an in-person interview. Completed the first and second interview in one day, followed by a tour of the facility.", "Interview Questions": "Describe a time you've encountered a challenge with child behavior and how you resolved it."}, {"date": "14 Feb 2018", "title": "Therapeutic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Aug 2015", "Interview Descriptions": "I applied online and received a call a week later to schedule an in-person interview. I was asked to create a lesson plan for an art activity based on information sent to me via email. After the interview, I submitted a reference list for Kennedy Krieger to contact past employers. About 5 days later, I was offered the position via phone.", "Interview Questions": "What experience do you have in the field? "}, {"date": "23 Mar 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jul 2015", "Interview Descriptions": "I called the laboratory director because I heard through a mutual connection that she was looking for a part time lab manager.  She confirmed what she was looking for and I told her was interested in applying for the position. I with the laboratory director in-person and we got along fabulously. I was offered the position on the spot.", "Interview Questions": "How many years experience  do you have in biomedical research?"}, {"date": "22 Feb 2015", "title": "Junior Marketing Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "Only made it to one in-person interview with senior staff members. After an in-person interview, they never responded to my emails to find out if I was still being considered. Incredibly disappointing after bringing someone in, and not very smart for a nonprofit--you should treat everyone as if they are a potential donor to your organization.", "Interview Questions": "I was asked questions around competencies that were not specified in the responsibilities or requirements of the job listing. "}], [{"date": "31 Aug 2016", "title": "Transition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Dec 2014", "Interview Descriptions": "I met with four members of the administrative team. They took turns asking leading and clarifying questions pertaining to aspects of my potential job. They made me feel at ease during the interview.", "Interview Questions": "Discuss a time I encountered, and how I handled, conflict within the workplace. "}, {"date": "22 Jun 2014", "title": "Research Assistant I Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "I applied the position online. And got an interview in about 2 weeks. The phone interview is mostly going through the resume, introducing what they are doing, etc. One week after I got an onsite interview. The PI interviewed me, still some basic questions about my current work and future plan.", "Interview Questions": "Not so many difficult questions, for there was no actual technical question."}, {"date": "23 Mar 2014", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Kennedy Krieger Institute", "Interview Descriptions": "One on one interview. Took less than an hour", "Interview Questions": "Very easy interview"}, {"date": "25 Jun 2018", "title": "Special Education Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jan 2014", "Interview Descriptions": "The process was rather easy, as I had already been with the company. My potential supervisor and a neutral party interviewed me together and both took scrupulous notes, which was a bit unnerving at times.", "Interview Questions": "How would I handle a situation if I were teaching a lesson and a behavior situation arose which also needed my attention?"}, {"date": "27 Jun 2013", "title": "Research Assistant I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Kennedy Krieger Institute in Apr 2013", "Interview Descriptions": "Process took about 3 months from online application to on-site interview to offer.  On-site interview included a tour of the lab and 30-45 minute interviews with five key researchers/personnel.", "Interview Questions": "What is your proudest achievement? "}, {"date": "18 Jul 2015", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Apr 2013", "Interview Descriptions": "we exchanged emails to set up the interview dates. the interview was a group format with two other people. we all watched a powerpoint presentation on the company and some details about the benefits and pay. then we were walked through a demonstration on how to handle a situation with a problem child and asked to repeat the process according to what she had just shown us. then we individually interviewed with her. about a day later i received another email stating i was considered for the position and if i was accepting it.", "Interview Questions": "where do you see yourself in ten years, can you see yourself growing with the company, describe a time where you had to problem solve a difficult issue and how did it make you feel"}, {"date": "29 Apr 2013", "title": "Research Assistant I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Mar 2013", "Interview Descriptions": "Check the online status of your applications regularly! Very good about scheduling the interview, reached out to me by phone and email, and it took about a day to confirm the interview for a week later. Interview was with a small panel, standard questions. A week later, I heard back about an offer, but declined due to the salary.", "Interview Questions": "Specific questions about how you would react to situations that might come up. Really have to know your stuff, because most of those questions are tricks. "}, {"date": "18 Aug 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Jul 2012", "Interview Descriptions": "I submitted my resume to the company website many times before being contacted. I eventually received a call for an interview.  My one on one interview only lasted about 30 minutes then I was given a brief tour.  I was offered the job about a week later.  The employer sent an orientation packet to my home to be completed prior to new hire orientation.", "Interview Questions": "Why I wanted to work with children with autism?"}, {"date": "19 Apr 2012", "title": "Clinical Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Mar 2012", "Interview Descriptions": "Applied online at the career section of their website. Got a phone call from an HR rep like a month later. She was very thorough and cordial - went over the details and responsibilities of the position, the pay rate, and what shifts were available. After I agreed that everything sounded like something I would be willing to do, I was then asked to come in for an in-person interview. Was scheduled for the next week.  \r\n\r\nDressed professionally and brought in all of my information (cover letter, resumes, and transcripts if she needed them, along with a notepad and pen). Also showed up early and thankfully for me, she was free to start the interview earlier than we had scheduled for. We exchanged pleasantries and then she went over the position again and all of the information to make sure that it was a position I wanted to step into. After that, she showed me some case studies on a laptop that she had set up beforehand and we went over them. I made sure to take notes while she explained things to me and asked questions about the case studies (just so that she would know that I was interested in everything that the organization did). \r\n\r\nAfterwards, we role-played a situation I might find myself in with this position (that part was actually fun even though I wasn't expecting it and at first it kind of threw me off guard). I told her that I had fun and she said that I handled myself very well in that situation. She immediately asked me to come in for a second interview after that. We set it up for a few days later.\r\n\r\nThe second interview went right to the nitty-gritty right after we shook hands. She asked me to sit down and then told me that I would be given a test! Thankfully, I actually don't mind tests/exams, so it was cool with me (even though I wasn't expecting *that* either). She gave me the information beforehand and asked me to read over it before beginning. Then she left me to my own devices for about 30 minutes. It was an easy test since I was left with the information, with about 20 questions asking what certain situations called for and what actions to take regarding patients. The back of it had a few short answers and then just some general questions about why you would want to work here, etc, etc.\r\n\r\nAfter half and hour she came back in and she basically scored my test and we went over it together. I got all but one right, but it was all very informal and comfortable. No tension whatsoever.  She was very, very nice. After the test business, she asked me some basic interview questions. I answered them all with ease. After going through the ringer with role-playing and test taking, the conventional interview question was a breeze and actually a little welcome. She told me that she liked everything she had heard and she would love to offer me the position BUT she had to check my references first. Which is the REAL reason why this interview process took so long. For some reason she could not get a hold of the references I provided right away and it took a few weeks. She did keep me updated throughout the whole process though, which I really appreciated.\r\n\r\nFor this reason, I missed the date for the training class in which she intended me to be in, but I was placed in the next one. All's well that ends well, I suppose.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Dec 2009", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Kennedy Krieger Institute (Baltimore, MD) in Nov 2008", "Interview Descriptions": "I applied online through the Kennedy Krieger website. I was contacted via phone by the director. He explained the position being offered, briefly. We arranged an interview for a few days later. The day of the interview I was asked standard interview questions, had the organizations workings and goals explained to me, and was given a tour. At the end of the interview, I was told the salary range and asked how interested I was in the position.", "Interview Questions": "How I would deal with specific situations."}]]