[[{"date": "6 Aug 2020", "title": "Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Community Connections", "Interview Descriptions": "The interview process was relatively informal. It began with a phone call to schedule an in-person interview. The in-person portion was with the group manager. Basic questions to gauge interest and baseline skills. Good and easy experience.", "Interview Questions": "How do you multitask when presented with several pressing items?"}, {"date": "28 Jul 2017", "title": "Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Community Connections (Washington, DC) in May 2017", "Interview Descriptions": "2 part interview. Interview is dead on. You get to shadow current employees to decide if you could see yourself in their shoes. Only negative is that they will tell you what you want to hear to hire you.", "Interview Questions": "If you went to a consumer's house and they were under the influence, what would you do?"}, {"date": "30 Nov 2015", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Connections", "Interview Descriptions": "Applied on line. Interviews with both a manager from the department where I would be working as well as with the CEO. You were offered the opportunity to shadow a Community Support specialist in the field to get a better understanding of the requirements of the job.", "Interview Questions": "One question was about why I would stay with the company."}, {"date": "10 Feb 2017", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community Connections (Washington, DC) in Aug 2014", "Interview Descriptions": "Was brought in and shadowed for entire workday (was not informed ahead of time that I would be there for entire day). Staff seemed eager to hire, as they have high burnout rate. After shadowing with CSS in the field I was brought to meet with CEO Maxine Harris. Was offered the job at the end of the interview.", "Interview Questions": "How do you manage conflict or anger "}, {"date": "25 Apr 2014", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Community Connections", "Interview Descriptions": "email and phone and interview and hired", "Interview Questions": "N/A"}, {"date": "1 Sept 2015", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Connections (Washington, DC) in Mar 2014", "Interview Descriptions": "The interview process is more of a hands on interaction. You spend time with the team supervisor answering questions and telling about yourself. The next portion is a full 8hr shift of Shadowing, observing, and afterwards reporting back what you experienced. Your last interview is with the CEO and is VERY intense", "Interview Questions": "CEO ask tough probing, and intimidating questions"}, {"date": "26 Oct 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community Connections (Washington, DC) in Dec 2013", "Interview Descriptions": "At the time, just interviewed with the CEO directly. No interview with supervisor under whom you'll be working. Maybe lasted 25 minutes, and was offered a position at the end of the interview.", "Interview Questions": "Potential cases with clients with mental health symptoms, asked what I would do in a situation like that."}, {"date": "17 Nov 2015", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Connections (Washington, DC) in Jun 2013", "Interview Descriptions": "I met with the Clinical Director and the supervisor for the team in which I applied. I then spent the remainder of the day shadowing a current staff member to get a feel for the position. At the end of the day, I met with the CEO for a final review.", "Interview Questions": "I was asked about previous experiences by the Clinical Director and supervisor. The CEO asked more personal and intrusive questions."}, {"date": "9 Sept 2017", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Connections (Washington, DC) in Feb 2013", "Interview Descriptions": "The interview process was disorganized because they asked me to do multiple interviews and meet the team before being clear on whether they were planning to make an offer. I came for the first interview, then was called the morning of the second interview/meet the team, but I declined because I had another offer and felt it's unfair to continue returning for meeting the team  without first having an offer.", "Interview Questions": "Previous experience"}, {"date": "6 Oct 2015", "title": "Rehabilitation Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Community Connections (Washington, DC) in Jan 2013", "Interview Descriptions": "First there is a phone screen that covers basic questions. There are there face-to-face interviews (supervisor, director and CEO). Prior to meeting with the CEO, you are expected to shadow the team for a day.", "Interview Questions": "Do you own a car?"}], [{"date": "14 Aug 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Community Connections (Washington, DC) in May 2012", "Interview Descriptions": "Very extensive - interviews with other directors, shadowing experience, interviews with senior leadership. I had the sense that they wanted to see me in action, that they really care about the match in values and that they were looking for high quality employees.", "Interview Questions": "What is your vision for this agency?"}, {"date": "3 May 2016", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community Connections (Washington, DC) in Mar 2012", "Interview Descriptions": "Prepare for a day-long interview where you \"shadow\" other community support specialists.  I support this approach as it does give you an idea of what the job is like.", "Interview Questions": "What is your greatest strength?"}, {"date": "9 May 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Community Connections (Washington, DC) in Jul 2011", "Interview Descriptions": "There was a required all day Field visit to meet clients and see interaction and comfort level in the community following a , face to face interview with senior management and team supervisor to assess understanding of work and nature of job then there was a face to face with the  CEO to determine overall fit with the team and agency. Final detIls of salary were entered here", "Interview Questions": "Goals for career"}]]