[[{"date": "17 Feb 2023", "title": "Utilization Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Highland Hospital in Feb 2023", "Interview Descriptions": "The interview process went smooth. Was effective. Provided for opportunity to ask questions. Was positive and friendly atmosphere. Questions asked of me were fair and Provided opportunity for me to showcase my experience and what I can bring to this position.", "Interview Questions": "Why would I be right for this job"}, {"date": "21 Jan 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Highland Hospital (Oakland, CA) in Jan 2023", "Interview Descriptions": "Staff and employers really warm and inviting. They offered a tour of the potential work environment and answered any questions that I had. The questioning was typical questions pertaining to the field and they explained how operations ran and the expectations to come.", "Interview Questions": "How did your previous experiences prepare you for this role?"}, {"date": "26 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Highland Hospital", "Interview Descriptions": "Quick, easy interview process. Was on the phone because it was for a travel contract. The nursing manager was very kind and answered all of my questions adequately. I got an offer within the 72 hours", "Interview Questions": "I don't remember, but it was mostly experience questions"}, {"date": "11 May 2022", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Highland Hospital", "Interview Descriptions": "It was very casual, light, easy going.   Very nice and friendly people.  I\r\nThe interview process was short, and then I shadowed for a couple hours.  I heard back within one week.", "Interview Questions": "My experience with my last employer."}, {"date": "6 Mar 2022", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Highland Hospital", "Interview Descriptions": "It was over the phone due to covid. Very straightforward. HR called to set up date and time. Interview came and said they’ll let me know within a week and got a call back less than a week after interview.", "Interview Questions": "What are your Strengths and weaknesses "}, {"date": "27 Dec 2021", "title": "Intake Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Highland Hospital in Oct 2021", "Interview Descriptions": "Received a phone call and a very informal conversation to gauge interest/schedule an interview.  \n\nInterview happened the next day over the phone with two members of management.  The questions were very basic.  Then, they called back a few hours later to offer me a job.", "Interview Questions": "What is your one of your weakness?"}, {"date": "12 Jul 2017", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Highland Hospital (Clarksburg, WV) in Jul 2017", "Interview Descriptions": "It went Swiftly. They are very nice people. I was interviewed by two people.  Everyone was understanding and treated me with respect.  They described the job very well and answered all my Questions. I felt very comfortable.", "Interview Questions": "They ask how you would handle certain situations. Such as, verbal abuse, suicidal behavior, boundaries,  and How you view yourself. "}, {"date": "29 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Highland Hospital (Rochester, NY)", "Interview Descriptions": "I applied on line.  Was then called on the phone interview which I felt was more of a pre-screening call.  Confirming current employment, skills and an opportunity to ask a few questions about the position.  This turned into an in person interview, interviewing with the Department manager and then a few others from within the Department all on the same day.  Shortly, I would say within a week I made an offer and accepted the position.", "Interview Questions": "Experiences in current employment and how they would fit in position applying for."}, {"date": "23 Mar 2017", "title": "RN Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Highland Hospital (Rochester, NY) in Mar 2017", "Interview Descriptions": "They called me a day after I put in my application. New nurse to graduate in May. They had me come in for two interviews and two shadows. I got to pick from a list of floors that were hiring. They were very quick with everything and very organized.", "Interview Questions": "What would a manager say about your strength? ( during a performance review)"}, {"date": "8 Apr 2018", "title": "Student Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Highland Hospital (New York, NY) in Nov 2016", "Interview Descriptions": "Very easy. Applied got in within 1 week, then spoke to HR. After that I had to speak to the manager on the unit and then i was accepted into the job very easily. it was a very easy interview, very easy to get into. once HR passes you, you pretty much got the job.", "Interview Questions": "Why do you want to work here?"}], [{"date": "17 Mar 2017", "title": "ORT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Highland Hospital (Rochester, NY) in May 2013", "Interview Descriptions": "First interview is a human resources interview.  If you pass that, there is the second interview with the hiring nurse manager.  The interview with the nurse manager had another nurse leader in there as well.  The interview was average in difficulty.", "Interview Questions": "Why do you want to work here?"}]]