[[{"date": "19 Feb 2023", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Pima Community College", "Interview Descriptions": "I was interviewed in a room with 4 people. After the interview concluded I was asked to solve some math problems. I ws worried of not knowing the answers but they were not strict about it. I got some wrong and still got the job.", "Interview Questions": "Why do you want to become a tutor?"}, {"date": "16 Nov 2021", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pima Community College (Tucson, AZ) in Nov 2021", "Interview Descriptions": "I had a horrible interview experience with a specific department, I can't speak for all of Pima's departments, but I would encourage an HR Rep to attend all interviews, as there was a miscommunication with the job description. I read the job description four times to develop questions to ask in the interview,  one of the interviewers was dismissive of my questions and made comments that made me appear oblivious to the role. I don't think she had read the job description but held the role prior.  Realistically, I just don't think I was their \"type\" meaning departmental fit and that happens sometimes. Although some departments need to work on implicit hiring biases, we all have them.\r\n\r\nTo add insult to injury, I received a personal rejection email that was writing in a font used for comic strips, it was hard to read, and gave the impression that I couldn't take the person in this position seriously. I've  used the font several times in marketing materials for children, but you have to increase the size of it to make it easier to read, it has too many quirky tails, but I would never use it compose  business/workplace emails. It screams unprofessional to me. I believe presentation is everything, especially from someone who would be my boss, I want to learn by example. This was my dream job with a staple in the Tucson community, wasn't in the cards. I would apply for jobs at Pima again, just not that department.", "Interview Questions": "The questions are about role, no behavioral interview questions, which is great, since I'm an introvert, it's harder for introverts to interview, it doesn't feel like a conversation but an interrogation. I can see how extroverts, the outgoing, would prevail in this space."}, {"date": "8 Jun 2021", "title": "IT Service Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pima Community College in Jun 2021", "Interview Descriptions": "I applied directly from the website and they called me to set up an interview within 2 days. It was a Zoom video interview with a couple of people present from the department", "Interview Questions": "\nWhat is your experience with mobile devices?"}, {"date": "3 Aug 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pima Community College (Tucson, AZ)", "Interview Descriptions": "There was a delay from when the job closed and the first activity. Then a panel interview where the questions were scripted, but I was allowed to ask questions at the end. Then a second interview with the hiring manager and boss of hiring manager. Then a lengthy delay before the new hire was announced.", "Interview Questions": "How did that job fit into my career plans."}, {"date": "4 Jul 2018", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Pima Community College", "Interview Descriptions": "This was a three part hiring and interview process:  by administration from different campuses, by Full Time Faculty from different campuses, and a teaching demonstration in front of admin and prospective colleagues from related disciplines.", "Interview Questions": "What would you do if you encountered ______(different problems)______ students?"}, {"date": "21 May 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Pima Community College (Tucson, AZ)", "Interview Descriptions": "Application, phone/video interview, then a panel interview, and offer by phone. Pretty professional and very well organized. Just took way too long, five months, from application to interviews to offer.", "Interview Questions": "Experience"}, {"date": "20 Feb 2021", "title": "Biology Laboratory Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Pima Community College (Tucson, AZ) in Jan 2018", "Interview Descriptions": "I had an interview invitation 4 days in advance. Closed room, and personal questions. It was at the manager's office within the laboratory and there was a friendly and welcoming environment.", "Interview Questions": "Real-life situations with personal information"}, {"date": "9 Oct 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pima Community College", "Interview Descriptions": "It was a slow process but it was positive and good experience. I was given  an opportunity and decided to take it. Overall it was good. \r\nNothing else to mention. Good place to work.", "Interview Questions": "N/A"}, {"date": "13 Dec 2016", "title": "Laboratory Specialist, Chemistry Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pima Community College (Tucson, AZ) in Dec 2016", "Interview Descriptions": "Scheduled 35 min. panel committee interview at 12:15pm over telephone conference call; HR rep sits in to answer questions and keep on time.\r\nSix pre-written questions were to be sent via email 12:06pm minutes before the interview for preview.", "Interview Questions": "Discuss education, experience, and career objectives."}, {"date": "10 Feb 2016", "title": "Community Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pima Community College (Tucson, AZ)", "Interview Descriptions": "Professional. I was interviewed by a former commander and a Sgt. They were very laid back but professional. Please dress professional. And it helps to have a high interest/background/education in criminal justice.", "Interview Questions": "Where do you see yourself in 5 years?\r\nWhat type of educational background do you have?"}], [{"date": "27 Jul 2016", "title": "IT Help Desk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pima Community College (Tucson, AZ) in Dec 2015", "Interview Descriptions": "They contact you and you meet with 5 other coordinators and directors who ask you a bunch of questions that at the end result have nothing to do with your actual job and you end up wasting time.", "Interview Questions": "What is your experience in customer service?"}, {"date": "16 Oct 2015", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pima Community College (Tucson, AZ) in Sept 2015", "Interview Descriptions": "I was brought in for an initial interview with a large committee of about 5 or 6 people. I gave a 10-minute presentation at the end. Later that same day I was asked  to come in the next day for the final interview. It was with two people and I had to give another presentation to demonstrate my facilitation skills. The interviews themselves weren't difficult but involved some preparation beforehand.", "Interview Questions": "How do you work with a difficult SME?"}, {"date": "25 Jul 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pima Community College (Tucson, AZ) in Aug 2015", "Interview Descriptions": "The process went well.  However the senior management argued and could not agree on answers. The interveiw was not monitored by HRMS.  I believe questions about age, and political views as well as opinions on immigration should not be asked", "Interview Questions": "Good questions"}, {"date": "18 Aug 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Pima Community College (Tucson, AZ) in May 2015", "Interview Descriptions": "interview is easy, they just ask about your courses and ask to see your transcripts.\r\nAlso ask some behavioral questions, what would you do if a students lashes out emotionally etc.\r\nThey make sure you understand that you will be dealing with a wide variety of students, but also that you can ask for assistance from other tutors/faculty if a problem truly stumps you.", "Interview Questions": "What math courses have you taken?"}, {"date": "21 Sept 2014", "title": "Laboratory Technician, Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pima Community College in Aug 2014", "Interview Descriptions": "Applied online. Got a call the following week for an interview on Monday. The interview was OK; 30 minutes long, and had time to ask questions. It was a 1:1 interview with the Laboratory Supervisor. I was offered the job the following day (on Tuesday), and I finally accepted it by Thursday. HR took about 2 weeks to get in touch with me. I finally started to work a week after I submitted all the documentation to Human Resources. It was pretty straight forward.", "Interview Questions": "Since I had a couple of interviews before related to the position or something similar, and having a good background in science, I didn't find any of the questions to be difficult."}, {"date": "9 May 2014", "title": "Principal Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pima Community College", "Interview Descriptions": "The hiring and interview process is rather painful.  Assuming you aren't screened out by HR you are interviewed by a committee of 3 to 5 people.  It is almost completely scripted and the committee must make a decision on who to send to the second interview by the answers to 5 to 10 questions.  The second interview is much less formal.", "Interview Questions": "The questions vary wildly depending on the job being filled.  Questions are usually written by either the supervisor of the position or the director of the department."}, {"date": "10 May 2016", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Pima Community College (San Tan Valley) in Feb 2013", "Interview Descriptions": "It was short and to the point. I didn't have any experience as a sales associate but I have plenty of customer service experience therefore it helped me get in. I mentioned pretty much the jist of what is on my resume. She asked about previous experience. I did, however, have experience in the sales associate job but it was not mentioned on my resume as it was a long time ago but she consider my previous experience and just saw that just by our conversation that I was good at customer service.", "Interview Questions": "Are you interested in becoming apart of our team?\r\nWhat is your previous experience?"}, {"date": "14 Feb 2013", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Pima Community College (Tucson, AZ) in Jul 2012", "Interview Descriptions": "Disorganized, last minute, and complete mystery as to the qualifications they were looking for.  They asked me to prepare a short lesson on \"student success\" but then seemed surprised when I had actually prepared a lesson.  Very confusing!", "Interview Questions": "They wanted me to do a role play but the person playing the student was just bizarre!  I've taught for 7+ years and am a licensed counselor.  If someone acted this way in real life, I would assess for severe cognitive impairment and refer to disability resources office!  They must have wanted a certain, specific phrase or response.  But, with years of teaching and counseling, it was still a mystery to me.  They praised me highly and went on and on in person and via email... then abruptly hired someone else.  Was basically a waste of time.  \r\n\r\nIn my experience, PCC already knows who they want to hire.  They only post a position and interview other candidates because they have to by law.  In reality, it's just to check off that they did it.  So, if your dept chair didn't invite you to interview, you're probably wasting your time!"}, {"date": "1 Oct 2013", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Pima Community College in May 2009", "Interview Descriptions": "Submittal of application and letter of interest detailing your experience in the field, communication of your philosophy of the ideas presented in a questionnaire.", "Interview Questions": "Not applicable.  I was well prepared."}, {"date": "14 Jan 2013", "title": "Fiscal Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Pima Community College (Tucson, AZ) in Feb 2009", "Interview Descriptions": "After submitting your online Application, the HR dept. will conduct the initial screening.  If you do not make it to an initial interview, you will receive a \"thanks but no thanks\" email.  If you are selected for an initial interview, you will receive a phone call to schedule it.  After passing the initial interview, you can expect 1-2 more interviews with College Administrators before being selected to fill the vacant position.  If at any time you fail the interview, you will receive the aforementioned \"thanks but no thanks\" email.\r\nInterviews are very structured in the fact that the HR rep assigned to your interview will meet you shortly before the start time and give you written versions of the interview questions.  You are allowed to bring your resume and notes with you.", "Interview Questions": "Where do you see yourself in 5 years?"}]]