[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not worth it", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jan 2014", "job_title": "Manager in Quito", "duration": "N/A", "pros": "The chance to meet the individuals in the communities where the organization is trying to make a difference. They are good people.", "cons": "I can speak from my own experience of sacrificing my life to this organization only to be tossed aside like garbage once they had used me. This is exactly what they do on a whole with employees, not only in Canada but also in other countries. They take advantage of your good intentions, youthful energy, and desire to make this world a better place. They are very sneaky about it, and use techniques that feel like brainwashing. They make you feel guilty, they make you feel indebted to them for them giving you the opportunities that they give you, and they make you feel like dirt if you do not sacrifice yourself willingly. \r\n\r\nI was sent to another country to work. I was not provided with the proper legal visas and thus was cut off from my working rights. I was made to work so many extra hours that I hardly had my own life anymore. I was expected to do all of this, working nights and weekends, working 24/7 for over a month at a time, without any extra pay, any lieu time, nothing. I am one example of this type of treatment, and I am not an anomaly. I am one of hundreds of people who work for this organization who are treated in the same way. I am one of countless individuals working in developing countries who are expected to work without proper visas and without receiving proper pay and benefits. \r\n\r\nIt is true that if you are driven and passionate you will succeed, I succeeded with this organization because I worked so extraordinarily hard. However, I stopped believing in working for an organization with such unbalanced expectations of staff. I believe that if you are going to sacrifice your life and dedicate yourself to something it should be something that is done right, something that you can put your name behind because you know that things are being done correctly. I know for a fact that this organization is not doing things correctly and that they try to hide behind photos of happy children. People need to know that, although they are doing a lot of good things in a lot of countries, they are also able to do these good things because they do not operate correctly. They take advantage of their staff, many of which come from the same communities that they claim to be helping. They do not pay them properly and tell their managers to discourage them from looking into their labour rights. They quite simply use people. \r\n\r\nFor me this is a CON. Even though it is an organization where you can learn a lot and have opportunities to be creative and to travel and to be a part of something interesting, the very base of it is wrong. Those in charge know that they are doing things incorrectly. They willingly place people in situations that they should not be placed in and expect them to sacrifice their own sense of morality in order to protect the larger 'vision'. They know they are not doing things correctly, but they hide this truth and fight to hide it with tooth and nail. \r\n\r\nYou will be bullied and intimidated, or made to feel guilty. You will be told many things that are not the truth. You will be not only asked but required to do things that you know should not be done. You will be required to work extra hours without extra pay or time off. You will be required to help build a very specific and protected image that does not reflect reality. You will be treated with disrespect from upper management, and if you question what is happening you will flat out be treated like garbage. You will be thrown out on the street if you live in their staff housing. You will be treated as if you do not matter at all."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "disheartening, disillusioning and despicable treatment of good and talented individuals", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Jan 2014", "job_title": "Manager in Quito", "duration": "N/A", "pros": "working with the incredible individuals in the communities in Ecuador where the organization is trying to make a difference. \r\n\r\nhaving the opportunity to work with diverse and talented individuals.\r\n\r\nopportunity to be creative, create new programs and projects in other countries\r\n\r\nbirthdays are off (although I was always required to work, with no choice in the matter)\r\n\r\nholiday office shut down (which is still not enough for the lieu time that is owed to individuals)", "cons": "For an organization with a mandate to inspire youth and free children from situations of poverty and exploitation the directors and upper management of this organization have lost their moral compass along their way. As many others have explained in their own reviews of their experiences with Free the Children and Me to We, employees are treated in an absolutely despicable and disheartening manner, and upper management and the directors are absolutely unapologetic about it.\r\n\r\nEmployees of Free the Children (FTC) are typically young and idealistic individuals with hopes of gaining experience in the development sector and are typically working their first big jobs after graduating university. FTC seems like an ideal start to your future career, being touted as the #1 employee for youth, and the largest network of youth helping youth, and an environment where you are encouraged to grow and learn and be creative. Unfortunately for these eager and big-hearted new employees the workplace environment has been carefully constructed in order to shame and guilt employees into working extraordinary hours above and beyond their paid word week, without even a glimmer of a hope of being compensated. If someone questions these practices they are given stern warnings and lectures by upper management to \"live the core values\" and to fall in line. The expectations to give and give and essentially sacrifice your time, energy and life to this organization is astounding. It is an absolute expectation from upper management, most likely because they themselves are the people who started the organization from scratch and sacrificed themselves to help it grow. The problem is that the organization is no longer a small group of friends operating out of a basement. It is a large organization that needs to be led by serious and mature individuals, not people with puffed-up titles and no grip on how a serious organization should be run. \r\n\r\nAlthough you are given some incredible opportunities to be creative and learn new things, it comes at a very high cost of needing to work incredible extra hours without being given extra pay or time off. You are replaceable and easily discarded, which is reflected in the extremely high turnover rate of the 300 employees working around the world. \r\n\r\nNot only are these practices morally deplorable, but in many of the countries where this organization is working, these practices are illegal. However, that doesn't stop them from continuing to conduct their business in such a manner. Employees are required to fudge the truth in order to work in other countries, and as a manager one is required to stay quiet and not discuss local employment standards and rights with local employees who are also required to work overtime without extra pay. Employees from Canada are used as facilitators to travel overseas and lead youth trips, working 24 hours a day for upwards of 20 days straight under incredibly stressful conditions, only to be given 2 days off, despite working weekends, holidays, nights, etc... \r\n \r\nIf you are an individual who is comfortable with being exploited and are in need of being brainwashed by core values and living to the standards that your upper management deems necessary, or an individual comfortable with telling lies or hiding the truth from others, this is an environment that you will be comfortable working in, and in fact would excel in. \r\n\r\nHowever, if you have a strong moral compass and are looking for a workplace that allows you to maintain your moral integrity, you should look somewhere else. Even if you have wonderful ideas on how to help them improve and the motivation to make a difference, upper management will not respect this and will instead take it as an affront to their tried and true methodology. \r\n\r\nThis is an organization that is perfect for a push-over who is willing to devote their LIFE, every moment of it, to the job. It is perfect for someone with low self image, because you can be easily moulded. It is perfect for those who do not want to speak up. It is perfect for people who do not mind being taken advantage of. It is perfect for people who are happy to look the other way when they know something is wrong.\r\n\r\nIf you are not that kind of person, do not work here, because if you do it will be a constant challenge, and not the pleasant challenge of learning new things and becoming a better individual. It will mean that your upper management will constantly challenge you and test you to see if you will give up and conform to the expected exploitation."}], []]