[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Nutrition Aide", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Apr 2015", "job_title": "Nutrition Aide in Saint Paul, MN", "duration": "N/A", "pros": "Great pay for part time ($14.xx starting) and the hours are great, especially if you are in school (6:45-3:15 or 3:15-8:15). Shifts are also easy to pick up if you want extra hours due to being extremely short staffed daily. Convenient location. My advice: apply as a casual so you can pick up as many shifts as you want and you wont be confined to working every other weekend and not being able to request days off.", "cons": "Poor management, difficult scheduling time off or trading with coworker, overworked because it is consistently understaffed. Every month management is adding duties to jobs, making the employee take on more and more, burning everyone out quickly. Management thinks they are better than employees, thus not helping out - will stand there criticizing you while all the employees are running around trying to get their dozen duties done. Most days you will not get breaks, barely getting your lunch."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Jan 2021", "job_title": "Psychotherapist in Woodbury, MN", "duration": "N/A", "pros": "Flexible. Good compensation. Pick your area if work.", "cons": "Some disorganization. Quick paperwork turn around expectations"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Note to Fair View", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 May 2017", "job_title": "Patient Financial Services", "duration": "N/A", "pros": "A lot of great employees that are in desperate need of good management.", "cons": "Horrible management- From top to bottom! FV clean them all out and start fresh!\r\nForced VBI- Note to HE. Don't bother telling me that it's not forced. It is. They count the number of ideas that you come up with each month. It's gone over in roundings and in yearly reviews. Ridiculous! It should be used voluntarily. It's crazy to think that employees can come up with ideas every month. Our group is always scrounging to come up with enough ideas to fill our quota. We will even use the need for a supply, such as I need a garbage can just to fill it.  If this VBI was such a great tool, why are we still millions in the hole. I know we have loss from the aging population, but that is not all. Don't forget, we can all see the number of claims sitting in work filters. If the VBI was so wonderful, the high number of claims wouldn't  be sitting in there. If you want to improve processes, and save time and money, stop paying all your employees to stand in a circle each morning for 15 minutes or longer going over the same useless questions, and stop forcing employees to waste time coming up with useless ideas. Use the VBI board as a voluntary tool that employees can use when they feel it is necessary, and limit the huddle to 1-2 times a week for any area that is not directly dealing with patients."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a Five-Star, nor a Four-Star, or Even a Three-Star Rating Company to Work for!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Feb 2017", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Some employees are invited to use three-stars for job-site ratings. It makes the most favorable review more believable for readers. This method also builds a slow but steady uptake in company ratings.", "cons": "When employees have complaints regarding the Management and have appointments with the Human Resource Department to discuss these issues, they shouldn’t be blindsided when walking into the H.R. department conference room - there sits across the table the scowling H.R. representative and the employees boss. The boss is grinning... the H.R. Rep moves across from the employee (and the H.R. Rep is still scowling) and says \"We thoroughly investigated the complaint and we were unable to substantiate any of the issues mentioned. Because there is nothing illegal here, the complaint is now closed. “However,\" says the HR Rep with a furrowed brow, \"job performance, or lack thereof, from employees are very concerning.\" As the H.R. Rep says this and opens a thick file and passes around copies of a three-page document titled \"Performance Improvement Plan.\" The boss continues to sit there in silence, nodding and smirking. The employee is shocked and distraught and has difficulty remembering the details of what was said for the rest of the meeting. Almost an hour later the employee leaves the conference room in stunned silence, carrying a one-page document titled \"Written Warning\". The next day the employee called in sick and thought that resigning is now the only option. What just happened? Know this, HR exists first and foremost to protect the company’s interests. Pay attention to whom HR heads report to. It is often General Counsel, aka the lawyers."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good place", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jan 2021", "job_title": "Licensed Practical Nurse in Saint Paul, MN", "duration": "N/A", "pros": "Benefits were very very good", "cons": "Management could use some improvements"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "RN staff/charge nurse", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 Feb 2016", "job_title": "Charge RN in Saint Paul, MN", "duration": "N/A", "pros": "Wonderful co-workers who look out for each other and help when the environment is so toxic. \r\nUnion Hospital so wages are very good.", "cons": "Very poor leadership starts at the top and goes down. Under staffing and no support from leaders to get new staff hired.  System is satisfied with mediocrity instead of striving for excellence. Lately on weekends we have been running out of ordered meds  from pharmacy and food in cafeteria. Very poor education opportunities, almost all education is on a computer and then when you go to put what you learn in practice the information was not correct. Lean/ VBI basis for change has got the departments so understaffed that everyone is scrambling, doing the work of at least 2 people and they still want more."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Nov 2020", "job_title": "Scheduler in Saint Paul, MN", "duration": "N/A", "pros": "Great coworkers, good pay, insurance", "cons": "Little advancement opportunities, stressful work"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Used to be a 5 star company, now not so much", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Mar 2014", "job_title": "Management in Saint Paul, MN", "duration": "N/A", "pros": "Used to be the best place in the world to work, if you are in direct patient care maybe it still is.  I would not know as I am in middle management and it is just dreadful.  See below", "cons": "Out of 500 managers/directors company wide, I would guess probably 450 of them are very unhappy with how HealthEast is being led at this time.  The implementation of LEAN has turned into a grind that no one wants to do (pushed in areas where it did not even make sense), the new computer system is going to be implemented soon and nothing gets dropped off your plate and the CEO \"appears\"  to dislike people of any kind.\r\n  ."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Exciting at first until the realization sets in", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Feb 2015", "job_title": "Nutrition Services Aide in Saint Paul, MN", "duration": "N/A", "pros": "-Interacting with patients is definitely a plus if you are looking for experience. \r\n-Pay is decent but certainly comes with the cost of being expendable and slave mentality.", "cons": "-Management is unfortunately unwilling to compromise. For a few of those in the senior positions, it is their way or the highway. \r\n-Management is very noisy concerning private/ personal issues. \r\n-Hiring managers consistently make poor hiring decisions which causes the workload to increase for the rest of the employees. \r\n-Employees are expendable"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "I love my job, but management is hit and miss", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jan 2013", "job_title": "Registered Nurse in Saint Paul, MN", "duration": "N/A", "pros": "HealthEast is a large healthcare organization, and the opportunities for career growth are exceptional. I've been there for 15 months now, and transferred into my perfect job 4 months ago. I feel like the senior-level leadership is very visible and engaged, though i have yet to meet our new CEO. And my Co-workers are all excellent. HealthEast attracts the best if the best when it comes to nurses. The clientele is diverse, but mostly suburban at my work sites, so no threats to my safety such as gang violence.", "cons": "I feel that management at times is a bloated bureaucracy. It seems they can be out of touch with the working conditions and needs of front-line clinical staff. And the best and brightest nurses typically do not go into leadership positions, because managers have little power to affect real change and spend a lot of time doing paperwork and attending meetings."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Such a toxic environment at HealthEast! Used to be good", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "17 Jan 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "A few of my co-workers still care and are good to work with. Pay is not bad.", "cons": "All the problems that others have written here recently is SO true. HealthEast is chaotic, negativity permeates everything, people (employees, doctors and patients) are leaving in droves. It's so dysfunctional it's almost funny. No one knows their job, management is focused on their own advancement, supposed \"key priorities\" change monthly, leadership tries to tout their \"visions and values\" to employees but everyone knows it's all lip service, their actions show that their actual values are climbing the ladder, cutting staff, dumping more and more on their employees, who are all overworked and run ragged, and taking credit for whatever they can. I have worked there for a long time and it used to be great. )-: HealthEast was actually a \"Best Place to Work\" a decade ago. I think sadly it would win a \"Worst Place to Work\" now. At least half of my department is looking for a new job and we are already way short staffed because so many have left. I would NEVER tell a friend about any open position because HealthEast is such a mess."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poor Organization Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jun 2016", "job_title": "Anonymous Employee in Maplewood, MN", "duration": "N/A", "pros": "The people I met and had the honor to work with and call colleagues were the best thing that came out of my employment with HealthEast.", "cons": "I met some wonderful and supportive people during my time at HealthEast. However, the majority of leadership is out for themselves. They will say and do whatever it takes to look good and will not support staff below them. They feel the values are for everyone else except them and throw anybody under the bus that they can when they need to look good to others. This is the worst organization that I have ever been a part of and am angry that I wasted my time with them. They make empty promises when hired and then find excuses as to why they can not support you. I would never recommend anyone to this organization and will not continue to be a patient there. The pay and benefits are not up to standard level which was not a priority initially however, it does speak more towards the organization when compared to others in the field."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Culture of Confused Chaos", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Dec 2015", "job_title": "Information Services in Saint Paul, MN", "duration": "N/A", "pros": "Casual dress for corporate employees. No need to travel. Fellow employees generally care for one another. Flexible schedule and ability to work from home.", "cons": "This organization practices LEAN/VBI, but it is the most unorganized, confusing place I have ever worked. There is no documented process for most common practices.  Employees make it up as they go and people seem to forget what was done previously each time a similar issue arises. LEAN tends to make people focus on improving small insignificant things while the big glaring issues are ignored. Corporate office facility is not an acceptable work environment with paint peeling from the walls and rats in the pipes. I read the reviews prior to accepting this position, and I wish I would not have accepted this position. It is also hard to move around here. I feel stuck. People tend to work in siloes and are hesitant to collaborate on things that they are unfamiliar with. Management does not deal with problem employees but instead sweeps issues under the rug which puts extra stress on the employees who do try their best."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "HealthEast Scare System., Twin Cities, Minnesota", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Mar 2015", "job_title": "Storekeeper in Maplewood, MN", "duration": "N/A", "pros": "The ability to operate this way for so long.", "cons": "These employer review sites are a great idea. Obviously, the managers bad-mouthing them don’t agree, since it hinders their ability to get off on harassing and abusing their workers. They feel any worker who refuses to be a doormat is a disgruntled worker.  Potential candidates use these sites to weed out bad employers, which shows they fear it will threaten the ability of management to lure in new victims to be abused. If HealthEast management opposes it, then it must be good for workers.\r\nThe mangers I worked with have become sadistic bullies who get a perverse pleasure out of harassing and threatening innocent working people who are struggling to make a living and support their families. They abuse ‘performance reviews’ as an excuse to harass, bad-mouth and even slander their people. After the employee leaves, they use the ‘reference’ system to continue harassing and slandering their ex-employees.\r\n Management whines that employer review sites turn the tables and give innocent workers a chance to weed out bad and abusive employers. If you can’t take it, don’t dish it out."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "“In a time of destruction, create something.”", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "14 Sept 2017", "job_title": "Sterile Processing Technician in Saint Joseph, MN", "duration": "N/A", "pros": "Okay pay, and benefits. Opportunity to grow.", "cons": "Allows coworkers to bully, even if it has been reported several times. There is a very bad stigma with racial personality's, that coworkers in the department I worked in. It was very disruptive to the team and myself, that I made the choice to leave! Also, if you were in the positon to become anything more than regular status, you were not supported by long time coworkers, or by certain ethnics. I am not racists! However, the stigma that heavily plagued others and myself was to intolerable! I feel it was used by persons that carried I'm a black person, and I am untouchable and if you think you are better than me, then I will use my race to manipulate, and bully you."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I am so glad I have left!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Aug 2015", "job_title": "Educator in Saint Paul, MN", "duration": "N/A", "pros": "An option for no deductible for health insurance which is nice if you have chronic issues. This is the ONLY positive thing left!", "cons": "After working at Healtheast for almost 13 years and not feeling like I needed  to look elsewhere, everything changed 2 years ago. My manager changed 3 times in the last 3 years. At the clinics, all of the leadership positions had to be reapplied for by everyone. With this change, Healtheast put inexperienced managers in charge in more than 1/2 of the leadership positions I worked with. There was no leadership training and very little mentoring. In my last year at the clinic, the whole place was falling apart:  employees were unhappy and leaving left and right, there was no problem solving by leadership, and no one seemed to care about me or my ideas. Very difficult to work in these conditions."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I Left HealthEast For Fairview for a Reason!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "18 Mar 2017", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "The health systems say merging will allow them to benefit from greater efficiencies that come with size. Fairview CEO James Hereford will lead the combined organization. Fairview is much larger than HealthEast, with seven hospitals and 42 primary care clinics. HealthEast has only one-third as many clinics and four hospitals.", "cons": "HealthEast Care System knew beforehand they wanted to build new clinics to catch the east-side  metro’s market before merging. Limiting raises and blaming the economy for needlessly working the employees short staffed. Public documents indicate HealthEast has been struggling financially. While previous financial reports showed the business had declined over the last three years. Ratings cited weak cash flows and raised doubts that the finances would improve, noting the company's plan to boost its fortunes by going on a hiring spree by adding hundreds of doctors to its payroll. HealthEast let its employees down time after time. I thought I could forget HealthEast by going to work for Fairview. At least Fairview will be calling most of the shots!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "\"Punching Bag\" work environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "31 Jul 2015", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "USED to be awesome!  When I started,  it was great. The people working in direct care are usually great, along with the departments working along with them.", "cons": "Way too much downsizing in areas that NEED help, dumping way too much work and not enough help into a very important office. Reading the reviews before me, and hearing the other complaints, and knowing there were ways to prevent their problems and not being able to do anything about it, except write up a VBI card and sprinkle fairy dust on it, hoping for that to work and MAYBE management would help or do something.  But nope..... Cutting benefits,  barely any raises. WAY too top heavy. Allowing so many idiots that don't care stay."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Director", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Dec 2018", "job_title": "Director in Saint Paul, MN", "duration": "N/A", "pros": "Great peers and team.  Benefits and Salary ok overall.  Other employers more competitive.  HealthEast was behind the times in many ways and very much lacked infrastructure.  The Fairview rescue will be a great improvement in many ways.  That became apparent quickly.  James Hereford is impressive and a great leader.  Hopefully that will bring some integrity to the former HealthEast.", "cons": "One up leader very poor.  HR sweeps things under the rug and doesn't address issues.  Lip service from upper management and not sincerity.  Once again, hopefully Fairview will help that greatly."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Babies", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Oct 2015", "job_title": "Anonymous in Saint Paul, MN", "duration": "N/A", "pros": "Can collect unemployment insurance, even when managers and hr contest it.", "cons": "My boss had become more and more obsessed over if I'm going to get (or am) pregnant. He keeps dropping hints about being interested in my \"family plan\". I couldn't tell if he meant this in a friendly way, or is trying to size me up? Usually after trying to \"gently discover\" if I'm pregnant he will launch into a grandiose story about how his wife did not take ONE DAY of maternity leave with his kid, how she dropped him out on a Friday and was back in the office on a Monday. She couldn't understand \"those women\" who use babies as a way to get a vacation.  When I got my most recent review, I was shocked. Lies and exaggerations! I heard he had conversations with others trying to get their input for my review where he was trying to get them to say I was making mistakes. He just tried to make me miserable enough to quit. It worked."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Favorites", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Feb 2019", "job_title": "CMA in Maplewood, MN", "duration": "N/A", "pros": "Great providers to work with. Some of the staff are nice", "cons": "Management has their favorites and will allow them to hang out with them sit and chat with them all day or play on their phones while the rest of us do the work.  If you have an issue of not feeling comfortable doing something and bring it up you are told it will not go away.  We know that just need more training and do not get it.  Healtheast hired RNs for the clinic to help us the only thing she does is approve time cards and sit on snap chat all day in an office (they hired RNs to work on the floor and be there if the CAs need help)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I LOVE MY JOB!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Jan 2015", "job_title": "EHR Analyst in Saint Paul, MN", "duration": "N/A", "pros": "HealthEast has always provided opportunities for me to grow and find positions that accommodate my needs. I absolutely love my job and the people I work with, and I am compensated well for my skills and take pride in my work. \n\nHealthEast provides generous amounts of PTO, retirement savings matching, fitness and well-being classes, and many more great benefits.", "cons": "Some management is hit or miss and poor managers or employees not pulling their weight are not often dealt with or moved out quickly. I would not say that this is a large problem but it exists."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excited for HealthEast's Future with Fairview", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Mar 2017", "job_title": "Nurse Manager in Saint Paul, MN", "duration": "N/A", "pros": "The announcement that Fairview is uniting with HealthEast to create the Twin Cities largest and most comprehensive care system is incredibly exciting. We get a chance to create something truly special that has size, scale and sustainability. Those joining HealthEast today will soon be able to have access to over 30,000 jobs versus the 7,000 that were available  prior to this new combination. I'm more excited about my future at HealthEast then ever before!", "cons": "It will be hard to take on a new identity. I am hopeful that we can be part of defining what our new combined identity will be."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Clinical Lead", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Apr 2017", "job_title": "Registered Nurse in Maplewood, MN", "duration": "N/A", "pros": "Great pay and benefits.  Paid parking though NOT in a great area of town", "cons": "Poor manager, colleagues who were in \"it\" only for themselves, and ready to sell you down the river for advancement for themselves.  A physican who ALWAYS ran LATE, and was upset at those who had other opportunities after regular hours, and felt you needed to stay overtime no matter what.  And if you didn't, he cried to the Manager, and YOU got reprimanded"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "HealthEast is on the rise!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Feb 2016", "job_title": "Family Medicine Physician in Eden Prairie, MN", "duration": "N/A", "pros": "- Passionate Leaders\n- Focused on creating a sustainable future for our employees, our communities and our patients\n- Major spending taking place on process improvement and forging new paths for community health", "cons": "- Some employees would prefer we operate as independent hospitals and clinics like we used to and don't see value in a \"System\"\n- This leads to a wide variance in engagement of team members\n- Protocols and policies allow poor performers to place too much stress on their colleagues who carry their weight"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Unfortunately unfriendly and not supportive.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Jun 2014", "job_title": "CMA in Saint Paul, MN", "duration": "N/A", "pros": "Over all a top health company to work for.\r\nIf working in the hospital setting it is a great place to work.", "cons": "OutPatient clinics are run with a lot of disorganization and not professional. Most of the out patient clinics are managed with managers that don'[t have a medical back ground, therefore are run by what looks good on paper."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "On edge", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "29 Oct 2016", "job_title": "Management in Saint Paul, MN", "duration": "N/A", "pros": "Co-workers are wonderful. Respected by those I work with.  High quality patient care provided to all by physicians, nurses and others.", "cons": "Given all the changes over the last few years and the never ending chant of \"no money\" we are all on edge wondering about layoffs, will we be bought by someone etc. Now National holidays have to come out of your PTO hours- very BAD idea and should be changed. No one is happy with that and the non-contract employees had no say in this decision."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run away!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Jun 2018", "job_title": "CMA in Saint Paul, MN", "duration": "N/A", "pros": "I am not really sure. Some staff and doctors are nice.", "cons": "The company is awful, now merged with an even worse company. Lies upon hire. Zero opportunity for advancement. They lack respect for their employees, work them to death and pay them horribly. Constant change but nothing ever gets better. Zero respect for the frontline teams who do the work, yet the leaders expect it all with no recognition."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Layoffs Are The New Normal", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jan 2017", "job_title": "Anonymous in Saint Paul, MN", "duration": "N/A", "pros": "Managers are Motivated to increase ratings.", "cons": "Dealing with the constant uncertainty of downsizing, is not only depressing, it left me in a state of permanent adrenaline-fueled anxiety. HealthEast seems to see you as a commodity. There is no feeling of community. Everybody wonders if they are next for the chopping block, after they lowered job security and trust among employees. Then they have try to revitalize the revolving downsized organization with the latest engagement processes."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Struggling mightily with health care changes", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jun 2016", "job_title": "Senior Operations Analyst in Richfield, MN", "duration": "N/A", "pros": "Wonderful care from down to earth, intelligent, practical physicians.", "cons": "Continued investment in an old guard of executives that doesn't seem to be willing to face up to the changing healthcare marketplace.  Lack of drive to foresee changes and make them happen.  Healtheast is always waiting to see another system experience a success then make the same change to follow."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Gold Nugget when in actual fact it's a Dog nugget rolled in Glitter", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "30 May 2016", "job_title": " in Saint Paul, MN", "duration": "N/A", "pros": "I will miss some of my work-friends.", "cons": "I have been in my current job 10 years and am about to resign, i have watch and helped this company grow and now i am having a hard time with my health. I am being treated badly and given no support. I have been lucky in that i have a job offer from another company but it's for lower pay and a drop in rank. After reading this review site, i am now convinced that i should take the leap. I feel the higher the pay the bigger the price you pay in family, health and happiness. I want to live my life not work myself into an early grave…..we work to live not live to work ………the best things in life are free……your peace of mind is more important than you think."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Company Rising Like Polluted Smoke!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Apr 2016", "job_title": "Talent Acquisition in Saint Paul, MN", "duration": "N/A", "pros": "Decent pay but not worth putting up with all of corporates shenanigans", "cons": "Upper management may seem transparent about the company's earnings, but you will see nothing of it, as it does not trickle down to the operations/production employees. The \"ivory tower\" takes care of it's own. You are constantly given \"lip service\" about how well everyone within the company is doing but the end result is that you do not matter. You are a number....\"do your job, ask for nothing in return, and move along\" is the mentality of this organization. Now they are so consumed with money that they have forgotten that happy employees will make concessions in their wok environment,  to keep a company vital. However, employees are ridden to the breaking point due to worker shortages (planned) and constant derision over not achieving impossible work expectations."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Management is horrible", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "25 Apr 2013", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "At one time HE was a good company to work for.", "cons": "Management treats their employees like crap. They show favoritism toward some employees and treat others unfairly. Management seems to think it is professional to tell their female employees that they need to \"Pull up their big girl panties and move on.\" Very hostile toward employees and very disrespectful regarding employees feelings and thoughts. Comments made by management are degrading."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Patients first employees last", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Aug 2016", "job_title": "Front Line Staff in Saint Paul, MN", "duration": "N/A", "pros": "Co-workers are able to share in the miserable atmosphere created by upper management. \r\nVacation time is easy to get due to high accrual rate and ability to switch shifts with others.", "cons": "Lack of compassion shown by upper management toward front line staff. \r\nHealthEast leadership has a \"do as I say, not as I do\" attitude. A recent re-branding was seen as a joke by all front line staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Used to be good", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 May 2014", "job_title": "Lpn in Saint Paul, MN", "duration": "N/A", "pros": "Benefits\nDoctors and co-workers were great!\nGood hours though you were not supposed to work any overtime even though it's unavoidable", "cons": "The centralization of the company is a HUGE letdown to employees and patients. Took a \"family\" atmosphere and made it 100% impersonal. Valued long term employees were let go due to not fitting in with the new model. VERY disappointing"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "CLS", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jun 2018", "job_title": "Cls in Saint Paul, MN", "duration": "N/A", "pros": "This company is great to work. the people i work with are nice, some people are nasty but its ok. Im pretty sure, not everywhere, everyone will be nice.", "cons": "Work flow is short, they are always short on staffing. People always leaving, so that tells you that their work flow is crap. The manager is clueless, thinks he knows the work flow but put every one in stress. Hoping to leave soon.. If you want experiment then this is the place, but if you want to build your career then this is not, because they have favors and will only pick the one they like to build their career up."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No Allies Of Mine", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Jul 2015", "job_title": "Anonymous in Saint Paul, MN", "duration": "N/A", "pros": "Everybody is themselves when its not so busy.", "cons": "Poor communication within and across departments and teams.\r\n\r\n- Very political. Politics over logic, professionalism, and work ethics. Whether you can do a good job, finish your work on time, or have the knowledge to do the work is much less important than you getting along with people and being liked by your supervisor and key people in the company.\r\n\r\n- People there do not understand what professionalism is. From HR to most of management. Most of them are not on top of and do not resolve issues (production or management issues). They have tons of meetings to talk about it and only to come out of those meetings to do nothing."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "New CEO Getting a Bad Rap!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "20 Aug 2015", "job_title": "Former Corporate Employee in Saint Paul, MN", "duration": "N/A", "pros": "Health Care changes taking place!", "cons": "Healtheast care system has never been a good place to work, at least while I was there. The long- term employee's ruled the system and if they didn't like you, watch out! Management and Leadership positions were historically ingrained with cronyism and ran on the  good-old-boy system. I feel sorry for the new CEO, she was her work cut out for her. Its gonna take years to get the place in order (after-all it took years and years to get the organization so dysfunctional)  and ready for the new generation of employee's. Hopefully she will retire the cronies (goodbye and good riddance to them and their long-line of family and friends)."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "NO APPRECIATION", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Jul 2014", "job_title": "Clinical Analyst (Health Informatics/Statistics) in Saint Paul, MN", "duration": "N/A", "pros": "My Team and cube mates", "cons": "HealthEast has cut benefits, scheduled staff for 80 hour weeks and paid them for 40, while you are bleeding your PTO. Expectations on staff are unrealistic, exploits hard work and dedication. They expect you to work long hours, expect to use your cell phone for call yet offer no stipend for doing so. Pay you $1.50 an hour for call (seriously). I am aware of many looking for the door.   Maybe if there was a thank you! I don't know, you get yelled at by Doctors , Nurses, Leads,and no support from managers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Coordinator", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "4 Jul 2018", "job_title": "Coordinator in Saint Paul, MN", "duration": "N/A", "pros": "Benefits were decent, there used to be opportunity to move around within the organization, multiple locations to choose from in the St. Paul area.", "cons": "Upper management wasn't good at dealing with issues, lots of passive/aggressive behavior, communication practices weren't good and often last minute, changes within the organization didn't seem to be thought out very well before being implemented, and changes were being made too frequently."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Dead end registered nurse position with very high expectations for perfection, scrutinized by management.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "16 May 2012", "job_title": "Registered Nurse in Saint Paul, MN", "duration": "N/A", "pros": "RN salary, as it is union and co-workers", "cons": "unsolid leadership\r\njudged for performance unfairly\r\nhigh use of fad healthcare initiatives to cater to the clients"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "VBI has destroyed this organization", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "9 Feb 2017", "job_title": "Manager in Saint Paul, MN", "duration": "N/A", "pros": "I was a long term employee that loved my job and did it well, throughout my years of service I was promoted several times. I have now moved on to another health care system that reminds me of what Healtheast used to be.", "cons": "VBI was introduced to the company and moral decreased. Leadership was concerned and awarded for the quantity of VBI cards submitted by employees and not the quality. I had a direct report that was only concerned about themselves and their bonus.They would talk about my co-workers inappropriately and had favorites. The \"lean\" concept produced layoffs of long term employees that were dedicated to the company."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Sterile Processing Technician", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Aug 2017", "job_title": "Sterile Processing Technician in Maplewood, MN", "duration": "N/A", "pros": "Small hospital with lots of opportunities to work overtime, education reimbursement, lots of online employee resources. Close knit teams environment.", "cons": "Lots of \"lifer\" employees with the \"we've always done it that way\" attitude, outdated and crowded conditions, mandatory union membership. Lots of surprises due to poor communication."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Another Former Employee", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Mar 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "According to state law, employees can review and get copies of their personnel records, every six months!", "cons": "I was severely overworked and the environment was so chaotic that nobody seemed like they knew what was going on. We were short staffed most of the time. The patients complained to us as if we had any control over the situation. I've been told over and over again on how things are going to improve, but management  just pushed the duties around. I decided to look elsewhere to further my career in the direction I wanted it to go. If I thought this place was getting better...I would still be there!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Director", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Oct 2016", "job_title": "Anonymous Employee in Maplewood, MN", "duration": "N/A", "pros": "staff, co workers bond together, we don't utilize the leader and seek things our self. hard working managers, and directors stick together.", "cons": "upper leadership (service line level)  in organization do not respect or appreciate their managers/directors. Trust is a major factor.  Alot of work put on shoulders of management. Constant reorgs done, putting us all on edge. Less staff around, more work to be done without support of upper leadership."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Sinking ship", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "2 Feb 2016", "job_title": "Corporate in Saint Paul, MN", "duration": "N/A", "pros": "Used to be better, but always struggling. Lots of good people to work with.  There was a common mission of doing what is right for the patient.", "cons": "Ship has been struggling to afloat for  a few years. Executive leaders are like the musicians on the deck in the Titanic, trying to calm the few staff left as work them like crazy so they keep the boat afloat. The new leaders are toxic. Workplace violence is commonplace. They will use you and offer nothing in return. Trust and respect are words, used in marketing only."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "physical therapist", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "20 Jun 2015", "job_title": "Physical Therapist in Saint Paul, MN", "duration": "N/A", "pros": "My direct managers were very friendly and helpful.  We had a good team and tried to help each other out when possible", "cons": "In my opinion the company was much less employee friendly when the new CEO came in.  The is constant change due to the lean flow management model."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Ho Hum", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Apr 2015", "job_title": "Anonymous in Saint Paul, MN", "duration": "N/A", "pros": "OK compensation and benefits,,,meets industry standards.", "cons": "Start your day feeling one-two hours behind and drilled with the word \"team\" .........the saying there is no i in team does not apply, as i is the team. Not that your co-workers don't want to help you but they are running on their hamster wheel as fast as you are. The hardest part of the job is knowing no matter how hard you try or care when you are asked to come the to the manager’s office you know it's not for a job well done pat on the back."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Okay not great", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Dec 2018", "job_title": "Anonymous in Saint Paul, MN", "duration": "N/A", "pros": "Love most of my co workers", "cons": "Pay is below most healthcare systems. Told we will get Fairview pay soon. Not holding my breath. Favoritism in the department causes problems with other staff members.  Don’t feel they care about the employees because they feel there is a surplus of workers out there. Hiring people who are lazy and then they do not get rid of them."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "St. John's Hospital: Nice place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Nov 2012", "job_title": "Registered Nurse in Maplewood, MN", "duration": "N/A", "pros": "Medium sized community hospital, felt safe. Doctors: Friendly hospitalists, more friendly surgeons than not, excellent oncology MDs. Great teamwork among staff, fellow RNs are kind, knowledgable, and helpful. Good staffing ratios, generally 4 patients to a nurse for day and evening shifts.", "cons": "McKesson charting system was poor, not user friendly. They are in the process of shopping for a new vender. Discharge process was inefficent and frustrating."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Alright, not spectacular (clinics)", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jun 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Ways to Wellness fitness program\r\ngood mileage reimbursement\r\ngood IT support system\r\nfrontline staff are very dedicated", "cons": "Vacation policy (federal holidays come out of your pool of PTO time)\r\nAttendance policy is rigid and inflexible\r\nLack of communication from management to frontline\r\nVBI system is frustrating and translates into more work\r\nLack of upper management support and understanding\r\nThings just don't seem to work smoothly, but its hard to say why"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Only a One-Star Rating!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 May 2015", "job_title": "Lab Technician in Saint Paul, MN", "duration": "N/A", "pros": "Nice coworkers most of the time, but when it gets crazy busy people get angry with each other.", "cons": "I started HealthEast  Care System with an above average wage, but I soon figured out in the long run the wage was actually a lot less than average, because I haven't received a cost of living increase in the last five years I worked there. The benefits aren't what they seem and you have to know the right person to get promotions. I moved on to advance my career and goals."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Average at best", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Mar 2015", "job_title": "Corporate in Saint Paul, MN", "duration": "N/A", "pros": "Not a whole lot. The cafeterias maybe. Most management in administration are clueless. They don't listen to anyone below them.", "cons": "Clueless management. Lean initiatives are tiresome and beat to death. Will get bought out or merge with other local hospital system in the near future."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "once a good company, now run by incompetent fools", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "21 Jul 2015", "job_title": "Registered Nurse in South Saint Paul, MN", "duration": "N/A", "pros": "When I began working at Healtheast in 2006 it was a wonderful place to work. The atmosphere was very positive and employees were treated fairly and with respect. \r\nPay is competitive. In line with the average pay for type of work, area, etc..\r\nGood health insurance, dental benefits at a reasonable cost.", "cons": "In 2009 corporate became more involved in our department (after hours phone triage) looking for cost savings. They began micromanaging and cut staff to the bare minimum. This resulted in our excellent manager leaving the company. The next manager was inexperienced though I believe she tried to manage the many new projects thrust upon her as best as she could. In 2014, Healtheast brought in managers that were incompetent, very authoritarian and disrespectful toward many nurses. Some nurses were immune. Management had their favorites and their scapegoats. Staffing was a complete mess. We were short almost every shift and little was done to remedy this. The manager refused to help with triage as past managers had done. Nurses were forced to work double shifts sometimes overnight (3-11pm then 11pm to 7am) due to sick calls that left us with no night RN. Management again refused to step up to the plate and take responsibility for the department and the staffing woes we had which were due to their incompetence. Then when patients were unhappy with wait times or if lower priority patients received less attention, our manager would reprimand us for it.  Though she refused to assist the nurses or to remedy the staffing shortage, our manager was quick to write nurses up for even trivial matters, anything that bothered her really, with no sense of equal treatment for all. One evening an RN was forced to work alone on the busiest night of the week. This was not due to sick calls but due to vacation time being granted to all the other nurses scheduled that night. One of these was a last minute vacation request that our manager approved knowing this would put only one RN working that shift. Normal scheduling for such a shift is 4 nurses and even then it is challenging. This nurse worked that shift alone and received no support or direction from management whatsoever. Phone calls and e-mails were unreturned. Several days later our manager went looking for problems and mistakes from that shift. This nurse was terminated after eight years of employment in good standing because of a minor error (which did not result in any harm) made while severely understaffed (by herself).  Other nurses were threatened with termination over equally minor instances.  Healtheast's reputation in the medical community and among patients has deteriorated."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Lacks management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Aug 2015", "job_title": "Licensed Alcohol and Drug Counselor in Saint Paul, MN", "duration": "N/A", "pros": "Good pay, great benefits, awesome coworkers. I really enjoyed my experience with Healtheast. I learned a lot from the amazing people who work there and grew as a person.", "cons": "Lacks management, difficult to make necessary changes within the organization. I wish Healtheast was more open to positive changes within the organization."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very unstable, frustrating toxic environment - used to be great", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "16 May 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Competitive pay. There are some happy, decently functioning teams throughout the organization, particularly if you avoid corporate positions.", "cons": "HE was celebrating one of many consecutive \"Best Places to Work\" awards when I joined 10 years ago. Sadly, I believe if there was a \"Worst Places,\" they would be a top contender today. Turnover is sky high, layoffs are high, positions are eliminated and then rehired months later  (re-titled) frequently. On my team, 10 of the 14 employees were all hired within the past year, due to people leaving or getting bullied out. Some departments have such dysfunction that they change their names because employees have a bad association with \"such and such department,\" rather than fixing the root causes. Employee morale is incredibly low. I have read other reviews here about HE \"heading in the right direction.\" Unfortunately I have never encountered that sentiment from anyone except those pushing the corporate initiative-of-the-day.\r\n\r\nIf you are thinking of taking a job at HE, my advice is don't. If you insist on considering it, I would recommend asking questions about the department make-up/how long most of the people have been there, etc. Long-term doesn't always equal better, but in the case of HE, my experience is that the departments with the most new employees are the ones where the most problems exist. (An exception would be areas directly related to Epic, because they legitimately did add a lot of personnel.)\r\n\r\nI expect/hope to leave. I've waited 3 years for a turn-around and it just keeps getting worse year by year!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great coworkers and teamwork - less than great leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "24 Jun 2015", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Good health benefits, graduated PTO accrual based on length of time with company. Most employees I've encountered at 2 different sites have been excellent coworkers.", "cons": "Major disconnect between upper management and mid to low level employees. Leadership makes knee-jerk decisions to cut costs which hurts the organization in the long run and the employees that remain have to shoulder more and more responsibility and stress"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Not Good", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "26 Oct 2015", "job_title": "HUC in Saint Paul, MN", "duration": "N/A", "pros": "Hospice!!!!!   Amazing, wonderful people.  Without them I would have been so lost in the last 2 - 3 months of my mom’s life.  Thank you.  Also the aftercare for the family has been caring, even when I deny depression, I know they are there.", "cons": "Certain supervisors in the CD/Mental Health units have no problems with throwing subordinates under the bus to make her look better, and tell outright lies regarding employees.  Yes this is personal.\r\n\r\nI worked for HE for 10 years and was let go because I chose to stay home with my mom who was end stage breast cancer.  My boss encouraged and even suggested I have some personal things taken care of even if it took more time. \r\n\r\nWhen the time to go back came around my boss, HR and I talked on the phone, I wasn't ready to come back as my mom was worse every day and her Onc. told her there was nothing else they could do.  I reminded my boss of her recommending I work on myself and she denied it to HR.  After that I received letters from HR stating I never called to discuss my status even though I called my boss at least 6 times and left voice mail with her and twice to her asst, no calls were ever returned.  I told HR about this but they believed the director as they are suppose to, but this gives no non-union employees no power and that is sad, \r\n\r\nOh one funny thing,  every month for 4 or 5 months, I received a letter from HR stating I was fired because I did not call my boss,  after the first letter, I left one last voicemail saying I would not be back until after my mom passed (which as in March 2015}.  I got this same letter monthly starting in October and ending in Jan or Feb.   I have no idea what they were trying to accomplice with this\r\n\r\nFrom my perspective HE has little to no employee support.  I would not work for them again and they are missing out because I was great at my job."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Values??", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jun 2015", "job_title": "Sterile Processing Technician in Saint Paul, MN", "duration": "N/A", "pros": "Try's to market HealthEasts Christian values.", "cons": "HealthEast Care System tries to use performance improvement plans to abuse and force out workers. They claim to be a Christian organization but show no Christian morals in how they treat their employees. You will probably get a bad feeling after working there only a short time. Trust the feeling, the managers treat people like dirt and they hide behind a mask of \"Christian values\" that looks like nothing more than a lie."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Avoid! The stress and low pay isn't worth it.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Sept 2018", "job_title": "Clinic Manager in Maplewood, MN", "duration": "N/A", "pros": "Large health system with lots of room for job advancement. Health insurance benefits are affordable.", "cons": "Poorly managed. Their servant leadership model results in managers and leads often having their hands tied and bending to the wills of their employees. Leadership is poorly supported when making needed decisions or changes. One of the worst cultures I have ever worked in. Upper management is quick to criticize but not provide direction for improvement or an action plan. They are too embedded in a grey area, and feelings, and unable to make concrete choices and guidance. Pay is low for managers and leads."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Used to be Great", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Nov 2015", "job_title": "Senior Business Operations Analyst in Saint Paul, MN", "duration": "N/A", "pros": "Great people to work with, but at this point the good people don't outweigh the bad.", "cons": "Management does little to grow its staff professionally. Lack of direction among the constant restructure of leadership and continued elimination of various leaders. Stop using Lean to run the business, it gets in the way of doing your day to day job and adds unnecessary work and no added value."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "UnTrustworthy", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jun 2016", "job_title": " in Saint Paul, MN", "duration": "N/A", "pros": "I enjoy the outdoor patio.", "cons": "The Director where I work aggressively promotes company values that don’t seem to match day-to-day events.For example, clear communication is preached in elaborate seminars while poor communication continues to be the norm. Valuing and respecting others is publicized in the company mission statement, or on framed motivational posters near the doors, but undermining and belittling others seems pervasive. Everyone is told to make company goals their first priority and adopt a spirit of teamwork, but internal competition dominates. Worst of all, the most consistent violators of company values are the most highly rewarded."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Apr 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "VBI or Lean concept is strong and it works! New physician leadership is fantastic!  Great benefits, comp, and resources to get our work done!", "cons": "People complain the system is financially stressed...who isn't this day in age. Welcome to the world of health care!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 May 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Good balance and dedicated leadership team focused on enabling people to be successful.  My boss is great and the work is meaningful and fun.", "cons": "We are still evolving into a new culture and this isn't fully done as of yet.  But they are going in a good direction here."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place to work on", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2016", "job_title": "Engineer in Saint Paul, MN", "duration": "N/A", "pros": "Great people, great oppurtunities and you have change to grow up", "cons": "Higher management keeps changing, People are used to with old school system and if you say this is not the way, they start saying you have no idea how things are done."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Management needs help", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Aug 2015", "job_title": "Lab Lead in Saint Paul, MN", "duration": "N/A", "pros": "My coworkers. Previous supervisor worked with my schedule to make it work for my situation.", "cons": "Management too concerned with meetings about nothing- not worried about appropriate staffing. Everyone is ran ragged."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Good while I was there", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Jan 2014", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Direct manager trusted the team to get the work done without standing over our shoulders. No micro-managers there that I encountered.", "cons": "After the change to a new CPOE system, the working conditions (i.e. office space) became more crowded and factory-like.  Too many people crowded into one room with small work spaces for each."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I loved my job...at first!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Jan 2015", "job_title": "Pharmacy Technician in Saint Paul, MN", "duration": "N/A", "pros": "If time allows, co-workers can be fun to work with.", "cons": "Not an enjoyable hospital to work for once you realize how the company manipulates employees into overtly coercing them into promoting the company, if you like it or not. Manipulates employee's into participating in employee engagement survey's...using their employee IDs. Upper leadership, through the Human Resource department  has certain employee's and departments participate (anonymously ??) in online company reviews, hoping they will give top ratings that are most popular."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Medical Billing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2017", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Work at your own pace, as long as work was completed.", "cons": "Everyone there, including managers, acted like they were gossiping 13 year olds. It was like being bullied in high school. No one took any complaints seriously because they were \"friends\" with that group in question. They would spread rumors for no reason whats so ever. Most people there were 40+ in age too, which makes it more sad."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Case Manager", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Dec 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Small community atmosphere, friendly colleagues", "cons": "Not enough training for new leaders, not enough communication with front-line staff.  Micromanagement by leaders who do not really understand the work. Fixing work models that are not broken! Too many Kaizens that produce hasty and ultimately ineffective results"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good outlook", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Apr 2016", "job_title": "EMT in Saint Paul, MN", "duration": "N/A", "pros": "HealthEast will pay for paramedic training, and you keep very very busy. Additionally, the management is developing and growing, and definitely has a good outlook.", "cons": "Some of the management is left over from a lesser time, and is in need of rotation out of the company. There definitely exist some delusions of grandeur."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Management doesent care", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 May 2013", "job_title": "Nutrition Services Aide in Maplewood, MN", "duration": "N/A", "pros": "Salary, Benefits, Hours, Flexibility, People", "cons": "Management, Respect, Recognition, Poor leaders, Greedy managers"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "If you are thinking about working at HealthEast, run and don't look back.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Sept 2015", "job_title": " in Saint Paul, MN", "duration": "N/A", "pros": "Pay is OK. That's it.", "cons": "Terrible leadership, doctors, employees and patients are leaving in a flood because it's so screwed up. Was good as recently as 3 years ago, I've been there for a decade."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Genuine Snake-In-The-Grass Strikes Again!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Feb 2015", "job_title": "Anonymous in Maplewood, MN", "duration": "N/A", "pros": "Expected wages and compensation for the surrounding metro area.", "cons": "Some of the employees in the department I worked in, caused employee turnovers by working behind their backs to slander and sabotage them. Pushing them out the door because they declared them as terrible employees and they believe management made a mistake by hiring them, in the first place."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Boatloads of people leaving", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Oct 2015", "job_title": "Management in Saint Paul, MN", "duration": "N/A", "pros": "a paycheck- you can put food on the table but you won't be happy.  No one is, not employees, not patients, not doctors.", "cons": "Turnover is crazy high, and everyone is burnt out.   Cannot recommend anyone work here unless your options are very limited.  Executive management is the worst I have ever seen in healthcare."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "'Sad to Stay'", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Nov 2015", "job_title": "Anonymous Employee in Maplewood, MN", "duration": "N/A", "pros": "Ok place to work if you...see nothing...say nothing...hear nothing.", "cons": "The people placed in management positions are incompetent, make life miserable for the employees that don't suck up and actually have a backbone and don't care enough about employees to make sure they even get a breaks. The workplace gossip is horrible and management makes no effort to quell it and seem to encourage it in some cases."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great place to grow – skeptical", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jun 2015", "job_title": "Nutrition Services Aide in Saint Paul, MN", "duration": "N/A", "pros": "Security Officers are greatly appreciated in the area I worked in.", "cons": "In what world does education equal class and tact? In what world does choosing a different profession that requires more years of education equal becoming untouchable and unapproachable? What does it take, when it comes to getting respect and fair-play from Leadership and Management at HealthEast Care System?"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Former Manager", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 May 2016", "job_title": "Management in Saint Paul, MN", "duration": "N/A", "pros": "Each day brought its challenges  I learned that almost everyone is expendable.", "cons": "It is an understatement to say that it was a pressure cooker. Unfortunately, some of the roles felt more like something you \"survive\" instead of something where you feel like your career is being nurtured and cultivated. The hardest part of my job was trying to make everyone happy."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Nurse Educator", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2017", "job_title": "Registered Nurse in Saint Paul, MN", "duration": "N/A", "pros": "They value employees and keep them involved in decision making.  Employee engagement is taken as a priority and they believe in quality care for their patients", "cons": "There are few things that I can think of as serious cons."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "burned out workforce", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Jan 2016", "job_title": "Doctor/Leader in Saint Paul, MN", "duration": "N/A", "pros": "The best place to build change management and LEAN production system skills. No better place to learn how to function under stress. Nice dedicated frontline workers.", "cons": "It is a matter of time before you are burned out."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Interesting", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Sept 2017", "job_title": "Patient Registrar in Maplewood, MN", "duration": "N/A", "pros": "Everyday is a different day which makes the job interesting and fun. Must be able to think quick, react quick, and have a passion for helping others.", "cons": "People are in pain. Must be able to work well under pressure and handle every patient with care and compassion."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Run while you can", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "28 Sept 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Decent pay & benefits. Some good coworkers.", "cons": "Not enough time or space to list everything that is wrong. No work life balance at all because never adequately staffed. Terrible leadership that talks big but doesn't understand the daily work we do. Too much emphasis on VBI cards. Focused more on dollars instead of patients and employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "One of the Best", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Dec 2016", "job_title": "Hospitalist-internal Medicine in Saint Paul, MN", "duration": "N/A", "pros": "People Friendly, Benefits are great Pay is comparable to other companies\r\nDoctors are personable, Very helpful. Management for the most part is open and wiling\r\nto listen to employees", "cons": "Its a 24hr facility and time off is a little tricky but workable"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "HealthEast is a good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Dec 2009", "job_title": " in Saint Paul, MN", "duration": "N/A", "pros": "They really value work life balance.", "cons": "Change is hard and leadership does not do the greatest of jobs preparing employees for drastic changes and wonder why employees struggle through it."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Negative Corporate Environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Sept 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "The pay was above average. The private Healthcare costs were very reasonable for full family coverage!", "cons": "The corporate environment was very negative with no room for growth or advancement. Not geared for millennials."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Dec 2010", "job_title": "Researcher in Saint Paul, MN", "duration": "N/A", "pros": "Religious small organization. If you are smart, you will shine!", "cons": "Lacks diversity. Organization would be more successful if you get people from diverse backgrounds"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Forward Thinker's", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Mar 2016", "job_title": "Anonymous in Eden Prairie, MN", "duration": "N/A", "pros": "Management and HR's idea of Forward Thinking - Older employee's are given the heave-ho when the company needs to build some more clinics and replaces them with lower paid employees!", "cons": "Lying and misleading employees about their right to Record Conversations. Minnesota is a two-party state, you can record secretly, as long a you participate in the conversation being recorded."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent health care employer in Twin Cities", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Jan 2013", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "HealthEast provides great benefits, they encourage professional development and often promote from within. I can't imagine working for a different health care company.", "cons": "Wish work was closer to home."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Undercover Boss", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Jul 2015", "job_title": "Anonymous Employee in Saint Paul, SC", "duration": "N/A", "pros": "Benefits and pay are ok", "cons": "Always understaffed. Consistently working more and more as duties keep getting added."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Dysfunctional leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Mar 2017", "job_title": "Management in Saint Paul, MN", "duration": "N/A", "pros": "Employees are dedicated and willing to go the extra mile for patients and coworkers.  Salaries are competitive in healthcare industry.", "cons": "Leadership structure is very dysfunctional and do not set an example of the core values. VBI and LEAN are the sole focus of the organization, yet the employees have no input on change and process improvement."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bacteria - The Only Culture That Grows", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Apr 2016", "job_title": "Patient Care Associate in Saint Paul, MN", "duration": "N/A", "pros": "Co-workers are fun when unrushed.", "cons": "They say Lean - I say Costly! Patients suffer the consequences of the chaotic and short-handed atmosphere. Lower paid employees suffer the most when the finances are stressed. if you are not wanted by no-one else, this is the culture for you."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Hopsice Team is wonderful to work with", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Apr 2016", "job_title": "Hopsice Nurse in Saint Paul, MN", "duration": "N/A", "pros": "Wonderful Coworkers and paitents. Hospitals are easy to access.", "cons": "Patient load was increasing and becoming overwelming for case managers"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Needs to raise the pay for NAs", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2012", "job_title": "Nursing Assistant in Maplewood, MN", "duration": "N/A", "pros": "Good benefits, union, learning exp", "cons": "Having to work a certain amount of hours a year to get a raise."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Generally nice people, good starting pay", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jan 2015", "job_title": "Storekeeper in Maplewood, MN", "duration": "N/A", "pros": "Nice people, good entry-level pay", "cons": "They take forever to fire horrible employees and they take months to hire replacements even after they are given two weeks notices."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Audiologist", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Aug 2017", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Was really able to make the job my own and get the equipment I needed to be successful", "cons": "The cite I work at leadership has no knowledge of audiology, making it challenging to get support"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Physician", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Mar 2018", "job_title": "Physician in Saint Joseph, MN", "duration": "N/A", "pros": "amazing clinical staff on the ground", "cons": "unfortunate surplus of middle managers \"adding value\""}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Healtheast", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Sept 2016", "job_title": "Housekeeping Aide in Saint Paul, MN", "duration": "N/A", "pros": "Great pay ! & Great Benifits For Full Time Employees", "cons": "Can't move up as much as you'd like"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Anonymous Employee", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Jun 2016", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "The best reason to work at HealthEast is you can lower your standards.", "cons": "Management is Sneaky, Deceitful, and Manipulative—My Manager was is not to be trusted. He’d lie, twist facts, withhold information, break confidences, and gossip at the drop of a hat. He is also fond of mind games and gas lighting. Beware!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Jul 2014", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Great coworkers, team environment. Decent pay for part time employement.", "cons": "Hostile management team. Zero transparency in regards to policy changes or enforcement of discipline. When issues such as broken equipment was brought up in meetings, nothing was done to repair or replace it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great hospital", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jan 2017", "job_title": "Surgical Aide in Maplewood, MN", "duration": "N/A", "pros": "Great experience \r\nHigh pay for extra level\r\nFast paced\r\nGreat management", "cons": "Strict scheduling but understandable due to the general nature of a hospital"}], [{"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Current", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Feb 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Proactive in asking employees to leave reviews on online review profiles. They are reaching out to the best, most loyal employees and ask them to give their two cents. They can't stop negative reviews from cropping up, but try's to minimize their impact by surrounding themselves with positive reviews.", "cons": "I work at HealthEast and I am a team player."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Poor culture", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Sept 2018", "job_title": "Anonymous Employee in Oakdale, MN", "duration": "N/A", "pros": "They have to pay you.\r\nNice facilities.\r\nFree water.", "cons": "Promotes a culture of favoritism.\r\nUnfair work expectations.\r\nLeadership is poor and does not advocate for you."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "HUC", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Nov 2017", "job_title": "HUC in Denver, CO", "duration": "N/A", "pros": "Great opportunity for anyone looking for a starter career in healthcare or business administration", "cons": "Cranky nurses or doctors taking their frustration out on you"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jan 2019", "job_title": "CNA/HHA in Seattle, WA", "duration": "N/A", "pros": "Make your own schedule, great co workers", "cons": "have to drive for your job management kept changing"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Healtheast Care Connection", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Dec 2016", "job_title": "PSR in Saint Paul, MN", "duration": "N/A", "pros": "I love helping patients. Great co-workers and awesome supervisors", "cons": "family orientated for patients but not for the employees"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Aug 2017", "job_title": "Director in Seattle, WA", "duration": "N/A", "pros": "Competitive pay and benefits. Lots of room for growth and support and development opportunities", "cons": "Lots of changes with the organization."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "HealthEast Care Systems", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Feb 2018", "job_title": "Patient Service Representative in Atlanta, GA", "duration": "N/A", "pros": "The pay is the only good thing about HealthEast", "cons": "You have to use PTO for holidays."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Pretty Good Company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 May 2015", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "decent benifets with above average pay", "cons": "it seems like the company is downsizing"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poor Management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Sept 2019", "job_title": "SPD Supervisor in Saint Paul, MN", "duration": "N/A", "pros": "Great dedicated front line staff", "cons": "Poor Management \r\nStaff educator did not educate staff\r\nPaper pushers"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "CNA", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "24 Dec 2017", "job_title": "Certified Nursing Assistant CNA in Maplewood, MN", "duration": "N/A", "pros": "Working with the employees", "cons": "Seemed to get petty with employees over the years."}], [{"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "balanced", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jan 2012", "job_title": "Surgery Scheduler in Saint Paul, MN", "duration": "N/A", "pros": "employees are dedicated to their jobs and patients", "cons": "lots of work, sometimes feel short staffed"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Beware Fairview Employees", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Mar 2017", "job_title": "Physical Therapist in Saint Paul, MN", "duration": "N/A", "pros": "Human Resources are good at deflecting the their problems.", "cons": "Merging with HealthEast Care System is going to make many Fairview employees unhappy. Lets hope Fairview management takes over many HealthEast departments...specially the HR department."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "RN", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Aug 2017", "job_title": "Staff RN in Saint Paul, MN", "duration": "N/A", "pros": "Good stable environment and people, relative job security, good benefits.", "cons": "Lack of collaborative effort from department to department."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "12 Aug 2015", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "There is nothing positive to say about this place.", "cons": "Crummy Management. They are on a major power trip. They treat employees like trash."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "CMA", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Mar 2017", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "Advancement opportunities . Great Core values", "cons": "Being acquired . Unsure of future"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Great Employees/Unstable Management", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Aug 2017", "job_title": "Anonymous Employee in Saint Paul, MN", "duration": "N/A", "pros": "The best medics and EMT's out there.", "cons": "No incentive to stay."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Feb 2020", "job_title": "Administrative Nursing Supervisor in South St Paul, MN", "duration": "N/A", "pros": "Great people, great job, good compensation", "cons": "Difficult transition to Fairview at this time"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "good", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Sept 2020", "job_title": "Technician in Minneapolis, MN", "duration": "N/A", "pros": "It is a good company to work for.", "cons": "Scheduling can be challenging and high turn-over."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jul 2018", "job_title": "Patient Registrar in Maplewood, MN", "duration": "N/A", "pros": "co worker are great\nfriendly atmosphere", "cons": "not too many cons except for the hours"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It's decent", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Dec 2019", "job_title": "Certified Nursing Assistant in Maplewood, MN", "duration": "N/A", "pros": "Good training. Learn a lot. Extra shifts.", "cons": "Short staffed. No flexibility with staffing."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "HealthEast", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Apr 2017", "job_title": "Project Manager in Saint Paul, MN", "duration": "N/A", "pros": "Knowledgeable staff that is very helpful", "cons": "lack of flexibility in schedules"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Registrar", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Sept 2015", "job_title": "Registrar in Oakdale, MN", "duration": "N/A", "pros": "There is nothing good about working at HealthEast", "cons": "Poor communication! Management is terrible"}]]