[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Zkzks", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Oct 2021", "job_title": "Ophthalmic Technician in Hoffman Estates, IL", "duration": "N/A", "pros": "Growth \r\nopportunities \r\nNetworking\r\nSkills \r\nPersonal time\r\nEfficiency", "cons": "Draining\r\nFast paced\r\nOverwhelming \r\nSocial \r\nAlert\r\nTime off"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Solid organization , but make sure it's a culture fit", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "1 May 2023", "job_title": "Director of Marketing in San Francisco, CA", "duration": "N/A", "pros": "Organization has a clear vision as to its purpose and role in supporting EyeMD's and is pretty well-run for a non-profit association. Stable environment. If you are interested in a career with professional associations, could be a good place in one's career path. Great location for anyone who wishes to work in SF.", "cons": "Definitely requires one to have the \"non-profit\" DNA. It's not a place for those who seek or have a passion for significant innovation or driving change. If you're the type who thrives on working with highly motivated, creative people who embrace change, you may find the non-profit option underwhelming as many who work in such orgs are not of the \"startup\" or \"innovation\" mindset. This is true for most non-profits, not just AAO."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very few growth opportunities", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 May 2023", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Nice staff, subsidized parking, remote work, 401K", "cons": "No growth. You’ll stagnate and be bored. Lots of lifers waiting to retire."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Gov Affairs", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Apr 2023", "job_title": "State Affairs Manager in Washington, DC", "duration": "N/A", "pros": "Good benefits at the academy", "cons": "not good management, very archaic"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Beware of toxic work culture", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Dec 2021", "job_title": "Event Manager in San Francisco, CA", "duration": "N/A", "pros": "Exterior goals and support of global health and diversity are noble and worthwhile.", "cons": "Make sure you ask about your team and work styles during interviews, as the internal environment can be micromanaging, micro-aggressive, and unsupportive. Claims of work/life balance are damaged by unrealistic expectations and managers working and monitoring performance at all hours."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Dec 2021", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Hours, location, and some staff", "cons": "Pay, culture, leadership, limited room for advancement"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Nice work environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Aug 2021", "job_title": "Administrative Assistant in Washington, DC", "duration": "N/A", "pros": "It's a nice place to work, there will be slow days and busy days. Good work-life balance. Busy during certain times of the year.", "cons": "I can't think of anything - maybe some of the higher-ups in the office are older and therefore a bit old-fashioned."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Aug 2021", "job_title": "Client Program Specialist in San Francisco, CA", "duration": "N/A", "pros": "Good work environment and staff, noble mission", "cons": "Employees tend to stay a long time, which makes upward mobility difficult"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Glad I'm Here, Plan to Stay, Overall Very Happy", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "1 Jul 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Meaningful work - protecting sight and empowering lives, you have the opportunity to make a positive impact every day\r\nStrong community and culture - lots of smart, hard-working people who are good at what they do and want to make a difference. We also work with amazing volunteer physicians\r\nBeautiful location - Billion dollar views and great trails right outside the door and a nice office\r\nGreat benefits - 401(k) program is awesome, vacation time is generous, additional perks like yoga and Pilates classes on site and the office is closed between Christmas and New Year's Day. Overall, they take good care of us\r\nOpen to new ideas and innovations - we're leading some really exciting technologies that will lead to breakthroughs in health care, and new ideas and innovations are encouraged from all levels\r\nStability - we've been around a long time and have solid plans for healthy long-term growth. Many of our team have been here for decades\r\nFlexibility - depending on your position, there may be opportunities for a somewhat flexible schedule or working from home from time to time\r\nProfessional development - on-site professional development opportunities classes are provided, and off-site professional development activities are supported", "cons": "Promotion - because we are so stable and people stay here for a long time, there can be limited opportunities for upward mobility\r\nCommute - due to the location of the office, the commute can be a bit tricky\r\nRaises - we get an annual pay increase, but it's modest - more like a cost of living adjustment\r\nStaffing - we tend to be understaffed in many departments"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "work here if you are obedient", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Apr 2016", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "* Decent but declining benefits for small non-profit company\r\n* Good location \r\n* Good natured co-workers  - in general", "cons": "* Top management with exceptionally large ego\r\n* Declining employee benefits - AKA almost everything is outsourced to ADP\r\n* Competency is not required for employment - but, either you obey or you are managed out\r\n* Handful of competent senior managers\r\n* Regimented work hours that promotes inefficiencies\r\n* Plenty of demotivated employees\r\n* They ask you to fill out so-called anonymous employ survey (they give you unique user ID and password - how dumb do they think employees are!!!) but they don't do anything about the results except padding the senior management on the shoulder\r\n* vVery little chance of promotion unless you are a personal favorite - again, competency and high ratings do not have value"}], [{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A good place to work for a", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2010", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Overall, this is a really good small company (I think about 200 employees).  Salaries and benefits are competitive and a great work/life balance.  limited promotion opportunities because of its size  but you can certainly learn some new skills here and move on if you like.   The academic culture of the company is not for everybody - but this is a great place to be in a recession.", "cons": "New CEO does not seem to have a vision.  We were excited to see someone new in the corner office and hoped he would deal with the appalling IT division, but after one year he seems to let things just ride.   \r\nLike all companies there are some poor performers that need to be shown the door, but CEO does not seem to care about the employees he just spends time with the board."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Stolid, Old-Fashioned, and Dry", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Feb 2017", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Great benefits (401K match, 4 weeks of vacation/year, office closes during Christmas)\r\nNice people\r\nGood mission\r\nGood work/life balance\r\nNice office on the water next to Ghirardelli\r\nJob stability (org has been around a long time and never has big layoffs)", "cons": "Horrible middle managers who are \"lifers\" (especially in Clinical Education department)\r\nRedundant work in old-school cubicles\r\nNo snacks/lunches (again - very old school)\r\nStifling bureaucracy and politics\r\nZero transparency\r\nExtreme siloing\r\nVery hierarchical and no room for advancement because middle managers never leave\r\nLow pay (since leaving I've literally DOUBLED my salary without adding to my workload or taking away from my work-life balance in any way)\r\nNot very exciting work - in the SF Bay Area there many other far more exciting, interesting, and better-paying opportunities, including at both non-profit and for-profit places dedicated to \"doing good\""}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good if you don't care about sitting in the same cubicle doing the same thing for 20 years", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Jul 2015", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Nice people. Nice office. Fruit on Mondays and Wednesdays. Work from home opportunities depending on the department. Good company mission. Pretty good benefits.", "cons": "No room for growth.Top exec. is aware of this but not really able to change it. An old company with an old mindset and old structure. Certain middle-managers who have been there for 15+ years are crazy but have diplomatic immunity. If you don't care about sitting in the same cubicle doing the same thing for two decades, this is a good place to work."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Industry-leading non-profit with unusually high recent turnover", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "31 Dec 2015", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Work at the Academy supports a cause you can feel good about -- helping the doctors who help people preserve their vision. You also work under a pretty diverse executive team (which is to say, it's more representative than other organizations I've seen). One of the better-run associations in medicine, it's a leader in the industry whose shrewd management brought it through the circa-2008 downturn without layoffs. Some of the benefits are nice -- they get a biweekly fruit delivery, have a free bike program to help employees run errands and offer generous vacation to longstanding employees. They also have an unofficial but decade-long practice of giving staff the stretch between Christmas Eve and New Year's off as paid leave and recently introduced an annual bring-your-dog-to-work day. Though the commute can be challenging, some managers allow occasional telework, and the operations staff worked with Chariot to provide an alternative to MUNI. Recent efforts have also sought to get more employee input on the company in general.", "cons": "Limited room for advancement and terrible compensation policies if you do advance. If you get promoted one job grade, your pay raise is capped at 5 percent, no negotiation available. They supposedly benchmark salaries against industry every three years, but I had such an evaluation shortly after a promotion and they somehow concluded my new pay matched industry standards. It did NOT, according to my research on Salary.com, but when I asked for the data that supported their conclusion, they never responded. The Academy was a great place to work seven-plus years ago, but work-life balance can be pretty bad in some departments, with little to no recognition for sacrifice. After one huge, extremely demanding project I worked on, the core team got only the usual annual bonus for that year (less than one paycheck after taxes; bonuses depend on the fiscal-year outcome) and a worse-than-usual thank-you meal. After putting in about 130 hours' overtime toward the end of the project -- the most in my near-decade there, with multiple 12-hour days -- I got only two days of unofficial comp time and a fractionally higher annual merit increase. (I don't think our team had any larger a merit pool, despite the project; I think that was just how my manager chose to allocate it.) Probably related to these factors, 2015 brought unusually high turnover."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good for a few years, could use a revitalization", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Oct 2017", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Good stability, employees often stay for many years. There are some very nice people and the pay is decent starting out and gets better the longer you stay.", "cons": "There is a lot of politics and drama in the leadership. Not a lot of opportunities to advance. You get pay increases over time, but they top out eventually and then there's little to no upward mobility."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "A good place to work for a short time.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Oct 2009", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "AAO has a very good reputation among medical associations, and it looks great on a resume.  It's a small company (under 200) so it's easy to get to know a lot of your co-workers. They are a great group of people, smart, fun, and I think most people really do try to do their best and make the org the best it can be.  Benefits overall are the best I've ever had, especially the 401k.  You can choose between Kaiser or Blue Cross for medical.  Dental is ok, but vision is surprisingly poor.  Professional development is offered to everyone, though some managers/depts encourage it more than others, and you may not be able to do something if it isn't directly related to your current job, even if it would help you be more promotable within the org. People seem to give praise and thanks to each other pretty freely, so it is a supportive environment in that way.  We usually get the week from Christmas to New Year's as a bonus week off.  You start with 2 weeks of vacation a year and after 3 years, you get 3 weeks/year.  You get more sick days than vacation days.  Our CFO has done a great job, we have a good financial cushion so even with the economic turndown, there were no layoffs.  Most of management is pretty cool and respectful of all employees, regardless of position or degrees.", "cons": "Because of the pros and we're the only med assn in SF, there are a lot of \"lifers\"-- people who have been here 10, 15, 20 years and more, and of course, a lot of these people are in middle/upper management.  This makes it extremely difficult to promote to better positions.  It also means there's a lack of fresh blood with new approaches and perspectives, resulting in a lot of \"well, we always do it this way...\".  Some upper management tend to be too influenced by advanced degrees and fancy schools and job titles, which has resulted in some poor hiring decisions.  I think most \"middle\" people are underpaid at least 10-20%.  Though managers do give praise, the way the evaluation system is set up, it's almost impossible to achieve more than a \"satisfactory\" rating.  Also each job is assigned a level number which is too inflexible; so even if you  achieve more or improve something better than your predecessor, you are still stuck in place.  This is especially frustrating when you end up with more responsibility, achievements, and skills than your numeric (and salary) equals.  Top leadership changed this year, and there are some struggles while he gets to know his employees, what we do, and what we value."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Has potential  but needs a change  in management.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Dec 2015", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "The organization has a  good educational mission.", "cons": "Cost-cutting measures are the most important tool used by upper management,  regardless of outcome  and detriment to the operation. \r\n\r\n Under performers are maintained in positions while other employees pick up those  job responsibilities.\r\n\r\n No growth and very little opportunity  for advanced pay and promotions."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Optically Perfect for the Unambitious", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jul 2013", "job_title": "Coordinator in San Francisco, CA", "duration": "N/A", "pros": "Great benefits\r\nOrganic fruit delivery 2 x a week\r\nSocial Clubs (knitting, reading, weight-loss)\r\nFun work events\r\nFriendly co-workers (for the most part)\r\nCalifornia casual attire", "cons": "No room to grow\r\nMediocrity is rewarded\r\nExpensive monthly parking (even though it is discounted)"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "wonderful mission, horrible location", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 May 2015", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Great 401k, smart people, friendly atmosphere, wonderful mission. Opportunities to learn, grow and explore if you have a good boss.", "cons": "Horrible location (Fisherman's Wharf). Not much room for advancement, as many upper management have been there 10, 20, even 30 years. Work/life balance depends on the department you're in."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Mar 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Noble mission. Great colleagues. Passionate physician volunteers.", "cons": "Interesting cultural tension between longer-tenured staff (15+ years) and those who are newer to the organization."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great for a medical society... but plenty of more exciting options in the Bay Area", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jan 2014", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Innovative, forward thinking medical society.  Lots of new, exciting things coming out of the Academy.", "cons": "Lifers, tons of lifers. Either you stay for a long time or you're gone within a 1 - 2 years. No inter-department collaboration."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "A Good Association Compared to Others in the Physician Community", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Mar 2017", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Good work/life balance, extremely engaged membership, dedicated/hardworking staff, good 401k match and vacation time", "cons": "Not quick to adjust to change or open to new ways of doing things, little room for upward mobility, low compensation in comparison to corporate pay structure."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Low turnover!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 Jun 2017", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "AAO is a great place to work.  Many staff are over 20 year employees.  Several staff have returned to work a second time at the Academy after working other places.", "cons": "Staffing is lean compared to some associations"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The American Academy of Ophthalmology", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jan 2010", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Small association that is more like a family. The people are on the whole great.", "cons": "Very cliquey. Some people fit and others leave quickly."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place for most people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 May 2013", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Great benefits, friendly people, a mellow environment providing a great service.", "cons": "Great place for many people, but there's limited room for growth (professionally and financially)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "My Experience working at AAO", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Jul 2017", "job_title": "Anonymous in San Francisco, CA", "duration": "N/A", "pros": "Stable Company. Flexible working hours.  Excellent work/life balance. Great 401k program. Generous vacation time.", "cons": "Little opportunity for Job Growth."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Coordinator", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "23 Oct 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Benefits, time off,  flexible hours per manager", "cons": "Not much movement in the company"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Meaningful work, work-life balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Oct 2020", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Nice colleagues and balanced work life throughout most of the year.", "cons": "Limited room for growth/upward mobility."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2020", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "Nice people, office in SF, nice break room, worklife balance", "cons": "Fisherman's wharf location, pay/bonuses, slow moving"}]]