[[{"date": "19 Jun 2023", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "panel interview with all faculty and staff members in the department. casual but targeted questions related to previous experience and also future job responsibilities. wasn't too bad but would still prepare.", "Interview Questions": "Do you have any previous research experience?"}, {"date": "15 Jun 2023", "title": "Athletics Media Relations Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Villanova University (Philadelphia, PA)", "Interview Descriptions": "Three directors on the call starting with the assistant a.d that welcomed with an introduction to then go into questioning for me. Then my turn for questioning of their team", "Interview Questions": "Where do you pull your inspiration for content from?"}, {"date": "9 Jun 2023", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Villanova University (Villanova, PA)", "Interview Descriptions": "Upon setting up an interview, I had about an hour long Zoom interview, and then an all day on campus interview with various groups of people and individuals. I'd say from 9 am- 4 pm.", "Interview Questions": "What did my experience as an alumnus of the university contribute/affect/inform me in what I hope to accomplish in this role?"}, {"date": "9 Jun 2023", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "I was asked 2-3 questions about my goals for the program, what I expected from the role, what did I want to learn from my supervisor, walk through resume, how did I choose Villanova", "Interview Questions": "What do you want to get out of this program?"}, {"date": "26 Jan 2023", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "Work well in a team and individually. Emphasize self identity and community identity. What does being a Villanovan mean to you? Always put the emergency first, then immediate student needs, then school. That’s what they expect.", "Interview Questions": "Why do you want to work here"}, {"date": "3 Nov 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Villanova University", "Interview Descriptions": "There were three steps to the interview process: a phone interview, a Zoom interview, and then a skills test. After doing all three and following up a week later, I received no response (not even a rejection email). Time wasted.", "Interview Questions": "What's the biggest challenge you've faced in your current position and how did you overcome it?"}, {"date": "6 Jul 2022", "title": "Assistant Director of Annual Giving Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Villanova University", "Interview Descriptions": "I enjoyed the interview process but it was definitely rigorous. I had a phone screening with my supervisor, then an in-person interview with my supervisor plus two three-person panel interviews in the same day. When I was called back as a finalist I had another interview with my supervisor and a two-person panel with vice presidents.", "Interview Questions": "I was asked how I prioritize and manage multiple deadlines."}, {"date": "13 Dec 2022", "title": "Events Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Villanova University (Villanova, PA) in Jun 2022", "Interview Descriptions": "First was a phone call about the job and what candidate they were looking for. The second call was a phone interview then it was an in-person interview with three of the Sales / Event Managers and the General Manager. Furthermore, on the first call, I was told I would not be \"Ghosted\" and I would be told of the outcome and in the face-to-face interview, it was mentioned again. That being said, do not expect a call or an email if you were not offered the job.", "Interview Questions": "N/A"}, {"date": "10 Feb 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Villanova University", "Interview Descriptions": "A nightmare, the search committee obviously were forced to bring me in and literally paid no attention to me during the entire process. They barely spoke to me at a faculty dinner and were on their laptops the majority of my visit. At the end they said \"hey can we just call you an uber to the airport?\"  Awful humans", "Interview Questions": "They asked me if I could actually do something in my field which I have a full MFA in "}, {"date": "21 Dec 2021", "title": "Computer Consultant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "It was pretty easy and they just want to learn about you and your competency. There is no technical question asked during the interview. Be confident and build up trust that you can handle the job.", "Interview Questions": "They asked questions off from your resume. "}], [{"date": "8 Dec 2021", "title": "Access Services and Library Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Villanova University (Villanova, PA) in Nov 2021", "Interview Descriptions": "Multiple rounds of interviews with a variety of individuals from the library. After that do an in-person all-day interview that was quite intensive. The wait time after the interview is pretty long.", "Interview Questions": "Why do you want to work at Villanova?"}, {"date": "30 Aug 2021", "title": "Graduate Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "Straightforward demographics and essay application followed up with a few brief calls. A great experience from start to finish! I would recommend reaching out to a professor or director going into the program to make sure your application is especially noticed.", "Interview Questions": "What are some skills you are especially looking to develop throughout your experience as a fellow here?"}, {"date": "1 Jul 2021", "title": "Information Security Risk Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Villanova University (Radnor, PA) in Jun 2021", "Interview Descriptions": "The  interview process started with a 30 minute phone screening with 2 individuals and was followed by a 1 hour panel Zoom meeting with ~6 individuals. There were lapses in communication between planning both telephone calls and nothing since the Zoom call in general - A recruiter would definitely help more streamline this process. Overall, it was an easy, pleasant process.", "Interview Questions": "Risk scenario questions sent 15 minutes prior to the call."}, {"date": "6 May 2021", "title": "Executive Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Villanova University (Villanova, PA) in Apr 2021", "Interview Descriptions": "Did an online application, with a request for 3 references. All three references were contacted for reference letters before the interview. Had a video interview with the Dean of Grad Studies for an hour. Was promised at the end of the interview that I would be emailed if I was chosen to go forward for a second interview. Was turned down via a robo-email three weeks later. Overall the process too over a month and I am very angry that I had to waste the time of my references for yet another rejection. This is the third job that I have applied for, been asked for reference letters, been interviewed and then been rejected. I would definitely caution anyone applying for a staff position here to think twice if they do not want a lengthy and disappointing interview process.  Also HR is no help, I asked them about my references were being hassled for letters even before I had done an interview and they said that the interview process was up to the department. Absolutely unreal.", "Interview Questions": "Tell me about yourself. Why are you leaving your position? "}, {"date": "16 Mar 2021", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "It was a ten minute phone interview with the pool manager. Asked me about my experience and skills. Asked me about how much i wanted to work and how many days of the week.", "Interview Questions": "what is your experience as a lifeguard?"}, {"date": "3 Feb 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "No interview process, just an application that had multiple essays to fill out. So just write well and you should be good. Not to bad of a process at all", "Interview Questions": "Why do you want this position?"}, {"date": "29 Jan 2021", "title": "Development Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "Thorough, transparent, informative.  Met with variety of team members.   All were enthusiastic, welcoming, professional and responsive to questions.   The cohesion of the staff was evident.  It was clear that decision makers were interested in learning not just about background, but also about work style and approach to fundraising.  Very positive experience.", "Interview Questions": "What particularly interests you in working at Villanova?"}, {"date": "16 Feb 2023", "title": "Pet Care Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Villanova University in Jan 2021", "Interview Descriptions": "easy, and felt confident with the answers I was given to questions I had. The whole process was great and I ended up getting the job! The interview was short sweet and to the point which is always nice", "Interview Questions": "What skills do you feel make you the ideal candidate?"}, {"date": "14 Dec 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "The intern process was a process that was not too bad.  Was just asking about the position and having and understanding of the field. The questions were all related to the position", "Interview Questions": "What experience do you have in the past"}, {"date": "26 Oct 2020", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Villanova University (Villanova, PA)", "Interview Descriptions": "the interview process was an excellent streamlined process took no longer than a couple of weeks and everyone involved was quick to respond and kind, interviews were behaviorally-based for the most part", "Interview Questions": "What is one of your strengths?"}], [{"date": "2 Oct 2020", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Villanova University", "Interview Descriptions": "The interview was pretty lenient that the interviewer did not ask too technical questions. It is just that you are willing to help as a help desk consultant. Besides that, they will offer training session before the school starts and along with your employment.", "Interview Questions": "They asked me about my volunteering work that is listed on my resume"}, {"date": "25 Oct 2019", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Villanova University", "Interview Descriptions": "I met with three full-time professors in 2010 from the Psychology department who were quiet and reserved at first, but the interview got heated quickly: the one of the three professors who called me to set up the interview did not screen me thoroughly enough, and it became clear very quickly that I was not the right fit. The interviewers took turns verbally insulting me. It was not a productive or professional use of anyone's time, and I would have preferred that we ended the interview early instead of make a charade out of it.", "Interview Questions": "Have you ever programmed experiments?"}, {"date": "25 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Villanova University (Villanova, PA)", "Interview Descriptions": "It wasn't recent, but if I remember he and she was nice and my teacher was helpful. I used a lot of data and excel. I assume word documents too.", "Interview Questions": "N/A"}, {"date": "2 Aug 2019", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Villanova University in Jul 2019", "Interview Descriptions": "This was a 3 1/2 hour interview with several departments.  It was grueling, but the staff was nice overall.  It was a series of panel interviews, at the end I could not think straight and was worn out.", "Interview Questions": "Why do you want to work with Villanova?"}, {"date": "2 Oct 2018", "title": "Veterans Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Villanova University in Aug 2018", "Interview Descriptions": "I was called for a phone interview. It went very well, and was told that I would hear from either the Dean or the Assistant Dean in the next couple days with the next steps. Over a week later I emailed for an update with no response. I waited about 2 more weeks, and emailed again. I got a response stating I would hear back shortly from, again, either the Dean or the Assistant Dean with the results. Over a month later still no response. Then whoever was hired posted his title on the internet, and that is how we were notified of the decision. This was the 2nd interview where I noticed very unprofessional follow up, or lack thereof. The first one they even went so far to get each of my references to write full letters, and were supposed to bring me in for a second interview, but then just never contacted me again. They not only wasted my time, but also wasted my references time.", "Interview Questions": "Tell us about yourself."}, {"date": "15 Feb 2021", "title": "Marketing/Promotions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Villanova University in Jul 2018", "Interview Descriptions": "I had a phone call discussing my previous work experience and what I was looking to accomplish and what I wanted to work on during my time at the company.", "Interview Questions": "What type of experience do you have in Marketing?"}, {"date": "23 May 2018", "title": "Deans Office Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Villanova University (Villanova, PA) in Aug 2017", "Interview Descriptions": "Tough interview. Met with 8 people total over 3 days and had a small presentation. It was a good experience overall, I was disappointed I did not get the job but they urged me to keep applying.", "Interview Questions": "Tell me about why you want to work at Villanova?"}, {"date": "19 Jul 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Villanova University (Villanova, PA) in Jan 2017", "Interview Descriptions": "Was a great experience  interviewing with potential professors I was hoping to work with. They asked me a bunch of questions and provided me a ton of information on what the research was about and what the expectations were for me .", "Interview Questions": "Why are you interested in research"}, {"date": "6 May 2016", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Villanova University in Apr 2016", "Interview Descriptions": "The job description was posted on the university's human resources website, and the only unusual required document was a statement of contribution to the university's mission. The interview itself was fairly straightforward, with the chair of the department and two faculty members participating. They were all very kind and professional.", "Interview Questions": "How would you teach an intermediate-level course in this department?"}, {"date": "30 Mar 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Villanova University", "Interview Descriptions": "4 round interview process. I applied online and was called in to do first round of interviews. Everyone i met with was very nice. The questions were fair and I enjoyed the process. Each interview asked different sets of questions, beyond the normal background information about myself.", "Interview Questions": "what is your leadership style?"}], [{"date": "8 Dec 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Villanova University (Villanova, PA) in Nov 2015", "Interview Descriptions": "My professor took me skype interview and he handled the procedure with 100% professionalism. He notified me the situation of my interview within shortest possible time.  After I was selected for the post he managed everything for me with much care and professionalism.", "Interview Questions": "What was my previous research?"}, {"date": "11 Jan 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Villanova University", "Interview Descriptions": "It was totally based on our grades (Min of 3 GPA) and our skill set. I was tested majorly in web technologies like html, css, javascript, jquery and one of the powerful CMS.", "Interview Questions": "I didn't find any unexpected questions."}, {"date": "14 Oct 2014", "title": "Patrol Officer II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Villanova University", "Interview Descriptions": "After applying several times over the course of about two years (Note: I exceed the experience & education requirements) I was eventually contacted by telephone and offered the opportunity to come in for an interview. Before the interview you are required to sign a nondisclosure agreement regarding the interview process/questions; I guess they do not want people to know about their impractical hiring process. The interview process consisted strictly of about 6-8 situational questions with a panel of 3-4 supervisors. The questions were ridiculous and slightly unrelated to the position. I have had many interviews in the past but never one like this. I was not asked any normal interview questions. All in all, the interview lasted ten minutes at best, and upon conclusion I was not given the opportunity to ask any questions. I was told that I would be contacted with a decision within two weeks good or bad. However, I did not hear back from Villanova until about two months later via email.", "Interview Questions": "Situational Question: It's 7:30am and you have to be to work at 8am. Prior to arriving at work you have to: stop at the cleaners, get gas, fix a flat on your car, make breakfast for your family, and call your insurance company regarding home renovations. Describe in detail what order you would complete the given task and why. "}, {"date": "11 Aug 2015", "title": "Major Gift Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Villanova University (Villanova, PA) in Mar 2014", "Interview Descriptions": "The hiring and interview process took forever. I had 11 interviews or conversations. There wasn't much clarity to how long the whole process was going to take or why it was important to talk to certain people. They were flexible on dates to come in and interview.", "Interview Questions": "Talk in depth about the largest gift you have secured."}, {"date": "1 Jul 2013", "title": "UNIT Support Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Villanova University", "Interview Descriptions": "Written Test and Interview", "Interview Questions": "How do you test vending machine "}, {"date": "21 Jun 2015", "title": "Campus Ministry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Villanova University (Villanova, PA) in Apr 2013", "Interview Descriptions": "Skype or on-campus option for interview.  Relaxed and enjoyable.  They want to know what kind of experience you have with students and want to get a feel for how you will minister to them.  They also want to know how well you work on a team.  What is your understanding of faith?  Do you have experience with retreats or service opportunities? How do you envision yourself balancing work life and personal life?  What do you do in times of stress?", "Interview Questions": "How do you think you will interact with students?"}, {"date": "14 Oct 2016", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Villanova University (Villanova, PA) in Jan 2013", "Interview Descriptions": "Dining services jobs are provided to current students and outside employees. I applied as a student and hence had no interviews. Jobs are provided on a rolling basis till hours run out. It is imperative that you reach the dining services office as soon as the semester begins to secure the hours you want along with the locations you want to work at.", "Interview Questions": "N/A"}, {"date": "23 Apr 2015", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Villanova University in Dec 2012", "Interview Descriptions": "Very informal and simple, since the job requires very little experience. Really, they just look for on time, responsible, motivated young adults. Some questions were asked as to why I was applying, ,and if I thought I would do a good job. Just need to go talk to the building supervisor, rather than set up an interview schedule", "Interview Questions": "Why do you want this position?"}, {"date": "27 Mar 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Villanova University (Villanova, PA) in Nov 2012", "Interview Descriptions": "In addition to standard interview, they also have a team building exercise to see how you get along with others and what your strengths are/what you can contribute. I am not allowed to say specifics because that would be unfair to those who do not read this site. Just be honest about who you are and why you want to be an RA. They look for a holistic team of strengths in each building, so don't be afraid or try to be something you are not.", "Interview Questions": "Why do you want to be an RA?"}, {"date": "28 Aug 2010", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Villanova University (Philadelphia, PA) in Mar 2010", "Interview Descriptions": "Initial communication was good. Campus interview was pleasant with some faculty members and unpleasant, almost aggressive, with others.\r\n\r\nIt does not matter if a department wants to hire you. Unlike most universities, the final decision is up to the dean and the department has to accept that decision.\r\n\r\nCommunication of the final decision about hiring was quite unprofessional - a one line e-mail message from the Human Resources Center-", "Interview Questions": "The interview with the dean. He asked bias questions towards religious beliefs"}], [{"date": "1 Nov 2012", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Villanova University (Villanova, PA) in Aug 2009", "Interview Descriptions": "On-line posting of position found on the University Site\r\nSubmission of resume and references, via on-line, to HR Department\r\nWait for response and in some cases, no responses is ever rec'd.\r\nContacted for interview\r\nOffered presented and meet with HR to formalize offer presented and sign-up for benefits\r\nStart, work and received yearly review, after Self Evaluation is provided by Staff Member", "Interview Questions": "N/A"}]]