[[{"date": "18 May 2023", "title": "Advertising Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heifer International", "Interview Descriptions": "I received an email with a virtual interview appointment. I went to the interview feeling friendly and confident, but unfortunately, the hiring manager was incredibly rude. I'm actually relieved that I didn't get the job. It seemed like she had no interest in being part of the meeting at all. I understand that things happen, but at the very least, basic courtesy would have been appreciated. She asked me only one question that didn't make any sense, and then abruptly stated that she was done and had no further questions for me. On the other hand, the other interviewer was quite pleasant and carried on with the interview. When I asked follow-up questions to the hiring manager, her answers didn't make any sense to me. It's no wonder they've been struggling to hire someone for months or why people are leaving. I'm actually glad it didn't work out.", "Interview Questions": "I give you $5,000 what will be your media mix."}, {"date": "29 Nov 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Heifer International (Little Rock, AR)", "Interview Descriptions": "Interview process was very lengthy (3 months and 4 interviews for one position.) I made it to the final round of interviews, then never heard from them again. The last interview was one-on-one with an executive, who showed up to my interview in a wrinkled t-shirt and couldn’t be bothered to even reply to my follow-up email. Very strange experience.", "Interview Questions": "What am I seeking from this position?"}, {"date": "11 Apr 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Heifer International in Nov 2022", "Interview Descriptions": "Conducted first and second round interviews on zoom with team that is globally distributed . Role had option of working remote . First round was HR with HR related questions etc ,salary expectations Second was technical panel with programs & BA", "Interview Questions": "Asked experince in rolling out PROGRAM systems ie Monitoring and Evaluation"}, {"date": "7 Oct 2022", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Heifer International in Aug 2022", "Interview Descriptions": "Multiple stages of interviews including a recruiter call, screening call with the hiring manager, panel interview with the team, and a practical exercise. There were substantial delays between each phase.", "Interview Questions": "Describe your experience managing international teams."}, {"date": "25 Mar 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Heifer International", "Interview Descriptions": "Interviewed by committee.  Thoughtful questions and also ensured to answer my questions.   I felt it was a very open interview process in that they wanted to ensure it was a cultural fit for me also.", "Interview Questions": "Focused on asking about relevant experience "}, {"date": "4 Apr 2022", "title": "Consultant Groundnuts Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Heifer International (Bergen op Zoom) in Mar 2022", "Interview Descriptions": "I interviewed for the first round and now I am preparing for the second round I am sure that they will ask me about my salary expectations so I want to know the salary range for a project officer position", "Interview Questions": "Why I think I am the right candidate"}, {"date": "3 Nov 2021", "title": "Mission Effectiveness Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heifer International (Little Rock, AR)", "Interview Descriptions": "Heifer does a pre-screening, then they invite you in for an hour-long interview in person. Before in-person interviews, they ask that you complete an assignment relevant to the position with about 48-72 hours' notice. My complaint during this interview process was that the panel did not coordinate their own questions before the interview. I got the same question repeated about 3 times. Then, they did not leave me any room at the end of the interview to ask them questions. I've never experienced any other employer that has cut off a meeting or interview without letting the candidate ask a couple of questions of the committee.", "Interview Questions": "What technology systems do you use for project management?"}, {"date": "18 Mar 2021", "title": "Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heifer International", "Interview Descriptions": "After a 30 minute phone screen with the HR person, I had two panel interviews via Zoom. The first was with a variet of people across the organization and was scripted with behavior-based questions. The second was with the two VP's that the position would report into.  These interviews went smoothly.   I had heard nothing more  following the interview, so I wrote an e-mail to the HR representative a week later.   He never responded. It wasn't until a month following the final interview that I got an automated rejection e-mail, which I found totally bizarre given I went through several rounds of interviews.", "Interview Questions": "We've read your resume. Please tell us why you are qualified for this position?  How would colleagues discribe your management style? Describe a situation when something you worked on went wrong and how you reacted."}, {"date": "25 Feb 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heifer International (Nairobi)", "Interview Descriptions": "It was 2 sessions. First one was a panel interview and the second a written interview. The panel had about 5 people from different departments.\nThe questions asked were relevant to the JD and a lot if the questions were actual scenarios that one would encounter while doing the same job.", "Interview Questions": "Come up with a comms strategy, comms work plan... "}, {"date": "19 Oct 2022", "title": "Finance Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heifer International (Nairobi) in Sept 2019", "Interview Descriptions": "I didn't get to the final stage, however, it was well handled. The questions asked were clear and direct, considerate, and I really felt they wanted me to succeed. A quick practical/ written interview preceded the oral one which was also fair.", "Interview Questions": "How did you find out about us? Why do you want to work for this organisation? What skills do you have that make you the best fit?"}], [{"date": "5 Nov 2018", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heifer International", "Interview Descriptions": "Overall I was disappointed with the process. I went through 2 preliminary interviews with HR and then two in-person interviews as a finalist. It took two weeks for them to make a decision and I was notified via automated email. Just kind of cold and impersonal given the effort and relationships that went into interviewing.", "Interview Questions": "What is your spirit animal?"}, {"date": "18 Jan 2022", "title": "Country Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heifer International (Mani) in Jun 2018", "Interview Descriptions": "There was  very short interview panel process, previous experience and leadership in an INGO setting was I believe a premium for the selection. Candidates are shortlisted and flown over to different project sites to see the behavior and visionary capability of candidate.", "Interview Questions": "What values are important to you?"}, {"date": "29 Mar 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Heifer International (Little Rock, AR) in May 2018", "Interview Descriptions": "Applied online and the first phone call was a month after that. The process took almost 3 months of interviews and assessments, with lots of calls and meeting, also presentations to the future team. I was very disappointed when they called and salid they will cancel the search for the moment.", "Interview Questions": "Why would you like to work in a NPO, knowing the burocatrics and small budget that usually defines them?"}, {"date": "24 Nov 2017", "title": "I've Interviewed Many Applicants Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heifer International (Rutland, MA)", "Interview Descriptions": "Job posted for 2 weeks; Top 10+ candidates phone interviewed mainly to evaluate if salary range matched applicant's needs; 3-5 in person interviews conducted by a committee of 3-4; Decision made within 1-3 days by committee and salary offer approved by HR; Reasoning for selection set to CEO for approval prior to offer; If approved, the offer made.", "Interview Questions": "1.\tWe all have a copy of your resume and application; please briefly summarize your professional background as it relates to this position.\r\n2.\tIn your own words, what is the mission of Heifer International?\r\n3.\tWhat do you consider to be your greatest professional strengths?\r\n4.\tthe areas in your professional development that you find most challenging? \r\n5.\tDo you prefer to be given specific instructions with close supervision, or do you prefer to work independently with more general instructions and why?\r\n6.\tTell us about a time you tried to improve a situation in the workplace without prompting from your supervisor?\r\n7.\tExplain what you would do if you felt really overworked and you were still being asked to do additional work on top of your daily, required tasks.\r\n8.\tThis job will frequently have multiple, ongoing projects and simultaneous deadlines.  Describe your organizational skills.\r\na.\tWhat tools or methods do you use to keep track of details?\r\nb.\tHow do you manage your time and establish priorities in your work?\r\nc.\tWhat tools do you use to help you stay organized?\r\n9.\tHow do you generally approach tasks you dislike?  How do you feel about repetitious tasks such as responding to inquiries, data entry and filing?\r\n10.\tWhat experience have you had in the following:\r\na.\tList of job specific skills i.e. carpentry, livestock care, computer, etc.\r\n11.\tDescribe your communication style and your philosophy of “customer service”.\r\n12.\tWhat techniques would you employ in dealing with a difficult customer?\r\n13.\tAt Heifer International we want to employ people who are skilled and technically qualified for their job, but a person’s attitude and team spirit are equally important.  Describe a situation in which you worked as a “team member”. \r\nFollow up: Do you consider yourself more of a team “member” or a team “leader” and why?\r\n14.\tAt Heifer are staff includes many volunteers, tell us about your experience and management approach for supervising volunteers.\r\nFollow up: How would you approach a volunteer to delegate a task of yours to him/her?\r\n15.\tPlease describe your experience in working with a diverse staff with different cultures and nationalities, as you will find at Heifer.\r\n16.\tBased on the job description and your current understanding this position, what would be your greatest strength and what aspect of the job would you need more training / support?\r\n17.\tWhy should we offer you the position?\r\n18.\tWhy do you want to work for Heifer International?\r\n19.\tDoes anyone on the interview committee have any follow-up questions?\r\n20.\tWhat questions do you have for the committee?\r\n21.\tIf selected, when would you be able to start?\r\n"}, {"date": "2 Mar 2017", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heifer International (Tulsa, OK) in Feb 2017", "Interview Descriptions": "A quick \"get to know you\" phone interview. It lasted about 15 minutes with just basic questions about my background and experience.  Three men on the phone but only one asked questions. After this phone call I have received no other communication.", "Interview Questions": "How do your values align with Heifers values?"}, {"date": "20 Feb 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heifer International", "Interview Descriptions": "Phone screen and then in-person interview. The phone screen was with a group of people that I had never met. Since the job required professional knowledge of one of the languages spoken in the area, I did not find it unusual that part of the interview took place in the language. I did not know at the time that only one person present on the phone screen spoke the language, so when I was asked personal, *illegal* questions, I assumed that everyone understood the questions and my answers. I wanted the job, so I answered the questions without protesting or asking how this line of questioning was relevant. This should have been a red flag to me that this organization would not be a good fit for me. Later, months into employment, I had the opportunity to share my interview experience with HR and I told them what I had been asked (in another language) and HR did nothing.", "Interview Questions": "I was asked if I was married and if I had children. (In another language.) When I answered that I had no children, I was asked a follow-up question about whether or not I planned on having children in the near future. (Again, this was asked in another language.)"}, {"date": "2 Sept 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Heifer International", "Interview Descriptions": "Panel interview.", "Interview Questions": "What can you bring to the organization?"}, {"date": "17 Jul 2013", "title": "Creative Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heifer International (Little Rock, AR)", "Interview Descriptions": "Interviewed with a panel of 3-4 from the department. Several \"rote\" questions, some insightful questions. It became clear that some of the questions are used in every interview, and some questions suggested something was broken-- \"How would you address/fix conflict on your team?", "Interview Questions": "What would you do if your job depended on information or assistance from another team or department, but that team or department was not willing to offer that information or assistance?"}, {"date": "6 May 2015", "title": "Kitchen Staff (Any Position Available) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heifer International in Apr 2013", "Interview Descriptions": "I submitted an online application, got an email to schedule the interview.  After we talked on the phone I was offered a position and then the rest of the communication took place over emails.", "Interview Questions": "I do not recall any of the questions asked because it was a couple of years back.  I do remember that they were very basic questions.  If you are able to get a call from the online application and don't fumble your way through the interview it will be okay."}, {"date": "19 Oct 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Heifer International (Little Rock, AR) in Oct 2011", "Interview Descriptions": "There were four interviewers on the panel in a face-to-face format.  I was brought in by an HR Associate who introduced me to the interview panel, which included a Vice President, a Director, and an internal temporary employee.  The interview process lasted a good 30 to 45 minutes.", "Interview Questions": "How were you able to resolve a conflict with a coworker?"}], [{"date": "9 May 2012", "title": "Copywriter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Heifer International (Little Rock, AR) in Sept 2011", "Interview Descriptions": "Interview was very pleasant, conversational, and relaxed. The panel consisted of their Marketing Director, Graphic Artist, and their former Copywriter, who was switching to a different position within the company. As I did not end up getting the job, take my advice with a grain of salt, but they seemed to be most interested in things that implied a well-rounded background.", "Interview Questions": "If you could work on any campaign, what would it be and why?"}, {"date": "14 Oct 2009", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Heifer International in Oct 2008", "Interview Descriptions": "After a typing and kpm test with the staffing agency, they determine if you are worthy of an interview for the seasonal position. then you must go in front of a panel of three current employees with the company. they ask you what your strengths are, weaknessses. why you would see yourself as a good employee and etc.", "Interview Questions": "What is going to benefit you f rom this seasonal job"}]]