[[{"date": "10 May 2023", "title": "Institutional Learning Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Search for Common Ground", "Interview Descriptions": "Interview process consisted in 3 interviews + 1 written test. Written test was 5 hours long and was sent to me one hour in advance than agreed. Also, the recruiter didn't say anything in advance about the duration of the written test. Once I completed the second interview (which was supposed to be the last), the recruiter told me that I Will have to do another one, he schedule the date one day After and gave no other options saying that the interviewer Will only be available at that date and then Will go on vacation. Once I said I Will not be available at that time, the recruiter disappeared and contacted me again after a while. They disclosed their salary only at the very end of the process, when they told me I was selected; I had to ask them two times in a row about it. Time duration of the process: preliminary interview -30 minutes; written technical test -5 hours; technical interview -1 hour; technical interview -1 hour. Total time: 7 hours 30 minutes, which Is really a lot! In general, the recruitment process was too long, very shady, lacked many informations and was very one-sided. These were too big red flags for me and I declined their offer. I would really suggest to avoid this organization: potential employees deserve respect and should not be available 24h on 24h at their own   will. Very very negative experience.", "Interview Questions": "Why do u want to work for us?"}, {"date": "11 Feb 2023", "title": "Officer, Program Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground in Nov 2022", "Interview Descriptions": "I got an email Tuesday night before Thanksgiving offering a 30-minute screener, with time options on either Thanksgiving or the day after. Recruiter sounded really positive but never followed up and ignored my email a week later. On Christmas Eve I received an email stating that the interview process was a bit delayed, but never heard anything after.", "Interview Questions": "Why are you interested in working at Search for Common Ground? What experience do you have with budget management and software for keeping track of budgets?"}, {"date": "6 Oct 2022", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Search for Common Ground", "Interview Descriptions": "The process here was... Not good, which was sad because this was, I thought, my dream job. I applied in April... finally heard back 1 month later to schedule an interview with a recruiter, which was fairly generic hiring questions. It took nearly another month to hear back after that, which was just to say they weren't ready to schedule second interviews because too many people were on vacation. FINALLY had the second interview scheduled in June, two months after the first interview, with a few members of the HR staff, and it was more HR specific questions this time. I thought the interview went really well. At the end, they let me know they were at the very beginning of the process of second interviews so it would be a while before I heard anything... and I was patient. So patient that two entire months went by without a word, until I finally reached out to the recruiter myself to request a status update and found out I just didn't get it and got a \"oh whoops thought we contacted you already!\" It's 2022 and email is free, if people can take leave from their current positions and give you 1-2 hours of their time for multiple interviews, it seems like you can at least show them the respect of sending a timely rejection letter.", "Interview Questions": "How do you think this position aligns with the values of Search for Common Ground?"}, {"date": "23 Sept 2022", "title": "MEAL Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Search for Common Ground (Ḩawwārah, Amman Governorate) in Mar 2022", "Interview Descriptions": "The interview was for 45 minutes, an HR employee, line manager and director. The interview had too many long questions. Each question had several sub questions. Many of these questions where too technical to explain in an interview. They could have tested the candidate technicality through a technical test than verbal. They did not open their cameras.", "Interview Questions": "Can you please explain what is an M&E Framework, why is it important? What is its component and how would you able to create it? "}, {"date": "21 Oct 2021", "title": "Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Search for Common Ground", "Interview Descriptions": "bad, it was missing HR, weak questions, nothing related to the actual responsibilities mentioned in the job description , it was waste of time, not relevant to the context..  the panel seemed distracted", "Interview Questions": "very silly, people are not educated enough "}, {"date": "15 Apr 2021", "title": "Project Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground (Mombasa) in Apr 2021", "Interview Descriptions": "It was a nice engagement, friendly interview panel they asked very relevant questions. They were not cliche. Thats good perspective for me as an aspiring worker in the organisation. I hope they pay their intens. No job offer though the process is on going", "Interview Questions": "How would you manage a certain situation"}, {"date": "22 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Search for Common Ground", "Interview Descriptions": "Good,  fairly straightforward. Fairly easy. Friendly and not difficult. But I feel like once you interview you pretty much have the job. Otherwise it was basic and normal for an unpaid internship", "Interview Questions": "They asked about my international development experience "}, {"date": "28 Jan 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Search for Common Ground", "Interview Descriptions": "One virtual interview via Google Meet that lasted 30 minutes with a member of the team I would be working with. Interviewer was nice and asked fairly basic questions. Also explained the position.", "Interview Questions": "What is a challenge you've faced? "}, {"date": "25 Jan 2021", "title": "Corporate Trainer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Search for Common Ground", "Interview Descriptions": "Professional, comprehensive. Over zoom due to the pandemic. Didnt hear back from them. ..... 2 people. Hr and program manager. Lasted around 45 min. Interesting . Received the invitation to an interview after 10 days of applyinh", "Interview Questions": "What is my experience in trainings?"}, {"date": "13 Jan 2021", "title": "Global Affairs and Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground", "Interview Descriptions": "You get an initial call from who would be your supervisor as a phone screen. Then I received further call to inform me that I had received the position. It was a relatively easy process!", "Interview Questions": "Why are you interested in working at Search for Common Ground? "}], [{"date": "4 Apr 2022", "title": "Program Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Search for Common Ground (Washington, DC) in Jan 2021", "Interview Descriptions": "There were two steps of the interview process: a written task and an interview (conducted via webinar). Both were relatively simple and the interview didn't ask any difficult questions. Overall had a good experience!", "Interview Questions": "How does this internship align with your career goals? What research skills can you bring to your internship?"}, {"date": "18 Dec 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Search for Common Ground", "Interview Descriptions": "Easy and Straightforward. The girl who interviewed me was casual about the process. It took a while for the decision to be made. I would apply for the global partnerships division", "Interview Questions": "Why do you want this position?"}, {"date": "27 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Search for Common Ground (Paris) in Nov 2020", "Interview Descriptions": "It wasn't too bad. Two team members interviewed me and they asked specific questions about my prior experience and project development. They were really nice. They'll describe the organization to you. Make sure to ask specific questions about their work.", "Interview Questions": "Describe the project development process"}, {"date": "26 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground (Washington, DC) in Jul 2020", "Interview Descriptions": "Basic interview questions related to basic administrative tasks. Some of the behavioral questions were vague (i.e. tell me about a time when you were stressed at work). No trick questions. I did however do a lot of research about the organization, which paid off when I asked my questions.", "Interview Questions": "Tell me a little bit about yourself?"}, {"date": "20 Mar 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground in Apr 2020", "Interview Descriptions": "An interviewer first reached out and requested I create a \"factsheet\" based on one of the initiatives listed on their website. After I completed this they told me they would be in touch to schedule an interview. I responded right away to let them know my availability, but didn't hear back until over a week later when they requested I schedule an interview for two hours later that same day. This not only left me with little time to prepare, but felt very inconsiderate of my time.", "Interview Questions": "Tell us about a time you resolved a conflict in the workplace. "}, {"date": "24 Aug 2020", "title": "Program Quality and Strategy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground (Washington, DC) in Dec 2019", "Interview Descriptions": "I interviewed with the person I would be working with most closely as well as the current intern in this position. They asked standard questions and asked for more info on points of my resume. I then interviewed with my supervisor, and he asked similar questions including questions on what my plans and goals are for the future.", "Interview Questions": "What hard skills do you have that you can bring to the position on day 1?"}, {"date": "12 Mar 2020", "title": "Enquêteur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Search for Common Ground (Kindia) in Nov 2019", "Interview Descriptions": "en voie des CV en ligne et entretien téléphonique suite à la sélection des CV correspondants plus ou moins à la vision de l'employeur qu'est search for common ground à travers la plateforme   préfectorale de redevabilité sociale", "Interview Questions": "parlez de vous"}, {"date": "6 May 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Search for Common Ground in Jan 2019", "Interview Descriptions": "The interview process for my internship was straightforward and simply entailed an interview process. I heard back about a week after the interview that I got the job. After I accepted the offer I was required to submit a background check.", "Interview Questions": "Why are you interested in working at Search for Common Ground? "}, {"date": "15 Apr 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground in Mar 2018", "Interview Descriptions": "Interview for a summer internship in the Beirut Office after applying online. Received an email to interview about two weeks after applying and then received an offer a week after interviewing.\r\n\r\nThe interview was quick and straightforward. They were mostly looking for someone with strong writing skills.", "Interview Questions": "What experience do you have related to the Middle East?\r\n\r\nLanguage/Writing Skills"}, {"date": "23 Jan 2018", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Search for Common Ground (Washington, DC) in Jan 2018", "Interview Descriptions": "The interview was an hour along in SFCG office in Washington DC. The interviewer was so professional and friendly. He had a prepared form for questions. After each question he gave me time to think and get ideas before answering which was very helpful.", "Interview Questions": "Introduce yourself to me"}], [{"date": "2 Feb 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Search for Common Ground (Washington, DC) in Jan 2018", "Interview Descriptions": "The interview took 45 min. The interviewer asked a lot of substantial questions on my background knowledge about the region, and on my writing skills. The questions also included my knowledge about the organization and the field of peace building.", "Interview Questions": "Please pick two countries in the MENA region. Then analyze the ongoing conflict and challenges that the countries are facing, and tell me what you think should to be done to resolve the problems."}, {"date": "19 Jun 2017", "title": "Development Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground in May 2017", "Interview Descriptions": "I applied for this position online with no contacts at the organization. I received an e-mail from HR one month later inviting me to interview. The first stage interview was a 60 minute phone interview with an HR staff member and a representative from the department I had applied to. The second stage interview was a Skype interview with two other members of the department I had applied to. I was told the third step of the interview process would be an in-person interview, but I was offered the position before interviewing in person.", "Interview Questions": "Why do you want to work in this field?"}, {"date": "10 May 2018", "title": "Strategic Development and Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Search for Common Ground (Washington, DC) in Apr 2017", "Interview Descriptions": "The regular interview questions. They were interested in my communications and marketing experience, and my work ethic. Additionally, they took longer than they expected to get back to me with a response. I had to reach out and follow up after the interview to remind them to get back to me, which they did, with an offer.", "Interview Questions": "Give an example of the last project you worked on and its outcome."}, {"date": "26 Apr 2017", "title": "Global Affairs and Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground (Washington, DC) in Jan 2017", "Interview Descriptions": "The interview process was quick and effective. The interviewer asked direct questions regarding my experience, who I was, and why I wanted to come work in DC. They were friendly and approachable, and made me want to join the team right away.", "Interview Questions": "What are your professional plans?"}, {"date": "27 Apr 2017", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Search for Common Ground (Frederick, MD) in May 2016", "Interview Descriptions": "I was hired through an internship program, The Washington Center. My interview was over the phone. I was asked about my experience with statistics, finance, and my ability to pick up on new technology/my interest in doing so.", "Interview Questions": "Are you able to learn new how to navigate new software easily? Can you provide examples?"}, {"date": "31 Dec 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Search for Common Ground (Washington, DC) in Apr 2015", "Interview Descriptions": "Phone interview took approximately 20 minutes. Questions were pretty redundant and repetitive. Interview should be easy if you prepare. She asked a question about hobbies, about past work experience and future professional plans. A lot of attention was given to reasons for wanting to be a part of the team. The interviewer was friendly but awkward which made her sound a bit intimidating.", "Interview Questions": "Tell me about your past achievements"}, {"date": "23 Jun 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Search for Common Ground (Washington, DC) in Nov 2014", "Interview Descriptions": "Very informative and straightforward interview process. I was interviewed by two associates in the department I'd be woking for. They were very friendly and accommodating. They shared their own experiences working at the organizations, described the office environment, the details of my tasks and expectations and then proceeded to ask me their questions. As long as you prepare, have a list of questions to show your interests in the organization and their mission, the interview should be fairly easy and enjoyable.", "Interview Questions": "Tell us about your experience in dealing with conflict, whether personal or professional."}, {"date": "18 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Search for Common Ground (Washington, DC) in May 2014", "Interview Descriptions": "Quick response to my online application, with a phone call with the program officer who would make internship hiring decision\r\n\r\nGood number of questions about my familiarity with the organization's work and what I thought were crucial issues on the ground where the organization does a bulk of its work", "Interview Questions": "What are three crucial areas that affect peacebuilding on the ground?"}, {"date": "6 Aug 2017", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Search for Common Ground (Washington, DC) in May 2013", "Interview Descriptions": "The manager called me in after a few email exchanges. She was nice and answered all of my questions, but she was definitely looking for a grad student with work experience to work for free rather than an undergrad with little work experience. \r\nShe thanked me for coming in said she would let me know in a few weeks...surprise surprise she never contacted me again.", "Interview Questions": "Do you speak any other languages? Because our offices are located in multiple countries, the ability to speak, write, read in more than one language would be helpful."}, {"date": "1 Jul 2013", "title": "Human Resources Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Search for Common Ground (Washington, DC) in Jun 2009", "Interview Descriptions": "I was screened by the human resources department several times.  I have an international backround and the intern that was phone interviewing me had such a severe accent that I couldn't understand her.  I was brought into the office in front of a panel of seven people!  None of which had any interview training from the questions they were asking me such as where I had traveled personally.", "Interview Questions": "About half the question were irrelevant to the job and personal in nature such as if I was married (illegal)"}]]