[[{"date": "8 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at RI International (New Bern, NC)", "Interview Descriptions": "Computer knowledge with X-cell, ability to be non judgmental, ability to work with a team have ability to multitask, schedule  appointments, direct calls to desired location, keep paperwork and records up to date.", "Interview Questions": "What computer knowledge did I have.\r\nAm I a team player?\r\nCould I multitask?\r\nHow fast do I get tasks completed?\r\nWith lived experience, could I handle being around certain types of people that could possibly be a trigger for me?"}, {"date": "4 Mar 2021", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RI International", "Interview Descriptions": "Easy as long as you know the job is and what recovery means. Dress effective and bring a resume, and care, do that and you will be fine. Thank for the meeting.", "Interview Questions": "What is recovery to you?"}, {"date": "21 Oct 2021", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at RI International (Banning, CA) in Jun 2020", "Interview Descriptions": "The interview was great. I guess it could be seen as stressful. It was a panel. Three interviewers and me, bit it was chill. Basically why did I want to work in this field, what kind of experience and education did I have, and what makes me stand out. Exactly what you'd expect from a peer support interview.", "Interview Questions": "Why do you think we should hire you? Desire what makes you relatable to the guests? How would you handle someone with big feelings?"}, {"date": "19 Nov 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RI International (Phoenix, AZ) in May 2020", "Interview Descriptions": "The interview process was good from start to finish. I was made to feel very comfortable being myself.  It was not nerve racking like I imagined it would be. It was a quick and smooth process.", "Interview Questions": "Why are you interested in this position?"}, {"date": "21 Mar 2018", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RI International (Fife, WA) in Mar 2018", "Interview Descriptions": "Easy and relaxed - had two interviews in office and one phone interview, process was a couple of weeks over all, very thorough background check process and the support outreach during the interview process from the home office in AZ was also very impressive", "Interview Questions": "How is your support system and self-care?"}, {"date": "7 Nov 2017", "title": "Peer Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at RI International (Riverside, CA)", "Interview Descriptions": "I was called in for an interview about two weeks after I applied. I spoke to the director of the facility for about 30 minutes. She said she would move my paperwork along — she wanted to hire me but the background check would have to be completed first.", "Interview Questions": "What makes you think you can do this job?"}, {"date": "23 Jan 2017", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RI International (Wilmington, NC) in Oct 2016", "Interview Descriptions": "Spoke with supervisor and regional manger for approximately 20 minutes. Asked about my experience, education, and how I would handle specific situations. Very quick and easy interview process - low stress.", "Interview Questions": "How would I handle a difficult coworker?"}, {"date": "23 Jan 2016", "title": "Recovery Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at RI International (Riverside, CA) in Jan 2016", "Interview Descriptions": "I applied online and within 1-2 weeks I was called into interview. The interview included two people interviewing me and I was asked about 15 questions. Roll playing was part of the interview.", "Interview Questions": "What skill would you bring to this position? "}, {"date": "25 Sept 2015", "title": "Peer Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at RI International (Wilmington, DE)", "Interview Descriptions": "very manipulative. Manager stated what I wanted to hear and none of it was accurate once I began the job. It appeared that the agency tells people what they want to get them in to the job. The training is bogus, many days are spent on worthless information and then additional training is required for the important paper work", "Interview Questions": "why did you apply with our company"}, {"date": "20 Aug 2015", "title": "Program Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at RI International (Palm Springs, CA) in Aug 2015", "Interview Descriptions": "caution; they advertise \"competitive salary\", but they offer below market salaries. we are talking significant discrepancies for direct line (below \"living wage\" to noncompetitive) to management (far below competitive wage). they will eagerly take you through the process only to surprise you. ask upfront. of course administrator are paid competitive to above on wages/benefits.", "Interview Questions": "are you willing to take a low wage to help others?"}], [{"date": "19 Jun 2015", "title": "Chief of Communications and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RI International (Phoenix, AZ)", "Interview Descriptions": "Very thorough application and interview process.  Interacted first with a recruiting specialist, who provided a very positive impression of the organization as a whole.  I then spoke with the director of HR.  Finally, I had a panel interview with the group who ultimately became my colleagues.  I was very impressed with their knowledge as well as their positivity.", "Interview Questions": "Why do you want to work for Recovery Innovations?"}, {"date": "12 Oct 2016", "title": "BHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at RI International (Peoria, AZ) in Aug 2014", "Interview Descriptions": "They were great didn't have to wear a \"mask\" be yourself thats what they want, don't lie, ask if your unsure, be direct. I felt like I was needed not like I needed them. I was trained by the best and never judged.", "Interview Questions": "What I was professional at"}, {"date": "26 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at RI International (Fife, WA) in Aug 2013", "Interview Descriptions": "Usually two persons interview you.  At my interview, only one person was available.  She asked a few questions, asked me if I had any questions, and then hired me.\r\n\r\nSince then, I have helped with hiring interviews for other new nurses.  The company seems to have no standard format for conducting interviews, so we ask the candidate whatever questions we happen to think of.", "Interview Questions": "How soon can you start?"}, {"date": "4 Apr 2017", "title": "Recovery Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at RI International (Phoenix, AZ) in Aug 2013", "Interview Descriptions": "It was a one-on-one interview and then group interview.  It focused on a micro-teach that was twenty minutes long and then followed up with a panel interview.  I also had a one-on-one to get to know me and my recovery lived experience.", "Interview Questions": "What steps do you take when confronted with an upset client (create a scenario)?"}, {"date": "16 Dec 2013", "title": "Navigator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at RI International (Tacoma, WA) in Jul 2013", "Interview Descriptions": "First interviewed one to one by immediate supervisor.  Follow up interview with staff.", "Interview Questions": "What is your personal experience with mental illness."}]]