[[{"date": "18 Feb 2023", "title": "Emergency Department Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare", "Interview Descriptions": "The interview process was easy, quick, and straightforward. Any delay in the process was due to HR and lack of communication between said candidate and HR. The interview itself with the manager/supervisor was easy and not too complicated.", "Interview Questions": "Why do you want to work for Adventist Healthcare?"}, {"date": "20 Jul 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Adventist HealthCare", "Interview Descriptions": "They interview online and will promise all the wrong things. \r\nIf it sounds too good…run because they will talk it up like it will be an opportunity of a lifetime.", "Interview Questions": "Can you multitask ?\r\nAre you okay with fast paced\r\n"}, {"date": "26 Mar 2022", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "Thorough, supportive.  Encouraging to grow in healthcare fields if hired.  Explained different schedules available which are helpful to students. The interview is phone screening and then the recruiter invites you to interview with the department manager and some supervisors in a group interview.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "18 Feb 2022", "title": "Finance Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "Online application, telephone interview and then in-person interview.\r\n\r\nTelephone interview was very detailed focusing on past work history and reason for applying at Adventist Healthcare.  \r\n\r\nElaborating on current and future career goals. Assessing interest in the healthcare industry.", "Interview Questions": "Tell me about yourself and work history"}, {"date": "19 Feb 2022", "title": "Registered Nirse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "excellent. thorough and comprehensive. extremely professional and respectful. prepared and savvy, and trustworthy. i felt i was in capable hands. very impressed with overall experience. seems like an excellent place to work.", "Interview Questions": "my goals, and my expectations, strengths and wealnessses"}, {"date": "10 Feb 2022", "title": "Patient Access Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Adventist HealthCare in Feb 2022", "Interview Descriptions": "two interview one call one video. Quick and easy. Interviewers were nice and friendly. About a week apart. They asked questions about core values and scenario questions. The first one is with recruiter and second one is with 2 other manager. They asked about 10 questions respectively.", "Interview Questions": "What are 3 important core values "}, {"date": "21 Mar 2022", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare (Gaithersburg, MD) in Dec 2021", "Interview Descriptions": "First phone interview with the recruiter, then video interview with managers and at last video interview with senior staff, the end result from 3 times interview receiving the answer \"Everybody liked you but unfortunately  the position got canceled\"", "Interview Questions": "What was the most challenging decision you had to make at your previous jobs?\r\n"}, {"date": "2 Jul 2021", "title": "Imaging Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "Two separate interviews with the managers and the lead associate on the day shift. Typical questions (tell me about yourself, etc). I wore business casual clothes and asked a lot of questions about the dress code, job tasks, and shift.", "Interview Questions": "Tell us about yourself and why you think you'd fit in here."}, {"date": "6 May 2021", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "A phone interview was the first part and an online interview is the second part. The phone interview was not too bad. The questions are simple and straightforward. The second part of the interview is the most important. They also ask for references.", "Interview Questions": "What population are you comfortable working with??"}, {"date": "5 May 2021", "title": "Patient Financial Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "No structure  interview with very random questions.\nIt felt  unprofessional, the interviewers from the department were not concise and extremely casual, to the point that I didn't want the job, very  wishiwashi.", "Interview Questions": "Have you done this before?"}], [{"date": "9 Aug 2021", "title": "Payroll Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adventist HealthCare (Rockville, MD) in Apr 2021", "Interview Descriptions": "very smooth, ask a lot of questions, multiple people, on time, last about 30 minutes. However, no follow up on the interview. I emailed them for the follow up, no response from anyone.", "Interview Questions": "Related to payroll, how did you deal with mistake "}, {"date": "27 Apr 2022", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adventist HealthCare (Savannah, GA) in May 2020", "Interview Descriptions": "Interview screening with HR to see if you are a good fit. \n\nThen two interviews with hiring manager and another person. The interview was fine, and they asked basic accounting interview questions.", "Interview Questions": "Q: Explain a time where you needed help"}, {"date": "8 Feb 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Adventist HealthCare", "Interview Descriptions": "Answered video prompts online then was scheduled a phone interview with the director and clinical specialist (I applied out of state). The process was organized, the perfect length, and through. HR got back to me quickly and promptly.", "Interview Questions": "Many questions came from my resume, which I really liked as it told me they saw me as an individual and took the time to look at my experiences leading up to the interview."}, {"date": "6 Sept 2019", "title": "Clinical Informatics Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Adventist HealthCare", "Interview Descriptions": "I was emailed by the recruiter to do a phone interview. I replied back using the email address the recruiter listed on the email, and it didn’t work. I emailed again using the email address where the email directly came from, and still no response. By then, the job had been posted for more than 30 days. Unprofessional and rude of the recruiter to waste candidates time.  Looks like this type of behavior is indicative of what to expect working for Adventist Health (Gaithersburg, MD)", "Interview Questions": "N/A"}, {"date": "7 Aug 2019", "title": "Treasury Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Adventist HealthCare", "Interview Descriptions": "First call with recruiter, than several in person interviews with manager.  Felt like the process was slow but ended up taking the offer with some negotiation. Make sure you negotiate.", "Interview Questions": "Tell us about your experience in treasury."}, {"date": "1 Sept 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adventist HealthCare (Simi Valley, CA) in Aug 2019", "Interview Descriptions": "It was a recruitment day and many people were there you are first interviewed by the nurse recruiter and then if she approved then you went for a second interview the same day with the unit manager", "Interview Questions": "What have you done on your job above and beyond your line of duty"}, {"date": "8 Aug 2019", "title": "Account Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adventist HealthCare (Orlando, FL) in Jul 2019", "Interview Descriptions": "Pretty straight forward and basic HR interview questions.  This was a phone interview with the HR manager and the hiring manager. The HR manager had to excuse herself half way through the Interview.", "Interview Questions": "How do you handle conflict?"}, {"date": "19 Sept 2018", "title": "Lead Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare", "Interview Descriptions": "Applied online, received a call two days after applying' to set up an interview. I wasn't expecting it to be a panel interview 4 females and 1 one Male. They were really awesome, asked great questions and even had great stories of their own to tell.  Really down to earth and friendly.   1 hour after the interview I received the job offer.", "Interview Questions": "What is your biggest accomplishment?  If you are not offered a position, what would your next move be moving forward?"}, {"date": "6 Jan 2020", "title": "Physician Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare in May 2018", "Interview Descriptions": "It’s a sit down interview with hiring manager, typically a VP and sometimes another Liaison .  The interview felt a little informal .  Everyone was very friendly .", "Interview Questions": "Did you ever have a co worker you couldn’t get along with and if so what did you do?"}, {"date": "26 Mar 2018", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Adventist HealthCare in Mar 2018", "Interview Descriptions": "I had a phone interview with the hiring manager, it went great. If you know what you want it will be easy for you. They told me the second interview will be in person interview. I didn't have the second interview, and also I will have to be tested on nicotine and alcohol.", "Interview Questions": "- What major challenges and problems did you face? How did you handle them?\r\n- Tell me about a challenge or conflict you've faced at work, and how you dealt with it.\r\n-  How do you deal with pressure or stressful situations?\r\n- Why are you leaving your current job? \r\n- When can you start? \r\n- How did you find this job? \r\n-What's your hourly rate expectation? \r\n- After describing the job environment I was asked if it was okay with me to work there. "}], [{"date": "18 Jul 2019", "title": "Respiratory Care Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adventist HealthCare (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "Met with HR and RT director. Explained my background and why I wanted to get the job. Went over several scenarios and what to do accordingly. Met with HR and RT director. Explained my background and why I wanted to get the job. Went over several scenarios and what to do accordingly.", "Interview Questions": "What was a situation you had to overcome?"}, {"date": "30 Aug 2021", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Adventist HealthCare (Shady Grove, MD) in Jan 2018", "Interview Descriptions": "The interview process was pretty simple. In my experience, the manager asked you questions related to my availability and how much experience you have when it comes to  Food service", "Interview Questions": "N/A"}, {"date": "18 Mar 2021", "title": "Histology Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare (Silver Spring, MD) in Aug 2017", "Interview Descriptions": "It was smooth got back to me quickly, they were nice and answered all the questions I had with ease. I would recommend working for this company after the interview process was so smooth", "Interview Questions": "How do you see yourself growing here?"}, {"date": "11 Feb 2018", "title": "Preservice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Adventist HealthCare (Portland, OR) in Jun 2017", "Interview Descriptions": "Significant time investment (7+ hours) and long delays between each set of interviews (almost 3 months).  Interestingly in direct team interview they asked few questions, talked about themselves and seemed ill prepared.", "Interview Questions": "What is your salary expectation "}, {"date": "13 Aug 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare (Takoma Park, MD) in Jun 2017", "Interview Descriptions": "They asked about myself first and why i am interested in this job and when i told them i might go to health care in the future they wanted to know more about my interest in health care so basically my answers to their question created more questions for them.", "Interview Questions": "What made you apply for this position?"}, {"date": "8 May 2017", "title": "Child Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Adventist HealthCare", "Interview Descriptions": "I met with the contract manager.  It was an interview which turned more into a friendly conversation.  Then, I had to meet with th 2 site leaders, at the site which had the job opening.", "Interview Questions": "Honestly, I don't remember.  They handed me a list of written questions, which I had to return when the interview ended."}, {"date": "13 Apr 2017", "title": "Sonographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Adventist HealthCare in Apr 2017", "Interview Descriptions": "I sent my resume to HR and was contacted the same day to set up an interview. Interviewed with HR and department supervisor on the same day. Was called the next day after the interview with an offer", "Interview Questions": "Name a time you were in a difficult position and how did you resolve it"}, {"date": "20 Jul 2017", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Adventist HealthCare (Rockville, MD) in Mar 2017", "Interview Descriptions": "I was able to get an interview fairly quickly, since I was an intern 2 years ago. I was able to meet with the manager. I liked the manager since I have heard wonderful things about her. The interview was more conversational by the end of the interview.", "Interview Questions": "what are my strengths? challenges?  why did you leave your previous position? If a situation were to occur, what would you do? Are you willing to work weekends? Are you willing to work as a team?"}, {"date": "23 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Adventist HealthCare (Gaithersburg, MD) in Nov 2016", "Interview Descriptions": "I emailed the head supervisor and stated my interest in an internship for the Spring of 2017. She emailed me back and scheduled an in-person interview.\r\n\r\nInterview was about an hour and I received an offer a few days later. The interviewer was very sweet and we mostly talked about the position and what it entails. She asked me the basic questions but it was more of a conversation than a strict interview.", "Interview Questions": "Q: What are your strengths?\r\nQ: Why do you want this job?\r\nQ: What are your past experiences?"}, {"date": "20 Jul 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Adventist HealthCare (Takoma Park, MD)", "Interview Descriptions": "Applied  on line was called in for interview with recruiter. Met with Director of the department . We went over my resume . Two days latter I met with the CFO and the Departmental Director. Standard interview questions asked.", "Interview Questions": "Standard questions asked at an interview"}], [{"date": "21 Apr 2016", "title": "Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Adventist HealthCare", "Interview Descriptions": "Got an phone interview with a recruiter first and then scheduled in person interviews and then here came some drama that I didn't expect. One day before my in person interview, they called me to cancel it and the reason they offered was they have offered another candidate the position. I am wondering how can you decline me without giving me an equal shot the job. Sooooooo ridiculous.", "Interview Questions": "Phone interview question were quite standard. Like why us? What is your strength and weakness?"}, {"date": "4 Aug 2016", "title": "RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adventist HealthCare in Apr 2016", "Interview Descriptions": "did two different skype interviews with nurse managers from different floors. The questions were the typical nursing interview questions. One of the questions was super confusing and i couldn't understand what she was asking, so i had to come up with a random answer for a question i didnt understand. Otherwise the people were really friendly and awesome, and i heard back from them the next day.", "Interview Questions": "Describe an ethical dilemma you have been put in on the job."}, {"date": "15 Aug 2016", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adventist HealthCare (Salisbury, MD) in Jan 2016", "Interview Descriptions": "Interviewed with HR and one manager onsite.  The application process was very easy, staff were helpful and engaging, seemed like a good place to work.  Salary was competitive. They were forthcoming about the schedule, needed for a self started, and that the position was new in a collaboration with another health care partner.  Was offered the job.", "Interview Questions": "Strengths, weaknesses"}, {"date": "16 Oct 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Adventist HealthCare (Rockville, MD) in Sept 2015", "Interview Descriptions": "Everything went smoothly. They asked for 5 references and until they receive those, you cannot move forward. They were extremely nice and have everything ready for you to start. Thumbs up", "Interview Questions": "They asked questions like \"Was there ever a time when you failed at something and how did you resolve it?\""}, {"date": "31 May 2016", "title": "Pathology Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Adventist HealthCare (Silver Spring, MD) in Jun 2015", "Interview Descriptions": "It was in an office near Silver Spring , about 30 minutes long, there was a woman who walked in and introduced herself she was sweet and kind, then we started the interview right away. She described what the position involved, and how they value patient care.", "Interview Questions": "Why should we hire you?"}, {"date": "28 Jun 2015", "title": "Psychiatric Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Adventist HealthCare (Rockville, MD) in Apr 2015", "Interview Descriptions": "Applied online and was emailed by an LCSW a few days later asking me to come in for an interview. They were very flexible, I was a student at the time and needed to change my interview time. Very relaxed interview, fairly typical for this type of work. Most questions were scenarios that you had to answer how you would handle. Not a bad experience, but decided that the job wasn't for me.", "Interview Questions": "How would you handle a child that became physically aggressive in a mental health facility setting?"}, {"date": "9 May 2015", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Adventist HealthCare (Rockville, MD) in Feb 2015", "Interview Descriptions": "Applied online, received a phone call from HR within 48 hours and communicated several times with the HR department. Prior to even having an in-person interview, I was asked to provide references and about 2 months later I was contacted for an in-person interview.", "Interview Questions": "They use behavioral type interview questions with a panel of several individuals each asking different questions. I can't recall any of the specific questions many were standard type questions - describe a time where you were involved in team project, describe a time where you used your initiative to start a project."}, {"date": "31 Aug 2015", "title": "Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adventist HealthCare (Takoma Park, MD) in Jun 2014", "Interview Descriptions": "The hiring process is relatively easy. It is an interview with HR and with the Director and Supervisor of the unit. The director was extremely nice and the questions were about my qualifications and my interests.", "Interview Questions": "How well do you operate under pressure/stress?"}, {"date": "16 Jul 2016", "title": "Pct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adventist HealthCare (Silver Spring, MD) in Mar 2014", "Interview Descriptions": "Punctual, professional, friendly, straight to the point, not very clear about working hours, holiday pay, bonuses,insurance. Manager very friendly and calm. Always looking at resume snd focusing on experience at other jobs. Experience with patience care, and handling 100% priority.", "Interview Questions": "What happens if a patient yells at you? Would you take.it.personally?"}, {"date": "7 Feb 2013", "title": "Assistant Director Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Adventist HealthCare", "Interview Descriptions": "Go through the Human Resources dept. and fill out a job application. Go through there interviewing process. Then if you clear their process and you are satisfied with their process, then you would have a potentual interview with the department you are applying for. If the dept you are applying for wants to pursue you further, then refferals may be requested.", "Interview Questions": "What would you do if you had a disagreement with a fellow employee?"}], [{"date": "5 Sept 2015", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adventist HealthCare (Rockville, MD) in Dec 2011", "Interview Descriptions": "Interview was interesting, creative, not typical boring interview questions--the questions were like what kind of car would I have if money were no object and other unusual questions not where do you see yourself in five years kind of questions which was refreshing but could not figure out how I was doing because the questions were so not typical", "Interview Questions": "What kind of car would I have if I could pick any car"}, {"date": "7 Jan 2011", "title": "HRIS Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Adventist HealthCare (Rockville, MD) in Dec 2010", "Interview Descriptions": "I sent my resume to a recruiter.  She thought I was an excellent fit for a position at Adventist that had been open for several months.  I do not live in the Rockville area, but I was willing to relocate for the right opportunity.  I had an initial phone interview with the Recruiting Director.  She was very knowledgeable about the position and recommended me for an in-person.  She did ask how it would take for me to relocated and how much time did I need for an in-person interview.  She said the company would pay for the flight and that if I didn't have t sell my house, then they would be able to relocated me.  She said the salary was $80-95k.  I thought that was a little low for the DC area.\r\n\r\nI then had a panel phone interview with the HR manager, HRIS manager and PeopleSoft developer.  They seemed to be impressed with my experience but seemed eerie of having to relocate me.  The interview was only an hour and I found myself rushing through some answers because we wasted almost 30 min talking about previous experience.\r\n\r\nI was told by the recruiter that I was not selected to move forward in the process because I didn't have enough experience writing reports in PeopleSoft.  Sounded like a fluke to me since I have over 8 years experience.  She also stated that the relocation had become a much bigger issue that originally stated.", "Interview Questions": "Name a time when you had to juggle several assignments?  What were the results?"}]]