[[{"date": "10 May 2023", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Blessing Health System (Quincy, IL)", "Interview Descriptions": "The interview was in two parts. The first was done in person with the supervisor. The second was done also in person with peers. The questions were structured. Afterwards HR verified your employment information.", "Interview Questions": "Tell me about a time you had a difficult time with a coworker and how you handled it."}, {"date": "11 Sept 2021", "title": "Lab Tech Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Blessing Health System", "Interview Descriptions": "I Initially did an interview with the main lab manager and a higher up employee. They asked me some questions about how I would handle upset patients etc. Then I did a peer interview with someone I would work closely with in the lab to see how I would mesh with them.", "Interview Questions": "The biggest thing was \"Why should we hire you and not someone else?\""}, {"date": "29 Oct 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Blessing Health System in Mar 2021", "Interview Descriptions": "Phone interview- super simple. I got to discuss the job and the duties regarding the job. The questions were all situational testing regarding past work experiences. No in person Interview.", "Interview Questions": "Tell me about a time you had a difficult patient or customer and how did you handle the situation?"}, {"date": "7 May 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Blessing Health System (Quincy, IL) in Jan 2021", "Interview Descriptions": "Very professional interview process. They took the time to get to know me while letting me get to know them in the process. They made me feel comfortable and asked great questions. They also brought in people to interview from different areas of the system.", "Interview Questions": "What is your management style?"}, {"date": "25 Sept 2020", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Blessing Health System", "Interview Descriptions": "Walk us through your resume. Talk about projects you worked on. Tell us about visualization tools you are familiar with. Why you are interested in this job. Do you have any teaching experience", "Interview Questions": "N/A"}, {"date": "20 Dec 2019", "title": "Medical Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Blessing Health System (Golden, IL) in Nov 2019", "Interview Descriptions": "They strung me along for over a month having me interview for 3 different positions, telling me how great I was, how much they liked me, and acting like they were going to hire me, to not hire me at all. The HR department is absolutely no help when you call to inquire about your application/job status. They don’t pass the word along to the ones hiring, so there’s no point in even calling to inquire  because you’re just told “they’re still looking at applications.” One of my peer interviews was joke. The people conducting the interview acted like they didn’t want to be there, and weren’t interested in my answers at all, like they already had an idea of who they wanted to hire before even conducting interviews. I found out later it went to an internal candidate, so I feel as if they just wasted my time and got my hopes up for no reason.", "Interview Questions": "Tell me about a time when you didn’t finish a project in a timely manner and what was the outcome"}, {"date": "11 Nov 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Blessing Health System (Quincy, IL) in Jun 2018", "Interview Descriptions": "Professional interview with director and associate nurse manager that outlined the job and wanted details about yourself and capabilities.  A lot of behavioral  based questions. Very professional. Friendly yet intimidating", "Interview Questions": "Tell me a time that you had to have a crucial conversation with a coworker"}, {"date": "6 Aug 2019", "title": "Manager - Projects Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Blessing Health System (Chicago, IL) in Apr 2017", "Interview Descriptions": "It was very formal and mostly about the person interviewing me.  She could not describe to me what the title formally did.  Very confusing.  Mostly walked around the facility and was shown all the projects that were completed by the person interviewing me.", "Interview Questions": "What do you like about working in the medical industry?"}, {"date": "15 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Blessing Health System (Quincy, IL)", "Interview Descriptions": "Applied online. HR called and conducted a brief phone screen 2-3 days later (when can you work, are you licensed, etc.) HR set up a meeting with a manager, who conducted a second phone interview with problem-based questions. Final stage of interview process was a peer interview with two employees; also problem-based/behavioral questions.", "Interview Questions": "Describe a situation that required you to be flexible. How did you handle it, and what was the outcome?"}, {"date": "3 Nov 2017", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Blessing Health System (Quincy, IL) in Dec 2013", "Interview Descriptions": "There was a peer interview and then an interview with my supervisor. The peer interview was conducted by 6 staff members. A few days after that interview, I had and interview with the department supervisor. I was offered the position about 2 days later.", "Interview Questions": "What are my strengths?"}], [{"date": "20 Jun 2013", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Blessing Health System", "Interview Descriptions": "I conducted a phone interview with HR-typical HR questions.  Then I interviewed via Skype with the lead dietitian and peer interviewed with 2 other dietitians.  Aftewards, I was offered a job via the lead dietitian and spoke with her and a representative from HR on multiple occasions.", "Interview Questions": "This is a behaivor based interview, so the questions change every time."}, {"date": "14 Sept 2015", "title": "Housekeeping 2yrs\\unit Secretary III Yrs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Blessing Health System in Aug 2011", "Interview Descriptions": "Interview with management then peer interview then was hired back ground check finger printing and drug testing. Then a week of training.During training we were showed through hospital , showed how to use all equipment. As a unit secretary I had transferred departments. So the process was a bit different and a lot quicker being everything was done.", "Interview Questions": "How well you work with your peers"}, {"date": "22 Oct 2015", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Blessing Health System (Quincy, IL) in Aug 2011", "Interview Descriptions": "it was great interview and I was very comfortable interview and told me what I would be doing and where I would be working  in the  hospital then told me the policy.and want in do with job a where and schedule all the stuff I need to know", "Interview Questions": "what shift could I work"}]]