[[{"date": "25 Jan 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Plan International (Woking, England)", "Interview Descriptions": "Step 1: 1st screening interview call Step 2: A panel interview with 3 people Step 3: Case study to prep for 1 hour before the final interview Step 4: Final interview with the Director and HR representative", "Interview Questions": "Q. Tell us about a time when you have worked with diverse and dispersed colleagues collaboratively. Q. Tell us about what you understand this role to be. Q. What do you think will be the key deliverables/ challenges in this role?"}, {"date": "21 Nov 2022", "title": "Head of HR Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Plan International", "Interview Descriptions": "They took too long to provide feedback from one stage of the interview to the next . I could also tell from the interview it was a role they were not certain about its operational mechanism", "Interview Questions": "Number of staff i managed in my previous role"}, {"date": "20 Dec 2022", "title": "Talent Acquisition Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Plan International (London, England) in Nov 2022", "Interview Descriptions": "Overall a negative candidate experience. Was contacted to arrange an interview over a month after applying for the job. I did the interview at very short notice (several hours notice only). The interview lasted 1hr 15 mins and was 100% aimed at ascertaining if I shared the values of Plan International, by asking me a number of questions based around those values. I wasn't asked any questions about my experience or what I had been doing, no questions about my CV etc. I was told that they always do first interviews like this based only on the values. At the end of the interview I was told that they would be moving quickly and that they would get back to me with the outcome of the first interview in a 'couple of days'. A week later I'd not heard anything so I emailed chasing for an update, but I did not get any reply. Two weeks later and still no reply or update since the interview unfortunately. I can appreciate the importance of values and so understand why they wanted to see if I fit. But values do work both ways, and they didn't demonstrate one of their own values - doing what they say they will (ie letting me know the outcome in a couple of days). In the current climate especially, candidate experience is very important. Candidates applying for jobs do need to be shown some empathy I think, and not ghosted.", "Interview Questions": "Can you give us an example of a time when you have helped further the causes of women and young girls"}, {"date": "19 Jul 2022", "title": "DRM Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Plan International (Stoke-on-Trent, England) in Jun 2022", "Interview Descriptions": "The process started with a phone screening, which was conducted by the HR staff members.  \r\nThen a panel of technical people interviewed me,  The focus was on understanding more about skills and competencies. That part of the easiest for me as I knew my work very.  \r\n then it went to the final round with the hiring manager and one of the stakeholders who I need to work with and collaborate.  That was the difficult part of the interview process as this part was to assess my soft skills", "Interview Questions": "why they should hire me? \r\n\r\nHow do I make decisions"}, {"date": "13 Oct 2021", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Plan International", "Interview Descriptions": "Excellent to have regional staff interview separately from other decision makers and power holders.  Only two rounds which is helpful on the basis of time you put into interviews. Overall a good experience", "Interview Questions": "Can you tell us about your experience in measuring policy related interventions"}, {"date": "15 Sept 2021", "title": "Partnerships Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Plan International (London, England) in Aug 2021", "Interview Descriptions": "Easy going and comfortable. The interview was via video call, and I had to give a presentation. \n\nWhat I really liked about the interview was that I was sent questions in advance.", "Interview Questions": "What is your management style like?"}, {"date": "14 May 2021", "title": "Corporate Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Plan International", "Interview Descriptions": "Two stage interview with presentation on managing a partnership. Very much experienced based rather than competency. Looking for demonstration of passion for the cause. One hour long interview with time for questions at the end.", "Interview Questions": "Relevant experience\r\nInspiring partnerships\r\nDealing with challenging donors"}, {"date": "30 Jun 2020", "title": "Innovation Team Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Plan International (London, England) in Jun 2020", "Interview Descriptions": "Long process with different parts. Had a screening call, then a timed task and a practical interview. Had to write down questions they were asking you, keep time and feedback!", "Interview Questions": "Your background, where you see yourself, how did you find the tasks, how can foster a relationship with stakeholders and safeguarding in the role"}, {"date": "9 Nov 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Plan International (London, England) in Jan 2019", "Interview Descriptions": "Extensive with lots of different stages - presentation, second interview, etc. Formal but very lovely people interviewing me who put me at ease straight away. I was asked competency based questions in both 1st and 2nd interviews.", "Interview Questions": "I was asked to give a presentation on comms plan"}, {"date": "19 May 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Plan International", "Interview Descriptions": "Quite thorough and intelligent questions. People were friendly. Had two face to face interviews and one written test. The hiring process was long. \r\nA lot technical questions and they asked for practical examples. Wanted to know more about problem solving and managing difficult projects.", "Interview Questions": "Asked strong examples from programme management"}], [{"date": "16 Nov 2016", "title": "Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Plan International", "Interview Descriptions": "Lengthy process which in itself was straightforward. However for the level of role being interviewed for and time invested at actual interview (3 hours) I would have at least expected feedback from their HR department. Very poor level of service for candidates.", "Interview Questions": "Reasons for wanting to join plan\r\nGeneral competency based"}, {"date": "12 Aug 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Plan International (London, England)", "Interview Descriptions": "Went through a recruitment agency, standard interview process. Very friendly yet professional interviewers which left positive impression of the whole experience. Interesting feedback after the interview which left me puzzled but perhaps due to the recruitment agency?", "Interview Questions": "Influencing stakeholders"}]]