[[{"date": "24 Mar 2023", "title": "HIM Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Illinois Hospital & Health Sciences System", "Interview Descriptions": "The interview was fairly standard. Asked typical interview questions, however, never received any follow-up after the interview. The job updates on the website are not helpful. Don't interview here if you have a gap in employment!", "Interview Questions": "Most questions revolved around how a conflict was resolved."}, {"date": "4 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Nov 2022", "Interview Descriptions": "I got the interview invitation just one day I applied this job. And scheduled an interview with hiring manager ( not sure why skip the HR phone interview). I just went to the unit and had an in-person interview. After two weeks, HR called and I got the verbal offer.", "Interview Questions": "Interview question being asked: 1. What is your biggest change in your nurse career 2. Why you come to the States? 3. Tell me a time you advocate for your patient 4. Tell me a time you have a conflict with your co-worker 5. Tell me a time you that patient is unpleased with your care 6. Tell me a time you do that go beyond the job 7. What is goal in the future about your nursing career? 8. What’s your previous working experience? What’s your patient’s common diagnosis? 9. What’s the difference working the States and Taiwan?"}, {"date": "29 Mar 2022", "title": "Business Intelligence Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Illinois Hospital & Health Sciences System", "Interview Descriptions": "The interview process was long. There were multiple remote interviews, as well as an in-person interview, and then there is an IQ test of sorts with another potential in-person interview. Overall, expect to have to take some time off when interviewing for this position.", "Interview Questions": "Q: How would you rate your SQL?"}, {"date": "17 Jun 2022", "title": "Administrative Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Mar 2022", "Interview Descriptions": "The first interview was with the manager via Zoom. It lasted about an hour.  He went through the questions listed on a paper. It mainly was situational questions, in which they expected you to describe a situation, action, and result. A couple of days later, I had a group interview in-person with two nurses from the unit. It was a situational interview as well. You will do well if you can think of 5-10 stories from your prior experiences (specifically, work) that you can apply to your desired position. Goodluck!", "Interview Questions": "Tell me about a moment when you were working with a coworker who wasn't doing their fair part of the job. How did you deal with it?\nGive me examples of times at work when someone remembers you after a quick introduction. What makes you believe they remembered you?"}, {"date": "30 Mar 2021", "title": "Application Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Illinois Hospital & Health Sciences System", "Interview Descriptions": "Phone interview with manager, then a week later, interview with the team and had to take an exam. The exam wasn’t easy. Everything wasn’t as organize as it should be.", "Interview Questions": "Why UI health? \r\nWhat is your role and responsibilities at your current role? "}, {"date": "17 Jun 2022", "title": "IT Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Sept 2020", "Interview Descriptions": "The interview process was smooth. However, the hiring process is lengthy. From the day I submitted my resume to receiving the job offer took them 3 months (including the background check).", "Interview Questions": "Do you have any experience in Excel and Access? "}, {"date": "6 Sept 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL)", "Interview Descriptions": "I’m very disappointed with my experience with this company. The manager called me to schedule an in person interview and didn’t even mention what hospital he was from, I had to Google his name to find out. I drove an hour to interview at this hospital and it turns out the manager called in sick that day and failed to let me know or reschedule the interview. A manager from a different floor said that she would interview me after she was done with a meeting in about 30 minutes. I waited in the lobby for over an hour and just ended up leaving without interviewing. I do not want to work for a company that doesn’t value my time. The manager was very apologetic and nice; everyone seemed nice there but it was very unprofessional and a bad experience.", "Interview Questions": "No opportunity to answer questions."}, {"date": "13 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Illinois Hospital & Health Sciences System", "Interview Descriptions": "I applied online and they did not get back to me a month later. I received a call directly from someone on the unit, interviewed with the nurse manager and another nurse (charge nurse/someone who has been there a while), They had a sheet of questions they were to ask me and we went one by one and they wrote down my answers. The interview took about 35-40 minutes, I did not get a tour of the unit, the nurse walked me out to the elevators. most of the questions were your basic interview questions you can find online, others I was not prepared for but not difficult to create an answer quickly.", "Interview Questions": "future plans?"}, {"date": "31 Mar 2018", "title": "Billing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL)", "Interview Descriptions": "This position was dedicated to UIC students. I had one phone interview and later was offered the position. I spoke to two employees from the department I later worked in during the phone interview.", "Interview Questions": "They basically just asked me why I was interested in the position and about some of the experience I had listed on my resume. The second half of the interview was them filling me in about the position."}, {"date": "11 Oct 2018", "title": "Physical Therapy Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Jan 2017", "Interview Descriptions": "Brief and straight to the point. The interviewer was very kind and thoughtful. Did not feel tension or any kind of awkwardness. They were honest about the position and straight forward. They do want to hear your plans and goals. Be honest and straight up with them and they will do the same. The interview took about a total of 30 or 40 minutes. They speak to you 1 on 1 and ask you a lot of open ended questions and just want to hear your thoughts.", "Interview Questions": "Where do you see yourself in a few years?"}], [{"date": "20 Aug 2020", "title": "Staff Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Aug 2016", "Interview Descriptions": "I applied on the hospital website. The administrative assistant called me to set up an interview. The interview was at the unit I applied for, in the manager's office. It was the manager and the CNII that interviewed me. It lasted about 30-45 minutes. They asked me a list of questions, about two pages long.", "Interview Questions": "What are your weaknesses?\r\nWhat are your goals in the next 5 years?\r\nWhy are you interested in UIC?\r\nHow have you work experience prepared you for this position?\r\n"}, {"date": "12 Sept 2016", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in May 2016", "Interview Descriptions": "Took place in the office of the nurse manager with the nurse manager and the nurse educator. Both take turns asking questions. It felt like I was having a normal conversation with the nursing manager. He asked me to tell him about me and he gave you a chance to ask him about himself. I felt very comfortable during the interview.", "Interview Questions": "Why did you go into nursing?"}, {"date": "5 Jan 2017", "title": "Community Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Dec 2015", "Interview Descriptions": "Open ended, One on one. Personable but non-intrusive. I was very luck to be interviewed by the person who would be my supervisor. I had every question answered . It was average in level of stress. Once the interview was done I was introduced to members of upper management, given a tour of the work spaces and had an opportunity to observe what I would be doing as a new hire.", "Interview Questions": "Why do you want to work in the field of Community health. "}, {"date": "10 Jan 2015", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Illinois Hospital & Health Sciences System", "Interview Descriptions": "very easy, mostly related to current position applied for. nothing much to worry about. This is regarding in house positions. you take the civil service test, place on the register, get call for an interview. then you wait to be selected. may happen but may never happen unless you know someone in the department.", "Interview Questions": "there were not any"}, {"date": "13 Jul 2015", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Illinois Hospital & Health Sciences System (Chicago, IL) in Jul 2014", "Interview Descriptions": "I met with the nurse manager, one of the administrative nurses, and some other guy who works in the ED (still not sure what his official title is).  Pretty standard interview, some typical pre-baked interview questions.  It was pretty low pressure.  As long as you have a good idea what you are getting yourself into working as an EMT in the ED, and are confident that you want to take it on, should be a piece of cake.  The biggest issue is getting through all the red tape to get the interview and get on the schedule.", "Interview Questions": "Tell me about a time when you had a problem with someone you were working on a team with and how you resolved it."}]]