[[{"date": "9 Jun 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Global Fund", "Interview Descriptions": "Following a virtual interview and a case study I had a 60 min panel interview (Hiring Manager, HR, two colleagues). During the interview they changed languages (English and Spanish were required for the role).", "Interview Questions": "How do I prioritize? How do I deal with conflicting priorities from different teams? What are my weaknesses?"}, {"date": "28 Apr 2022", "title": "HR Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Global Fund", "Interview Descriptions": "you first receive an email asking you to complete interview questions in a video that will be shared with hiring managers then you are invited to a panel interview where you get all types of questions one after the other", "Interview Questions": "How do you deal with difficult people\r\nHow do you make sure people contribute \r\nHow do you prioritize activities "}, {"date": "12 Dec 2022", "title": "HR Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Global Fund (Geneva) in Feb 2022", "Interview Descriptions": "Most people feel pretty comfortable with describing their current job responsibilities (or their most recent position if the candidate is currently between jobs). In fact, when hiring experts conduct interviews on behalf of corporate clients or for their own company, they often ask this question first precisely because it is so straightforward. The candidate is likely to be comfortable answering the question, so they will usually relax and open up a bit.", "Interview Questions": "What challenges did you face in your previous work and how did you approach it?"}, {"date": "22 Mar 2022", "title": "Risk Modeling and Analytics Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Global Fund (Geneva) in Jan 2022", "Interview Descriptions": "First, a Sonru interview with one or two high-level HR questions and some quite technical questions specific to the position.\nThen it was followed by a personality test and a panel interview with the hiring manager, 2 other managers and the HR.\nEach person in the panel at his turn ask some questions related to the position or about myself.\nInterviewers are very nice and it was a positive experience until there however the interview is followed by a Ghosting of 2 months without any feedback, both hiring manager and HR do not answer to any request...", "Interview Questions": "How do you handle difficult situation at work ?\nWhat makes you the perfect candidate for this position ?"}, {"date": "29 Dec 2021", "title": "Associate HRBP Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Global Fund (Geneva) in Nov 2021", "Interview Descriptions": "NEVER GOT A CALL BACK WITH FEEDBACK! After two interviews and many hours preparing not even giving a courtesy call to explain why you have not been selected I find quite disrespectful\n\nFirst a SONRU video interview including approx 5 questions, then a panel interview with four people (Hiring Manager, Recruiter, Team member and External member) lasting 50 min.\nThe process itself is pretty straighforward.\n\nThe interview was very hard, asking very specific questions. Turns out one of the questions didn't even have an answer (I know because I asked at the end of the interview) Hence they were just trying to trick me which is not trying to get the best out of the candidate.\n\nThen they were looking for experience in changing a specific process - which I did not have - but I pointed out that I did have experience in changing other kind of processes to which they did not seem to care. This sounds completely ridiculous since  it implies exactly the same skills just applied on something else.\n\nI had 5min at the end of the interview to ask my questions but the hiring manager cut that short, clearly showing disinterest in my questions.\n\nAt the end of the interview Ispecificcally asked when I would be contacted with feedback. I was given a 10-14 days window but they never bothered.  We bother with their process, they could at least  bother with a call back! Poor candidate experience overall", "Interview Questions": "Do you have experience in conflict management\nHave you ever improved the performance review process\nHow do you deal with poor performances"}, {"date": "6 Sept 2021", "title": "Consultant Operational Efficiency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Global Fund in Sept 2021", "Interview Descriptions": "I was contacted by an external recruitment agency for this opportunity. Interested in my application, the TGF asked me to complete a 3-hour excel/ppt test before I could even talk to someone from the Global Fund. Following this test, the Global Fund offered me an interview. I learned the day before the interview that it was cancelled because the position was finally filled internally. \r\nI find it absolutely pathetic and shameful that they would ask candidates to take such long tests before cancelling an interview at the last minute, without bothering to meet the candidate. \r\nI noticed that some of the comments on Glassdoor were about similar experiences...\r\nThis leaves me with a very poor impression of the company, far from the value of respect that they claim to stand for. \r\nI will refuse any more solicitations from this company.", "Interview Questions": "Excel & Power Point Test (Online)"}, {"date": "22 Apr 2021", "title": "Principal Associate Finance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Global Fund", "Interview Descriptions": "4 person panel, Online, about 1 hour, was mostly interesting \r\nwas organic, with one question leading to another and then developing into a conversation and organisation's culture was also assessed through situational questions\r\nFitness to team expectation", "Interview Questions": "Introduce yourself  and what you bring to the team\r\nList Financial risks and how you aim ti mitigate them\r\nPractical example on how you persuaded your superiors on a decision that was favorable\r\n\r\n"}, {"date": "21 Feb 2022", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Global Fund (Geneva) in Feb 2021", "Interview Descriptions": "Virtual video interview,then case study next , then meeting hiring manager and other staff,A case study will be shared , for the second interview ,which has a lot to do with excel", "Interview Questions": "A case study will be shared , for the second interview ,which has a lot to do with excel "}, {"date": "13 Jan 2020", "title": "Talent Aquisition Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at The Global Fund in Jul 2019", "Interview Descriptions": "contactée à travers une agence de placement. l'entretien a été assez rapide (30 minutes environ) avec deux personnes des ressources humaines. les questions étaient principalement orientées sur les techniques de recrutement et la connaissance de l'organisation.", "Interview Questions": "Questions techniques sur les outils de recrutement"}, {"date": "16 Dec 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Global Fund (Geneva) in Jul 2018", "Interview Descriptions": "Average Interview with online testing. Most of the questions related to respective professional experience checks.  Also some technical questions. Received technical task to complete business case in one hour. Generally neutral experience.", "Interview Questions": "Job specific experience"}], [{"date": "23 Jul 2019", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Global Fund (Geneva) in Mar 2018", "Interview Descriptions": "Fictitious and extensive process where outcomes are already pre-determined and HR is used as a smoke screen for management to hire someone that they already know or are related to", "Interview Questions": "Are you French?"}, {"date": "27 Sept 2022", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Global Fund (Lancy) in Jan 2018", "Interview Descriptions": "Open discussion yet structured.  Very well presentable team. You feel at ease very quickly. It is more a discussion rather than a typica job interview.  Great Organization with clear missing and global impact.", "Interview Questions": "Why this job why now?"}, {"date": "19 Feb 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at The Global Fund (Geneva) in Feb 2015", "Interview Descriptions": "Panel de quatre personnes.\n\nPrésentation du service par la responsable (elle a quitté la pièce après seulement 10 minutes).\n\nDescription des activités par le spécialiste en gestion de projets.\n\nEnviron 10 questions en un laps de temps très court — une présentation de 5 minutes, puis 4 questions par panéliste avec des réponses de 20 secondes acceptées.", "Interview Questions": "Avez-vous de l’expérience dans le transfert de personnes d’un point A à un point B ? "}, {"date": "22 Sept 2019", "title": "Head of Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Global Fund (Geneva) in Jan 2015", "Interview Descriptions": "Collegial, friendly very content focussed questions, the team was well prepared, had read my resume and very engaged in understanding why I applied and if I would fit the role at the Global Fund", "Interview Questions": "Why do you want to join the Global Fund"}, {"date": "9 Mar 2014", "title": "M&E Expert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Global Fund (Geneva)", "Interview Descriptions": "The hiring and interviewing process was not a lengthy process. It was a very thorough process. The questions were targeted at highlighting my skills, knowledge and suitability for the role. Having completed this interview I feel much more confident in doing any other interview...it was that detailed.", "Interview Questions": "While I can't recall the exact question, the technical questions were not a walk over. They did not just seek to unearth if I had knowledge of the softwares among other areas, but they unearthed my level of knowledge and my ability to transfer that knowledge into meaningful work that will contribute to realization of the organization's goals. "}, {"date": "16 Oct 2014", "title": "Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Global Fund in Sept 2011", "Interview Descriptions": "J'ai été informé du poste d'assistant temporaire par un ami à moi qui travaille dans l'équipe. Ce n'était pas un entretien GF typique où il y a un panel de recruteurs car c'est une occasion très temporaire. L'aptitude à parler français était d'une grande importance compte tenu de la géographie du domaine d'activité de l'équipe. Par conséquent, l'entretien a été menée en français. Ma connaissance du français était à un niveau « presque fonctionnel » à l'époque, et en dehors des questions posées, on m'a demandé d'écrire une lettre de motivation aussi en français.  L'intervieweur était très gentil et patient, parlant souvent plus lentement si j'avais du mal à comprendre. En fin de compte, je n'ai pas reçu le poste strictement à cause du fait que je ne maîtrisais pas formidablement la langue, cependant, l'entretien était une bonne expérience qui m'a fait sentir beaucoup mieux et plus à l'aise avec ma connaissance existante du français.", "Interview Questions": "L'aspect le plus difficile de l'entretien était d'écrire une lettre de motivation en français sur place « sans dictionnaire » dans une période de temps donnée. Encore une fois, je ne pense pas que cela soit la norme et que c'est un test informel de ma maîtrise du français."}, {"date": "25 Apr 2013", "title": "Responsable programmateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Global Fund (Geneva) in Sept 2009", "Interview Descriptions": "Ça peut être très long parfois, mais la sélection est faite en général d'une façon professionnelle. Je dois faire un test pour passer au stade de l'entretien, qui dans mon cas a pris plus d'une heure. J'ai bien aimé.", "Interview Questions": "Habituellement les questions sont au sujet de votre expérience passée, votre motivation, la raison pour postuler au Fonds Mondial et la cessibilité des compétences. Ce n'est pas différent d'autres employeurs que je connais. Pas d'étude de cas.  "}]]