[[{"date": "25 May 2023", "title": "Editorial Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Academy of Sciences", "Interview Descriptions": "I received a phone screen before attending an on-site interview with one of the managing or senior editors, who was courteous and conducted the interview professionally. It was solely a one-on-one interview and I did not speak with anyone else in the department, which compared with my earlier interview experiences was a bit unusual but not necessarily unwelcome.", "Interview Questions": "What types of editing do you have experience with?"}, {"date": "20 Apr 2023", "title": "Membership Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "I had one phone call to see if I was for for the job. Asked me various questions about my background and my current role as well as asking about my previous experiences and career paths.", "Interview Questions": "How do my experiences make me a good fir for this role?"}, {"date": "29 Apr 2023", "title": "Finance Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Apr 2023", "Interview Descriptions": "The normal HR process was applying, longlisting, shortlisting, and The Call and Panel Interviews. 8 questions 6 out of 8 were about technical and 2 out of 8 were HR questions.", "Interview Questions": "Strengths, weaknesses Technical about Finance Accounting Softwares."}, {"date": "10 Apr 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in Feb 2023", "Interview Descriptions": "There were three interviews with different members of the team. The interviews were not difficult mostly because they asked the same questions across the three interviews. The staff was really nice and provided great information about the position.", "Interview Questions": "How well do you do with deadlines? How do you deal with difficult personalities?"}, {"date": "23 Jan 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Academy of Sciences in Jan 2023", "Interview Descriptions": "Initial screening by HR 1st interview with Board/Program Director for first 30 minutes followed with last 30 minutes with other Program Officers 2nd interview- with rest of program officers for 30-60 minutes", "Interview Questions": "What drew you to the Academy? 5 year plan? Weaknessess and Strengths?"}, {"date": "28 Mar 2023", "title": "Associate Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Academy of Sciences in Jan 2023", "Interview Descriptions": "The interview process was pretty straightforward. One interview with a recruiter which lasted roughly 30 minutes. This was followed by an interview with the prospective superior(s), roughly 1 hour. Review your resume, come prepared, and it should go smoothly", "Interview Questions": "What experience do you have doing this kind of work? Name a time when you had to __________ (usually an example that fits within the duties of the job)."}, {"date": "9 Feb 2023", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at National Academy of Sciences (Washington, DC) in Jan 2023", "Interview Descriptions": "several rounds of interviews over a long period of time; 1st interview was more technical, largely assessing management skills and leadership; standard questions asked nothing out of the ordinary; responded thoughtfully to my questions. 2nd interview was more informal-feeling, with least favorite question \"tell me about yourself\" to start. between interviews I was also asked to complete a written activity responding to an example of an issue and how i would approach/respond.", "Interview Questions": "What is your experience managing different team members? How do you manage budget? How do you build consensus among diverse stakeholders?"}, {"date": "6 May 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in Apr 2022", "Interview Descriptions": "Initial HR Screening took fifteen minutes. Following the screening I was invited to participate in a two person panel interview with members from the hiring division. Process following HR screen too less than one week. The panel interview last roughly 1 hour.", "Interview Questions": "What interest you in the position?"}, {"date": "9 Feb 2022", "title": "Assistant Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Academy of Sciences", "Interview Descriptions": "Straight forward process and kind recruiter, applied online. There was a phone screening and then in person interview and then asking for references. The in person interview was a panel of three", "Interview Questions": "Why do you think you're the right fit?"}, {"date": "28 Jan 2022", "title": "Program Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at National Academy of Sciences", "Interview Descriptions": "Had several different interviews. Began with a phone screen with HR. Then one-on-one with the hiring manager. Then panel interview with the team (had 2 separate ones for individuals with different roles). Final interview was with the executive director. Took a minimum of 2 weeks between each call. The overall process took 6 months.", "Interview Questions": "Do you have any people management experience?"}], [{"date": "1 Dec 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National Academy of Sciences (New York, NY)", "Interview Descriptions": "Age discrimination is alive and well in this organization. I was clearly qualified for the position, but I had an interviewer who kept probing to figure out my age, which had no relevance to carrying out the duties of the job. Very unprofessional and rude.", "Interview Questions": "What year did you graduate?"}, {"date": "2 Feb 2022", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Academy of Sciences (Washington, DC) in Sept 2021", "Interview Descriptions": "There is a long time where there is radio silence. Difficult to tell if you've made it to next round. Otherwise, process itself was pleasant.  There was HR first, then Chief of Staff, then a panel with the team, then souther person from another team but same level. Then the executive director and finally the President.", "Interview Questions": "What is your management style? How do you handle difficult conversations. With your employees? Tell us about a time that you made a mistake or a lesson learned scenario at work."}, {"date": "24 Jul 2021", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National Academy of Sciences", "Interview Descriptions": "The interview process was simple enough. Received a call from a recruiter but didn't receive a call back. Recruiter did say that I would be contacted again if I moved forward.", "Interview Questions": "Received an initial call but no follow up. Recruiter did say they would follow up if I moved forward. "}, {"date": "25 Jun 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in May 2021", "Interview Descriptions": "The interview process took about a month and a half.  In total I had four rounds of interviews, starting with a screener and then multiple interviews with different members of the team. The hiring managers were very attentive, even though the process was lengthy.", "Interview Questions": "How do you manage competing deadlines? "}, {"date": "16 Apr 2021", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Academy of Sciences", "Interview Descriptions": "I've interviewed a lot and I can say that the National Academies was one of the best experiences. The recruiter was on top of keeping me in the loop of the interviewing process. I've never experienced such a timely and positive interviewing experience. Keep up the great work!", "Interview Questions": "What kind of workplace do you thrive in?"}, {"date": "2 Apr 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences", "Interview Descriptions": "I got an email to meet with their internal recruiter for a short 20-minute phone interview. The interviewer was extremely friendly and made for easy conversation. He was transparent, detailing exactly what to expect from the phone interview. At the end, he shared his views on how well I did in the interview and stated that he would pass along a recommendation for me. He then described what the rest of the interview process would look like, as well as what the salary range was for the job.", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "8 Jul 2020", "title": "Associate Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Jun 2020", "Interview Descriptions": "The interview was very straight forward. I was asked a few questions but my interviewer mainly did the talking and explained the position to me. The topics that the position would cover were still up in the air, so I think that's why this was the case.", "Interview Questions": "They asked questions about my writing samples which were based on my doctoral research."}, {"date": "30 Jun 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Academy of Sciences in Jun 2020", "Interview Descriptions": "Really dry interview process with even less enthusiastic interviewers and staff. The first was an interview screen with a recruiter - a basic 15-20 minute call where you walk through your resume and discuss why you want to work at NAS. The questions were pretty standard. One question which I didn't expect was when the interviewer asked me what makes me different from the other candidates as I have the same qualifications as every other person who has applied..the wording of this question honestly seemed a bit rude. The interview ended with salary discussion on what you expect to be paid. \r\n\r\nThe second interview was with the Senior Program Officer and a program assistant and/or consultant. Note, I did two different interviews for two departments on the same week so the panel interviewers varied but normally consisted of a panel interview with 2-4 people. I found this process to be a bit off as the \"lower ranking\" people seemed to all turn on their videos for the zoom interview but the \"high ranking\" SPO decided not to turn on their video for both of their interviews. It was really awkward having my video turned on and talking to the other staff members but not being able to see the highest ranking SPO during the conversation. It made it really difficult to detect facial cues and resulting in a lot of awkward silences. \r\n\r\nI was invited to a third interview with their Executive Director. I declined at this point because I was offered a position at another organization and decided to accept that. \r\n\r\nOverall, this interview process was of and felt like I was just a number in a sea of candidates. It was not personal, the staff/interviewers did not try to get to know me and I really didn't have the opportunity to get to know staff members and company culture. I felt pretty rushed during the allocated 1 hour interview phase, where both my interviews ended in 40 minutes because it seemed like the SPO had more important things to do. This was one of the stiffest interviews I have been on - and felt more like a transaction than a conversation. Very mechanical and impersonal. Makes me wonder what the work culture is actually like there.", "Interview Questions": "Why the National Academies? \r\nMake sure to know the specific research conducted within the department you are working for. They are looking for a perfect match on people who have a good background and experience in the specific factors that they are researching. \r\n\r\nTell me about yourself/background. \r\nWhat experience do you have on research topic X? \r\nAre you familiar with personality tests and what did you receive? \r\nHow do you deal with constructive feedback?\r\nWhat is your \"superpower\" and what is something that you absolutely cannot do? \r\nHow do you deal with a difficult co-worker or manager? \r\n"}, {"date": "13 Mar 2020", "title": "Associate Program Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences", "Interview Descriptions": "I talked with various members of the team and learned about the process as well as the skills needed to succeed at the NAS.  I learned about the community, funding, and workflow.", "Interview Questions": "How did you deal with a difficult person? "}, {"date": "9 Jul 2020", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in Feb 2020", "Interview Descriptions": "Feb 12 - Applied online \r\nFeb 14 - Recruiter contacted me and proceeded to discuss the position within a week. They asked me what makes me stand out from all the other candidates. I thought that it was an unnecessary question because they have my resume! Also, this question is subjective, but I gave an objective answer by reiterating the job qualifications and my resume. We also discussed salary, and the recruiter made it clear that is it not negotiable, but they wanted to prepare me I suppose in case we proceeded further. \r\nFeb 21 - Met with the director and a senior program officer. They were both friendly. It was more of a discussion. I prepared tremendously for this position. I gave them hard copies of examples of my own work, including publications, manuals, and guidelines that I developed from my previous jobs. I also gave them hard copies of the material on what I knew about NAS and their productivity, and I had questions on their evaluation of performance by giving them specific examples. In addition, I gave them a paper on what studies I would conduct if I was selected as a Senior Program Officer, and who to contact to work with other people in the field. I gave the about 5 project proposals and wrote them with references. Towards the end of the interview, the director was impressed. In fact, he said that my work is outstanding and it he thought it was a really great interview. Personally, I thought that it was a great interview too! I over prepared and worked really hard, and it showed. This interview lasted over the time limit because the director and I had many questions to ask each other. \r\nMarch 11 - No updated on my application so I emailed the recruiter for the status. They said that they were still interviewing more candidates. \r\nJuly 7 - I was informed that the job was CANCELED, and that they ceased recruiting efforts for that job!  \r\n\r\nOverall, I was extremely positive and energetic during the interview. I showed a lot of ambition and enthusiasm than any normal person! I am also a very young person applying for the Senior Program Officer position. IMO, I think all these things could have been the reason why I wasn't selected. This is a very flat organization and people have worked there many years. It not uncommon for people to feel complacent. When I came into the building, I can already sense the dreary mood. However, I felt more compelled to get a job here despite the negative reviews. I felt that I could have been the person to balance out the potential team/organization with my energy. Perhaps, I wasn't selected because it could have been a cultural mis-match. Anyways, if you get an interview, take it! I still believe that it was a tremendous honor to even get an interview at the National Academy of Sciences! Though, I am confident that they overlooked a high qualified candidate.", "Interview Questions": "Why NAS? What makes you stand out? How well do you work with people? "}], [{"date": "8 Feb 2021", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at National Academy of Sciences in Jan 2020", "Interview Descriptions": "The interview had very basic questions that mostly focused on personality. It is somewhat clear that this particular division (and perhaps the National Academies overall) is somewhat insular and prefers candidates they know, or/are recommended by colleagues/friends. These type of recommendations are somewhat common practice in any field, but it seemed a bit too family-like. I was actually relieved that I did not get the offer which let me know this would not be the right environment for me.", "Interview Questions": "Q: They provided an example topic and asked, \"What areas of expertise would you seek to build your panel?\"\r\n\r\nQ. How would you deal with a panel member that was making it difficult to run the meeting?"}, {"date": "24 Jun 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at National Academy of Sciences (Washington, DC) in Dec 2019", "Interview Descriptions": "The entire process from application to final word on the final interview took place over 3 months.  I knew several of the people interviewing me from prior experience and the interviews themselves seemed to go well.  The simple fact that the process was so protracted should have been an inidication that it was not a good situation.   Sometimes what seems like it might be the dream job, turns out to be less than that when you get to look inside.  In the end, they decided not to fill the position and gave me some fairly vague feedback.", "Interview Questions": "What is your style of management; how do you work with staff?"}, {"date": "12 Aug 2019", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "After the initial application you will be contacted for a phone screening which consists of genera questions such as why you want to work at the Academies, future career plans, strengths and weaknesses etc. Following the phone interview you are invited in for a formal in person interview during which you spend 30 minutes with the directors of any projects you will be assigned to as well as a research associate or program assistant.", "Interview Questions": "Strengths and Weaknesses"}, {"date": "26 Sept 2019", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at National Academy of Sciences in Aug 2019", "Interview Descriptions": "Received an email for a Skype Interview later that week. The interview lasted 45-60 minutes and was very relaxed. Talked with two members of the team I'd be working for and a member of HR.", "Interview Questions": "Q: What makes you qualified for this position"}, {"date": "12 Sept 2019", "title": "Associate Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Aug 2019", "Interview Descriptions": "Short interview, small panel. I was asked to make a 20 minute presentation. Very little content outside of that, but everyone was cordial and accommodating. Wish it would have went longer.", "Interview Questions": "How can we make our efforts more sustainable?"}, {"date": "14 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Aug 2019", "Interview Descriptions": "I applied via an online application and got an interview offer about two weeks afterwards. The interview took place at the National Academy and lasted about 50 minutes. There was also an interview/debrief with NAS's recruiter discussing next steps and benefits.", "Interview Questions": "What type of work style would you bring to our office environment?"}, {"date": "11 Jan 2022", "title": "Cost Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences in Jul 2019", "Interview Descriptions": "Three rounds interview. All behavioral questions about scenarios, past work experiences, expectation.   Follow up very quickly from recruiter. Process was simple and transparent. All together from first interview with recruiter to receive offer was within 2 weeks.", "Interview Questions": "What is your 5 years plan? "}, {"date": "7 Dec 2018", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 7 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Dec 2018", "Interview Descriptions": "I was contacted for a phone screen several weeks after applying for the position. I was then asked to come in for an in-person interview to meet with two potential colleagues and the overall director of the program. The meet and greet with the potential colleagues went fine, pretty basic Q&A and they seemed nice. The meeting with the director was ridiculous. He asked me how I felt about not having experience with some aspects of the job, which were not listed on the job description, and seemed to expect me to justify why I was present at the interview. It was very awkwardly handled and not a position that any applicant should have to be put in. If the experience listed on a resume is not sufficient for the position then there is no need to bring the candidate in for an interview. It was clear when I walked out of the final meeting that they were looking for someone with more specialized experience than was listed in the job description and overall I felt that they wasted both my time and theirs - simply ridiculous.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "22 Dec 2018", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Academy of Sciences (Washington, DC) in Oct 2018", "Interview Descriptions": "First you get a phone call that asks you a few questions regarding your interested in the company and why you want to work for them. Then they ask you to come for either 1-1 interview or group interview where you would be asked questions based on your resume and work experience as well as your education and background.", "Interview Questions": "Tell me about your experience or work at XYZ company?"}, {"date": "25 Sept 2018", "title": "Senior Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Sept 2018", "Interview Descriptions": "I have only done the telephone interview so far, but it was pretty basic and they just ask the generic questions, but make sure you have the job description in front of you.", "Interview Questions": "What are your greatest strengths and weaknesses? What are you doing to overcome your weakness?"}], [{"date": "7 Sept 2022", "title": "Senior Program Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Feb 2018", "Interview Descriptions": "Very informal interview in the cafeteria lol. It was uncomfortable because the discussion with the interviewer/hiring manager kept getting interrupted by random people thinking I was just dropping by for lunch. 80% of the time the interviewer was talking about themselves.", "Interview Questions": "What’s your passion in life"}, {"date": "10 Aug 2017", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at National Academy of Sciences", "Interview Descriptions": "During the interview the director and coordinator did most of the talking about themselves and the National Academies. It was not a traditional interview. We BRIEFLY went over my resume. \r\n\r\n3 weeks went by and I had not heard back from them. So I contacted them and they told me they were going to continue their search.", "Interview Questions": "What type of managerial style do you prefer?"}, {"date": "14 Jun 2017", "title": "Media Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "Everyone I met was very friendly, but there was a lack of professionalism in the process. I met with the head of the department, three higher-ups, the other media assistant, and the HR representative. The actual interview was good and I enjoyed all the conversations. After the interview, I received an email from the HR rep asking me back for another interview and listing possible times. After I had responded with the time that worked, he recalled the email and said he appreciated my interest, but that they were still deliberating and that I was premature in responding. Except that I had gotten an email about a second interview that listed dates, so of course I responded to it. Weeks went by and I never heard back, and I didn't get a response until I followed up. When I did, it was a canned response. I can't help but wonder if the email confusion was a part of the reason I didn't get the position, which would suck because it was a goof on the part of the HR rep who didn't own up to it. Plus, I think it's super rude not to let someone know who has taken two hours of their time to interview in person that they didn't get the job. At least give them closure.", "Interview Questions": "No out of the ordinary interview questions."}, {"date": "31 May 2017", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences", "Interview Descriptions": "The interview was about 40 min long. Started with a brief introduction of myself, then was asked about my experience, fit for the position, interests. The interviewer was very friendly and easy to talk to.", "Interview Questions": "Why am I interested in the position"}, {"date": "24 Aug 2017", "title": "Media Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in Apr 2017", "Interview Descriptions": "Contacted for a phone interview, then an in-person interview, which was with three different people, and then a panel of a few people. The individuals I spoke with were personable, but you will be expected to know a lot about NAS. The whole process -- from resume submission to final answer -- took about two months.", "Interview Questions": "Can you tell us about [insert interesting thing on resume] and how it relates to this position?"}, {"date": "15 Dec 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at National Academy of Sciences (Washington, DC) in Mar 2017", "Interview Descriptions": "I was asked to come in for an interview (before Covid Era) in DC. When I arrived, there was a young lady ahead of me who was turned away, saying their interview slot was cancelled. Awkwardly I went up for my interview which seemed to replace hers, sat down with a lady who told me she just wanted to see how I looked like in person, and had no questions or answers for me.", "Interview Questions": "None given, none answered. I was able to interview for a different department with NAS, where I was accepted and had a great experience. "}, {"date": "20 Mar 2017", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Feb 2017", "Interview Descriptions": "I was told about this company and position by a former employee, who kindly connected me with a current employee. I first had an informal informational phone call, submitted an application, was invited in for a longer formal interview.", "Interview Questions": "How do you manage multiple competing deadlines?"}, {"date": "16 Mar 2017", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Academy of Sciences in Dec 2016", "Interview Descriptions": "The first step was a brief interview with HR. I then received an email for an in-person interview which consisted of two people from the department. I then had another brief interview with HR to go over any questions or concerned. Really great people. Probably my most pleasant interview thus far in my career. Received a call a week later that they wanted to make an offer, which I accepted.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Dec 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National Academy of Sciences (Washington, DC) in Oct 2016", "Interview Descriptions": "I have interviewed with the National Academies back in November. My experience was great, as they were the most professional people I've dealt with in the area. I had to meet with an HR representative that I talked to by phone after passing the phone screen. After I've met the HR representative I was interviewed by the program officer and the director at the same time. It can be nerve wrecking at first, but they were very nice to me. After that, I interviewed with the HR representative again, and was notified about their decision a little over a month later.", "Interview Questions": "What are your strengths/weaknesses?"}, {"date": "24 Oct 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National Academy of Sciences (Washington, DC) in Sept 2016", "Interview Descriptions": "I found the interview process upfront and open; the details of the job and the salary range were explained in the first initial phone screening.  It was a multi-phase interview with several stakeholders, so there was the opportunity to learn more about the organization from a variety of perspectives.The interviewers were open about the culture and the advantages/challenges of working for the organization. While it took several months, it was a positive experience.", "Interview Questions": "What is my dealbreaker?\r\nHow would I approach my first day on the job?"}], [{"date": "15 Jun 2016", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences", "Interview Descriptions": "I had my phone screening at 9:15 AM, right after waking up without any warning (I was still in college at the time). It was very unexpected and I really didn't appreciate it, though I understand that is what a lot of these companies do. Standard questions, with a huge focus on resume as usual. They required an in-person interview as the next step, and as I was already interviewing for other NYC companies, declined the offer.", "Interview Questions": "How can your experience in (X Position) translate into working for this position? "}, {"date": "17 Mar 2016", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "After the online application process, I was contacted by an HR representative for a screening. The rep explained the timeline thoroughly, and we had an initial conversation about salary. I appreciated the honesty up front, many places I've interviewed with keep this information private until the final negotiation. While I did not receive an offer, the HR rep contacted me about the decision promptly. I feel that many places simply do not get back.", "Interview Questions": "Why do you think you would be a good fit for this position?"}, {"date": "3 Apr 2016", "title": "Senior Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at National Academy of Sciences (Ithaca, NY) in Mar 2016", "Interview Descriptions": "Applied through university's career website. They responded the next week to set up a basic phone screen (walk me through your resume type questions) with someone on the team. I was then asked to fill out an application via their website and that I would be contacted shortly by their HR team in order to set up an HR screen. After not hearing from them for 2 weeks I reached out again and received a quick response that they were no longer hiring and that they had passed my resume along.", "Interview Questions": "Walk me through your resume"}, {"date": "15 Jan 2016", "title": "Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "The entire process from application submission to notification of not being selected was 3 months. The recruiter called for a phone screen about 3 weeks after applying online.  About a week after the phone screen I was invited for an on-site interview with the department head and two potential colleague.  It took them 6 weeks to notify me after the on-site interview that I was not selected. All 3 interviewers were extremely nice.", "Interview Questions": "What do you see yourself in 5 years."}, {"date": "19 Oct 2016", "title": "Finance Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National Academy of Sciences (Washington, DC) in Oct 2015", "Interview Descriptions": "It was very lengthy.  I had a total of 6 interviews.  Two phone interviews with a panel. .  Two panel interviews  in person and two one on one interviews.  They lasted about an hour each.", "Interview Questions": "Related to your ability to do the duties and responsibilities.  Examples of your experience"}, {"date": "24 Jun 2015", "title": "Director of Development IOM Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at National Academy of Sciences", "Interview Descriptions": "Everyone I interviewed with at the NAS for the IOM DoD position was wonderful except for one stand-out, and he is a leader in the division, with whom I would be working very closely. All the others asked typical, good thoughtful questions and they listened to my answers - we had a dialogue. Not this individual, he was the most arrogant, disrespectful person I've ever interviewed with.", "Interview Questions": "The questions that were asked were no problem - mostly typical ones, why do you want this job? etc. The main problem was this leader did not listen to any answers, he interrupted constantly and was extremely unpleasant."}, {"date": "9 Feb 2016", "title": "Program Assistant-National Academy of Medicine Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Jul 2015", "Interview Descriptions": "I received a call and emails from the HR department about a week after I had submitted my application for a program assistant position under NAM. I had an interview with the HR person then with the senior program officer. I was invited back for a second round interview with the director. Overall experience was positive. I was very inspired after talking to these intelligent professionals who are passionate in their fields of health and medicine.", "Interview Questions": "Why do you want to work here?\r\nWhat make you a better fit for this position than other candidates?"}, {"date": "15 Jan 2015", "title": "Senior Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Academy of Sciences", "Interview Descriptions": "Applied online last Nov., \r\nReceived Phone Call/Brief Phone Interview 2 weeks later (Know why you're interested in company,etc and be ready to discuss your resume-be prepared, will be asked about salary too), During Phone call scheduled interview in two weeks\r\n1st In Person Interview 2 weeks later, Met with team of department/head person, really friendly group of people, the best interview Ive ever had, I was extremely prepared so that helped tremendously, but the people were really supportive in listening and well intentioned, really tried to get to you, not embarrass you or make the interview hard intentionally which was great, really nice open, laid back atmosphere, great vibe,quiet office, was about 1hr/half long\r\nReceived a phone call a couple hours later after 1st interview asking for second interview the following week\r\nMet with the very top person of the dept and brief interview with HR (basically went over resume, etc, not a real interview formally) 1 week later, the very top person was extremely friendly and kind and laid-back. \r\nFound out about 3 weeks later that I didn't receive position via email with subject line - Status Selection (I almost deleted and thought it was spam). \r\n\r\nOverall took about 2 1/2 months. \r\n\r\nVery long and thorough process, but well worth it. Very nice and kind people. Great atmosphere. The only thing I will say is that the HR recruiter was very abrupt and impersonal and lacked basic social skills and was pushy at times. Didn't seem very racially/ethnically, religiously, etc. diverse. Predominately white men/women organization. Also, seems like the pay is very low period and in comparison to duties. The org is reorganizing and may consolidate a position without increasing pay. HR recruiter appeared extremely inflexible about pay increase, like it was absolutely impossible but benefits seemed pretty good. Also, I would suggest you have some great questions that are innovative and shows you've really researched the company and interviewers(make sure you get everyone's name prior from recruiter).", "Interview Questions": "If you won the lottery today, what would you do? What is an example of working with difficult people?"}, {"date": "6 Nov 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences", "Interview Descriptions": "The interview process was straightforward - I received an email inviting me for an interview about two weeks after my submission of my application. My interview consisted of Microsoft Word and Excel online proficiency tests (which were more difficult than you would think), a brief interview with an HR Representative, and finally a longer (but less formal) interview with the team leaders of the program to which I applied.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "2 Nov 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "What a long process. I first spoke with the recruiter on the phone in a very brief mini-phone interview confirming the salary and interest/ understanding of the role about 2 weeks after applying online.\r\n\r\nI then was invited for an interview via email the following day, scheduled for a week later. I went in and met with the hiring manager. The staff are very friendly and the work they do is very interesting.\r\n\r\nI felt that the interview had gone really well and I was granted a second interview a week and a half later. The interview was requested on a Tuesday for the following day, Wednesday. There was limited notice and not much room to change the date and time. I met with four people, including a second interview with the hiring manager. Each interview went really well and I was confident at the end I had a great shot at the position. At the conclusion, I was told it was between myself and one other person and a decision would be made the following day, but I wouldn't know for 1-2 weeks. \r\n\r\nAfter 2 weeks, I contacted the appropriate people and was informed I was not selected. I was then informed of a second position opening and was asked to apply, as I did make a good impression and a future at IOM was something they saw for me. I applied and was asked to wait 1 week. After 1 week, I was told no decision was made on the position, but was asked to come in with very short notice to meet three more people for 2 other possible RA positions available. I rearranged my schedule and went in to meet the other team members. With much delayed notification and waiting, I did not get 2/3 of the jobs I was then being considered for and the 3rd was waiting on funding. \r\n\r\nAs you can see it was quite an ordeal and required lots of waiting and patience. I followed up for feedback as I really would like to learn from this experience - i,e, what I was missing in experience and/ or why I wasn't selected. At this point, I have been offered a job at another company, but thought I would share my experience in case anyone else is patiently waiting replies. \r\n\r\nIt was quite lovely to meet with the staff, they are very smart and driven people. I do feel I made a large time commitment with lot's of positive feedback followed by disappointment that I did not get the positions discussed. I had such a positive experience when at the interviews, but in the end I felt that my time was not a concern and it's left me feeling the experience was more negative. \r\n\r\nThe interviews were all pretty standard. More conversational than question/ answer.", "Interview Questions": "What is the biggest problem in clinical research?"}], [{"date": "28 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Sept 2014", "Interview Descriptions": "I applied online and got a call about 2 weeks later. The recruiter asked me 2 behavioral questions and my availability. Few days later she sent an email asking me to come for an interview. I interviewed with the project supervisor who was very nice. After that, I got an email 2 weeks later asking for email references. They got in touch with my references the same day, and I got the offer for the job the following day. Then I received a package in the mail with an official letter, documentation, and some cool NAS gear.", "Interview Questions": "The questions were mostly behavioral. How do you work with people? Tell me an example of how the qualities on your cover letter will make you succeed in the position? She also asked me about one of the things I put on my resume which was an honors program I was in. One very important thing, HAVE QUESTIONS ready. The lady who interviewed me didn't think 4 questions were enough. "}, {"date": "28 Apr 2014", "title": "Development Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in Apr 2014", "Interview Descriptions": "Found job on indeed. Applied on a Tuesday and received a phone call on the 10th asking for a phone interview the next week. Said second round of interview callings will begin the last week of this month from HR. Waiting for phone call and will follow up either today or tomorrow about the status.", "Interview Questions": "How do I research."}, {"date": "11 Feb 2014", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at National Academy of Sciences (Washington, DC)", "Interview Descriptions": "This was an internal hire. Sometimes, it works to one's benefit to follow-up with Human Resources because I discovered they did NOT forward my application as they said they would.  Be thorough in your follow-up when dealing with HR.", "Interview Questions": "Why should I hire you for this position? "}, {"date": "8 Jul 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Academy of Sciences (Washington, DC) in Jun 2013", "Interview Descriptions": "Initial phone interview with HR, followed by meeting with core team members and tour of facility.  Interview questions included prior experience and the format was a group panel.  Atmosphere was relatively relaxed and informal.", "Interview Questions": "Prior experience"}, {"date": "2 Apr 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Mar 2013", "Interview Descriptions": "Two interviews, very thorough process but relaxed and not designed to intimidate. Everyone was very generous with their time and genuinely interested to both learn about me and share their experience working at NAS.", "Interview Questions": "What do I expect to gain from the position?"}, {"date": "11 Feb 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 7 weeks. I interviewed at National Academy of Sciences", "Interview Descriptions": "Getting the interview was the hard part. The actual interview wasn't so bad, but the job descriptions  can be really vague when it comes to what you'll actually be doing. I think it would be easier to find great candidates if there weren't such generic postings for the jobs. A lot of the people I know with the same title do totally different things. It totally depends on what your actually working group does.", "Interview Questions": "I felt like most of the interview questions were pretty standard. There wasn't one in particular that threw me off. "}, {"date": "22 Feb 2016", "title": "Senior Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Feb 2013", "Interview Descriptions": "There was an initial and brief phone interview with a human resources representative. The callback interview was at facilities. This consisted of three parts: an interview with a human resources representative (20 minutes), a timed computer aptitude test (MS Office Suite; 10-15 minutes), and lastly an interview by the sectional supervisor (20 minutes).", "Interview Questions": "Describe your professional background.\r\nWhat from your past professional experiences qualifies you for this position?\r\nDescribe your interest in this position.\r\nDescribe your interest in this organization and specific office."}, {"date": "22 Nov 2012", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Academy of Sciences (Washington, DC) in Feb 2011", "Interview Descriptions": "The HR department contacted me to arrange an interview. It was easy to communicate with HR and get information. Salary negotiations were done through the recruiter which was strange. The interview process varies depending on the hiring manager. Some ask challenging questions, but most are interviews to get to know you. If you convey confidence and talk about your experiences and how they fit in with the organization you should be good.", "Interview Questions": "None. Basic interview questions, tell me about your work experience. "}]]