[[{"date": "21 May 2023", "title": "Certified Flight Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Mar 2023", "Interview Descriptions": "the interview process consisted of a 3 part process involving written test of the FAA knowledge tests up to the commercial written exam and also it included the, presentations and interview", "Interview Questions": "General knowledge questions through commercial certificate"}, {"date": "31 Mar 2022", "title": "CFI Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Middle Tennessee State University (Murfreesboro, TN)", "Interview Descriptions": "It was a fairly relaxed interview which began by exchanging questions about personal qualities as well as requiring a ground school demonstration class and answering technical questions about the aircrafts systems and limitations. There were about three people present during the interview, all senior members of staff or chief flight instructors.", "Interview Questions": "To give a demonstration ground based on cross country navigation flight planning for a private pilot level student."}, {"date": "21 Mar 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Middle Tennessee State University", "Interview Descriptions": "1/2 hour standard interview done remotely via tele/skype/zoom. Asked basic questions regarding suitability for the job, prior experience, etc. Had a couple of these interviews with different schools (e.g., Business, Arts & Sciences, etc.).", "Interview Questions": "What makes you a good fit for the position?"}, {"date": "8 Mar 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middle Tennessee State University", "Interview Descriptions": "It was a group interview process where we split into groups and did team building activities. A panel asked interviewees questions at the end. The interview was mostly to judge how we communicate and grade our ability to work with a team.", "Interview Questions": "Tell me about yourself (hobbies, major, etc)?"}, {"date": "28 Aug 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middle Tennessee State University", "Interview Descriptions": "I had an interview with a committee of a few people. For an interview, it was a fairly pleasant experience. Everyone seemed down to earth which made the process much smoother and bearable.", "Interview Questions": "Name one of your successes and one of your failures."}, {"date": "12 Aug 2020", "title": "Undergraduate Recruitment Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Sept 2019", "Interview Descriptions": "Lots of student interviews. Here is an employee perspective:\r\n\r\nThey call you pretty quickly for undergraduate recruitment, because the job has a lot of turnover, but this is the best way to get into the university system quickly.\r\n\r\nThey solicit your references FIRST before meeting you, which I think is a bit weird. Be sure to let your references know they'll receive an email! After all of mine were sent in, I was called for an interview.\r\n\r\nMy interview contact was a really nice woman, and smiled quite a bit/made conversation before leading me back to the interview area. Be prepared for an unnecessary amount of interviewers! There were EIGHT people interviewing me. Yes, eight. It made the room cramped.   Some of them were current recruiters, and they all looked very \"muted\", and maybe even a bit unhappy. \r\n\r\nThey asked about two and a half pages, front and back, of questions, and it quickly became repetitive. By the second page, a lot of them ended up being the same questions but reworded. \r\n\r\nAfter answering all of those questions, you have to do your presentation. I felt like this is a very relevant part of the interview, because you could be giving presentations at schools. They were engaged during this part, but just barely.\r\n\r\nBy the time I left, I decided that this was probably not a department or role that I wanted to be in. I was honestly exhausted from just the interview! I  Applied to another admin job in another department immediately afterwards, which is where I am now. Way better experience and a better fit.", "Interview Questions": "A LOT of situational questions, but they will start to kind of repeat themselves. You need to study and prepare. Lots of \"Tell me about a time when...\" and \"When did you take initiative..\" questions."}, {"date": "17 Jun 2019", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Middle Tennessee State University", "Interview Descriptions": "Round robin interview style.  At least ten tables with typically two people at each. Each table asked a variety of questions based on specific areas, such as management and leadership style.", "Interview Questions": "Describe your experience with conflict management. "}, {"date": "19 May 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middle Tennessee State University", "Interview Descriptions": "The type of interview I had a Video Interview. Many questions asked about job related tasks. Zoom was the application that was used for this particular interview. The Director and Manager asked strategic questions.", "Interview Questions": "Example: What skills do you think are required for the position?"}, {"date": "9 Jul 2018", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Middle Tennessee State University (Murfreesboro, TN)", "Interview Descriptions": "Talked to The department director  and discussed about future expectations. Reviewed skills and test scores.  Very straight forward                                                              OK", "Interview Questions": "How do you see yourself in the next 5 years?"}, {"date": "19 Mar 2021", "title": "Flight Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Jul 2018", "Interview Descriptions": "The interview process first begins with you submitting your resume prior to the deadline. No resume will be accepted after this date. Period. Then there is a written test and depending on your written scores you will get called to the in person/zoom interview.", "Interview Questions": "Several questions about flight instructor responsibilities and scenario based questions (ie. if this happened, what would you do) "}], [{"date": "18 May 2018", "title": "Assistant Professor, Tenure Track Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Jan 2018", "Interview Descriptions": "Odd -- questions not focused on specific goals or needs of the environment.  Very few personal questions.  Rather than approaching the process as an opportunity it seemed like a task.  Overall the entire experience was strange.", "Interview Questions": "How do you deal with diversity?"}, {"date": "20 Sept 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Nov 2017", "Interview Descriptions": "The interview process is takes a long time, but is generally straight forward. I already worked for MTSU, so it was an internal hire. It took 2 months to get an interview and ultimately, the position.", "Interview Questions": "What is your reason for wanting to leave your present position at MTSU?"}, {"date": "20 Mar 2017", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middle Tennessee State University", "Interview Descriptions": "Just had to interview with a committee, other offices, and certain individuals. Fair and to the point.  Each job is very different in terms of interviewing process.  Must do your research, prep, and in many cases, be ready to do a presentation.", "Interview Questions": "My experience"}, {"date": "9 Dec 2021", "title": "Lifeguard Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Middle Tennessee State University in Feb 2017", "Interview Descriptions": "I submitted an application and they reviewed it. They had me come in, but just more of a \"get to know you\" type deal.  Not really an interview, they just need warm bodies", "Interview Questions": "Do you have your lifeguard certificate "}, {"date": "12 Jul 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Jan 2017", "Interview Descriptions": "I got a phone call to set up an a single person interview. I walked in wearing some pretty casual clothes, like collard shirt and khaki pants. Honestly they'll take anybody who has any technical knowledge. After the interview I got the job offer and started about a week later.", "Interview Questions": "How do you navigate and format a word document?"}, {"date": "19 Dec 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Aug 2016", "Interview Descriptions": "It was a group interview with about 4 pages of questions pertaining to the specific area and about my knowledge of the area and tasks that I can perform or am familiar with. It was a lot of questions/ talking points with them trying to figure out the type of person I was and if I would fit into their office dynamics.", "Interview Questions": "What could I bring to the office to fit in with the flow they currently have working for them?"}, {"date": "26 Jul 2017", "title": "Instru Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Aug 2016", "Interview Descriptions": "Applied online, I was contacted via email two weeks later, scheduled an interview the following week. The interview was with a group of professors, then spoke to the department chair.  I was offered the position the next day.", "Interview Questions": "How would your experience fit with this position?"}, {"date": "15 Jan 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Middle Tennessee State University", "Interview Descriptions": "Application submitted in Spring semester. No interview conducted. Selected based on application details. Selection results were out in one month. Considered prior experience in United States Navy and math tutoring.", "Interview Questions": "N/A"}, {"date": "8 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Aug 2014", "Interview Descriptions": "Assisting Computer lab, Troubleshooting computer queries as well as issues regarding printers, scanner, etc. Assisting student with the computer queries, their login-in into the computer and different lab maintenance services.", "Interview Questions": "GPA and past experience"}, {"date": "9 Sept 2016", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Aug 2014", "Interview Descriptions": "Go into the office to submit your paperwork. You'll talk to some staff in the department you are applying to. If you are working as a scholarship worker, you're already good to go; you just have to tell the hours that you are available and file some paperwork and you are done. If you are not a scholarship worker, you need to go through a proper interview process, mostly involving school related matters, like your major, why you want the job etc.", "Interview Questions": "What are you looking for in a job?"}], [{"date": "12 May 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Middle Tennessee State University", "Interview Descriptions": "I was asked to teach, demonstrate research, etc. It was pretty conventional for an academic job interview. There was nothing strange or unusual about it. I don't have much more to say.", "Interview Questions": "N/A"}, {"date": "19 Sept 2015", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Jul 2013", "Interview Descriptions": "Applications can be sought out from the housing office. Mail in or take the app to the office. The apps are reviewed and selected based on background in customer service and/or clerical work. Students with higher GPAs are sought after more than students with lower GPAs.The interview was in the month before classes began. It was a one-on-one interview with the director of the residence hall.", "Interview Questions": "What are your thoughts on customer service?"}, {"date": "19 Jan 2014", "title": "Student Technology Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Jun 2013", "Interview Descriptions": "very simple, easy, and effective", "Interview Questions": "none really, smooth sailing questions"}, {"date": "1 Jun 2017", "title": "Instructor/Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Middle Tennessee State University in Jan 2013", "Interview Descriptions": "Competitive Application, Personal Interview, Recommendations primarily.  Hiring process incorporated irrelevant and highly time consuming steps. The state university outsources a staffing agency to prescreen applicants. The staffing agency is staffed itself with personnel that lacks solid professional and interpersonal skills. The staff was not comprised of good listeners and clearly demonstrated negative behaviors and attitudes. The interview process at the university was simple, clearly representing the expectations of the positions, and identified appropriate support structures.", "Interview Questions": "Scenario Decision Making tests"}, {"date": "8 Dec 2016", "title": "Student Orientation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Middle Tennessee State University in Oct 2012", "Interview Descriptions": "Video pre-screen; drew two questions from a bucket and answered them on camera. From there I was selected to come in to the office for an in-person interview that lasted about 20 minutes. The staff were very friendly and put me at ease right from the beginning. The questions are mostly geared towards learning more about you, your opinions about the university, and why you want to be an SOA.", "Interview Questions": "If you were giving a campus tour, where would you want to take someone?"}, {"date": "20 Apr 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Jul 2012", "Interview Descriptions": "Interviews at the Department, College, and Provost level.  Presentation was required at the department level to a class and panel.  Interviews with the dean and provost were fair and not intimidating.  Was asked about research and publishing activities and plans.  Department interview process included dinner with the faculty.  The process before the interviews took months, but once the interview process began, it went efficiently.", "Interview Questions": "What can you bring to the department with your specialty?"}, {"date": "27 May 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Apr 2012", "Interview Descriptions": "Phone interview with hiring committee.  Then in person interview with committee, chairperson, dean, and provost.  Also, presented for a class, had lunch at with committee and other professors at the cafeteria which was yuck.  Took the whole day.", "Interview Questions": "Very typical interview questions you can find in any book about the process.  Mostly about teaching philosophy, educational background, job background, other skills not needed for the job that might be of use later.  Also, they let me ask questions about their specific college and town."}, {"date": "4 Apr 2013", "title": "Event Foreman Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Middle Tennessee State University (Murfreesboro, TN) in Apr 2011", "Interview Descriptions": "Interview was easy, probably because i was already a student worker and knew the ins and outs of the facility.", "Interview Questions": "How would you mange supervisor criticism"}]]