[[{"date": "14 May 2021", "title": "Section Manager, Scheduling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Johns Riverside Hospital", "Interview Descriptions": "very professional, informative, and very easy to follow. instructions were clear and a link provided for direct reference if needed. HR representative knew his information and policies. The interview process defiantly swayed my decision-making. The director also knew her team and properly outlined what she was looking for.", "Interview Questions": "What task was a challenge in your current position?"}, {"date": "30 Mar 2021", "title": "Helpdesk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Johns Riverside Hospital", "Interview Descriptions": "Friendly and the questions tested my technical skills. Answered some scenario based questions. Answered questions about my personality. They also wanted to know my willingness to learn and how I handle pressure situation. Overall great experience.", "Interview Questions": "How would you handle a doctor not having access to their records?"}, {"date": "12 Mar 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Johns Riverside Hospital", "Interview Descriptions": "Easy going, talked to nursing recruiter and director of nursing both personal and easy to talk to. I felt a connection with them right away. They seemed like they will be supportive throughout my time here.", "Interview Questions": "How did I deal with a conflict with a coworker?"}, {"date": "27 May 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Johns Riverside Hospital (Yonkers, NY) in May 2020", "Interview Descriptions": "Very quick, no actual questions, straight forward. I just talked about my experience working in a different pharmacy setting and about how I can contribute to this workforce. Interview is very short and easy, mostly a walkthrough of expectations as a pharmacy technician.", "Interview Questions": "No actual questions other than: “Do you have any questions?”"}, {"date": "28 Aug 2020", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at St. Johns Riverside Hospital (Yonkers, NY) in Jul 2019", "Interview Descriptions": "You meet with head of financial and  manager for about a one hour interview. Then the wait was a bout 2 days to hear. Then if hired you go to orientation then you start.", "Interview Questions": "What did you do in your previous job"}, {"date": "28 Feb 2019", "title": "Unit Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Johns Riverside Hospital (Yonkers, NY) in Feb 2019", "Interview Descriptions": "First I interviewed with HR and then I went up and interviewed with the Nurses manager. Interview was very brief they didn’t ask much. Waiting on a call back letting me know whether I got the job or not.", "Interview Questions": "Tell me about yourself?"}, {"date": "6 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Johns Riverside Hospital (Yonkers, NY) in Sept 2018", "Interview Descriptions": "Initially I met with HR representative, for about 15 minutes. After that I was then taken to meet with the department admin and hiring manager. I sat with both people who then asked a few questions, as well as gave me a detailed rundown of their unit. They both were very upfront in regards to shift availability, orientation, and travel being that the hospital is in Yonkers.", "Interview Questions": "Why are you interested in this speciality ? "}, {"date": "3 Dec 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Johns Riverside Hospital (New York, NY)", "Interview Descriptions": "The interview process was very unorganized. None of the standard interview questions were asked. The interviewer only discussed my resume with me. Two of the nurse managers I met with were not very professional, and didn't seem interested in interviewing me.", "Interview Questions": "Give an example of a time you maintained composure under stress."}, {"date": "23 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Johns Riverside Hospital (Yonkers, NY) in Aug 2015", "Interview Descriptions": "Took about a week and a half from the date of interview to when I received an offer, then two weeks to start. i interviewed with HR and then sent up to the floor supervisor. The interview was short and sweet and to the point.", "Interview Questions": "Where do you see yourself in five years?\r\nWhy do you want to work for us"}, {"date": "7 Jun 2015", "title": "Ccma Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Johns Riverside Hospital", "Interview Descriptions": "The manager and staff were professional and have deep interest and very knowledgeable about the company. The culture is one designed on teamwork and world-class customer-service-which fits my philosophy perfectly.", "Interview Questions": "How do you handle a coworker who seems upset?"}], [{"date": "4 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at St. Johns Riverside Hospital (New York, NY) in Jun 2014", "Interview Descriptions": "Sent the VP of physician services a copy of my resume. He called me within the week to schedule an interview. The interview process wasn't too difficult, although he did throw a couple of questions in there that caught me off guard.", "Interview Questions": "What are your weaknesses?"}, {"date": "13 Feb 2016", "title": "CRCST Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Johns Riverside Hospital (Yonkers, NY) in Oct 2012", "Interview Descriptions": "One on one interview. Received a phone call from the director of the department asking for an interview. Followed up a few days later to schedule and once interviewed got an answer on the spot and prepared for orientation.", "Interview Questions": "Do you think you are overqualified for this position?"}, {"date": "24 Aug 2015", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Johns Riverside Hospital in Feb 2011", "Interview Descriptions": "A brief yet thorough interview. Extensive background check and health screening. Received a brief tour of the facility at the conclusion of the interview. f f f f ff f f f  f f ff  f  f f ff  ff f", "Interview Questions": "Previous experience"}]]