[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great school to work in!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Jan 2015", "job_title": "Administration in Wayne, PA", "duration": "N/A", "pros": "Everyone that I work with have been very helpful and supportive. The kids that I see walking around campus are very courteous. They always addresses the staffs and visitors as \"ma'am\" or \"sir\". They are also very willing to help and assist. They offer a great benefit package to the employees and reasonable pay, considering that the school is non-profit. Great place to gain experience and for some, to be in a more well paced and laid back environment. Great work -life balance", "cons": "Non-profit organization means no room for advancement. Pay scale is not competitive with public schools."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Improving", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jun 2023", "job_title": "Teacher in Wayne, PA", "duration": "N/A", "pros": "Caring staff teachers and students", "cons": "Small number of staff overall"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Ooof", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 Oct 2021", "job_title": "Instructor in Valley Forge, PA", "duration": "N/A", "pros": "The campus is pretty, lots of old trees.", "cons": "The list goes on and on."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Very positive experience as a new teacher: middle school level", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Dec 2014", "job_title": "Teacher in Wayne, PA", "duration": "N/A", "pros": "The administrators and teachers were very nice. The food was great on campus. I made extra money working some of the banquets and special events. The uniform requirement lowered clothing costs. Many of the teachers lived on campus in nice apartments and lovely homes in a great public school district. Wayne is a wonderful town with lots to do. Lots of opportunities to be creative as a teacher; something I see less and less of in the public school these days with all the required testing. Great football and sports events. Benefits.", "cons": "I like teaching co-ed. The salary was fine for a starting teacher, or if you took advantage of the lower-cost family housing, but I left after 3 years and moved to a public school. The public schools in the area like hiring VFM teachers; they know how to keep order in the classroom. I am not a macho kind of lady and the atmosphere was pretty Male. Still, I found the administrative staff supportive. I only interviewed once with three people: two administrators and one teacher."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A Horrible Place To Teach", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jul 2009", "job_title": "College Professor in Wayne, PA", "duration": "N/A", "pros": "The best part about Valley Forge is its location.\r\nWayne is a great town with wonderful people, places to eat, and shopping.\r\nThis of course has nothing to do with Valley Forge Military Academy and College.\r\nThe best benefit of working there is living on campus.\r\nThis is a double edged sword however.\r\nIf you live on campus you must do community service-- basicly indendured servitude.\r\nThe area is VERY expensive to live in, and once you live on campus, you become trapped because no one teaching at Valley Forge can afford to buy or rent in the community on the salaries provided by the institution.", "cons": "The most frustrating part of working at the college (and the academy from what I hear) is being managed by an administration that is clueless about educational pedagogy and principles.\r\nThe administrators NEVER visit the classrooms and barracks.  They have convinced themeselves that they know their students and they have no idea that the school is largely filled with poorly educated young men (with some women) who have mastered the art of slacking.  \r\nThe standards at the school have declined consistently in the past five years, with valued, seasoned teaching staff leaving out of frustration.\r\nThere is NO respect for the teachers from the administration, and any attempt to question constantly changing policies can be met with dismissal. \r\nSince the administration has no clue about the students, they can't begin to address their REAL neads.\r\nIt's really a shame because the families of these students pay a lot of money, and the school could really be a great place to live, learn and work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "VFMAC", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Aug 2020", "job_title": "TAC Officer in Wayne, PA", "duration": "N/A", "pros": "-Teaching, advising and counseling high school and college students\r\n-Leveraging military experience at a school utilizing a military model\r\n- the focus is on character development for the students", "cons": "-job security is based on student enrollment \r\n-too much infighting amongst the staff\r\n-staff do not always lead by example \r\n-relevancy of military schools declining"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Professor", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Jan 2016", "job_title": "Professor in Wayne, PA", "duration": "N/A", "pros": "A 2-year school with military model  to educate students within an academic and military environment to transfer to academically competitive four-year colleges, universities, or service academies. It emphasize the character development, personal motivation and leadership of students. The school offers associate degrees.", "cons": "Small no. of faculty teaching various courses. The school depends mostly on student tuition."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "A \"Uniformly\" interesting experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Mar 2014", "job_title": "Academy Instructor in Wayne, PA", "duration": "N/A", "pros": "Great faculty\r\nFree lunch every schoolday at the mess hall\r\nBeautiful campus\r\nWonderful traditions", "cons": "Administration quite disorganized -- just as you might imagine the Pentagon to be.\r\nMost everything is \"last minute\" notice\r\nIf you don't like wearing uniforms to work, you won't want to teach here (I enjoyed it)\r\nNo endowment (except real estate) -- runs on a shoestring"}], []]