[[{"date": "22 Jun 2019", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at El Paso Community College (El Paso, TX) in Jun 2018", "Interview Descriptions": "Was asked questions about how to solve simple problems such as explaining fractions and other mathematical concepts. Answered questions from a supervisor, a Lab Assistant, and a faculty member from the Math Department.", "Interview Questions": "How would you explain adding 1/2 + 1/4?"}, {"date": "14 Nov 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at El Paso Community College", "Interview Descriptions": "Came in, went over my CV, and my credentials. We spoke about possible growth opportunities and at the end they offered me a job and told me possible classes I could teach.", "Interview Questions": "What would you do differently to get across to the students"}, {"date": "19 Sept 2017", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at El Paso Community College (El Paso, TX) in May 2017", "Interview Descriptions": "I met before a  panel  and was asked about my experience and credintials.  I provided copies of all my instructor certifications and was evalutated on my teaching and presentation skills.", "Interview Questions": "How long have I been teaching."}, {"date": "1 Apr 2016", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at El Paso Community College", "Interview Descriptions": "The application was the longest part of the process. The interview was thorough but very comfortable.  It's important to know why tutoring is something you want to do beyond just a paycheck. It seems that the employer is looking for people who genuinely care about helping others more than the expertise in skills.", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "17 Aug 2016", "title": "Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at El Paso Community College (El Paso, TX) in Apr 2016", "Interview Descriptions": "All previous work experience and job evaluations and student evaluations are discarded once you hit the interview step. Then they have a committee of discipline peers, if you have had a problem with any one of them in the past you can write off your career there. Even if it wasn't your doung, very very political. They hire who they like, not who is most qualified.", "Interview Questions": "What is the College's Mission Statement?"}, {"date": "7 Jan 2020", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at El Paso Community College (El Paso, TX) in Mar 2016", "Interview Descriptions": "We went over the resume, and the interviewer asked questions of a future career. I expressed my interest in science and current or previous experience of my laboratory work even though most of it was done during class.", "Interview Questions": "Why did you apply for this position?"}, {"date": "6 Sept 2015", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at El Paso Community College (El Paso, TX) in Jul 2015", "Interview Descriptions": "Panel interview... good panelists, same questions for each person, great interaction with the panel, ability to discuss your own strengths, they had knowledge about the program, they were all familiar with those selected to be interviewed.  They were friendly and open and not standoffish.  The college took too long to pick the finalist for the interviews.", "Interview Questions": "Knowledge about budget"}, {"date": "14 Nov 2014", "title": "Administrative Office Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at El Paso Community College", "Interview Descriptions": "Group interview, ask very basic questions. The only way you actually get hired is if you know someone and they already have you in mind to hire you. It doesn't ,after how much you know, that will not get you the job.", "Interview Questions": "I really wasn't asked one. "}, {"date": "16 Sept 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at El Paso Community College (El Paso, TX) in Aug 2014", "Interview Descriptions": "Very laid back. Questions about what's your favorite subject in biology and if you're willing to grade when needed.  5 professors in the committee and they all ask academic questions.", "Interview Questions": "Favorite subject in biology. "}, {"date": "3 Sept 2015", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at El Paso Community College (El Paso, TX) in Jun 2013", "Interview Descriptions": "Supervisor talked to me about the work responsibilities, what I was going to do, he asked me about my knowledge using different computer programs. I talked about my customer service experience.", "Interview Questions": "How familiarized are you with EPCC?"}], [{"date": "27 Feb 2013", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at El Paso Community College in Oct 2012", "Interview Descriptions": "I received a work-study position under the dean of arts. My immediate supervisor was very pleased with my work ethics and values that she recommended to apply to the school once an opening becomes available. My supervisor called me when the position was available. I interview with the department supervisor and one week later, I was hired.", "Interview Questions": "No individual question, but I was required to write a paragraph to demonstrate my knowledge."}, {"date": "4 Sept 2015", "title": "STS Peer Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at El Paso Community College (El Paso, TX) in Jun 2011", "Interview Descriptions": "The process was fairly easy. I was asked to wait in a small conference room and four managers walked in and sat across from me and each person asked me a couple of questions. The were all very friendly and all college students as well which made it a little less intimidating. The explained what STS was and that it was only a part time job for students at that particular college and asked if i met the requirements before asking me basic interview questions.", "Interview Questions": "Why do you want to work for us?\r\nSituatonal questions."}]]