[[{"date": "3 Apr 2023", "title": "Lead Cashier Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX)", "Interview Descriptions": "Applied online three weeks later had an interview. Interview was with 3 people. Pretty generic questions. Mentioned about my experience. They asked me about 8 questions. Interview took about 30 mins. Pretty casual", "Interview Questions": "Tell me about your experience?"}, {"date": "9 Aug 2022", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Aug 2022", "Interview Descriptions": "Interesting typical questions that are asked in an interview. Everyone was respectful and professional and HR was present. The interviewers were very nice and were easy to talk to it made the interview process very easy and before I knew it 45 minutes have passed. Very precise with communication you will receive emails along with phone calls.", "Interview Questions": "What are your professional goals for the future? "}, {"date": "15 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "The interview process was very easygoing and was straightforward. Got a wide selection of labs to join and was free to make a choice from there. The interview process was the easiest part of the application.", "Interview Questions": "What is the field you most want to work in?"}, {"date": "26 Nov 2021", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "It was virtual and dam easy. They wanted to hire someone immediately and offered me, as they won't find people to work for them. They don't value the talent  and exprience", "Interview Questions": "don't remember now the questions that were asked "}, {"date": "3 Oct 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "I felt like one of the panelist was only listening for something that might disqualify me.  Some of the questions he asked, hinted that he didn’t listen to my earlier questions. He seized on “What’s your weakness?” type question, and the other panelist (who was very pleasant) had to correct him. Additionally, they said the role had to be filled right away. When I followed up a few weeks later they said they were still interviewing people. Never heard back.", "Interview Questions": "If I were to call your old supervisors what would they say about you?"}, {"date": "17 Sept 2021", "title": "MHC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "Easy and good communication throughout the process.  Be prepared to negotiate salary as they are trying to save money so understand your worth.  Use applicable past experience to present to them especially related to clinical examples", "Interview Questions": "What is your experience with medical records "}, {"date": "9 Jun 2021", "title": "Coding Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "Submitted resume, a week later got a call to interview. Went in for meeting and they ask basic interview questions. Want to know how much you know when it comes to coding.", "Interview Questions": "Why did you leave your last job?"}, {"date": "2 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Feb 2020", "Interview Descriptions": "The interview process was very smooth. They truly want to know who you are and what you can contribute to the institution. My interview was online and I had no technical issues.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Aug 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Jul 2019", "Interview Descriptions": "No interview needed, just an application that was reviewed by the faculty and staff. A standard resume will do just fine for the process but it does take some time to hear back about employment.", "Interview Questions": "They asked me to provide a resume. "}, {"date": "28 Nov 2018", "title": "School of Medicine Administration Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 months. I interviewed at Texas Tech University Health Sciences Center (Odessa, TX)", "Interview Descriptions": "The interview for the position at the Permian Basin was a little awkward. There was little structure to the interview, they stated they just wanted to talk and get to know me. This threw me off as I was ready for a typical structure of question and answers. When I gave answers with examples to past interactions with students, they seemed uninterested and dissatisfied with the way I was conversing. I got the job in the end, but the overall attitude of the hiring committee was a bit strange and to this day I have yet to figure out what they would consider a satisfactory interview.", "Interview Questions": "Are you looking to further your education?"}], [{"date": "18 Dec 2018", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Aug 2018", "Interview Descriptions": "The interview was conducted by a panel of three. Each person took a turn asking questions and recorded my responses. The interview took about 30 minutes. I was also asked how I would increase interest in TT with the Asian American demographic.", "Interview Questions": "I was asked about my experience with reviewing student applications. "}, {"date": "7 May 2019", "title": "Medical Research Technician III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Aug 2017", "Interview Descriptions": "The interview itself was pretty standard if not easy, the lady was very nice and appreciated questions from me. The problem was that after my interview in late August and a letter of offer shortly thereafter my first official day wasn't until the second week of October - I'm not sure if this was a systemic issue or one with the lab I applied to though.", "Interview Questions": "How could I contribute to their lab and what do I see myself getting out of my time in their lab."}, {"date": "16 Dec 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Aug 2017", "Interview Descriptions": "In my case all was made by email\r\nQuick responses\r\nIn general it was an easy process\r\nAll the requirements and steps are pretty straight forward\r\nEverything will depend on your experience and the funds available", "Interview Questions": "Describe your proposed research program that you would like to develop here at TIEHH. Use your experience with plastics as an example, that will inform us on what you may be looking at for your future research. Within this, describe the synergies your proposed research has with other faculty member’s research here at TIEHH"}, {"date": "28 Jun 2017", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Texas Tech University Health Sciences Center (Abilene, TX)", "Interview Descriptions": "Responded to email postings for the job by submitting a declaration of interest and resume. After approximately one week, I was asked for my availability to attend an in-person interview. Thirty minute in-person interview by two faculty/staff members following a questionnaire sheet containing personal and work questions as well as your solutions to hypothetical scenarios.", "Interview Questions": "If you are invested in a large project such as a grant application and a faculty member suddenly approaches and requests you to handle a task such as reviewing papers or attending a recruiting event, how well could you adjust to their request."}, {"date": "8 Jan 2020", "title": "Business Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Dec 2016", "Interview Descriptions": "Straight forward, they first called to set the interview which included all senior directors and management director, the interview was roughly 30 minutes, then got another phone call for temporary offer based on background check (this was after the references were verified). After the background test was verified, official offered was accepted", "Interview Questions": "experience, education, skill for the job"}, {"date": "21 Nov 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Sept 2016", "Interview Descriptions": "Applied online, the process took 2.5 months from date of application to hiring date. I interviewed at Texas Tech University Health Sciences Center (El Paso) in Sept. 2016. The process consisted of an interview and a few follow up calls.", "Interview Questions": "Group Interview with the supervisor and PI of the project. Few questions on prior research experience, research interests, and coordinating experience. Additional questions related to experience with evaluation materials, data analysis, and leadership/coordinating style."}, {"date": "14 Jun 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Texas Tech University Health Sciences Center in Jan 2016", "Interview Descriptions": "It was easy and the interviewers made it very comfortable. The panel of scientists were very understanding and asked questions specific to the position. It was a very pleasant experience.", "Interview Questions": "Why do want to do a PhD ?"}, {"date": "26 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 10 months. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Jan 2016", "Interview Descriptions": "A group of 6 tenured professors. Video then in person. They flew me out and paid for hotel stay. The application opened in June submission due by November. First contact was in February. 2 weeks later I was interviewed in person by a panel. Then individually. It took all day.", "Interview Questions": "Why did you go into this field? "}, {"date": "17 Apr 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Dec 2015", "Interview Descriptions": "Hiring process took about two months. I wasn't actually told I was selected for the position. I found out after calling and asking for a status on my application. Interview questions were basic and easy to answer.", "Interview Questions": "Questions were easy"}, {"date": "19 Nov 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Texas Tech University Health Sciences Center (Odessa, TX) in Nov 2015", "Interview Descriptions": "Interview was two parts, back-to-back. Interviewed with the head of the department first. He asked great questions, all to identify conceptual overview of me. Interested in my ability to develop relationships, a key part of this position.\r\nThe second part of the process, I was taken to a different room to interview with the person currently performing the position and the Assistant Dean of the department. They asked more questions, getting to know me, and gave me the opportunity to ask them questions as well. The part that I was trying to determine was more about the job (initial description was very concise and limited) and what skills would be the best to possess to make me successful in that position.\r\nAt the end of this interview process this day, I was told the rest of the process, which includes visiting again a possible two more times, and then they were hoping to be able to make a decision.\r\nIt was a positive experience overall, and I have completed step one. The folks I interacted with seemed very pleasant and genuine.", "Interview Questions": "Tell me about your relationship building skills, how do you collaborate with others?\r\nDo you enjoy numbers and details? Do you get lost in the details?\r\nWhat made you decide to apply for this position, what interested you in the description?"}], [{"date": "30 Jul 2015", "title": "Unit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Jul 2015", "Interview Descriptions": "I applied on-line by creating a profile on their site. I  uploaded my resume and cover letter and answered some questions. They called me the next day to set up an appointment for an interview the following Friday. The interview was short about 25 minutes.", "Interview Questions": "Describe yourself?"}, {"date": "30 Jun 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Texas Tech University Health Sciences Center (Amarillo, TX)", "Interview Descriptions": "Submit application for graduate admission. If you are selected for the position then admission board will interview you. They will ask you about basic things relevant to your work. After finalizing everything they will finalize your recruitment process and offer you the position.", "Interview Questions": "Why do you like this organization? What is your expertise? If you have any conflict with supervisor how will you manage?"}, {"date": "19 Jun 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "After initial email exchange, it was a phone interview. It was 1 h long, focused upon my background, technical skills, my personal and social skills, past achievements, why I left particular program etc. I also got to meet lab members, projects undergoing in lab and project I was suppose to work on.", "Interview Questions": "What you expect to get out of this opportunity?"}, {"date": "5 Jun 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in May 2015", "Interview Descriptions": "No interview process. professors decide whom to give job and very biased. Bad experience of faculty. They do partiality. Not good staff. They have all rights to spoil a students career and they usually do to whom they dont like personally. Would not recommend this department. Many international students and locals and they do not treat good.", "Interview Questions": "no question is asked and lacks professionalism"}, {"date": "30 Oct 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Texas Tech University Health Sciences Center (Amarillo, TX) in May 2015", "Interview Descriptions": "Very laid back. I met with the DON and the shift supervisor. The DON had his feet up on the desk while drinking coffee, and asked more friendly questions. The shift supervisor asked questions about my experience.", "Interview Questions": "How do you feel about promptness"}, {"date": "25 Aug 2014", "title": "IT Support Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "I had 2 interviews before I was hired, not that difficult at all. They asked questions and it was answer and move on to the next interviewer. It was a good and easy experience.", "Interview Questions": "If you were an animal, what kind of animal would you be and why?"}, {"date": "15 Jun 2014", "title": "Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Texas Tech University Health Sciences Center", "Interview Descriptions": "I applied online and got a call a few weeks later to interview that week with the unit manager and director. They were very polite and the questions pertained to managing schedules. I got to interview a second time with a physician and was asked specific questions pertaining to my experience.", "Interview Questions": "The most difficult question was the usual of how did you handle a difficult situation in your previous work experience."}, {"date": "20 Oct 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Tech University Health Sciences Center in May 2014", "Interview Descriptions": "Online Application and Interview. I applied for the job through an online website which is maintained by the university. After my application was reviewed, I was called for an interview.", "Interview Questions": "N/A"}, {"date": "18 Dec 2013", "title": "Residency Unit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Nov 2013", "Interview Descriptions": "Phone interview followed by face to face interview about a week letter", "Interview Questions": "Most questions were easy to answer"}, {"date": "13 Jul 2015", "title": "Unit Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Texas Tech University Health Sciences Center (Odessa, TX) in Oct 2013", "Interview Descriptions": "5 minute interview, softball questions like what classes I took in college and if I planned on continuing education. They were very blatant in telling me that I would never get rich here. They were right but they offer great training and experience as a springboard.", "Interview Questions": "Do you know what HIPPA is?"}], [{"date": "13 Jul 2013", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Jun 2013", "Interview Descriptions": "The interview was a joke. It was obvious that whoever wrote out the interview questions had a very limited, if not nonexistent, knowledge of the English language. Two of the three interviewers could barely speak English and only did so with an extremely heavy accent to the point that I had to repeatedly ask that the questions be repeated.", "Interview Questions": "N/A"}, {"date": "28 Apr 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Texas Tech University Health Sciences Center (Abilene, TX) in Dec 2011", "Interview Descriptions": "Initial communication was through email followed by a personal interview which included a presentation and critical review. Then a personal interview with the immediate supervisor and it was done. The talks were mainly about the research and the direction in which the lab was moving. This included the  future work of the lab if appointed.", "Interview Questions": "comfortable with animal research"}, {"date": "19 Jul 2015", "title": "Administrative Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Texas Tech University Health Sciences Center (El Paso, TX) in Nov 2011", "Interview Descriptions": "Similar to other higher academic medical facilities.  First interview, then second interview should you be selected to proceed.  After second interview, was offered job position.  Very friendly.  Very professional.  Very interested in helping me to feel comfortable.", "Interview Questions": "Standard interview questions."}, {"date": "27 Nov 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Jun 2011", "Interview Descriptions": "For my interview process, all I had to do was fill out an online application. Then after about a week I got a phone call to have a face to face interview the following day. The interview was simple and basic.", "Interview Questions": "I was asked if I was willing to work during the holidays."}, {"date": "12 Feb 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Sept 2010", "Interview Descriptions": "An open job interview is an interview for employment where companies accept job applications during a ranges of times when all applicants who are interested in applying can attend. The company conducts on-the-spot interviews rather than scheduling individual interview appointments with candidates. If the company advertises open interviews, this will be the first step in the interview process.", "Interview Questions": "A screening interview is a type of job interview that is conducted to determine if the applicant has the qualifications needed to do the job for which the company is hiring. A screening interview is typically the first interview in the hiring process if the company does not start with open interviews."}, {"date": "16 Sept 2012", "title": "Patients Services Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Texas Tech University Health Sciences Center (Lubbock, TX) in Oct 2008", "Interview Descriptions": "The hiring process for the initail application was online.  I then received a phone call for an interview.  Had a one on one interview with the administrator of the department of Ob-Gyn, then received a phone call back with in a few days.", "Interview Questions": "Well we all have them, but I feel speaking about your faults is a hard question."}]]