[[{"date": "25 Aug 2022", "title": "Quality Improvement Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHAS Health", "Interview Descriptions": "I was contacted by email a few days after I submitted my application. Scheduled an interview for the following week. Was interviewed by three employees. Required to do a 5 minute presentation on a data set that had been emailed the week before. Overall really enjoyable experience! It’s apparent from the employees how much they love working for Chas.", "Interview Questions": "Describe a time you were faced with a challenge in the workplace and how you overcame the challenge. "}, {"date": "24 Aug 2022", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CHAS Health", "Interview Descriptions": "Interview with panel of directors - no phone screening process then you wait to hear from a recruiter that delivers the decision with no feedback. Each one takes a turn at asking a question and there’s little discussion outside of those questions. They schedule all of their interviews back to back.", "Interview Questions": "Behavioral examples. Challenges, difficult employees, lead a change"}, {"date": "13 Oct 2021", "title": "Student Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at CHAS Health", "Interview Descriptions": "There were 3 people questioning you and asking you how you would react in certain scenarios as well as customer service questions  Commonly asked questions, as reported by candidates\r\nGive us an example of a moral dilemma you faced at work in the past.\r\nWhat is the last book you read?", "Interview Questions": "What was the last book you read? "}, {"date": "18 Nov 2020", "title": "Centralized Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CHAS Health", "Interview Descriptions": "It was smooth and they are very open in their communication and quick to respond to any questions or concerns. They do a panel interview not just a one on one", "Interview Questions": "Various kinds of questions about work "}, {"date": "26 May 2022", "title": "Workforce Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CHAS Health (Spokane, WA) in Nov 2020", "Interview Descriptions": "The interview process was transparent, efficient, and fair. The interview panel was friendly and informative. I have no complaints. It was clear to see that CHAS is a great organization to work for.", "Interview Questions": "What do you know about CHAS Health?"}, {"date": "4 Sept 2020", "title": "Front Office Agent Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CHAS Health in Aug 2020", "Interview Descriptions": "I applied online and was contacted for an interview a week later. The interview felt very impersonal and it almost felt like they didn't even look at my resume beforehand. They didn't ask at all for me to tell them about myself or my past employment. They only asked about 5 customer service questions and a couple out of the blue questions. Overall, the interview was uncomfortable and they didn't give me a chance to talk about who I was or my prior experiences.", "Interview Questions": "If you were a superhero what power would you want to have?\r\n"}, {"date": "31 Oct 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CHAS Health (Spokane, WA)", "Interview Descriptions": "Submitted application online. Received a call by the end of the week for an interview the following week. First round interview was a panel of three people. Received a request for a second interview with the first and second line supervisor which was scheduled for the next day. Heard official decision the following week after a follow up email.", "Interview Questions": "General questions speaking to how I met the job description. "}, {"date": "26 Sept 2019", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at CHAS Health (Spokane, WA)", "Interview Descriptions": "Interview had normal questions and went smoothly. Really enjoyed my interviewers and the whole process. I went in prepared to talk about my strengths and weaknesses as well as answer common top questions which was definitely useful.", "Interview Questions": "Give an example of when you messed up and did you take accountability?"}, {"date": "18 Apr 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHAS Health", "Interview Descriptions": "After getting a quick call from HR, set up a video conference with several staff members. Friendly staff who each asked several commonly encountered questions and took time to answer my questions.  No tricky questions. No clinical questions.", "Interview Questions": "How do you keep yourself organized with a busy schedule?"}, {"date": "25 Sept 2017", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CHAS Health (Spokane, WA) in Sept 2017", "Interview Descriptions": "15 to 20 min interview with 3 people, the head pharmacist, the pharmacist support supervisor and the head of women and children's group.  Very straight forward questions and were very personable.  Professional but still had the ability to have humor.", "Interview Questions": "give an example of a time you showed exceptional customer service to a patient"}], [{"date": "21 Jul 2017", "title": "Desktop Support Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CHAS Health (Spokane, WA) in Jul 2017", "Interview Descriptions": "I was interviewed by 3 people initially, the IT Manager, Service Desk Manager and a Clinical Manager. The interview lasted about half an hour. They were polite, and it seemed to go well as they asked me back for a second \"getting to know you\" interview. The second interview was odd. It was about 10 people with 1 or 2 questions each and consisted of the original 3 plus the CIO, and several technicians. The questions were designed to get a feel for your character, I guess. They were off the wall questions and the CIO asked most of them. I think the second interview was a bit inappropriate and pressure is on when 10 people including the CIO are waiting for your answer. If you want to know about me and my work ethic, call my references, but they didn't do that as I called my references and they said no one called them.", "Interview Questions": "If you were a hot dog, would you eat yourself?"}, {"date": "9 Aug 2017", "title": "Service Desk Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CHAS Health (Spokane, WA) in Jul 2017", "Interview Descriptions": "Applied online and got called in for a first interview within the next few days. My first interview was with the IT Manager, Service Desk Manager, and Clinic Administrator. They were all very nice and friendly, asked pretty normal technical and customer service questions and it felt like it went very well. Got called in for a second interview and it was very strange and uncomfortable. 2nd interview was with about 10 IT staff members including the CIO, IT Manager, Service Desk Manager, and IT technicians each of whom were allowed to ask any question they wanted. Most questions seemed to be the first thing that popped into their heads, it was very awkward and most of the questions seemed to have no real purpose. After being asked to take time to come down twice and pay for parking I would have expected to at least get a phone call letting me know I didn't get the position, instead I received a very rude automated email which I was instructed not to respond to because CHAS was not monitoring responses to the email.", "Interview Questions": "A penguin wearing a sombrero walks through that door, what does he say and why is here? (Wait what....no clue where this question came from)"}, {"date": "9 Dec 2015", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at CHAS Health (Spokane, WA) in Oct 2015", "Interview Descriptions": "I interviewed with 3 people who asked me 4 questions each. They were distant and unfriendly. They asked the same 12 questions that everyone asks. They need to try to be more original. Ask something I haven't been asked since I was 16.", "Interview Questions": "They asked what sort of things I liked in management and what I didn't like."}]]