[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Medical Assisting", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2016", "job_title": "Medical Assistant in Denver, CO", "duration": "N/A", "pros": "They are a great company to work for", "cons": "I have Nothing to say negative about them"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not a good place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Feb 2023", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Friendly co-workers, good hours and location", "cons": "You had to lie to people to get their money"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Not so good", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 May 2021", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "Doing something I love doing", "cons": "The entire company is bad"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A career for the right people!  Valued employees, and opportunity for advancement!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "30 Oct 2013", "job_title": "Admissions/Recruiting Coordinator in Campina Grande, Paraíba", "duration": "N/A", "pros": "The culture at Heritage is one in which employees are valued and given the opportunity for more if they work hard.  Although there is a lot of structure, which most people mistake for micromanagement when it is in fact regulatory requirements, Heritage invests in its employees for the future.  Executive leadership targets up and coming employees, especially in Admissions, due to the fact that they learn structure and regulations as a part of their time learning the business.  The recruiting aspect along with learning time-management and organizational skills makes Admissions employees ideal for advancement opportunities.  The envrionment, however, is not for everyone.  The state and federal governments, along with accreditation guidelines, make the admissions department a managed place.  Scripts ensure compliance with regulations, many mistake the use of scripts as \"managment control\", when in fact there are greater reasons.  Admissions managers sit in on student calls and meetings to ensure Admissions employees are giving correct information to students; if the information is incorrect, a regulation could be compromised.  So, in short, current future employees won't have to look very far to see executive leadership that started as an Admissions Coordinator within a school.  I assure you, the grass is not greener.  Herirtage is an amazing place to work where hard-work is noticed and valued.", "cons": "Heavy regulation.  This has nothing to do with Heritage, and more to do with the compliance that must be achieved through strict process."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Truly building for tomorrow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Apr 2016", "job_title": "Faculty Instructor in Denver, CO", "duration": "N/A", "pros": "I can understand why some of the low reviews exist for Heritage. There has been a tremendous amount of change. I also have an appreciation for what Heritage College is trying to accomplish. When I compare my first day at work to now, the change is nothing short of compelling. The Heritage I started at a couple years ago had no direction and was just going through the motions of survival. Now I see that we are starting to get a clear direction on where we need to focus on helping our students achieve success. For the first time in a while, I understand my purpose, and what I need to accomplish when I arrive at work. I know the Heritage world doesn't evolve around me but thank you for including me on your team. Is Heritage perfect? Far from it but I am very appreciative of the direction they are starting to take.", "cons": "If you don't do well with change, this place probably isn't for you. I have been employed at other schools and one thing I can say about Heritage is that they do not have patience for laziness or bad habits that others bring from other schools. If change isn't for you and learning new things doesn't excite you, I would stay away from here because this place is probably not a fit."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Generic Education at a Premium Cost", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Dec 2013", "job_title": "Personal Trainer Instructor in Fort Myers, FL", "duration": "N/A", "pros": "As and instructor, it was great making a difference and being able to teach students in a way that would shape them to improve what I saw was wrong with the industry they were entering.", "cons": "The Micromanagement and \"Our way is the ONLY way\" mentality that management had was insane. Free thinking in an ever changing industry was prohibited. We were told what to teach the students and having discussions about new techniques that was more advanced than the mandated curriculum got me written up several times. \r\n\r\nThese poor students were promised the world by snake oil salesman disguised as \"admissions counselors\" only to find they were now going to pay $30,000 for a $3,000 education. \r\n\r\nI loved every minute in the classroom with the students but this place should be burned to the ground for shafting the people who came their in hopes of bettering their lives."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Aug 2016", "job_title": "Anonymous Employee in Fort Myers, FL", "duration": "N/A", "pros": "Unfortunately, I cannot think of any pros with regards to being an employee of this company.  I sincerely hope our students are successful in their program and with obtaining employment after graduation.", "cons": "It is important to note that within the Corporate office recently, the following individuals resigned and left their positions all in the same month: Controller, Director of HR (burned through 2 in less than 4 months leaving the company without an HR dept), Director of Financial Aid, National Financial Aid Rep., and the Academic Affairs Operations Manager.  These individuals were not only phenomenal at their jobs they were good employees to work with.  Due to these high level individuals leaving so close to one another, I am concerned about the direction Weston Educational is going.  Heritage is currently on financial warnings with the DOE and the Vet Tech program has been on probation with their accrediting body, AVMA.\r\n\r\nWith some bad players still in the top positions, those who are ethical and good are leaving.  Unfortunately, upon departure, the corporate office attempts to turn them into villains for whatever reason leaving those of us who know better, even more concerned."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Felt guilty every night knowing what I sold that day; did not believe in product at all.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Mar 2015", "job_title": "Admissions Coordinator in Mar del Plata", "duration": "N/A", "pros": "I was taught a lot about different sales tactics and closing procedures during the training week, but also it was really nice sitting down with people who were ready to make a change in their life through education.", "cons": "The hours were unbearable. There was no work/life balance what so ever. You were always expected to stay over your scheduled leave time and if you didn't, you were not considered a team player. I have never been one to complain about having to stay at work late, but there were evenings where I was leaving around 10pm (after the building cleaning crew had already come and gone).  I wanted to make a career out of this position because there seemed to be potential with the company, but the expectations were unrealistic and unethical."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "You did it!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "5 Nov 2016", "job_title": " in Teresina", "duration": "N/A", "pros": "They are closed as of November 1.  There are no longer any pros.", "cons": "The new regime managed to take a good, private, multi-state career college and run it into the ground in a matter of a year and a half.  The CEO and former COO should be ashamed of themselves.  They methodically fired any middle management that knew what they were doing, leaving the schools running with untrained and sometimes unqualified people.  From what I understand they did the same thing to a former employer, it just wasnt a school.  Running a restaurant chain does not qualify you to run a school.  They sure pulled the wool over Earl Weston's eyes or was that the plan all along?"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Worst Job Ever.  You'll be better off searching elsewhere.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Nov 2011", "job_title": " in Denver, CO", "duration": "N/A", "pros": "They did share their vision during the interview, and gave me a chance to meet many of the people I would be working with.  They make it seem like a family environment.", "cons": "By family environment, it means that if you don't \"drink the kool-aid\", you're not one of them and you won't last long.  They have no concept of work/life balance, and will expect you to work 7 days a week even if it's not doing the job that you were hired for.  Salaries were very low in our department, much lower than industry standards for equivalent jobs.  They are against providing training for professional development, in fear that you will use that training to leave and get a higher paying job.  Their way is the only way, as they ignored the many years of experience I had in my field and treated me like a junior staff member.  They documented every mistake I ever made, fired me, and used that to contest my unemployment."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Company doesn't Care about employees", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2015", "job_title": "Admissions Coordinator in Columbus, OH", "duration": "N/A", "pros": "The good thing is the company does believe in promoting within so it is easy to move up if you really want to, and the students make the day brighter.", "cons": "High turnover rate people come and go and management will tell you that everyone is replaceable. Staff will quit even if they don't have another job just because they just can't deal with it. The moral does vary from campus to campus because other reps at other campuses loved their jobs and we were miserable.  There is no FMLA at certain campuses so if you get sick or want to have a child you will lose your job. Admissions is all about the sale it doesn't matter if the student can't read or write as long as they can sit in the chair and collect the aid. They feed employees a dream about helping students but it is all about getting students enrolled and through the 3rd week of class."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Heritage Treats Employees Well", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Sept 2012", "job_title": "Manager in Denver, CO", "duration": "N/A", "pros": "I started at Heritage in 2004.  The company treats its employees fairly and pays them competitively.  Heritage offers all the advantages you would hope to find in a small company.  Employees form a tight-knit community and treat each other almost like family.  They take care of each other.  Heritage trusts and empowers its people.  The org chart is relatively flat and things don't get bogged down in bureaucracy.  I've never worked for any company that was so good about promoting from within.  The company believes in home-grown talent.  If you do your job well at Heritage, you can expect advancement.", "cons": "I'm sure I could quibble about a few things, but since this is my favorite job I've ever had, I honestly don't have much to complain about."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Perpetual frustration brought on by poor communication from upper management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Apr 2012", "job_title": " in Wichita, KS", "duration": "N/A", "pros": "Co-workers were great people to work with. Good company for person seeking entry level position only.", "cons": "Unrealistic expectations when it comes to \"finding jobs\" for graduates. And if you/your team don't meet company goals-you're not doing enough. Overall very poor communication and management by school director. Company expects you and your team to \"think out of the box\", but is not willing to hire and or pay for the proper talent. Upper management uses anyone they can as a scapegoat instead of taking responsibility for their short-comings. I could go on and on...."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Miserable Admissions Department/Standards/Tactics/Expectations", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Oct 2012", "job_title": "Admissions Coordinator in Fort Myers, FL", "duration": "N/A", "pros": "The school in itself has helpful departments and employees who are committed to helping students better themselves in academic and personal scenarios.", "cons": "The \"acceptance\" policy is non existent. This school accepts nearly everyone. The only way to get promoted is to use high pressure sales and harassment tactics to \"enroll\" and \"start\" students. There are scripts that are forced to be used verbatim when on the phone and meeting with students or you will be \"written up\". This place treats its employees and students like they are in day care. Phone calls are secretly recorded and upper management sits in with you while you meet with students to make sure you are following their scripted sales procedures."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "interesting", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Oct 2014", "job_title": "Instructor in Columbus, OH", "duration": "N/A", "pros": "Students are the best and make it worth while.", "cons": "Management and company growth is all talk."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "It is worth putting up with corporate greed and insincerity to help the students.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Sept 2011", "job_title": " in Jacksonville, FL", "duration": "N/A", "pros": "Very rewarding to help others and share knowledge with future professionals.", "cons": "Lack of direct communication from senior management to employees. A tendency to micro manage. Condescending treatment of students and employees by senior management."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Good for someone looking to put something on their resume.", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Feb 2016", "job_title": "Admissions Representative in Denver, CO", "duration": "N/A", "pros": "Pay is decent, my campus was a mess and very unprofessional. I hear that not all campuses are like this.", "cons": "Unprofessional, misleading to students, expensive for \"occupational associates\" degrees that mean nothing in the real world. Open enrollment is a joke!It sets the students behind. The place is consonantly under staffed and turn over was at 23 people while I was there in a nine month span."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Small Company, Big Values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Nov 2012", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Communication is highly important, follow through is incredible, the level of care for the staff and students is very inspiring. I feel a genuine connection tho this company and believe in their vision.", "cons": "Technology upgrades would be nice to help automate processes and improve oversight, functionality of reports."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Changing Lives and Improving My Community", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Oct 2014", "job_title": "Director of Student Records in Denver, CO", "duration": "N/A", "pros": "I've been with Heritage for over 15 years. The company began in the neighborhood and community that I grew up in. At that time the most of the community was comprised of minorities with a high school education level at best. It was the history and pattern of the community at that time to hopefully graduate high school or earn a GED, then join the work force at minimum wage and hope to provide for a family and build a future based off of that alone. Even most of the community elders were still working labor intensive jobs earning mediocre pay when most of them should have been nearing retirement. Not many finished high school, and even less were fortunate enough to afford a college education. \r\nAlthough in the early years Heritage remained small, the impact it had on the community was a huge one! Throughout the last 15 years I have watched so many people from my very neighborhood earn degrees and have actual careers rather than just jobs. Even when history and odds were working against them Heritage opened the door to possibilities that didn't exist for them in the past. While 15 years later both the neighborhood and the community have changed completely, so has the pattern of life and more important so has it's history. \r\nWorking for Heritage has been one of the most amazing and fulfilling experiences of my life. I am so proud to be part of an organization that truly does change lives, mine included.", "cons": "Being grouped by society as just another \"career college\". I believe that the experience, the people and the education our graduates walk away with put Heritage levels above the \"career college\" stereotype."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't work there!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Nov 2014", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "There are no pros to working at this place! Sure they promise you a lot, but they never do deliver!", "cons": "They are not very ethical. They are more about bringing bodies in the doors then actually educating people. This makes it really hard to be a good educator in there system.  They rather fire their knowledgeable educators and bring more admissions reps, them focusing on actually giving their students the best education. They also are not really that up to date on what the profession should really know out there in the fields, They will state that they are, but I can tell you that they are not."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Crackerjack College", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2016", "job_title": "Anonymous Employee in Wichita, KS", "duration": "N/A", "pros": "Most employees were great to work with.  Very Amicable environment", "cons": "Corporate either doesn't know or doesn't care about what's best for the campuses.  They over work their instructors with little regard for what's best for the students.  Corporate doesn't seem to care about retaining quality staff.  All they care about is getting warm bodies into the classroom to pay their tuition."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great opportunity for growth!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Oct 2014", "job_title": "Anonymous in Oklahoma City, OK", "duration": "N/A", "pros": "I have worked for this company for over 5 years and have always felt nothing but support and the ability for professional growth. Being able to work in the private vocational school sector allows us to change lives that otherwise would have been passed up by larger universities.", "cons": "As with any position your clients or customers can be challenging. I feel that teaching the students basic professionalism is key and can be a challenge with some of the more difficult students . However, knowing how go build rapport and gaining their trust helps in this process."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Everyone there is fun to work with.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "19 May 2011", "job_title": "Admissions Specialist in Jacksonville, FL", "duration": "N/A", "pros": "Good benefits and good pay.", "cons": "Their admissions process is shady and if you don't meet your sales numbers you won't get promoted. All the garbage talk they give you about how getting people to start class isn't the only thing that gets you promoted is crap; it's the deciding factor. You can do everything else great, but if that sucks then you're screwed."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This place is a career killer", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Oct 2014", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "free coffee, they let you wear jeans every now and then.", "cons": "you are not allowed to do your job to the best of your abilities, or to use your experience in your field to improve the place. After my initial on-boarding, I was advised not to make waves and try to change things. My job responsibilities were also switched after a few months, to something I was not experienced in, and I was subsequently fired after failing. You won't fit in unless you are a practicing Christian and unless you're ok with being micromanaged."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I've worked for Heritage for 13 years.....gets better every day.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "30 Sept 2014", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "I've gain great knowledge about the school industry and have been able to increase my skill set with the experiences Heritage has offered.  If I have had a family emergency or something personal to take care of my boss has let me do so.", "cons": "If you want to improve your knowledge bas, get a promotion and gain experience you need to put in the hours.  Can been long hours."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Instructor", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "10 Feb 2017", "job_title": "Anonymous Employee in Wichita, KS", "duration": "N/A", "pros": "The coworkers made this job and the pay was good for the field we were in as well as working one on one with the students", "cons": "Management was very hit or miss.  Direct management for some dept was very childish and worried about how duties effected them or if they had to do something they didn't want to do they made those under them do it."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Strictly suitable for beginners", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Dec 2008", "job_title": "Representative in Fort Myers, FL", "duration": "N/A", "pros": "If an individual wants to get their feet wet at an institute specializing in career education, this would be a good place to start in Southwest Florida, an area with very few career options within this career field.", "cons": "Heritage Institute is not suitable for mid-career individuals, and they seek and cater primarily to individuals with little or no experience to avoid paying higher salaries."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Very good", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Mar 2014", "job_title": "Admissions Coordinator/Director of Admissions in Jacksonville, FL", "duration": "N/A", "pros": "Heritage is a great place to work. Home office provides great support and as a whole the organization goes above and beyond to take care of their employees. There is room to grow and they love to promote from within.   If you are a hard worker and like to move up this is the company for you.", "cons": "Schedules are not 9-5 but this is what allows students from all times of day to get the support they need from various departments"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Work in Progress", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jun 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Fast paced, challenging work. Helping students achieve their goals at a tech school, management willing to discuss issues/opportunities. Fun environment usually", "cons": "There is an abundance of change, new leadership filtering in seems dedicated to improving the disaster it had been for years, which is promising."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Teachers provided excellent hands-on learning, feed back and follow-up for students.", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Aug 2014", "job_title": "Anonymous Employee in Manassas, VA", "duration": "N/A", "pros": "Corporate offered fabulous hands on training; informative and helpful when assistance is needed.  Diversity in instruction was available and delivered by teachers to ensure all types of learning were addressed.", "cons": "Director/Manager of out of state campus should provide positive support and enthusiasm toward co-workers; take responsibility for actions displayed and display professional mannerism towards students and workers."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Middle Manager", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Nov 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Worked with some nice people.", "cons": "I worked at Heritage for 6 years.  The school has been a disorganized mess for years.  The new management wasn't able to turn it around and probably should have closed the school 2 years ago.  The lawsuit didn't help and accusations of grade changes and firing employees that reported the grade changing was a stupid and awful HR move."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't Work here", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Oct 2016", "job_title": "Anonymous in Kansas City, MO", "duration": "N/A", "pros": "Great people to work with \r\nStudents have inspired me", "cons": "Lack of communication from Corp to management in all campuses. Bills are not being paid making it hard to do business and vendors don't trust us. They let anyone in and corp or management doesn't follow their own policies. The lack of payment to vendors have now gone to no payment for employees making it a hostile work environment."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Company to Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Oct 2012", "job_title": "Admissions/Recruiting Coordinator in Denver, CO", "duration": "N/A", "pros": "Great people to work wit and a very friendly enviroment. Growing company with oppurtunities for advancement if you work hard. I have been with Heritage going on 2 years and have been promoted several time and really enjoy working for a company that rewards its employees. Good benefits and competitive pay. Also very reward to help others get their education.", "cons": "Schedules can vary sometimes, but management does a good job working with you to make sure you are happy."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Experience!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Jul 2015", "job_title": "Admissions Coordinator in Wichita, KS", "duration": "N/A", "pros": "None! You think you're helping students get on path with a positive change in their lives. Unfortunately, this is not the case.", "cons": "This place is a degree mill. No one cares about these students or their futures. This company is simply preying on a specific demographic that doesn't understand that this really is not a college. This is a business. A money hungry business.   \r\n\r\nHeritage claims that they are accredited, but not by the Higher Learning Commission. Students, good luck finding a job after \"graduation\". \r\n\r\nAs an admissions counselor our only job was to harass students! All calls you receive and make are monitored by your boss and the corporate offices. You follow a script word for word, and if you get off the script even a bit, you are reprimanded.  When students come in to meet with admissions, you also follow a script - same story, you cannot go off topic in any way. God forbid you make a bit of small talk with these students. Management is awful. My supervisor's main purpose is to stalk you on the job and ensure that you are following each script word by word. \r\n\r\nThere is also no work/life balance. Many times I went into work at 8 am and I left at 9 or 10 pm. If you don't have a certain number of students enrolled that day to ensure you meet the expected quota - you are EXPECTED to stay until you have booked appointments for the following days to come. \r\n\r\nManagement micromanages so much that our team was even critiqued down to the angle we sat during our student appointments! I was not allowed to have a picture of my family or loved ones on my desk. When I had to use the restroom I was always asked where I was going. This place is a nightmare. \r\n\r\nThis place makes me sick. I felt guiltily every night when I went home, I was selling lies to each student that I had harassed over the phone just to get into that place."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Excellent work environment!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Oct 2013", "job_title": "Anonymous Employee in Fort Myers, FL", "duration": "N/A", "pros": "The staff feels like family. It provides the opportunity to better people's lives. Clear expectations for employees. Good pay for entry level. They care about their employees and students.", "cons": "Sometimes the workload can be heavy, especially when first starting. Micromanagement can become cumbersome at times. Strict adherence to corporate policy is enforced without question."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not a good environment", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Oct 2015", "job_title": "Anonymous Employee in Jacksonville, FL", "duration": "N/A", "pros": "Teaching students who are there to learn\r\nBreaks\r\nNice coworkers", "cons": "High turnover rate\r\nvery poor management\r\nlittle to no class supplies\r\nenroll any and everybody into the school, some students have come their drunk and high, management didn't do nothing when it was reported. One student actually hit and ran the vehicles in the parking lot, management didn't do nothing. This puts people at risk.\r\n\r\nWill fire 3-5 employees one week and replace the office with a new staff the next week, then will fire the new set and replace over and over again.\r\n\r\nUnprofessional ways of handling certain situations. Instructors receive no support from upper staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Beginning teachers only", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 May 2014", "job_title": "Massage Instructor/Program Manager in Denver, CO", "duration": "N/A", "pros": "40+ hours a week, plus good benefits", "cons": "Pay rate stays the same can't make over 20 an hour when going rate for teachers is a minimum of 30/hr. Very restricted, no creativity allowed. Teachers are not rewarded, admin takes all credit and moneys for classroom education"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Instructor", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Feb 2016", "job_title": "Instructor and Student Services Coordinator in Haskell, AR", "duration": "N/A", "pros": "There are absolutely NON!!!\r\nDo not work here!\r\nRun for your life!!!\r\nThe worst place to ever work!\r\nHostile work environment!!!", "cons": "This is the absolute worst place I have ever worked....EVER!  Management brings you in their office and scream at you in front of students. The curriculum changes monthly. Instructors are asked to teach courses other than what they were hired for. I am an Anatomy and Physiology instructor and I was asked to teach Spa Principals. Yes, you read that correctly...Spa Principals. I was physically threatened by a student and management did not do anything."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay Away From Admissions!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Jan 2013", "job_title": "Admissions Coordinator in Denver, CO", "duration": "N/A", "pros": "I wish I could honestly say there were some pros, but it was the most miserable experience of my life.  I suppose the only good thing is you do get to meet some interesting people throughout the admissions process.", "cons": "Where to start....\r\nThe salary is extremely low and there is no commission or bonuses whatsoever even though it's a sales position.  We were required to constantly call and harrass people who visited the admissions office multiple times a day; in fact the location I worked in even required us to call from a cell phone that had the number blocked- this is completely unethical and unprofessional.  Most of the day I felt like a cheap telemarketer.  The management would mentally and verbally break you down by not meeting their enrollment goals even though several things were beyond our control for why somebody could not commit to starting school- here are a few for example:  People who lied about having a GED, people who were in student loan deferrment, people who simply could not afford $30,000 for a one year program, people who were smart enough to go to a community college for an equal program at a 10th of a price, people who went to prison... the list goes on and on.  Still, no matter what management will come back and say \"well you obviously didn't motivate them enough.\"  They always say motivating the unmotivated is very difficult which is true- we can't force losers to wake up one morning and be a different person when they have been a dead beat their whole life.  The hours were terrible too- if we were scheduled to work until 7pm and somebody showed up to the admissions department at 6:59 we had to spend the next hour and half with them regardless.  Rarely did I get out of there on time.  There is virtually no growth in this company either.  The stafff turnover is like a fast food joint.  We were required to use very strict scripts when interviewing potential students- I can't tell you how many times I was told that our questions were demoralizing and demeaning.  The micro managing is insane!  Management will listen in on your calls and sit in your office looking for any opportunity to cut you down even more.    This place is the most miserable place I have ever worked in my life.  I have even taken it off my resume as it is just an embarrassment that I actually allowed myself to work for a rip off FOR PROFIT joke of an institution.  My advise, stay away... you won't last long if you take the job."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "An unethical, unprofessional \"college\" - Stay away if you have a brain, integrity, or an ethical code", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jan 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "There are no pros to working here At All.", "cons": "I have never had to work in an environment where my job was taking advantage of needy people in the most disgusting way possible--and that is by taking advantage of their desire to improve their lives through education.\r\nHere are just a few examples of Heritage's unethical model:\r\n\r\n1. Hound anyone who has ever contacted Heritage (either directly, or by mistake) THREE times a day. This includes using a cell phone with different numbers in the hopes that they won't recognize the number and will pick up. Even if the person hangs up on you, you are instructed to continue calling...\r\n\r\n2. Handle direct questions, such as \"how much does it cost, or what is the program length\" with the most evasive answers possible. I was instructed to never give out any information and to find a way to \"take control\" of the call and get them to give you answers about their life and why they want this. IF they mention a program Heritage doesn't offer (music, being a barber) you are still instructed to try to get them to come in for a \"required information session.\" \r\n\r\n3. Same-day appointments are gold to this company, as they are with any sales... Get them while they are hot! Unfortunately, Heritage doesn't think there is any way someone could be serious about their education if they are not ready to drop whatever they are doing to come in for the \"required information session.\" After you get off these phone calls, you will be chastised about why you didn't do enough to \"motivate\" them.\r\n\r\nThe entire process is paternalism at its worst. The costs of the programs are asinine and most students realize this after doing more research and choose to go somewhere else where they won’t be saddled in $20000-$30000 of debt for a job that might only pay them $8 an hour. Of course, if the admissions rep doesn’t find a way to convince that student to choose Heritage, you have failed.\r\n\r\nI originally thought this job would be helping people to change their lives, but I found myself engaged in the sales job from hell—working with and for people with no integrity or respect. This job is an embarrassment to my resume and I can’t believe I even worked at a place who would treat people like this. Any time I had any questions about the rationale for the process I was basically informed to just do what I was told. If you have a brain, or an ethical code, or integrity, do not work here. The only people that can survive in this company are people who either have no idea of the recruitment process used, idiots who can’t think for themselves, or people without basic respect for other humans."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't walk, RUN FAR AWAY AS FAST AS YOU CAN", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Nov 2015", "job_title": "Registered Massage Therapist in Denver, CO", "duration": "N/A", "pros": "The students who wanted to learn, and nothing else", "cons": "Exactly as stated above, and if you are a teacher you know that 20.00/hr is very low pay for the job you are told to do, there is no one experienced in education there, only management/administration who prevents you from teaching, doesn't know how to teach teachers because they do not have any background in education whatsoever, and who is supposed to be there for the instructors but the instructors are looked at similar to housekeepers! No respect, no credit for the work they do, and don't even get introduced or to shake the hands of their students at graduation. At the school I graduated from, an independent school only costing 7000.00/ for 3 certifications, the teachers are respected and the staff is there to assist them in doing the best job they can to create a quality therapist, this school is owned by Weston Education and Steiner Cruise lines, and as stated above will take anyone who can sign their name!!! If they don't want to be there they will be pushed into it, if you can't teach them, it is your fault. I have had illiterate students who were not accepted at any other school forced into my classroom and was told it was my responsibility to make them graduate. I worked there for 2 years, and originally it was a great school, but the politics got in the way, the administration wanted to get rid of the leaders that were great for the students and put in place a pedophile who had taken one of my underage students to a bar to get her drunk and sleep with her, when she spoke up, he resigned so he would not get it on his record and I was fired for supporting her in reporting him. This school costs at least 20.000.00/ and the only thing it has over my 7000.00 education is a one week course in Psychology that is irrelevant to the fields of study and this allows them to charge for an associates which is non transferable to any other school. I can no longer teach for any school owned by Weston Education because I reported his behavior, and the victim of this crime was never compensated nor did she see him lose anything. He is still working as a therapist."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great People,Great Environment, Student Oriented College", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Oct 2012", "job_title": "Admissions Coordinator in Wichita, KS", "duration": "N/A", "pros": "Motivated staff, focused on the success of the students with their academic goals and career goals.\r\nDepartments work well together and emphasize on communication.\r\nDiversity in students backgrounds and employees backgrounds.\r\nPositive working environment.", "cons": "Outside world doesn't always understand what a career college is here for or are ignorant to the opportunities it can allow.\r\nOther schools have created a bad reputation for \"technical\" and \"career\" colleges"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "MT instructor", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Oct 2016", "job_title": "MT Instructor in Oklahoma City, OK", "duration": "N/A", "pros": "none, none, none, none, none......", "cons": ". \"where can I get copier paper\"? seems like were out in the back, here is where the payroll lady takes you in a back room shuts the door behind you and tells you how terribly unorganized you are?.. rather throw a fit than give you the paper or tell you where it even if  your new .. if you dont want someone treating you like your a child and acting like they are better than you,.. stay away..."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Worst job I have ever had", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Sept 2011", "job_title": "Admissions Coordinator in Denver, CO", "duration": "N/A", "pros": "The job can be rewarding by helping those in need of an education get enrolled.", "cons": "Severe micromanagment. My boss would be pacing my office door at 8am everyday. I was told that if I wanted to use the restroom or get coffee, I need to come earlier. Admissions Coordinators are glorified telemarketers. This is the worst place to work. Management treats employees like incompetent children. The only reason they promote people is to keep them there, as the work is terrible and turnover is extemely high."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poorly Ran, Poor Pay, Bad Morals. Professionals Steer Clear of this company!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jan 2014", "job_title": "Business Instructor in Denver, CO", "duration": "N/A", "pros": "Working out in the gym is free even though it about the size of a one car garage.", "cons": "Director of Education was a fitness instructor with no education and the  previous one that hired me was a massage therapist who was fired before I even started.\r\n\r\nHire young people fresh out of school to teach classes that have no \"real world experience\".\r\n\r\nAdministration will try to bully instructor to pass student that have failed or did not even come to school the entire semester.\r\n\r\nThey will try to write up instructors because a student sneaks a can of soda in class and you did not see it. Does not sound like college to me.\r\n\r\nSplit shift work in morning and have to come back at 4:00PM. So you get to fight rush hour in the morning, evening and at night for about 16$ per hour.\r\n\r\nThe place is cultish in how it treats people and some staff will gang up on other staff. The only thing that saved me was that I was male with more education and experience then the wannabe bullies in the place.\r\n\r\nHeritage College does not look good on a resume if looking to teach college since it is a laughing stock in regards to higher education.\r\n\r\nDo you the people in the crowd on Jerry Springer Show? That will be your students with all their problems, baby mamas, loser boyfriends and everything else that makes for a dysfunctional environment.\r\n\r\nI was called into the fitness instructor oops I mean Director of Educations office for refusing to pass a student that never came to class and they accused me of some weird allegations about refusing to enforce rules that I supposedly said to a student. I went home and next day told them I would not be back. \r\n\r\nI must admit that Heritage College was the worst place I have ever worked and I really thought it would help to get a position instructing at the college level, but found out it was of know value in terms of higher education employability.\r\n\r\nDenver site is very junky, out in the boondocks.\r\n\r\nMy current position is a Program Manager and issues I reported are the \"God's honest \"observation in my four months as an employee.\r\n\r\nThe five stars ratings are from management.\r\n\r\nThey change staff daily at this place because of the work environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Has anyone noticed?", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Oct 2016", "job_title": "Anonymous Employee in Indianapolis, IN", "duration": "N/A", "pros": "This used to be the best most rewarding place to work! We were successful.", "cons": "Anyone else notice since they released all of the DIrectors and DOE's that this company has went downhill at a super fast speed. Apparently they were doing their jobs right since the company hasn't been right since!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "People helping People", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Dec 2015", "job_title": "Personal Fitness Training Instructor in Columbus, OH", "duration": "N/A", "pros": "Changing lives in a friendly environment. All of the staff is wonderful and helpful. The curriculum is great and the students are inspiring.", "cons": "No conns that I can think of. Staff more rather than less. Ensure the staff has a thorough support system."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "An OK place to work.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Oct 2013", "job_title": "Senior Admissions Coordinator in Kansas City, MO", "duration": "N/A", "pros": "Friendly co-workers, good learning experience, great Admissions Director, decent first time job", "cons": "Long hours, little respect from corporate in Denver, focus on pushing students to enroll and not actually helping them to succeed, have to harass potential students"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Very Demanding Job", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 May 2015", "job_title": "Anonymous Employee in Jacksonville, FL", "duration": "N/A", "pros": "Loved working with students and helping them better themselves through education", "cons": "The schedule was very demanding and overtime was almost required. You were expected to put this job before everything, including your family and health."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "I loved working there!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Oct 2014", "job_title": "Medical Assisting Instructor in Denver, CO", "duration": "N/A", "pros": "Staff was friendly and helpful, family oriented in case of emergency, President of company -AWESOME!", "cons": "Non communication between employees, negativity, don't receive raises to make it worthwhile to stay, big turn over"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Admissions coordinator at Fort Myers, Fl campus.", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Jun 2015", "job_title": "Admissions Coordinator in Fort Myers, FL", "duration": "N/A", "pros": "Potential to advance career in higher education\nTraining is provided\nTools needed to succeed are provided\nAbility to help change lives", "cons": "Long work hours if not adequately staffed\nSome customers get upset if they do not understand the enrollment process"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Admissions", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Apr 2016", "job_title": "Anonymous Employee in Oklahoma City, OK", "duration": "N/A", "pros": "Traditional education is not for everyone, while the programs were expensive many students were offered an opportunity for success that they would not have otherwise been able to achieve.", "cons": "No work/life balance, hours were terrible and there was little to no appreciation for working long hours. Management is terrible."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Concerned", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "27 Oct 2016", "job_title": "Instructor in Kansas City, MO", "duration": "N/A", "pros": "Love my Co-workers. \r\nMany of the students have enlightened me!\r\nThe upgraded space is fun!\r\nnot much else sticks out!", "cons": "Corporate is terrible with communication\r\nTrainingn is almost non-existant. Or self-taught\r\nEducation dept Stress to instructors due to corporate problems"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "I had a good experience teaching at Heritage.  Although it was a newer program with few students", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Oct 2014", "job_title": "Instructor in Denver, CO", "duration": "N/A", "pros": "I thought the people I worked with were great.", "cons": "Needs further training and ability to take personal time if absolutely necessary without feeling bad about it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "New CEO bad business", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Sept 2015", "job_title": " in Fort Myers, FL", "duration": "N/A", "pros": "Great co-workers and helping students is rewarding", "cons": "Since they switched hands at corporate nobody's job is safe. They don't care about family or life work balance. It's all about the numbers. They enroll students that can't even read or write English and sadly they have to withdraw and still pay back part of the money. Admissions will enroll anyone that can sign their name."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor Management at the Corporate Level", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Feb 2017", "job_title": "Senior Director in Fort Myers, FL", "duration": "N/A", "pros": "Working with students and assisting graduates start their careers", "cons": "CORPORATE WAS DISHONEST ABOUT THE FINANCIAL MESS THEY WERE IN FROM DOING UNETHICAL BUSINESS."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Loved Changing Lives", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jun 2014", "job_title": "Admissions in Fort Myers, FL", "duration": "N/A", "pros": "Built some great relationships and really helped people make a change", "cons": "Focused on numbers way to much and not on the real people"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Director of Admissions", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jan 2016", "job_title": "Director of Admissions in Wichita, KS", "duration": "N/A", "pros": "The people at the campus were great and fun to work with.", "cons": "You make a ton of phone calls and you are micromanaged."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This place was so awful it was surreal sometimes.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Nov 2015", "job_title": "Instructor in Wichita, KS", "duration": "N/A", "pros": "The students can make this place seem worthwhile. As well as some of the employees.I was enamored with teaching at first.", "cons": "Management is terrible. Corrupt, micromanaging, incompetent, and is not truly welcoming of any feedback. They prey on the students by offering hopes and dreams that they can't deliver."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Career Services", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Aug 2016", "job_title": "Career Service Coordinator in Fort Myers, FL", "duration": "N/A", "pros": "None we worked in one small office with phones ringing students at our desks and the noise level was ridiculous.", "cons": "Changes in management and employees were commonplace. Nobody trained new employees. Ww had to park across a busy street. Long work hours"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management needs to be looked at!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Dec 2012", "job_title": "Anonymous Employee in Fort Myers, FL", "duration": "N/A", "pros": "With the exception of some of the people I worked with, not much.  At first everything was good until they expected questionable things", "cons": "Managment is terrible.  Unethical and illegal practices and should be reviewed by accreditation and department of education.  Records are \"FIXED\""}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Education", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Dec 2015", "job_title": "Instructor in Cape Coral, FL", "duration": "N/A", "pros": "Excellent learning and teaching environment; very supportive Administration team.", "cons": "Nothing negative to comment on Heritage."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Steer clear!", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Mar 2014", "job_title": "Anonymous Employee in Columbus, OH", "duration": "N/A", "pros": "The students are great and I've really developed a good relationship with them.", "cons": "Everything else is horrible.  There are ridiculous rules and you are prevented from doing your job effectively. The work environment is incredibly stressful. I wouldn't recommend this job or this school to anyone."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sinking ship", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Feb 2016", "job_title": "Anonymous in Denver, CO", "duration": "N/A", "pros": "Free coffee.  Occasional donuts.", "cons": "Debt too high for education received. High turnover. Sneaky and deceptive."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible Place to work for", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Nov 2016", "job_title": "Medical Assisting Instructor in Virginia Beach, VA", "duration": "N/A", "pros": "Non-traditional college setting, narrow/focused career teaching goals", "cons": "Poorly funded, Bad management styles (Micromanaged)"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Dissatisfied!!!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Sept 2014", "job_title": "Anonymous Employee in Columbus, OH", "duration": "N/A", "pros": "unfortunately, I can't find any pros", "cons": "No salary increases, insurance benefits way too expensive, no chance for advancement, no support"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Difficult Company", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Feb 2015", "job_title": "Instructor in Little Rock, AR", "duration": "N/A", "pros": "Modules are only six weeks..there are no other pros", "cons": "Management and students are not screened before entrance into the programs"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Admissions", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Apr 2015", "job_title": "Admissions in Denver, CO", "duration": "N/A", "pros": "Helping others, co workers are great.", "cons": "Management is awful, terrible environment, deceitful work, management babysits you."}]]