[[{"date": "10 Apr 2023", "title": "Associate Director Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bowdoin College (Brunswick, ME) in Sept 2022", "Interview Descriptions": "First round- phone screen with more information about the position Second round- interview panel with questions emailed ahead of time. 3 person panel. No room for interviewee to ask questions. Not a conversation- the panel barely said hello and went straight through the questions. Panel offered zero verbal feedback or follow up questions to interviewee's answers, which felt jarring. I'm not usually a nervous interviewer, but this felt more like an academic defense than an interview.", "Interview Questions": "About 10 Interview questions sent in advance"}, {"date": "29 Jun 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "Screening over zoom, then panel interview over zoom. Didn’t make it beyond that. The people that interviewed me were all smart and engaging. Not a bad process. Didn’t get the job though.", "Interview Questions": "Why do you want the job"}, {"date": "28 Jan 2022", "title": "Undergrad Library Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "Very easy to set up a time to meet, and interview was professional even for an entry position. Even as an undergrad, I felt that the work I was interviewing for was going to be valued and if I got the job I would be part of a great team.", "Interview Questions": "What is your desired availability?"}, {"date": "29 Jun 2021", "title": "Digital Media Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "Casual, I came in and we discussed my resume and prior experience in more detail. They told me more about their expectations and I told a few anecdotes about video editing challenges I overcame", "Interview Questions": "What video editing software do you know how to use?"}, {"date": "15 Jun 2021", "title": "Prefer Not To Say Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bowdoin College", "Interview Descriptions": "Submitted my materials online and was contacted for a phone interview weeks later. After the phone interview, I was invited to come to campus for a full-day interview. My interview involved several different group sessions and I met a few people from other teams, too.", "Interview Questions": "Could you talk about your past employment history? "}, {"date": "19 Apr 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bowdoin College in Mar 2021", "Interview Descriptions": "generally stressful and unwelcoming. high intention to trap and downplay incumbent's answers. irrelevant questions to the profile of candidates. generally stressful and unwelcoming. high intention to trap and downplay incumbent's answers. irrelevant questions to the profile of candidates.", "Interview Questions": "what are the policies to address racial issues? this is not related to my background"}, {"date": "2 Nov 2020", "title": "Asst. director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "straightforward process. HR was helpful. Phone interview and then brought on campus maybe a week or two later. A full day on campus of interviews with many campus partners in the division. Everyone was nice.", "Interview Questions": "Why are you interested in this position?"}, {"date": "31 Jan 2020", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "In person, we talked about my experience working in service industry. Asked why I wanted to join the staff and what I might find difficult. It was done in the higher up’s office and it was just a casual conversation.", "Interview Questions": "Why do you want to work at the cafe?"}, {"date": "22 Feb 2021", "title": "Visiting Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bowdoin College (Bowdoin, ME) in Nov 2019", "Interview Descriptions": "The faculty, students, and administration were welcoming and wonderful. Very bright students and collegiate faculty interested in both teaching and research. I had a great visit, and the offer was very generous.", "Interview Questions": "This was a standard campus finalist visit."}, {"date": "29 May 2019", "title": "Dining Hall Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Bowdoin College", "Interview Descriptions": "I didn't have to interview at all. I simply filled out a form before coming to college as a first-year,. The form was part of the first year placement program where first-years were randomly placed into jobs so they didn't have to apply or interview.", "Interview Questions": "N/A"}], [{"date": "12 Jul 2023", "title": "ReunionWorker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bowdoin College (Brunswick, ME) in Apr 2019", "Interview Descriptions": "Interview process was straightforward and behavioral! Coming in prepared to talk about your resume and your motivations for the role are the best prep. Only one round and was my first interview on campus, but they made me feel comfortable and I appreciated that.", "Interview Questions": "Walk me through your resume."}, {"date": "24 Apr 2019", "title": "VAP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bowdoin College (Brunswick, ME) in Apr 2019", "Interview Descriptions": "I was invited to visit the campus. I gave a job talk and met with all faculties in the Department and also had causal dinner with some faculties in Search Committee", "Interview Questions": "What specific projects can you do in lab courses with college students?"}, {"date": "5 Sept 2018", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "Very brief interview with library management. It took less than five minutes. Basically was a quick chat about my intentions and then we discussed available open shifts and my schedule, as well as set up a time for brief training.", "Interview Questions": "Why do you want to work here? What is your schedule like?"}, {"date": "29 May 2018", "title": "Senior Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bowdoin College", "Interview Descriptions": "Fairly straightforward, asks why you would be a good fit to be an interviewer and how your unique experience/background would help vet incoming students to be part of the Bowdoin community.", "Interview Questions": "What do you participate in on campus?"}, {"date": "27 Sept 2019", "title": "Associate Director of Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Bowdoin College (Brunswick, ME) in Apr 2018", "Interview Descriptions": "Phone screen. Then full day of interviews with staff in the Career Services center and students.  Behavioral interview questions directly related to advising students on career, and my experience in the industries that I would be advising in.", "Interview Questions": "Why are you interested in advising students?  Tell me about a time when you've had to mentor students that are college age?"}, {"date": "31 Aug 2017", "title": "Casual Substitute Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bowdoin College (Brunswick, ME) in Aug 2017", "Interview Descriptions": "The interview process is a bit arduous for the position I desire but as an employee of Bowdoin College, everyone goes through the entire process. In-depth application, phone interview, in person interview, background check, physical, CPR/FA, transcript, immunization record", "Interview Questions": "N/A"}, {"date": "24 Jan 2017", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bowdoin College", "Interview Descriptions": "I got called in for an interview a little under one week after submitting my application online. The interview process was brief and consisted a little over three simple, straightforward questions.", "Interview Questions": "What other jobs have you held?"}, {"date": "23 Jan 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bowdoin College", "Interview Descriptions": "The interview process was a lengthy one. It began with multiple phone interviews before a face to face interview with various staff members. All staff members were easy to talk to, professional and   friendly. In total it was about a 2 month process from beginning to end.", "Interview Questions": "How does your previous work experience prepare you for this position?"}, {"date": "15 Jul 2017", "title": "Information Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bowdoin College (Brunswick, ME) in Jan 2017", "Interview Descriptions": "Brief conversation with manager of student activities, confirmed availability and commitment to working specified hours, was asked why I wanted the job. The process  took about a week and I was onboarded immediately after being chosen for the job. Quick and easy.", "Interview Questions": "What would you do if a student or faculty member asked something you did not know the answer to?"}, {"date": "4 Mar 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bowdoin College (Brunswick, ME) in Mar 2013", "Interview Descriptions": "Rigorous.  Following an initial phone interview, I was invited to campus.  I completed a full day of interviews with representatives across a number of departments with whom I would potentially work.  Everyone was warm and hospitable, and the logistical planning - someone designated to accompany me from meeting to meeting - was noticeable and appreciated.", "Interview Questions": "How do you handle a stressful work environment?"}], [{"date": "21 Oct 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Bowdoin College (Lexington, MA) in Jan 2013", "Interview Descriptions": "I first had a phone interview first with CEO, Barbara Fox as a family friend had introduced me. She asked basic questions about why I wanted an internship there, how the experience could help further me, etc. Then I came into the office a few weeks later to meet the research management team, including the CEO and the three VPs. Each meeting lasted about 20 minutes.", "Interview Questions": "Why Avaxia? Questions about basic research knowledge."}, {"date": "29 Jun 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Bowdoin College (Brunswick, ME) in Jun 2011", "Interview Descriptions": "The interview process was long and took place over many months.\r\n\r\nThe main hiring manager did a relatively thorough phone screening before setting up the on-site interview.\r\n\r\nThe on-site interview consisted of meeting (in larger groups) with individual departments/sections, separately with multiple smaller \"interested\" groups, separate meetings with select senior staff, and a smaller group meeting with the hiring committee.", "Interview Questions": "Interview questions were about very specific areas a knowledge or experiences related to what was going on at the college currently or in the recent past."}]]