[[{"date": "5 Jul 2022", "title": "Head of Warehouse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CRC", "Interview Descriptions": "several interviews HR , Technical , and Top management interview . \nmeasure some talent and skills needed for such senior level roles and capability to lead a significant work tasks", "Interview Questions": "Asked to submit a planning to set up the central warehouse in gulf "}, {"date": "10 Oct 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CRC (Halifax, NS) in Jun 2022", "Interview Descriptions": "It was very good. Not too technical. They asked for my experience. Case based scenario questions. It was virtually and was interviewed by two people. They started by introducing themselves and their roles.", "Interview Questions": "My background and experience that I have."}, {"date": "5 Mar 2017", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at CRC", "Interview Descriptions": "There wasn't any questions about the job..just if I could teach swim lessons. Very basic for a basic job. Not very professional, set the tone for a laid back job.", "Interview Questions": "Can you teach swimmimg?"}, {"date": "15 Dec 2014", "title": "Web Developer At UF CRC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at CRC (Gainesville, FL) in Aug 2014", "Interview Descriptions": "showing my previous website and resume, and ask a few questions about the web page layout design, and get the offer next day.  the first day is the web designer ask me a few basic about html css JavaScript and the second day is that answer the Digital Media Manager's questions", "Interview Questions": "N/A"}, {"date": "20 Apr 2016", "title": "Business Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 12 months. I interviewed at CRC (Nice) in May 2014", "Interview Descriptions": "Efficace rapide : nous avons été mis en relation par une tiers personne qui nous connaissait tous deux, et qui a estimé que nous devions nous rencontrer. Esprit non hiérarchique : dialogue en mode patron à patron, ou client fournisseur. Franchise : chacun a exposé ses limites. Echange sur le vécu, la vision de la vie : bien se connaître nous a permis de mieux se faire confiance, sans cette dernière il est difficile de construire quoique ce soit.", "Interview Questions": "N/A"}, {"date": "18 Jul 2013", "title": "Staffer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CRC (Edgewater, MD) in May 2011", "Interview Descriptions": "Chesapeake Research Consortium advertises all their open positions online. The online application process was easy to follow and not very template based. You are only responsible to submit a cover letter, resume, and writing sample. I was contacted by phone a few weeks after submitting my application to confirm my interest and set-up a phone interview. After the phone interview I was asked visit the CRC office in Edgewater, MD for an in-person interview with 3-4 coordinators that I would be reporting to. The interview went great and I received my job offer 2 days after the interview.", "Interview Questions": "Tell us why should we hire you?"}], [], []]