[[{"date": "21 Dec 2020", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Monroe College (Bronx, NY) in Nov 2020", "Interview Descriptions": "Friendly, great communication, very professional, direct and to the point. A follow-up email was sent the next day. My questions for the next step were answered within 24 hours. Everything was easy to understand and easy to follow.", "Interview Questions": "Why do you want this job?"}, {"date": "24 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Monroe College (Bronx, NY) in Feb 2020", "Interview Descriptions": "After submitting my application and resume, the hiring team reviewed my documents to evaluate my qualifications, work experience, and relevant skills. I was then called for an interview Initial Screening In-Person or Video Interview Behavioral and Situational Questions Technical Skills Assessment Personality and Cultural Fit References and Background Checks", "Interview Questions": "Tell me about yourself and your experience as an administrative assistant. What interests you about working as an administrative assistant in our company? How do you prioritize and handle multiple tasks with competing deadlines? Can you provide an example of a time when you had to handle a difficult or demanding client or coworker? How did you manage the situation? How do you ensure accuracy and attention to detail in your work? Describe your experience in managing calendars, scheduling appointments, and coordinating meetings. What software or tools are you proficient in using for administrative tasks? How do you handle confidential or sensitive information in the workplace? Give an example of a time when you had to solve a problem independently and explain the steps you took to resolve it. How do you handle interruptions and unexpected changes to your daily tasks or schedule? Describe your approach to maintaining effective communication with team members and managers."}, {"date": "11 Oct 2019", "title": "Accounting Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Monroe College (New Rochelle, NY) in Oct 2019", "Interview Descriptions": "The interview seemed rushed, it only lasted about 15 minutes. Met with two directors, one of them had to leave in the middle of the interview. I was able to answer all of the questions that they asked but they just didn't seem interactive.", "Interview Questions": "Tell us about yourself."}, {"date": "16 Jan 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Monroe College (New York, NY) in Jun 2019", "Interview Descriptions": "The process was very straightforward and contextual very relevant.  Also, balance, equitable, and to the point.  It also was interesting and in tandem with today's interviewing processes.   The panel was balanced and the goals and objectives were clearly defined and relevant", "Interview Questions": "Customer Care management to ensure a good outcome"}, {"date": "14 Jan 2019", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Monroe College in Jun 2018", "Interview Descriptions": "The interview process was short, sweet and simple. I met with the department and then with the President. The initial interview was a group interview with everyone from the department.", "Interview Questions": "They asked the basic questions about prior experience. "}, {"date": "2 May 2017", "title": "Graduate Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Monroe College (Bronx, NY) in Mar 2017", "Interview Descriptions": "I had two rounds of interviews. First Round was a quick 30 mins chat with the head of graduate admission department in queens. It proceeded to the second round of interview the following week.  For the second round interview, I had 4 individual interviews with different department heads (President,VP, HR and Deans).", "Interview Questions": "Tell us about your experiences"}, {"date": "11 Jul 2015", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Monroe College", "Interview Descriptions": "Was interviewed by director who asked me about my past experience, where I attended college, etc. Was asked questions regarding diversity and working with lower level academic students. Was asked questions regarding my interest in working at monroe and how long I intended to stay, etc.", "Interview Questions": "How would you handle a student is behaving disrespectfully?"}, {"date": "10 Jul 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Monroe College (New York, NY) in Jul 2015", "Interview Descriptions": "Good at first but quickly turned inappropriate. I only took the job offer because I had no clue what I was going to be in for when I actually worked here. Wish I did my research before hand. Hope this helps people considering this horrible place", "Interview Questions": "Are you married? Do you have children?"}, {"date": "28 Oct 2015", "title": "Accounting Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Monroe College (Bronx, NY) in Apr 2015", "Interview Descriptions": "I attended a few workshops at the school. It was there I started to network with people. I go noticed and was called on the phone for a phone interview which lasted 15 minutes. I was then extended the opportunity for a on-site interview which lasted an hour. I met with the advisers and other accounting professors. It was very average.", "Interview Questions": "Tell me about yourself?\r\nWhat are your strengths and weaknesses. "}, {"date": "26 Sept 2015", "title": "Front Desk Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Monroe College (New York, NY) in Apr 2015", "Interview Descriptions": "It was very profession. They reviewed my application extensively and then invited me in to the interview. Ensure that you know a lot about the company in order to increase your chances of getting an offer.", "Interview Questions": "Why do I want to work within Monroe College?"}], [{"date": "25 Jun 2015", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Monroe College (New Rochelle, NY) in Oct 2014", "Interview Descriptions": "There are 2 faculty members who interview you and ask you about what you want to teach. Very friendly and also understand where you come from. However you have to volunteer for one semester before you can be paid.", "Interview Questions": "How do you think you can benefit us?"}, {"date": "5 Mar 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Monroe College (Bronx, NY) in Oct 2014", "Interview Descriptions": "Interview initially in group setting, then with director and eventually met with the president of the college.  It was a pleasant process. The job was student focused which was a positive coming from a high school working with kids.", "Interview Questions": "Where did I see myself in 5 years?"}, {"date": "27 Sept 2013", "title": "Senior Management Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Monroe College", "Interview Descriptions": "Lots of questions about loyalty, loyalty, loyalty. They want to know how long you are going to stick around.", "Interview Questions": "Where do see yourself with this company in the new few years. Usually easy, but for them you must lie and glow about the college, or they will not hire you."}, {"date": "13 Jun 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Monroe College (Bronx, NY) in Sept 2012", "Interview Descriptions": "I was asked to present a demo lesson.  During this time, I had 15 minutes to teach a lesson.  I was encouraged to make it as engaging as possible.  At the end of the demo, I was asked a few questions, and was sent on my way. The next day, I received a call telling me I was hired.", "Interview Questions": "\"What is your experience with working with urban students?\""}, {"date": "29 Jul 2016", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Monroe College (New York, NY) in Aug 2012", "Interview Descriptions": "Many years ago very focused on my skills\r\nWork background \r\nHow I taught Developmental Writing\r\nWork schedule \r\nFamily life courses I would be interested in teaching hours I was interested in teaching \r\nSpoke about the culture of the school", "Interview Questions": "What are some of my strengths in the classroom"}, {"date": "6 Dec 2016", "title": "Financial Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Monroe College (Bronx, NY) in Jan 2012", "Interview Descriptions": "You meet with almost everyone in the departments ending with the President. If you make it to him then you're a viable candidate. Make sure to research the school history and mission statement.", "Interview Questions": "Do you have children? Are you planning to have any? Are you married?"}, {"date": "4 Dec 2014", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Monroe College (Bronx, NY) in Feb 2010", "Interview Descriptions": "It felt like an interview for a government entity. The interview lasted hours and included meetings with almost everyone in the financial aid office, upper management and the college president.", "Interview Questions": "Do you know the history of the school?\r\nWhy do you want to work here?\r\nDo you know anyone working here already?\r\nWhat salarycwould you like earn over the course of your career?\r\nWhy should we hire you?\r\nHow would you handle situations where you don't have any solutions?"}, {"date": "12 Mar 2010", "title": "Senior Programmer Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Monroe College (Bronx, NY) in Jan 2010", "Interview Descriptions": "It was not a bad experience.", "Interview Questions": "There were no difficult questions"}, {"date": "18 May 2010", "title": "Admissions Recruiters Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Monroe College (New York, NY) in Jul 2009", "Interview Descriptions": "I submitted my resume and got a phone call about a month or two later. I had a brief phone interview with HR and they asked to bring me in for a 1:1. I met with an HR person first. Next I met with the Dean of Students and the Dean of Admissions, All on different dates", "Interview Questions": "Would you be able to speak to a group of students parents that only speak Spanish and convince them in Spanish to attend Monroe?"}, {"date": "24 May 2012", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Monroe College (New Rochelle, NY) in Feb 2009", "Interview Descriptions": "They asked me to complete an online quiz,  and I met with the VP and Dean.  They asked me to come back and meet with another VP,  who asked some inappropriate questions regarding my marital status, age, and social life.  I came backa few more times to meet with various people.  I didnt meet my direct supervisor until my last interview,  and I didnt meet those I would be working directly with until my first day of work.", "Interview Questions": "What Do you know about the college?"}], [{"date": "18 Jan 2011", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Monroe College (New Rochelle, NY) in Jan 2009", "Interview Descriptions": "It was what you would expect", "Interview Questions": "why are you applying "}]]