[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Enrollment specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Mar 2015", "job_title": "Enrollment Specialist in Wilmington, DE", "duration": "N/A", "pros": "The best think about westside health is the team work we health each other and they are always open for suggestions and their is always opportunity to grow in the company", "cons": "I dont have no cons love what i do"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Low pay/hard work", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Jan 2023", "job_title": "Family Nurse Practitioner in Wilmington, DE", "duration": "N/A", "pros": "Great coworkers, good experience, learn a lot", "cons": "APPs not treated with respect, low pay, you will be overworked"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "I would not do it again", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Feb 2022", "job_title": "Site Manager in Newark, DE", "duration": "N/A", "pros": "Patients are properly cared for", "cons": "Favoritism at its best. Not everyone deserves their position."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Nov 2021", "job_title": "Anonymous in Wilmington, DE", "duration": "N/A", "pros": "They have excellent benefits and we get to work with the community.", "cons": "Upper management does not really hear it's employees. They seem to live in a bubble. Any decision making is SLLLOOOOWWWW. Hiring process is slow."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "It's alright for entry level experience but not long term sustainability", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Sept 2019", "job_title": "Administrative in Wilmington, DE", "duration": "N/A", "pros": "I think the best part of my job we're my colleagues.  The hours were good, a nice 9-5 job.", "cons": "-    Management was ok, but sometimes it felt a little like high school.  There we're definite cliques, and usually if you butted heads with one of them well lets just say that your job could be at risk. Especially some of the higher ups.\r\n-   There is a high turnaround specially regarding providers\\MA's. During my time their I witnessed 50-60 new people. They would hire people that could barely use a laptop, but would actively provide medical care. This was huge issue especially with providers.\r\n-    It could be hectic at time, but for the most part there was a lot of downtime. The benefits we're ok for a single person, but you would get raked through the coals if you had a family.\r\n-  The pay was another thing entirely. You received very little compensation for your job. The pay you we're provided while it was above minimum wage, was not really enough to provide for yourself or a family.\r\n- One of the biggest issues was the 10min patient visit. That did not provided enough time to provider healthcare to the patient. Management refused to change this."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Manager's Viewpoint", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Mar 2015", "job_title": "Anonymous Employee in Dover, DE", "duration": "N/A", "pros": "Provision of resources required to effectively perform job with a few exceptions", "cons": "Dictatorial lower placed staff\r\nInflexible lower placed staff\r\nNepotism - lower staff\r\nVindictiveness - lower staff\r\nMisinformation or Lack of information - lower staff\r\nWasteful utilization of grant money  - lower staff.  For example, instead of assigning personnel to events close to their homes, they pay extra mileage by doing the opposite.  And instead of centralizing training in one location, the trainers should have training in multiple locations.  It costs less for one person to travel to multiple locations than multiple people travel to one location - this is just common sense.\r\nConstant turnover in personnel is the consequence - overall"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great mission, tough job", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jul 2017", "job_title": "Provider in Wilmington, DE", "duration": "N/A", "pros": "Westside has a great mission. Here you can really make a huge difference in the lives of your patients every day. Many Westside patients have complex medical and social needs.  Most of the staff really do have a passion for serving the under-served and take that responsibility very seriously.", "cons": "If you do not speak Spanish, you will have difficulty working here. \r\n\r\nThe pace is very fast. You're expected to see complex patients in a short amount of time. \r\n\r\nThe volume of work for providers is huge. Full time providers are salaried, and put in about 50-60 hours per week, occasionally more. \r\n\r\nThe turnover is high because of this."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The heart of Westside are their medical providers - too bad theyre never retained", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Mar 2014", "job_title": "Medical Assistant in Wilmington, DE", "duration": "N/A", "pros": "-Great medical providers, especially the MAs and Physicians\r\n-Locations are in the heart of the community\r\n-Wide array of services available for clients\r\n-Well funded\r\n-Many opportunities for CE credits\r\n-MAs and medical providers often form strong and supportive bonds that rarely feel \"NP or MD vs MA\" at all", "cons": "-All staff need to undergo diversity training.  Especially with regards to sexual orientation, racism, and sexual harassment. Attendance by managers and executive leadership must be compulsory. \r\n-Employees routinely vanish. Terminations and abrupt quits are not uncommon. Turnover is rapid and retention is not a priority because of the job market and the funding for healthcare - they know someone else will fill in so there is no company culture of retention.\r\n-Job listings dont stress that if you work with patients Spanish is absolutely mandatory. I know medical providers can rely on the MAs but MAs arent appropriately compensated for this and are always overwhelmed. Also theyd hire staff with traditionally Hispanic names and then be shocked they didnt speak  Spanish - that isnt fair to the person being hired if they didnt know that was expected of them. Even if they can speak it, medical interpretation is a skillset that has a lot to do with \"informed consent and liability, Casual knowledge of a language is too low of a standard to have given how well-funded this company is. Ensure theyre absolutely fluent and pay them for this. Just dont take it for granted if they do.\r\n-This is the only healthcare institution Ive encountered where the employee contract includes a section about moral turpitude. \r\n-Always had issues every pay period with respect to overtime. Either make hourly employees salaried and expect them to work until the assignments are completed or honor their timesheets. My direct supervisor always approved the overtime but itd be constantly bumped back by admin.\r\n-Nurse Practitioners and Doctors are the ones who should be kept happy, they were always stressed, overworked, and were oncall way too often."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Favoritism and nepotism", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Apr 2020", "job_title": "Anonymous Employee in Wilmington, DE", "duration": "N/A", "pros": "Mission to provide affordable care to underserved community", "cons": "Administration and upper management lack of understanding/support front line employees. Training  and lack of educational resources. Questionable hiring as well as promotion practices and decisions"}], []]