[[{"date": "10 Nov 2022", "title": "Mental Health Clinician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pacific Clinics (San Jose, CA) in Sept 2022", "Interview Descriptions": "Virtual meeting with other candidates and team leaders. short interview , happy, good, nice people. time to get information about center, work, program. People nice good perfect I want to work here", "Interview Questions": "why do you want to work here"}, {"date": "9 Aug 2022", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Pacific Clinics (Los Angeles, CA) in Apr 2022", "Interview Descriptions": "First the ask the general interview question (strength, weakness, work history) then they provide you with a clinical vignette and ask what diagnosis you think the client has and ask what areas would you focus on? Then you are given another clinical vignette and asked to role play as the therapist to try to engage the client.", "Interview Questions": "Based on the clinical vignette, how would you engage the client and what diagnosis do you think the client has? "}, {"date": "26 Jan 2022", "title": "Mental Health Therapist I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pacific Clinics (Arcadia, CA)", "Interview Descriptions": "It was with 2 supervisors. Very pleasant experience. The only challenging part was the vignette but I think I did well. I enjoyed speaking to the supervisors. I received the offer but ultimately I declined because of location.", "Interview Questions": "I was asked about my background, knowledge. I was given vignette to demonstrate my clinical judgment and skills."}, {"date": "21 Aug 2021", "title": "Lead LVN/Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Pacific Clinics (Glendora, CA)", "Interview Descriptions": "The interview process is good. I interviewed with a panel of Program Directors. I then interviewed with the site clinic Program Director, who then oriented me to the clinic staff.", "Interview Questions": "I inquired about Team work support"}, {"date": "2 Jan 2020", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pacific Clinics", "Interview Descriptions": "I would actually say the interview was enjoyable and suitable. Dress appropriately and be ready and alive for the interview questions and you would be fine.  Please arrive early and expect to have some wait time before the interview starts.", "Interview Questions": "What is your strength. "}, {"date": "14 Jun 2019", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Pacific Clinics (Los Angeles, CA) in Apr 2019", "Interview Descriptions": "Had two interviews. First I met with two of the clinical supervisors as a panel interview and the second interview I met with the divisional director. Each interview took about an hour.", "Interview Questions": "What is my opinion of a good clinician?"}, {"date": "3 Oct 2018", "title": "Mental Health Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pacific Clinics (Pomona, CA) in Aug 2018", "Interview Descriptions": "Interviewed with two staff and their office in Pomona. They asked me basic questions from a sheet of paper and writing down my answers. The interview went well up until I was “tested” on my Spanish skills. It was offensive the way they decided to do it. So unprofessional.", "Interview Questions": "Work History, Strengths and Areas of Improvement, Scenario questions..."}, {"date": "22 Jun 2018", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pacific Clinics (Los Angeles, CA) in Jun 2018", "Interview Descriptions": "I was interviewed by both team managers. The first part consisted of them telling me about the position, the population, and other expectations. They then gave me two vignettes and asked me a few questions about my previous experience. I then was able to ask them questions about their experience working there.", "Interview Questions": "Describe a difficult situation you've had with a coworker and how did you handle it?"}, {"date": "22 May 2018", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Pacific Clinics (City of Industry, CA) in May 2018", "Interview Descriptions": "The supervisor first gave me a tour of the agency and started the interview. In the middle of it, the director joined in. The interview took about one hour. Asked me questions and provided a simple case sample for me to give a diagnose and treatment plan.", "Interview Questions": "Q1: Tell me something about yourself that is not on the resume."}, {"date": "4 Jun 2021", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Pacific Clinics in Jan 2017", "Interview Descriptions": "Phone callback, followed by 4 interviews from different sites and different managers. Friendly and direct but unorganized and can easily see lack of communication between employees. Different interview styles, no set of questions.", "Interview Questions": "How do you deal with a client who appears agitated and screaming?"}], [{"date": "27 Apr 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Pacific Clinics (Rosemead, CA) in Oct 2016", "Interview Descriptions": "I was interview by two of supervisor in the team I will be working in. They were friendly. It was a long interview and very comprehensive.  There are standard interview questions, Resume review. Talk about your past experiences. Then there is two role play of client and you interaction of difficult situation. As well as documentation section, where you will write a progress note for the role play session you did.", "Interview Questions": "Q; why did you want to work in mental health field?\r\n"}, {"date": "15 Aug 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pacific Clinics (Covina, CA)", "Interview Descriptions": "first interview was somewhat difficult. I was asked about 10 questions. I felt comfortable with the interviewer. 1st interview was with 2 people and 2nd interview was with 2 people as well but different supervisors. Duration was about 20 minutes.", "Interview Questions": "They had me describe scenarios."}, {"date": "24 Aug 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Pacific Clinics (Los Angeles, CA) in Aug 2016", "Interview Descriptions": "Meeting with a total of three individuals, consisting of team leaders and program managers.  They were sincere in their quest to find an appropriate candidate.  They asked about my working history in mental health care and about what my motivation was.", "Interview Questions": "How do you recognize (mental disorder) in someone?"}, {"date": "12 May 2016", "title": "Human Resources Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Pacific Clinics (Arcadia, CA)", "Interview Descriptions": "In the interest of fairness, my interview was too many years ago to review.  In addition, not a single person that I was interviewed by works at this company any longer.  I cannot speak to the competency of current interviews; however, I do know by personal experience that they have an exceptional recruiter.", "Interview Questions": "Please see above."}, {"date": "14 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pacific Clinics (Rosemead, CA) in Feb 2016", "Interview Descriptions": "The interview process includes an overview of the program, a meeting with the current interns, and an individual interview (with three interviewers). The individual interview is not very intense. It feels like a conversation about previous experiences. It helped me review what I have done and make connection with some of the cases they presented.", "Interview Questions": "Why do you choose our program?"}, {"date": "11 Nov 2016", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Pacific Clinics (Glendale, CA) in Feb 2016", "Interview Descriptions": "Overview of company guidelines and vignette. The vignettes contained questions about cases that you might come across such as \"Client A does this. What would you do or say?\" \r\nThe interviewer asked questions about organization skills, education, life history, and different ways you can cope with stress in the work environment.", "Interview Questions": "How would you treat this case? What are your organization skills like?"}, {"date": "4 Jan 2016", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pacific Clinics in Dec 2015", "Interview Descriptions": "It was extremely dense and difficult. The questions were very detailed, and a lot of parts to the question. The interview was about 45 minutes long, Lots of what if questions, and scenarios. A lot of tell us about a time when? Very nice people and appears to be a good agency to work with adults with persistent mental illness.", "Interview Questions": "Why do you want to work for Pacific Clinics and how does that fit into your 5 year plan?"}, {"date": "20 Nov 2015", "title": "Mental Health Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Pacific Clinics", "Interview Descriptions": "Very unorganized. Clinical supervisor even stated there was a high turnover rate which is never a good sign. The interview process felt unprofessional, as a saw some of the employees passing by looking very unhappy. The job duties for the mental health therapist position was beyond the scope of what a mental health professionals should be doing. I thought to myself I wouldn't accept the offer even if they gave it to me.", "Interview Questions": "Why do you want to work at Pacific Clinics?\r\nCase vignettes were given "}, {"date": "24 Sept 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Pacific Clinics", "Interview Descriptions": "I had a 1 hour phone interview with several questions.  Went in for a face to face and net with hiring manager.  4 weeks I do think get a call but an email letting me know the position is closed.", "Interview Questions": "Why do you want to work at Pacific Clinics?"}, {"date": "18 Mar 2019", "title": "Housing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pacific Clinics (Pasadena, CA) in Jan 2015", "Interview Descriptions": "Easy and comfortable. The manager asked me about my experience and how I think it was related to the job. I was happy and felt at ease. The whole process was easy because I was fully prepared.", "Interview Questions": "What are my strongest qualities? "}], [{"date": "7 Oct 2014", "title": "Milieu Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pacific Clinics", "Interview Descriptions": "I thought the hiring process was pretty efficient. I got called in for an interview. I interviewed with the person who would be supervising that position and the partner for the milieu. Within two weeks i got a job offer and was called into HR to sign paperwork. I began work fairly quickly after that.", "Interview Questions": "I was asked to role play. They had a child who was throwing a tantrum and I was asked to de-escalate the child. The interviewer starting running in and out of the rooms and i can to chase after him. "}, {"date": "20 May 2014", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Pacific Clinics", "Interview Descriptions": "Phone and in person interview with clinical supervisor and program director.  It took a long time for them to get back to me about the outcome of the interview (about a month).", "Interview Questions": "To conceptualize a case and role play with interviewer during interview."}, {"date": "27 Aug 2016", "title": "Peer Advocate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pacific Clinics (Los Angeles, CA) in May 2014", "Interview Descriptions": "Interviewed with two team leads and asked generic questions. They were very interested in whether or not I was prepared to work with FSP population and the homeless. They also wanted to know whether or not I was able to transport clients in the company vehicle. The interview was very basic. They allowed me to do a lot of the talking and kind of lead the interview.", "Interview Questions": "What is your experience as a peer?"}, {"date": "16 Apr 2014", "title": "Mental Health Worker II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pacific Clinics (Pasadena, CA)", "Interview Descriptions": "Applied for this position online and received a phone call for an interview three days after my application was sent. I had a very enjoyable interview with two of the staff from the clinic- they asked general questions about work experience in the mental health field and showed me around the office when the interview was over.", "Interview Questions": "I was asked to write a simple paragraph describing the events that occurred from the day before. The purpose of this assignment was to see my writing style and how descriptive I would be. This is important because this position requires documenting the details of the counseling sessions with the clients."}, {"date": "2 Sept 2015", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Pacific Clinics (Los Angeles, CA) in Feb 2014", "Interview Descriptions": "A clinical vignette was given to the interviewee. There were two interviewer. The interviewee was asked to read the vignette and answered the questions. According to the interviewers, weekly supervision wil be provided. Interns are encouraged to utilize the supervision to sharpen therapy skills. I got the response from them within weeks. The interviewers appeared to be prepared and organized upon my arrival.", "Interview Questions": "Which population you would like to work with?"}, {"date": "23 May 2016", "title": "Mental Health Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Pacific Clinics in Jan 2014", "Interview Descriptions": "The interviewer was really nice. I felt comfortable and relaxed and she was very pleasant. The interview was conversational and she was transparent about what she was looking for and the work demands.", "Interview Questions": "Experience working with Electronic Health Record Systems"}, {"date": "16 Dec 2013", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pacific Clinics", "Interview Descriptions": "basic process-not structured.", "Interview Questions": "N/A"}, {"date": "27 Aug 2013", "title": "TBS Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Pacific Clinics", "Interview Descriptions": "Took a long time", "Interview Questions": "Test at the end"}, {"date": "4 Jul 2013", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Pacific Clinics", "Interview Descriptions": "1 interview that involved a \"typing test\" where you had to write a sample note. The hiring process took a very long time. It took several weeks to find out that I had indeed been offered the job. Salary is not discussed in the interview and is handled by HR on the phone call. I didn't actually start for a month after the initially reported start date. My paperwork was not entered, so it took another 1.5 months (waiver for unlicensed psychologist) to start obtaining hours towards licensure and get paid a therapist salary.\r\n\r\nBe sure to ask about turnover and steer clear, if possible, from the programs with high turnover. There is usually a good reason, and there seems to be a lot of discrepancy in job satisfaction depending on program.", "Interview Questions": "None. They will give case examples and ask how you would respond in a situation."}, {"date": "13 Dec 2013", "title": "Benefits/Leave Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pacific Clinics (Arcadia, CA) in Jul 2011", "Interview Descriptions": "Very standard.  Panel of 3 employees for first interview, then another with VP.", "Interview Questions": "N/A"}], [{"date": "24 Jan 2014", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pacific Clinics (Los Angeles, CA) in Nov 2010", "Interview Descriptions": "informal interview", "Interview Questions": "no questions were difficult to answer"}, {"date": "9 Sept 2014", "title": "Quality Improvement and Compliance Training Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Pacific Clinics in Jun 2010", "Interview Descriptions": "easy interview;  provided copies of current documentation including most current treatment plan.  asked little questions regarding training or creating power points for ongoing trainings.  The QIC department didn't provide training for the position, or how to be a trainer.", "Interview Questions": "N/A"}, {"date": "28 Sept 2013", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 8 months. I interviewed at Pacific Clinics (Los Angeles, CA) in Jan 2009", "Interview Descriptions": "I submitted a regular employment application, attended an interview where I was asked about my skill, and subsequently, I was hired as a temporary receptionist for eight months.", "Interview Questions": "I was asked could I just stick to my job duties."}]]