[[{"date": "28 Sept 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tidelands Health", "Interview Descriptions": "One interview panel style. Sometimes you may interview with one person. It’s a pretty easy process and managers are really nice and comfortable to talk to. Sometimes you may have a second interview depending on who’s available for the first interview. ", "Interview Questions": "Why would you be a good fit for this role. "}, {"date": "30 Aug 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tidelands Health", "Interview Descriptions": "The interview was in a conference room with 6 interviewers- all staff in higher positions. They were all very nice. But, I never heard back from anyone whether I got the job or not- just silence.", "Interview Questions": "Why do you want this position"}, {"date": "2 Jul 2022", "title": "IT Support Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tidelands Health (Myrtle Beach, SC) in May 2022", "Interview Descriptions": "The interview process is professional but demanding, they require quick responses and offer a very slow on boarding process. It took nearly two months to complete two interviews and a physical testing. In that time I ended up receiving two different offers from other potential employers after multiple interviews and had accepted another position before they finally reached back out to let me know I had gotten the job.", "Interview Questions": "What’s is and give an example of a subnet mask."}, {"date": "17 Jul 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Tidelands Health (Pawleys Island, SC) in Feb 2021", "Interview Descriptions": "It was a Lengthy interview.  It was an hour long. The hiring manager said she would find me a position. Nothing ever came of it. She never called me again.", "Interview Questions": "I was asked if I had Experience in health care."}, {"date": "28 Jan 2021", "title": "CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tidelands Health", "Interview Descriptions": "got a call, answered some questions over the phone, when in person for the interview, overall easy, staff was friendly and helpful answering question, personally was looking for something different.", "Interview Questions": "what is your long term goals"}, {"date": "12 Aug 2019", "title": "OP Scheduling & Registration Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tidelands Health in Aug 2019", "Interview Descriptions": "Submitted my resume and they called me in less than a few days. The interview went well. The 5 people who interviewed me were very friendly and professional. They asked standard questions. They were clear on what they wanted from me if I was to get the job.", "Interview Questions": "Asked me about my availability?  "}, {"date": "18 Aug 2019", "title": "Medical Billing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tidelands Health (New York, NY) in Aug 2019", "Interview Descriptions": "It was a  telephone interview since  i live in NY and the position was in SC, they were very accommodating , and the 2 peoplethat did interview were very professional", "Interview Questions": "What duties did I perform at my previous job?\r\n"}, {"date": "19 Aug 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tidelands Health in Oct 2018", "Interview Descriptions": "My interview went very smoothly didn't feel I was asked a lot of questions to make me feel uncomfortable, definitely was asked the necessary questions for the position. The Interviewer was very nice and welcoming, she went through a brief intro about Tidelands Health company as well as her title with in the facility. After we walked around the facility and I was introduced to staff member. Everyone was very inviting and made me feel welcomed. Within a week I was offered the position 😊", "Interview Questions": "Tell me a little about yourself?\r\nWhere do you see yourself in 5 years?\r\n"}, {"date": "20 Jul 2018", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Tidelands Health (Murrells Inlet, SC) in Jul 2018", "Interview Descriptions": "The interview process was great and easy.  HR moved quickly to get me started with orientation and any other test that needed to be performed prior to my start date.", "Interview Questions": "Tell me about yourself."}, {"date": "13 May 2017", "title": "Discharge Planner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tidelands Health", "Interview Descriptions": "interviewed by the program manager then by a group of co-workers from the discharge planner current workers. basic information reviewed during both interviews.  I got more information from the group interview about how the company works together and I may have some problems with their style. I am glad they had the two interviews.", "Interview Questions": "Where do I see myself in 5 years?"}], [{"date": "13 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tidelands Health (Georgetown, SC) in Oct 2015", "Interview Descriptions": "Very casual b/c I had worked with the interviewer prior to the process. She knew my work ethics. Drug screened was observed.  References needed to be replied via computer after I contacted them via email. After that process was complete, then an agility test was given to check for needed strength to carry out the Registered nurses needed position. TB tested given. Bio hazard mask fitted. Flu shot required and given. Orientation lasted about a week.", "Interview Questions": "No pacific ones I can remember. Just my strong and weak points."}]]