[[{"date": "5 Jun 2023", "title": "Sr. Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA)", "Interview Descriptions": "the interview is a panel format. the questions are open ended so that the candidate can demonstrate listening and asking clarifying questions. the process feels very fair. the atmosphere feels very positive and welcoming", "Interview Questions": "Explain the differences between/ benefits of waterfall versus agile"}, {"date": "23 May 2023", "title": "Public Funding Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (New Haven, CT) in May 2023", "Interview Descriptions": "Once my application was selected by the recruiter, I was invited to an initial 30min phone interview. About three weeks later, I was invited to a virtual interview with three individuals from the local TNC chapter for an hour long interview. There was a chance for a third interview, but I was not selected to proceed.", "Interview Questions": "Why are you interested in the organization? Why are you leaving your current position/how long have you been looking? What do you know about the role/what questions do you have? Describe your experience with conservation projects/initiatives. What grant writing experience do you have? What fundraising experience do you have? What experience do you have networking with other agencies/municipalities/organizations? Describe a time you disagreed with a coworker, how did you resolve it?"}, {"date": "13 Jun 2023", "title": "Finance Director - MN, ND, SD Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at The Nature Conservancy (Minneapolis, MN) in May 2023", "Interview Descriptions": "Was recruited for the position. There was no response for a couple of weeks before they scheduled a phone screen. This resulted in moving on to scheduling a panel interview. At the same time I was contacted to schedule a phone interview and the panel interview was cancelled.  At the scheduled time there was no call. Reached out to the person who had scheduled me who said they would look into it but they never got back to me.", "Interview Questions": "They ghosted the interview entirely."}, {"date": "21 Apr 2023", "title": "Grants Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "The recruiting and interview processes were seamless and positive, with excellent communication from TNC all throughout. I was asked to complete a questionnaire and then invited to an interview. The questions felt reasonable for the position.", "Interview Questions": "Why do you want to work for TNC?"}, {"date": "11 Apr 2023", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I was excited to interview with The Nature Conservancy because they have such a great reputation of doing impactful work and treating their employees well. I had a basic screening via Zoom. The interviewer asked very standard questions, like he was checking them off a list. Fine but not really engaging. I haven't heard a single thing in several weeks so I guess they decided not to move on without me in the process. Also fine, but extremely rude not to let people know. It takes a few seconds to email people you reject - common courtesy and not excuse not to do it.", "Interview Questions": "Are you okay with the salary range for this position?"}, {"date": "8 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I was contacted for the questionnaire but I did not move forward in the process. The hiring team was personable and kind when delivering the news that I didn't get the position.", "Interview Questions": "In the questionnaire they ask about how you define diversity and how you have applied it in your job experience."}, {"date": "6 Apr 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Rounds of interviews, work submissions, writing sample. I was interviewed by two potential managers. The process was thorough and longer than expected. Email to follow up and express interest! Very amazing people at TNC!", "Interview Questions": "How do you see this internship fitting in with larger career goals ?"}, {"date": "4 Apr 2023", "title": "Loyal Donor Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The Nature Conservancy (Indianapolis, IN)", "Interview Descriptions": "Good face time with multiple levels of the company, from direct manager, to teammates, to other teams. Process was spread over a month and each interview was at least an hour", "Interview Questions": "What does diversity mean to you?"}, {"date": "12 May 2023", "title": "Sr. Applications Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (New York, NY) in Apr 2023", "Interview Descriptions": "Had a call with the hiring manager to discuss work history and the position. Then a panel interview with the same hiring manager and 2 developers in similar positions. They asked a variety of database, API, and frontend web development questions.", "Interview Questions": "What is an api? Result of Select * from table_1 Result of JOIN on 2 tables by an id, including when one id is null What is a React hook?"}, {"date": "28 Mar 2023", "title": "Applied Scientist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "The process went fairly smoothly. Several members of the team reached out and scheduled interviews. In each interview, asked several questions, and then time was left for me to ask questions at the end.", "Interview Questions": "What makes you the best candidate for this job?"}], [{"date": "4 Apr 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Nature Conservancy (Brussels) in Mar 2023", "Interview Descriptions": "le processus de l entretien s est passee virtuellement via Teams, tres humain, les personnes de l organisation avaient une energie positive et etait tres gentils... Les questions posees etaient en relation avec le travail, rien de travers, beaucoup de respect", "Interview Questions": "entretien c est tres bien passe"}, {"date": "12 Apr 2023", "title": "Senior Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Nature Conservancy in Mar 2023", "Interview Descriptions": "I applied online for a job at Nature Conservancy and was interviewed by the hiring manager. I was impressed with the company's mission and the positive impact it has on the world. However, during the interview, I faced some challenges. Firstly, the interviewer did not initially mentioned on what to expect or what we are going to discuss during the interview. Secondly, her explanation of the role was confusing and scattered. Lastly, it was not clear what the expected outcome of the role was, and it seemed like they just needed someone to fill the position temporarily. I didn't see any opportunities for future growth or advancement. There was a lack of clarity during the interview on the information shared.  Unfortunately, due to these factors, I had a negative experience as a candidate for the position at Nature Conservancy.", "Interview Questions": "Tell me about your self?"}, {"date": "17 Feb 2023", "title": "Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (New York, NY)", "Interview Descriptions": "Very straightforward. Started with a simple phone interview then followed by a panel interview with other staff members. Questions revolved around the position responsibilities, my interest in the organization, and diversity, equity and inclusion.", "Interview Questions": "Why do you want this role?"}, {"date": "10 May 2023", "title": "Web Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Vancouver, BC) in Feb 2023", "Interview Descriptions": "TNC first asked me to fill out a questionnaire followed by a screening interview with a team member, and a panel interview with the team. The following interview was with the higher up, which I did not make it through to.", "Interview Questions": "N/A"}, {"date": "7 Jan 2023", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "This was what I call a \"whoo boy\". I got a very clear image of what working at TNC would be like. I applied in October (possibly September) and the first step was an 8-part questionnaire which I received in November. The second step was a 7-person panel interview scheduled a day or two before Thanksgiving. Most of the questions asked were repeats of questions from the questionnaire. At no point did this feel like my questionnaire had been read. This step was not a conversation: I would answer, try to engage, but the process moved on to the next rapid-fire question. Another month rolled by and I was invited to a second interview. This time with four people and in the same rapid-fire style. During both interviews, I was asked essentially the same questions in multiple ways: 1. How do you handle stressful, chaotic situations? 2. How do you deal with difficult people? Another month goes by and I get a request for references. At this point, I backed out because I could see what working with this group would be like. I asked the recruiting team multiple times for a salary range and received no response.", "Interview Questions": "How do you deal with ambiguity?"}, {"date": "8 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (New York, NY) in Jan 2023", "Interview Descriptions": "Fluent, two people were very welcoming, while the third one was quite challenging and very serious. It lasted one hour, it took place in a remote fashion. They did not answered my questions with concrete examples or situations. Perhaps, they were not a match for me!", "Interview Questions": "All related to the job"}, {"date": "17 Dec 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Very smooth. The coordinator sent over a short questionnaire to fill out and send back. Once it was sent, I heard back to schedule an interview within a few days. The whole process was very efficient, organized and friendly. Everyone made things feel relaxed and comfortable. I went through two rounds of interviews. The first one was back to back days for about an hour. Then the next one a week or two later for an hour.", "Interview Questions": "How do you handle the monotony of repetitive tasks?"}, {"date": "20 Dec 2022", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "The interview process consisted of two virtual (zoom) interviews with panel of staff who conducted the interviews. It was a slow process, took about four months from time of application to offer. Interviews were organized and well structured.", "Interview Questions": "Tell us about your background and prior experience."}, {"date": "17 Dec 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "standard application and then a 3 part interview. First interview was with two individuals and interview three and four were each with a panel. I did not get the position but felt position about the experience and everyone I met with.", "Interview Questions": "To describe my experience resolving a conflict"}, {"date": "16 Jan 2023", "title": "Monitoring Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Nairobi) in Dec 2022", "Interview Descriptions": "It is a comprehensive interview process with a panel keen to know if your skills match the position requirements. The first process is a pre-screening interview, task and then final stage", "Interview Questions": "What added value would you bring to the team?"}], [{"date": "6 Mar 2023", "title": "Development Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Bogotá, Bogota) in Dec 2022", "Interview Descriptions": "Really the worst hiring process I've participated in, probably ever. I was emotionally manipulated and lied to from the beginning by the hiring manager who phoned me up on WhatsApp on the first day of the process to tell me how great she thought I would be for the role. After successfully completing 3 interviews and a technical test, her inappropriate phone calls telling me how much of a great organisational fit I was, and even in evening hours, continued. She even pushed me to negotiate my salary/conditions and told me that TNC would never reject me for doing that, and that I should empower myself to do so because for women this is something we find very difficult. After this, she requested 3 professional references from me which confirmed to me that they were contacted by her. After this process, I received what I believe was an informal offer from her by phone. As recommended by her, I tried to negotiate, but about holidays rather than salary as money wasn't my main motivation. I asked for some minimum holidays during the first year as Colombian labour law doesn't allow holidays in your first year of a job, and I understood that as an international org, they may be able to have some flexibility on this one. After this conversation, I could sense the hiring manager turning cold and becoming very strange with me. A few days later, I received a rejection email. I was honestly shocked and gobsmacked at the lack of professionalism and the inappropriateness that took place in the process. In total, it was around 2 months of my time wasted and really knocked my confidence. My faith in the international NGO sector has also been very damaged by this and is unlikely to recover any time soon.", "Interview Questions": "Why do you want to work for TNC? Why do you believe that strategic communications are important in the development of proposals? How do you project manage grant writing processes?"}, {"date": "9 Feb 2023", "title": "Equitable Energy Transition Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy in Dec 2022", "Interview Descriptions": "I applied for the position in late October. I was invited to an initial screening interview in early December. The initial screening was with a peer in the department and was very friendly and casual. The following two interviews were panels with department managers. They asked me questions but also gave me plenty of opportunity to ask my own. Everyone was friendly. I definitely took the time and opportunity during my interviews to get a sense of management style, work styles, communication styles. Everyone was very open to sharing how they work. All interviews took place via Zoom.", "Interview Questions": "Initial interview questions were general, along the lines of \"why do you want this position and why are you qualified?\" Going further, the manager panel asked a lot of questions to gauge my comfort with the complex, matrixed organizational structure."}, {"date": "6 Jan 2023", "title": "Human Rights Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The Nature Conservancy (Arlington, VA) in Nov 2022", "Interview Descriptions": "Re. the Corporate Engagement Human Rights Analyst position. I provided TNC with a completed online form, a resume, and a cover letter. TNC contacted me for a 30-minute phone interview, asked me to complete a take-home exercise (a cover letter-type question), and then invited me to take part in x2 45-minute panel interviews. From the application’s submission to the first-panel interview: 71 days. - Panel 1 asked very generic interview questions, with little connection to the role. I was left with the impression that the panelists were unenthusiastic and cared little about the interview. - Panel 2 was far more engaged. Questions related to the role, professional experiences, and work challenges. The panelists were enthusiastic, asked deep and thoughtful questions, and were highly amicable. After the interview, it took TNC an additional 15 days to reject my candidacy (for context, it took less time for Apollo 11 to go to the moon and back, the Russian Army to mobilize in WW1, and for the Committee on Style and Arrangement to finalize the U.S. Constitution). Moreover, I was led to believe that TNC Human Resources would provide further updates on the application. Up to this point, TNC’s HR had been extremely courteous and professional. However, and to my confusion, Panel 1 got back and provided the now somewhat cliché rejection message, “…While your background and experiences were interesting and impressive, after much deliberation we have decided to move forward with another candidate.” I acknowledged the message and asked for feedback. TNC provided the following out-of-office: “Happy Holidays! I am out of the office until the end of the year, and will not be checking email. Thank you for your understanding.” Happy Holidays indeed! TNC commits to making the process “a positive experience.” However, the 15 days TNC took to communicate and reject my candidacy, the internal confusion over follow-up, and the generic, flippant even, manner TNC gave me their decision made this far from a positive experience. The public holds NGOs like TNC to a higher standard. NGOs must endeavor to ensure their approach to recruitment is considerate, especially for candidates that battle through a lengthy recruitment process. Remedy is straightforward: 1) Remind hiring managers that unsuitable candidates need timely rejections. 2) Encourage hiring managers to provide feedback, especially if the process is long and laborious. 3) Ensure that company hiring managers and Human Resources are communicating. 4) Discourage hiring managers from sending rejections while on Holiday Leave. It is unprofessional and inconsiderate. (It also makes you wonder why TNC is instructing their hiring managers to communicate rejections on leave). I am utterly soured by this experience and believe it may show some inner organizational dysfunction. Time is precious, and I am left with the feeling that TNC was comfortable wasting my time. Time put into the application, take-home exercise, phone calls, interview prep., and follow-up emails could have been better spent elsewhere. For prospective candidates, I hope the above is informative and enables you to consider whether you wish to go through such a process in your search for a conservation career. For TNC, I hope the above account contributes to the broader discussion on hiring practices and ethical recruitment at TNC.", "Interview Questions": "How does your manager describe you?"}, {"date": "20 Dec 2022", "title": "Finance Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at The Nature Conservancy (Sacramento, CA) in Nov 2022", "Interview Descriptions": "While interviewing for a different position at TNC, a TNC recruiter recruited me for this job. I applied on a Tuesday and was invited to do an initial interview that Thursday. TNC moved very quickly. At every step of the process a clear timeline of the next steps was given. I did a total of 5 hours of interviewing for this position, which for what is basically an entry level position, felt excessive. One day I had three hours straight of interviews and I felt that could have been a panel as opposed to individual interviews.", "Interview Questions": "Coming from a very small non-profit, they asked a lot of questions about my ability to adapt and work at large organization."}, {"date": "1 May 2023", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (New York, NY) in Nov 2022", "Interview Descriptions": "3 interviews over 2 months long drawn process The interviewers were not aware of the key expectations from the role Got back after 3 months on a follow up mail, that they did not find me fit", "Interview Questions": "What has been your experience of working with standards?"}, {"date": "12 Apr 2023", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy in Nov 2022", "Interview Descriptions": "Had one online interview with the supervisor and he followed with a small task to be completed (similar to the project of the position). After returning the task, had a follow up call and email about 5 days later with an offer.", "Interview Questions": "What is one challenge that you think you could have in this project/position and how would you solve it?"}, {"date": "9 Dec 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Boston, MA) in Nov 2022", "Interview Descriptions": "It was an initial phone screen. The recruiter was friendly and the questions were basic. She did a good job of describing the position and described the process well including next steps. Good impression of their HR staff so far. Hoping to hear back.", "Interview Questions": "Tell me about your current position and why you are applying to this job"}, {"date": "28 Nov 2022", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy in Nov 2022", "Interview Descriptions": "Applied online and heard back a month later, filled out a questionnaire, virtual 30 minute screening interview with HR, virtual panel interview with team members. About a week between each step and everyone was very communicative and direct.", "Interview Questions": "What is your experience working with diverse sets of people?"}, {"date": "30 Nov 2022", "title": "Groundwater Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Nature Conservancy in Nov 2022", "Interview Descriptions": "It was on Zoom. I have enough time to talk about my background and experience. The question was related to the job and my background. I could able to cover most of the questions.", "Interview Questions": "Tell me about yourself. Why did you apply for this position? Are you able to lead a scientific project?"}, {"date": "26 Oct 2022", "title": "Project Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "two interviews, first with direct manager and in second and last stage of the process the a panel with two directors. Very straight foward questions, they ask about my previous experience and how I handle problems", "Interview Questions": "whats is my brain process to get from A to B"}], [{"date": "20 Oct 2022", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Oct 2022", "Interview Descriptions": "The first round was a a zoom call with 2 people, then another zoom call with 2 people and the final round was a 3 person zoom call. Prior to the last call, I had to complete provide feedback for how I would improve a blog post based on a scientific study. Overall, the interview process was to be expected.", "Interview Questions": "How would you organize your time with a lot of people asking for various things from you with different deadlines?"}, {"date": "18 Nov 2022", "title": "Communications &amp; Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at The Nature Conservancy in Oct 2022", "Interview Descriptions": "Took about 4 months to the final round. Little and slow feedback from the hiring team through most of the process. A rush at the final stretch. Various interviews with the hiring manager, a panel with peers and HR.", "Interview Questions": "Sharing experience on various methods of fundraising."}, {"date": "12 Sept 2022", "title": "Climate Justice Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Nature Conservancy (New York, NY)", "Interview Descriptions": "Had several rounds: HR, written test and panel interview. Then got ghosted for 3 months only to be told I was rejected (with no reasons given). The next day they re-advertised the position and have been promoting it for another two months. To give context the posting was *urgent* and I was told they wanted somebody to start immediately.", "Interview Questions": "How would you resolve conflict with a co-worker?"}, {"date": "13 Sept 2022", "title": "Program Manager, the Agility Lab Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA)", "Interview Descriptions": "I had a no-show twice before finally the 3rd time she showed up. It was barely a coherent conversation before I was told 1 week later that other applicants with more experience was chosen. Not a fair assessment if you ask me given I had a 10 min conversation about very high level logistics of the role. It was a poor representation of this organization since she showed up extremely groggy and unprepared. I also noticed, the program managers are of similar age and experience to me so I was confused on the feedback. Nonprofits trying to be “agile” by using a bunch if buzzwords in their job decryption.", "Interview Questions": "Tell me about yourself and background?"}, {"date": "15 Sept 2022", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Although it took a while for them to get back to me, once the interview process started it was very smooth. They required I do a case study and present at the interview to a panel of people who then asked me questions on my plan. They were not easy questions.", "Interview Questions": "They gave me a case study, I had to prepare a presentation, and then answer questions on my plan."}, {"date": "9 Mar 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Nature Conservancy in Sept 2022", "Interview Descriptions": "GHOSTED. Did a project for them, had a one on one interview with the hiring manager, then put through a grueling panel interview with 4 others. Was completely ghosted after that. Followed up for SEVERAL weeks after and never heard anything. So rude and inconsiderate of the hours I spent preparing for the interviews/doing the project.", "Interview Questions": "Experience directly related to the role, how I analyze data, behavioral based questions."}, {"date": "12 Oct 2022", "title": "Director of Marketing and Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Anchorage, AK) in Sept 2022", "Interview Descriptions": "The interview and application process was pretty standard and efficient. I applied through the online portal and about a month later, received a request to respond to several additional questions in writing. Of course I put a lot of thought into my answers but the questions themselves were not complex and it didn't seem designed to be onerous. I was called for an interview a week later, then had a second interview a week after that. a few days after the 2nd interview I had one more phone call with the chapter director and received an offer a few days later. All in all the process probably too two months, but once I started interviewing it was quick.", "Interview Questions": "There were a lot of questions like, \"Tell me about a time when you ...\" but they were not designed to be trick questions. They asked a lot of questions about my previous work experience, about campaigns I admire, times when I've had to overcome biases, how I approach a project, etc."}, {"date": "17 Aug 2022", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "The interview process is very rigorous and they provide feedback at each stage.\nThe interviews currently are mostly virtual. The interviews are done by panelists that works within the departments where the positions are drawn from.", "Interview Questions": "Why did you apply for this position?"}, {"date": "8 Dec 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Nature Conservancy in Aug 2022", "Interview Descriptions": "The interview was nice and compact. It was difficult but reasonable. The interviewers were nice and the atmosphere was good. I was able to ask enough questions that I wanted and it was possible for the interview to look at how the organization seemed to be.", "Interview Questions": "Why did you apply to the position?"}, {"date": "13 Jul 2022", "title": "Manager (Sustainability) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "The entire process took 3 weeks, from the time of submitting my application to accepting my offer. It went surprisingly fast yet slightly rigid.\r\n\r\nOne week after submitting my application, I received an email from the hiring team to complete a questionnaire (5 questions in essay form) asking about my interest and experience relevant to the job. The following day I was invited to take part in TWO interviews and submit 3 references (who were all called before the interviews).\r\n\r\nBoth interviews took place on the same day and within 4 days I received the news I was offered the job. \r\n\r\nThe interview questions must certainly followed only a structured format and they did not deviate (I suppose to ensure fairness and equality among all interviewees). All questions were different from what I was asked on the questionnaire. \r\n\r\nI made sure to prepare for the interviews by preparing to answer why I wanted to work at the organization, how I work in a team and how my experience can help the organization using the STAR approach as best as possible.", "Interview Questions": "Why this job and why TNC?\r\nWhat achievement are you most proud of?\r\nCharacter traits I like/dislike in a manager.\r\nSituational questions about how I would approach a task in the role."}], [{"date": "28 Sept 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy in Jul 2022", "Interview Descriptions": "The whole process took only about 1 month total. I applied and then received a phone screening request only a few days later. I did the screening immediately, and was told the salary range and position description. I was asked basic yes/no questions about my ability to perform the described duties, basic eligibility questions, and why I would be a good fit for the position. At the end she told me she would forward my application to the hiring manager. About a week later I had a virtual panel interview with three people from the team. It was an hour long interview with each person rotating through questions. They asked only 5 questions, which all came directly from the job description. The atmosphere was friendly and informal, but professional. About 1-2 weeks later I received a formal offer. I went through one round of negotiations before accepting. Overall I really appreciated how quickly the process moved because I was interviewing somewhere else simultaneously and it took much longer. Here it felt like filling the position was a real priority. ", "Interview Questions": "Tell us about yourself.\nTalk about a time you had to interact with different cultures and/or work across different time zones. "}, {"date": "11 Aug 2022", "title": "Market Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Jul 2022", "Interview Descriptions": "The interview has two phases. The first phase is a 30-minute phone screening interview. The second phase is a one-hour panel interview. The process is transparent and has a human touch, making it relaxing. Both interviews were virtual.", "Interview Questions": "What experience do you have in relation to this role?"}, {"date": "13 Aug 2022", "title": "Economist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Nature Conservancy in Jul 2022", "Interview Descriptions": "30 min first round interview with Senior Economist to gauge background and interest. Hour-long second round interview with Lead Scientist and another panel member. Behavioral questions in a discussion-environment - the panel comprised very nice people who showed genuine interest. Third round asked for a writing exercise (2 behavioral questions to understand work approach, professional strengths/weaknesses). Next step was a reference evaluation. A week later, I was asked if I am authorized to work in the US and if I would require sponsorship in the future. Informed them that I have a 3-year work permit under STEM OPT. Waited another week, found out I was rejected, no reason given. Asked for feedback - was told it was due to “minor differences in skill sets”. Not sure how I made it to the final round, passed reference checks, was asked about employment authorization and was THEN rejected for unknown skill differences.", "Interview Questions": "Why do you want to work for TNC?"}, {"date": "6 Jul 2022", "title": "Director of Finance and Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Little Rock, AR) in Jun 2022", "Interview Descriptions": "Very long and multiple panels, some on Zoom and some in person. Took almost three months to final round. Drove six hours to final in person session, which took half day of in person and panel questions. Covid also struck interviewer afterwards.", "Interview Questions": "Please review this example case and provide a written response. The case was four pages."}, {"date": "12 May 2022", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "The experience was very easy and comfortable. The questions where not difficult and easy to answer. The interviewer asked the right questions for the position. The process was overall good.", "Interview Questions": "Tell us something  about yourself "}, {"date": "19 May 2022", "title": "Video Editing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Arlington, VA) in May 2022", "Interview Descriptions": "It was a board of three people who all introduced themselves and their roles. The interview itself was an hour-long process of some pretty soft questions. Very professional and kind people.", "Interview Questions": "What's something not on your resume that you'd like to talk about?"}, {"date": "23 Jun 2022", "title": "Director of Operations and Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Nature Conservancy in May 2022", "Interview Descriptions": "Overall a very long process lasting 3 months:\r\n\r\n-After the submission of the initial application,  3 weeks passed and I was requested to complete a questionnaire. \r\n-After questionnaire submission, two weeks passed and I had introductory phone calls with local and nationwide recruiters then after 2 weeks had a panel interview.    \r\n-After 2 weeks had passed and I was requested to complete a detailed real-world assignment over a holiday weekend.  Which, in order to do a decent job, took a lot of time. \r\n-A week later I was informed that I did not get the position. \r\n\r\nWhile the process was exhausting, TNC did a decent job of being professional and keeping me up-to-date (even if to inform me that they were behind schedule).  The hiring process definitely has the opportunity to be streamlined to reduce applicant fatigue.  I don't think TNC truly realizes how much effort and energy the applicant puts forth to be a part of their team.  If they do, then they need to change their hiring process.", "Interview Questions": "Judging by the provided information, how would you interpret the overall financial health of the chapter?"}, {"date": "5 Jul 2022", "title": "Conservation Practitioner Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Nature Conservancy (Charlottesville, VA) in May 2022", "Interview Descriptions": "Conducted via Zoom due to COVID.  Two rounds over about four weeks.  First was with local hiring manager and their team.  Second was broader with colleagues from around the business unit.  Offer letter was prepared promptly after their decision.  After decision and acceptance, HireRight background check took about two weeks.", "Interview Questions": " Prepared questions but interview was conversational.  Questions were on point for the job and I was easily able to work in my prepared remarks.  Fitting in to the TNC is highly important so it is critical to have an answer to \"Why do you want to work here?\""}], [{"date": "17 Mar 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Very straightforward questions (roughly 8-13). There were about 3 people on the interview panel and they gave really good responses after each question rather than just moving on to the next.", "Interview Questions": "How did you become interested in conservation?"}, {"date": "3 Mar 2022", "title": "Conservation Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "After submitting application materials, I first heard back after a few weeks. The hiring manager requested a written response to a few question prompts. The next phase was a brief phone interview with a few staff, asking pretty basic questions, and then finally an in person interview with four staff. The in-person interview was certainly the most difficult and took the most preparation, however, they made each phase pleasant, and the other interview questions included on Glassdoor helped quite a bit. I spent a long time preparing for each interview. Turnaround was a little slow but that is to be expected with TNC. I was offered the job within a couple weeks after the final interview.", "Interview Questions": "From my perspective, how can we best address climate change. "}, {"date": "7 Feb 2022", "title": "Government Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Nature Conservancy", "Interview Descriptions": "I had two interviews - both on zoom. One was 30 minutes the next was about an hour. From the time I applied to when I was offered a position was about 3 months.", "Interview Questions": "My background, experience in the field"}, {"date": "8 Feb 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "It was very great to meet a large number of the team during the second interview and assess how I might fit in. The questions were run of the mill.", "Interview Questions": "How do you see yourself in this role? "}, {"date": "28 Jan 2022", "title": "Especialista Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Entrevista por vídeo. Gostaram do meu perfil e currículo, porém não obtive resposta sobre a contratação. O salário e benefício não foram informados. Deveria haver o retorno para o candidato ter uma noção do seu desempenho durante a entrevista.", "Interview Questions": "Fale sobre a sua experiência e formação profissional"}, {"date": "9 Jan 2022", "title": "Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (New York, NY)", "Interview Descriptions": "I had a pleasant phone screen that I thought went well, however I was ghosted afterwards despite attempts to follow up. A simple yes or no email would have been the polite and professional response.", "Interview Questions": "Why do you want to work here?"}, {"date": "13 Sept 2022", "title": "GIS Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Nairobi) in Jan 2022", "Interview Descriptions": "Two main interviews. First a screening interview and then a panel interview with a wider team depending on what position you are applying for. Very professional individuals and the questioning will mainly be based around the job", "Interview Questions": "What success looks like for the position within two years"}, {"date": "1 Dec 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "I had a 30 minute screening call with a third-party recruiter, a panel interview with three staff members, and finally my references were checked. Throughout the process, communication was between me and the original recruiter.", "Interview Questions": "How do you communicate with and track down staff members and partners from across the globe?"}], [{"date": "31 Jan 2022", "title": "Monitoring and Evaluation Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The Nature Conservancy (London, England) in Dec 2021", "Interview Descriptions": "First had a phone screening interview that lasted thirty minutes followed by a 1 hour panel interview all via zoom. This was followed by a skills assessment test. There were behavioral and skill specific questions. The interviews were good and professional and quite conversational in nature, so that eased pre-interview tension. No communication was made after the final skills test (more than a week elapsed) and that sucked because the initial process for the first two interviews and final assessment had consistent communication.", "Interview Questions": "Why do you want to work for TNC?"}, {"date": "7 Apr 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Nature Conservancy in Dec 2021", "Interview Descriptions": "Multi-step process, 15-20 minutes interviews with different team members. Very friendly interviewers, transparent process, no tricky questions. When one was prepared, it was easy to answer. Was a good interview overall.", "Interview Questions": "Common questions: tell me about your experience working this such ans such work component. "}, {"date": "17 Nov 2021", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Interview was with HR manager. Lasted between 30 to 40 minutes. Was asked questions about the assignment I completed the week prior to the interview (essay responses to 4 questions) and why I wanted the position. Interview was virtual.", "Interview Questions": "Why do you want this position?"}, {"date": "14 Feb 2022", "title": "Hidrólogo Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Nature Conservancy (Mexicali) in Nov 2021", "Interview Descriptions": "Pasé por dos entrevistas antes de que me notificaran que había sido seleccionado para el cargo. En la primera entrevista, los entrevistadores investigaron acerca de mi experiencia general en las responsabilidades del cargo al que aspiraba. En la segunda entrevista, las preguntas fueron más específicas, pidiéndome que explicara cómo atendería situaciones hipotéticas.", "Interview Questions": "* ¿Qué experiencia tienes en la coordinación de grupos de trabajo multidisciplinarios para actividades de conservación ambiental?\r\n\r\n* ¿Qué experiencia tienes en proyectos de hidrogeología?\r\n\r\n* ¿Qué tipo de variables de conservación has manejado?\r\n\r\n* ¿Cómo manejas tu tiempo de trabajo?\r\n\r\n* ¿Cómo asignas prioridades en el trabajo?\r\n\r\n* ¿Qué experiencia tienes abordando proyectos y temas para los que no cuentas con experiencia o conocimiento previo?\r\n\r\n* Háblanos de una experiencia (buena o mala) que te haya impactado en tu vida laboral.\r\n\r\n* ¿Cuál dirías que es tu mayor debilidad?\r\n\r\n* ¿Qué crees que necesitas aprender para desempeñar un buen papel en este cargo?"}, {"date": "26 Oct 2021", "title": "Donor Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "So far, my experience with The Nature Conservancy has been great!! I have enjoyed meeting all of the wonderful people, going through the interview process, and getting onboarded with the team. It is such an awesome organization, and I can't wait to keep growing with them.", "Interview Questions": "My own experience in fundraising."}, {"date": "17 Sept 2021", "title": "Media Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "The interview process included an initial interview with Human Resources, a panel interview with four people, and a final interview with the hiring manager for the role. All interviews took place over Zoom.", "Interview Questions": "What would success in this role look like to you?"}], [{"date": "10 Jan 2022", "title": "Analista Pleno Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy (São Paulo, São Paulo) in Sept 2021", "Interview Descriptions": "A entrevista durou um mês no total. Depois que meu Cv estava na base de dados eles mandaram um e-mail dizendo que gostaram do meu Cv e que era pra eu responder 5 perguntas sobre a área e minhas experiências. Depois de uma semana e pouco eles responderam o meu e-mail e me chamaram para um entrevista de painel (3 pessoas). Eles têm um script ja montado e conversam antes da entrevista para dizer quem vai fazer qual pergunta. Foi uma hora de perguntas, muitas sobre situações de meus trabalhos anteriores e como eu lidaria com situações no trabalho. Entrevista toda em inglês e um deles era nativo (estados unidos). Elxs são muitos educadxs e super explicam sobre a vaga, a TCNC, falam sobre si mesmos, etc. Depois dessa entrevista, elxs me reponderam em 1 semana  e fizeram uma proposta e eu aceitei.", "Interview Questions": "As perguntas são:\n\n1. sobre sua visão sobre a TNC\n2. são para entender a sua personalidade./perfil psicológico\n3. para entender como você se encaixa na TNC\n4. para que vc entenda do trabalho  e como funciona o trabalho.\n5. Eles fazem perguntas tio: Se vc tivesse tal problema e o que vc faria?\n6. \n\n"}, {"date": "14 Jun 2023", "title": "Geospatial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, TX) in Sept 2021", "Interview Descriptions": "Algumas perguntas básicas sobre quais foram minhas experiência profissionais passadas , quais habilidade (hard skills), quais softwares que uso etc. Quais os meus pontos fracos, os meus pontos Fortes etc.", "Interview Questions": "Quais softwares uso, quais tipos de análises tenho mais habilidades, quais meus pontos frasco"}, {"date": "16 Sept 2021", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy in Aug 2021", "Interview Descriptions": "Applied online and about a month later was sent a questionnaire to fill out and submit. A week later I had a 30 minute phone screen with a recruiter to go over my background and experience. I was then moved on to the next stage where I had a video call with 2 people from the department that lasted about 45 minutes. They asked questions very similar to what was on the questionnaire but a little more in depth. I was told a few days later they were moving forward with other candidates with more direct experience. \n\nThe recruiter was incredibly transparent, kept me up to date and informed me of any updates as soon as she knew, and was so nice to work with. Although I didn't get the job, every person I met with was incredibly nice and respectful.", "Interview Questions": "Talk about a time where you handled a difficult situation"}, {"date": "12 Jul 2021", "title": "Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "First a screening call with a few questions. The next step was an interview with a panel of people, and then possibly a third interview, although I did not get that far.", "Interview Questions": "Do you work better in a team or on your own?"}, {"date": "30 Jun 2021", "title": "Visual Content Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "They were very communicative throughout the quick, multi-step process and while I didn't get the position I was comfortable knowing that they had gotten a solid understanding of my skills, knowledge and personality.", "Interview Questions": "How do you respond to feedback and criticism?"}, {"date": "27 Sept 2021", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy in Jul 2021", "Interview Descriptions": "30 minute interview with 2 staff members and then a 45 minute interview with 3 staff members a week later. They checked my references but I did not receive an offer.", "Interview Questions": "Describe experience you have with outdoor work."}], [{"date": "10 Aug 2021", "title": "Prospect Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy in Jul 2021", "Interview Descriptions": "I completed a phone screen with an HR person, heard back the next business day requesting a panel interview, and then later that week had the interview over zoom. The following week, I got a personal phone call letting me know I wasn't selected.", "Interview Questions": "They asked me to describe a typical work day and how many units/departments/gift officers I support."}, {"date": "4 Jun 2021", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Received an email about 6-8 weeks after application.  A zoom interview for 30 min with the project leader and program supervisor.  They will interview others and have a finalist pool for the second round interview", "Interview Questions": "Q: Why TNC\nQ:  What do you look for in an employer\nQ:  What are the challenges you see in this particular project\nQ: Why you are a good fit for this position\nQ: Any Questions for us"}, {"date": "22 Jun 2021", "title": "East Africa Forestry Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Africa, MO) in Jun 2021", "Interview Descriptions": "Was generally smooth with screening interview followed by panel interview. The panel interview was initially supposed to be comprised of 5 panelists but ended up with 4 from different countries.", "Interview Questions": "Why are you the best candidate and would you approach the job if successful."}, {"date": "25 May 2021", "title": "Reporting and Technical Accounting Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I applied online and heard back about an interview about 2 weeks later. There was a phone screening followed by 2 rounds of video interviews. First round was two panel interviews, each with 2 TNC people.  Second round was two one-on-one interviews.", "Interview Questions": "Describe a time when you had to handle a situation delicately and how it went. "}, {"date": "7 Sept 2021", "title": "Agriculture & Climate Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Nature Conservancy in May 2021", "Interview Descriptions": "The first interview was a 30 minute \"screening\" interview. I was expecting behavioral questions, but the questions were more technical and job-specific.  The second interview was 45 minutes and consisted of a 10 minute presentation (for which I had a week to prepare), 5 minutes of Q&A, 20 minutes of resume and situational questions, then 10 minutes for me to ask questions. The questions were tough but thought-provoking.", "Interview Questions": "If you witnessed a microaggression in a meeting, how would you respond?\nWhat is your preferred program/software for this type of work? \nWhat do you think of XX science topic?\n"}, {"date": "25 Jun 2021", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in May 2021", "Interview Descriptions": "Applied online and got a first-round interview. Thought the interview went well as it went more like an informal conservation, but guess I was wrong because I didn't move on.", "Interview Questions": "what drove you to apply to the nature conservancy?"}, {"date": "31 Aug 2021", "title": "Coastal Adaptation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Houston, TX) in May 2021", "Interview Descriptions": "Two rounds of interviews, each of the interviews were with two people (project manager and someone from HR I believe), both of them were behavioral. They asked questions about qualifications, situation questions and about reasons for interest in the job", "Interview Questions": "Describe a time when you acted as a leader"}, {"date": "28 Apr 2021", "title": "Innovation Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Even though I didn't get passed the initial screening, I heard directly from the team and they were helpful and considerate. The Director offered me feedback on my CV and submitted project.", "Interview Questions": "To submit a recent project I had completed. "}, {"date": "2 Apr 2021", "title": "Legacy Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Went through 2 interviews, one brief interview and a second more elaborate interview. It was pretty straightforward.  The interviewer was very respectful and there were 2 people interviewing me the second time", "Interview Questions": "Why are you interested in this position?"}], [{"date": "16 May 2023", "title": "Enterprise Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Nature Conservancy (Ciudad de Mexico) in Apr 2021", "Interview Descriptions": "Standard. I had a technical written test before. It was a panel interview composed of 4 people from different departments. Several questions related to how my experience matched the position requirements.", "Interview Questions": "How does your experience match the position?"}, {"date": "20 May 2021", "title": "Policy Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA) in Apr 2021", "Interview Descriptions": "A few weeks after the general application closed, I was given a slightly more detailed job description and asked to submit an additional paper on why I felt I was a good candidate for the position. I was then asked to do a 30-mintue phone interview, followed by a panel interview (via zoom). I was then asked for references.  I did not receive the first position, but was instead directed towards another one that also fit my background/qualifications. I went right into the panel-interview phase (again via zoom) and received an offer.", "Interview Questions": "How would you approach working with a team of people from diverse backgrounds?"}, {"date": "18 Mar 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "The interview was conducted over the phone. The interviewer did not ask many technological questions, but asked why I want to join the organization. The entire interview was less than 15 minutes.", "Interview Questions": "Why I want to join the organization"}, {"date": "25 May 2021", "title": "Financial Analyst & Grants Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Sacramento, CA) in Mar 2021", "Interview Descriptions": "I had a phone screen with the hiring manager, followed by several one-on-one interviews with TNC staff that work with the role being filled. The final interview was a meeting with the department director. The whole process took about three weeks from the phone screen to accepting an offer.", "Interview Questions": "Several \"describe a time when\" questions."}, {"date": "12 Apr 2021", "title": "Digital Content Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA) in Mar 2021", "Interview Descriptions": "The process was very selective.  They require 3 interviews: one with the Hiring Manager, then a panel interview, and a final one with the Director of the area. The entire process took around 3 months.", "Interview Questions": "What strategic initiatives have you successfully implemented in your previous role?"}, {"date": "22 Feb 2021", "title": "Grant Writer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Chicago, IL)", "Interview Descriptions": "Very positive, with formal q and a, all managers involved in initial interview process. be sure to prepare regarding different initiatives in their portfolio. Included extensive written work and phone interview prior to in person interview.", "Interview Questions": "What is the most threatening thing to our planet, in your opinion? If a grant was managed in error, how would you correct that information to the funder?"}, {"date": "18 Feb 2021", "title": "External Affairs Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Nature Conservancy (Los Angeles, CA)", "Interview Descriptions": "Fair interview process, very nice interviewers. Very factual and professional. No common HR questions about \"Tell me about yourself\" and \"Why should we hire you\". There were only job related questions and tasks to solve.", "Interview Questions": "Imagine you are in this job related situation. What do you do to achieve your goal. \n"}, {"date": "8 Mar 2021", "title": "Executive Operations Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Feb 2021", "Interview Descriptions": "I had two rounds of interviews over zoom. Great questions, very upfront and honest about position and the needs they had for the organization. Great people. When I received my rejection email it was professional and personalized. I felt truly valued despite not receiving the offer. While I was disappointed, I did not feel my time had been wasted.", "Interview Questions": "Tell us about yourself, give examples of things relevant to the job description, what are your greatest strengths, and how would they translate to the position."}], [{"date": "8 Aug 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Nature Conservancy (Chicago, IL) in Feb 2021", "Interview Descriptions": "Verbal and written assessment was fairly easy. Nice interactions during interview process. Good benefits. Round table of questions to candidate from different staff members made it feel impersonal and less focused", "Interview Questions": "How would you report on a grant that had shifted directions?"}, {"date": "19 Jan 2021", "title": "Volunteer Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "1. Self-introduction, about three minutes\n2. One-to-one questions & answers, about ten minutes\nquestions are related to your major, work experience, activities and hobbies\n3. Project introduction, about five minutes\nprojects are related to the role of department", "Interview Questions": "Why you choose The Nature Conservancy?"}, {"date": "12 Jan 2021", "title": "Legal Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Process started with one short interview over the phone. The second interview was in-person and included a test. The test was short and included some basic skills questions. I also had to follow instructions and draft a letter.", "Interview Questions": "What are your greatest strengths/weaknesses?"}, {"date": "3 Dec 2020", "title": "Internal Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Very thorough. After submitting my CV, I was sent a questionnaire with personal and job-specific questions. This was followed by a video conference call to discuss submitted answers and additional questions with 3 staff members.", "Interview Questions": "Why do you want to work at TNC and what interests you about this position?"}, {"date": "2 Dec 2020", "title": "Stewardship Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "All that was required was a resume and a cover letter. I did both, reached out a few times, and didn't hear back as to if I was going to be hired or not.", "Interview Questions": "Why do you want to become a Steward?"}, {"date": "9 Mar 2021", "title": "Government Affairs Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Minneapolis, MN) in Dec 2020", "Interview Descriptions": "I had a roughly 30 minute phone interview with a member of the HR staff as part of the first round of the screening process. Very conversational in nature, centered mostly around previous work experience.", "Interview Questions": "What skills do you think you could bring to this position? "}, {"date": "15 Dec 2020", "title": "Grants Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Alexandria, VA) in Nov 2020", "Interview Descriptions": "The interview process was conducted via two virtual interviews on Zoom with different members of the hiring team and my future supervisor, with additional communication before, after and between interviews via email.", "Interview Questions": "What is your learning style?"}, {"date": "11 Dec 2020", "title": "Marketing Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Nov 2020", "Interview Descriptions": "After applying through their website I was asked to complete a questionnaire. After sending in my answers I quickly heard back from the manager. From there, I received a 30 minute phone interview.", "Interview Questions": "What have you learned when presenting data to colleagues? Tell me about your past experience. Give an example of a specific analysis presentation you gave. "}, {"date": "28 Sept 2020", "title": "Gift Planning Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy (Washington, DC)", "Interview Descriptions": "Standard interview process. \nHead of the team contacted me for a 30 minute long screening.  She explained the job and what the position entailed.  Then went on to ask me a couple of questions. Heard back after a 10 days.", "Interview Questions": "How do you handle doing mundane work?"}], [{"date": "17 Jun 2021", "title": "Executive Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Nature Conservancy in Oct 2020", "Interview Descriptions": "Very thorough process, included a questionnaire, screening interview, and then a 2-hour interview with higher ups. The questions in the thorough interview were complex and detailed. Definitely not for the faint of heart, but I think they really got a feel for their candidates. There may have also been a final interview with the top person.", "Interview Questions": "Why do you want to work at the Nature Conservancy?"}, {"date": "25 Aug 2020", "title": "State Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at The Nature Conservancy", "Interview Descriptions": "Professional. Lengthy. Great Communication throughout. I did not get the job and want to work there. I was recruited, did a phone interview (informal), two group interviews, a one-one with the supervisor and an employee interview.", "Interview Questions": "They dove deep on motivations and real-word challenges of the role.   Other questions were not difficult but definitely pointed. You had to be able to identify your own weaknesses and prep for it.            "}, {"date": "21 Aug 2020", "title": "Restoration Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "I interviewed over Skype because I was located across the country from the position location.  The interviewer was very kind and open, which helped make me feel comfortable and welcomed.", "Interview Questions": "Why did I want this specific job?"}, {"date": "18 Aug 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I did not pass to the interview round, but one of the first filters is to complete a questionnaire with questions in a short-essay form. I had 2 days to complete it and send it.", "Interview Questions": "Some of the questions were on my interest in the position, the experience that would allow me to succeed in the organization and the position. There were other questions such as salary expectations and travel availability."}, {"date": "19 Sept 2020", "title": "Email Production Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Arlington, VA) in Aug 2020", "Interview Descriptions": "After a 30-minute video interview, I was asked to complete an assignment by creating an email template by altering existing HTML code, inserting header image, and answering a series of questions. It's been 6 weeks since I submitted my answers, and I haven't heard back from anyone. I sent a follow up email, still nothing. I find it extremely unprofessional. If you are asking candidates to spend their time on assessments, you should at least have the courtesy to follow up.", "Interview Questions": "You know that you can only send one email to support the promotion of one petition this month. After reviewing each of the three petitions’ content on nature.org (see links above), which would you choose, and why? What tracking/sourcing elements would you suggest we put into place to track the performance of the campaign and the long-term value of member retention? How would you segment your audience(s) and what email messaging content would you send to each? "}, {"date": "7 Jun 2020", "title": "Policy Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "First round was very technical, with questions about specific policies and my knowledge and experience with them. Did some deep research on the content to prepare, but this was a technical interview where they didn't want to get to know you, but wanted to know what you know.", "Interview Questions": "What was a time you had to convince someone of something?"}, {"date": "5 Nov 2020", "title": "Laramie Foothills Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Nature Conservancy (Boulder, CO) in Jun 2020", "Interview Descriptions": "While I was nervous for the interview process, it was more like a conversation between two people. There were no curve balls with interview questions. After the interview I was notified in  a few days that I'd be starting the following Monday.", "Interview Questions": "What are your career goals and how does this position aid in you professional career?"}, {"date": "12 Apr 2020", "title": "Stewardship Field Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "Basic questions about conservation experience.  Mainly focused on experiences with job duties (i.e. invasive species removal and conservation easement monitoring). Took about half an hour and heard back within 2 weeks.", "Interview Questions": "What strategies and methods do you use for conservation easement monitoring?"}, {"date": "26 Jan 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy in Apr 2020", "Interview Descriptions": "Wonderful experience. The interview was done with several individuals sitting in on a zoom. They were all kind and asked reasonable questions. They all spoke about their own work and were informative about the position I was applying for.", "Interview Questions": "Have you worked with power tools before?"}], [{"date": "2 Mar 2020", "title": "HR Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "12 interviews over the course of 2 months (some virtual and some in person). Thoughtful case studies at each interview so I felt like I was getting good intel on the job I was coming into through the interview process. Communication back to me as a candidate was timely.", "Interview Questions": "What experience do you have leading diversity and inclusion efforts? "}, {"date": "20 Feb 2020", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "I sent a cover letter and CV, and was contacted for a first interview by Skype, which was very professional and friendly. I had a second interview in-person, and was advised one week later that I had been selected. The full process (form sending CV to receiving offer letter) took 4 months.", "Interview Questions": "How do you see yourself in 5 years? What do you know about TNC? What do you think are the best qualities needed for your position?"}, {"date": "19 Jan 2021", "title": "Finance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Lima, Lima Region) in Feb 2020", "Interview Descriptions": "Got an email with basic screening questions related with the role and also motivations about climate change and non-profits. Then interview with manager with classic questions, then a financial case explaining how a donation was going to be used (here they wanted to see how easily I understood the industry and also excel skills for presentation and minimize iterations). Presentation  of case to a panel. All of the interviewers were very nice, it was like talking in a business school. Everything was online, and it was before the pandemic. I got the job, and we are doing everything online now.", "Interview Questions": "Motivations for non-profits\nRelated past experiences that matches job description"}, {"date": "3 Jan 2020", "title": "External Affairs Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "I applied online and about two months later got asked to do a phone interview. About a week after that I heard back to come in for an in-person interview with five people. Really nice and welcoming people, interview went well, but took them a long time to get back to me saying they were moving ahead with someone else", "Interview Questions": "Asked about the importance of geospatial data in relation to policy work, if I've used more external or internal data systems in my past roles, how I stay organized and on top of multiple deadlines, etc. "}, {"date": "23 Oct 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I submitted an application, participated in a 30 minute phone screen, answered 5 short essay questions, participated in a 1.5 hour in-person interview with 6 people on the interview panel, participated in a 30 minute interview with a Board member, participated in follow-up interviews with 4 staff, and then received an offer.", "Interview Questions": "Customized scenario questions based on my position. Also asked \"What is something new that you've done recently?\""}, {"date": "21 Mar 2023", "title": "Water Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Nov 2019", "Interview Descriptions": "Interview at TNC offices in bogotá. I was interviewed by the staff of TNC. (3 in total). The interview was in Spanish and English. They asked me for my professional experiences and how to solve problems related with the job vacancy", "Interview Questions": "Tell me about your professional experience and how it matches with this vacancy"}, {"date": "5 Sept 2019", "title": "Foundation Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Nature Conservancy (Brunswick, ME)", "Interview Descriptions": "I applied online and was contacted about a week after the application deadline to schedule a phone screening. This was followed by an 90-minute in-person panel interview and then a less formal 1:1  meet and greet. The team requested my references shortly after the 1:1 and then extended an offer about 10 days later.", "Interview Questions": "How do you gain the trust of and collaborate with team members?"}, {"date": "16 Aug 2020", "title": "GIS Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy (Albany, NY) in Sept 2019", "Interview Descriptions": "Initial and second interviews were conducted virtually and began by discussing myself as a candidate, my background, and my interest in the Nature Conservancy. By the second virtual interview the outline/ duties of the position were discussed and was structured like a forum to get to know the position I would potentially fill, and to address any questions I had. By the in person interview It was essentially just checking knowledge of GIS processes and discussing ways in which I problem solved and troubleshot problems in the software in my own projects.", "Interview Questions": "What should you do if you are struggling (for example) with a function in GIS  that is slowing your work, and you are not finding a solution? "}, {"date": "13 Nov 2019", "title": "Water Quality Speicialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Auburn, NY) in Sept 2019", "Interview Descriptions": "More interested in me as a person and my characteristics than reciting experiences from my resume. The interviewers were very nice but somewhat unclear as to position-specific tasks, which made interview somewhat more difficult.", "Interview Questions": "Toughest question: who are naysayers in relation to the position and how would you convince them to see the value in your work "}], [{"date": "12 Aug 2019", "title": "GLOBE Summer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Skype interview - they asked character questions and gave example scenarios of dealing with interpersonal issues and asked how I would solve them. I was given an offer a couple of weeks later.", "Interview Questions": "What would you do in the following scenario: <something relating to interpersonal issues>"}, {"date": "7 Nov 2019", "title": "Engagement Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Nature Conservancy (Chicago, IL) in Aug 2019", "Interview Descriptions": "The hiring process was very long. Four months total.  I had one phone interview with a person from HR. It was about twenty minutes long and it was a positive experience. The person asked me questions about my event planning and meeting planning experience and my salary requirements.", "Interview Questions": "Can you describe your event planning experience? "}, {"date": "15 Jul 2019", "title": "Operations Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Atlanta, GA)", "Interview Descriptions": "Applied online and didn't hear anything for about a month before being offered an interview via email. First interview was with two supervisors and lasted about 45 minutes, and then about three days later I was offered a second interview with two different higher up people. This one lasted an hour and a half (forty five minutes over the allotted time!) and I thought it went great. About a week later I learned that I had not gotten the position", "Interview Questions": "What do you think the biggest learning curve would be?"}, {"date": "13 Jul 2019", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "After applying, I received a phone call one month later to set up a phone interview with the would be boss. Shortly after the phone call, I was invited for an in-person interview, which involved four people. Two weeks later, I received notice that I did not get the job and that is was a tough decision. The interviewees were all very nice.", "Interview Questions": "What is the best piece of feedback you've ever been given?"}, {"date": "10 Jul 2019", "title": "Especialista Financeiro Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy (São Paulo, São Paulo)", "Interview Descriptions": "Entrevista com gerente e supervisor da área de finanças. Foram feitas apenas duas entrevistas e o processo todo durou poucas semanas. As entrevistas foram 1:1 ou via Skype. Não ocorreram testes ou provas de conhecimentos, nem atividades em grupo.", "Interview Questions": "Experiência prévia na área, como se sente ao trabalhar para um ong."}, {"date": "11 Jun 2019", "title": "GeoDesign Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "The three interviewers asked simple questions about my GIS experience and relevant interests.  The asked about my experience with cartography, vector and raster analysis. It was fairly informal and quick.", "Interview Questions": "Explain your experience with raster and vector analysis. "}, {"date": "15 Jul 2019", "title": "Assistente Administrativo Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy (Brasília, Federal District) in Jun 2019", "Interview Descriptions": "A entrevista é bem completa, de caráter qualificatório, exigindo também da pessoa uma boa redação. As perguntas são bem objetivas para o candidato, exigindo dela respostas claras, concretas e simples.", "Interview Questions": "O que faz você trocar de local de trabalho?"}, {"date": "22 May 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Two steps. First one is via Weixin. HR asked me about the educational background, technique experience, weekly availablity via if hired. The second interview was via phone call with a group of candidates, competences and etc.", "Interview Questions": "Questions were about self-introduction,  why we should hire you? What you can bring to our team?"}, {"date": "6 Apr 2019", "title": "Long Island Sound Program Coordinator (Can't Remember Exact Title) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "First I received a phone screening then an in person interview. There were three people conducting the interview (this may not always be the case but this particular job had a grant). They were all very friendly.", "Interview Questions": "Have you ever been in a situation where you are talking to people who disagree with you?"}], [{"date": "30 May 2019", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy (Washington, DC) in Apr 2019", "Interview Descriptions": "Really good interview experience, first a phone interview and then on site to meet the team, finally meet with the director. The whole interview process runs very smooth, they always have the instruction about next step and response my email in time. What impressed me was before the onsite interview, they emailed me about the interview panel info with the bio of each one of them, that was very helpful.", "Interview Questions": "Why do you want to work for TNC"}, {"date": "14 Mar 2019", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "Phone screen with hiring manager and in-person interview with three people. She gave me an assignment a few days before the interview. Overall it was a slow but decent process. Would have appreciated more time to complete the exercise.", "Interview Questions": "Tell me about yourself."}, {"date": "3 Jan 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Shanghai, Shanghai) in Mar 2019", "Interview Descriptions": "I sent my resume via email. Then I was contacted by HR in Beijing to schedule a phone interview though I applied for a position in Shanghai. The audio interview was conducted by two people and lasted for about 30 mins. I was approaved on the phone and asked to go to the office for further explanation.", "Interview Questions": "What knowledge do you think you can apply to our work? "}, {"date": "12 Apr 2019", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Los Angeles, CA) in Mar 2019", "Interview Descriptions": "I applied online towards the end of their application window and heard back within 10 days to participate in a video interview. The video interview was pretty standard, just describing the position in more detail and how it fit within the company overall. I interviewed with what would have been my team lead and she gave a very good description of her team and qualities she was looking for in the new hire. The interview questions were pretty standard, and I felt she was just trying to tease out personality and overall skills. \r\n\r\nI was then invited for a second in person interview at their office with about 5 other employees. The second interview was much more challenging from my perspective, it lasted about an hour and the questions were much more tailored towards the position which was heavy in communication and excel use. I honestly could not have prepared in advance for the second interview because the questions were SO specific (describe a time you pulled a report using excel, and describe specifically what functions within excel you used). The interviewers were all nice and respectful, and left some time for other follow up questions within the interview so it wasn't extremely rigid. While I felt like I fit the position I believe I lacked sufficient Excel experience and that was a deciding factor in me not getting a job offer. Overall the interview process was a little long and drawn out, but I never had a negative experience.", "Interview Questions": "What are three things you would bring to this team?"}, {"date": "30 Apr 2019", "title": "Grantmaking Initiatives Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Nature Conservancy (Minneapolis, MN) in Mar 2019", "Interview Descriptions": "After the cover letter and resume, I was invited to submit both a writing sample relevant to the role as well as three pages of narrative responses to five questions.  Then, a video conference first interview, an in-person second interview and a final informal phone conversation with the hiring manager.  Then, references were checked and an offer was made.", "Interview Questions": "Describe what you're looking for in an ideal team member?  How would you rate yourself on the attributes you consider important?"}, {"date": "10 Sept 2020", "title": "Associate Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Mar 2019", "Interview Descriptions": "Fairly standard hiring process. Initial screening call; call with potential manager; and in-person interview with leadership and other members of the team. Straightforward questions. TNC is a large, complex organization and had lots of questions about how one would navigate the complexity.", "Interview Questions": "How would you navigate a large, complex organization?"}, {"date": "28 Apr 2021", "title": "Seasonal Conservation Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Cape May, NJ) in Feb 2019", "Interview Descriptions": "Informal, casual discussion style of interview in person. Looking to see a balance of interest and knowledge in wildlife conservation along with hands on experience with tools, equipment, etc. They look for fit over qualification.", "Interview Questions": "What kind of experience do you have with power tools, machinery, etc.?"}, {"date": "13 Mar 2019", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy in Feb 2019", "Interview Descriptions": "I applied online through their website and heard back via email in about a week. The HR rep scheduled a phone interview for which I was to call them at a prescribed time. I called for the interview and got a voicemail. After a second attempt I sent an email to make sure I had the right number. About 4 hours later the HR rep requested we reschedule as something had come up. We connected the next day and spoke for about 30 minutes. Basic phone interview type questions. I was told I could expect next steps in the next week. After 7 days I emailed to inquire on status. No response. About 2 weeks after the phone interview I got an email letting me know they are moving forward with other candidates. \n\nFine experience while really rough on the communication. Would have liked to have moved on or gotten some feedback on what they were looking for.", "Interview Questions": "Why do you want to work for The Nature Conservancy?"}, {"date": "20 Apr 2019", "title": "Climate Change Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Jan 2019", "Interview Descriptions": "One interview was over Skype video chat and the other interview was a multiple hour in person lunch at a local restaurant with three employees asking questions. Questions were directly related to the work that I would be doing and how I handle multiple job aspects", "Interview Questions": "What ifs..."}], [{"date": "9 Jun 2019", "title": "Graduate Field Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The Nature Conservancy (Nairobi) in Jan 2019", "Interview Descriptions": "I believe the process was very thorough and fair. All applicants have an equal and fair chance in getting hired. The interview process was actually on very friendly and calm grounds, unlike some where the panel appear stiff, unwelcoming and a little judgmental.", "Interview Questions": "If you encountered a farmer with a farm that has a steep gradient or slope,what would you advise him or her?"}, {"date": "6 Mar 2019", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Los Angeles, CA) in Jan 2019", "Interview Descriptions": "I applied online and 3 weeks later received an email to begin the interview process. It was 3 interview in total. One on the phone with the hiring manager and 2 in person with  different team members.", "Interview Questions": "Many questions were specific to the job description. Read up on the job description and see how it matches your skills and experience before the interview.\r\nOther common questions:\r\nWhy do you want to work for TNC? \r\nWhat do you look for in team members (traits)?\r\nDo you prefer to work in a team or individually?\r\nHow did you handle a difficult situation?"}, {"date": "1 Nov 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Jan 2019", "Interview Descriptions": "Submitted a cover letter and resume.  Got an email back about 2 weeks later to schedule an interview.  The interview was done over the phone.  It lasted about 30 minutes.  I received another email a couple months later saying that I wasn’t the finalist for the position.", "Interview Questions": "Some were traditional, like how do you organize yourself?  Others were more unique, such as if you could take a trip anywhere, where would you go?  Where is your favorite place?"}, {"date": "30 Jan 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Minneapolis, MN) in Jan 2019", "Interview Descriptions": "The interview was very simple and nice. No hard questions were asked it was super casual. The interviewer was very kind and asked basic questions. Super easy. Nothing else really to talk about it was simple and straight forward.", "Interview Questions": "What do you wanna gain from this experience?"}, {"date": "12 Mar 2019", "title": "Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Hailey, ID) in Jan 2019", "Interview Descriptions": "Applied from posting at Indeed. Got called for a 30-minute phone interview and then a 1-hour in-person interview with a panel of 4 people. The panel asked a lot of questions about my background and specific skills that would be utilized in the new job.", "Interview Questions": "Was I familiar with Excel and if so, what did I like most about Excel."}, {"date": "5 Jun 2019", "title": "Climate Change Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Jan 2019", "Interview Descriptions": "It was fairly long with a lot of steps.  First was a skype interview with the hiring managers, then an in-person series of interviews with team members.\r\n\r\nThe hiring manager was wonderful at keeping me informed throughout the process and although they asked some challenging questions, the team was very nice.", "Interview Questions": "How would you spend the first 30/60/90 days on the job?"}, {"date": "30 Dec 2018", "title": "Urban Conservation Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The Nature Conservancy", "Interview Descriptions": "Applied online. Was contacted 4+ weeks later by HR who performed a salary screening and asked a few basic questions. 2nd Interview: Phone interview with two employees. 3rd Interview: In-person interview with three employees who asked many of the same questions as in the 2nd interview. Did not make it to the 4th round interview.", "Interview Questions": "What would others say are you strengths and weaknesses?"}, {"date": "27 Mar 2019", "title": "Conservation Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Minneapolis, MN) in Nov 2018", "Interview Descriptions": "The interview process involved an e-mail screen with two quick questions to confirm that I was ok with the hours and compensation of this position.  Three weeks later, I received an invitation for a 30-minute phone interview. The phone interview took place two days later. The interview consisted of questions about my work history and experiences as well as an explanation of the job. The person interviewing me was kind and happy to talk to me about this new position as well as what The Nature Conservancy organization does as a whole. Almost one month later, I received an e-mail explaining that I did not get the position. They explained that the reason it took so long was because of a very large pool of applicants.  \r\n\r\nAlmost a month after this, I received an e-mail from the person I did a phone interview with. She had run across a similar position that was posted for a different organization, and was thoughtful enough to let me know about it. That was a nice gesture!", "Interview Questions": "Can you describe one part of a previous or current job that you would rather not have to do? "}, {"date": "26 Sept 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "I had an initial questionnaire to complete, then a phone screening. Then an \"in person\" panel interview that was completed virtually because I live elsewhere. The interview was long for a behavioral-only that did not include a presentation or case study. One-on-one behavioral interviews with five different people.", "Interview Questions": "Tell me about a time you were proud of your work. What did you accomplish? What would have made the experience even better?"}, {"date": "19 Nov 2018", "title": "Manager of A New Initiative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Nature Conservancy in Oct 2018", "Interview Descriptions": "It went quickly, from the cover letter and CV to the interview - seems there was only one round.  Via a Skype like video tool I was interviewed by four people, sitting in three different countries (and me a fourth).  They were engaging and easy to speak to, knowledgeable about their field.  Some following of a script, but with enough detours to avoid a too-stilted conversation.  Be warned that loading your CV into their 'tool' is going to take a lot of your time though - it machine reads it and, in my case, messed it all up.  You did not have a choice!", "Interview Questions": "What values would you say you hold."}], [{"date": "24 Jan 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Nairobi) in Sept 2018", "Interview Descriptions": "I was called after shortlisting to be informed and given a date for a phone screening, informed on what they expect and asked if everything was clear plus planned for the 1 on 1 interview.", "Interview Questions": "To describe my role as per my understanding"}, {"date": "23 Aug 2018", "title": "Urban Conservation Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "I applied for the position in August 2017 and was contacted for a phone interview in November. Two weeks after, I was contacted for an in-person interview. The interview went extremely well and the person who would have been my boss let me know that I made it to the second part of the interview. I interviewed with two other directors which was even more positive than the first. I left and sent a follow up email; no reply. Two weeks later I sent another email again thanking them and asking if they made a decision; no reply. 8 months later I sent a handwritten letter; no reply. Very discouraging and I wish there could have at least been some communication that I wasn’t chosen. Working at TNC in this position was my dream job and I wish they were more responsive!", "Interview Questions": "How do you manage your priorities?"}, {"date": "6 Aug 2018", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "First round was a 20-minute phone interview, within a few hours I was notified that I would advance to the next round. Second round was also a phone interview a few days later, but 45 minutes instead of 20. Was told third/final round of the process was an in-person interview with the CEO. Both interviewers were friendly and the conversation was great.", "Interview Questions": "What kind of communications strategies have you employed in your previous positions?"}, {"date": "13 Sept 2018", "title": "Conservation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Nature Conservancy in Aug 2018", "Interview Descriptions": "I applied online through their portal. After two months, I received a phone interview invitation. After a few weeks I was called for an interview, which took place with five members of staff. After two weeks I got an offer and started working two weeks after that. Needless to say, the process was lengthy, but the people were really wonderful all throughout and I am really happy with the general outcome. It was definitely worth it!", "Interview Questions": "Why do you want to work for TNC?"}, {"date": "18 Jul 2018", "title": "Government Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Nature Conservancy", "Interview Descriptions": "phone interview lasting about 30 min\r\nit's more like a casual conversation about my past experiences and interests in environmental issues.  Since it was a position working with government agencies, I was also asked to describe my communication skills.", "Interview Questions": "do you have experience in meeting support? "}, {"date": "20 Oct 2021", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Nature Conservancy (Toronto, ON) in Jun 2018", "Interview Descriptions": "The first interview went very well - the team was extremely friendly and I felt like I made a genuine connection. I was brought on for a second/last interview and it had seemed completely different.  I don't know if it was a tactic but I did not feel like I was interviewing with the same people. All that aside, however, it was still a good experience.", "Interview Questions": "What was one of your biggest challenges during an event and how did you handle it?"}, {"date": "14 Jan 2021", "title": "Agricultural Program Specialist, AFRPS Auditor/Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Jun 2018", "Interview Descriptions": "They were very flexible as I wasn't living in their town to do a phone interview. She asked pretty standard questions, however I didn't feel like we connected. Maybe because there was no face-to-face, or otherwise. Wish they had given more information about what the job would entail, I left the interview still not completely understanding.", "Interview Questions": "Why do you want to work for TNC?"}, {"date": "22 Aug 2018", "title": "Prescribed Fire Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Loveland, CO) in Jun 2018", "Interview Descriptions": "It was an hour long, round-table setting with a four person panel. They took turns asking questions and after my answers there was often dialog that followed. It was fairly informal and comfortable. It didn't feel like you were in front of a firing squad but more like a chat with fellow professionals trying to gauge your experience and if you would be a good fit for the team.", "Interview Questions": "How would you handle the scenario of pile burning when you are the on-call burn boss and we are projected to get 2-3 inches of snow?"}, {"date": "16 May 2018", "title": "ESTÁGIO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at The Nature Conservancy (Rio de Janeiro)", "Interview Descriptions": "o processo seletivo foi simples e completo, rapido processo seletivo, apenas 2 entrevistas via Skype com diferentes membros da empresa. muito simpáticos e entrevista informal, oportunidade para fazer perguntas", "Interview Questions": "fale sobre vocês, quais seus interesses, porque a TNC"}], [{"date": "29 Apr 2018", "title": "Conservation Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I was contacted for an interview about five weeks after submitting the application. The interviewers were fine, but the questions they were asking did not really match the job description.", "Interview Questions": "What technologies do you use to stay organized?"}, {"date": "16 Apr 2018", "title": "Finance & Operations Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at The Nature Conservancy (North Bethesda, MD)", "Interview Descriptions": "First there was a phone conference interview scheduled with 2 individuals. Then I went in the office to interview. Odd- interviewed with 3 different people, all separately over the course of about an hour", "Interview Questions": "What would your co-workers say about you?"}, {"date": "4 Apr 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "There were three stages to the interview process: \r\n\r\n1st: Phone interview (group)\r\n2nd: In-person interview (group)\r\n3rd: Skype interview (one-on-one) \r\n\r\nYou can tell this is a stellar team and everyone was very engaged during the interview. Plus, the HQ office is lovely - sporting landscape photography and a wall of live plants. Very cool!", "Interview Questions": "The team asked great, poignant questions. Be prepared to answer several, \"Tell me about a time when you...made a mistake...had to coordinate with lots of people....organize a project on your own...etc.\" questions.  \r\n\r\nAlso, there are plenty of standard questions you can prep for: Why do you want to work here? Why this role? Tell us about yourself. \r\n\r\nWhat's comforting is I felt I was able to prepare for these interviews by doing some well-rounded research regarding common interview questions."}, {"date": "14 Mar 2018", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy", "Interview Descriptions": "Very professional roundtable interview with 4 staff of different levels, two of which would be my direct reports. Only 1 round of interviews which was nice. Good questions about me and my background. Interview was onsite at their office in PA. Didn't get a lot of detail about the job however.", "Interview Questions": "N/A"}, {"date": "11 Sept 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy (Phoenix, AZ) in Mar 2018", "Interview Descriptions": "Pretty smooth and easy.  Applied online then waited for a response.  Had a phone interview and then went into office for interviews.  Met several people.  Had a call back 2 weeks later", "Interview Questions": "Hours that I was available"}, {"date": "13 Feb 2018", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Nature Conservancy (Arlington, VA) in Jan 2018", "Interview Descriptions": "Applied online and was contacted to fill out a brief questionnaire about 1-2 weeks later. Had a phone interview about a week later and then had an in-person interview at The Nature Conservancy a week after. The whole process took about 5 weeks.  Everyone who I spoke with was very friendly.", "Interview Questions": "Name an area that you feel you need more training/practice in and what have you already done to improve? "}, {"date": "21 May 2018", "title": "Development Projects Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy in Jan 2018", "Interview Descriptions": "Overall, a great experience. At first I had received an email saying I didn't get the job - this was a mistake and I was actually called for a phone interview 2 weeks later! A pleasant surprise... I spoke with two people on the team over the phone. My in-person interview was with one of the same women from the phone interview plus her supervisor, who is the team leader. I already had an offer on the table elsewhere at this point, and when I told them this they were able to fast-track the final interview, which was more of a meet and greet with the rest of the team that I hadn't met yet. It was more casual, off-site at a cafe near the office. Everyone had a chance to ask me questions, and I had the chance to ask everyone else questions, and it was really great. They offered me the job at the end of the week. The whole process took about 2 weeks from the phone interview (about 4 weeks from the time I submitted my application).", "Interview Questions": "What are you short-term and long-term career goals?"}, {"date": "22 Nov 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "There were 2 phone interviews, 1 in-person individual interview, 2 face-to-face panel interviews, and 1 written test. I don't think the interviewers have communicated with one another internally because the questions were repeated from time to time. They were all skill-based questions. They also tried to understand my interest and working style through a few behavioral questions. All of the interviewers were really friendly and helpful. They were very willing to spend time to really explain to you about their jobs and the organization structure & culture. However, it seems that none of them had a good understanding about the role or its job responsibilities - I've heard inconsistent / conflicting answers and expectations from the hiring manager, the MD, and the various different colleagues who were supposed to work closely with the person. More importantly, the HR wasn't helpful - the selection process was unclear; there were a few last-minute interviews; even though I was one of the final two candidates, the HR never shared updates about the recruitment status or responded to my follow-up email afterwards. I rather receive a \"yes\" or \"no\" from them...", "Interview Questions": "Nothing was unexpected; all standard questions. "}, {"date": "31 Jan 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at The Nature Conservancy in Nov 2017", "Interview Descriptions": "The overall process was poorly organized, with multiple last minute requests to be available to interview the following day, or, for example, receiving an email at 3PM on a Friday to notify me of a 9AM Monday interview.  For those currently employed, or with other responsibilities, that's not useful.  I had 4 separate 1:1 phone interviews with TNC staff from different programs; 1 phone based panel interview with 4 TNC staff, all senior level (e.g., state and continental director); and was asked to provide written responses to 5 questions within a 3 page limit.  Each of the single phone interviews focused on a specific skill area (communications/project management/collaboration) and situational responses to scenarios within those areas.  Some questions were very specific such as: \"describe a process for optimally allocating finances across a network of partners, ' or \"describe your approach to collaboration when you have no direct authority for any of the staff engaged.\" \r\n\r\nThe panel interview was more broad,  covering personal traits/values, interest and commitment to conservation,  why was I the best choice,  and then some specific management Qs, such as: \" how could you best demonstrate a return on investment to donors,\" or \"what are specific challenges in evaluating a dispersed network of projects.\"  \r\n\r\nI was given a few minutes at the end of each session to ask questions, and people were generally friendly throughout the process. I did receive conflicting information between TNC staff as to the nature of the position, and some seemed unclear how this position fit into the larger framework. That became an issue with the panel when something I was told by a junior level staff was contradicted by a senior level staff member. I also asked the panel about direct reporting lines as there seemed to be a range of people this position would report to based on statements they made, but received a vague response.", "Interview Questions": "N/A"}, {"date": "24 Mar 2018", "title": "Volunteer Legal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy (Washington, DC) in Nov 2017", "Interview Descriptions": "I applied through a job search website, and heard back after about 2 weeks. The interview was a basic phone interview, with relatively easy questions. Because I applied for the Latin American and Caribbean team, I had to speak to the interviewer in Spanish and Portuguese.", "Interview Questions": "Give me an example of a time when you had to use problem-solving."}], [{"date": "3 Jan 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy (Washington, DC) in Oct 2017", "Interview Descriptions": "Brief phone screening followed by an in-person interview with five staff. After staff interview, there was a writing test where they asked me to write a letter to a prospective donor.", "Interview Questions": "Where do you see yourself in 5 years, 10 years?"}, {"date": "20 Sept 2017", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I actually applied months and months ago. Months later I received an email to provide more details. I reviewed and submitted all of the  required materials. I never heard back again. I followed-up (politely) just to ask if the position was filled. That's the correct and professional thing to do. I never heard a word back which, in my opinion, is unprofessional. I wasted a lot of time on this \"interview project\". I thought The Nature Conservancy would at least let me know one way or another.", "Interview Questions": "Typical questions: why do you want to work here, etc. "}, {"date": "22 Aug 2017", "title": "Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at The Nature Conservancy (Conshohocken, PA)", "Interview Descriptions": "After a 30 minute phone screening I was invited to interview with three different people on the hiring team. Mostly standard interview questions, plenty of opportunity to ask questions about the work and culture.", "Interview Questions": "What is your greatest weakness?"}, {"date": "1 Aug 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Nature Conservancy", "Interview Descriptions": "I was interviewed by two staffers at once.  Both worked for different departments of the Nature Conservancy and wanted to help assess the best placement for me as an intern.  They were both very nice and professional. I felt like they did a really good job in figuring out where to put me and preparing me for what to expect once I started the job.", "Interview Questions": "Are you familiar with marine conservation?"}, {"date": "1 Aug 2017", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Three sets of interviews. First one was short and with a Project Manager over the phone. Second one was in person with two full sets of hiring managers. Third one was with the Director. Interview process was good and the questions were straight-forward.  The in-person panels had less technical questions and more situational questions.", "Interview Questions": "What is something that people misunderstand about you? "}, {"date": "17 Jul 2017", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Washing Tree)", "Interview Descriptions": "Video conference interview only. Video conference software worked very smoothly. No delay or static in the connection. Interviewer was prepared. Interview was with supervisor. No HR Pre-screening or phone call prior to the interview. Received a friendly email a few weeks later notifying me I would not be invited for further interviews, but invited me to apply again.", "Interview Questions": "Why do you want to work at The Nature Conservancy? "}, {"date": "18 Oct 2017", "title": "Conservation Planner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Phoneton, OH) in Jul 2017", "Interview Descriptions": "I submitted an online application and was contacted for a 30 minute phone screen. The next step was completing an assignment (paragraph responses to situational and other questions), followed by an interview.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "27 Mar 2018", "title": "Applied Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Nature Conservancy (Santo Domingo) in Jul 2017", "Interview Descriptions": "I applied many months previous to when I was interviewed. That was the worst part, I didn't know I had been selected for the interview process. After that, it went pretty smoothly. I was interviewed through Skype once (for 1 hour).", "Interview Questions": "What makes you the best candidate for this position?"}, {"date": "6 Nov 2017", "title": "Preserve Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy (West Palm Beach, FL) in Jul 2017", "Interview Descriptions": "Telephone interview with one manager, which was my first 'red flag' that I wasn't a serious candidate.  The organization is a non-profit which relies heavily on donors, - for both volunteer time and monitory donations.", "Interview Questions": "Ten typical questions including tell me about a time that involved a confrontation with the public and how you handled it. "}, {"date": "20 Aug 2018", "title": "Paralegal Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Nature Conservancy in May 2017", "Interview Descriptions": "Phone screening before in-person interview. Skills test was included as part of in-person interview. One group of staff members did first portion of interview then another group came in for the second part.", "Interview Questions": "On a scale of 1-10, how detail orientated are you?"}], [{"date": "15 Apr 2017", "title": "Stewardship Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Nature Conservancy in Apr 2017", "Interview Descriptions": "They interviewed over Skype for Business, and it's two to three people interviewing you at once, alternating who is asking the questions. This interview was with the Colorado chapter and I'm not sure if other chapters conduct their interviews in the same way. I have interviewed for them twice now, accepting the first offer for a seasonal position, and not receiving an offer for the second, although the processes were very similar.", "Interview Questions": "What do you know about the company?"}, {"date": "12 Dec 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Nature Conservancy (Duluth, MN) in Mar 2017", "Interview Descriptions": "I applied online, got an email for an interview about a month later with the scientist I would work with. It was a brief 20-25 minute Skype interview followed by calls to all three references.", "Interview Questions": "Elaborate on your previous experience (mentioned in your resume)."}, {"date": "2 Feb 2018", "title": "Counsel Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy (Arlington, VA) in Mar 2017", "Interview Descriptions": "Initial round was by Skype followed by a half day on in person interviews. Frustrating that the in person interviews all asked exactly the same questions. While I appreciate the goal of eliminating bias it produced a very superficial conversation and not sufficient opportunities to delve deeply into the job or by qualifications. \r\n\r\nThe supervisor for the position was very brusque and explicitly said she waslooking for someone willing to put in long hours at the office (no telecommuting). By the end of the day I was no longer interested.", "Interview Questions": "Give an example of a challenge at your current job and how did you handle it. "}, {"date": "27 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I was called for a phone interview and scheduled a slot for about 2-3 weeks later. The phone interview lasted about 30 minutes, and included approximately 4 people that worked at that Nature Conservancy office on similar issues.", "Interview Questions": "Why do you want to work at the Nature Conservancy?"}, {"date": "7 Feb 2017", "title": "Restoration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "Applied online via TNC website and phone interview to follow a few weeks later. Casual interview going through list of questions asking about education and experience with natural resource management.", "Interview Questions": "Experience in natural resource management "}, {"date": "25 Jan 2017", "title": "Donor Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA) in Jan 2017", "Interview Descriptions": "I applied on-line, then received an email requesting a time for a phone Interview. Within two weeks I received an email offering dates for an in-person interview, which was several weeks in the future. Then in-person interview with a five-person panel. Very pleasant people.", "Interview Questions": "Describe a difficult situation with a customer that you had to overcome."}, {"date": "18 Oct 2020", "title": "Donor Relations Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA) in Dec 2016", "Interview Descriptions": "Pretty standard and a positive process: phone interview, in person interview, references, job offer. Everyone was very kind. My in-person interview was two hours though. I was sure to bring knowledge of what the company is doing throughout the region and country.", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Oct 2016", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "After filling out a breif questionnaire, I had a phone interview and a skype interview. Ultimately I was not offered the position, but my overall experience was good. Interviewers seemed pleased with their jobs and were not intimidating at all.", "Interview Questions": "Why this position?"}, {"date": "8 Sept 2016", "title": "Waste of Time Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "Unethically long hiring process. Interviewers couldn't even answer simple questions such as \"what is your company culture like?\" or \"around how many donors do you deal with?\" They string you along with countless interviews with WAY too many people, only to ignore your calls for a week after a final decision was to be made. Extremely unprofessional and unorganized.", "Interview Questions": "What is your definition of  *job title applied for* ?"}, {"date": "21 Aug 2016", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "1 phone interview with two people and 1 Skype interview with three people. Both were straight forward interviews. No trick questions. All the people I talked to were very nice. It seems like an awesome place to work. I was pretty bummed I didn't get the job. I would definitely apply with this organization again.", "Interview Questions": "Was there a time you had to handle a conflict with employees and how did you handle this situation?"}], [{"date": "6 Aug 2016", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "The process lasted about 1.5 months. I have 2 phone interviews and a skype call. Everyone was very pleasant to speak to and even though I did not get the position they were very encouraging.", "Interview Questions": "They asked about my bottom-up management experience and style. "}, {"date": "1 Aug 2016", "title": "Administrative Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "The interview process was fairly standard. The employees at the company seemed very knowledgeable. I would encourage any future candidates to study the company and the position they are applying for well. The interviewers gave the impression that it is a very good company to work for.", "Interview Questions": "Standard questions, such as the candidates greatest strength and greatest weakness."}, {"date": "27 Jul 2016", "title": "Protection Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "After a brief phone interview, I met with a team of folks who worked throughout the state. They were very friendly and invested resources and time in the interview process. It was helpful to visit the office and see the work environment, which was professional yet relaxed.", "Interview Questions": "Most of the questions focused on the specific job and my experience with similar projects. They also asked about my preference for project management software/tools."}, {"date": "2 Jun 2016", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Everyone was really nice, the questions were more behavioral. Interviewers were interested in someone who was passionate about nature and conservancy. The only thing is no one contacted me to let me know I didn't get the position. I had to email several times for status updates until they finally told me I didn't get it.", "Interview Questions": "What would you do if you were trying to reach out to another team, and they weren't responding? Marketing is not most teams highest priority, and they sometimes will not respond."}, {"date": "12 May 2016", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Nature Conservancy (New Haven, CT)", "Interview Descriptions": "15 minutes pre-screening includes basic questions such as please introduce yourself, why TNC? Why this team? Why this position? What's is your visa status? Will you be willing to relocate to Colorado?. First round interview was 30-45 minutes including behavioral questions and a mini case. Second round would be a case that you need to send back a memo/financial models. Last round would be with a team director.", "Interview Questions": "- What TNC?\r\n- Why this team?\r\n- Why this position?"}, {"date": "6 Sept 2019", "title": "Director Climate Change Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Nature Conservancy (Arlington, VA) in May 2016", "Interview Descriptions": "Made it to the third round interview. After that I was asked to do a writing sample. Did not get offered the job.  In general, the people were very friendly. They questions were relevant to the job. I was asked to do a writing sample immediately after the second interview before there was any deliberation, but then was declined after the writing sample. I did wish that they had deliberated after the interview when I was not present, and then asked for the sample as a next final stage. As it was, it felt like they were asking for too much at once when they could have made a cut and saved time of the people they were interviewing, and likely their own time as well. I do think TNC is a good organization doing good things.", "Interview Questions": "How would you deal with having five supervisors for this position?"}, {"date": "2 Oct 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Nature Conservancy (New York, NY) in Mar 2016", "Interview Descriptions": "Group interview, mostly to see which candidates could actually live together for a month. Was actually pretty fun. Not all mentors were not present. Individual questions asked at the end of the group activities.", "Interview Questions": "What contributions can you make to a team?"}, {"date": "13 Sept 2017", "title": "GLOBE Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Washington, DC) in Feb 2016", "Interview Descriptions": "I was contacted for an interview after submitting the online GLOBE internship application - which was a painful process because they asked for several essays and letters of recommendation. The interview was done by two managers of the particular internship position. It lasted for half an hour. My Skype went wrong at the beginning and it took us 5 minutes to solve the problem, which is probably why they rejected me in the end. I should have double checked to make sure the connection was fine.", "Interview Questions": "Tell us an example that shows your leadership"}, {"date": "23 Feb 2020", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Arlington, VA) in Jan 2016", "Interview Descriptions": "Comprehensive with a panel and writing samples as well as one on one interviews with management.  Overall I thought they did a good job and It got at the key issues I was expecting", "Interview Questions": "What would your references say you were bad at?"}, {"date": "8 Dec 2015", "title": "Operations Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "Email with simple 8Q questionnaire to fill out. Reply back in a couple days to schedule in person panel interview at HQ - Arlington. Interviewed with 3 people. No difficult questions. They each took turns but not in an organized manner. Emailed them back the next day and couple more times over the following month. They didn't have the common courtesy to reply back. They hired from within.", "Interview Questions": "No difficult questions. related to job description or resume"}], [{"date": "25 Aug 2016", "title": "Philanthropy Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Nature Conservancy (San Francisco, CA) in Dec 2015", "Interview Descriptions": "Phone screen with someone who was not very good at selling the job. They seemed uninterested in their own position. The Interview was with 3 people in person and two people via Skype. Questions were generally behavioral in nature. Communication throughout this process was limited and very frustrating.", "Interview Questions": "Why the Nature Conservancy? Why this department?"}, {"date": "20 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "I submitted an application on the TNC website. A few days later I got an email asking to set up a phone interview. The phone interview was the following week. A few days after that, I got another email asking for references. I was offered the position a week or so after that.", "Interview Questions": "Why do you want to work for TNC?"}, {"date": "3 Dec 2015", "title": "Associate Director of Philanthropy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (San Francisco, CA) in Nov 2015", "Interview Descriptions": "The process was quite fast, they contacted me a couple of weeks after I applied to the position and arranged a phone interview. I didn't pass to the personal interview stage but honestly didn't understand the reason. They told me something about my experience that they must have noted since they first read it, so it was unsatisfying . The person in charge of the hiring process didn't show any passion or interest in their own job.", "Interview Questions": "Why did you apply for this role?"}, {"date": "27 Jan 2016", "title": "Program Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Reno, NV) in Nov 2015", "Interview Descriptions": "Got a phone interview a few weeks after applying. It was a moderately long interview with two people. Mostly tried to establish salary and hands-on conservation skills, though I'm still not sure what the job was since it sounded like a communications position from the job description. Most of the questions seemed to be based around a specific scenario, like other reviewers have mentioned it feels like a pop quiz, rather than an assessment of experience.", "Interview Questions": "How well do you know the following software/skills on scale to 1-5"}, {"date": "15 Oct 2015", "title": "Conservation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Nature Conservancy (Arlington, VA)", "Interview Descriptions": "Began with a phone screening with the managing director, relatively lengthy discussion, then a large group interview.  Seemed to be way too many people on the interview panel, each with relatively similar perspectives...not much to justify the size.", "Interview Questions": "Why did I think I was a good candidate?\r\nAsked me questions in spanish to prove fluency.\r\nRate different conservation and development projects, explain what works in my opinion and what doesn't.\r\nThinking about potential sources and my experience with fundraising."}, {"date": "28 Sept 2015", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "Posted job didn't match description of job once in the interview. I'm not sure they knew what they were interviewing for as it seemed to change each time I came in.  Incredibly long process due to staff schedules. Met with all levels of staff at different points in time - some in groups, some one-on-one.", "Interview Questions": "3 people need the director's attention. How do you prioritize those needs?       "}, {"date": "13 Nov 2015", "title": "Director of Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at The Nature Conservancy (Tesuque, NM) in Aug 2015", "Interview Descriptions": "The opportunity was brought to my attention from an internal recruiter as a possible good match. The interview was scheduled as a phone group of 4 about 1 month after submission. It took about 55 minutes and was back-to-back with other candidates. Each participant had 1 question prepared and after answering all the questions, there was time for one question from me.", "Interview Questions": "What are the steps I'd take over the next 3-5 year period to develop the program."}, {"date": "23 Jul 2015", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy (Arlington, VA) in Jul 2015", "Interview Descriptions": "A week after I submitted the application, I got a call from a recruiter asking to set up a time for an interview. There was a panel of three interviewers who asked me typical interview questions. A week after the first interview, I got another email asking if I was available for a second interview.", "Interview Questions": "How would you handle working with a difficult person?"}, {"date": "3 Jun 2015", "title": "Science Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "The interviewers were very friendly. They seemed excited to speak to me. They carried on conservation that strayed away from the basic interview questions. After submitting a resume, I didn't receive a call to set up an interview until two months later.", "Interview Questions": "Basic interview questions like tell me about yourself, what are your strengths, etc. "}, {"date": "9 Apr 2015", "title": "Director of Marketing and Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at The Nature Conservancy (Baton Rouge, LA)", "Interview Descriptions": "Conducted two phone interviews with a national director for this regional position. Interviews were long and went well, but there was little interaction and the national director couldn't really describe the full scope of the position for which they were hiring.", "Interview Questions": "Can you provide metrics for marketing plans you've executed in the past?"}], [{"date": "17 Apr 2015", "title": "Policy Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "Applied online and immediately received an email for a phone interview. The interview itself was conducted by the hiring manager (and another individual who did not introduce themselves, even though I had no previous contact with them/had no idea who they were, their job title, or how they were related to the team). Weirdly, the hiring manager spoke maybe twice, while the other person (whom definitely was not an HR person) dominated the conversation. The interview consisted of what seemed to be a pop quiz on the subject matter, rather than anything about myself, my past experiences, or basically anything off of my resume/cover letter. Interviewer asked around four or five unrelated questions before giving me a chance to speak each time, as if they were extremely short on time and rushing through the interview. Finally, they stated they would get back to me either way by the end of the week and conduct in-person interviews the following week. Sent a thank you note and received no response. No response by the end of the week. No response the following week. Sent another email that week inquiring whether the position was filled. No response! Not only is this unprofessional, but it is extremely rude and devalues a person who has spent time and effort in applying to a job, prepping for an interview, etc.", "Interview Questions": "Four-part hypothetical technical questions that tested knowledge on the subject"}, {"date": "24 Dec 2015", "title": "Philanthropy Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Nature Conservancy (Morgantown, WV) in Apr 2015", "Interview Descriptions": "Interview was thorough and enjoyable. They did a phone interview first, clearly poked around on my social media, & then an in-person interview. The questions ranged from how I'd use my skill set in the new position to how long I hoped to work for them, which was a strange question. They were a pleasant group and clearly knew what they wanted out of the hire which has always been a good thing for me.", "Interview Questions": "How will adapt to leaving out-the-door fundraising? "}, {"date": "2 Mar 2016", "title": "LEAF Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at The Nature Conservancy (New Brunswick, NJ) in Mar 2015", "Interview Descriptions": "The interview process is extensive. They want to see how well you can handle the unexpected. They also want to know how well you work with others especially working in the outdoors. They really love people with teaching experience so it helps if you're a teacher. They want to know that you can think for yourself, separate yourself from family and friends to work with young people.", "Interview Questions": "Tell me about your interest."}, {"date": "9 Mar 2015", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Nature Conservancy (Arlington, VA) in Feb 2015", "Interview Descriptions": "I applied online in the fall and received only an automatic acknowledgement of my application.  I did not hear anything and assumed that it was a dead-end until I received an email request for a phone interview in February with the person to whom you'd report. The phone interview was one of an undisclosed number to determine call backs for in person interviews.  I was under the impression that I would be called back for an on-site interview, but it would have been a switch to working for a non-profit entity, and a salary reduction, which was discussed as a concern (of theirs).   I did, after several weeks, receive a very nice personal email thanking me for my interest and wishing me well in my job search--it mentioned salary as a factor.", "Interview Questions": "Why are you interested in switchng to the non-profit world?"}, {"date": "13 Jan 2015", "title": "Operations Assistant - Atlanta Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy in Jan 2015", "Interview Descriptions": "Extremely lengthy - more than two months from applying to interview. After initial phone interview I was invited to meet with a panel of four. The interview lasted about 45 minutes with a number of typical situational questions. I asked when a decision would be made and was informed interviews would be occurring the following week as well. Was called in a couple of days informing me another candidate was selected.", "Interview Questions": "How would you handle a board member you did not get along with, or had upset?"}, {"date": "3 May 2016", "title": "Intern - Monthly Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Nature Conservancy (Philadelphia, PA) in Jan 2015", "Interview Descriptions": "Intern was really informal. Consisted of a Skype call with Senior Advisor who just asked me questions about my interests as well as logistics of the internship. They needed an all-around support intern so there really weren't many requirements. This interview came about through a family-friend referral, so I didn't formally apply.", "Interview Questions": "-What are you interested in doing?\r\n-Are you interested in the work we do? Why?"}, {"date": "11 Jan 2015", "title": "Philanthropy Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy in Nov 2014", "Interview Descriptions": "Applied to a job posting on their website and was called for an interview about three weeks later. \r\n\r\nMet with two directors of the office I was applying to for an hour. The interview was straightforward--\"tell me about yourself,\" \"why do you want to work here,\" etc.--with a few behavioral questions towards the end. Overall it was a pleasant experience.", "Interview Questions": "None were necessarily difficult. Strengths, weaknesses, etc. Simply come prepared with examples of times you handled different work situations--\"when was a time you successfully resolved an issue in an office?\" "}, {"date": "13 Oct 2014", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 days. I interviewed at The Nature Conservancy", "Interview Descriptions": "Hiring process through my university. Not through the nature conservancy. Worked not at HQ. Individualized through a program. Was not too difficult, was competing with other local candidates. Could have been more difficult for a full time job position.", "Interview Questions": "Research goals were vague"}, {"date": "7 Oct 2014", "title": "Wetland Restoration Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Sept 2014", "Interview Descriptions": "I received a call to schedule an interview a few days after the closing date.  Prior to the interview, they sent me an e-mail to let me know who I was meeting with and other pertinent information.  The interview was conducted by a panel of four people, all of whom I would work with directly. A glass of water was also provided without my asking, which I thought was considerate.  The panel took turns asking me questions and they all recorded my answers.  At the end, I learned that this was just a first interview and that further steps included a writing assessment and a second interview. I thought the interview went very well but in the end they decided to go with someone else.", "Interview Questions": "Most of the questions were technical in nature although some behavioral based questions were also asked.  While I didn't find any of them difficult to answer, it was hard to keep up with the number of questions they asked at one time.  It would have been nice to have a copy of the questions during the interview so that I could follow along."}, {"date": "21 Jul 2014", "title": "Policy Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy", "Interview Descriptions": "It was a single in-person interview with the person who would be my direct supervisor and another associate. All of the questions were either directly related to the job description, my experience, or my career ambitions. There were no 'zingers'.", "Interview Questions": "Where do you see yourself in 5-10 years?"}], [{"date": "18 Jun 2014", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "I had a phone interview to begin with and then waited a week and a half to hear back for an in person interview which was conducted by 2 interviewers. Then I got called back in for a third interview a week later which was a panel interview of 4 people. A few days later I accepted an offer. The interview experience was fantastic...I never felt so comfortable in an interview(s). A phenomenal organization overall!!", "Interview Questions": "Basic situational questions that you learn about in college. The latter interviews are clearly more personality based where they see whether you will be a good fit."}, {"date": "11 May 2014", "title": "Philanthropy Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "Applied online, and had two interviews by telephone. Very friendly interviews, with a lot of information provided by both interviewers on the details of the specific position I applied for and the area of the organization I'd be working in - how it fit with the organization's activities. I really appreciated the detail given because it helped me feel confident about the process.", "Interview Questions": "N/A"}, {"date": "11 Dec 2013", "title": "Field Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Nature Conservancy", "Interview Descriptions": "Excellent outreach to me as a candidate.  Clear explanation of online application requirements.  Reasonable amount of time to notify me of hiring results.", "Interview Questions": "None.  The hiring process was very straightforward with all questions relating to the information I submit about my prior experience."}, {"date": "22 Nov 2013", "title": "Project Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (San Francisco, CA) in Aug 2013", "Interview Descriptions": "Phone screening then two in-office screening - very nice people, quite basic questions. Having concrete examples ready is good.  Very nice office.  The interview was a 3-person panel where they took turns asking questions.  Classic interview questions.", "Interview Questions": "\"Tell me about a time when you successfully improved an operating system.\""}, {"date": "26 Feb 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Nature Conservancy (Peoria, IL) in Jul 2013", "Interview Descriptions": "Relatively easy process. Background check required, though no drug test, so it was a pretty quick hiring process. Interviewers were very nice, answered all questions and were always professional and helpful.", "Interview Questions": "No really unexpected questions- typical \"what are your skills\", \"what do you bring to the table\", etc."}, {"date": "8 Jun 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Nature Conservancy (New York, NY) in Apr 2013", "Interview Descriptions": "there was just one call with my future boss, very casual and informative. it was an unpaid internship so very little information was needed in the interview process. I had a family friend who referred me, making the process a lot easier", "Interview Questions": "no difficult questions"}, {"date": "15 Mar 2013", "title": "Global PR Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Nature Conservancy (Arlington, VA) in Mar 2013", "Interview Descriptions": "Telephone interview with the HR associate.  Very professional, organized lady with good questions about my past experiences and capabilities.", "Interview Questions": "Nothing out of the ordinary.  Very professional. "}, {"date": "27 Aug 2012", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy", "Interview Descriptions": "It was a very lengthy and detailed interview process with one panel interview and several one-on-ones. As far as I know, all references and prior employers were contacted.  The questions were the type of interview questions you learn about in college - e.g. tell me about a time when you made a mistake and how you handled it?", "Interview Questions": "Sometimes we must make difficult decisions regarding wildlife when we purchase and maintain land. For instance, we purchased a track of land in HI that had been overrun by non-native boar. In order to maintain the land, we had to go in and kill the boar. Would you have a problem when this type of decision has to be made?"}, {"date": "24 Sept 2013", "title": "Regional Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at The Nature Conservancy (Bogotá, Bogota) in Aug 2012", "Interview Descriptions": "A headhunter called me and he made a whole interview by phone.", "Interview Questions": "They asked me and three different languages (Spanish, English, Portuguese) Three different questions. "}, {"date": "24 Feb 2015", "title": "River Basin Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Nashville, TN) in Jun 2012", "Interview Descriptions": "Round table interview with 6 people asking different questions from ecological experience, educational outreach, philanthropically driven experience, coalition building, etc. Explain your ecological restoration experience in relation to first order streams, corridor functioning, etc. It was a very good atmosphere in the room, and everyone was very friendly. It was a good interviewing experience.", "Interview Questions": "How would you proceed with an ecological restoration project (similar type question)?"}], [{"date": "28 May 2014", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Nature Conservancy (Washington, DC) in Apr 2012", "Interview Descriptions": "Friendly conversation, phone and in person interviews, panel interviews and examples needed. Looked to be hiring on personality as well as skills. Very professional and up front about job requirements. Non-profit experience not required, but helpful. Looks like they have good work/life balance. Salary range was decent for a non-profit.", "Interview Questions": "N/A"}, {"date": "31 Mar 2015", "title": "Preserve Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy in Mar 2012", "Interview Descriptions": "Submit resume and cover letter.  I then secured a phone interview that lasted for about an hour.  I believe that I was merely interviewed since they needed to interview several folks to comply with the equal opportunity obligation.  The supervisor actually became hostile to me during the 4 person review panel and I had to feign a submissive attitude.  It was a very awkward interview even though I was well prepared.", "Interview Questions": "Please Explain a situation where you identified a problem and came up with a solution."}, {"date": "9 Dec 2016", "title": "Several Jobs Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at The Nature Conservancy (Arlington, VA) in Jan 2012", "Interview Descriptions": "First job answered an ad in the newspaper. Subsequent jobs applied internally via the HR intranet. Usually 2 to 3 interviews until you get the job offer. They do check on your references, and if you are in the company they give priority to internal employees. They have the basic interview questions.", "Interview Questions": "Why do you want this job? How long have you been at your position? Do you have skills that match the position? "}, {"date": "7 Apr 2015", "title": "Associate Director of Philanthropy Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Nature Conservancy (Atlanta, GA) in Jul 2011", "Interview Descriptions": "Phone Interview, 1st Round Panel Interview, 2nd Round Panel Interview, Board Interview.  Each round was with a different group of individuals.  The questions tended to be the same type of questions with each round, leading me to believe that there was not much coordination with the individuals involved.  Seemed to be more of a fit analysis.  References were checked.", "Interview Questions": "Please describe in detail your experience in fundraising."}, {"date": "29 Mar 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Nature Conservancy (Washington, DC) in Apr 2011", "Interview Descriptions": "Well design, excellent questions, treated very well throughout.  HR profession running the recruitment was excellent. Hiring manager was professional at all times: asked tough questions and was very straight foward about the whole process", "Interview Questions": "Greatest accomplishment?"}, {"date": "6 May 2014", "title": "Executive Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Nature Conservancy (Lansing, MI) in Oct 2010", "Interview Descriptions": "one phone interview, followed by two in-person interviews; three \"homework\" assignments", "Interview Questions": "What are your greatest weaknesses as an employee"}, {"date": "14 Jul 2011", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at The Nature Conservancy (Arlington, VA) in Aug 2010", "Interview Descriptions": "Interview process is very long.  After a phone interview, I interviewed with two different teams of multiple people each, weeks apart.  I was asked many questions phrased as describe a time when you....\r\n\r\n In the end, the hiring manager re-posted the job.  Although there were other jobs there that interested me, the time it took to go through the interview process was too long for me to pursue them.", "Interview Questions": "Describe a time that you were on a project that was over budget.  How did you handle it?"}, {"date": "23 Sept 2011", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at The Nature Conservancy (Arlington, VA) in Feb 2010", "Interview Descriptions": "Graduate school was notified of positions. Sent resume and cover letter and then received a phone interview. I interviewed with the hiring manager and the HR staff member. It was a very simple process, l likely because it was for a short term internship. Advice to applicant: know the subject matter and the issues that The Nature Conservancy cares about. For a non-profit it has a culture that is quite corporate.", "Interview Questions": "Question very specific to the issues/topics the internship was covering."}, {"date": "20 Jan 2010", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Nature Conservancy in May 2009", "Interview Descriptions": "pretty straight forward; the first phase was a short 30 minute phone interview to guage your pulse; second interview was inhouse and consisted of a panel of four people who alternated asking questions. the depth of questioning was surprising and i was not as prepared as i needed to be; i was not surprised when the offer did not follow the interview", "Interview Questions": "how would you reengineer this product (simple children's toy)?"}, {"date": "18 Mar 2009", "title": "Senior Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at The Nature Conservancy (Chicago, IL) in Nov 2008", "Interview Descriptions": "I was flown in and given a hotel for one night. I gave a scientific presentation relating my work to conservation issues. Then I had two panel interviews consisting of the management at that particular office. The questions were not unusual for a science-based position, but I had to justify how my reserach experience would help in a conservation context. I had prepared using the book \"the 60 Second Sell\", and it helped.", "Interview Questions": "Without direct conservation experience, how are you able to do the job?"}], [{"date": "2 Jun 2010", "title": "Freshwater Biologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Nature Conservancy (Harrisburg, PA) in May 2008", "Interview Descriptions": "The interview was more technical than other interviews I've been on. The hiring manager and panel were relaxed and friendly, making the interview a comfortable and positive experience. The experience questions were typical of others I've seen, but any candidate not prepared to discuss detailed biological principals and concepts will be caught off guard. I did well in the interview. However, my salary history eliminated me from consideration. The Nature Conservancy is a non-profit and the salaries reflect that.", "Interview Questions": "Describe the most pressing negative environmental impact affecting freshwater ecosystems to date and if faced tackling this issue in a given setting, describe the strategy you would implement."}]]