[[{"date": "31 May 2023", "title": "Senior Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Outram Park, ) in May 2023", "Interview Descriptions": "They will ask about yourself and your experiences And how do you see yourself 5 years from now HR and PNO will ask Video call interview via zoom no need in person", "Interview Questions": "What do u see yourself in 5 years time Tell about yourself"}, {"date": "6 Jun 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Outram Park, ) in May 2023", "Interview Descriptions": "Online zoom interview. Will be informed via email. After being shortlisted for interview, HR will send some required documents to fill prior the interview. Straightforward process. After interview, HR sent offer & more documents for on boarding", "Interview Questions": "Asked about prior experience & skills"}, {"date": "25 Apr 2023", "title": "Radiographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital (Singapore)", "Interview Descriptions": "Interview with manager and HR, good experience when you tried to share your experiences and expectations with them. The benefits of whole healthcare workers in Singapore almost the same. Some of the department need to take exam before the interview.", "Interview Questions": "What have you learn in your university?"}, {"date": "16 Apr 2023", "title": "CRC II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "Basically sharing my background and sharing why I was interested in this position. How the skills I have acquired from school or my fyp/internship would be transferrable in this position. If you can convince them on this, most likely you can get the job.", "Interview Questions": "Basically sharing my background and sharing why I was interested in this position. How the skills I have acquired from school or my fyp/internship would be transferrable in this position. If you can convince them on this, most likely you can get the job."}, {"date": "16 Mar 2023", "title": "Medical Laboratory Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Singapore)", "Interview Descriptions": "There were three interviewers including HR. Asked about your theoretical knowledge about working of the lab you applied to. Did not ask about my previous experience. Ended with a job sample test probably to test your attention to detail", "Interview Questions": "What did you learn in _____ this course?"}, {"date": "11 Mar 2023", "title": "Exec (Office of Patient Experience) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Singapore General Hospital (Singapore) in Feb 2023", "Interview Descriptions": "Prior to video interview, SGH send one essay question for applicant to attempt within 1-hour time frame 2 days prior to the video interview session on the immediate Monday. Took a while to understand the medical terminology used in the question and try to answer. They will also ask u to fill up the app form to submit prior to video interview. Rejection eventually came 4 weeks after video panel session.", "Interview Questions": "Are you able to handle difficult customers?"}, {"date": "19 Apr 2023", "title": "Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore General Hospital in Feb 2023", "Interview Descriptions": "Was given a call by the HR a few days after application. Had a zoom interview which tasted 30-40 mins. There were 3 interviewers in total. The interview was pleasant, though the questions were quite in depth. Received the results very shortly after (about 1 day?) and the HR very patiently explained the entire package over the phone. The salary/package was satisfactory. Did not accept the role eventually as my personal commitments did not allow me to work on weekends but the HR and Team Lead were very kind to encourage me to reconsider several times - I appreciate their sincerity. I think they would be a great team to work with.", "Interview Questions": "- Why do you want to join this industry? - Why did you choose to join the SGH team instead of other hospitals'? - Questions regarding the articles that they sent for reading before the interview"}, {"date": "26 Jun 2023", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Jan 2023", "Interview Descriptions": "Phone interview and F2F interview with director and assistant director. Well thought leaders who made the idea of working there wonderful, but I had to turn it down due to personal reasons", "Interview Questions": "What made you apply for this job?"}, {"date": "21 Dec 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Singapore General Hospital (Singapore)", "Interview Descriptions": "Applied through SGH portal. Was contacted through email for interview slots, and subsequently received a conditional offer after the interview. Thereafter, signed the bond agreement with HR. Whole process took about 3 months from application to signing of bond agreement.", "Interview Questions": "Educational sponsorship interview: 1. Tell me more about yourself. 2. Why SGH? 3. What is one difficulty you faced working in the wards as a student nurse? Honours year sponsorship interview: 4. Where do you see yourself in 5 years? 5. Which research topic are you interested in?"}, {"date": "20 Oct 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital", "Interview Descriptions": "I was asked if I knew what the project was about, so I told the interviewer what I knew from my research and what was on the job description. I was also asked if I was able to commit to the specified time period for the project.", "Interview Questions": "What is the study about?"}], [{"date": "2 Nov 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Singapore General Hospital (Singapore) in Oct 2022", "Interview Descriptions": "Spoke with the admin director and clinical head of the division. One wore a suit while the other wore a tie - so you should not under dress. Asked me some standard questions and we also spent some time clarifying the JD as it hadn’t been that clear (or maybe I had misinterpreted it). HR was on-the-ball throughout the process", "Interview Questions": "- what challenges do you foresee in this job? - do you have any plans to upgrade yourself, and how do you intend to do so?"}, {"date": "5 Oct 2022", "title": "Patient Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Singapore General Hospital (Singapore) in Sept 2022", "Interview Descriptions": "Completed in 25 mins. Overall was good experience in understanding the job scope and responsibilities in that medical specialty.  Was being assessed on answers relating how to handle difficult patients.", "Interview Questions": "IT skills percentage how many?"}, {"date": "23 Jun 2022", "title": "Med Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "The interview was literally asking you whether u are able to work on every weekend. Overall the interview process was easy. The problem is that you have to book your leave a year in advance which quite hard for many ppl to plan that much ahead.", "Interview Questions": "Usually they will ask the classic question whether u able to handle patient, front line."}, {"date": "6 Jun 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "Calm. Professional. Two interviewers. Asked for your strengths and weaknesses. Good to highlight what attributes you think you have that suits the job profile. Dress professionally even if it is over Zoom.", "Interview Questions": "What made you want to join us?"}, {"date": "11 Apr 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Singapore General Hospital (Singapore) in Mar 2022", "Interview Descriptions": "I was told to be given 15 minutes of showcase time, either a presentation about myself or about a project that I have done.\r\nI was asked about internship and project experiences and some simple technical questions.", "Interview Questions": "When do you use supervised and unsupervised learning?"}, {"date": "12 Aug 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital in Feb 2022", "Interview Descriptions": "Shortlisted within a few days of applying for the role. The HR contacted me to for a quick call to check a couple of basic details and then moved my application to the Unit. The interview with Unit was scheduled a week later. It was a 3-person interview with the HOD, Assistant Manager and HR.  Took around 20mins. Interviewers were friendly and took the time to explain the position as well as remained open to answering my questions. The HR also asked if I'm interviewing anywhere else. Got the verbal offer about a week later. Actually paperwork takes almost 2 weeks after verbal offer.", "Interview Questions": "Tell me about your experience and why are you choosing Healthcare?"}, {"date": "10 Mar 2023", "title": "Finance Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore General Hospital in Jan 2022", "Interview Descriptions": "Waited an hour for the interview to start and no one message or email to mention that there’s a delay in timing. When I checked with them, no sign of apology that the interview was late.", "Interview Questions": "Can you tell me about yourself"}, {"date": "11 Nov 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Singapore General Hospital", "Interview Descriptions": "Two rounds of interview. First interview was with the HR and other senior executives. Went well and interviewers were friendly. However second round of interview, which included a clinician, was unpleasant. Clinician was rude and obnoxious, showed no enthusiasm in what I had to say. After both interviews, they said that they would get back in a week or two, however they did not do so. I even emailed to check on the application, and the HR did not even bother to reply. I don’t understand the lack of basic decency to at least reply with a short “no”.", "Interview Questions": "Are you okay with a job that has no work life balance?"}, {"date": "18 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore General Hospital (Singapore) in Nov 2021", "Interview Descriptions": "Contract part time position. Had a zoom interview due to Covid. The job was all about transcribing only and has no prospect. It's part time so it isn't even 9 - 6 daily. Was asked if I have any experience and what my transcription speed was, to which I have no idea because I never timed myself. Asked why I want this job. I don't think anyone would do this besides for the salary since there isn't even any job prospect. There was really nothing much to ask or say about it, it's just transcribing material for that project.", "Interview Questions": "Do you have transcription experience?"}, {"date": "16 May 2023", "title": "Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Aug 2021", "Interview Descriptions": "Need to work on a case study that is complicated, I spent half a day to work out the assignment in structured report format, and then I received the interview invitation from HR team. The hiring manager was the interviewer for the role, and it was an OK session, the interviewer was calm and asked relevant questions.", "Interview Questions": "Describe the experience at previous roles and achievement"}], [{"date": "13 Jul 2021", "title": "Sleep Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "interviewed with the in charge of the department, she was nice and friendly, and also explained a lot about the job to me. \r\nHowever, the HR was kind of... unpleasant.", "Interview Questions": "Tell me more about yourself"}, {"date": "25 Jun 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "two rounds of interview, both conducted over zoom, interview was professionally conducted and smooth process. interview questions were asked mainly according to the job position and how you would best fit for the role.", "Interview Questions": "tell me about yourself, describe how you would fit for the job"}, {"date": "3 May 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Apr 2021", "Interview Descriptions": "The interview process was within 15 mins. There were 1 HR and 2 other managers. I felt that they were uninterested in me and knew that they will not hire me within the first 5min of the interview.", "Interview Questions": "Why do you want this job? Describe yourself in one word."}, {"date": "17 Mar 2021", "title": "Senior Patient Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital", "Interview Descriptions": "The  interview process is not stressful at all. Interviewers were really nice to fresh graduates. The questions are relevant to job scopes which requires candidate to provide solution  with different situations/issue.", "Interview Questions": "Keyboard speed. "}, {"date": "7 Apr 2021", "title": "Kidney Transplant Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 9+ months. I interviewed at Singapore General Hospital (Singapore) in Mar 2021", "Interview Descriptions": "The whole interview took about 30 minutes and only 2 questions were asked by the interviewers. The interviewers were generally nice and willing to answer the questions. However, HR had promised to get back to me within 3 weeks no matter the outcome, but it has been more than 4 weeks and they still have not gotten back to me. Followed up twice but no replies also. Don't give candidates empty promises and at least bother to reply to the emails even if they are not offered the position, please.", "Interview Questions": "Are you able to handle the stress?"}, {"date": "24 May 2021", "title": "Pre Registration Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Mar 2021", "Interview Descriptions": "The interview process was quite fast, took about 1 week plus and I had to submit some forms but everything was processed efficiently and did not took a long time\r\nInterview took about 1 hour and it consists of questions that interviewers usually ask and also a real life scenario based case study", "Interview Questions": "Real-life scenario-based case study in which they asked you to best optimise the patient's medications according to his/her clinical conditions and presenting complaint "}, {"date": "24 Feb 2021", "title": "Pre Registration Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Singapore General Hospital (Singapore) in Feb 2021", "Interview Descriptions": "Chill and relaxing, the whole interview process took around 13minutes.\r\nThey first start off with introduction and proceeded in with scenario based questions.\r\nScenarios given were realistic and prepares you for what you will be expecting during the training period", "Interview Questions": "Scenario based questions, and how you cope with stress"}, {"date": "29 Nov 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital in Nov 2020", "Interview Descriptions": "I applied online, and a Zoom interview was scheduled within slightly over a week. I was interviewed by two of the PIs and one HR.  The doctors were polite, friendly and to-the-point, and very forthcoming with details about the job scope. The questions asked were quite standard (tell us more about yourself, what are your career goals, are you more task-oriented or people-oriented, describe a challenge you faced). They also asked about my research experience (what was your research about, what lab techniques do you know), my experience with data analysis, and if I had experience drawing blood. \r\n\r\nI received the offer within a few days. HR was somewhat disorganised; 2 of them handled the offer, and one of them called me multiple times last-minute to request for documents (some of which I'd already sent) and to arrange for my pre-employment health check up. I also had to ask multiple times about my start date before I received an answer.", "Interview Questions": "What do you think is the most important quality required for this role? "}, {"date": "27 Oct 2020", "title": "Medical Laboratory Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Singapore General Hospital in Oct 2020", "Interview Descriptions": "Paperwork/ documents were fine and sent through email. \r\nInterview was set up 1 week later after a phone call saying that I was shortlisted for a position in the blood bank laboratory (i applied to several of their openings within the company). Interview was through zoom and I had to wait 25minutes later than the stated scheduled timing because there was another candidate before me. This was infuriating and disrespectful to me because not only I've mentioned once, but twice that I wasn't available at any other timing on the interview day (today) itself but the HR insisted that they could only do the interview today and no other days. Seriously? I understand that everyone has a busy schedule, but one cannot expect all your potential interviewees to revolve their schedules according to your availability, shouldn't there be some sort of agreed compromisation?  Not only I've sacrificed time and money (had to grab back home from work) just to attend the interview at their specific timing but they were late for 25 minutes.\r\n-during interview:\r\nthere were several interviewers,2 to 4 of them. Noted the range? Yeah, because 2 of them practically didn't show themselves but only their shoulders and half of their faces during the interview and still asked questions with no proper appearances. (wouldn't you feel further disrespected at this point?)\r\n- 1 of them seem to be very annoyed when I expressed my interest in another (related) field other than the laboratory setting and yelled at me asking what I actually preferred. She just seemed genuinely pissed off when I shared my interest of areas (even though both areas are so closely related). And she didn't seem to be happy that I had another job interview (which had immediate acceptance) that was on hold for me which I've yet to accept because of this SGH interview. But now that the interview is over, I would gladly accept the other offer that is waiting for me. \r\nAll in all, there will always be that 1 sensitive and triggered interviewer in every interview so do prepare and brace yourself to meet such people.", "Interview Questions": "No technical questions asked, mainly general expected interview questions such as strengths and weaknesses/ can you work in a team/ etc"}, {"date": "2 Oct 2020", "title": "Medical Laboratory Technologist II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Singapore General Hospital (Singapore) in Sept 2020", "Interview Descriptions": "# Initial Application\r\nApplying for the job was an extremely long-winded and troublesome process. \r\n\r\nFirst, after submitting a CV with all my employment history and education history, I was directed to fill in an online application. This was tediously long and required me to fill in the exact same details that were already on my CV. The online application took approximately 20 minutes.\r\n\r\nAfter I was shortlisted, a representative from HR contacted me and directed me to fill in ANOTHER form with the exact same details that were on my CV and which I had also entered into the 1st form.\r\n\r\nAfter this was done, a Zoom interview was set up for 2 weeks later. \r\n\r\n# Interview\r\nThe interview was held over Zoom, and was done by the HR representative, along with 2 other current lab techs from the Virology Lab (which was the lab with the job opening).\r\n\r\nThe interview lasted 45minutes, although the Zoom call did cut off halfway in, possibly due to it being a free Zoom call instead of the enterprise version. There were no issues with the interview process, and the interviewers involved were friendly.\r\n\r\n# Offer\r\n2 weeks after the interview, I received a call informing me that I had passed the interview and that they were intending to extend an offer of $3300 (I had initially asked for $3800).\r\n\r\nI requested for a formal letter of offer, which was flat out refused, and instead I was informed that the details of the offer would be sent to me in an email. The offer details was sent rather unprofessionally, with the details written in an HTML table within the message body of the email itself, instead of a formal document letter of offer.\r\n\r\nThe email (which was sent at 2.30pm in the afternoon) requested that I give a favourable response \"by tomorrow\". I replied to request for a week to think it over, and got a very discourteous response telling me that I had 3 days to make a decision.\r\n\r\n# Negotiating the Salary\r\nI attempted to negotiate the initial offer of $3300  to $3500, and was informed, quote, \"as explained over the phone, the degree start rate is harmonised across all Singapore public hospitals. We will not pay anything above our offer of $3,300.\"\r\n\r\nThis response is extremely rude and was shocking as it basically portrayed SGH as a toxic, inflexible work environment that is simply not open to constructive discourse, instead choosing to confront candidates with rude ultimatums, as if trying to diminish a candidate's self-worth and bully the candidate into accepting. \r\n\r\nAdditionally, this information about the degree start rate being fixed was news to me, as this had not been \"mentioned over the phone\" as claimed. The only thing related that I was informed about was that the salary RANGES depended on the level of our degree. As any dictionary will show, a range does not just have one fixed number.\r\n\r\nThe information that all public hospitals' degree start rate are \"harmonised\" seems to contradict crowdsourced pay information such as those from Glassdoor, which leads one to question the exact motive behind putting forward such a logical fallacy without empirical evidence.\r\n\r\nUltimately, the interview experience started out well, but devolved into a bad experience that left a horrible impression of all public health services efficiency and mannerisms.", "Interview Questions": "Q: What do you think are the most important character traits a MLT should have?"}], [{"date": "13 Oct 2020", "title": "Associate Executive Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore General Hospital (Singapore) in Sept 2020", "Interview Descriptions": "The interview was very straight forward. However... the process for HR was quite horrible. 2 HR handle the offer but they took a long time to do an offer package. Other HR kept asking to send things that already been sent many times. Overall. Quite horrible.  I've read reviews on HR from others below.. Whatever was said. Is absolutely true. At their rate, I may start work year 2021.", "Interview Questions": "What skills do you have?"}, {"date": "25 Aug 2020", "title": "Medical Laboratory Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "The interview was quite informative and meaningful. Went through online interview without any hassles and the interviewers were polite and respectful. The questions were manageable and had a simple tests just to prep me about the job role.", "Interview Questions": "Any past experiences in the laboratory?"}, {"date": "13 Jun 2020", "title": "Medical Laboratory Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "Interview process was rather ok with the standard questions. Interviewers were friendly but HR was a tad rude and kind of sabotaged the interview by mentioning that I had applied for other roles... Unfortunately, Singhealth HR is generally inconsiderate in ensuring a positive candidate experience as they don't bother to reply to candidates post-interview follow-up emails nor provide a reason for rejection (I had applied and went for a few other interviews). Not surprisingly, it was radio silence (even though the HR guaranteed that there would be a response in 2 weeks). 6 months later, HR called asking if I was still interested. The moment I replied saying I had found another job, the HR 'feedbacked' sarcastically as if it was my fault for not waiting for them to call and she had purposely KIV-ed my profile, further explaining that it was now the right time since someone in the department had left. Who in the right mind would wait for 6 months for an offer? Unprofessional and inconsiderate indeed.", "Interview Questions": "Which role are you actually interested in?"}, {"date": "27 Jun 2020", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore General Hospital (Singapore) in May 2020", "Interview Descriptions": "Interviewed with a group of people from the diagnostic radiology department. Interviewers were pleasant and friendly. Received the result of the interview process after 4 weeks from interview. Did not get selected for the position.", "Interview Questions": "What makes you stand out among other candidates?\r\nWhat are the data analysis software that I am experienced with? "}, {"date": "23 Jun 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore General Hospital (Singapore) in May 2020", "Interview Descriptions": "Interview was through zoom with 3 interviewers and HR. The session was kept very professional, with essential and work relevant questions asked. There was also a written test after the interview to assess job fit and capability.", "Interview Questions": "Describe a challenging situation at work"}, {"date": "5 Dec 2020", "title": "Management Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Singapore General Hospital (Singapore) in Apr 2020", "Interview Descriptions": "First interview HR acted very swiftly and interviewers were very nice and engaging. Then second interview with the 2 MDs they were late for 20 minutes (like what??), not sure what they were looking for and they tried to end the interview  in a rush in 30 minutes. Follow up took more than 2 weeks. But the same position keep appearing on jobstreet and linkedin. Not sure if the opening is real or they are just putting up to show the government. Bad taste to the overall experience. Think twice if you want to join them. Afterall they are considered a \"Singapore company\" and management style may not suit those who came from MNCs", "Interview Questions": "Tell me about yourself\r\nIs this job what you want?"}, {"date": "14 Oct 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Singapore General Hospital (Singapore) in Jan 2020", "Interview Descriptions": "Straight forward. Panel seeks honest replies. Experienced panel. Be prepared. Read up on news about the hospital and its achievements. Do some research on your own first. Long history of establishment and major government linked hospital in Singapore. Probably the largest in Singapore.", "Interview Questions": "What are your long term career plans?"}, {"date": "24 Nov 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Nov 2019", "Interview Descriptions": "Back in year 2019, there were 4 people in the interview room with the HR staff. I was being asked the usual interview questions. Interviewers were friendly. It lasted around 20mins.", "Interview Questions": "Tell me more about yourself."}, {"date": "15 Oct 2019", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital", "Interview Descriptions": "Interviewers were really friendly and open to answering questions. Assessed on suitability for the job and past experiences. Were also told more about the job itself. Overall, quite a nice experience to find out more from them", "Interview Questions": "Why do you want this job?"}, {"date": "28 Nov 2019", "title": "Associate Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Singapore General Hospital (Singapore) in Oct 2019", "Interview Descriptions": "Applied online and was shortlisted for interview a week later. Was required to do an online test for writting skills (to email back the test asnwers within 20minutes). Interview was scheduled a week later. During the interview, there were 4 people in the room (the hiring manager, 2 executives and the hr personnel). Each interviewers explained about their departments roles and duties. Interview took about 20mins, very detailed, professional and relax. But waiting time had to wait almost an hour - delay time as there were about 4  candidates ahead of me.\r\n\r\nWas called up 2 days later about the job offer and they needed to do reference check first (took about a week). \r\n\r\nFinally after reference check, HR called and offered the salary package. Came down to the HR Office a week letter for the contract signing and did the medical checkup on the same day (located at SGH). Results of medical checkup took about a week. Whole process took about 1 month plus.", "Interview Questions": "Tell me more about yourself.\r\n"}], [{"date": "27 Aug 2019", "title": "Medical Laboratory Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore General Hospital", "Interview Descriptions": "I was told by the HR that she did not receive my documents prior to the interview, even though I already sent it to her. It probably ended up in her junk mailbox. Interview process was smooth, and the interviewers were friendly and understanding despite not having any of my documents available for their viewing. I brought my laptop along so I asked if they would like to view the documents on my laptop instead.", "Interview Questions": "Why did you choose to study a particular minor?"}, {"date": "25 Jul 2019", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital", "Interview Descriptions": "Long waiting time. Depending on the department you applied to, it consists of HR and Hiring Managers. Hiring Managers were unprofessional. Interview processs varies from individuals, it can be as long as more than an hour or as short as 10 minutes.", "Interview Questions": "Tell me more about yourself?"}, {"date": "7 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "Online application followed by an interview with potential supervisors.\r\nThe interview started with self-introduction, then personal experiences, reasons for applying for the internship, some sharing about what the things they do and about the department.", "Interview Questions": "Why did you apply for this internship?"}, {"date": "20 Aug 2019", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore General Hospital in Jul 2019", "Interview Descriptions": "The interview seemed to go well. About a week later, I was informed by HR that she was going to offer me but she needs to run reference check and submit to management for approval. Will call me in a few days. Told me to reprint my certs as I told her I misplaced my original certs. After waiting for more than 3 weeks, I was finally informed that the offer is off. I asked why but was told me that I wasn’t suitable and vaguely said it could be due to salary, ref check and education. I was shocked because this has never happened to me before. Until now, I’m still wondering why? And why couldn’t tell me exactly why? I respect their decision but would appreciate it if I can know. It would help me a lot in my next job search. If they don’t intend to tell me why, they should have done the ref check and get approval before telling me that they want to offer me. Until now I’m still wondering if I have any bad records anywhere without my knowledge...", "Interview Questions": "Why do you want to apply for this job?"}, {"date": "14 Jul 2019", "title": "Associate Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Singapore General Hospital (Singapore) in Jun 2019", "Interview Descriptions": "2 rounds of interview needed for the interview process. 1 round with HR and the team member and another round with the head. There were a few others waiting for their turns for interview.", "Interview Questions": "What you expect from the job"}, {"date": "3 Jul 2019", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Jun 2019", "Interview Descriptions": "supposedly 2 rounds of interview.  Interviewer required more in-depth analysis of capability towards job scope , but was kind of challenging for a new graduate. Tried my best to answer but interviewer was not convinced", "Interview Questions": "Work experience"}, {"date": "14 Jun 2019", "title": "Medical Laboratory Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Jun 2019", "Interview Descriptions": "One interviewer from HR and 2 others from the lab. Asked usual questions such self introduction, strengths n weaknesses, what if questions. Also asked why u want to join them, whether u applied other Hospitals, technical questions like what sort of viruses you know..etc. Doesn’t give the friendly vibes. HR also ask you to bring photocopies even though you already emailed them the required documents. Is this their way of saving paper? Maybe a good training ground for fresh graduates. Interview not scheduled timely so you had to wait about half an hour for your turn plus turning up 15 mins earlier. Total 45 mins wait. Did not state it’s a contract job when advertised. Only mention during interview when you turn up for interview. What a waste of time.", "Interview Questions": "Strengths and weaknesses"}, {"date": "10 Apr 2019", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore General Hospital (Outram Park, ) in Apr 2019", "Interview Descriptions": "I went for 2 interviews with SGH for 2 different executive positions.\r\nThe first one was directly at SGH campus and was interviewed by the manager and head of dept. It wasn't very difficult but I was not a fit personality-wise for the role so they passed me on to another position.\r\n\r\nThe HR then called in a few days to schedule an interview for the new role. Went  down to the Singhealth recruitment centre at Bukit Merah for a 1hr written test (essay topic related to the role so read up beforehand). I was then told to head to SGH for the interview and was interviewed by 2 managers and 1 HR. At the end, I was told that if shortlisted, there will be 2 further rounds of interview.\r\n\r\nLater on, I got a job offer elsewhere so I opted not to continue the process.", "Interview Questions": "Tell me about yourself\r\nDescribe yourself in 3 words\r\nWhat are your strengths and weakness?\r\nShare more about your work experience"}, {"date": "13 Feb 2019", "title": "Operations Executive - Environmental Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Singapore General Hospital (Singapore) in Feb 2019", "Interview Descriptions": "Did a written test then travelled to another building where 3 staff that looked like they have worked there for 20 or 30 years interviewed me. Seemed disinterested even before the interview started. Didn't even ask for self intro or infor about my previous job, dived straight into why I left my previous job, then kept throwing information trying to make you back off from the job. Gives me the impression that they did not want to hire anyone at all. Overall my interview ended in around 5 minutes.", "Interview Questions": "Potential challenges in healthcare industry"}, {"date": "25 Mar 2020", "title": "Exec Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore General Hospital in Feb 2019", "Interview Descriptions": "Did the interview at HQ.  They showed me a photo and asked me to provide my case to the situation. \r\nAll done on PowerPoint. Father which I had to explain.", "Interview Questions": "Why do I want to leave my current job"}], [{"date": "1 Sept 2019", "title": "Operations Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore General Hospital (Singapore) in Jan 2019", "Interview Descriptions": "Fast. Had an interview questions followed by a relatively short interview. Knew the outcome in 1 interview. Overall it was an efficient interview, just that the application form to fill up was very long.", "Interview Questions": "About myself."}, {"date": "30 Jul 2019", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Singapore) in Sept 2018", "Interview Descriptions": "Questions are standard, just need to see if you're a good fit based on your interest and connection to your hiring manager. The whole process is quite fast, however, be prepared to bring all your certs and portfolio to the first interview. Depending on role, there may be two interviews. HR is typically quite fast.", "Interview Questions": "Why you want to join healthcare"}, {"date": "29 Jul 2019", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Singapore) in Jul 2018", "Interview Descriptions": "Fast and smooth process. Prompt replies from HR personnel. Easy job application process with friendly interviewers. Straight forward and easy to get to know more about the company. Told me more of their career progression and about SGH", "Interview Questions": "Why are you interested in this role?"}, {"date": "28 Mar 2021", "title": "Senior Patient Service Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Mar 2018", "Interview Descriptions": "The interview process was not stressful at all. The questions were not hard to answer as well but it requires you to imagine different scenarios and how to solve them. Looking for personal that can multitasking and good communication skills.", "Interview Questions": "What makes you think you're suitable for this position ?"}, {"date": "1 Apr 2018", "title": "Healthcare Management Executive Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Singapore General Hospital in Feb 2018", "Interview Descriptions": "I reached early but could not contact the person who asked me to give her a call upon reaching. Waited for quite some time before everyone reached and for the assessment to start.", "Interview Questions": "What motivates you to join? What do you think / feel about the healthcare plan? "}, {"date": "10 Aug 2017", "title": "Operations Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Jul 2017", "Interview Descriptions": "A get-to-know-you session with general interview questions, e.g. \"Tell me more about yourself.\", \"Why did you apply for this job?\" etc. Most of the questions asked were pertaining to the details on my resume.", "Interview Questions": "What are some of the challenges you faced (with reference to your previous experiences) and how did you resolve them?"}, {"date": "21 Jan 2017", "title": "Research Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Singapore) in Dec 2016", "Interview Descriptions": "HR process was very smooth and the people from HR were really nice and helpful. The interviewer was the supervisor/PI of the research project and was very nice and amiable. Interview process was very casual and comfortable. He asked some very general interview questions like \"Tell me about yourself\", \"Why do you want this job\", \"Tell me about some of your work experience\". He also asked with regards to some of the laboratory techniques and skills that I have and some theoretical aspects of them.", "Interview Questions": "Tell me about yourself"}, {"date": "10 Oct 2016", "title": "Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital (Singapore) in Aug 2016", "Interview Descriptions": "Called quickly after sending in resume. Interviewer was pretty nice, only asked basic questions. Did not ask any healthcare related questions although i prepared for it. Interviewer pretty worried that young people quit job easily. Must show willingness to stay on in the company", "Interview Questions": "Ask about CCA, how I showed determination"}, {"date": "17 May 2016", "title": "Executive (Research Database) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore General Hospital (Singapore) in May 2016", "Interview Descriptions": "The first interview was done by the assistant manager and the manger. The interview was rather a casual one. It started off by telling more about myself and they asked what I know about the job. After which, the assistant manager briefed me more about the job scope and expectations. No technical questions asked. More of a get-to-know-you session. After the first interview, there will be an second panel interview by the directors. I haven't go for the second interview so couldn't say anything about it. Got the call for the second interview 3 working days later.", "Interview Questions": "Tell me more about yourself."}, {"date": "24 May 2016", "title": "Operations Executive (Environmental Service) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore General Hospital (Singapore) in May 2016", "Interview Descriptions": "There was only one round of interview. I was asked to write a draft to reply customer's complaint first, followed by the interview. There were three interviewers. The whole process took around 15 minutes. It was quite relax overall. The questions they asked were common. The only thing that you need to show them is your passion to the job.", "Interview Questions": "How to manage staff that has been worked in SGH for a very long period (like 30, 40 years)? What if they do not want to follow your instruction?"}], [{"date": "4 Jul 2016", "title": "The Hospital Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Singapore General Hospital (Singapore) in Apr 2016", "Interview Descriptions": "4 rounds. First was a written essay at the recruitment centre, after which if selected, the first round of interview with HR assistant director and Ops manager. If selected, will be tasked with to do an assignment which you have to send in within 24 hours. Final round of interview with 2 HR directors and the chief operations officer (COO).", "Interview Questions": "Basic questions about yourself and your career aspirations. More about your fit with the company."}, {"date": "14 Jun 2016", "title": "Hospital Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Singapore General Hospital in Feb 2016", "Interview Descriptions": "Preliminary interview include a short interview to check your certification and followed by a test with 2 questions, to complete the test on a word document.\r\n\r\nDo remember to ask the person-in-charge if internet is can be used during the test because some candidates were using the internet for their test.", "Interview Questions": "Case study regarding healthcare"}, {"date": "22 Jul 2015", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore General Hospital (Singapore)", "Interview Descriptions": "Simply ask you about your background in research, and whether did you understand the project they are doing. And some basic questions about your educational qualification like what was your major, and simply explain your master thesis.", "Interview Questions": "How do you see yourself in 5 yrs?"}, {"date": "5 Oct 2015", "title": "Hospital Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Singapore General Hospital (Singapore) in Apr 2015", "Interview Descriptions": "Was an internal candidate and had to filled up a bunch of forms. Provided with vague direction from HR on informing or not informing your the immediate superior on the intention to apply this programme. (on hindsight its probably better to inform the supervisor)\r\n\r\n2 tests was conducted before the interview. 1. Was tasked to do a report on some healthcare trends based on a paragraph that they provide you within an hour 2. Had to do a bunch of statistical and analysis based on the data provided within 24 hours. The interview is done once 1 and 2 is complete.\r\n\r\nEven with some experience in the healthcare industry, the questions asked were relatively complicated, in fact extremely difficult for a fresh graduate unless you have very good knowledge on the areas that they might ask.", "Interview Questions": "Why do you want to join this programme? Have you spoke or discussed with anyone on this and why? Lots of hypothetical questions that you had to think on your feet and generally no questions on what you had analysed."}, {"date": "5 Mar 2016", "title": "Hospital Executive Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Singapore General Hospital (Singapore) in Feb 2015", "Interview Descriptions": "After submitting my name at the front desk, I was brought into a room to verify my documents. After which, I was given a piece of paper with the essay questions. You are given one hour to write your essay. You have access to a computer, but remember to use your time wisely and plan your essay well.", "Interview Questions": "What do you think of current healthcare trends and how would they impact the functioning of SGH in the future. \r\nWhy did you choose to apply for SGH's Hospital Executive programme?"}, {"date": "7 Oct 2014", "title": "Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Singapore General Hospital", "Interview Descriptions": "1st and one round - With hiring managers and HR\r\n\r\nDidn't have a good impression even before I attended interview. HR called and insisted I have to cancel all appointments to meet the interviewers three days after because one of them is a doctor and he insisted it. \r\n\r\nThe interview last for over two hours. (Note: This is a Research Coordinator position which I applied.) Everyone at the panel looked at the doctor adoringly when he spoke. Even if anyone of them wanted to talk about the job, they looked at him and not me. This situation resembled the reviews given about existing staff in the hospital over here. The one hiring manager and HR were very rude this way but they seemed to suggest to you they will treat people who are not doctors, as furniture.\r\n\r\nThe doctor interviewed using coercive techniques when in doubt and refused to introduce himself too. The hours spent and the way he asked questions suggested to me he wanted a staff whom he could abuse any ways he wanted , that he might not be a good boss , and preferably you should be as poor as a church mouse so that you could take up his job and let him and his staff do whatever they want to you.", "Interview Questions": "N/A"}, {"date": "12 Sept 2014", "title": "Hospital Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Singapore General Hospital", "Interview Descriptions": "Two rounds of essay assessment and followed by a panel interview. Interview is mostly on personal experiences. The entire process took about 2 months to get to the final stage.", "Interview Questions": "Nothing too difficult"}, {"date": "6 Jul 2015", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore General Hospital (Singapore) in Jun 2014", "Interview Descriptions": "The entire interview process was short and sharp. The interview was done with the hiring manager only, no HR was involved.\r\nThe hiring manager goes straight to the point on the job scope and described the process in detail. The manager is friendly and overall a pleasant experience.\r\nSalary and benefit were not discussed.", "Interview Questions": "Tell me more about your experience."}, {"date": "9 Oct 2013", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Outram Park, )", "Interview Descriptions": "Interviewer was very rude and unprofessional.", "Interview Questions": "Not accepting private school degree. "}, {"date": "18 Jun 2017", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore General Hospital in Jul 2013", "Interview Descriptions": "I applied online and received a call from HR one month later for an interview. \r\n\r\n1st interview: \r\nThere was an online 45min essay test to be completed right before meeting the department heads. The dept heads then asked questions on yourself, motivations, school, and clarified certain concepts of the essay. \r\n\r\nReceived a call from HR shortly after and was scheduled for another interview.\r\n\r\n2nd interview: \r\nThe interview was with the division head, and was casual. \r\n\r\nReceived a call from HR shortly after to inform me on my confirmation.", "Interview Questions": "Why should we hire you?"}], [{"date": "12 Apr 2013", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore General Hospital in Apr 2013", "Interview Descriptions": "The typical kind of questions were asked during the interview, such as why did you choose this job, what do you know about the company and what other job openings have you applied for. There were 2 interviewers and they were very friendly and pleasant. I was given the impression that the work culture there is work-hard-play-hard.", "Interview Questions": "Tell us about a time when you felt most stressful."}, {"date": "26 Jul 2015", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Singapore General Hospital (Singapore) in Mar 2013", "Interview Descriptions": "2 rounds of interview, first with 2 HR Assistant Directors to find out about your interests and assess your job fit. This is followed by 2 case studies, first they will email you and you have to complete in 1 day. 2nd case study is done at the HR office using their computer with a time limit of 1 hour. Then the 2nd and final interview is with 2 COOs and 2 HR Assistant Directors. All in all took about 2 month before job offer.", "Interview Questions": "they will ask you why you want to choose healthcare and about any government policies that you like or do not like and why. They can ask you about some current government policies and what are your views on them."}, {"date": "25 Aug 2012", "title": "Human Reosurce Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Singapore)", "Interview Descriptions": "The Asst Manager, Staffing(Admin and Ancillary) called me for a phone interview. After this round, the Hiring Manager conducted a one-to-one interview with me. She described the job details to me and asked the usual questions of the reasons why I left my previous employments. She was okay with conducting the interview after office hours in the evening.", "Interview Questions": "If I am a car, what model will I be?"}, {"date": "30 May 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore General Hospital (Singapore) in Jun 2012", "Interview Descriptions": "Typical interview. The interview asks for your goals and your intended career advancements. They also question about stuffs you put in your CV. The interview also questions the kind of skills essential to the job like computer skills.", "Interview Questions": "Why this job?"}, {"date": "10 Oct 2014", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore General Hospital (Outram Park, ) in Aug 2011", "Interview Descriptions": "They first asked me why i want to be a medical technologist. What i would expect from this job. The employer actually took the effort to show me the working environment", "Interview Questions": "Do i place more interest in quality or safety"}, {"date": "16 Jun 2014", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Singapore General Hospital (Singapore) in Jun 2011", "Interview Descriptions": "Interviewed by HOD and project investigator. Brief and conditions of employment discussed.\r\nonly 1 round. Overview of project stated, assessed commitment to nature of project as well as willingness to work on weekends", "Interview Questions": "How much do you know about being a research coordinator?"}, {"date": "18 Oct 2012", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Singapore General Hospital (Singapore) in Jan 2008", "Interview Descriptions": "Casual questions such as working hours etc. Not much.", "Interview Questions": "N/A"}]]