[[{"date": "23 Jan 2023", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "I had an amazing interview opportunity with the APUS. Everyone was engaging and professional. At first I was nervous, but the way the questions were asked made it feel more conversational. I quickly felt that I wanted to be a part of this team of educators.", "Interview Questions": "Why do you want to work for the APUS."}, {"date": "20 Nov 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "Two part interview plus a writing sample. The interview was online via Zoom. Couple of questions that needs to show you can write, it needed to be done quickly though. It was not a bad experience.", "Interview Questions": "What do you know about our company."}, {"date": "15 Jul 2022", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "The interviewing process involved 2 phone interviews, and they flew me in for the final interview. The final interview involved the head of the program and the dean, and also the other 3 candidates that were interviewing for the position.", "Interview Questions": "Will you tell us more about your experience?"}, {"date": "28 Apr 2022", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at American Public University System (Washington, DC) in Feb 2022", "Interview Descriptions": "The interview was a very very long and drawn out process that seemed to be strange for the small salary. If time was money, I would be broke. Can not imagine going through this process for a part time job and for what?", "Interview Questions": "When is my industry certification renewed?"}, {"date": "27 Apr 2021", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Public University System", "Interview Descriptions": "Very pleasant process. Interviewers were patient and seemed genuinely interested in my responses. Asked great questions. The process was very professional and easy to follow. I asked how interviewers what they liked best about the company and they both had high praise for it. I like to ask that question when asked if I would like to ask the interviewers anything. It always gives me added insight into whether I really want to commit to the company.", "Interview Questions": "Why I wanted to work for APUS"}, {"date": "16 Jan 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Public University System", "Interview Descriptions": "Had a written assignment with general questions and to evaluate my writing skills.  Then had two phone interviews and an in person interview.  After a third phone interview, I finally received word I was hired.", "Interview Questions": "Tell us one of your biggest obstacles and how you overcame it. "}, {"date": "2 Feb 2021", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Public University System (Houston, TX) in Dec 2020", "Interview Descriptions": "Took about one month after I applied. panel interview with the Program Director and another person. Interview was a zoom interview - very friendly yet professional. They were focused but nice as well.", "Interview Questions": "How would you handle someone who plagiarizes?\nTell me about yourself and teaching experiences\n\n"}, {"date": "6 Aug 2020", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "The first round of interviews was a online panel interview with the Dean of the department along with other directors from various department\nThe second round of interviews was with a series of program and department heads from various programs.\nThe third round of interviews was with the Provost of the university which also intense.", "Interview Questions": "Why are you interested in this position?"}, {"date": "15 Aug 2020", "title": "Graduate Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Public University System in Jul 2020", "Interview Descriptions": "The interview process was absolutely awful.  After several back-and-forth emails with HR (where each email was never signed off with the name of an actual human being, just simply \"HR\"), I had a phone interview with two different stakeholders with the university and academic advising services. \r\n\r\nFrom my perspective, the interview was going well and was mostly positive based on their responses to my answers and comments. However, halfway during the interview, the call dropped. Of course, HR never provided contact information for each interviewer. So I reached out to the generic HR. I also tried to call the interviewers back using the number that they called from (showed up on my caller ID), but the call would not go through. Long story short, I never had the chance to complete my interview. I asked twice to have that opportunity but I was told that the phone drop would not put me at an unfair advantage.\r\n\r\nI decided to withdraw my application from the applicant pool because I cannot fathom working for a company that does not take the time to let an applicant complete an interview.", "Interview Questions": "All questions were STAR based."}, {"date": "21 Apr 2020", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "In person interview where the questions come across as fairly generic. As well as making you do a writing sample. Then if they want to move forward they send you a tech assessment that is quite outdated and now user friendly. Also don't know how much they rely on those results. Seemed like irrelevant assessment that were all items that could be easily taught if unknown", "Interview Questions": "What excites you about working in academia?"}], [{"date": "29 May 2019", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Public University System (Charles Town, WV) in Apr 2019", "Interview Descriptions": "The recruiting, contact, scheduling, assessment, and interview process was very straightforward and formalized.   Unfortunately at the end there was no follow-up from APUS following the face to face interview.", "Interview Questions": "Several questions from the PMBOK and a couple scenario based questions."}, {"date": "24 Mar 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at American Public University System (Phoenix, AZ)", "Interview Descriptions": "It was far too long agio, but it was a telephone interview by one of the professors. About 20-30 minutes in length and basically asked your experience and teaching philosophy. Pretty standard.", "Interview Questions": "N/A"}, {"date": "25 Feb 2019", "title": "Senior Manager, Accounts Payable Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Public University System", "Interview Descriptions": "Applied online, 2 days later received a request for a phone interview with the Director.  A few days pass and I’m asked to come in for a face to face interview with the same director.  Another few days pass and I’m asked to provide 4 references, 2 have to be direct managers.  I was assuming that this meant an offer was coming shortly thereafter.  But no, I’m asked to come in for another interview with the actual team I’d be managing and the SVP of finance.  The team members were nice enough but less than impressive.  When I asked what they wanted from their manager, their response was basically that they wanted someone to work just like they do.  Nothing about development or anything a savvy professional would say.  Then I met with the SVP of Finance.  While she was nice enough as well, she loves to hear herself speak.  They had allotted 30 minutes with her, it went on for a little over an hour.  I might have spoken for 10 minutes.  She conveniently dropped in there that she typically works from 7am to 8pm every day and kept tying it back to how much she demands of her leaders.  Overtime was also a common theme talked about by the team members.  It was of no surprise to me that the team members weren’t interested in this leadership position, because they have no desire to work free overtime.  Can’t blame them for that.  I couldn’t even muster the ability to stretch the truth and make it appear as if I too, want to work 12 hour days for a paltry salary.  In my experience, when workers are constantly doing overtime, there are process issues that need to be fixed.  I walked away from the interview thinking the team members probably milk OT to make up for their small salaries and all they really wanted out of their manager was to help them do their work and sign off on their timesheets.  The SVP determines value by how long you’re in the office, not by what you actually do.\r\n\r\nAfter the interview, I wrote professional thank you emails to both the director and SVP.  I provided feedback and my assessment for how I can help.  The team desperately needs a leader, not another worker bee.  I have vast experience improving processes that improve both employee and company performance. That’s apparently not what they want, as I never received any responses to my emails. \r\n\r\nI’m providing this review not because I’m upset, but to help anyone who may be looking into working in the finance department at this company.  You are going to be asked to spend a lot of your time interviewing, need to provide references, etc. only for them to completely ghost you after the fact.  Utterly unprofessional.  I get a kick out of seeing them repost this position to make it appear as if the requisition isn’t as old as it is.  Nearly 3 months later and these folks still can’t find someone to fill the role.  You would think they are looking for a rocket scientist.  \r\n\r\nBottom line:  Unless you are desperate, and have nothing but time at your disposal, I wouldn’t waste my time applying here.  Their pay is very low end as is their professionalism and class.", "Interview Questions": "Mostly situational based questions, STAR"}, {"date": "5 Apr 2019", "title": "ELearning Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at American Public University System (Charles Town, WV) in Mar 2019", "Interview Descriptions": "The first interview was with other Instructional Designers. It was great. It was done over the phone. The questions were on target with what we do and were very engaging. I was very impressed.", "Interview Questions": "Elevator pitch: You've 10 seconds to convince the person in the elevator that you're the one for this position. "}, {"date": "20 Oct 2018", "title": "Digital Publishing Librarian Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Public University System in Oct 2018", "Interview Descriptions": "Completed online application and participated in panel interview. The interview went well, and I was offered the position. After signing and returning the formal offer letter,  I overnighted my employment documents as requested.\r\n\r\nWhen I contacted my new supervisor ( who, mind you, interviewed and hired me) to discuss scheduling (I made it clear from the start I would not be leaving my current job), she indicated she would sketch out some possibilities and call me Monday. She did not, so I contacted her Tuesday, and she again said she would work on potential schedules. She called me Wednesday. Again, no scheduling info. Instead, she said she had concerns about my retaining two positions. I asked for clarification and received none. I then emailed and asked if she was telling me not to attend my scheduled orientation. I received no response.", "Interview Questions": "What kind of work do you get lost in?"}, {"date": "11 Sept 2020", "title": "Manager Financial Aid Advising Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Public University System (Charles Town, WV) in Sept 2018", "Interview Descriptions": "One on one interview where we chatted back and forth and then I was asked questions about my prior experience. It was very casual hut I felt confident leaving the interview because they were friendly", "Interview Questions": "Describe my work style"}, {"date": "29 Aug 2018", "title": "Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System", "Interview Descriptions": "Brief and to the point  managers were friendly welcoming. Very thorough in the job descriptions and open to answering questions. Gave a tour if the facility also and showed me where other departments were located", "Interview Questions": "Why do you want to work here"}, {"date": "2 Dec 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Public University System (Charles Town, WV)", "Interview Descriptions": "Group interview ,  written assessment and Q&A.  Senior management and junior managers asked questions .  A writing sample was given and we went around the table sharing something about ourselves", "Interview Questions": "Customer service experiences. Good and bad examples "}, {"date": "16 Aug 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System (Washington, DC) in Nov 2017", "Interview Descriptions": "Interview was lively.  I could tell that Faculty and Program Director enjoyed the work that they did.  Also could tell they enjoyed teaching and was working to better our department and university.", "Interview Questions": "What characteristics are important for an online instructor?"}, {"date": "30 Aug 2017", "title": "Vice President Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Public University System (Charles Town, WV) in Aug 2017", "Interview Descriptions": "I was called on a Wednesday afternoon for interviews on the following day with the SVP, Operations, Chief of Staff and the Provost.  I was given no overview or prep for the position.  Two weeks later, I interviewed with the Corporate Controller and Corporate CFO.\r\n\r\nThe interviews on Thursday were very engaging and results and accomplishment oriented.  \r\n\r\nThe interview with the CFO was very different.  I found him to be arrogant, rude and condescending.  He focused on technical accounting questions which were not part of the job requirements.  I asked about significant projects and areas of focus for the upcoming year.  One of the major projects was a new front end system that two of the four interviewers had mentioned as a priority.  He was VERY put off that I knew of the project and told me I should not know about that and even lectured me.  When I asked questions about risk, he put it back to me and did not answer from his perspective.  \r\n\r\nThere seems to be a disconnect between what the CFO is looking for and what the others on the leadership team are looking for.  The position reports to the SVP of Operations not the CFO.", "Interview Questions": "Questions from the initial inverview\r\nTell me your approach to process improvement?\r\nTell me about how you would go about performing a complex financial analysis.\r\nTell me about your approach to process improvement"}], [{"date": "28 Mar 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Public University System (Charles Town, WV) in Feb 2017", "Interview Descriptions": "Very friendly and engaging.  Participants were inquisitive about skills and background. Lots of give and take by all involved. Interviewer talked about the University and what it had to offer potential employees", "Interview Questions": "Typical questions: strengths/weaknesses, how I handled various situations, assessment of skills and interest in position. Where did I see myself professionally/personally in 5-10 years"}, {"date": "20 Jul 2016", "title": "Academics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at American Public University System", "Interview Descriptions": "Called me for an in person interview. I Interviewed with a manager and a coworker, it was pretty standard. She answered all of my questions and seemed very knowledgable. Very friendly and approachable. The experience was positive.", "Interview Questions": "Where do you see yourself in 5 years? 20 years?"}, {"date": "10 Jun 2016", "title": "Liaison Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Public University System (Charles Town, WV) in Apr 2016", "Interview Descriptions": "Sent in my application, received a writing screen request that was easy and just required answering a couple additional questions. Then I had a phone interview, which was easy, and was invited for an in-person interview. The in-person interview was a little strange, and there was no opportunity for me to ask questions; they just asked their own questions and then showed me out. They told me I'd hear \"early next week\" but it took three weeks to finally tell me that I didn't get the position (by e-mail).", "Interview Questions": "What have you disliked about people you've worked under in the past?"}, {"date": "2 Mar 2016", "title": "Test Examiner/Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System (Lancaster, CA) in Feb 2016", "Interview Descriptions": "I had about 3 interviews one on the phone with the hiring manager, another with the director of the program and one face to face with the hiring manager, I also had to do a written sample for the job. They asked pretty basic questions the first time, the second time they asked me questions about scenarios that I had to deal with at my previous jobs and how I would react to certain things that may be asked by my supervisor and how I would react to certain students.", "Interview Questions": "Do you have any experience with counseling?"}, {"date": "20 Oct 2015", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at American Public University System", "Interview Descriptions": "Interview process was long, but thorough.  It took approximately 4 months to complete the process. The people I interviewed with were experts in their fields and had been with the university for years, so they asked pointed questions, direct questions to hone in on experience.  \r\n\r\nRecruiters were very helpful and resourceful.", "Interview Questions": "Ability to work in an online environment?  What did I think would be the most challenging aspect?"}, {"date": "5 Aug 2015", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System", "Interview Descriptions": "Multiple telephone interviews, an initial screening, followed by a typical interview by the program director to determine if you are a fit with the department.  Once that is done they will get back to you with a written offer of employment, and you begin training.", "Interview Questions": "Why do you want to be an adjunct?"}, {"date": "19 Jul 2015", "title": "Online Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "Unpaid training is illegal in the US, yet the application asks if you are willing to participate in it, and it seems they do require it. One is entitled to report illegal practices such as unpaid training to the DOL, as well as report retaliation for applicants or employees unwilling to participate in illegal practices such as unpaid training. I'm not sure how they've gotten away with this for so long, but the DOL clearly states that and there have been plenty of court cases to back it up. This is true federally, even in right to work states. I believe this information is on-topic and  meaningful to a person who is seeking to understand what it is like to work or apply at this particular company.", "Interview Questions": "Would you be willing to participate in unpaid training for several weeks?"}, {"date": "5 Apr 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American Public University System (Virginia Beach, VA)", "Interview Descriptions": "Online teaching position.\r\n\r\nPhone interview initial screening  with HR to meet minimum requirements which include sending official transcripts directly to  American Public University System (APUS) then assuming they want to move forward, HR schedules an interview with the department head. Phone, no face to face interview.", "Interview Questions": "Prior teaching experience at the college level?"}, {"date": "2 Apr 2015", "title": "Online Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System", "Interview Descriptions": "Applied online and received an email a couple weeks later. Did a phone interview with a faculty director and another online instructor. Was offered the job a few days later. Went through several weeks of unpaid training before beginning work.", "Interview Questions": "How would you maintain rigor in the classroom with adult learners who have busy lives with family, work, and other obligations?"}, {"date": "31 Jul 2018", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Public University System in Feb 2015", "Interview Descriptions": "The HR department will contact you and ask some general questions. Next, the program director will contact you to set up an interview.  More often than not, there are two people on the panel, the director and a staff member.  Once the interview was over, I was contacted within a week.", "Interview Questions": "Where do you see yourself in five years?"}], [{"date": "27 Sept 2016", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at American Public University System (Charles Town, WV) in Sept 2014", "Interview Descriptions": "Interviewed by four people but the last interview with the most senior person was amazing -- different and appropriate.  I was expecting a typically interviiew and a \"stuffy\" one but instead I was met with by a disarming but obviously very smart manager who had me do a case study, and show my work, so he could see how I worked through it all.", "Interview Questions": "To do a case study, solve a companies problem given a scenario"}, {"date": "2 May 2014", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American Public University System", "Interview Descriptions": "Standard interview process. Started with phone screening with behavioral questions and situational reactions. Took about an hour to complete. I was then contacted within a week and was brought in the week after for a face to face interview. Met with 4 senior managers, who asked standard interview questions and how I'd react in certain situations.", "Interview Questions": "How I would react to an irate student. "}, {"date": "15 Apr 2014", "title": "Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at American Public University System (Charles Town, WV)", "Interview Descriptions": "The interview was actually really nice, quite informal. I went in, spoke with the manager for about a half hour, and then joined the rest of the team for questions. In all it was about an hour.", "Interview Questions": "N/A"}, {"date": "18 Nov 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Public University System (Charles Town, WV) in Jul 2013", "Interview Descriptions": "I interviewed first in a group interview, bias was against older candidates, as only those under 40 were hired.  A year later, I interviewed face to face, and again, bias was against older workers.  I was finally hired after a year and a half.", "Interview Questions": "Why do you want to work in higher education?"}, {"date": "10 Feb 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Public University System (Colorado Springs, CO) in Apr 2013", "Interview Descriptions": "The interview was a panel interview with several candidates and more than one interviewer.  It was done by telephone.  The interviewers asked a question and candidates answered.  There was not an \"order,\" but candidates seemed to be able to identify themselves and answer without stepping on one another.", "Interview Questions": "How I would handle a student who kept asking the same question."}, {"date": "3 Nov 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Public University System (Charles Town, WV) in Nov 2012", "Interview Descriptions": "First a Phone interview, then a one on one with the hiring manager and then a panel interview with the team. Friendly and helpful. No negativity felt. Seemed like a strong team to work with. They were honest when describing the culture and pace of the workload. The honesty was appreciated.", "Interview Questions": "Asked about problem solving."}, {"date": "11 Feb 2013", "title": "IT Helpdesk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Public University System (Charles Town, WV) in Oct 2012", "Interview Descriptions": "phone interview, followed by 3 on site interviews. Wasted almost a week's vacation time on this place, they were very disorganized.  Hiring manager seemed to be a total micro manager, not letting any of her subordinates make any hiring decisions.  High turnover in the IT group as well. My experience was similar to the other comment seen here, except for the fact that the person I started the interview process with quit after only 2 months on the job. What does that tell you about the management here?", "Interview Questions": "never had any real technical interview questions, very general "}, {"date": "24 Dec 2012", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System (Charles Town, WV) in Aug 2012", "Interview Descriptions": "It went very well, a little bit of waiting but very pleased. Started out as a standard e-mail response from saying they sent my information to a hiring manager. A week later had a phone interview. Another week later had a three hour interview. A week later, got a phone call from the manager and then a follow up call from HR about offer detials. Another week later, I was sitting in orientation. Took a little time but went very smooth.", "Interview Questions": "Group Interview - Just tough to think on the fly when you are nervous. "}, {"date": "2 Sept 2015", "title": "Social Communities Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Public University System (Manassas, VA) in Aug 2012", "Interview Descriptions": "I sat down with the then-Director of Online Marketing, and we had a frank discussion about the position, what it offered, and what would be entailed as a Social Communities Coordinator. She was concerned about it being an entry level position, considering my experience, but I was fine with the opportunity.", "Interview Questions": "Why did you choose APUS?"}, {"date": "30 May 2012", "title": "Associate Vice President - IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at American Public University System (Charles Town, WV) in May 2012", "Interview Descriptions": "The interview process started out rather standard.  Very generic emails generated out of recruiting system to setup a time for phone interview.  Had interview, very easy back and forth conversation discussed my background, told me about the position, etc.  2 days later got another generic email from recruiting system to schedule an in-person interview.  After providing dates and times, received an invitation for an in-person interview scheduled for an hour.  The day of the interview I met with the CIO first, then the hiring manager.  I was there for over 3 hours which was fine, but unexpected.  I was told after that  interview that they should have a decision made within a week.  I followed up with recruiting, and a few days later got an email from an HR person saying that they're going to send me an email to provide names for an automated recruiting system.Provided the information and within 2 days had all my references provide feedback.  Nothing heard for about 2 weeks then got an email that they wanted me to meet with 3 senior staff and 3 staff that would report to me.  The interview with the most senior person was very interesting - she walked through my resume from college, through every job.  Feedback received later was that I sure moved around a lot.  (interesting because I've been with my current company for 9 years).  I was told they'd have a decision by the end of the week.  I followed up the following week and kept getting responses that we can talk tomorrow, we can talk the next day.  This went on for over 2 weeks with me waiting around for her call.  Finally I get a call from the CIO and VP of IT telling me that leadership wanted to go another direction with the focus of the position and I wasn't a fit.  However, they both felt I was a great fit for their organization and they would find me another role.\r\n2 weeks later I get an email asking me if I was still interested in that position - to which I replied I was.  I came in the next day and spent about 1 1/2 hours discussing the position.  Next we setup 3 30 minute phone calls with the staff who would report to me for the next day.  I asked whether they were the decision makers and was told they weren't.  The following day i called into a conference bridge and had the calls with the 3 managers.  I thought the calls went very well.\r\nWas asked Friday whether I could talk Tuesday (Monday was a holiday) and answered that I was available all day.  No call on Tuesday (which I guess is just the norm).  Wednesday AM get an email asking if we could talk in the afternoon.  Well after being 10 minutes late calling me, i was told that the staff didn't feel a connection with me.  Now I'll be honest with you - in my entire career the one thing I bring to any job is my ability to connect with people and build relationships with them.  So basically - the staff didn't want this position filled (new position between them and the VP) so they decided to block me.  What's interesting is the connection I had with both the CIO and Hiring manager was very strong and they both admitted that to me.  The staff was obviously successful, but was very surprised that the VP would let them make the hiring decision. \r\nI'd really watch out with this place - especially in the IT department.  If you are coming into a senior position you are at the mercy of the lower level staff.  \r\n\r\nAll in all it was a waste of time and energy.  I would have rather them say no, no thank you early on and let me move on.  Instead they dragged it out and wasted an incredible amount of my time.", "Interview Questions": "Please tell me about yourself"}], [{"date": "24 Feb 2016", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Public University System (Charles Town, WV) in Apr 2012", "Interview Descriptions": "I was interview by the manager of the department and the recruiter provided the rest of the process, it was easy to do.  I had applied to the company 4 times before being hired - they would hire within the company", "Interview Questions": "Asked about my work history"}, {"date": "7 Dec 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at American Public University System (Charles Town, WV) in Dec 2011", "Interview Descriptions": "I met with a few people in different buildings. Note that they are located in many buildings throughout Charles Town. The review was not very difficult. It was a standard interview. The executive that I spoke with was not very well versed about the position I would be taking so that may be why it was not too difficult.", "Interview Questions": "They asked about my past job and my direct experience."}, {"date": "22 May 2015", "title": "Transfer Credit Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Public University System (Manassas, VA) in Sept 2011", "Interview Descriptions": "There were 2 people in a small room that asked questions. They were not hard at all. They were really nice and down to earth so I was not that nervous.", "Interview Questions": "difference scenarios from your previous work experience."}, {"date": "17 Mar 2013", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Public University System (Charles Town, WV) in Jun 2011", "Interview Descriptions": "Group interview with 15 other candidates. We met with all the managers in the Financial Aid department, including the VP and CFO. Each candidate had  one on one time with a manager. After the interview, the manager called me and said she was interested in bringing me back for a second interview to meet with the director and VP. After the second interview, HR emailed me a typing test and a reference check to complete. The whole process took about 2 weeks.", "Interview Questions": "Questions were not difficult"}, {"date": "25 Sept 2014", "title": "Financial Aid Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Public University System in Mar 2011", "Interview Descriptions": "I was interviewed in a group setting with  a bunch of other people.  The interviewers gave an overview of APUS and what the position was about.  Then divided us up and took us in individual rooms to do individual interviews.", "Interview Questions": "Describe a complicated scenario you previously experienced and how did you handle it."}, {"date": "27 Aug 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at American Public University System (Charles Town, WV) in Feb 2011", "Interview Descriptions": "I met with the Director and had a very laid back, informative interview. It was a relaxed atmosphere and afterward I received a phone call offering me the position. I accepted on the phone and started a month later.", "Interview Questions": "Why do you want this job?"}]]