[[{"date": "11 Jul 2023", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pasadena City College", "Interview Descriptions": "Very disorganized. The interview was scheduled over Zoom although I live within 5 miles of the college. At the last minute, the interview was changed and scheduled to another day without even consulting me.", "Interview Questions": "Tell us how you value diversity."}, {"date": "11 Jul 2023", "title": "Full-Time Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Pasadena City College (Pasadena, CA) in May 2023", "Interview Descriptions": "The questions were boiler plate and did not seemed geared to actually get to know the candidate. It seems like they already had made up their mind before the interview.", "Interview Questions": "Describe a conflict you've had with a previous colleague and how was it resolved."}, {"date": "5 Jul 2022", "title": "Admin Assistant II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pasadena City College", "Interview Descriptions": "Hiring committee of five to six individuals representing various unions and divisions from the college. In person, with a time to preview questions before going to meet the entire committee.", "Interview Questions": "Job history\nQualifications\nFuture career plans"}, {"date": "13 Dec 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pasadena City College", "Interview Descriptions": "Met with a team of 5 people, they asked an array of questions, also had to answer some questions about possible scenarios, this was done on paper, interesting touch. They were warm and welcoming.", "Interview Questions": "Why do you want to work here?"}, {"date": "16 Jul 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pasadena City College", "Interview Descriptions": "committee out of compliance and unprofessional. I  was asked questions that had nothing to do with the field or the teaching expectations. The chair did not understand the position.\nInterview lost his composure in the interview.", "Interview Questions": " What are some community college near the  4 year university where you are currently employed?"}, {"date": "1 Jul 2021", "title": "Director of Marketing - PCC Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pasadena City College", "Interview Descriptions": "The whole process was thorough and fair.  Although I didn't get the offer, they were communicative and kept me in the loop.  I would apply again, and hope for a future chance to showcase my abilities.", "Interview Questions": "My experiences - Details about some of my roles/responsibilities. "}, {"date": "28 Jun 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Pasadena City College (Pasadena, CA) in May 2019", "Interview Descriptions": "Very nice. Interviewer was easy to talk to. The job is entry level and it doesn't require much work so the interview isn't too crazy. I highly recommend interviewing with them.", "Interview Questions": "Very basic. Its just for student"}, {"date": "30 Mar 2022", "title": "IT Profesional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pasadena City College (Pasadena, CA) in Jun 2018", "Interview Descriptions": "There were two different rounds, the first one was a simple interview, classic interview questions, make sure to practice \"tell me about your self\" .\r\n Second round was a more technical interview.", "Interview Questions": "Tell me about your self"}, {"date": "13 Aug 2021", "title": "Human Resources Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Pasadena City College (Pasadena, CA) in Aug 2017", "Interview Descriptions": "There is an interview panel with up to 10 people at the first level. You are asked questions by each person specific to the job duties noted on the job description. If you are successful, you are invited to a second-level interview with 2-3 people. They ask more probing questions about your skills and abilities based on the dob requirements. If you are selected for the job, a human resources person will call you.", "Interview Questions": "Provide an example of a time when you worked in a diverse environment."}, {"date": "7 Aug 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pasadena City College (Pasadena, CA) in Jun 2017", "Interview Descriptions": "Went to a group interview of about 6 girls and the Child Development Center President and office manager asked us all questions and we could volunteer our answers, although other questions were required. They listened to everyone and wrote down comments on a booklet.", "Interview Questions": "1. They gave us a story and then asked if we could repeat all the names they had mentioned. \r\n2. What is your career goal? What are you doing to achieve it?\r\n3. Do you like kids? Do you have experience working with children? \r\n4. Do you have experience in customer service?"}], [{"date": "6 Jan 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Pasadena City College (Los Angeles, CA) in Apr 2017", "Interview Descriptions": "Lengthy and fairly vague on requirements. I only found out about requirements through a friend that had already been through the process. Then, it took several months before the position actually \"posted\" and was considered open to interview", "Interview Questions": "I remember one unusual question that I was asked dealt with qualifications that had nothing to do with the actual position being posted... different skill sets"}, {"date": "29 Jan 2016", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Pasadena City College (Pasadena, CA)", "Interview Descriptions": "This position was for a special project, so the interview was very straight-forward. They described the position to me, explained that it would be 2-3 months long, and asked if I was comfortable with the job duties and pay and basically offered me the job. The other College Assistants working with me on the project were pretty much offered the job over the phone after HR reviewed their resumes. My position is slightly different than theirs, though we mostly work on the same project. I was interviewed face-to-face after a brief phone discussion.\r\n\r\nI applied in August, but they didn't call me until late Nov or early Dec. The pay was not negotiable.", "Interview Questions": "Do you have experience using databases?"}, {"date": "3 Jul 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pasadena City College (Pasadena, CA) in Mar 2015", "Interview Descriptions": "There's a panel of about 6 people conducting the interview and an HR rep. The HR rep is there to make sure the interview is being conducted legally and fairly, but they don't have any say on whether or not you get the job.", "Interview Questions": "What makes you qualified for this position?"}, {"date": "31 Mar 2017", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Pasadena City College (Pasadena, CA) in Feb 2015", "Interview Descriptions": "Brief interview and screening. Process began with a paper application stating required self-identification information and a copy of an academic transcript. Hiring process was mainly related to how many math courses taken and grades received in said classes. Requirement was not high at all, if I remember correctly Calculus was not needed.", "Interview Questions": "What math classes have you taken?"}, {"date": "9 Oct 2016", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Pasadena City College (Pasadena, CA) in Jun 2014", "Interview Descriptions": "I was interviewed by 2 future supervisors and got a call back a few days later confirming that they want to hire me. I then had an interview with the Dean for the department I would work in and got grilled. I got the job and started 3 weeks later.", "Interview Questions": "They gave me 5 different scenarios and asked how I would handle them."}, {"date": "27 Feb 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Pasadena City College (Pasadena, CA) in Aug 2013", "Interview Descriptions": "Had to bring a college transcript to the interview to go over, then asked a few questions about my current and previous courses and whether or not I could balance school and work. The interviewer then asked me a few personal questions to gauge my personality. It wasn't a hard interview at all.", "Interview Questions": "Can you balance school and work?"}, {"date": "3 Jul 2017", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Pasadena City College (Pasadena, CA) in Aug 2013", "Interview Descriptions": "There was no real interview process. I was referred to the position by a friend and the interview was with the director, it took only 20 minutes. I kind of already knew I had the job, it was more of an official meeting with the director", "Interview Questions": "N/A"}, {"date": "17 Sept 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Pasadena City College (Pasadena, CA) in Jul 2011", "Interview Descriptions": "You have to first apply at the specific department with the opening and speak to the person in charge of the hiring process for it. As for the interview itself, it's usually that one individual that will most likely be your main boss that will be asking the questions. He/she will ask about your interests, reasons, and qualifications. Then you will be told you will hear from him/her in the next few weeks or you may even be hired on the spot. Then, you will be sent to another office on campus to submit your digital fingerprints, next to  HR to fill out paperwork, and finally the dean of the department will have to sign your form to have it approved.", "Interview Questions": "Tell me a stressful situation and how did you overcome it?"}, {"date": "9 Nov 2011", "title": "Financial Aid Intake Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Pasadena City College (Pasadena, CA) in Sept 2009", "Interview Descriptions": "Neutral", "Interview Questions": "What would you do if a students gets mad? "}]]