[[{"date": "23 Feb 2023", "title": "TEACHERS ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Webex interview. Questions about resume and what experience is relevant to the position. How to handle the classroom? Office hours? Day and time schedule? Availability? What to you bring to the table?", "Interview Questions": "Why do you want this position?"}, {"date": "19 Jan 2023", "title": "Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rensselaer Polytechnic Institute in Dec 2022", "Interview Descriptions": "No follow up until prompted, not a lengthy interview process, just not a lot of communication. I would have appreciated a personalized follow up rather than a computer generated email", "Interview Questions": "Experience in the related field"}, {"date": "6 Dec 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Clear instructions for WebEx call to interview. The interviewers were knowledgeable and kind. They gave me resources for the next steps and let me ask many questions. Overall great experience.", "Interview Questions": "What are your skills in this area?"}, {"date": "17 Aug 2021", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "the interview is easy since i was an undergraduate student in the college. I just submit my resume and transcript to the professor. Once he's satisfied with the courses youve taken and your grade, you will be all set.", "Interview Questions": "What is your passion in science"}, {"date": "23 Jul 2021", "title": "Research Support Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Jul 2021", "Interview Descriptions": "Lengthy, mostly just the interviewer talking. Not many technical questions unless you have prior technician/engineering experience. You will be asked a variety of questions especially testing your technical skills, analysis skills, and the processes you take to help make a goal or project move forward.", "Interview Questions": "What was one problem you ran into at your previous position? How did you solve it?"}, {"date": "27 Jul 2021", "title": "Research Support Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rensselaer Polytechnic Institute in Jul 2021", "Interview Descriptions": "The interview process is very straightforward. I applied and was able to schedule my first interview within a week. I've been invited to a second on-site interview and it's a very systematic, easy process.", "Interview Questions": "Q: What makes you qualified for this job?\nQ: Are you a long-term candidate?\nQ: What do the next 5 years look like for you?\nQ: Are you ok with this pay range?"}, {"date": "4 Jun 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Very involved, but painless process. Met with many individuals, all of whom were friendly and asked reasonable questions. The time between the interviews and the offer being extended was quite lengthy, however,  and that was frustrating.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Jul 2023", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Mar 2021", "Interview Descriptions": "Short virtual interview with the dean of Student Living and Learning. Questions were standard interview questions, focusing on diversity, inclusion, and community. They also asked about how you feel about enforcing policy even in the case that you don't agree with the policy.", "Interview Questions": "How would you plan to create a sense of community in the dorms?"}, {"date": "30 Aug 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Apply via an email sent from CS Department, complete a form and send CV, and wait for notifications. Basically,  there is no formal interview. But if they wanna know more about some specific experience, they will contact with email.", "Interview Questions": "What courses did I take at RPI?"}, {"date": "3 Feb 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "I just asked for an unpaid internship with the darrin freshwater institute and was able to get the job. I did not have to go through any type of formal interview process.", "Interview Questions": "N/A"}], [{"date": "6 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "I applied online. Approximately 2 weeks later, I received a generic rejection email stating that I was not among the applicants being considered for the position. I was never contacted for an interview.", "Interview Questions": "N/A"}, {"date": "23 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Jan 2019", "Interview Descriptions": "Developed core mechanics for an interactive simulation game in AR regarding a sophisticated freshwater ecosystem with C#; Integrated surround sound effect modules into AR and VR games, collaborated with other developers on the optimization of stereo effects for a more immersive gaming experience.", "Interview Questions": " Developed core mechanics for an interactive simulation game in AR regarding a sophisticated freshwater ecosystem with C#; Integrated surround sound effect modules into AR and VR games, collaborated with other developers on the optimization of stereo effects for a more immersive gaming experience.\r\n"}, {"date": "18 Jun 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Oct 2018", "Interview Descriptions": "super easy and nice. i had no issues. they gave me lots of options and tailored the research to what i wanted to get out of the expirence. i would highly reccomend this opportunity to any family, friend, classmate, coworker, stranger, enemy, member of another planet, member of another solar system, member of another galaxy, and a member of another universe.", "Interview Questions": "what are you interested in"}, {"date": "23 May 2018", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY)", "Interview Descriptions": "There was no formal interview. Just a chat with the Associate Dean. You will get an offer sometime late May and mid June, regardless of how early you contact. If you are graduating from RPI with a PhD and unsure of your job search process, this is a good position to hangout for a while.", "Interview Questions": "Can you teach \"XYZ courses\"?"}, {"date": "2 Apr 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Jan 2018", "Interview Descriptions": "Very thorough. In depth knowlege required. Prepare well for the interview. Do not leave anything to chance. Very good interviewers. Very nice atmosphere. Intervewer was very nice. Do not take any pressure.", "Interview Questions": "What are your biggest strengths?"}, {"date": "27 Feb 2020", "title": "Operations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Nov 2017", "Interview Descriptions": "The interview process was very long (3 months) the longest time was when resume was reviewed (1.5 months) then a phone interview followed by a face to face interview. I applied twice with 3 years in between and the process has not  improved and the recruiters I worked with the first year all left by the third year. When they do let you know you have been declined, they just leave you a message with no return call, just a rejection notice via email and on your profile when you log in. I found the process very demoralizing. They lead you on about what a great candidate you are and then keep rejecting you. I have two Master’s degree/years of experience and was rejected on two entry level positions that required GED’s. I was offered positions at other universities with higher pay and positions that fit my skill sets.", "Interview Questions": "Standards stuff-\r\nYour strengths and weakness?\r\nWhat skills can you being to the table?\r\nWhat characteristics do you loom for in a manager?"}, {"date": "6 Jun 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Mar 2017", "Interview Descriptions": "4+ months with very little communication. Phone interview followed up with in person interview with various members of the department including Director, staff and subordinates. I was told I was overqualified for the position, but still interviewed. Took 5 weeks to hear about being a finalist and then background check and references.  Followed up 4 weeks later with no returned email or call, heard back 2 1/2 weeks later with a VM requesting a call back.  They never returned the call, only to find out my result online and a email notifying I was not offered the position.  I was not able to attain any feeback since no phone call was returned.", "Interview Questions": "Standard: what is your weakness and strength"}, {"date": "18 May 2017", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rensselaer Polytechnic Institute in Dec 2016", "Interview Descriptions": "My first contact was via email, which was a first for me. I cleared my schedule and made time to go. After the first interview on site, I was called to come in the next day to meet with a dean. It was a hectic time, but I went. On both occasions, the interview went longer than scheduled. I was told I'd hear soon...and I was never contacted again.", "Interview Questions": "How do you see yourself learning about all the tasks entailed in the position?"}, {"date": "27 May 2016", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in May 2016", "Interview Descriptions": "Got a very brief personality screening. Answered basic questions about myself and my aspirations. Most questions pertained to social skills and working as a team. Interview was very casual and laid back.", "Interview Questions": "Where do you see yourself in two years?"}, {"date": "10 Jan 2017", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Apr 2016", "Interview Descriptions": "Long Process. Phone Interview with HR representative. Phone interview with Manager of the department I would work for. In person interview with potential coworkers. In person interview with Managers of the department. In person interview with the Director. In person interview with the Vice President.\r\nI also needed to provide 10 references in a short time frame.", "Interview Questions": "What is your experience with older systems?"}], [{"date": "13 Feb 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Apr 2016", "Interview Descriptions": "This was by far one of the most informal and enjoyable interviews I have ever had. I met with the faculty, spent about a half hour chatting with each of them, and then went to lunch.", "Interview Questions": "Do you know MySQL?"}, {"date": "12 Sept 2016", "title": "Student Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Mar 2016", "Interview Descriptions": "Relatively straightforward.  As a student in the department, applied for a summer research job.  Professor had an research grant that allows for two extra research assistants for the summer.  Talked to the professor after lecture to express my interest in the research program.  Discussed my background and interest in his research as well as availability over the summer.  Interviews lasted several weeks, mostly in person.  Went by to see the research and get a high level overview on what was required for the position.", "Interview Questions": "How are my language skills?"}, {"date": "16 Sept 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "In person, a graduate student asked me what my strengths were as a programmer, and examples of how I put it to use. Also checked various skills such as first order logic. Later sent out a series of questions to evaluate my experience with the particular tools the lab was using, and problem solving ability.", "Interview Questions": "What would you say your greatest strength is in programming?"}, {"date": "1 Sept 2015", "title": "Graduate Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Informal, just talking to professors to see who is the right fit with the right research. The tougher part is the written application part of actually getting into RPI. It was all very relaxed.", "Interview Questions": "What kind of research are you interested in?"}, {"date": "22 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Aug 2015", "Interview Descriptions": "Met with my (current) advisor and spoke about our interests and potential research topics. He mentioned some projects he is working on currently. Also, his current funding situation and requirements to graduate were briefly discussed.", "Interview Questions": "Describe one machine learning research project you worked on"}, {"date": "27 Feb 2018", "title": "Website Mana Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Apr 2015", "Interview Descriptions": "One on one meeting with full-time staff member to assess fit for the job.\r\nMostly focused on good fit for needing to work with professors, clerical staff, and technical staff all in one position. Was relaxed and straightforward, no curve ball questions or technical interview.", "Interview Questions": "Have you worked on a team with non-computer-technical members for this kind of project?"}, {"date": "24 Nov 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY)", "Interview Descriptions": "Round one (1) committee interview followed up with a round two (2) in person interview with hiring manager. The committee was made up of various staff and faculty across campus. They had prepared questions.", "Interview Questions": "Why did you choose Rensselaer and the career for which you are preparing?"}, {"date": "29 Dec 2016", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Sept 2014", "Interview Descriptions": "Had phone interview first.  Followed by interview with HR, supervisor and rest of the team.  Second interview with supervisor.  Process is fairly slow from time of first contact to offer of job, but was worth the wait.", "Interview Questions": "Wanted to know if I was able to name all of the schools within RPI"}, {"date": "11 Jun 2014", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Rensselaer Polytechnic Institute (Troy, NY)", "Interview Descriptions": "You MUST be an enrolled student at the Rensselaer Polytechnic Institute. Simply contact a professor, whose field of research or specific project is of interest to you, via email or in-person at their respective office. Definitely provide a resume and cover letter and express your interest in their subject. Most likely, they will ask questions about your experiences and goals (almost an informal interview). It is not difficult to get a position.", "Interview Questions": "\"Why are you interested in this field?\""}, {"date": "5 Mar 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Apply and receive letter of acceptance or denial. They will most likely fly you out to the university to meet with some of their staff and show research, this is less and interview and more of an introduction and persuasion effort on their part.", "Interview Questions": "Just knowing what it is you want to do for research."}], [{"date": "19 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "long process of application process. But the student manager is very helpful to solve problems. Graduate School is hard to deal with, they can be very picky.", "Interview Questions": "N/A"}, {"date": "11 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rensselaer Polytechnic Institute", "Interview Descriptions": "Basically it was an admission process based on undergrad CGPA, GRE and TOEFL score.", "Interview Questions": "How do you define ion implantation?"}, {"date": "17 Apr 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Nov 2013", "Interview Descriptions": "First you need to be a full-time student in RPI\r\n1.Submit your resume and transcript through website \r\n2. Invited interview by the administrative stuff \r\n3. interview with the dean of the department \r\n3.After 10+ days, you will get result from the department", "Interview Questions": "Why you choose to become a TA?"}, {"date": "20 Feb 2014", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 days. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Aug 2013", "Interview Descriptions": "Super easy to get research if you are willing to ask.", "Interview Questions": "What project do you want to work on?"}, {"date": "23 Aug 2013", "title": "Director In A Student Services Role Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Rensselaer Polytechnic Institute in Jul 2013", "Interview Descriptions": "The initial process was through a search firm, beginning with a 45 minute phone interview that was very conversational and provided good insight into the organization.  I was then invited to a video conference interview with the hiring manager and high ranking person in HR, after which I was invited to campus.  I declined that interview based on information gleaned in the video interview", "Interview Questions": "There were no particularly difficult question. The HR guy was very focused on early details in my resume, which no one has asked me about in years, so that was a bit surprising.  I recommend that anyone interviewing for a mid-upper level position carefully review their resume and prepare to discuss experiences that may be 15-20 years old. "}, {"date": "22 Apr 2014", "title": "Principal Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Apr 2013", "Interview Descriptions": "Met with the project leader, who asked me about my motivations and interests in the projects he was heading. He assessed basic mathematics and physics skills to make sure I had the potential to fulfill the requirements within the allotted time frame", "Interview Questions": "Implementing Fourier transform on a digital computer"}, {"date": "10 Aug 2015", "title": "Help Desk Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Apr 2013", "Interview Descriptions": "They brought me up to a conference room and was interviewed by 3 people. The interview was not very technical, they showed heavy emphasis on personality and ability to provide good customer service.", "Interview Questions": "What operating systems are you familiar with?"}, {"date": "8 Jul 2014", "title": "Bartender At Clubhouse Pub Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Aug 2012", "Interview Descriptions": "There was no interview process, I submitted an application, came in for an interview, and ended up training on the spot. Training included watching instructional videos on the correct way to pour types of beer. There was likely a behavioral interview of sorts taking place, but most hires were done via word of mouth and so most of that had been taken care of beforehand.", "Interview Questions": "Correct technique to pouring Guinness. It really was not a hard job."}, {"date": "6 Jul 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Mar 2012", "Interview Descriptions": "Interviewing candidates for a position within your company is one of the final steps in the hiring process. Before you get to this step, you want to make sure that you've completed all of the preceding steps since each of these steps will have a direct impact on how effective the interview process will be.", "Interview Questions": "What's your research interest?"}, {"date": "25 Feb 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Oct 2011", "Interview Descriptions": "Interviewed twice.", "Interview Questions": "What is your stongest and weakest assets."}], [{"date": "12 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Jun 2011", "Interview Descriptions": "Meet with the professor that would hire you as an RA. I got invited into his office and started the interview process. It was a reasonable interview and I was pleased with it.", "Interview Questions": "Previous research experience and passion for research."}, {"date": "22 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Jan 2011", "Interview Descriptions": "I had a couple of Skype interviews with advisor about motivation, English level, technical knowledge, and how I see myself in 10 years. I was asked a couple of questions on how do I solve problems, and how do I work in teams. Part of the interview was bound to show me what the advisor would expect from me, and if that job was something I was interested on doing.\r\nThe other requirements were a motivation letter, the transcripts, two recommendation letters, and GRE and Toefl scores", "Interview Questions": "Motivation"}, {"date": "10 Nov 2009", "title": "Technology Analyst Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rensselaer Polytechnic Institute in Oct 2009", "Interview Descriptions": "Initially, I was very nervous to go on this interview as a number of my friends at school had undergone the process and not been offered positions.  The interview consisted of three thirty-minute interviews plus a group exercise. I was there from about 11:30am until 5pm.  I think overall, the interview was challenging.  Be ready to answer many behavioral-based questions.", "Interview Questions": "Tell me about yourself. "}, {"date": "12 Dec 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Mar 2009", "Interview Descriptions": "Multiple meetings that ended up in meeting executive staff. Change in job description further delayed process. After several months finally received offer but negotiated fringes and salary.", "Interview Questions": "How would I proceed to handle my  Vice President's job?"}, {"date": "30 Sept 2010", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rensselaer Polytechnic Institute (Troy, NY) in Sept 2008", "Interview Descriptions": "phone interview..technical and was offered the position", "Interview Questions": "technical questions "}]]