[[{"date": "13 Jul 2022", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Broward College", "Interview Descriptions": "It was a panel interview with 3 people and a small teaching presentation. They were doing a few of them back to back and we waited outside of the classroom before being called in.", "Interview Questions": "Please tell us about yourself. "}, {"date": "20 Oct 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Broward College (Washington, DC)", "Interview Descriptions": "The Interview process with two employees, did not hear back until 2 months later and ignored multiple emails from me.\n\nVery unprofessional. Bad process. I hope they can improve this ASAP", "Interview Questions": "What does outreach mean to you"}, {"date": "14 Jun 2021", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Broward College", "Interview Descriptions": "It was very informative . Just explain yourself properly & answer all the questions. It doesn’t take long  it’s around maybe 10-15 minutes interview. You can ask questions if you choose to", "Interview Questions": "What makes your a good leader "}, {"date": "22 Jan 2021", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Broward College", "Interview Descriptions": "The interview process was good. Just asked about myself, and questions related to IT. The interviewer was very kind and made sure I was comfortable. Afterwards, there was a practical test where I had to troubleshoot a computer myself and get it working again. Really liked that experience because I got to show what I knew hands on.", "Interview Questions": "1. If a user asks to install a video game on their device, but that is against company policy what do you do?"}, {"date": "16 Dec 2020", "title": "Associate Dean, Visual and Performing Arts Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Broward College (Fort Lauderdale, FL) in Dec 2020", "Interview Descriptions": "I did three interviews and inested a lot of time into my application, and in the end they notify me of rejection with an impersonal email. Tells me all I need to know about why I wouldn't want to work there. If they had any class, they would call me up in person and allow me to ask for feedback about my application and interviews, so I can better myself for the next application. They owe me at least that. Other places do that, and so would you or I.", "Interview Questions": "Asked me what I would do in real life situations a person in this role would likely face, such as resolving conflict. Asked me for strategic advice about how to grow their programs, which I provided."}, {"date": "22 Oct 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Broward College (Davie, FL) in May 2020", "Interview Descriptions": "The job interview was very straightforward. Everyone was very transparent and answered all my questions about the company. I enjoyed the interview and felt like I was apart of the team already.", "Interview Questions": "What would you do in a situation where a student was very unsatisfied and needed assistance?"}, {"date": "23 Sept 2019", "title": "Associate Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Broward College (Fort Lauderdale, FL) in Sept 2019", "Interview Descriptions": "The interview was okay but I could tell from the environment it wouldn't be a good fit for me.  The environment was behind in technology and I have to get a good vibe about a place when I interview.", "Interview Questions": "How do I overcome dealing with difficult people?"}, {"date": "18 Jul 2019", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Broward College", "Interview Descriptions": "You have to talk about your background, and you have to pass a math test, to prove your skills.  Other than that is a very simple process, you just need to show that you have a strong mathematical background, and you're able to help the students with their questions.", "Interview Questions": "What's your math knowledge?"}, {"date": "26 Feb 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Broward College", "Interview Descriptions": "Interview was simple and to the point, questions were 100% related to the job and nothing tricky or difficult. Some simple example questions to see how you react to certain situations. A background check is also required, but its not to bad.", "Interview Questions": "Q: How would you respond to an angry student, who is frustrated with their teacher or assignment?"}, {"date": "6 Apr 2023", "title": "Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Broward College (Coconut Creek, FL) in Feb 2019", "Interview Descriptions": "3 rounds of interviews with variety stakeholders. Very fair and interesting process. Interview questions varied from session to session, but focused on experienced based questions. Additionally I was asked to detail various success stories during interview session.", "Interview Questions": "Q: Tell me about yourself Q: Why should we hire you?"}], [{"date": "29 Jan 2019", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Broward College", "Interview Descriptions": "Phone interview after sending a resume. After a short conversation they asked me to have an on site interview. After that they scheduled a live teaching class on a subject selected couple of days in advance.", "Interview Questions": "What is your specialty?"}, {"date": "30 Mar 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Broward College (Davie, FL) in Nov 2018", "Interview Descriptions": "I had to do only one quick math test, easy to solve. I passed it and then got the job. At the beginning of the semester I had to go to orientation to learn the basics.", "Interview Questions": "What math classes did you take?"}, {"date": "24 Jul 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Broward College in Jun 2018", "Interview Descriptions": "Received a phone call (about 4 months after my initial application) to come in for an interview. It was a panel interview with interviewers asking thorough questions from their sheets. Somewhat confusing questions that partially reflected the job description.", "Interview Questions": "N/A"}, {"date": "31 Oct 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Broward College in Jun 2018", "Interview Descriptions": "I heard about the job through someone else. They got me an interview and after that, I had to go through the background check and HR process. Took about 2 months to get started.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 Nov 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Broward College (Davie, FL) in Apr 2018", "Interview Descriptions": "It was very easy going, I talked about how much I enjoy teaching and I was hired on spot. The associate dean asked me a few questions, but it felt like they just wanted me to talk about myself. I was more nervous than I needed to be.", "Interview Questions": "Why do you want this job?"}, {"date": "19 Jun 2018", "title": "MRI Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Broward College (Miami, FL) in Feb 2018", "Interview Descriptions": "calm, reassuring, thorough, understanding, probed my skill-set, serious consideration, given the opportunity to become comfortable and express my ambitions to be the best at what I do. will recommend to anyone wanting to go  thru this process", "Interview Questions": "how I handle stress"}, {"date": "6 Feb 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Broward College (Davie, FL) in Jun 2017", "Interview Descriptions": "Meeting with program director Pezhman Jatala, and the Dean of Visual Performing Arts Department Mr. Scott Miller.  The first initial interview was held meeting with program director first for preliminary screening before meeting with the Dean of the Department.  Once both interviews were complete a background check and credential check was completed.", "Interview Questions": "When you began to instruct and teach your students;  please take a moment, and explain your  teaching philosophy in one sentence that you utilize in most of your courses taught?  What is the significance of this technique being utilize and how helpful is it with your students?"}, {"date": "8 Aug 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Broward College (Fort Lauderdale, FL) in Mar 2017", "Interview Descriptions": "If you are applying externally then you will receive the typical interview process where it could be phone, in person, or panel interview. The disadvantage of being externally is that they may already have an internal candidate in mind and you are simply a formality for legal purposes. Internally, you adhere to the same procedure, except your disadvantage lies within the college staff notifying your current employer of your interview within another department whether you get hired or not; and this may hurt you more if you aren't hired because your current employer will seek retribution against you, even if it's illegal, they'll just find other means to get rid of you legally before you quit.", "Interview Questions": "Tell me about yourself?"}, {"date": "28 Apr 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Broward College (Fort Lauderdale, FL) in Mar 2017", "Interview Descriptions": "The interview process was smooth and the search chair was very communicative. The search committee was very thoughtful and engaging. They did not make it fearful at all. I would recommend Broward College to anyone.", "Interview Questions": "How I can help with carrying out the strategic mission of the college."}, {"date": "27 Feb 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Broward College", "Interview Descriptions": "Actuall The person who interviewed me no longer works for that department but she was amazing. She really did make you feel like you was important and that she was very happy to have you working with you", "Interview Questions": "Explain a time you handle a difficult situation "}], [{"date": "6 Oct 2016", "title": "Mathematics Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Broward College (Pembroke Pines, FL) in Jul 2016", "Interview Descriptions": "Short and brief. I was interviewed by the person that was going to be my direct supervisor about my qualifications and my immigration status (in order for them to provide me with the necessary papers to get a working permit as an student). Then I was provided with a test to demonstrate my mathematical abilities", "Interview Questions": "How long would you be able to commit to tutoring without affecting your GPA as student?"}, {"date": "27 Jun 2016", "title": "Cashier Book Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Broward College (Davie, FL) in Jun 2016", "Interview Descriptions": "I was hired immediately. I was complemented on my dressing code and how I conducted myself and how excellent I answered the interviewer's questions and I was feeling awesome. I did this all too great and best of all I am proud of it. Thanks to you Broward College.", "Interview Questions": "How satisfied are you with your income.?"}, {"date": "30 May 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Broward College (Davie, FL) in Aug 2015", "Interview Descriptions": "I came in in the morning and there was a round table in the interview room. My interviewer read his questions from a piece of paper. We sat down throughout the whole process while e asked the questions.", "Interview Questions": "How would you go about a scenario where you had the phone ringing and a student in front of you?"}, {"date": "29 Jan 2016", "title": "Senior Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Broward College (Fort Lauderdale, FL) in Jul 2015", "Interview Descriptions": "It was extensive and draining. It required constructing a preliminary report and PowerPoint presentation. The panel interview was 3-part and took several hours. First, there was a quick intro. Then they expected the oral presentation and handouts offering minimal feedback. Next it was a 3-5 page list of open-ended questions asked while they wrote down comments. Finally, it was a timed (20-minute) Excel spreadsheet problem to solve and document the results in Word or PowerPoint. They entered at the midpoint to make sure you were not cheating by calling a consult over the phone.", "Interview Questions": "Describe a workplace situation that was a major challenge for you and how you handled it."}, {"date": "21 Jul 2016", "title": "Financial Aid Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Broward College (Fort Lauderdale, FL) in Feb 2015", "Interview Descriptions": "Group interview is conducted by the senior advisers and supervisors downtown. Questions can be googled and are related to previous employment in financial areas and difficulties faced when interacting with irate individuals. The interview itself took about half an hour and was fairly concise. I was able to watch them deliberate about the interview after I left the conference room. They called me a week later with a job offer.", "Interview Questions": "How would you deal with a hostile student? \r\nWhat you were your previous job duties?\r\nHow do you feel about working as part of a team?"}, {"date": "28 Oct 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Broward College (Pembroke Pines, FL) in Jan 2015", "Interview Descriptions": "Laid back process, was a discussion about the position, what I had to offer and why I was interested in the role.  Phone interview first and then in person one on one interview.", "Interview Questions": "Tell me about yourself?"}, {"date": "8 Oct 2014", "title": "Senior Campus Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Broward College", "Interview Descriptions": "Applied via Jobs.Broward.edu waited 3 weeks for follow up. Interview was as expected. Typical environment for a Windows based organization. Have small VMware enviroment with access restrictions. Seemed to want someone that wore all hats.", "Interview Questions": "General questions, nothing terribly technical. Gauging for more of personality than technical aptitude. \r\n\r\n\"When was a time you and your boss didn't agree with one another\"."}, {"date": "4 Aug 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Broward College", "Interview Descriptions": "Checked credentials through transcript review to make sure you had the right number of courses. Otherwise, I was given a shot with no previous teaching experience. Started with a lab course as a trial and worked up to a full course the very next semester. The folks I worked with are long gone, but have moved up so I'll take it as they had excellent judgment.", "Interview Questions": "Nothing really too difficult."}, {"date": "13 Sept 2016", "title": "Lab Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Broward College (Coconut Creek, FL) in Aug 2014", "Interview Descriptions": "I applied and was hired within the week. I approached the front desk and asked to speak with a supervisor in charge of hiring. I met with the employer and described my interest on finding a job. I gave her a brief background on me and she gave me an application form to fill out. I filled the application and returned the next day with a copy of my resume to be interviewed.", "Interview Questions": "In your opinion what is the most important quality a tutor must have?"}, {"date": "4 Sept 2014", "title": "Director/Assistant Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Broward College (Fort Lauderdale, FL) in Jun 2014", "Interview Descriptions": "Travel expenses including air fare, hotel, and car rental were paid out of my own pocket. I was told I would be reimbursed, three months later I am still waiting. Interview only lasted an hour. No one showed me around campus. No one offered to pick me up from hotel. I wasn't even offered a cup of coffee, let alone lunch.", "Interview Questions": "Describe your dissertation, as if you were describing it to a child."}], [{"date": "19 Jan 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Broward College (Fort Lauderdale, FL) in Feb 2014", "Interview Descriptions": "Tailored, honest, and comfortable. I felt that the people were very nice and professional. The interview style was direct and clear with an emphasis on student interaction. The only issue was that it took several months of back and forth to even get in the door.", "Interview Questions": "How would you work with a troubled student?"}, {"date": "10 Feb 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Broward College (Davie, FL) in Sept 2013", "Interview Descriptions": "I asked them about the available tutor positions and they immediately gave me an assessment on how I well did on mathematics on the spot. I performed well as it was basic algebra, trignometry and calculus. After taking the assessment, my boss combed over it and said I did pretty well and hired me on the spot. From there on, I tutored in all math as well as sciences.", "Interview Questions": "Basic Calculus problems and trig problems"}, {"date": "1 Sept 2017", "title": "Senior Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Broward College (Fort Lauderdale, FL) in Sept 2013", "Interview Descriptions": "Great boss, good interview questions.  More concerned with being able to do the job as opposed to remembering facts from a book.  Used practical skills to be demonstrated.", "Interview Questions": "What is a star schema?"}, {"date": "31 May 2013", "title": "\"Responsable de producción, compras y calidad\" Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Broward College (Fort Lauderdale, FL) in Apr 2013", "Interview Descriptions": "The initial phone screening was easy and inviting.  The person setting everything up was very professional although he wasn't able to answer any questions regarding the position.  The actual interview was done via online video conference and a little intimidating because I was on the other end of one of these once and your picture is generally blown up for the iaudience. I kept imagining them staring at my giant head.\r\n\r\nThe position stated that it was a lead analyst position and your job was to analyze data and help the developers create queries and apps that could be applied to the data needs of various groups.  All things I am familiar with doing.  The actual position was for a developer that would be tasked with some analyst work.  The truth is that I have't done any real developing in years.  I applied as an analyst, talked about how I was an analyst but during the interview I kept getting asked these very detailed and esoteric SQL questions.  I was floored by the amount and detail of the questions, I felt like I was back in school taking a test.  Normally I would be able to look anything up that I had forgotten but of course this interview wasn't open notes.  So suffice it to say that I was not called back.  \r\n\r\nIt was upsetting though because I was really flustered during the interview.  It did give me some practice in online interviewing though so I can't complain too much.", "Interview Questions": "I don't remember the exact question but it was a series of 5 or so SQL commands and I was asked to define them, then compare and contrast their functionality.  "}, {"date": "5 Nov 2012", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Broward College (Coconut Creek, FL) in May 2011", "Interview Descriptions": "Had personal recommendation for the job from working as a Teaching Assistant for nearby 4-year university. Interview was mainly a formality– there is high turnover among adjuncts and the college always seems to be looking for new instructors.", "Interview Questions": "Interview was primarily a formality."}, {"date": "27 Sept 2012", "title": "Advisor Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Broward College (Davie, FL) in Sept 2009", "Interview Descriptions": "I went to many of their departments to see who was hiring. I left my resume at the office and was contacted a week later for an interview. I did not really dress up, I was a work study student. The interview was very basic.", "Interview Questions": "What would you do If you get into an argument with an employee. "}]]