[[{"date": "6 Jul 2023", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at North Dakota State University", "Interview Descriptions": "It was as you will expect. Nothing more nothing less just as one can expect. Don’t worry a lot. Go for it. You are as good as any other candidate.", "Interview Questions": "Can you Tell me about yourself"}, {"date": "27 Feb 2021", "title": "Physician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at North Dakota State University", "Interview Descriptions": "great. very friendly staff, the camaraderie was great, down-to-earth people, no reservations, a good place to work for a long time. great salary offer. fellowship placements were great.  asked me about my self, gave a brief description about the hospital", "Interview Questions": "general conversation, why that hospital"}, {"date": "3 Nov 2020", "title": "Associate Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North Dakota State University (Fargo, ND) in Nov 2019", "Interview Descriptions": "General interview questions such as how you would suit in the team, how you contribute to the mission of the center, etc. The interview is generally 1 hour long followed by meeting the team and knowing people you will be going to work with and such.", "Interview Questions": "General interview questions such as how you would suit in the team, how you contribute to the mission of the center, etc."}, {"date": "28 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at North Dakota State University", "Interview Descriptions": "It was very easy and short. Didn't take much time, either. Comfortable. It was very easy and short. Didn't take much time, either. Comfortable. Didn't take much time, either. Comfortable. Didn't take much time, either. Comfortable. Didn't take much time, either. Comfortable.", "Interview Questions": "What are your strengths? What are your strengths? What are your strengths? What are your strengths? What are your strengths? What are your strengths?"}, {"date": "4 Mar 2021", "title": "IT Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at North Dakota State University (Fargo, ND) in Mar 2019", "Interview Descriptions": "Two round interview, one typical behavioral interview, and then another -slightly- technical one. They asked me to troubleshoot the wifi connection on a laptop. They also asked questions about customer service.", "Interview Questions": "Name a time you had a disagreement with a co-worker"}, {"date": "3 Jul 2018", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at North Dakota State University (Fargo, ND) in Mar 2018", "Interview Descriptions": "Started at 7.30am. HR meeting, Meetings, Presentation to Class. Meeting. Luncheon. Research Presentation. Meeting. Official Interview. Dinner. Done by 9pm. Unsuccessful. Found out my selection was vetoed by the Dean and Head of School due to my excellent standing in another university. Quite odd. An odd experience all round.  Think twice about NDSU. Having your time wasted by this \"university\" is not appreciated by any sensible person. Oh, and don't be too good at what you do.. you'll have no hope of getting the job you want.  #questionablehiringpractices", "Interview Questions": "What can you bring to NDSU?"}, {"date": "29 Oct 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at North Dakota State University (Fargo, ND) in Oct 2017", "Interview Descriptions": "Preparing 30 mins Mock Teaching for an undergraduate course. It should include a Q&A session and a discussion session. The audiences should include at least 5 undergraduate students and 2 instructors.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "22 Feb 2018", "title": "Assistant - Concert Facilities Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at North Dakota State University (Fargo, ND) in Jan 2017", "Interview Descriptions": "The hiring process was long. I applied for the job, and waited for a month to hear anything back. Finally heard from one of the people on the hiring committee, and set up a phone interview with the committee. The phone interview went well, and then I waited two weeks to hear back about setting up an in-person interview. It was going to be an all-day interview. I met with the hiring committee, toured the facility, met with students, had lunch with the committee, met with the heads of the department, met with more students, met with a member of HR, met with some other people who this position interacts with, and then met with the hiring committee once more at the end of the day. It was absolutely exhausting. I had to be \"on\" all day. Two of the people on the hiring committee were great, very welcoming, and interested in what I had to say, but I could tell that the rest were not taking me seriously, despite my being very knowledgeable in this field. Yes, I was young, but I knew how to do the job. When I got the rejection call, I asked what I could've done differently. The person in charge of this hiring process told me that I shouldn't have told them that I have anxiety. I was too shell-shocked at that response that it didn't even register until a few weeks later that that is a form of employment discrimination. It was overall a very poor experience, considering that this was a job that I was really excited about the prospect of.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "8 Sept 2020", "title": "Part-time Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at North Dakota State University (Fargo, ND) in Sept 2016", "Interview Descriptions": "Very simple and straightforward, kept in touch the whole way through. Met for first interview, then another with tour, offer made and accepted. I would recommend the job and employer to anyone looking for part time work while attending college. They were super flexible about working with a student schedule.", "Interview Questions": "Do you have experience? "}, {"date": "23 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at North Dakota State University (Mayaguez, PR)", "Interview Descriptions": "I was asked to submit a resume and an essay explaning why I wanted an internship. The interview was not formal, they where friendly and welcoming. Everything was nice, I explained to them what and who I was interested in working with, they told me I did good and a month later I got my acceptance letter.", "Interview Questions": "Who do you want to work with?"}], [{"date": "4 Oct 2016", "title": "IT Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at North Dakota State University (Fargo, ND) in Oct 2014", "Interview Descriptions": "You will have an application process then an one on one interview. They will ask you questions about your technology background and what if situations. They also ask about the hours that you will be able to work for them. Then they will run you through a background check and some more checks before giving you a decision.", "Interview Questions": "What would you do if a computer won't turn on?"}, {"date": "4 Apr 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at North Dakota State University (Fargo, ND) in Aug 2014", "Interview Descriptions": "it was a direct interview with the professor.few questions about the courses like what knowledge do we have about the course and what kind of questions that we might expect form the students,about the courses  I need to grade.need to have the basic knowledge on the courses.", "Interview Questions": "what do you know about functions, mapping between sets,etc?"}, {"date": "15 Jun 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at North Dakota State University (Fargo, ND) in Aug 2014", "Interview Descriptions": "Just like most other interviews except more fun, engaging, and personal. The person conducting the interview asked questions that actually seem to be relevant to the job and work place, as well as help her to understand you as a person. She was very charismatic and friendly which made the interview go more smoothly and relieved my nerves.", "Interview Questions": "What do you want to do with your life, like in the long run?"}, {"date": "12 Jul 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at North Dakota State University", "Interview Descriptions": "For this position, you apply for the position. There is a group interview and an individual interview. Everyone who applies gets to participate in both interviews. Both the hall directors and the current Resident Assistants will be observing the candidates so it's important to act professionally but not feel too pressured.", "Interview Questions": "The most difficult part of the interview is the group interview."}, {"date": "18 Sept 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at North Dakota State University in Jul 2014", "Interview Descriptions": "Application via email. Interview via skype for international students. Otherwise in person meeting. Several employer took interview but in a friendly way. It was kind of conversation using online media.", "Interview Questions": "Do you know how to use this program?"}, {"date": "4 Jun 2014", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at North Dakota State University", "Interview Descriptions": "I never got interviewed as I was a former student at NDSU. I was working in the same lab as a lab assistant before, so every one knew me.", "Interview Questions": "As I never got interviewed, no hard questions."}, {"date": "14 Oct 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at North Dakota State University (Fargo, ND) in Mar 2014", "Interview Descriptions": "1 on 1 interview then group interviews. I don't have much else to say because the interview process was straight forward and most people would not go on here to look for job information for a resident assistant job.", "Interview Questions": "How did you react in an emergency situation you were in?"}, {"date": "23 Oct 2013", "title": "SALES CLERK Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at North Dakota State University", "Interview Descriptions": "A very simple interview process. First, send in your application then you will get a phone call to set up an interview and then, well.... that is about it.", "Interview Questions": "Have you read the employee hand book?"}, {"date": "31 Aug 2013", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at North Dakota State University", "Interview Descriptions": "One interview with search committee of 7 individuals. Each takes turn asking questions and rates candidates, making a recommendation to the Director who has the final decision authority.", "Interview Questions": "What are the seven aspects of wellness."}, {"date": "6 Aug 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North Dakota State University", "Interview Descriptions": "Said the dean of engineering: \"why do you even bother putting that on your resume?\" In reference to applicant's college degree.", "Interview Questions": "That --^ It caught me off guard, because it was surprisingly insulting."}], [{"date": "19 Jun 2017", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at North Dakota State University (Fargo, ND) in Jan 2013", "Interview Descriptions": "I was greeted by the chair of the hiring committee, and she led me into the room where I was to be interviewed.  It was a conference room- style interview with multiple library departments represented.  There were at least seven employees asking me questions.", "Interview Questions": "Why did you choose to apply at North Dakota State University."}, {"date": "4 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at North Dakota State University (Fargo, ND) in Aug 2012", "Interview Descriptions": "the interview process is very simple. You have to find out the position online and meet the minimum qualification.After applications are reviewed by the department, interview is being arranged. The knowledge on previous working or research experience is being evaluated in the interview.", "Interview Questions": "Do you have a story of failure in your life? If yes, Can you share your learning from that experience?"}, {"date": "16 Sept 2013", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at North Dakota State University (Fargo, ND) in Feb 2012", "Interview Descriptions": "I was a grad student at the time and was the only person that applied to this position.  The search committee was my doctoral committee plus a couple of colleagues.  Although I knew I would get the job, they still conducted a very formal interview.  Everyone was very professional but personal.  I really appreciated this.  I have been on 2 search committees for faculty positions and can say this is the norm in my department.  I really like the way we conduct interviews here.", "Interview Questions": "This was my first interview and I didn't know what to expect.  There were not off-the-wall type of questions, but I remember being challenged.  The most annoying question for me is always where do you see yourself in 10 years...."}, {"date": "17 Jul 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at North Dakota State University (Fargo, ND) in Aug 2011", "Interview Descriptions": "The interview was informal in the department chair's office.   We briefly talked about my CV and schedule.  I was asked how many students I would be comfortable teaching at one time. I was asked if I wanted to participate in any committees or other department meetings but was made aware that it was not a requirement.", "Interview Questions": "Do you need an office?  Do you need a computer lab?"}, {"date": "22 Jun 2011", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North Dakota State University (Fargo, ND) in Mar 2011", "Interview Descriptions": "just a phone interview and asked my previous working experiences", "Interview Questions": "what are your weakness?"}, {"date": "15 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at North Dakota State University in Jan 2011", "Interview Descriptions": "Got an email. Applied directly to Adviser. After that apply online to the university. Write cover letter, write resume, write statement of purpose, also submitted Test of English as a Foreign Language or TOEFL score and Graduate Record Examination (GRE) score.", "Interview Questions": "Not much. general technical questions."}, {"date": "30 Apr 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at North Dakota State University (Fargo, ND) in May 2009", "Interview Descriptions": "No interview needed for this position. I got it based on my resume and transcript. I have talked to one of the in a conference and later by phone. They just need to see if you fit or not. If you do not they simply replace you with somebody else.", "Interview Questions": "N/A"}, {"date": "13 Jun 2010", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at North Dakota State University (Fargo, ND) in Mar 2009", "Interview Descriptions": "Interviewed by some incompetent senior scientist. Most questions were very basic and not to my level of education and experience.\r\n\r\nReceived the phone call after two months.", "Interview Questions": "Mostly general and some technical related to my subject."}, {"date": "10 Nov 2009", "title": "Technology Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at North Dakota State University in Aug 2008", "Interview Descriptions": "Had a telephonic 1st round of interview. around 45mins\r\nThe project manager for the position took the interview\r\nQuestions we asked on current and recent projects.\r\nMedium difficulty questions on Java, Syabse and Unix.\r\nCouple of questions on the business related to the position.\r\nQuestions about Goldman and why Goldman\r\nClarity of the position and what interests in the position", "Interview Questions": "N/A"}]]