[[{"date": "30 Jun 2023", "title": "Staff Accountant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bard College (Boston, MA)", "Interview Descriptions": "The interview process for a staff accountant position at Bard College may include an initial screening, followed by multiple rounds of interviews assessing accounting skills, experience, and fit within the organization.", "Interview Questions": "Can you describe a challenging accounting problem you encountered in your previous role and how you approached solving it?"}, {"date": "11 May 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bard College", "Interview Descriptions": "I was contacted by email and scheduled for an interview via Zoom. There were 5 people in the interview and the questions were specific but easy to answer for a qualified candidate. Time was allotted at the end for me to ask them questions. Two of the people in the interview dominated; they were both white. The others did not ask any questions and only answered my questions when asked directly.", "Interview Questions": "How do you design a course that is accessible to all students?"}, {"date": "29 Jan 2022", "title": "Assistant Director, Institutional Advancement Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bard College", "Interview Descriptions": "They scheduled several interviews and were a no-call-no-show. Did this to me three times during the process. Axis Talent Partners was very unprofessional and never followed up despite what I thought was a productive series of interviews.", "Interview Questions": "Had me prepare for interview using STAR method. I prepared for hours to be left hanging."}, {"date": "7 Jul 2021", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bard College", "Interview Descriptions": "Very Respectful HR staff and gave timely responses. Community centered environment. Would recommend interviewing here to others who are interested in working in higher education and living in the Hudson Valley.", "Interview Questions": "Please tell me about yourself?"}, {"date": "29 Apr 2021", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bard College", "Interview Descriptions": "Wonderful! They are very student-centered. They are professional and understand that students of different levels need to be taken care of through restorative practices. I truly enjoyed the interview process which was top notch!", "Interview Questions": "Student-centeredness and teaching style. Also, past experience. "}, {"date": "31 Jan 2021", "title": "Area Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bard College", "Interview Descriptions": "It's a long day. But you get a great sense of who is who and whether you can be a good fit for the community. I felt respected and not as if my time was wasted.", "Interview Questions": "Why Bard? Why do you want to work there."}, {"date": "21 Sept 2021", "title": "Admissions Tour Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Bard College (Annandale on Hudson, NY) in Jan 2019", "Interview Descriptions": "Great interviewing process. Kathy was very friendly and super helpful with any questions I had. She is genuinely intrigued in the interviewee's interest, background, perspective, and personality; therefore, I recommend being as honest and genuine as possible.", "Interview Questions": "What interested you in applying?"}, {"date": "29 Mar 2018", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bard College", "Interview Descriptions": "The interview process was very efficient and polite.  The search committee asked broad questions about my teaching experiences and what made the position appealing. I received an offer from the College in less than 5 weeks, and they kept me posted during that time.", "Interview Questions": "How I saw a temporary position in my overall career plan"}, {"date": "20 Mar 2021", "title": "Peer Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bard College (New York, NY) in Jan 2018", "Interview Descriptions": "Online interview due to Covid, it was a multi step process of group and individual interviews before. They will watch and analyze you. Make sure you show how to work effectively in a team.", "Interview Questions": "How can you manage stress? Will your other responsibilities take away from your job? Why do you want to be a peer counselor? "}, {"date": "8 Mar 2016", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bard College", "Interview Descriptions": "First was a phone interview, then a interview with different departments, this included meeting with various deans, I also met with current students. They looked for my interpersonal skills, and I got to tour the campus. Overall it was a very pleasant experience for which I am grateful for. I also got to have a nice lunch", "Interview Questions": "Leadership style, many situational questions"}], [{"date": "13 May 2015", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bard College (New York, NY) in Feb 2015", "Interview Descriptions": "Phone interview, followed by a longer in-person interview. Very friendly the whole time. They asked me to give a 10 minute long informational presentation on some kind of useful technology, as if I were speaking to faculty or staff.", "Interview Questions": "They asked me to rate my confidence/ability in certain subject areas (AD, File Maker, Windows/Mac imaging, Google Apps, VMware, etc.) on a scale of 1 to 10. "}, {"date": "31 Oct 2015", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Bard College (Annandale on Hudson, NY) in Aug 2013", "Interview Descriptions": "You just have to show up at the help desk in New Henderson Lab and talk to the manager over there. They will ask if you have any experience with computer, and if you have other job on campus. They will hand out an application form and you just have to fill it up and wait for an answer from them. Former employees have priority to come back for every employment cycle.", "Interview Questions": "Do you have experience with computers?\r\nAre you currently holding any on campus job? If so, what are they?\r\nAre you going to study abroad in the future?\r\nWhat year are you graduating?\r\nAre you living on campus?"}, {"date": "6 Mar 2013", "title": "Adminissions Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bard College (Annandale on Hudson, NY)", "Interview Descriptions": "Applied online, received an email, received an in-person interview.  Group interview, several people joining or leaving throughout the course of the interview.", "Interview Questions": "Why should we hire you?  Not because it was unexpected but because it was thrown out very suddenly, after a lot of hemming and hawing and chit-chatting and waiting for the panel to arrive. It was a swift and surprising change of tone.  "}, {"date": "7 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Bard College (Annandale-on-Hudson, NY) in Apr 2012", "Interview Descriptions": "An application for a research position had to be submitted by the end of the academic year in April. My professor then approached me informally after class to ask about my research interests and offered me the position", "Interview Questions": "What skills can you bring to the table?"}]]