[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great mission and team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Jun 2020", "job_title": "Anonymous Employee in São Paulo, São Paulo", "duration": "N/A", "pros": "Mercy For Animals has been growing stronger than ever. Since our current President steeped in she clearly focused on building a team of superstars, improving culture, diversity, and inclusion, and with an amazing strategic mindset providing clear and meaningful direction for the organization. The current leadership embraces kindness and transparency. And team members are positive and all amazing to work with. I feel extremely proud to work for an organization that is driven to cause an impact on ending the greatest cause of suffering on the planet, and at the same time does everything that is possible to provide a healthy workplace and value the team members.", "cons": "I have none to offer at this time."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Dream job", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Feb 2020", "job_title": "Director of Operations in Belo Horizonte, Minas Gerais", "duration": "N/A", "pros": "Great environment, amazing and friendly staff. Mercy For Animals is full of dedicated and collaborative people – which makes work so much more enjoyable. Salary and benefits are good.", "cons": "When you work doing something you love, it's easy to get caught up and suddenly find yourself working long hours in a way that can be unhealthy sometimes."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Feb 2020", "job_title": "Attorney in São Paulo, São Paulo", "duration": "N/A", "pros": "I feel like I can be myself and still be respected at MFA. I can also see  that the leadership is always trying to find ways to improve internal policies and take the organization further.", "cons": "There are internal policies that still need to be improved, but I feel like the leadership is already working on that."}]]