[[{"date": "3 Nov 2021", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AnMed Health", "Interview Descriptions": "Go through HR and then to department manager. Most questions are about hours of work as you have to be flexible about weekends and working 2nd and 3rd shifts and holidays which is normal for a hospital", "Interview Questions": "Why do you want to work at AnMed"}, {"date": "12 May 2021", "title": "Office Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AnMed Health in Feb 2021", "Interview Descriptions": "It was a formal interview with behavioral questions that were asked. It was leadership present with a provider present also. Asked a lot of questions in regards to my background. I was also given a tour of the office and was able to meet some of the employees i would be working with.", "Interview Questions": "What would you do in the first 5 days you were hired ? "}, {"date": "11 Jul 2021", "title": "Patient Care Technician- CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AnMed Health (Anderson, SC) in Jan 2020", "Interview Descriptions": "Interview with Nurse Manager discussing job, hours, my experience/goals/schedule, work environment, etc. followed by an interview with HR, drug test/health screening, and orientation. Hospital is desperate for employees and will hire anyone with a heartbeat", "Interview Questions": "Give me an example of a work conflict and how you solved it"}, {"date": "2 May 2023", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AnMed Health (Anderson, SC) in Jan 2020", "Interview Descriptions": "Straight forward, positive experience. Standard interview questions (Ex. describe a time where you faced conflict in the work place). Interview took place soon after I submitted application, hired soon after that", "Interview Questions": "Describe a situation where you faced conflict in the workplace, what is your biggest weakness.."}, {"date": "28 Dec 2021", "title": "Dialysis Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AnMed Health (Anderson, SC) in Jan 2020", "Interview Descriptions": "Typical Interview, met with HR immediately following the interview. Nurse manager was very kind and personable at interview, taking me on a tour of the unit and answering all of my questions", "Interview Questions": "Give an example of a time you faced conflict with a co-worker, how did you handle it?"}, {"date": "4 Sept 2019", "title": "Business Intelligence Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AnMed Health (Anderson, SC)", "Interview Descriptions": "Great, easy interview process, very kind people at AnMEd. Process was not too time consuming like other Organizations. Very pleased with the way the interview was conducted and the ease of the process.", "Interview Questions": "What experience do you have using Epic?"}, {"date": "31 Jan 2019", "title": "Emergency Management Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AnMed Health (Anderson, SC) in Jan 2019", "Interview Descriptions": "The interview was very laid back and relaxed. It was more of getting to know each other and just talking. Would have liked if the process could have moved quicker. But overall a good experience.", "Interview Questions": "Are you okay with communicating with multiple levels of employees?"}, {"date": "31 Dec 2018", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AnMed Health (Anderson, SC)", "Interview Descriptions": "job applied and job offered hours differed The  Supervisor was nice. first met with HR then was sent to meet the security supervisor and his second in command. They asked alot of questions but were vague with theirs answers if they were asked any.", "Interview Questions": "do you have any experience?"}, {"date": "14 Mar 2017", "title": "Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AnMed Health", "Interview Descriptions": "Very discriminatory hiring process. Interview was wonderful and department all but verbally offered the job, but then weeks later strings were pulled for another candidate and I lost my opportunity.", "Interview Questions": "What are your biggest strengths/weaknesses? "}, {"date": "20 Jul 2017", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AnMed Health (Anderson, SC) in Jan 2017", "Interview Descriptions": "Very professional, yet informative.  The manager was helpful explaining the hiring process and what to expect in the upcoming days.  I interviewed through human resources, the department management and then was offered the job the following week.", "Interview Questions": "Why AnMed?"}], [{"date": "5 May 2016", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AnMed Health", "Interview Descriptions": "only asked why I want to work at patient transporter walked around hospital with supervisor and co-workers, they showed you what they do during the day and answered questions, discussed what you do during the and work schedule,", "Interview Questions": "why do you want to work as patient trasporter"}, {"date": "21 Aug 2015", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AnMed Health in Jul 2015", "Interview Descriptions": "The interview process for informal. I was brought into the Case Management Director's office for a 30 minute interview session. The interview felt very personal and I had an opportunity to open up about my past experiences working with individual with disabilities. I was able to learn more about the director and what strategies she personally brings daily to working at Health South.", "Interview Questions": "Q: How would you diffuse an argument amongst family members if the members disagreed about the treatment plan?\r\n\r\nQ: How would you handle a patient with a mental illness that was acting erratic? \r\n\r\nQ: How do you respond under pressure?"}, {"date": "13 May 2015", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AnMed Health", "Interview Descriptions": "This was the easiest interview I had ever been on. I was asked basic interview questions, mostly questions I had already answered on the online application. I was finished the interview in less than thirty minutes. I really just spent time talking about myself, based on many of the personal questions I was asked. I honestly believe the decision was made to hire me, before the interview because of my previous experience.", "Interview Questions": "what was the most challenging thing on previous job"}, {"date": "14 Sept 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AnMed Health in Mar 2015", "Interview Descriptions": "You have to submit your resume and application online including all of your certifications and credentials.  It is very important to put that you are BLS certified.  The interview consists of an HR background check, drug screen, lab work, and physical test.  The interview with the unit is scheduled after your resume has been reviewed and you pass all other requirements.  This interview is a group interview in which the nurses, doctors, and nurse managers all interview you together.  You are chosen based on whether the team thinks you are a good fit for them .", "Interview Questions": "When have you had to deal with conflict?"}, {"date": "30 May 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at AnMed Health (Anderson, SC) in Nov 2012", "Interview Descriptions": "Applied online, received call from HR Representative. Interview set with HR for paperwork, and the met with Nurse Manager of the unit that I applied for. \r\n\r\nAbout 10 minutes with Nurse Manager, and then peer interview with two RN's from the unit, one of whom was the Charge Nurse (but I was unaware of that at the time). \r\n\r\nThe same day, I also interviewed with a Nurse Manager of another unit for which I also applied. Interview was similar except I had no peer interview. I only talked with the Manager and then toured the unit.", "Interview Questions": "Why did you want to be a nurse?"}, {"date": "31 Dec 2015", "title": "PCT2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at AnMed Health (Anderson, SC) in Jan 2011", "Interview Descriptions": "Phone interview, face to face interview with human resources, then face to face with the nurse manager that introduced me to other employees on the unit, tour of the unit", "Interview Questions": "What are your future plans?"}]]