[[{"date": "3 May 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Carbon Community College", "Interview Descriptions": "My interview at Lehigh Carbon Community College  was Manageable- it was the typical sequence of interviews- phone interview and then in person interview. You should prepare like you would for any other traditional interview.", "Interview Questions": "What are you strengths that you will bring"}, {"date": "23 Oct 2020", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lehigh Carbon Community College", "Interview Descriptions": "Very thorough interview process. Everyone was very professional and the questions were fair and ranged from content specific to teaching philosophy. The process was pretty straight forward and the team is very responsive.", "Interview Questions": "If I had any previous experience"}, {"date": "23 Feb 2022", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Carbon Community College (Schnecksville, PA) in Sept 2020", "Interview Descriptions": "Asked simple and to the point questions regarding security standards. Also gave a great, descriptive overview of the departmental functions and day to day activities. Hiring supervisors are very easy to talk to and are very insightful.", "Interview Questions": "Are you a good listener?"}, {"date": "18 Jan 2021", "title": "Library Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Lehigh Carbon Community College (Allentown, PA) in Sept 2020", "Interview Descriptions": "Applied online at internal web. Director call me directly and schedule an on site interview. The process is very easy as my major and I have some certificate. Give offer after the interview. Notice the HR next day. I finished background check after 2 weeks. However I didn't accept this job as covid 19.", "Interview Questions": "What is your major?\nDo you have any experience before?"}, {"date": "2 May 2019", "title": "Assistant Director of Technology Infrastructure Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lehigh Carbon Community College (Schnecksville, PA) in Dec 2018", "Interview Descriptions": "Human Resources called me to schedule an interview with the Director of Technology Infrastructure.  When I arrived, there were three people in the Interview.  I was interviewed for about an hour.", "Interview Questions": "The first question was very strange. How to you feel about sarcasm?"}, {"date": "3 Oct 2017", "title": "Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Lehigh Carbon Community College (Schnecksville, PA)", "Interview Descriptions": "Applied, and did not hear a word until one month later. They were surprisingly inflexible in scheduling an interview time, though I work full-time and had to rearrange my schedule. Relatively lengthy skills test and in-person interview with two key decision makers. The interview was very formal and stiff, though professional. No time to really converse or even clarify or ask questions. Simply asked questions one after another with no feedback. After initial contact and follow-up, I was never contacted, even with a boilerplate rejection note. I thought that was highly unprofessional. LCCC has a reputation for being an innovative campus, but their recruiting and interview process seems to be stuck in a former decade.", "Interview Questions": "N/A"}, {"date": "26 Apr 2017", "title": "Marketing and Public Relations Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Lehigh Carbon Community College in Oct 2016", "Interview Descriptions": "Initial interview was via Skype, and with a group of 5 of the top decision makers. Initial interview posed several challenging questions, and kept me on my toes. I was brought in for a follow up interview that was held on campus with the same individuals who I interviewed with previously. Second interview was quite lengthy, taking about 4 hours in total. Began with a written examination (crafting a press release) for 40 mins. Next I met with the group for a conference room interview for an hour with many additional challenging questions. After the group interview, I had a sit down meeting with the President of the college, and finally a campus tour concluded the session. The totality of the interview process was extremely lengthy - I began the interview process in late October, interviewed in person in November, and finally received notice that I was not selected for the position in late December/early January.", "Interview Questions": "President asked \"what does leadership mean to you?\""}, {"date": "24 Apr 2014", "title": "Instructor of Mathematics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Lehigh Carbon Community College (Schnecksville, PA)", "Interview Descriptions": "Resumes were due to the Office of HR in February 2002. Search Committee soon after set up face-to-face interviews, about 30 minutes. From there, the candidate pool was narrowed down to 5 candidates who all did teaching demonstrations. Final recommendations were made by early May for an August 22 start date. In this process, paperwork with HR was done seamlessly and no details were missed.", "Interview Questions": "I cannot recall a question that was particularly difficult or unexpected. "}, {"date": "30 Apr 2014", "title": "Office of College Relations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Lehigh Carbon Community College (Schnecksville, PA) in Dec 2013", "Interview Descriptions": "After applying for the internship via email, I received a phone interview and then established a date for a face-to-face interview. The face-to-face interview was a group interview, between the director and his constituents and myself. It was very relaxed, but formal.", "Interview Questions": "To avoid difficult or unexpected questions, you should be well prepared for the interview, especially for questions that will give insight as to who you are outside of the workplace."}, {"date": "23 Oct 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Lehigh Carbon Community College (Schnecksville, PA) in Apr 2012", "Interview Descriptions": "It was a very thorough and investigative interview, however the questions asked were very appropriate and typical. It would be very beneficial to make sure you are prepared for the interview and know what position you are applying for, know the job duties and skills that the job is asking for and make sure you can verify that you have done those things in the past and provide examples. They will ask the typical, What made you want the job and what are you goals, etc.", "Interview Questions": "They asked what made you qualified for the position?"}]]