[[{"date": "19 May 2023", "title": "Food Security and Livelihoods Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechnoServe (Harare)", "Interview Descriptions": "Average experience. I was asked a whole set of questions that were not difficult to answer. However i feel that the interviewing panel was a bit overcrowded. Some of the panel asked irrelevant questions in relation to the job description.", "Interview Questions": "Tell us about yourself and working history, highlighting achievements."}, {"date": "21 Apr 2023", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechnoServe", "Interview Descriptions": "Comfortable, conversation like and easy to deal with. Mostly background is understood and role and organization is explained. Patient and easy- going conversation that helps you bring out your best . They are trying to understand your motivation to get in and how does it make sense for them to take you on.", "Interview Questions": "What is your educational background What is your professional background What do you know about technoserve Why do you want to join Will you be comfortable with the role"}, {"date": "24 Aug 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at TechnoServe", "Interview Descriptions": "First, I had a screening call with a recruiter covering typical questions. I moved on to the first round, which was by video interview with 3 people. The questions covered hypothetical scenarios, background in M&E and project planning, career goals, and details about the role. Minimal questions on technical skills or projects - focused more on international development impact and monitoring context.", "Interview Questions": "Which of the following do you consider your strength: project planning,  project implementation, or project monitoring? "}, {"date": "6 Oct 2022", "title": "HR Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at TechnoServe in Aug 2022", "Interview Descriptions": "I saw the job being posted, and I applied. Then I was shortlisted for the written and online aptitude tests and interviewed by two panelists. But they did not meet salary expectations. Hence declined the offer", "Interview Questions": "From your perspective, having managed HR both in NGO and private sector spheres, what are the biggest challenges/needs/gaps in Talent Management that most employers face? What initiatives have you developed to respond to the challenges"}, {"date": "9 Jun 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechnoServe", "Interview Descriptions": "First they asked about myself then they asked about my interests and a little about my education. For sometime they asked about my Graduation subject and then they asked my current experience and also about my master's subject. Then they gave a situation based question and asked what would i do", "Interview Questions": "They asked about current experience and also a situational question "}, {"date": "14 Mar 2022", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TechnoServe in Feb 2022", "Interview Descriptions": "The process was smooth overall, with an initial phone call with the recruiter, then a writing test and a virtual panel interview. That said, the panel interview was rather intimidating and awkward given the virtual setting.", "Interview Questions": "Questions varied between experience with SEO and online content management to interests and connections to global issues. "}, {"date": "17 Jan 2022", "title": "Regional Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at TechnoServe (New York, NY)", "Interview Descriptions": "Tuve cuatro entrevistas, la primera fue para tener una idea sobre mi nivel de ingles y mi experiencia, ka segunda fue con la directora de finanzas internacional y fue para saber mi experiencia técnica en todos los temas financieros, tuve dos  entrevistas en persona en Washington DC, con 3l CFO y otra con la Directora de Personal.  La organización tiene una cultura muy amigable, colaborativo,  esta en continuo desarrollo de los sistemas y el uso de NAV en todas sus capacidades, pero en busca de su estructura optima la cual esta por definir.", "Interview Questions": "Cuantos paises has supervisado como analista financiero"}, {"date": "8 Mar 2022", "title": "Strategic Initiatives Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at TechnoServe in Jan 2022", "Interview Descriptions": "The internship interview process was poorly organized. Instead of using TechnoServe's HR department, the team had a team member organize the process--which led to non-responses to emails, emails on the weekend, etc. \r\n\r\nThe internship (which pays minimum wage) consisted of  2 case questions--and very little time was spent on behavioral questions, such as \"Why do you want this position?\". Instead, for an internship which was marketed as an \"entry point for international development\" and the main job tasks were to be research, a quantitative and qualitative case were conducted. This felt like overkill, especially given the low pay and job description. (All of this was for an explicitly first round interview). \r\n\r\nAfter the interview, they ghosted me. My advice to TechnoServe is that all interview processes need to be coordinated through HR so that all interview processes are conducted in professional manners.", "Interview Questions": "What experience do you have figuring things out on your own? "}, {"date": "15 Nov 2021", "title": "Volunteer Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at TechnoServe", "Interview Descriptions": "I had a phone interview with the hiring manager. Casual chat about the role followed by specific questions about my work ex. Also had a chat with the recruiting coordinator for volunteers about the process", "Interview Questions": "Walk me through your work ex."}, {"date": "5 May 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechnoServe", "Interview Descriptions": "Interview was to happen at 11.  They kept as waiting as they didn't seem like they were expecting the candidates. \nAnyway after one hour, they print out the papers and it seems they pulled out questions from a CPA exam.\nOverall, they didn't seem to know what they wanted", "Interview Questions": "It was a written exam "}], [{"date": "29 Apr 2021", "title": "Strategy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechnoServe", "Interview Descriptions": "Initial 30-minute screen by HR followed by interview by a 1-hr interview with someone working at the same level.  Was not interviewed by the actual supervisor for the role.  Presumably this would have happened in a later round.", "Interview Questions": "Basic case study relevant to their work"}, {"date": "21 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at TechnoServe (San Francisco, CA) in May 2021", "Interview Descriptions": "One casual Interview with the Hiring Manager to discuss my background and prior experience, the role, the goals for the project and my expectations. \n\nI ended up working on a pretty high impact project", "Interview Questions": "Do you have experience with x technology?\nAre you comfortable with learning x technology?"}, {"date": "22 Feb 2021", "title": "PSE Officer and Alliance Builder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at TechnoServe", "Interview Descriptions": "The process moved quickly and was not clearly defined.  The screening interview was fairly easy, the second interview involved technical questions and the third included questions that were more specific.", "Interview Questions": "What would you do in a situation where a stakeholder or partner requested an unfair advantage? "}, {"date": "17 Jan 2021", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechnoServe (Lagos)", "Interview Descriptions": "3 levels. Basic one with HR person, Second with Senior and Regional Managers, 3rd with Country Director. Process took 2 months and was quite organized in the beginning but later turned unprofessional. Told the salary expectation at the 1st contact. Wasted my time by making me go through all 3 levels of interview only to be offered a ridiculously small salary for the role", "Interview Questions": "3 innovations in Agriculture, Discuss some Agricultural Value Chains and Issues surrounding them"}, {"date": "22 Sept 2020", "title": "Talent Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechnoServe", "Interview Descriptions": "Rushed, a bit formulaic. The recruiter was more focused on providing background around position without enough knowledge to provide a background on position specifics such as; direct reports, whether it was a new or existing position and scope of responsibilities.", "Interview Questions": "Why Technoserve?\nWhat do you know about us?"}, {"date": "8 Feb 2021", "title": "Program Management Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at TechnoServe in Jan 2020", "Interview Descriptions": "It was a very straightforward interview process. We had 1 Case study, 1 Excel round, 1 writing skill round and then 2 rounds of Personal Interview.  The personal interviews can be directed based on your strengths but it strong Excel skills is a must to crack this firm.", "Interview Questions": "Main reforms that are needed in the agriculture sector"}, {"date": "22 Feb 2022", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at TechnoServe in Nov 2019", "Interview Descriptions": "Inefficient and incompetent Interviewers. Too many rounds. They could accomplish Interview goals in the first round. But took multiple rounds to basically tell me I wasn't fit for the position", "Interview Questions": "How much compensation I expect"}, {"date": "27 Sept 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at TechnoServe (Lagos) in Sept 2019", "Interview Descriptions": "Straight forward  and well organized process\r\nTimely , was not a lengthy process \r\nPolite and Friendly environment \r\nInitial phone call to schedule interview\r\nTwo stages of interviews \r\nOne panel interview style", "Interview Questions": "Relevant experience to the role "}, {"date": "9 Jul 2019", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at TechnoServe", "Interview Descriptions": "It was a month-long process involving two rounds of interview and an HR round. One needs to be passionate about working in the social sector and thorough with the resume.", "Interview Questions": "They generally ask for a write-up"}, {"date": "11 Mar 2019", "title": "Sr Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at TechnoServe (Mumbai) in Mar 2019", "Interview Descriptions": "Fast, very specific points asked, 3 rounds were taken. They explained the expectation from the position very clearly and also discussed all earlier activities & achievements to understand the fitment. It was conducted through telephonic and video calls.", "Interview Questions": "Tell about yourself."}], [{"date": "10 Mar 2021", "title": "Project Management Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at TechnoServe (Sonipat) in Jan 2019", "Interview Descriptions": "The interview process was two rounds. A written round and a personal interview round. The inteview was smooth and there are mostly personal questions around you and your values.", "Interview Questions": "1. Why do you want to join us and how do you think you can contribute? "}, {"date": "11 Apr 2020", "title": "Financial Controller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TechnoServe (São Paulo, São Paulo) in Dec 2018", "Interview Descriptions": "Foi um processo seletivo digital, sempre contando com a diretoria em todas as etapas. No geral o processo seletivo foi relativamente rápido e fluiu sem maiores complicações. Questões técnicas foram abordadas no final da entrevista e não foram difíceis.", "Interview Questions": "Que experiência vc tem com contabilidade?"}, {"date": "20 Jul 2020", "title": "Financial Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TechnoServe (Kano, Kano) in Mar 2018", "Interview Descriptions": "The interview is usually easy comprising of written and oral test, you only could need to prepare the usual way you could prepare for an interview. There are 6 questions for the written test and then a followup 1:1 interview with a panel of 2-4,5 persons.", "Interview Questions": "How you minimized errors as an Accountant?"}, {"date": "10 Jan 2022", "title": "Business Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at TechnoServe in Jan 2018", "Interview Descriptions": "CV screening , experience scanning, achievements and results, educational background access, oral face to face discussions, personal confidence and computer skills of the candidates addressed. Some time presentation also programmed", "Interview Questions": "Why business plan important for an organization?"}, {"date": "19 Oct 2018", "title": "Monitoring and Evaluation Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at TechnoServe (Kampala) in Mar 2017", "Interview Descriptions": "Process took 2 weeks, After the interview they called me that I had passed then after some time they told me there was a technical problem. Only to find out the Job was given to some one else who did not even do the interview but was related to one of the managers..", "Interview Questions": "Tell us about yourself"}, {"date": "20 Apr 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at TechnoServe (New Delhi) in Jan 2017", "Interview Descriptions": "Interview process was long and interactive session on telephone. It took too much long time and three to four round inter view ,phone screening done by HR team too many times and then thematic interview was taken after 15 days.\r\nQuestion was related to subject ,project management, work style and project background", "Interview Questions": "Tell me about your current job and your work "}, {"date": "18 Jan 2017", "title": "Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at TechnoServe (Nairobi) in Sept 2016", "Interview Descriptions": "Was very detailed and there was aptitude test then there was  the oral test which was very vigorous.They were really interested in my personality traits and what i had achieved with my experience.", "Interview Questions": "why i wanted to be employed by them."}, {"date": "12 Mar 2014", "title": "Volunteer Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 3 months. I interviewed at TechnoServe (Mumbai)", "Interview Descriptions": "Reached out to the India team through mutual friends. It was really networking based. I was directly interviewed by the India managers and then referred to the US for a final sanity-check.", "Interview Questions": "Nothing too difficult. They were just interested in learning more about my background."}, {"date": "10 Sept 2013", "title": "Program Manager, Nigeria - Propcom Maikarfi (DfID Funded Programmer) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at TechnoServe (Abuja, Federal Capital Territory)", "Interview Descriptions": "Applied by sending my CV to a program director - advert was found online through a job board. \r\n\r\nI was then contacted by a program director who interviewed me a week later, then a written test testing market sector analysis and agribusiness sector knowledge, this was followed by another interview by a Business Development Manager - West Africa and the next interview by the Regional Director - Africa.\r\n\r\nThis was then followed by salary & reference checking from both two previous employers and my current employer. Reference checks were fine. At this point, I was then made to interview with the implementing partner for the project which was GRM International purportedly the final interview.", "Interview Questions": "Why I would want to consider moving to the non-profit sector ? Why leaving my current start up business? An example of a market sector analysis I carried out and was I the one that introduced the business to my company?"}, {"date": "31 Aug 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at TechnoServe (Lima, Lima Region) in Sept 2011", "Interview Descriptions": "It was a very normal interview with standard questions. The people where very friendly and the process was very clear. First I talked to the project manager who asked the typical interview questions. Finally I talked with the big boss who asked technical questions and why was I interested on working for this organization.", "Interview Questions": "1. Tell me about yourself?\r\n\r\n2. What are your biggest strengths?\r\n\r\n3. Why did you leave your last job?\r\n\r\n4. What are your career goals?\r\n\r\n5. Why do you want to work here?\r\n\r\n6. What is your greatest weakness?\r\n\r\n7. What do co-workers say about you?\r\n\r\n8. Are you applying for other jobs?\r\n\r\n9. What do you know about our organization?\r\n\r\n10. What kind of salary are you looking for?\r\n"}], [{"date": "14 Apr 2015", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at TechnoServe (Addis Ababa) in Aug 2011", "Interview Descriptions": "The hiring process is so long you will take written examination first after that they will call for interview unfortunately I was interviewed two times. After selection they notify their offer and you will discuss on that", "Interview Questions": "As a senior accountant what would we expect from you?"}]]