[[{"date": "20 May 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Enveritas", "Interview Descriptions": "Amazing! Best people I've met in a long time. Hard but worth it. Wish I had gotten the job. Initial interview then two separate technical interviews then an interview with the COO and CFO.", "Interview Questions": "N/A"}, {"date": "10 May 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Enveritas", "Interview Descriptions": "-No recruiting staff involved.\r\n-First Google Meeting with video off with a technical project lead individual, similar to a phone interview but technically focused.\r\n-Turn in a technical solution on a schedule. High time commitments but accommodating to schedule changes.\r\n-Google meeting with two data team employees with video on. More personal interaction though still exclusively technically focused questions. This was a good opportunity to get a sense of the teams and culture internally.\r\n-Turn in a second technical problem assessment on a schedule.\r\n-Google meeting with video on with two employees who you would report through/up to. Most of this meeting I was listening not talking. The highest ranking person spoke very little and listened in on the call, so I had sense of their impression of anything that was said. The main interviewer rephrased my words with a critical manner, not quite for understanding or interpersonal reasons. It was a surprisingly cold interaction with a candidate they kept along in their process for so long.\r\n\r\nOverall high time investment with low human feedback. Seems like a company with potential where people enjoy their work though.", "Interview Questions": "Complete a technical solution to their specific business problem.\r\nComplete a second technical solution to their specific business problems."}, {"date": "30 May 2022", "title": "Quality Control Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Enveritas (Guatemala) in May 2022", "Interview Descriptions": "Interview 1: About the company and the position. This is an interview to see how well your experience matches the position.\r\nInterview 2: Case Submission and Presentation and Other Case. I never advanced because they never sent me the case or the dates for the presentation of the case. The company let the process drift with me, I contacted them, but they just gave me excuses.", "Interview Questions": "What do you know about the organization?\r\nTell us about yourself\r\nWhy do you want to work here\r\nAvailability of time\r\nPrevious functions are similar to the functions of the current position"}, {"date": "25 Jun 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Enveritas (New York, NY) in Jun 2021", "Interview Descriptions": "I only had an initial interview.  It was very conversational and just getting to know you and why you're interested in Enveritas.  I did not have the experience they were looking for and so did not move on in the process.  They respectfully informed me of this within 24 hours.", "Interview Questions": "Why do you want to work for Enveritas?"}, {"date": "28 Jun 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Enveritas (Lafayette, CO) in Apr 2021", "Interview Descriptions": "Carefully designed hiring process with hiring manager interview first, small tech assessment, interview with teammates and execs. The entire process was very well delineated and communicated, and all through video conferencing since that offers the best quality of communication. Unique was how interviews were setup to be two-sided and not one-sided, there was not just a clear understanding that the candidate was interviewing the company but a practical approach to ensuring this was the case.", "Interview Questions": "For the tech interview, instead of asking you to code in real time, they offer some code to look at, possibly run, and ask you questions about it, to see how you reason through a solution. All other questions are equally well thought out, they're about the job not about silly interview questions.\n\n\n"}], [], [], [], [], []]