[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Love my department", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jan 2022", "job_title": "Junior Accountant in Lexington-Fayette, KY", "duration": "N/A", "pros": "Learn new skills all the time\r\nGreat co-workers", "cons": "Lack of Good communication with all departments"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good and bad", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Apr 2023", "job_title": "Revenue Cycle Manager in Lexington, KY", "duration": "N/A", "pros": "Flexible work from home and hours, autonomy to make some decisions.", "cons": "No real change in salary for 6 years and nothing ever changes for the positive"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Dec 2021", "job_title": "Customer Service Representative in Lexington, KY", "duration": "N/A", "pros": "Yearly Reviews. Great benefits. Professional environment. On the job training. Decent wages. The ability to work from home. Great schedule. Weekends off", "cons": "No over time. High Pressure environment. Strict call metrics."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Bullies", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Sept 2021", "job_title": "Specialist in Lexington, KY", "duration": "N/A", "pros": "Pay co-workers benefits work-space security", "cons": "Bullies clique-ish powertrips management upper management"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Beware of this place", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Mar 2016", "job_title": "A/R Insurance Follow Up in Lexington-Fayette, KY", "duration": "N/A", "pros": "Benefits are pretty good but insurance is high and not very good plans.", "cons": "Horrible working environment and extremely high stress due to nearly impossible to meet production and quality expectations.  New computer software that was supposed to be the companies saving grace but doesn't work properly and making everything worse.  We're so behind there is exhausting mandatory overtime.  The above review is correct. People here including supervisors are backstabbing and will talk bad about you to your coworkers. Very unprofessional.  New top management bringing in people they know from previous company they worked at for positions without posting the job so that current employees can apply.  Good people who were passed over due to this are leaving.  Also, they are firing people who have worked here for many years for any slight infraction and bringing in temps and hiring new people to pay them less.  Many people either quitting or getting fired and we keep getting further and further behind because the people who new what they were doing aren't here anymore!  Very hostile working environment.  The stress everyone is under is palatable."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A little good with lots of not so good!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Jan 2016", "job_title": "Anonymous Employee in Lexington-Fayette, KY", "duration": "N/A", "pros": "Insurance is great! The people working in production are fantastic! Free parking.", "cons": "Recently went through a management change at rhe top. New person seems nice but has no issue cutting loyal and valuable people which has always been a company practice. No training offered to further your career. Rarely raises. Everything you do is put under a microscope because of the environment of mistrust that runs throughout the company. Be careful who you make friends with because some of the \"old guard\" will throw you under the bus without a second thought. Not a place built to invest your life into and retire from. Definitely a stepping stone opportunity at best!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not worth the stress", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Jan 2017", "job_title": "Anonymous Employee in Lexington-Fayette, KY", "duration": "N/A", "pros": "Biweekly Pay. Good healthcare benefits... I have nothing else nice to say about this place. Just don't waste your time", "cons": "It's unnecessarily stressful. The manager has no true background in management. So, she continues asks inappropriate questions and is not knowledgeable about real HIPAA facts. The only reason I got her to stop harassing me before I finally left was that I would only communicate with her via email. So that I'd have a paper trail and continuously reported her to HR. Her excuse for getting caught was that she is never aware that she said something inappropriate. She spends endless hours trying to color code her calendars and less time with actually doing her job. The only thing I was able to come up with as to why she continues to have that job. Is that she must be a scape goat if things ever get bad and HR needs somebody to fire. She's extremely inconsiderate and uses her weekly meetings with staff to discuss her personal information. DO NOT WORK HERE. Once you work there you are NEVER given an opportunity to transfer to a different dept"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "If you like the military....", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "17 May 2014", "job_title": "A/R Insurance Follow Up in Lexington-Fayette, KY", "duration": "N/A", "pros": "10% contribution to 401k. Nice building. Ample parking. Free dental insurance.", "cons": "There are many which causes bad moral. Micro management to extreme.  They treat everyone like children and with no respect.  If one person breaks a rule entire departments are punished and/or scolded instead of just addressing it with the offender. \n\nThere are very strict rules from dress code to your work space. You can't have anything hanging on your cubical walls and no family photos unless framed and sitting on your desk. No nic knacks on desk. Can't wear even dress slacks if they have a patch pocket. No shoes with any sort of strap between toes. No tattoos that show. No \"jeans style\" pants and no denim period.  No capris if they have strings or patch pockets. No tshirts or tshirt type tops. No screen printed tops. The list goes on....\n\nYou are questioned if you get up from your desk to get a drink. No talking to your coworkers except at break/lunch. No cell phones visible in the entire building. No eating at your desk except for non prepared finger food that has no odors. Taking up contributions to help coworkers or selling things like school fundraisers are allowed. No smoking on property. \n\nCommunication which is normally an important part of an organization is discouraged and in most cases forbidden. If you have a question for someone in another department you must email your supervisor and he must contact that department for you usually two weeks later when he gets around to reading your email. \n\nThey have people who audit your work 3 times a year who do not even work in the departments they audit and do not keep up with changes and do not know as much about the job as the people they are judging. These audits must be passed or you will be terminated and it effects your pay. \n\nThe pay is subpar. If there are raises at all they are small % across the board. No raises based on above average work. Don't accept a position at a lower wage than you deserve and expect to get more for doing a great job because that doesn't happen. You'll get your 2% just like the worker who can never seem to get her work done."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Evil Empire-Retaliation REQUIRED", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2020", "job_title": "AR Follow Up in Lexington-Fayette, KY", "duration": "N/A", "pros": "Benefits and that is all.", "cons": "Retaliation against employees is rampant. They ask for input and suggestions, then they use them against you. You can't do enough for this company. They micromanage to the point you can't work. They tell you they have your back then they throw you under the bus. If you love stress, uncertainty, supervisors that make fun of employee struggles with other management, punitive policies-you'll love this company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A great Company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Feb 2019", "job_title": "AR Follow-up in Lexington-Fayette, KY", "duration": "N/A", "pros": "Great Benefits and ay scale. Great training. Some great management.", "cons": "Micromanages, Look to catch people not doing their jobs, if one person does something wrong everyone suffers"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Stay away from this place!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Apr 2017", "job_title": "Claims/Customer Service Representative in Lexington-Fayette, KY", "duration": "N/A", "pros": "Parking, really cannot think of anything else.", "cons": "Bullying by management and employees, extreme favoritism, backstabbing"}]]