[[{"date": "24 Jun 2021", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Adelphoi Village", "Interview Descriptions": "Not bad, easy questions, very little confusion on the interviewing process. Fast response time when responding to emails. A good description of the meeting place. Very little stress in interviews, nice people, and very realistic.", "Interview Questions": "Q. what have you learned from previous jobs"}, {"date": "30 Jul 2018", "title": "Substitute Teacher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Adelphoi Village", "Interview Descriptions": "Little bit frustrating. The entire process took about 1 month from applying to actually working.  Needed clearances, urine test and group interview until you are actually hired. They do provide training before actually teaching.", "Interview Questions": "Q: What king of experience do you have as a teacher?"}, {"date": "7 Sept 2015", "title": "MST Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Adelphoi Village (Greensburg, PA) in Aug 2015", "Interview Descriptions": "I applied online, recieved a phone call about 4 days later, brief phone interview, scheduled appointment for three days later. Interviewed with direct supervisor and Project Director. After interview I had a phone interview with the Clinical Director. I was called a few days later and offered the position. All aspects of the interview process was smooth and seamless. The interviewers were very positive and complimentary to my skill-set. Intervew was strength based and friendly.", "Interview Questions": "What was my understanding of evidence based models of therapy.  My feelings about delivering services in families homes. My confidence to ameliorate stressful situations."}, {"date": "28 Jul 2015", "title": "School Based Mental Health Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adelphoi Village in Jun 2015", "Interview Descriptions": "The interview process was smooth and professional. I initally received a phone call and scheduled an interview two weeks later. The entire interview lasted approximately 40 minutes. I was interviewed by two people who took turns asking questions and speaking with me. I got a chance to ask my own questions towards the end of the interview.", "Interview Questions": "Describe a challening situation involving a student that you had to deal with. \r\n\r\nWhere do you see yourself professionally in 5 years?\r\n\r\nWhy did you apply for this position?"}, {"date": "27 Dec 2014", "title": "Records Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adelphoi Village in Dec 2014", "Interview Descriptions": "I received a phone call from a very kind (but very chatty) gentleman in HR to schedule an interview a few weeks after I had faxed in my resume. I was emailed the wrong address for the interview which was pretty irritating considering the location was a complex of buildings which all seemed to be locked. Once I found the correct building I interviewed with 2 people. They seemed nice and didn't ask any ridiculous questions. The interview itself was quick and easy but I never received a call back.", "Interview Questions": "What was your biggest accomplishment in your current position?"}, {"date": "3 Apr 2017", "title": "Youth Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Adelphoi Village (Hollidaysburg, PA) in Apr 2014", "Interview Descriptions": "I submitted my resume, was called a day later, and an interview was set up. I interviewed with two supervisors, and they called me a couple of days later to offer me the job.", "Interview Questions": "How are you with working with a diverse community of kids?"}, {"date": "14 Jul 2015", "title": "MST Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Adelphoi Village (Pittsburgh, PA) in Mar 2014", "Interview Descriptions": "Interview with director and direct supervisor.  2nd interview by phone with MST Consultant. Interview lasted about 1 hour, in person and 1/2 by phone.  Was casual and friendly.", "Interview Questions": "Role played various scenarios that can happen during therapy session"}, {"date": "27 May 2013", "title": "Counselor of Young Adults Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adelphoi Village (Latrobe, PA) in Mar 2013", "Interview Descriptions": "I initiatiated the interview as a request to be hired! I had a idea of the questions to be asked and had documentation to substantuate my answers! I had one interview! I tried to be as frank and as open as posible in answering the questions asked! The perception I had as of the people in the office were that they were professionals but they had a strict budget to comply with!", "Interview Questions": "I was asked to be flexable as to my request for employment! I applied for a position as counselor! The job describtion was for someone to watch the children in a dormitory setting 11:00pm to 7:00am! I felt decieved by the whole application/interview process!"}, {"date": "25 Dec 2011", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Adelphoi Village (Latrobe, PA) in Jun 2011", "Interview Descriptions": "30 minute interview", "Interview Questions": "How would you deal with a crisis?"}, {"date": "8 Sept 2009", "title": "Clinical Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Adelphoi Village in Jan 2007", "Interview Descriptions": "Ient resume by mail and received a call for interview within two weeks. Had one face-to-face interview and was offered the position within one week. Salary was presented as non-negotiable. The interviewer appeared to be looking for a positive attitude and a willingness to follow rules.", "Interview Questions": "Why are you looking to leave your current job?"}]]