[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Contractor", "job_date": "10 Jan 2022", "job_title": "Researcher in Graz", "duration": "N/A", "pros": "Helpful\r\nGood working hours\r\nFriendly\r\nFun to work\r\nOrganized", "cons": "Boring at times\r\nnot vibrant\r\nNot enough events\r\nNot social\r\nnot enough food options"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good for Career Start", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 May 2023", "job_title": "Studentische Mitarbeit/in in Graz", "duration": "N/A", "pros": "You can learn a lot, pays are decent, you'll get to work with cutting-edge technology and the location is very good.", "cons": "Too bad management and too much bureaucracy of the rectorate."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Future is uncertain, permanent/good jobs are political", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Mar 2021", "job_title": "Postdoctoral Researcher in Graz", "duration": "N/A", "pros": "If you land in a good place you can have a pretty easy life with the benefits of working for the public sector. BVA insurance, private pension contributions, Kindergarten and other perks. The environment can be pretty chill and colleagues are generally pretty nice.\r\n\r\nGood conditions for people wanting to raise children, have a part-time job that covers basic social security and pension while not investing much of your life working. In certain places/positions, people are hired for 5, 10, 15 hours, so if this is your aim, this could be the ideal place for you.\r\n\r\nSalaries for scientists are okay if you have a PhD, as they are regulated.", "cons": "The biggest con of this university is that there is a lot of red tape, it is very old fashioned and hierarchical. The \"rules\" are consistently bent and hacked, and things are arranged behind the scenes, so in practice the Med Uni Graz operates more like a private company than a public university, and the directors of each institute have nearly complete power, so good/permanent jobs are given more often than not politically and via connections, not based on merit and qualifications.\r\n\r\nIf you are unlucky, you can land in a very stressful institute/job with a really low salary for what you do: young doctors, PhD students, and temporary staff work hard and do most of the work and are offered an uncertain future in exchange. I know some PhD students who are forced to work on weekends in labs and are having a really stressful life, hoping they will get a great job after they finish their PhD.\r\n\r\nAs a clear example of all this, the 6 year rule (after 6 years of chaining temporary contracts the law says you need to get a permanent contract) sounds great on paper. However, it is constantly \"hacked\" (e.g., they send you to the AMS for 6 months or similar arrangements) so that no one gets a permanent contract (either because they want to avoid it or because they can't afford it). The Union (Betriebsrat) knows this perfectly and does nothing about it."}], [], [], []]