[[{"date": "5 Aug 2022", "title": "Employer Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MacEwan University", "Interview Descriptions": "I have nothing negative to say about the interview process except I was never contacted by MacEwan about the status of my application after the interview.\r\n\r\nI found out through social media via the successful candidates post that they got the job. Probably one of the most awful ways to learn you're application is unsuccessful.\r\n\r\nMind you this is after I reached out to the hiring manager and HR separately asking them to give me a call with an update.\r\n\r\nDon't waste your time and money on expensive parking applying here.", "Interview Questions": "Why should we not hire you?"}, {"date": "5 Mar 2023", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MacEwan University in Jan 2022", "Interview Descriptions": "It was very thorough. There were questions asked that aligned with the specific field that you were trying to get into. Plus, you could say that it was very objective and straight to the point.", "Interview Questions": "They have asked me about my background."}, {"date": "10 Nov 2021", "title": "Studio Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MacEwan University", "Interview Descriptions": "it is a group panel with different types of questions.\nIn general, it is a friendly discussion. The questions can be very generic. the interview takes about one hour.\\\nFor example, how do you know about the school? why did you apply for the job?", "Interview Questions": "For example, how do you know about the school? why did you apply for the job?"}, {"date": "24 Aug 2021", "title": "Techinian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MacEwan University", "Interview Descriptions": "This is a one-hour-ish online interview session with a hiring panel. The process is quite long. It is a neutral experience for me. The questions are pretty generic and I could be more in-depth about this role.", "Interview Questions": "What do you know about Macewan Uni?\nWhy are you interested in this position?"}, {"date": "13 May 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MacEwan University in Apr 2021", "Interview Descriptions": "This was a 15 min Zoom Interview that was used as a pre-screening of applicants. There were 6 people on the call and each asked a question. Was surprised by how much we covered in short time period.", "Interview Questions": "What steps I would take to enact a DEI policy"}, {"date": "28 Jan 2020", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at MacEwan University in Jan 2020", "Interview Descriptions": "It was required to submit the resumé and a cover letter by email and wait for being called for in person interview in few weeks with the supervisor and a person from the HR.", "Interview Questions": "They were basically about the previous library experience, and about integrated library systems knowledge. Also, about customers service background, that could be in another area.  And also database researching experience.   "}, {"date": "31 Oct 2019", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MacEwan University", "Interview Descriptions": "Hands down the most unprofessional interview - when I inquired who will be on my interview panel, my email was ignored. The interview started 10 mins late / guess they were figuring out who would be on the panel. \r\nBefore the interview even started the panel was distracted, uninterested and couldn’t care less/ I had a gut feeling that the hiring manager was hiring someone from her team from the  Fornee workplace - She had just moved into a role at macewan after  several years at a former workplace \r\n\r\nShe was disengaged and took no interest in listening to my responses. I found out today that yes, indeed she did hire someone from her Former workplace. I didn’t even get an email saying that my application was successful! I found out through LinkedIn. \r\nBasically they wasted my time since this was a “fake” interview. I highly advise against working for this highly unprofessional employer.", "Interview Questions": "A series of useless questions - and nobody wants listening to the responses "}, {"date": "14 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at MacEwan University", "Interview Descriptions": "It was a wonderful experience. Very welcoming and they make sure I understood the questions they were asking me. This is a great opportunity I had with them. I would definitely do it again", "Interview Questions": "How you heard about this job?"}, {"date": "12 Jun 2018", "title": "Contract Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at MacEwan University", "Interview Descriptions": "There was no interview they sent me an email with the contract and told me the day I started I was provided no other assistance or guidance whatsoever following this communication", "Interview Questions": "N/A"}, {"date": "26 Jan 2021", "title": "Sessíonal Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MacEwan University in Jun 2018", "Interview Descriptions": "Interview was with a panel from the department, including the chair. The panel asked general questions about teaching philosophy, classroom management, etc. It was a fairly relaxed atmosphere. Everyone was kind.", "Interview Questions": "How do you approach assignments? How would you deal with a disruptive student?"}], [{"date": "1 Mar 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at MacEwan University (Edmonton, AB) in May 2018", "Interview Descriptions": "In general it was a friendly environment. I showed up early for the interview and waited for a bit. They did a two on one interview, which wasn't too intimidating. There was one question that I found most difficult to answer though.", "Interview Questions": "If your coworker is missing and no matter what you do they don't answer back, then what should you do if you really need their help?"}, {"date": "10 Jul 2017", "title": "Technology Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MacEwan University (Edmonton, AB) in Jul 2017", "Interview Descriptions": "I applied online and was contacted by phone about 2 weeks later to come in for an interview. It was about an hour interview consisting of soft skill questions as well as technical questions regarding apps.", "Interview Questions": "What people skills could you bring to this position and how would you apply them on a daily basis?\r\n"}, {"date": "11 May 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at MacEwan University (Edmonton, AB)", "Interview Descriptions": "I was never interviewed. I was a student in the program. When I graduated, I was offered a number of courses to teach. As far as I know, few sessionals go through an interview process. It is a who do you do kind of hiring process.", "Interview Questions": "I was never questioned"}, {"date": "19 Jul 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MacEwan University (Edmonton, AB) in Jul 2016", "Interview Descriptions": "The interviewers described the process of the interview and explained the job in more detail. Each person on the panel asked questions. They allowed me to ask questions at the end of the interview. I was surprised HR wasn't present at the interview and HR didn't call me to let me know the results of my interview.", "Interview Questions": "How does your education and experience apply to this job?\r\nName a time you had a conflict with a coworker and how did you solve it?"}, {"date": "20 Mar 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MacEwan University (Edmonton, AB) in Mar 2013", "Interview Descriptions": "Asked me to schedule a interview via email then confirmed by phone. 2 Hrs and 1 professor interviewed me. Did ask bunch of routine questions，but most of the questions are research related. Also tested my written skill. Did tested my tecnical skills during the interview process. Also provided coffee，tea，and water.", "Interview Questions": "Tell us some basic functions about Nvivo"}, {"date": "4 May 2009", "title": "Education Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MacEwan University (Edmonton, AB) in Apr 2007", "Interview Descriptions": "Initially contacted for interview via email. Confirmed by phone.\r\nPanel consisted of 7 people for a low level management position. Had the impression that most had little or nothing to do with the position or responsibilities at hand. Subordinates also on panel. Routine questions, lackluster atmosphere, main hirer seemed rushed, humourless, out of his depth. Toward the end a few jokes on my  behalf seemed to lighten the mood. Interview last 45 minutes.\r\nAccepted the position after an initial lowball offer ($20, 000 than the highest paid staff that I would be reporting to me!).  No orientation given just some photocopies of benefits plan. No probation updates and nothing acknowledged at the 9 month mark.\r\nOverall impression is one of poor HR policies and procedures, extremely unprofessional culture, out dated position responsibilities, irregular 8 year gaps between performance reviews, disorganized,", "Interview Questions": "Where do you see yourself in 5 years"}]]