[[{"date": "21 Apr 2023", "title": "Associate Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CareOregon (Portland, OR) in Mar 2023", "Interview Descriptions": "Received an email 3 weeks after I applied, in order to schedule a phone screen. It went well, and she told me in our chat that I was definitely qualified for the job. Waited a week after the phone screen to hear back, received an email to set up a panel interview, for FOUR WEEKS out, with no explanation as to why it was so far out. Had a nice panel interview with two Directors, waited two and a half weeks to hear back with a generic 'no thank you'. My only contact in the department was an administrative assistant who never returned my emails when I tried to follow up after each interview. I was pretty disappointed to have no contact, and for the process to be dragged out for so long, to have it unceremoniously be a 'no' in the end. Applied on January 3, received \"no\" email on March 29th.", "Interview Questions": "What critical feedback have I received and how has that affected future work?"}, {"date": "10 Dec 2022", "title": "Transportation Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at CareOregon", "Interview Descriptions": "Very professional and friendly. Organized and on time. Position is very appealing. Interview includes behavior questions and answers. Welcoming and friendly and gave me plenty of time to ask questions.", "Interview Questions": "They asked several behavior questions"}, {"date": "18 Oct 2022", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at CareOregon", "Interview Descriptions": "Teams interview with two supervisors. They said they would contact whether it was a job offer or denial- never heard back from them. The questions bordered on inappropriate with regards to personal beliefs.", "Interview Questions": "What do you think about the homeless problem in Portland?"}, {"date": "26 Nov 2022", "title": "Deployment Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at CareOregon (Portland, OR) in Oct 2022", "Interview Descriptions": "The interview was through a staffing agency who remained extremely professional every step of the way. CareOregon however lacked any sense of professionalism. The interview itself was a waste of time and just plain frivolous. This is the job description that they sent to staffing agency. What the heck was I supposed to do with this? This job description is useless. It is just so astonishingly vague (troubleshooting. It just says troubleshooting.) \"There are about 700-1000 Win10 machines that need to be re-imaged as some of their SW programs are not running smoothly on the current image. Most of the imaging of these devices have been completed and now they need 2 people to help with the incoming machines to either fix them for re-deployment or retire them. They also want them to be flexible in the duties they perform every day. Some days they will do phone support, some days deployments, some days building accounts for new hires and getting new machines ready to go. Be flexible. Enterprise Req Skills Windows 10,Deployment,Hardware,Install Job Title deployment technician Top Skills Details 1.Win10 support, 2.any HW/AV support experience 3.Asset Management, 4. troubleshooting\" So this dude was 30 minutes late when I finally emailed my recruiter from the staffing agency all like \"is everything ok? I still haven't heard from CareOregon\" so I got a text back from my recruiter with a screen shot that said he had \"some fires to put out\" and wanted to reschedule for 1:00 pm and I confirmed for the 1:00 pm reschedule. Immediately after I sent that (in other words I guess we are not rescheduling now?), I got a phone call from the interviewer from CareOregon to proceed with the interview.", "Interview Questions": "Did you review the job description?"}, {"date": "24 Sept 2022", "title": "Claims Examiner II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at CareOregon (Portland, OR) in Sept 2022", "Interview Descriptions": "You get a call to see what day and time is good for both parties. Then you have a 45 minute interview. Make sure you have some questions for them also.", "Interview Questions": "How would you deal with a claim that there was no instructions for?"}, {"date": "9 Mar 2022", "title": "Population Health Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CareOregon", "Interview Descriptions": "It was positive.  Nice people, creative questions and an all around good experience.  Online only interviews, but everyone had their cameras on so it was great.  I still don't know if i got the job due to HR mixups.", "Interview Questions": "Equity question, project management and team building"}, {"date": "23 Jun 2022", "title": "IT Service Desk Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CareOregon (Portland, OR) in Feb 2022", "Interview Descriptions": "There was an initial phone screen. After that first call with the hiring manager then there was a four person panel interview.  After the panel interview, I was offered the job.", "Interview Questions": "They asked me about previous jobs where I did this kind of work"}, {"date": "12 Dec 2021", "title": "Medicare Stars Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at CareOregon (Portland, OR)", "Interview Descriptions": "I applied in the late summer of 2021, had a first round interview shortly after applying, and then for months there was little to no communication. I kept checking in, but no update other than they were still interviewing candidates. It wasn't until about 4 months later I was offered a 2nd round interview (after asking if they are scheduling second round interviews). I was given an offer, however it was 8K below the mid-point I was informed about, and what my salary expectations were. Upon discussion with the recruiter, they only factored in a year and 4 months, out of 7+ years of working in the industry. The recruitment team is amazing, but the compensation team needs to truly evaluate people and their experience properly. I am so disappointed.", "Interview Questions": "Tell us about yourself and why you're interested in this position? \nWhat is your background with alternative payment models? "}, {"date": "26 Aug 2021", "title": "Member Services Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at CareOregon (Portland, OR) in Jun 2021", "Interview Descriptions": "I had two interviews. The first one was an informal call with the hiring manager, questions were about my interest for the position.\nThe second interview was with 5-6 people via Zoom. These would have been people I had to interact on a daily basis. The hiring manager sent me the questions 24h in advance so I had time to prepare. I enjoyed the interview process and I could see they hire first for culture fit and secondary for job fit.", "Interview Questions": "1. Introductions - Tell us about yourself and what interests you about the position\n2. Project Management development experience, what did you learn?\n3. About the same program: a)Share how you held people accountable, b) Share your process for improving workflows, c) Share how you ensured that no pieces got left behind, d) Share how you measured success including data analysis\n4. Share a time you had to learn a new tech platform, what made it successful and what would you do different next time\n5. Tell us about a time when you inspired others who were not accountable to you towards a common goal. What was the key to your success?\n6. Share a time you navigated a tough relationship. What did you do and what was the outcome.\n7. What do you need from your leaders and your peers to feel successful?"}, {"date": "13 Apr 2021", "title": "Database Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CareOregon (Portland, OR) in Mar 2021", "Interview Descriptions": "I applied in December and got an invite to interview from the hiring manager three months later. To echo a previous review, the whole process was very disorganized and unprofessional. \nI had multiple panel interviews with part or all of the very large team via video conference. Red flags abound:\n1)They have NINE database developers at a company with less than 1,000 employees. If a company is automating their data and analytics processes correctly, they don't need anywhere near that amount of redundancy. When asked why they were hiring a tenth database developer, they were unable to articulate what the role would actually be doing other than replacing someone who retired.\n2)The final 90 minute panel interview included the entire team. How is any work getting done when the entire team is sitting in interviews for that amount of time? Who is handling any potential production issues?\n3)They didn’t ask me any questions about data warehouse architecture/patterns, advanced SQL or anything appropriate for a senior developer with 15 years of experience. I got lazy fluff questions you’d ask a recent college graduate like “What is your favorite file versioning software?” and “Rate your SQL skills on a scale of 1-5.”\n4)Hazing is alive and well. One of the devs rattled off a list of fields and asked me to verbally code something with purposely vague requirements. When I commented this would be a lot easier and more realistic to do in a code editor, he sneered “You’re supposed to ask questions.” I had already completed a coding assessment and received positive feedback, so I’m baffled as to what he was trying to accomplish. He looked to be in his late 40’s, so I can only assume he still thinks companies are doing whiteboard coding and hazing to find candidates who will put up with anything. They aren’t…\n\nI politely cut the interview short stating I knew everything I needed to know about the job. Having been out of the interview game awhile, it was good practice if nothing else.", "Interview Questions": "What is your favorite file versioning software?"}], [{"date": "6 May 2023", "title": "Policy Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CareOregon (Portland, OR) in May 2020", "Interview Descriptions": "There were three interviews in total, including a demonstration of group facilitation (in-person). Interview team included would-be co-workers and supervisors. Had to be strategic in the questions I asked as there wasn’t a lot of extra time. Overall, nice experience.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Sept 2021", "title": "Actuarial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CareOregon in Mar 2020", "Interview Descriptions": "Two rounds of virtual interviews. One with HR lasting 30 minutes. One with the actuarial managers lasting 1 hour. Interviewers were friendly and were wanted me to talk about my experience in depth.", "Interview Questions": "What experience have you had with Tableau and SQL?"}, {"date": "27 Apr 2021", "title": "Quality Improvement Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CareOregon (Portland, OR) in Jan 2020", "Interview Descriptions": "The interview and setup were timely and well organized. I appreciated the attention to detail and flexibility in scheduling. Rigorous process, but nothing unexpected. I have multiple rounds of interviews with different people.", "Interview Questions": "How would you handle this position?"}, {"date": "1 Jul 2019", "title": "Technical Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at CareOregon (Portland, OR)", "Interview Descriptions": "I went in on a Monday and interviewed with the Communications Manager, Sr Director of Business Integration and Medicare Sales Manager. I came back on Wednesday for a follow up interview and was offered the position on Friday.", "Interview Questions": "How does your past experience prepare you for this role?"}, {"date": "25 Jan 2019", "title": "Production Artist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CareOregon (Portland, OR) in Dec 2018", "Interview Descriptions": "1. Call to set up phone interview. 2. 30-minute phone screen with HR person. 3. In-person interview with manager. 4. Group interview with dept team. \nAll very efficient and friendly. Timely responses and follow up. Clearly said the final choice was me or one other candidate. I didn’t get it, but who knows why. Total of two months with good feedback all the way.", "Interview Questions": "Majority of questions were specific to the job to determine my experience and ability, my work attitude, and my fit for the team. No “five-year plan” questions. No off-topic, trick questions."}, {"date": "9 Sept 2015", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at CareOregon (Portland, OR) in Feb 2014", "Interview Descriptions": "I had a phone interview in which the lady seemed perfectly normal and reasonable at first. She asked me some standard phone screening questions, we went over my resume (current position, skills, etc) then she invited me to come meet her in person.\r\n\r\nComing in person was a totally different experience. It became clear to me that the supervisor doing the hiring was extremely unprofessional and disorganized. She was rude and even stopped me during my interview to make a personal phone call, which she didn't seem to think was a big deal at all. I had everything she was looking for and she even told me herself, but she was very aloof and refused to make eye contact and kept doing unprofessional things likes playing with the telephone cord during our interview and looking out in the hall every time someone passed by. It was so bizarre and I've never had someone so incompetent and immature interview me. I was glad to just get out of there. I didn't bother to move onto any other steps because if she was going to be my supervisor, I know my life would have been a living nightmare.", "Interview Questions": "Can you handle a high volume environment"}]]