[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place, great people, great mission", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jun 2023", "job_title": "Coordinator in Atlanta, GA", "duration": "N/A", "pros": "Friendly staff, dedicated to the mission, pay is average market, growth opportunities, personal development allotments", "cons": "work culture could be improved, and more structure for internal growth"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Talent staff but poor leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 May 2023", "job_title": "Business Development", "duration": "N/A", "pros": "CARE has a lot of dedicated staff that are committed to the mission.", "cons": "Opportunities to grow are limited and inequitably distributed. DEI is a concern with micro aggressions often dismissed. Because leadership ignores staff concerns, there is high turnover and talented people are lost."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Zero Work-Life Balance", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Dec 2022", "job_title": "Program Manager", "duration": "N/A", "pros": "Extremely gifted and passionate colleagues (more so than most competitors) who believe strongly in the work they do. Highly ideologically motivated team. Genuinely inclusive and respectful workforce that values everyone's opinion. Excellent internal and external communications. The folks who stay with CARE long-term truly are married to their jobs! If you don't mind that or have competing priorities, then there are lots of excellent opportunities to travel and grow with the organization.", "cons": "Chronically under-staffed and over-worked. Organizational culture accepts and rewards little-to-no work-life balance. Very high staff turn-over. Poor team building and cohesion overall. (Some limited efforts are made, but few people have time to participate due to the demanding workload.) Weak operational and administrative systems and protocols for such an established and large organization. Departments and units are very siloed, resulting in many redundancies. Inefficient on many levels, including high frequency of meetings. Also very frugal! CARE maintains a super low overhead by regularly externalizing costs to its own employees, especially those costs relating to travel and event costs. Benefits are fine, but not particularly impressive relative to other NGOs."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Great organization, great mission, wrong leadership", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Mar 2023", "job_title": "Communications Manager", "duration": "N/A", "pros": "Noble mission, amazing, talented colleagues globally, so much enthusiasm and devotion everywhere! CARE works in over a hundred countries in different capacities and there are countless great things about it in those places. Competitive salaries, great benefits, ample vacation time, great flexibility (for most CARE USA staff).", "cons": "The current leadership, especially the CEO and her office, have been there for longer than they should have been and unfortunately have done more harm than good. They laid off many great people across the organization and hired some really incompetent people who caused lots of trouble and pushed out other great people. I would love to work for CARE again but they need some level of overhaul."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "MISERABLE, disorganized, dreadful entity", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good paid vacation, otherwise no one would ever consider working here.", "cons": "THis is by far the most miserable place I have ever had the misfortune of working at. Leadership is negative, messy, inaccessible, and unsupportive. Processes and procedures are few and far between. Most everyone in unhappy, overworked, and underpaid and \"leadership\" certainly takes it out on their reporting employees. The fact this organization is founded on \"empowering\" women is an absolute joke, and an insult to women everywhere. I have never felt so bullied or belittled in my life at a job, and turnover is extremely high."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "New Employee", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Feb 2023", "job_title": "Sr. Technical Advisor", "duration": "N/A", "pros": "CARE US is a great institution with a clear vision of supporting women and girls. During my first 3 months working with CARE, I have had great support from my team's department. It is a strong technical and supportive team.", "cons": "In the beginning, the onboarding process is confusing, and guidance and orientation could be more precise and approachable."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Making the world a better place with one CARE resignation at a time", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The missions are amazing and we do great work when it gets done. There are some amazing people here as well.", "cons": "Hey lets go in circles and add a few more \"middlemen\" to any process that already takes FOREVER. Oh! And lets add 5 more meetings to the week regarding the same discussion that we've had for the last year and still haven't seen any results. Nonprofits are slow but things would move a lot quicker if we'd stop doing the same thing over and over again expecting different results. Management says they want feedback but they seem too overwhelmed to have any time to act on any. The turnover is insanely high but the onboarding process is atrocious which leads to people deciding they want to leave before they've even settled in to their position. I get that we are out there doing all these great things to help the less fortunate but the lack of care that CARE gives it's staff in the same regard is ironic. The culture/environment has one feeling as though it's expected of them to put everyone else's oxygen mask on before their own and it isn't a great feeling."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Nightmare of a messy organization", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Apr 2023", "job_title": "Media Partnerships Manager in Atlanta, GA", "duration": "N/A", "pros": "Good PTO and healthcare insurance", "cons": "Lack of structure, resources, leadership and guidance.it’s of negative, unprofessional, and bullying higher up staff."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Working at CARE", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2022", "job_title": "Intern", "duration": "N/A", "pros": "So far during my time at CARE I have had a really great experience working with an amazing team. Everyone has been super welcoming and is passionate about doing great work, and is always willing to answer questions that I have and help each other as a team should always do. I also really like the fact that I've been able to learn and complete more technical tasks that I think would help me once I move on from the internship role! I am looking forward to learning more from my colleagues and being able to connect with people globally during the rest of my time here.", "cons": "No cons that I can think of at the moment!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Salary is not competitive. Leadership is self involved and disconnected.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Sept 2022", "job_title": "Marketing Manager in Atlanta, GA", "duration": "N/A", "pros": "The people in the country offices and communities where CARE works are local leaders who usually do amazing work enacting change at the grassroots level.", "cons": "To keep overhead low, CARE pays it’s employees the bare minimum for the max amount of work. Leadership are cold and disconnected, and only care about their own outward appearances and political standing. My manager met with me less than once a month and gave orders via unpunctuated and often unclear, single sentence direct messages. Only received performance feedback after asking for compensation, and it was unjustifiably negative. No growth opportunities despite the fact that many people quit and were never replaced. Raises and promotions are only given to a select few once or twice a year and cost of living adjustments do not match inflation."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Driven by a mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Broad and powerful organization. In war, natural disasters, poverty and despair, CARE offers solutions--some immediate, many long term. Lots of innovation - a culture of trying new things", "cons": "Can be overly collaborative, which leads to inefficiency"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Feb 2023", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "Great mission and leadership. Great global and local teams.", "cons": "Nothing at this moment - workload can be easier"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Love working here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Feb 2023", "job_title": "Business Development Manager in Washington, DC", "duration": "N/A", "pros": "Work from home flexibility. Love working with colleagues who genuinely care about the work.", "cons": "Long hours especially for business development."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Incompetent and aggressive People & Culture", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Long legacy. Big scale. Big money.", "cons": "Pathetic people and culture department. Some executives are totally clueless. No one addresses the problems. Worst HR full of arrogant people."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Smart and dedicated people", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2022", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "I love working at CARE USA because I keep meeting very smart, very dedicated people - keeps me on my toes, makes me keep my game high, and enables me to learn tons from my peers.", "cons": "So far the workload gets significantly larger every week - hasn't tapered into a very sustainable level yet."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Discrimination is rampant and not addressed", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Oct 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "International development Great CEO with a heart People from the Global South wonderful to work with", "cons": "Lots of “gaslighting” of people of color Silent quitting goes on a lot The way to survive is “don’t speak up” Top heavy organization Very little funding goes to the field offices Too much focus on India Too many zoom meetings"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not worth it: terrible work culture/leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Oct 2022", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "The mission, CARE’s ingenuity, the value of partnerships, and my wonderful coworkers", "cons": "Bad management, inability to decolonize fundraising, lack of structure, lack of upward mobility, and lack of work-life balance. Most importantly, lack of promoting people of color (esp. black women) into leadership."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Good workplace culture but poor systems and pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Smart, kind and passionate colleagues. The organization makes much more impact and saves more lives than most of its kind. People are generally helpful and collaborative. The organization is focused on de-colonization and localization, and practices (not just preaches) progressive and human rights-based values. At least on my team, colleagues are respectful of a work-life balance and working remotely.", "cons": "Overall, the organization does a disservice to itself by splitting the work into humanitarian vs. development settings. This means two people working on, say, food security, might never collaborate or learn from each other, if they are working in different settings. Countries don't neatly divide into either development or emergency situations- they are fluid, and some are mostly stable with an emergency in just one part of the country. So why does CARE still insist on taking this approach? It causes confusion, competition, territorialism, and duplication of efforts.\n\nSpecifically:\n\n1) Because the international structure is confederated (most countries' CARE offices are independent) there is very little cohesion, communication/collaboration between technical teams or across countries, and a lot of duplication of efforts. It is hard to manage quality when each country is more or less left to its own devices, but still represents that CARE brand.\n\n2) The monitoring and evaluation systems are just terrible. CARE needs a modern digital platform to track, analyze, visualize and report data. I am a data person used to working with numbers, but I cannot make sense of CARE's system and it's difficult to pull a single statistic from all the confusing databases and dashboards. The M&E staff are prickly and not very helpful.\n\n3) I adored CARE's HR until I had a baby. I spent my ENTIRE pregnancy and four months after the birth of my child trying to figure out how much maternity leave I could take. I got conflicting and incorrect information from each HR person I spoke with. Part of this is because the United States has a patchwork of parental leave polices that differ across states, but the HR leave representative was unwilling to read a two-page document about the paid leave available where I live. I spent probably 150 hours on the phone/email/internet trying to get the leave I was entitled to. In the end my boss intervened and gave me an extremely generous leave.\n\n4) CARE pays less than most other NGOs. I don't mind because my position is perfect for me, but it means we can't recruit highly qualified staff in country. The quality of work from most countries I've supported has been very poor compared to other NGOs where I've worked. This is partly a casualty of the decolonization effort. Staff in the Global North can never lead but may only support. Often that means a sacrifice in quality.\n\n5) Despite 2 years of visible backlash about the Communication team's unethical marketing and fundraising practices, they continue to depict suffering people in undignified and harmful ways to get donations. This has turned off some partners and donors we wanted to work with, particularly pop up ads asking for donations when, say, a donor comes to our site looking for information about our programs and approaches."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Disorganized, high turnover, poor communication", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Oct 2022", "job_title": "Executive Director", "duration": "N/A", "pros": "Salary is great High profile organization doing good work globally Highly skilled teams and powerhouse individuals working there", "cons": "Terrible communication Extremely high pressure and no culture of supporting staff No onboarding plan Most staff I met had worked for less than 18 months at Care - turnover is high because it is not a great place to work"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great company, great mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Nov 2022", "job_title": "Global Events Intern in Atlanta, GA", "duration": "N/A", "pros": "great people, good work/life balance, lots of diversity, chances to move upward", "cons": "nonprofit work is hard but satisfying when it works out"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Retaliatory environment, duplicative U.S. leadership roles, wasteful organization", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission attracts hard-working, skilled experts committed to the values CARE exhibits, along with the star-studded external conferences and other awareness-raising events. There are opportunities to get involved in different work groups and special initiatives, which may offer needed distractions from other internal frustrations or challenges.", "cons": "Below-market pay compared to peer organizations\r\nMinimal protections for employees\r\nA lack of transparency on salary bands for positions\r\nNon-sensical (practically non-existent) merit increase policy\r\n\r\nCARE protects its leadership and the communities it serves but not its employees. There are absolutely no accountability standards at this organization. Staff in leadership roles are allowed to exhibit poor professional behavior, including retaliating against staff who report them, without any recourse.  Annual performance reviews aren't even evaluated by HR nor archived at all because there is no authentic and comprehensive merit increase policy.\r\n\r\nWhat donors and others will find beneath the surface of CARE is a culture of overworked, underpaid, and - depending on the manager - under-appreciated staff who are the lifeblood of this organization. Meanwhile, there is exorbitant spending on public relations to generate more revenue to create unnecessary and duplicate leadership roles. The layers of leadership at this organization are ridiculous.\r\n\r\nIf you decide to work here, commit to a specific time frame for your tenure and then take your talents to a more authentic place with accountability standards for everyone and protection measures for employees, as well as better pay and benefits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "CARE", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Apr 2022", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "CARE is an organization comprised of incredibly bright people from around the globe who are dedicated to the mission. The employees are empowered by a leadership team who has a demonstrated commitment to diversity, equity, belonging and inclusion at all levels, both here in the states and in the countries where CARE works. The benefits are fabulous and most managers manage your work - not your time. The post COVID flexible work schedule is a progressive example of the appreciation for work life balance.", "cons": "The leadership style is collaborative and offers the employees a voice. This results in unrealistic employee expectations and prolongs decision making and dilutes leadership's ability to decisively lead and affect change."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Care USA", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Nov 2022", "job_title": "Program Coordinator", "duration": "N/A", "pros": "Helping people in need & homeless", "cons": "Good org in aid field"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great mission, office life depends on dept/location", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Sept 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mission, history. I worked in a regional office, so I felt the bureaucracy a bit less. Opportunity to travel and see programs up close.", "cons": "There was some disorganization while there and a lot of staff turnover. Didn't always feel supported in my position."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good place, nice salary, and benefits", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Sept 2022", "job_title": "Director of Development", "duration": "N/A", "pros": "-Great salary\n-Beautiful offices\n-Health benefits are nice\n-Good opportunities for growth", "cons": "Big company. Everyone has their preference. I decided to move on as it was a highly matrixed organization and a little tougher to move things through the pipeline."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A Wonderful Community to Work Within", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Sept 2022", "job_title": "Senior Talent Acquisition Coordinator in Atlanta, GA", "duration": "N/A", "pros": "A wonderful mission\nCollaborative environment\nOpen and transparent responsibilities and duties\nA true feeling of caring and respect among team members", "cons": "Could have more organized onboarding"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "It was a dream until I had to work with a power-hungry micromanager", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Oct 2022", "job_title": "Program Officer in Atlanta, GA", "duration": "N/A", "pros": "Salary and impact you're making on the lives of others", "cons": "Some are power-hungry and operate together like a mafia."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great NGO // Pay scale not in line with industry standards", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Apr 2022", "job_title": "Grants Management in Atlanta, GA", "duration": "N/A", "pros": "Great culture and mission. Work life balance (with the right supervisor) is amazing.", "cons": "Pay is not in line with industry standards. There are so many country offices CARE USA leads yet KPIs and SOPs are all over the place. Most processes in CARE have a standard yet answers are always a grey area. If there are processes in place you would assume the answers and actions would be black or white responses. Very frustrating. Because of this it seems teams work in silos dependent upon what works for that team."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "It’s typical", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits, great people and can be pretty flexible", "cons": "Too many BIG ideas! Leadership continues to be underwhelming. The pay inequity is a constant, especially within the same department."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "CARE Internship", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Aug 2022", "job_title": "Digital Content Intern", "duration": "N/A", "pros": "Flexible, understanding, learning environment, opportunities for growth", "cons": "Unpaid, little effort to connect interns across the organization"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Toxic US leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jun 2021", "job_title": "Anonymous", "duration": "N/A", "pros": "Excellent country programs and staff despite largely clueless US management.", "cons": "Toxic leadership from the US executive management team has destroyed organizational culture and morale. Raising concerns and needed improvements is met with hostility and defensiveness - there is no space for dialogue. CARE staff desperately need a union. \n\nThere is no accountability at any level of management. Poor and even the most problematic managers (especially white) are not let go. \n\nCARE is too top heavy while mid-junior level staff who get the work done are overstretched and undervalued. Overall, these staff are fully committed to CARE’s mission and go beyond a healthy work/life balance to ensure the job is done. Staff come for the mission and leave burnt out by overwork and disillusioned by CARE US leadership who pay lip service to concepts of equity, social justice, and decolonization of aid while consistently making organizational management and personnel decisions that are antithetical to these ideals."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good to work there", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jul 2022", "job_title": "Finance Director", "duration": "N/A", "pros": "Non for Profit and working to fight against poverty around the world", "cons": "Improve staff treatment in terms of salary"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Moves slow but curious", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Jul 2022", "job_title": "Managing Partner in Atlanta, GA", "duration": "N/A", "pros": "Strong leadership, open to innovation to a certain point.", "cons": "Still some old thinking, slow moving."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Overall good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Jun 2022", "job_title": "Coordinator in Atlanta, GA", "duration": "N/A", "pros": "Strong mission, brilliant staff and great employee benefits.", "cons": "It is difficult to get them to adjust to living certain values because it leans older and less progressive."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great culture with passionate people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Jan 2022", "job_title": "Director of Strategy and Planning in Atlanta, GA", "duration": "N/A", "pros": "A great culture; very passionate and committed people all over the world; and the top leadership team challenges the status quo in the sector and pushes all to do the max for our impact groups. I have enjoyed working for CARE in so many countries and positions, but the strategy function is where I feel I am contributing the most. I am NOT in the sector to accept the status quo and this position gives me that satisfaction!", "cons": "I wish we could all do more for social justice."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Work Culture", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 May 2022", "job_title": "Business Development Manager in Lusaka, Lusaka", "duration": "N/A", "pros": "Great global support from other CARE member countries and parent organisation in the USA.", "cons": "beaurocracy in making critical decisions"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Ineffective senior leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mission, vision, and values\nVery smart, dedicated, and innovative employees \nLots of room for early career professionals to grow expertise and take on new responsibilities", "cons": "Complete lack of coordinated vision by US leadership\nLeadership willing to take resources and direction from funders and partners with questionable moral practices\nHollowing out of core programming function to become a fundraising and marketing organization (and a bad and problematic one at that) \nSure, you'll be able to take on new opportunities but you'll be overworked, overburdened and your cries for help and more reasonable work life balance will go completely unanswered (or worse, answered with platitudes)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Stable Organization", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 May 2022", "job_title": "Accountant", "duration": "N/A", "pros": "Stable Organization and Environment Friendly", "cons": "Lack of Talent Management and Training"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 May 2022", "job_title": "Regional Human Resources Manager in Washington, DC", "duration": "N/A", "pros": "Flexible and great work environment", "cons": "None as of today please"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Going Backwards", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Committed and talented staff programming in the countries where we work, despite continued lack of investment and leadership from HQ.", "cons": "Dysfunctional executive team who exist in their own echo chamber, increasingly opaque as to decision making, little transparency on investment decisions. Loss of key senior staff and high turnover has been highly disruptive and resulted in very low morale. HQ has become bloated under the current CEO with no real added value to our programs and with the trade off being declining investment in the core business of our country operations."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "The  HR teams are very professional", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Mar 2022", "job_title": "Grants Coordinator", "duration": "N/A", "pros": "I can certainly recommend CARE to anyone", "cons": "The time zone makes it difficult sometimes as CARE offices are interconnected around the world"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great mission", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Apr 2022", "job_title": "Assistant Vice President (AVP) Programming", "duration": "N/A", "pros": "Geniune people, truly committed to fighting inequality", "cons": "Lack the ability to prioritize well"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "managing projects", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Feb 2022", "job_title": "Project Manager in Atlanta, GA", "duration": "N/A", "pros": "Awesome team and work environment", "cons": "Some executive leaders create an uncomfortable workplace"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2022", "job_title": "Intern", "duration": "N/A", "pros": "culture is great and so is team support", "cons": "i have no cons honestly"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Job satisfaction", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A chance to work with very dedicated people world-wide", "cons": "work-life balance leans more toward the work side"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Working at CARE USa", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Feb 2022", "job_title": "Analyst in Pasig, Rizal", "duration": "N/A", "pros": "Working in the humanitarian sector, exposure to different cultures.", "cons": "Shared Services Center senior management"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "good work climate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Feb 2022", "job_title": "Communications Specialist in Lima, Lima Region", "duration": "N/A", "pros": "good environment in the offiice", "cons": "In general they demand to much of the workers"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Finance and Grants Officer", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2022", "job_title": "Finance and Grants Officer", "duration": "N/A", "pros": "Good organizational culture for all employees\r\nGood Career growth for employees", "cons": "Over working\r\nTo much training for staff"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jan 2022", "job_title": "Senior Director", "duration": "N/A", "pros": "Great flexibility and work location and hours, great benefits, supportive of working parents", "cons": "None - I think they offer a lot for employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great organization with a great mission", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "the work CARE does is incredible", "cons": "some of the processes are not clear or standardized"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "incredible programming, toxic US work place culture meet poor leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 May 2021", "job_title": "Senior Advisor", "duration": "N/A", "pros": "Programming & impact work in country offices is transformational and it was an honor to be a part of the organization for this reason. The people are incredible and come for good reasons.", "cons": "US-based work culture is rotten from the inside. The toxic culture leaves people feeling dismissed and devalued. When there are moments to live up to its values - esp of equity and social justice - CARE's leadership makes consistently cowardly decisions. Despite many rounds of such attempts, there continues to be absolutely zero compelling vision (other than a bleak vision of raising more UNR)."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Intern review", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Sept 2021", "job_title": "Internship", "duration": "N/A", "pros": "Good coworkers, helpful coworkers, good mission in “theory”", "cons": "Internships are unpaid and absolutely no consideration for the hard work interns put in. They do not give any preference to interns for interviews when job opens up. Impossible to get a job there despite years of interning"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good traditional NGO", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good salary and benefits. Competent teams.", "cons": "Still old fashioned in how it designs programs, fundraisers. Like all big INGOs, should be thinking about how to dismantle itself."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Mixed feelings", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Mar 2021", "job_title": "Project Manager in Mogadishu", "duration": "N/A", "pros": "-Very good teamwork in my project. Helpful colleagues who felt more like family.", "cons": "Promotions of staff are heavily biased against national hires, and preference is for hiring from outside of Puntland even though the national staff are far more familiar with the context and programming than are outsiders and in most cases do the actual project management and yet their remuneration is not commensurate with their efforts.\r\n\r\nSenior management is not supportive and there is an active bias against women, especially once you start to have children because you are not able to undertake fieldwork as you might have been able to as a single person."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Company for Women Empowerment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Oct 2021", "job_title": "Financial Accountant in Manila, Manila", "duration": "N/A", "pros": "Diverse\nGood People\nGood working environment in Manila", "cons": "Timing differences\nOvertime\nToo much workload\nNo work life balance\nShould focus more on mental health issues"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Regional HRBP", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Nov 2021", "job_title": "Regional HRBP in Jāwā", "duration": "N/A", "pros": "Great employer, autonomy, duty of care, empowerment", "cons": "Hectic, challenges in the region,"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great people, large Ngo", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Oct 2021", "job_title": "Department Head", "duration": "N/A", "pros": "Great people to work with and lots of opportunity to good work", "cons": "Big bureaucracy so it’s challenging to be agile"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "powerful with potential to scale impact", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "powerful mission, focus on gender equality, localization", "cons": "inward looking, process driven, bureaucratic"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Love the vision", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Oct 2021", "job_title": "Technical Advisor", "duration": "N/A", "pros": "great vision for CARE International especially 2030", "cons": "transparency and lack of communication"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "All that glitters...", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 Mar 2021", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Work-life balance is pretty good and the only reason I gave two stars.", "cons": "So many cons! The pay disparity, even among people on the same team, doing the same work, is insulting. Management is TRASH! From lower management, all the way to the top! It’s as if none of the decision makers know what they are doing. Throwing crap against the wall to see what sticks. This makes for a pretty frustrating go of anything. You can’t complain about how awful and incompetent your direct manager is, because their manager won’t actually do anything about it."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Fantastic Mission, Leadership Needs Overhaul to Stay Relevant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Excellent Mission\nTop notch in-country field programming and staff", "cons": "- Headquarters Staff is out of touch/ disconnected from cutting edge of field\n- White and western leadership needs to be diversified"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Great Intentions, Wrong Direction", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2020", "job_title": "Leader", "duration": "N/A", "pros": "The mission impacts millions of lives around the world. CARE is full of people eager to make a difference. Teams are well-versed in the work and the reputation of the organization allows for greater reach in hard-hit areas.", "cons": "The leadership team is far removed from the realities of the community. This organization is diverse, but not inclusive - unless you are a white woman. If you want to sharpen your experience in professional politics, this is the place for you. CARE is slowly falling apart as the gap between practitioners and C-suite leadership widens. It is all about quantity over quality, volume over direct impact, marketing over actual program delivery. Bullies are celebrated and people and culture are bought out by these high-ranked leaders, which enables a consistently toxic work environment. Beware! Don't be surprised if your good intentions to make an impact gets drowned and swallowed up by the messiness in this organization going in the wrong direction."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Poorly managed, very chaotic", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Apr 2021", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Wonderful mission, great facilities, and passionate people", "cons": "Organization is not well-run. There are layoffs every other year and lots of chaos. There is no accountability for bad managers."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Bureaucracy without results", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 May 2021", "job_title": "Director of Development", "duration": "N/A", "pros": "Great mission and some wonderful colleagues", "cons": "Poor execution most of the time. Dysfunctional management. Boys club which is weird for a gender-focused organization"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great mission, dubious executive team", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Apr 2021", "job_title": "Communication Coordinator in Atlanta, GA", "duration": "N/A", "pros": "People in the field working towards one of the most noble missions in the world.", "cons": "US headquarters spends too much on VPs, amenities, and pointless initiatives"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Mixed bag, mostly positive", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Jan 2021", "job_title": "Senior Technical Advisor in Washington, DC", "duration": "N/A", "pros": "Freedom to focus on what is important to you, benefits are good, many quality colleagues, strategy is important though unevenly practiced", "cons": "Disconnected senior leadership, no accountability mechanisms, HQ staff with little field experience, too decentralized at times making had to ensure quality"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Solid Internship", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 May 2021", "job_title": "Intern in Atlanta, GA", "duration": "N/A", "pros": "Great colleagues, always food around", "cons": "I can think of no serious disadvantages"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "stimluating work at a mission driven organizatin", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "28 Apr 2021", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "mission-driven, flexible hours, great colleagues worldwide", "cons": "internal politics, frequent changes in leadership, overemphasis on internal organizational development processes"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "good employer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 May 2021", "job_title": "Capacity Development Technical Advisor", "duration": "N/A", "pros": "flexibility, engagement, innovative, good employer, good salary, all over the world (career opportunities)", "cons": "very American culture, work load"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome mission but internal swirl", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Apr 2021", "job_title": "Administrative Assistant", "duration": "N/A", "pros": "Amazing colleagues, amazing work and diverse thought", "cons": "Constant state of change and transparency from leadership"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great technical approaches, failures of management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Oct 2020", "job_title": "Senior Technical Advisor in Atlanta, GA", "duration": "N/A", "pros": "Outstanding, committed, very hard-working colleagues across the world. Central focus on women and girls and good frameworks. Wonderful personnel and opportunities to implement effective programs.", "cons": "Utterly disconnected management with no leadership skills or respect for knowledge and vision of technical teams and country offices. Overly bureaucratic and losing its technical and political edge. Resources going to redundant layers of high-level executives instead of investing in quality programming and infrastructure. Work-life balance is not practiced."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great place to work and great work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Dec 2020", "job_title": "Senior Technical Advisor in Atlanta, GA", "duration": "N/A", "pros": "Smart colleagues - especially those in Country offices. Like most any job, enjoyment depends on the trust, compassion, transparency and flexibility of your boss -- and mine is fantastic.", "cons": "Not much room for growth or diversification"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "It's all an illusion", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jan 2019", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "The people that we are helping around the world is the best part. When you hear the stories of those that had very little, making a better life for themselves and their family is so awesome. The benefits and flexibility are pretty good. Work/Life balance is great,  but depends on the department.", "cons": "Management is awful! Like seriously, really bad. The majority of management have really bad people skills. There are a string of lazy hiring/promotions that run rampant. There is an environment of favoritism and nepotism, which fosters low staff morale and huge turnover.  There are no real processes or procedures, which allows for management to do what they want. No one holds them accountable.  Teams are stretched thin and there is quietly layoffs going on, with no message coming from leadership, which leads to staff walking around on pins and needles. Meanwhile, hiring of upper staff continues, when the organization is seemingly struggling financially.  The lack of diversity is disheartening. There are tons of really \"BIG\" ideas with no ability to actually implement them.  This use to be a really great place to work. Those days are long gone. Many of us are waiting for the bottom to fall out."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "A great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Apr 2021", "job_title": "Finance Manager", "duration": "N/A", "pros": "Diverse work environment, great opportunity for personal development", "cons": "Lack of promotion and difficult to get a raise"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great Mission Poor leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "18 Mar 2021", "job_title": "Revenue Manager in Atlanta, GA", "duration": "N/A", "pros": "The organization has a Great Mission", "cons": "Leadership Team does not seem to be focused on delivering on the organizations strategy. Poor execution"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great mission but heavy bureaucracy", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2021", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "Strong mission, staff really care about their work, everyone is kind", "cons": "Internal management is incredibly opaque, expertise is not fully valued or recognized"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great Mission, Poor Leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Jun 2019", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "The best part are the people actually doing the work. They are the most amazing group of individuals I've had the pleasure to know. The benefits and flexibility to work remotely are pretty good (especially in comparison to other orgs). I love the mission of the org, but it often feels that the management doesn't align with it.", "cons": "Previous review could not be more accurate: \"In the past 2-3 years, the Executive Management Team (reporting to the CEO) has doubled in size. This top-heavy suite includes highly paid floaters with opaque roles, a surge of Washington DC Democratic Party stalwarts, and the expected tossed salad of new ideas, initiatives and champions. With a few exceptions, the next layer of senior management doesn’t inspire higher confidence. The latest backstabbing catty tactic or in-your-face unprofessional outburst pepper the daily musings of the hapless around the water cooler. As such, turnover has been accelerating and this is key – it is turnover of valued, skilled employees. Recruiting fresh new talent is one thing – exchanging high-performing people with less-than-competent replacements is a sure-fire way to accelerate the rot from within. There continue to be highly talented & industrious individuals working at CARE USA. Sadly, these individuals are becoming isolated within a core culture sorely in need of honest self-assessment.\" \r\n\r\nWe recently completed our third layoff in 10 months, which continues to drive more quality employees out -- either by layoff or out of fear that they'll be next."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "When you work at a non profit its the people", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Jan 2021", "job_title": "Digital Lead in Washington, DC", "duration": "N/A", "pros": "The type of person that wants to dedicate their portion of their life to helping others are some of the best. to be around.", "cons": "Old company with old ways still catching up."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Troubled organization", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The organization pays a decent salary and the field staff are excellent and wonderful to work with.", "cons": "The leadership appears to be quite lost and lacks a clear sense of direction. Morale is extremely low. It's unclear. The salary doesn't outweigh the leadership struggles and quite frankly the extremely poor work environment."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "oh no, oh no, oh no no no", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Apr 2021", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "I received a paycheck, usually", "cons": "outdated programs, politics and a focus on the brand instead of results"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Love CARE", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Jan 2021", "job_title": "Manager in Atlanta, GA", "duration": "N/A", "pros": "Great organization to work for if you are focused on humanitarian", "cons": "None at this time. Love it"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "International", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Feb 2021", "job_title": "Monitoring and Evaluation Officer in Douala", "duration": "N/A", "pros": "Respect of values and principles", "cons": "long chain of reporting and implementation"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Ok", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Feb 2021", "job_title": "Specialist", "duration": "N/A", "pros": "Mission and vision second to none", "cons": "Diversity and accountability extremely lacking"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Large INGO Bureaucracy", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Sept 2020", "job_title": "Knowledge Management Intern in Atlanta, GA", "duration": "N/A", "pros": "All of the CARE staff I worked with are very passionate about their work and about making a positive difference in the world.", "cons": "Since CARE is a huge international NGO with ties to governments and corporations all over the world, their bureaucracy can be tedious and their organizational priorities are not always best aligned for bringing about real changes."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Would recommend", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Nov 2020", "job_title": "Program Officer", "duration": "N/A", "pros": "-such a committed team to work with\r\n-senior management and team/structure changes does cause anxiety", "cons": "-no major points to share"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome coworkers and programming, disconnected leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Oct 2020", "job_title": "Director", "duration": "N/A", "pros": "Awesome coworkers in the states and abroad, inspiring programs, benefits", "cons": "defensive and disconnected senior executives, lack of diversity efforts by senior executives, talks down to support staff, intense workload"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Excellent Organization", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2020", "job_title": "Writer/Researcher in Atlanta, GA", "duration": "N/A", "pros": "Feel good about helping to fulfill an important mission.", "cons": "Very silohed, with limited communication and cross pollination between teams."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Even the “best mission on Earth” doesn’t make up for bad leadership.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Some employees are among the kindest, most dedicated people I’ve ever had the pleasure to work with, and truly aim to promote CARE’s mission; good benefits.", "cons": "For as much as they talk about loving to promote from within, they are terrible at walking that walk (unless you’re a favorite of the team lead). There’s little to no option for personal professional development. Managers and supervisors are given literally no guidance on how to be good leaders, so forget about ever hearing anything positive about your work, but be sure to gird your loins should you do even the tiniest thing to make your manager look the slightest bit bad. Absolutely no clear line of authority means everyone sits around talking about ideas forever, but aren’t able to make moves until literally every other person in the organization has weighed in. Questionable allocation of funding means big money is spent to impress donors and expensive contractors are hired left and right, while layoffs are pending and lower level employees are paid like interns."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "n/a", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Oct 2020", "job_title": "Director of Programs in Atlanta, GA", "duration": "N/A", "pros": "great culture, people, and overall atmosphere", "cons": "no concerns but some bureaucracy"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great community and culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Sept 2020", "job_title": "Marketing Intern in Atlanta, GA", "duration": "N/A", "pros": "Nice people, interesting programs, good location, remote work possible", "cons": "Hierarchical in some ways. Not a standard 9-5"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Mission, Incompetent Management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Nov 2011", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "It's a great cause - helping to end poverty around the world. Most people are smart and passionate about what they do and are fantastic to work with. Benefits are very strong for a nonprofit organization.", "cons": "Senior Management lacks the ability to effectively and competently run the organization.  During my four years there, we went through five staff restructurings, two of which were organization-wide and included large layoffs due to financial troubles (not economy-related, but mismanagement).  They keep shuffling things around below them in the hopes that it will make things run better, when in fact, they should be looking at themselves to see how things could be improved starting at the top.  In the last round of layoffs, they made attempts to involve the staff in the decision making process, but that only resulted in higher anxiety and lower staff morale for everyone.  Until the Senior Management changes and they get their financial situation stabilized, I would not recommend working for CARE USA."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great mission, terrible leaders in U.S.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jul 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Although I do believe that development/humanitarian organizations are quickly becoming obsolete, this organization has a wonderful mission and passionate employees who are some of the most amazing and intelligent people on earth.", "cons": "Executive leadership is a  bloated, top-heavy, incompetent, self-serving mess.  Financial mismanagement, abysmal diversity, and non-existent accountability.  There have been many rounds of layoffs over the past year with no end in sight, and somehow, leadership has been completely unaffected.\r\n\r\nThere are few opportunities or pathways for advancement - in many roles, you can expect to be a lifer with no promotion or salary change, even when you consistently perform and exceed goals. \r\n\r\nWhere is all the money going? I'm no financial savant, but I'd glance in the direction of executive salaries - it's obscene.  Maybe if the CEO took a moment away from planning her next Senate or gubernatorial race, she'd better understand how terrible a job she's doing and how ineffective her leadership team is."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "One wonders about the true priorities of CARE USA's management team", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Apr 2018", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "Good benefits, unquestionably honorable mission, great field staff.", "cons": "In the past 2-3 years, the Executive Management Team (reporting to the CEO) has doubled in size.  This top-heavy suite includes highly paid floaters with opaque roles, a surge of Washington DC Democratic Party stalwarts, and the expected tossed salad of new ideas, initiatives and champions.  A propensity for flashy initiatives that play well in the media but deliver questionable impact for the people CARE serves, and a disquieting disregard for fiscal sensibility belies a management team driven by short-term rewards – just enough career burnishing to bridge a return to politics with the winds shifting left.\r\n\r\nWith a few exceptions, the next layer of senior management doesn’t inspire higher confidence.  The latest backstabbing catty tactic or in-your-face unprofessional outburst pepper the daily musings of the hapless around the water cooler.  As such, turnover has been accelerating and this is key – it is turnover of valued, skilled employees.  Recruiting fresh new talent is one thing – exchanging high-performing people with less-than-competent replacements is a sure-fire way to accelerate the rot from within.\r\n\r\nThere continue to be highly talented & industrious individuals working at CARE USA.  Sadly, these individuals are becoming isolated within a core culture sorely in need of honest self-assessment."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "If you're smart, motivated and results driven, CARE is NOT for you.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The most inspiring mission you could ever ask for.\r\nTerrific partners in the corporate and philanthropy world.\r\nDecent pay for a nonprofit. But don't expect to advance or ever get a raise.", "cons": "Lack of talent - people who don't do their jobs and aren't accountable for results. \r\nThere's so much internal politics and people who aren't necessarily qualified to do the job but have been at the organizations for years and decades. It's so sad to see such an amazing organization be so self destructive. \r\n\r\nCo-workers get too territorial because they are worried about losing their jobs since they do nothing all day.\r\n\r\nThere is absolutely NO room for career growth or even a chance to try something new."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Dysfunctional, Ancient and Blind", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Economic and social programs are helping women and children in many countries (outside of the US).", "cons": "Complete dysfunction in the Atlanta, GA office. Individuals are constantly under prepared to do the work that is expected (lack of communication, lack of resources, withheld information, etc). Clear expectations are rarely set. Many staff members work in fear of not meeting their goals. Getting things done quickly is more important than done correctly and with quality. There is a huge lack of accountability across the organization. You are not properly prepared to handle uncomfortable or unfamiliar situations in countries you are required to travel to. There is absolutely not enough focus on the overall wellness of staff members. BURNOUT. There is a tremendous amount of focus on pleasing tenured leaders who Speak the Loudest. Some of the most senior leaders have their own agenda to push; rather than promoting the success of their team members. Many of the promotions, new hires, and transitions are based on favoritism instead of the most qualified. Unfair internal practices exist that are extremely embarrassing. So much more could be said. CARE USA is the worst employer I have ever worked for in my career."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Good exposure to programmatic work in global health however definite management issues (not just at higher levels)", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2012", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Great exposure to extremely important work. CARE has a solid history working for a great cause. People are passionate and good to work with. Room for learning new things.", "cons": "Poor professional etiquette in managing people - leads to a loss of integrity and is often reflected by a lack of confidence and trust in management (not only higher-level executive management). \r\n\r\nAny pride you have to work with as part of an organization that does this great work ends up being tainted by the effects of poor management and many unfulfilled words.\r\n\r\nSeems to have serious issues retaining talent and nurturing growth of employees. \r\n\r\nMiddle management comes across insensitive at times to their employee's situation aggravating already high-levels of job insecurity and anxiety. Overall, CARE USA has had better days, would recommend looking to organizations that can offer a more stable working environment and greater sensitivity to better weather these already uncertain times."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "CARE USA", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Sept 2010", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "CARE USA is a great brand and is respected for the work that they do for women and girls. I also like Helene Gayle. She's been a great leader for the organization.", "cons": "The downside had to do with HR's senior managers. They're not the competent and it can be frustrating at times. Because they're no outside people to communicate your frustrations to and hopefully get results. I worked in HR and there were always drama as well as poor management by the senior managers in that department. It was also felt and communicated by employees who did not work within HR. They really need to rehab their HR department, starting with the Senior VP of HR and her managers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Heartbreaking to see the org fail time after time", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Mar 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CARE has a lot of pros. There's good time off, schedule flexibility, and a descent benefits package. Smart, dedicated people work at CARE.  The mission is excellent and CARE seems to excel at it's work abroad.", "cons": "The main challenge is that leadership has failed.  CARE's leadership can't seem to get the organization on firm footing and has basically thrown in the towel, hoping to save it by slimming down to next to nothing by 2020.  That means, if you aren't already working at CARE, don't start now.  You're likely to find yourself in a temporary position, even if it's not advertised that way.  Most of the old timers at CARE USA are gone, voluntarily or not, along with all their ideas, knowledge, and non-profit know how.  Those who have stepped in to replace them aren't meeting the monumental challenges before them, which would be hard for anyone to do."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Incompetent leadership, great people on the ground", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Oct 2019", "job_title": "Technical Advisor in Atlanta, GA", "duration": "N/A", "pros": "-staff are great and passionate \r\n-work actually makes a difference", "cons": "-CEO and leadership don’t know what they are doing and aren’t moving  the organization in the right direction \r\n-poor decision-making at the highest levels impacts those doing the work but there’s no accountability up top\r\n-no diversity in leadership,  there are few minorities in leadership positions and it doesn’t seem they care enough to change\r\n-CEO  continues to hire people without experience in the field which she also doesn’t have and it’s Leading the organization in the wrong direction"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Tragic to see the state of this NGO", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Nov 2013", "job_title": "Technical Advisor in Atlanta, GA", "duration": "N/A", "pros": "It's CARE - formerly one of the best international NGOs to work for! The staff that do remain are great and a pleasure to work with - both at HQ and in the field.", "cons": "Constant reorganization. Develop a clear vision of the future and work toward that. What is it that CARE wants to be? Humanitarian response? Focused on women and girls? Focused on poverty reduction? Instead, numerous consulting firms are brought in to revamp this vision. It's sad - they split up technical areas to then only merge them back a year later. Or, they lay people off only to rehire them in a few months because they've lost all the capacity in a certain area. If they would map out what they wanted, they could eliminate the back and forthing that erodes staff confidence in management."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "10 years of service to an organization that didn't deserve it.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "24 Jul 2013", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Wonderful mission that has helped countless people across the world for decades.", "cons": "Two words: Senior Management.  They are nearly incompetent at running a large business, they squander money (the result being at least 5 rounds of non-strategic layoffs), they spend most of their time traveling at donor expense, they provide no real leadership, and they cover up VERY sever problems within the board and executive leadership (the sort of problems that would have resulted in major PR issues and reporters asking questions)."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Roller coaster through a tough economy", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Sept 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission is what invigorates a lot of people about CARE USA. Reading reports on progress and projects is uplifting and hopeful, even if you're not in the field; when you read the reports, you know you're doing good work.  There are dedicated experts in both the field work, programatic planning, and support services.  CARE Is dedicated to a core set of values.", "cons": "There was a lot of forced fun when I worked there during a down economy. It didn't help anyone to be forced into \"fun activities.\"  The bureaucracy was difficult to navigate at CARE.  Most of senior management shoulder blame for problems, but that begs the question, why are there so many senior management team members resigning?"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Unprofessional supervisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Sept 2018", "job_title": "Entry Level in Manila, Manila", "duration": "N/A", "pros": "The coworkers were approachable and really helpful.", "cons": "I was put under a supervisor who would shout at us like children and slam laptops. It was a highly stressful job due to the high demand of hours but it is no excuse to act unprofessionally and subject your subordinates to abuse. The higher manager of the department refused to handle this supervisor probably because of the deadlines but the result is that the turnover of candidates under this supervisor is high and the ones that remain are only there for their own benefit in the time being."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "You need to have a good supervisor", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jul 2019", "job_title": "Manager in Port-au-Prince", "duration": "N/A", "pros": "There are good supervisors if you are lucky enough, free coffee every morning, year end holidays, annual staff event..", "cons": "People get promotions based on performance only. They do not systematize the holistic individual. You will see people with bad behaviors grow and become powerful in the organization. This does not motivate staff and many valuable talents leave because of this.  I do not generalize, it may be different in offices elsewhere."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Go to CARE only if you want to be a lifelong employee of non-profits. Excellent place to intern in too.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I liked the fact that CARE USA allows for a good work-life balance. They have a business casual feel to them, inspite of being a very professional organization. They care to make a difference and they so.", "cons": "The only downside to work in a non-profit is that if/when you want to branch away to a \"for profit\" organization, their perception is that potential employees have not \"cut their teeth\"."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Lost their way", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Sept 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Committed staff, good programs, tries to do a little of everything. People work hard and CARE has a name that stretches back years and years.", "cons": "Leadership is very weak and has time and again demonstrated a lack of listening and a lack of direction. Decision making is opaque. The past 3-4 years there has been huge turnover and many staff have either been let go or left on their own--the organization is drifting."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Chaos at HQ", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jun 2019", "job_title": "Senior Manager in Atlanta, GA", "duration": "N/A", "pros": "Mission. Quality of country office programming. Dedication of people.", "cons": "HQ is a disaster. CEO still not capable; can't make decisions; chaotic and it is getting worse all the time. CEO does not appear to genuinely appreciate the people that get the work done or care to know anything about how it gets done. Constant change without a thoughtful path or helping employees see how to be part of the change. Treated like a cog. Also: No accountability at the executive level and spending money like it's growing on trees."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "OK, but could be better.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "30 Dec 2015", "job_title": "IT Department in Atlanta, GA", "duration": "N/A", "pros": "CARE can be a great place to work depending upon department and manager.Benefits, time off, 401K.", "cons": "Work life balance nearly destroyed, used to be much better. The indecisiveness, inappropriate behavior by some colleagues, and outdated technology presents some obvious challenges. There is little to no career advancement, and often times a dead end in a position.  Over 5 rounds of layoffs and furlough have created a low morale and distrust with many employees, management, to the board. Constant reorganization and vision change of course has created a culture of instability and fear in various areas."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great organization with fading reputation", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Aug 2011", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "The mission.  The possibility to help people around the world lift themselves out of poverty is what attracts anyone to CARE.  On your best day, you can make a difference in the lives of people who desperately need a hand up.", "cons": "CARE has not invested in its people.  It rarely promotes from within, leaving staff feeling as if their contributions are not valued.  While salaries are fair, salary increases once inside the organization are very hard to come by.  Poor managers are not held accountable, and promotions are rarely based on management ability."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "It's a crap shoot!", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Jul 2015", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "The work-life balance is great for many of the departments. We recently have a new CEO so there is some hope for internal improvements to take place.", "cons": "Staff morale is pretty low. There isn't a lot of room for advancement once you get your foot in the door. Nepotism has become a way of life for some departments, again leading to low morale. A lot of really great, dedicated people have left which is disheartening."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Dazed and confused", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Some wonderful, thoughtful, hard-working, creative staff devoted to increasing social justice and eliminating poverty.", "cons": "New leadership over the last 2 years has resulted in total confusion about organizational identity and mission, huge deficit, lack of accountability...a runaway train.  The best staff are leaving, the worst are staying, and the leaders either don't understand their jobs or are not willing to take responsibility."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Good place but unstable with financing.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Mar 2013", "job_title": "Senior Technical Advisor in Atlanta, GA", "duration": "N/A", "pros": "The work environment to me was casual, flexible hours, caring people and my supervisor was never there so I had autonomy to be creative n my work.", "cons": "Leadership slow on decision making, excessive spending with no innovations. A lot of sending in travel and not using technology to save donors' funding. Executive Management in some areas always traveled and did not have second in command so not vision was set."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poor leadership structure", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Big, exciting, compelling vision — this was my ultimate drive during my entire stay with the organization", "cons": "I don’t relish revisiting the cons but I want to supplement the previous negative review. \nSo here’s what’s killing the org:\n\n1. Poor org structure and role distribution; ambiguous policies and IT processes\n\n2. No definite career development plan. Promotions are usually offered upon resignation. Go figure.\n\n3. Alarming attrition rate; yet still no retention plans (up until I left the org, not sure now)\n\n4. Flexible work option (remote work, shift schedule) is selective, and criteria for eligibility is not explained nor justified. Certain staff members are allowed and some are not. Favoritism and politics are abundant.\n\n5. The Director and HR (yep, Human Resources) are prone to rationalizing unethical behavior by supervisors.. Rather than addressing a recurring attitude problem, they let it slide. I’ve heard supervisors getting sassy and condescending most of the time and getting away with it just because. Heck, I’ve even heard the HR talk down a fellow HR member via email, and in person. Yikes!\n\nThe list goes on. I drain myself just by typing about it. I had a few good months with the company but overall, I can’t find a reason to go back or even recommend them to others. I’ve seen A LOT of great talents leave the company, and the company didn’t seem to CARE (pun, yup)."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great mission, Under managed and underpaid organization", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The mission, the benefits, the travel, the low cost of living in Atlanta. There are some very smart well meaning people there. It is also a very culturally diverse workplace.", "cons": "Upper management has the reputation of being incompetent and yet no one is ever accountable for any failures. They have had a lot of lay offs in recent years and seem to be a shrinking organization."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "CARE USA has great possibilities to make a difference.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "28 Jun 2012", "job_title": "IT Director in Atlanta, GA", "duration": "N/A", "pros": "Great mission and vision for improving lives of women/girls and others in third-world countries through development as well as relief activities; teaching them to help themselves.  President Helene Gayle has good ideas and vision.", "cons": "Can be political and ability of individual contributors to be successful can be limited based on who you know.  President Helene Gayle needs more support at executive level to run organization and free her up to do what she does best; advocacy and fundraising."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Finance Director", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CARE is one of the organisations that has truly embraced diversity to the letter, from HQ to the field offices.  I have known CARE with a culture that takes into account everyones view as far as is possible. CARE offers good professional growth and learning opportunities. The organisation is open to change. CARE pays relatively well.", "cons": "Sometimes the good efforts and performance of country and project staff often shadow the work overload they put up with to get the high standard results."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "A very positive experience when I first started, but increasingly disappointed with the way the NGO is run", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "11 Feb 2014", "job_title": "Program Coordinator", "duration": "N/A", "pros": "Competitive salaries and benefits, although these will probably be trimmed down in the future (and that makes sense for an organization dedicated to eradicating poverty and social injustice). \r\n\r\nEnjoyable, casual office environment. Most of my colleagues and supervisors over the years were easy-going with a good sense of humor. Most of them were very hard workers.  I always felt I could offer critical feedback to my superiors--speak my mind--without being concerned about the effect on my job security. \r\n\r\nIf you stand out as a \"star\" employee, CARE will offer you excellent professional development opportunities (training, workshops, travel, temporary duty assignments...)", "cons": "I was very satisfied at CARE when I first joined over 10 years ago, and inspired by the thinking that was happening in the organization at both HQ and field levels. But now CARE is struggling to find itself, to identify its priorities and relevance, and to remain focused and competitive in the changing aid environment. Too many changing priorities and approaches; not enough results and applied learning; field staff increasingly frustrated and burned-out. \r\n\r\nI worked many years in a Country Office that would almost *never* walk away from a funding opportunity, even if the funds weren't aligned with the Office's strategic directions, and even if we didn't have the right human resources for the project -- there was always a way to justify going after the money. I know of several examples of employees being promoted and/or acquiring a lot of power within the organization/their teams largely because of their ability to raise funds and tell a good story to CARE's donors, in spite of serious weakness in their people-management skills, respect of diversity, and integrity.  \r\n\r\nAny talk of improving work-life balance is not taken very seriously at field level. There is an unspoken expectation that employees will work nights and weekends, and the more capable and available you are, the more CARE will ask of you. I would have felt a lot better about putting in the extra hours had I felt that by doing so I was helping contribute to greater program impact and accountability to \"beneficiaries\". But most of those hours were spent chasing funds and introducing new initiatives from HQ.\r\n\r\nAll that said, I found there to be a lot of variability between Country Offices (some places better run than others and by more skilled leaders). However the changes that CARE is undertaking from the highest levels of the organization down make this a challenging time."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Doesn't invest in talent/Only friends get promoted", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Jan 2017", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Fantastic mission, great organizational culture, salary wasn't bad, lots of great staff", "cons": "Most management plus positions go to white people with the \"lowest\" positions almost entirely held by black people\r\n\r\nFor some reason they refuse to nurture in-house talent."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "CARE is a decent place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 Oct 2017", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "Casual environment, flexible work schedules, benefits package includes 20 vacation days for new hires", "cons": "Too many executive and senior managers, strategic direction is not clear to staff, accountability is virtually nonexistent, lack of diversity, especially in senior and executive positions"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Amazing mission derailed by poor leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 May 2012", "job_title": "Human Resources in Atlanta, GA", "duration": "N/A", "pros": "*  Mission\r\n*  Diversity of staff\r\n*  Work life balance\r\n*  Benefits\r\n* Global scale of work\r\n*  Colleagues are motivated", "cons": "*  Poor leadership\r\n*  No accountability for results\r\n*  Managers missing basic tools to lead and motivate staff\r\n*  Mission is too broad in too many countries"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good place to learn many cross cutting issues.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Apr 2011", "job_title": "Grants Management", "duration": "N/A", "pros": "Recognize diversity, good compensation, some grea polices on personnel. Networking is strong, and good reputation in donor community despite some mis management at field level.", "cons": "Lace of tranprency at filed leve, redruitment process is not outstanding. Delay in management level decision making. Wide range of compensastion benefits beween and naional and international staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A once great organization plagued by management and financial issues but striving to fix", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jan 2012", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Great brand, wonderfully dedicated and talented professionals. Commitment to helping women and girls. Great country programs.", "cons": "Serious flaws in upper level management; low staff morale after recent layoffs and subsequent exodus of many talented staff (which is being addressed)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "CARE is leading on all fronts-inspiring place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jun 2020", "job_title": "Director in Atlanta, GA", "duration": "N/A", "pros": "CEO-she has lead brilliantly through COVID-19 uncertainty and gotten the organization to step up as a leader in racial justice. \r\nInspiring, team-oriented peers-fantastic to work with. \r\nOrg is much more nimble and agile than I imagined. \r\nMission can’t be beat-very worthy cause with dedicated staff around the world making it happen!", "cons": "Organization is lean; people work really hard to get the job done-be ready to put in long hours at times!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "You can be very good at your job but you need to be aligned with certain individuals to succeed.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CARE has a niche on working with women and girls and is really good at it.", "cons": "A few individuals at the top regional management are horrible and lack soft skills to deal with staff. Its either their way or the \"highway\".  \r\nHR is non existent ( not empathetic to staff) and archaic"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Finance Director", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "28 Jan 2018", "job_title": "Director of Finance in Abidjan", "duration": "N/A", "pros": "Ability to produce strong result using personal capabilities and knowledge in both English and French. It gives also fulfillment to be able to serve at all levels of financial responsibilities in my organization", "cons": "I have to work under stress and achieve results, this has impacted on my health. Duty travels are also very challenging some times when the assignment takes you to disaster prone areas like EBOLA declared countries at the time."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great organization and mission, horrible senior management", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "16 Jun 2020", "job_title": "Senior Director", "duration": "N/A", "pros": "True to the cause, fantastic field offices (most of them), professional staff, select dedicated teams across the organization", "cons": "Lack of accountability at the executive level, lack of responsibility and management, low value for money, mostly political appointees with no interest and dedication to the cause"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great mission but needs realignment to streamline how it works", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "A great mission with committed staff.", "cons": "Lacked leadership on key management issues, was very hierarchical, personality-driven, and uncommitted to supporting external partnerships."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Regional Finance", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Apr 2016", "job_title": "Regional Controller in Nairobi", "duration": "N/A", "pros": "Good organisation with set systems structures and policies on about everything. Employees are empowered. The most diversified workforce I have ever seen in any one organisation. Good learning opportunities. Good employer and benefits.", "cons": "A heavy workload and travel schedule that needs to be balanced. Organisation has been changing. Constant restructuring of departments and regions sometimes causes loss of good talent."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "If you want to change the world and help people everywhere, this is a great place to start.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Aug 2014", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "This is a great organization to be a part of.", "cons": "Depending on the role you play, you might feel cut off from what is going on on the ground."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great organization, needs to improve processes", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 May 2018", "job_title": "Program Staff in Atlanta, GA", "duration": "N/A", "pros": "- Great mission\r\n- Talented people\r\n- Great atmosphere, friendly, supportive peers\r\n- Name recognition and appreciation in the industry\r\n- This organization really does great work", "cons": "- Needs more processes, lots of double effort, lack of clarify, ad hoc decisions\r\n- Currently soul searching and re-structuring, future is unclear"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Best mission on Earth", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "6 Feb 2019", "job_title": "Executive Director of Development in Chicago, IL", "duration": "N/A", "pros": "Great mission, great and smart people, changing the world and saving lives.", "cons": "Very bureaucratic, sometimes unrealistic fundraising goals, high pressure."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Sr. Emergency Response Manager - Team Leader", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 Nov 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Great people, love the work and commitment to making a difference in the communities we serve", "cons": "Paid in canadian currency so salary is low due to currency exchange and terrible benefits as a result"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "The future is bright?", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission of the organization and the commitment of its workers are inspiring and cover up a lot of the cons.", "cons": "The current DC-bred executive team doesn't understand how to run an organization with little to no flexible funding.  This organization is in desperate need of a new, simpler vision that can be executed by a smaller organization, not expensive ex-DC staffers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great potential but falling short", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Aug 2020", "job_title": "Programs", "duration": "N/A", "pros": "Colleagues that lead work in the field are amazing. Tremendous reach around the world. Focus on solving important global issues.", "cons": "Struggles with colonialist approaches at times. Does not value or celebrate diverse voices or perspectives. Salaries are wildly inconsistent and not based on merit. If you previously worked at Points of Light you will be treated better overall and have better luck with salary negotiations."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Leadership at the top is almost non-existent", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Aug 2013", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "- Great benefits packages - PTO packages great.\r\n- Flexible Schedules\r\n- Relaxed Environment - casual business attire, friendly environment\r\n- CARE's mission makes coming to work worthwhile.", "cons": "- Lower pay compared to marketplace\r\n- Raises are not guaranteed (none in the last 5 years)\r\n- Very little opportunity for career growth; almost no promotions from within the company\r\n- Layoffs every other year lead to dissatisfaction among employees"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "The work was great.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jul 2011", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Was given free rein to create and run programs that filled a major need with the organization, its supporters and beneficiaries.", "cons": "Under went its 2nd restructure in as many years, wasn't well thought out."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great mission, but more internal development needed", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great, talented people to work with, quality development and relief work, decent salary and benefits", "cons": "Leadership decisions often lack strategic direction. Too many external \"friends\" hired in senior positions, very top heavy, practically no development or investment in internal staff"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "CARE USA is an easy place to work but you must be up on your social game in order to progress.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The mission of CARE USA are amazing. There are many HR lead seminars to grow your skill set.", "cons": "There is alot of catty ness when dealing with different departments"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "CARE should be better than it is", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Wonderful, inspiring mission a handful of phenomenal colleagues.", "cons": "As others have noted, the bureaucracy is difficult to navigate, particularly if you're not located in HQ. Many poor management decisions over the years have created a host of financial problems. There is little to no room for growth and a few colleagues are shockingly horrible."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not good went through two layoffs in two years and one furlough.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Sept 2011", "job_title": "Executive Assistant", "duration": "N/A", "pros": "4 weeks holiday, not including sick days.\r\nGood 401 K match.", "cons": "Financially unstable.  No pay increase in 5 years.  Lay-offs about every 2 years.\r\nLack of ethics and compliance for  RFP process and vendors.\r\nLack of ethics, compliance and oversight for staff evaluations."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Values misplaced", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Jun 2012", "job_title": "Executive Assistant", "duration": "N/A", "pros": "Good 401K plan, vacation, sick, and maternity leave pay.", "cons": "Many managers are not management material. They are placed in management positions based on who they know. The atmosphere feels hostile."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Mixed Bag", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great international experience and interesting people who want to positively impact the world around us. CEO is an inspiration willing to take risks on bold ideas.", "cons": "Homogeneous, insular workforce at the headquarters (white) - this leads to top-down (authoritative) decision making, group-think and sclerotic/anachronistic outcomes that result in an overall diminution of global impact and relevance."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "mostly well-run nonprofit", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 May 2010", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "well-run nonprofit with low overhead - however, that's not so great if your salary is paid by overhead. Great benefits, great mission", "cons": "Some members of the executive management team are not suited for their jobs"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "HR", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Jun 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Overall great benefits including work/life balance. Opportunity to interact with a global workforce.", "cons": "Limited growth opportunities for all employees. Very bureaucratic and takes a long to time to make key decisions. Instability over the last 8 years."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Treasury Analyst", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Company does great humanitarian work for international causes.  The company is very diverse.", "cons": "There is no opportunity for growth in the company and the systems and process is archaic."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Employees and Good Work Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Employees are great, mission-driven, dedicated and effective.", "cons": "There is a decent amount of change occurring right now, which has affected morale a bit, but overall I believe this change will help to strengthen the organization."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great humanitarian org", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Working with fun and dynamic people and grassroots initiatives; medical and life insurance benefits; opportunity for domestic travel to project areas", "cons": "No breastfeeding area for women employees with children; average compensation package which is not commensurate to the amount and of work given; no regard for work-life balance"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Not a great place for IT professionals", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jan 2010", "job_title": "Senior Technical Analyst in Atlanta, GA", "duration": "N/A", "pros": "Benefits, Benefits, Benefits!!! Their time off policy is very unique.", "cons": "No work life balance as a 2nd level IT professional. Expected to sacrifice family for work because this is an International company that thrives on third world work ethics."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Direct support professional", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Jun 2015", "job_title": "Direct Support Professional in Perry, GA", "duration": "N/A", "pros": "Enjoy chosen profession, with true care to improve the quality of life of my client and family.", "cons": "Getting older in years. But still vey playful a heart."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Intern, Policy and Advocacy Unit", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Wonderfully dedicated and professional people, many of whom have opted for less pay in order to work at an organization with a mission they care about.", "cons": "Large NGO life problems; lots and lots and lots of meetings about doing work, but little time to actually work; loose management structure."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "good intentions", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "lots of new innovative stuff happening, big bold ideas to move toward future", "cons": "some basic systems are broken that are minor, but when added up lead to daily time waste and frustrations (HR recruitment delays, time/activity reporting, accounts payable...)"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Prejudiced and believer in Ableism", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They have a wonderful mission that needs to be implemented and have a great external image and programmatic work", "cons": "Internally CARE is prejudiced at nearly all level from supervisors to Vice Presidents and the Board. They are ableist and do not know how and even refuse to give employees with disabilities assistance and resources in order to be successful. Despite telling them personal needs, they were refused."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Exciting place to work while at the same time disappointing", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Oct 2015", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Mission driven, interesting work, diverse staff, strong brand", "cons": "Decisions take FOREVER, there's too much \"maybe\", difficult organizational culture that needs a lot of work, especially around accountability"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great company, terrible HR.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Oct 2017", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Great coworkers, great environment,  excellent lower level management, good benefits.", "cons": "Very weak HR. No orientation was received. HR accusations are one-sided, be prepared to be accused of something and getting fired before explaining your side and without a proper process being followed."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Huge mess", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Dec 2018", "job_title": "Programming in Gaziantep", "duration": "N/A", "pros": "Good opportunity for networking, have chances for trainings, easy to find life balance and enjoy your time with them", "cons": "Very weak management structure in Middle East, favoritism, poor monitoring or accountability to donors or beneficiaries. Very weak HR handling."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I've been privileged to work for CARE for over 15 years. I would do it again in a heartbeat.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "24 Jan 2020", "job_title": "Senior Director of Technical Operations in Atlanta, GA", "duration": "N/A", "pros": "Great and mission driven organization fighting poverty at the global level. Great and dedicated people", "cons": "Some rough waters as we are trying to reinvent ourselves to be  21st century company"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "My direct manager was awesome!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Feb 2013", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Benefits and salary were okay.  When you were sick, you were encouraged to stay home and get well.", "cons": "Mom used to say, if you can't say anything nice, don't say anything at all."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Overall great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A lot of opportunities, great to work with diverse people with a common goal of helping those who are in need", "cons": "A lot of change happening in HQ, instead of investing in human resources in the country offices. No work life balance"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Where is the accountability?", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "22 Nov 2013", "job_title": "IT Director in Atlanta, GA", "duration": "N/A", "pros": "Great people, specially in the country offices, very dedicated and committed to their work.", "cons": "A Board and executive management team that have lost the vision and mission."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "excellent , professional organization which values innovation creativity and reasoned dissent", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "flexibility , respect , value based organization , with significant de-concentration and decentralization of power", "cons": "corporate politics, retention of non-productive employees"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "So so, a little slow and self-reverential", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Apr 2014", "job_title": "Program Manager in Washington, DC", "duration": "N/A", "pros": "Inspiring social objectives; decent benefits; good travel opportunities", "cons": "Senior Management very poor; very high turnover of staff and strategic directions. Next to no internal growth opportunities."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great mission but not quite recommend", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Apr 2020", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Great mission and hardworking people with caring and warm heart", "cons": "Poor financial structure, leadership, and management. It's not easy to develop things differently even though they are in demand."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Senior Technical Advisor", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great HR Policies, Very relaxed work atmosphere.", "cons": "Poor management. Proximity to the bosses gets will take you far."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Working culture and general atmosphere", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Organizational vision; dedicated workforce; does some great work to help the poorest around the world", "cons": "Much like any other large organizations - politics takes precedence as you rise further up the chain, especially at headquarters"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great mission and vision", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Passionate people working for an inspiring mission.  \r\nGood benefits\r\nOrganization is supportive of internal growth", "cons": "Need stronger leadership to be able to successfully meet our vision\r\nOrganization may be too supportive of internal growth(sometimes need external talent)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Area Coordinator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Jun 2015", "job_title": "Area Coordinator in Cairo, Cairo Governorate", "duration": "N/A", "pros": "good working environment due to lean organizational structure", "cons": "can also be a source of burn-out if over burden with too much work deliverables"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great Organization", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Benefits, Casual Environment, and Flexible Work/Life Balance", "cons": "Ability to move up in the company is limited due to longevity of employee in those positions"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Director", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Incredible mission with dedicated staff.", "cons": "They never fire anyone and it creates a poor environment for high performers."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great company, lack of good managers", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Aug 2011", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Excellent programs in the Country Officers", "cons": "Poor strategic direction, leadership is weak, managers are technical experts, do not know how to manage people"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The day I quit CARE will be the best day on the job.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2013", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "The mission statement is what kept me around for so long.", "cons": "Everything- senior management is really senior mis-management.  This is a \"burn and churn\" factory"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Good work experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "5 Jun 2014", "job_title": "Manager in Atlanta, GA", "duration": "N/A", "pros": "Staff people are very motivated and dedicated to the mission.", "cons": "Working through reorganization is sometimes a challenge."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "General Admin. & Procurement Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Aug 2015", "job_title": "General Administrative & Procurement Manager in Nairobi", "duration": "N/A", "pros": "Very strong systems in the INGO world.  leader in policies and procedures", "cons": "The remunerations for local staff isn't as competitive and that of other INGOs"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Health and Nutrition Specialist", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 May 2018", "job_title": "Health and Nutrition Specialist in Borena", "duration": "N/A", "pros": "Humanitarian organization tackling health and nutrition problems", "cons": "Low staff benefit for those working at remote area"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Okay but not amazing", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Jul 2020", "job_title": "Program Manager", "duration": "N/A", "pros": "Great coworkers, decent benefits and pay for the sector, mission-driven organization", "cons": "Lack of vision, limited opportunities for growth, lack of transparency from senior management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Project Coordinator", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Sept 2014", "job_title": "Project Coordinator in Nairobi", "duration": "N/A", "pros": "The organization has excellent working conditions and good staff development policies.", "cons": "Working in conflict and post conflict areas can be stressing at times."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Intern", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Very open and welcoming group of individuals", "cons": "None thus far, if any i'll add more."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Dead End", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice dedicated and smart people.", "cons": "Lack of career opportunities. Frequently wastes human resources and time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Wonderful organization with a strong mission.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CARE has a compassionate mission that attracts dedicated employees.", "cons": "There is limited career advancement."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "GIS and Data management", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Dec 2016", "job_title": "Data Management Specialist in Addis Ababa", "duration": "N/A", "pros": "Work freedom and great transparancy", "cons": "Lot of  field work in very remoteareas"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Global Human Resources - Latin America & Caribbean", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Oct 2018", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Great Global Non Profit Organization", "cons": "Funding can be tough to find"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jun 2017", "job_title": "Technical Advisor in Atlanta, GA", "duration": "N/A", "pros": "Awesome people: committed, smart and creative.", "cons": "Honestly, nothing comes to mind."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Aug 2020", "job_title": "Director", "duration": "N/A", "pros": "The people are great in the organization", "cons": "Workload is extremely heavy over time"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "network Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Apr 2015", "job_title": " in Atlanta, GA", "duration": "N/A", "pros": "Great 401 K plan\r\nGreat environment", "cons": "I don't recall something that could be mentioned"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Program Officer", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Dec 2015", "job_title": "Anonymous Employee in Atlanta, GA", "duration": "N/A", "pros": "Large organization, great benefits.", "cons": "in Georgia; organizational culture could be better"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "nice people beautiful benefits", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Apr 2020", "job_title": "Humanitarian Assistant in Chicago, IL", "duration": "N/A", "pros": "good salary , nice people, great benefits", "cons": "nothing I can think off"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great working environment, great coworkers", "cons": "None that I can think of"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Security Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Strong support and guidance support", "cons": "Too much bureaucracy to work with"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Positive", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 May 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great working environment and good opportunities for growth.", "cons": "Potentially high work loads affecting work-life balance"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "opearations", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits and fair salary", "cons": "work load increases, pay does not"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Solid company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Apr 2020", "job_title": "Program Manager in Atlanta, GA", "duration": "N/A", "pros": "Large solid company, decent pay", "cons": "Power consolidated at the smt"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "More like DONT CARE", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great mission, majority of coworkers have good hearts.", "cons": "Poorly allocated funds, little to no communication, incredibly inefficient with time and money, no compassion/understanding towards employees, wasteful"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Nope", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2020", "job_title": "General Manager", "duration": "N/A", "pros": "Salary and benefits are ok", "cons": "Outdated programming. Breathtaking lack of accountability and basic competence across the organization. Federation adds no value. Lack of trust and support."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Organization to work for", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Dec 2018", "job_title": "Program Assistant in Atlanta, GA", "duration": "N/A", "pros": "Good benefits for full time and part time employees", "cons": "There are absolutely no benefits for Interns"}]]