[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing people, amazing org", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 May 2021", "job_title": "Team Leader in Pune", "duration": "N/A", "pros": "Loved every second of working there! The people made it great :)", "cons": "Looking back, very hard to think of any cons"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Epic Growth, Excessive Uncertainty", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jul 2018", "job_title": "Program Coordinator in Pune", "duration": "N/A", "pros": "The company culture thrives around the the experience of the Fellows themselves, and tends to attract an amazing clientele of young leaders and curious global citizens ready to explore the world.  \r\n It has a young and experimental vibe- there is lots of enthusiasm as the firm expands and refines its product. The organization is extremely vocal about why we do what we do, exploring and refining quality at every step of the way- it is a great way to get familiar with Design Thinking and building the bridge year movement from the ground up. \r\n\r\nIt provides great training and travel opportunities internationally and locally, and exposure to students and situations of all kinds.  It will provide great insight into experiential education and intercultural adaptation, emergency response and the international workplace.", "cons": "Practically speaking there is little security in terms of your position expectations or day to day tasks. The firm is attempting rapid expansion and the workplace is highly chaotic and unreliable in terms of what it can promise employees for the year, let alone a longer career.  \r\n\r\nAlthough they try to focus on highest quality student experience, they have yet to refine a lot of the baseline logistical and internal processes at the firm.  Your job may regularly ask you to move, change roles or tasks with minimal training and in a fast paced work environment.  This refers to location, compensation, colleagues and work-life balance. \r\n\r\nThe Communication and feedback model between the US based headquarters and various field staff is yet to be fluid and effective.  \r\n\r\nThe turnover can be fast-paced meaning that it is rare to meet someone truly experienced who has been around long enough to support a stable company culture and work environment.  \r\n\r\nAt times there is a lot of talk about ethics and values- which is great; but at times lacking is practicality, and this can be extremely frustrating and exhausting when already working in a chaotic working environment."}], []]