[[{"date": "7 Jul 2023", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Two rounds with two interviewers each. One more senior than the first. Questions were entirely fit related, and focused mostly on thinking about career transitions. Surprisingly a very standard, one-way interview (with one or two awkward pauses while they figured out who was asking the next question), rather than an assessment masked as a conversation between people. One of the senior interviewers started smirking through one of my responses at the end, which wasn't incredibly respectful coming from a group that prides itself on incredible integrity and personal cohesion within the team.", "Interview Questions": "What factors drove x career transition? Can you tell us about a challenging time and how you dealt with it?"}, {"date": "12 May 2023", "title": "Math Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Had to fill out a written application, then had an interview process with one of the lead coordinators. The interview was over Zoom. Friendly environment. Questions were mostly behavioral. Was asked about specific concepts and content I wanted to teach over the summer.", "Interview Questions": "Why do you want to be an instructor? What courses do you want to teach?"}, {"date": "3 May 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "The initial interview was over the phone with HR. After that there were at least seven interviews with directors , senior directors, physicians, and AVPs. The entire process from start to finish took about 6 - 7 months to complete.", "Interview Questions": "How well can you interpret data and meet kpi goals?"}, {"date": "19 Apr 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Apr 2023", "Interview Descriptions": "It was very brief and informative. I learned more about the role and department in detail. The hiring manager was very pleasant and upfront about the expectations. It was overall a good experience.", "Interview Questions": "What are your goals in the next five years?"}, {"date": "28 Mar 2023", "title": "Casual Team Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "During COVID so whole process was via Zoom, email, and text. First interview was with three internal Yale managers. I was a bit confused as to who was actually hiring for the position I applied for.", "Interview Questions": "Previous work experience and working availability."}, {"date": "23 Jun 2023", "title": "IT Project Manager Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Yale University (New Haven, CT) in Mar 2023", "Interview Descriptions": "In the interview process, there are typically two rounds of behavioral questions, which primarily aim to assess an individual's personality traits and behavioral patterns. These rounds are designed to delve deeper into the candidate's character, values, and interpersonal skills, rather than focusing solely on technical qualifications. The intention is to gain insights into how the candidate might fit within the company culture and work effectively with colleagues and clients.", "Interview Questions": "Q: tell me about a time how you handled a project?"}, {"date": "21 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Phone interview, followed by zoom interview and then zoom interview with peers. HR handles all salary and benefits negations. Background check is a lengthy process. Interview process was around 2-3 months", "Interview Questions": "Tell me about your working style"}, {"date": "14 Feb 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University", "Interview Descriptions": "Upon initial resume evaluation, I then got to meet with the hiring director. This was amid COVID and the interview was with the hiring director. The interview lasted about 30 minutes.", "Interview Questions": "They were basic interview questions. They specifically wanted to know why I had chosen that particular department out of the other jobs available at the university."}, {"date": "20 Jan 2023", "title": "PhD Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview email was sent Dec last year. The interview schedule was sent at the beginning of this year. We made three 30-min interviews with 3 different PIs. The interview is held online through zoom.", "Interview Questions": "describe my research experiences; why school; why phd"}, {"date": "5 Jan 2023", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Yale University", "Interview Descriptions": "It took about a month to be contacted for an hour-long screening interview. Had an interview with a committee of four or five faculty, staff, and the director. Everyone was very gracious, well-versed in my materials, and pleasant. I was contacted two months later for an in-person interview. Met with several dozen support staff, directors, and other staff during a day-long interview. I was offered the job a month and a half later. It was a generally good experience, it just takes a long time because higher-ed moves slowly.", "Interview Questions": "What attracts you to this position? What are some initiatives and projects you could envision for promoting diversity and inclusivity?"}], [{"date": "27 Feb 2023", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Jan 2023", "Interview Descriptions": "The whole process took 3 rounds with HR, BU head and tech manager, and CTO. All went online. No difficult tech question. Everything went general. Emphasized humanity, WLB, and social impact.", "Interview Questions": "Tell me about a past SQL program you led."}, {"date": "13 Dec 2022", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Regular questions including something would not be easy. However, I like it. I hope you like it. Describe an instance where you set your sights on a high/demanding goal and saw it through completion.（", "Interview Questions": "Describe an instance where you set your sights on a high/demanding goal and saw it through completion.（"}, {"date": "17 Feb 2023", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Dec 2022", "Interview Descriptions": "Applied in October 2022, was contacted in early November for interviews. Over the course of the entire month and into late December I was invited to meet with many, many people from the department. Due to my needing to meet with so many individuals, the process took quite a bit of my time and energy. Also, no one really seems to be in a hurry even for internal candidates, so you will need to be patient and keep expectations low.", "Interview Questions": "General tell me about yourself or tell me about a time when questions. Nothing tricky or overly complicated."}, {"date": "21 Sept 2022", "title": "Communications Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I participated in an initial phone interview and was told up front that the process may be drawn out. I didn't hear back for about a month, when I was contacted for a second-round interview, which would have involved doing a presentation for a search committee. I respectfully withdrew my application at that time for personal reasons. My overall impression of the hiring manager was that they would have been a good, fair boss.", "Interview Questions": "Why I was interested in the role, why specifically that department, and additional questions about my thoughts about their current communications strategy as well as what might be improved."}, {"date": "13 Dec 2022", "title": "Active Directory Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Yale University (New Haven, CT) in Sept 2022", "Interview Descriptions": "I interviewed for this position twice once a few years ago and one fairly recently. I interviewed remotely with several people they seem to be more interested in someone who could pass a test instead of learning and growing into the job. I took the same online test twice. It generally asked obscure questions about specific command line arguments that you could look up in under a minute. I got another call from a recruiter, so they've posted it again. Not a good sign that they can't fill the position or people keep leaving.", "Interview Questions": "What command would you use to restore the default domain policy if it became corrupt."}, {"date": "19 Aug 2022", "title": "Admin Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Not as lengthy as one might expect at a large organization. A handful of interviews, verbal offer, offer letter, back-round check. Interviews can range in length depending on department. You work primarily with HR on salary and so on", "Interview Questions": "How do you work in a hybrid environment?  "}, {"date": "2 Aug 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Applied for fellowship. Got it. Nothing more to it than that. Of course, had to have some relationship building with the lab I would join. No actual interview was conducted.", "Interview Questions": "N/A"}, {"date": "5 Jul 2022", "title": "IT Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I uploaded my resume first first applying to an online IT internship application. Then it was followed by a series of interviews to place me on a team that fit my interests and skills.", "Interview Questions": "They asked me about the statistics projects I did. "}, {"date": "26 Jun 2022", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "This was for a Museum role - had 1 Zoom interview with fairly straightforward questions, but they were not your standard behavioral questions. They wanted to know more about how you see your work than details of your experience", "Interview Questions": "Why is it important that museums engage the public?"}, {"date": "20 Jun 2022", "title": "Clinical Investigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It was a 30 mins interview. The interviewer was really good and supportive. I was given a task of what I should do and what I should expect from the position.", "Interview Questions": "Tell me about yourself?\nWhat I can provide to the team?"}], [{"date": "13 May 2022", "title": "Administrative Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "The posted position was cancelled without notice following the interview. At the time, I received no feedback on the interview, although more than two weeks had passed, nor any useful information from HR on next steps. I expected better.", "Interview Questions": "What was my experience in a managerial role?"}, {"date": "18 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Two step interview process , one with the recruiter and once you pass that process you will be invited to for a second interview with the hiring team either in person.", "Interview Questions": "Tell me about your self?"}, {"date": "30 Mar 2023", "title": "Postgraduate Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Yale University (New Haven, CT) in Mar 2022", "Interview Descriptions": "The process is not as lengthy but it took me months to finalize the offer. They were very supportive and asked to send my cv, and once the cv was finalized I set up an interview with my supervisor who asked me questions and finalized the offer with the following email.", "Interview Questions": "technical questions, working habits. (Analytical questions) and the kind of person you are and what you would bring to the group."}, {"date": "4 Jun 2023", "title": "Biostatistics Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University in Mar 2022", "Interview Descriptions": "Short and very skills based and very to the point. They asked me questions on why I was interested in the role, about my previous statistical experience, my biostatistics skillset and previous coursework I have taken that was applicable to the research projects I would have been assigned to as a summer intern at the Yale Center for Climate Change and Health.", "Interview Questions": "Why are you interested in this internship? Do you have experience working with emissions data?"}, {"date": "19 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Yale University", "Interview Descriptions": "Was a very good interview.  I liked it.  People were nice.  Respectful.  I don't have any complaints about the interview at all at this time.  I liked the facilities, too.", "Interview Questions": "Tell me about yourself?\r\n\r\nWhy this position?"}, {"date": "16 Feb 2022", "title": "Senior Program Manager, Office of Postdoctoral Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "First-round interview via Zoom. It was a pleasant and cordial interaction. This is a new position. Only 3 questions. Plenty of time to elaborate.  I wasn't invited back for a second interview.", "Interview Questions": "Three questions asked. I don't remember one. But the other two were:  1) Explain ways in which you have developed and assessed programs; 2) How would you identify resources to use in this position?\r\n"}, {"date": "24 Feb 2022", "title": "Senior Regulatory Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University in Feb 2022", "Interview Descriptions": "Invited for a first round interview about a week after the posting closed. HR managed the process through the ATS and the department got a list from HR. Invited for a second round interview 5 days after that. Informed that the hiring process took a while at Yale owing to HR being backed up. Have not heard back after the second interview which at this point was 3 weeks ago.", "Interview Questions": "Asked about my prior experience in a similar position mostly."}, {"date": "19 Jan 2022", "title": "Facilities Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "A few casual questions. The manager makes sure you are willing to do manual labor, etc. Not too formal. One on one. I received an offer after one interview and accepted.", "Interview Questions": "Willing to do manual labor?"}, {"date": "17 Jan 2022", "title": "Teaching Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It was a great interview. the professor was awesome, and I really enjoy the prospect of teaching people. the interview was very collegial and respectful. have I reached 30 words yet.", "Interview Questions": "what lecture would you give?"}, {"date": "18 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Yale University", "Interview Descriptions": "got a call from the manager\nhad an interview within  two weeks. \ngot a job offer within two weeks. \ngot to negotiate the salary and sign on bonus\naccepted the offer.", "Interview Questions": "what made you apply for this position? "}], [{"date": "10 Feb 2022", "title": "Digital Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Jan 2022", "Interview Descriptions": "Virtual interview, employer was forthcoming about the challenges of the role and the potential opportunities. We had a lengthy and enjoyable discussion. Any interview is stressful but this was one of the least I've encountered.", "Interview Questions": "Experience with CMS (content management system) platforms"}, {"date": "11 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Its consists of zoom interviews with program directors and supervisors. Questions include behavioral, background specific and experiences related questions, why us and this position, long-term short-term career goals and interests, personal interests, questions for them. Overview of what they do and the position.", "Interview Questions": "Why us, why this position, resume/experience questions, and behavioral questions."}, {"date": "15 Oct 2021", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Onsite interview with managers with site tour. Very classic interview style, nothing too surprising. They asked standard interview questions. It took a while from when I applied to when I scheduled the interview.", "Interview Questions": "N/A"}, {"date": "21 Oct 2021", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Oct 2021", "Interview Descriptions": "I applied directly through Yale website in early September. Then I received an email a few weeks later stating my resume was pulled and will be contacted by the recruiter. I then got a phone call from the Manager to set up an interview. The interview was via zoom and went very well. I interviewed with the operations manager and team lead.", "Interview Questions": "Tell me about yourself?\n\nWhy did you apply to yale?"}, {"date": "6 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Conducted an online Zoom interview that lasted about an hour. Was on a call with 3 staff members and they each rotated in asking questions. Nothing too out of the ordinary was asked.", "Interview Questions": "Do you have any data driven experience?"}, {"date": "3 Sept 2021", "title": "Yale Investment Office Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Behavioral featuring two rounds. They were really amiable and would ask you the question you expect but be prepared since they cut a lot of people. Overall wasn't too hard and was a good experience.", "Interview Questions": "Q: Do you have any leadership experience? "}, {"date": "23 Aug 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "First apply online for their PhD program. Months later the faculty will schedule online Skype interview. There is only one round. Two faculties joined the interview. The result was then released in several days later.", "Interview Questions": "I consider it as a common chatting. Plan about future research was asked."}, {"date": "16 Aug 2021", "title": "Guest Experience Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "called and emailed by a recruiter on a Friday night at 6pm to set up an interview for the following week. tried emailing and calling them back the following Monday and Tuesday, but no one ever responded to me reaching out to schedule an interview.", "Interview Questions": "N/A"}, {"date": "29 Sept 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University in Jul 2021", "Interview Descriptions": "Initially a Zoom interview with the Principal Investigator about basic duties, prior experience, and how I would be a good fit for the role. After being offered a second interview, I spoke with the team as a whole to determine if I fit into the dynamic. I was also asked some additional questions specific to the research project in question.", "Interview Questions": "How have you had to adapt to a tough situation in your past research?"}, {"date": "2 Jun 2021", "title": "Nursing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "The interviewer sent me a zoom link and asked me to log in so that she could conduct the interview with me. She asked me a series of questions and asked me why I was applying to the position and what I had to offer.", "Interview Questions": "Q: Why did you choose Yale to apply to?"}], [{"date": "24 May 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview process for the project manager position at Yale university Yale School of Medicine was a satisfying experience. There were multiple interviews consisting of group problem solving and one on one discussions with multiple departmental management and staff.", "Interview Questions": "Tell us about a time you experienced conflict among team members on a project you managed. How did you handle this conflict and what was the result?"}, {"date": "14 May 2021", "title": "Program Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Two different interviews, the latter involved creating a presentation about my professional trajectory and sharing that with the team and both interviews were very “fit” / question oriented where they wanted to hear specific stories and examples of my prior experience", "Interview Questions": "How will I focus on equity in the workplace?"}, {"date": "19 Apr 2021", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It was just one interview. It took over a month to hear back. The process was very slow and there was not much communication. Everyone was very kind in the interview.", "Interview Questions": "Q: Tell us about a challenging project."}, {"date": "19 May 2021", "title": "Research Assistant, Regulatory Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Apr 2021", "Interview Descriptions": "2 Interviews: One with a recruiter, one with 2 hiring managers from the team. It's been over a month since then, and I've sent multiple emails asking about my candidacy. Nada, zip, nothing. Then they reposted the position the other day. Apply here at your own risk; expect to be ghosted along the way. I can't speak for all the departments at Yale, but the regulatory affairs one stinks.", "Interview Questions": "Tell me what attracted you to the position, what would someone reviewing your work say is your biggest strength/weakness? No surprise questions, pretty standard."}, {"date": "4 Mar 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "Great, super streamlined and easy via Zoom. They were eager to meet and speak with me. I thought the process was easy and would do it again.  All I needed was a resume and a brief CV to get the interview", "Interview Questions": "When are you available to start working?"}, {"date": "1 Mar 2021", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Very easy but this may have been due to the fact that the interview process is expexited for those already affiliated with the school. They reached out within the week of applying!", "Interview Questions": "Why are you interested in working with us?"}, {"date": "29 Apr 2021", "title": "Covid19 Vaccine Clinic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Yale University in Feb 2021", "Interview Descriptions": "easy, did not ask much, did not review resume, a lot of training and paperwork involved. Will hire anyone to work at the clinic, it was a quick phone interview.", "Interview Questions": "what is your availability out of the week? "}, {"date": "6 Apr 2023", "title": "Bachelor Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Feb 2021", "Interview Descriptions": "The questions during my interview were not hard, as my interviewer asked me questions based on my responses. For example, if I mentioned one of my extracurricular activities, my interviewer would ask me to expand on it later. My interviewer did seem like she had a sheet of paper with questions because she was looking directly at me throughout the conversation. Honestly, I think this is much better than a regular interviewer with prepared questions as my interview felt like a normal conversation with someone interested in learning more about me. The whole interview lasted about 60 minutes.", "Interview Questions": "Tell me about your high school. What was it like? What is your favorite memory of it? Tell me more about your X extracurricular activity. How did you join? What did you learn there? Why do you want to study X major at Yale?"}, {"date": "16 Feb 2022", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Yale University in Feb 2021", "Interview Descriptions": "First interactions were with Human Resources to establish the connection. I had multiple interviews with team leadership and with the entire team. Team leadership informed me they would contact HR and HR would be extending the job offer.", "Interview Questions": "Published work from the team was shared with me and we discussed this at an interview."}, {"date": "27 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "1 interview that lead to a follow up chat and finally an offer to join their team and work on a short term project that would be completed within the year", "Interview Questions": "What’s your interest in Yale?"}], [{"date": "26 Jan 2021", "title": "Post Graduate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Met with two lead researchers and two people in the current position. Each interview was about an hour and they ask you questions and you ask them questions. Also had to submit your CV and cover letter before.", "Interview Questions": "How do you see yourself fitting into the culture here?"}, {"date": "11 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Reached out via email to the PI. Interview was a conversation with PI and tour of the lab. Talked through the project I would be doing. Did not ask for resume or anything of the sort.", "Interview Questions": "Asked about what previous research experience was and what I would be interested in. "}, {"date": "19 Dec 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Yale University", "Interview Descriptions": "get an email saying to set up a time for a short interview, and ask me some behavioral questions and some resume questions and explain the job duty ask me whether I have any other questions", "Interview Questions": "some basic behavioral questions about myself"}, {"date": "16 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I was asked why I am interested in the particular lab I applied to and what type of research I was most interested in. The interview was very straightforward abd took less than an hour.", "Interview Questions": "Why are you interested in the position?"}, {"date": "19 Aug 2020", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "There were several rounds, the initial round was a phone screen by another recruiter, 2nd round was a face to face with the same recruiter, another recruiter from the team and their boss, then there were several other rounds with Leaders within HR and even an interview with a few of the Leaders you would support in recruiting for their teams. All in all the process took over a month and had at least 4-5 interviews.", "Interview Questions": "Tell me about a time you had a business stakeholder request something that was not realistic and how did you handle it? "}, {"date": "20 Jun 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I was referred by a professor. I emailed the professor and made an appointment. I went to professor's office to talk about my research experience. In addition, I expressed my interests in applying data analysis in a research team.", "Interview Questions": "What data analysis tools do you want to use when doing research?"}, {"date": "4 Mar 2022", "title": "Controls Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2020", "Interview Descriptions": "Interview was a little unprofessional. Seems like it was put together at last minute. Interviewers grew in the ranks from reg employees so they didnt know what a real professional looks like.", "Interview Questions": "normal questions but emphisizes on a specific software that isnt common to other workplaces."}, {"date": "20 Apr 2020", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview came after I submitted my application online. It was in the form of a brief (15min) phone call. I got the sense that the interview was more of a formality. There were no difficult questions asked.", "Interview Questions": "Why Yale? "}, {"date": "8 May 2021", "title": "Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Mar 2020", "Interview Descriptions": "Two phone calls followed by a series of Zoom interviews I started the interview process at the beginning of the pandemic.  Questions were straightforward about my previous experience and what I hoped to get out of the opportunity.", "Interview Questions": "Why are you interested in this program?"}, {"date": "10 Sept 2020", "title": "Data Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Yale University (New Haven, CT) in Feb 2020", "Interview Descriptions": "Comprehensive, with a focus on technical skills and cultural fit. Initial phone screen and then face to face/Video chat. Had difficulty in decision making as collaboration was slow and arduous", "Interview Questions": "Tell me about the most complex or difficult information you had to analyze?"}], [{"date": "1 Feb 2022", "title": "Archivist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2020", "Interview Descriptions": "A thorough and streamlined interview process. We went from phone interview to flying me out for the in-person interview quickly (relatively) and the interview lasted the entire day and was very comprehensive.", "Interview Questions": "What is a problem you have encountered and how did you overcome it?"}, {"date": "22 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Yale University in Jan 2020", "Interview Descriptions": "It was fairly calm and easy. Straightforward and expected questions. No surprises.  Have a personal strength and weakness for when they ask. They are big on customer service so make sure you talk about that.", "Interview Questions": "N/A"}, {"date": "13 Nov 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "fine,  standard because they asked a lot of behavioral questions, which is quite normal in the interview process. i showed them some of my previous experiences and explained why it would be applicable to my work here.", "Interview Questions": "Why do you want this job"}, {"date": "27 Jul 2019", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale University", "Interview Descriptions": "The process was very loose - I met with people and we chatted informally. Everyone was nice and it was low stress. Each manager is free to apply their own process for conducting interviews", "Interview Questions": "no formal questions were asked"}, {"date": "9 Jul 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Quick and very direct. I only  had to meet with one person and I received a call back 3 days later and I stared the job wth a month", "Interview Questions": "How did you manage stress with trying to meet a deadline?"}, {"date": "14 Jun 2019", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "It was a day long interview with most members of the 20 person office.  When applying, it was encouraged to send information to hiring manager along with applying through the online system.", "Interview Questions": "Talk about your past work with this population of students."}, {"date": "7 Mar 2021", "title": "Senior Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Jun 2019", "Interview Descriptions": "One phone interview then one in person. There are questions online on the Yale site that guide you through the types of questions they're looking for.  They just take forever to get back to you.", "Interview Questions": "Why are you fit for this position, 5 year plan, conflict resolution, etc."}, {"date": "14 Mar 2020", "title": "Specialist Master Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University in Feb 2019", "Interview Descriptions": "Received email from HR after one week application submission.\r\nThen phone interview with HR. HR is nice and friendly and asked a lot about your personality questions. One week after, got rejected.", "Interview Questions": "Basic question"}, {"date": "16 Feb 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2019", "Interview Descriptions": "It was a phone interview that lasted about 30 minutes.  It was with a dedicated HR person for that department.  They told me that their vacation policy is 2 weeks which is not really suitable for someone at my stage in life.  I would take a cut in pay to have the vacation but they can't be flexible.", "Interview Questions": " How did you handle being criticized?"}, {"date": "28 Nov 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University in Feb 2019", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Your experience in working in complex environment and work style"}], [{"date": "15 Jan 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It took about a month, and I was interviewed on the phone at first, then came in for an in person interview. The process was fairly easy and straightforward, which I liked.", "Interview Questions": "Tell me about your previous research."}, {"date": "7 Dec 2018", "title": "Clinical Receptionist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "Was called to  interview.  Interviewed with hiring managers and then almost a week later interviewed with department managers. Interview seem to go well. Reached our to my recruiter for update 2 weeks later since i jadnt heard back.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "24 Nov 2018", "title": "Construction Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Yale University", "Interview Descriptions": "What a circus.  \n\nI was brought in, no less than 4 separate times. Meeting with all group organizational levels and recruiters.  And each time I was there, each person talked about a different position. \n\nOne interviewer asked, “So what position are you here for?”\n\nIt was like Ground Hogs Day every time.  A waste of time, each time.  \n\nEither the group wasn’t aligned on the search and/or they are woefully out of sorts  My guess is both. \n\nEventually they passed on me.  But that’s because \n\nI had to call a few weeks later and find out for myself. I was told the decision was made a week \nprior to my call, just no one ever told me.  \n\nIf the interview process was an indictment of how the group is managed then a land mine was side stepped.  \n\nPoor form Yale.", "Interview Questions": "Why Yale?"}, {"date": "17 Oct 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "easy . be passionate and energetic for the interview .not much technical questions\r\nit was taken with 3 people .Be honest and positive and aggressive.\r\ndecent pay and no benefits for contract workers.", "Interview Questions": "tell us about your excel skills "}, {"date": "28 Feb 2020", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Oct 2018", "Interview Descriptions": "The interview for the Yale Young Global Scholars program was 30-minutes long and covered questions on curriculum development and how you would handle difficult interpersonal conflicts between students in the program. They also asked about prior teaching experiences, comfort dealings with students from diverse international backgrounds, and a few other curriculum related questions.", "Interview Questions": "Describe your ideal lesson plan."}, {"date": "25 Jun 2019", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Yale University (New Haven, CT) in Sept 2018", "Interview Descriptions": "Briefly asked about past lab experience, showed around the lab and cautioned the regulations. Talked about the schedule and openings for duty hours, screened the CV and asked relevant lab questions", "Interview Questions": "How do you respond to an emergency in the after hours?"}, {"date": "9 Mar 2021", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Yale University (New Haven, CT) in Sept 2018", "Interview Descriptions": "Quite informal, met manager and another staff to discuss the role. Also interviewed for an MT role but they gave me this instead I guess. Would suggest just applying to one or the other if you only want one of them.", "Interview Questions": "Tell us about yourself.\n\nBrainteaser guess an item based on asking questions."}, {"date": "21 Aug 2018", "title": "Postgraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Browsed the Yale departmental websites (including the school of Medicine) until I found a lab that interested me. E-mailed the PI afterward and described my situation and they invited me in the lab for the coming year, with pay.", "Interview Questions": "What are your plans for your gap year?"}, {"date": "9 Aug 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "i was asked to talk about the projects written in my cv. then asked me if i had any questions about study at Yale and living in new haven.", "Interview Questions": "describe the projects in details"}, {"date": "4 Jun 2018", "title": "Director of Mentors, Advisers and Partners Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Yale University in May 2018", "Interview Descriptions": "Overall the process has taken about 2+ months. I submitted an application online and was contacted via email by HR saying my application had been passed on to the hiring team. A month after that, I was contacted for an interview. The first interview was 30 minutes with the management team and a 10 minute presentation to faculty and staff of other Yale departments. A week later I was scheduled for a second interview with a member of the team I'd be working with.  The second interview was less structured and formal.", "Interview Questions": "Hypothetical questions regarding mentorship issues"}], [{"date": "4 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The internship is a summer research position for high school students. The process is just a Skype interview followed by a specific programming question. Then a few days were given for me to complete the task; I managed to finish it early.", "Interview Questions": "Python Programming - write a code that recreates an statistical example from a paper"}, {"date": "11 Jun 2018", "title": "Master-level Statistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Yale University in Apr 2018", "Interview Descriptions": "Phone interview lasted 20 minutes, I have no chance introduce myself, and started with my nearest project. And the interviewer focused on results of multiple academic projects. They preferred SAS, instead of R.  And about the database he mentioned, I didn't learn it before.", "Interview Questions": "Describe your nearest project, how about the result?"}, {"date": "5 Mar 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "The interview was very odd, the professors didn't allow me to resent, but instead jumped  into their interpretation of my work, interrupting and talking over each other. I was made feel very small because my previous school wasn't a well known institution.", "Interview Questions": "Why would you like to be at Yale"}, {"date": "20 Feb 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Mar 2018", "Interview Descriptions": "use machine learning to do research\r\ncheck the skill of java, C++ and R \r\nask question about coding skills and talking about other behavior things\r\nmeeting with two professor from the school of medicine", "Interview Questions": "do you know how to use subject in java"}, {"date": "3 Mar 2020", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Mar 2018", "Interview Descriptions": "Phone interview and then offered a postdoc position. Lots of the details of my research was aksed and the professor is very kind and tries to get to know all your skills that can be transferred to the lab", "Interview Questions": "Could you tell you about your research?"}, {"date": "5 Apr 2018", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University in Mar 2018", "Interview Descriptions": "I have mixed feelings about the process. I received an email after applying online that my application had been sent to a hiring manager. The individual contacted me with a calendar invitation to a meeting. NOTE: there is a phone number to call in with an access number in the calendar invitation. Our meeting was scheduled for approximately one week later. The interview itself was very positive. However, despite my following through with the HR requested followup, it's been radio silence.", "Interview Questions": "What research experience do you have?"}, {"date": "27 Sept 2018", "title": "ITS College Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Mar 2018", "Interview Descriptions": "The hiring process was a little strange. You couldn't apply for a specific position, you just had to apply to the broad umbrella of ITS/Finance, indicate vaguely your areas of interest, and then hope they matched you up with an area you're interested in for an interview. The interview was very fairly informal. I had mine over Skype as I was abroad. He just explained the position and asked me questions about my resume. It wasn't very intimidating, and I didn't really do much of anything to prepare for it. They are looking to fill spots and as long as you seem to vaguely have the skill sets they're looking for, you're probably good.", "Interview Questions": "Most of the questions were really specialized toward the job itself, which changes year to year. Telling you specific questions wouldn't really be helpful... "}, {"date": "20 Oct 2017", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "Applied online, and then was contacted months later. They have a poor response time and I wonder how many applicants they actually respond for, regarding each posting. I wouldn't recommend applying, as it seems the odds are against you with such a slow response and likely too many applicants to compete against.", "Interview Questions": "How many years experience do you have in programming?"}, {"date": "12 Sept 2017", "title": "IT Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Took forever for Yale to respond to application. I was brought in on a full day to perform  multiple panel interviews.  It was way too much of an ordeal for not a lot of money.", "Interview Questions": "How do you deal with time management."}, {"date": "23 Aug 2017", "title": "Senior Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "after application was sent to the hiring department. i was contacted to do phone interviews (with director of the program and two professors) after the phone interviews I was invited to do an in-person interview with everyone that I spoke with on the phone as well as other directors within the school. (all expenses for the fly in for the interviews were paid for by the program)", "Interview Questions": "what makes you a suitable candidate?"}], [{"date": "7 Aug 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview was via Skype video and was about 30 minutes long. They were very interested in getting to know me. They followed up after the interview about 2 weeks with an offer.", "Interview Questions": "Why do you want to do a PhD"}, {"date": "11 Oct 2017", "title": "PTA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Aug 2017", "Interview Descriptions": "I was questioned by Manager, RPT and HR who were very nice and polite.  After a month of waiting I got job offer but declined due to low salary. Unfortunately, salary is non negotiable.", "Interview Questions": "Tell me about your experience and education. "}, {"date": "24 Feb 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University in Jun 2017", "Interview Descriptions": "Two Skype interviews.  The first interview was with the PI only to describe previous experience and skills and more general questions. The second interview was with a panel of professors in the field.", "Interview Questions": "General research experience and presentation of previous research projects."}, {"date": "6 May 2017", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "3 people including mentor and director were sitting and asking questions. It was stressful. they asked about the skills. they talked about the future.  it was trough Skype.It was stressful. they asked about the skills. they talked about the future.  it was trough Skype.", "Interview Questions": "which software do you work with?"}, {"date": "11 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Apr 2017", "Interview Descriptions": "Received call scheduling receptionist, went in for interview, have kept in touch, but position has still not been filled and never heard back in the allotted time. Told I would hear back by latest 2 weeks.", "Interview Questions": "Tell me a time where you had to deal with conflict "}, {"date": "28 Mar 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "I reached the PI via email. We arranged a 20 min phone call. I flew to New Haven to give a 1hour talk in front of faculty members of the department (they paid for everything). People were friendly but cold (you sense the Yale ambience). I met with group members and a couple of faculty in person for a 15 talk each.", "Interview Questions": "At the seminar they asked me pertinent questions on my work (after all they were expert in that). Questions were mildly difficult, as expected. Then I talked with the PI about job. He didn't into too much detail (I regret I didn't insist)"}, {"date": "25 Mar 2017", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Interviewed by 3 managers from each campus.  They asked me an assortment of questions about my work experience and what if scenarios as well as tech skills. I can't believe this mandatory to fill out a review.", "Interview Questions": "Tell us about yourself."}, {"date": "14 Jan 2019", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Mar 2017", "Interview Descriptions": "You had to prepare a section of the campus tour to perform in front of a interviewer, who is a current tour guide. It was really laid back, and they didn't mind if you made an error or two, however NEVER make something up if you don't know it.", "Interview Questions": "What is the best part of being a Yalie?"}, {"date": "24 Jan 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Yale University", "Interview Descriptions": "Hiring process was easy but drawn out too long. HR took forever too do all my paperwork.  Otherwise the interviews were fun and engaging. Your interview will depend on what department you are in.", "Interview Questions": "Why do you want to work here? "}, {"date": "20 Nov 2017", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jan 2017", "Interview Descriptions": "there is no interview process for this job. it is first come first serve. the supervisors are very friendly. it is a collaborative environment. the tasks are normally very easy. the pay rate is good for students.", "Interview Questions": "there was no interview questions asked. "}], [{"date": "18 Jan 2018", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Dec 2016", "Interview Descriptions": "Very lenient, very short. Management needed a lot of help at the time, since a lot of people had quit previously due to student protests. It was pretty quick and just consisted of the manager showing me around and making sure I knew how to use basic Microsoft Office.", "Interview Questions": "What about you makes you qualified for this job"}, {"date": "11 Nov 2016", "title": "Teaching Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Yale University", "Interview Descriptions": "The process is terrible. You are supposed to reach out to profs to find open positions. One exception is cs50, which has a weird interview process-- they ask you to present stuff and then solve a bug in the first problem set while the interviewer talks childishly and annoys you", "Interview Questions": "Personal experince"}, {"date": "9 May 2018", "title": "Athletics Video Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Nov 2016", "Interview Descriptions": "Contacted Regarding Job, Applied Formally, Phone Interview, Flown in for In-Person. Phone Interview was with three people on the phone and lasted 20 minutes. In-person was a series of 4-5 one on one interviews with different people that I would interact with on a daily basis.", "Interview Questions": "How well do you deal with quickly diagnosing problems and making sure that games make air? "}, {"date": "23 Jul 2019", "title": "Web/Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Oct 2016", "Interview Descriptions": "Cordial and professional interview with direct supervisor. Reviewed job history and current portfolio showing numerous work examples. Discussed recent job history in detail, long-term job history, and various responses to challenges in the design practice.", "Interview Questions": "What is your philosophy of design?"}, {"date": "17 Sept 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Applied in ~Late November. Got an offer for interview early January. Attended the interview weekend early February (~4 day weekend). The actual interview part was just talking research with several professors. No particularly hard questions asked, mostly just about my own research experience. The hosts were current graduate students. There were also various activities like casual lunches with current faculty, housing tours, etc. Overall an enjoyable experience.", "Interview Questions": "Tell me about your research"}, {"date": "2 Sept 2016", "title": "Programmer Analyst III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Yale University (New Haven, CT) in Aug 2016", "Interview Descriptions": "Typical process meet with the team etc.  Nothing bad or good about the interview.  Interviewing with HR usually is a total waste of time. HR seems to think they should be the final word on hiring but for what. I have never figured out what HR actually does at a company.", "Interview Questions": "What is your greatest strength?"}, {"date": "15 Apr 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Yale University (New Haven, CT) in Aug 2016", "Interview Descriptions": "Phone Interview plus face to face interview with 10 people\r\n\r\nInitial phone interview via Skype and 2 weeks later an face to face interview with 5 people\r\n\r\nThere was another followup interview with 5 more people face to face. The team tool me to lunch as well", "Interview Questions": "General interview questions about career and work experience"}, {"date": "25 May 2016", "title": "Financial Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Went on an interview a week ago still waiting to hear back. They said it could take up to two weeks before I hear anything and to make sure I stay in touch. Also to email with any questions I might have.", "Interview Questions": "Why do you wanna work for Yale"}, {"date": "1 May 2017", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in May 2016", "Interview Descriptions": "Emailed for a while. Skype Interview and then an in person interview. Quick turn around in emails but once hired there was a long process in between starting the position.", "Interview Questions": "Have you previously used SPSS?"}, {"date": "13 Sept 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale University (New Haven, CT) in Apr 2016", "Interview Descriptions": "The principal investigator of the lab asked me why I was interested in the research and the type of experience I had working with qualtrics, SPSS, etc. It was not a difficult interview to do well at", "Interview Questions": "What was a time when you had to lead a team?"}], [{"date": "9 Oct 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Mar 2016", "Interview Descriptions": "It was for a student assistant. No formal interview was there. I had a brief chat with the program manager. We discussed the expectations, my roles, and responsibilities. Overall, I enjoyed working here so far. Great place to work. Very supportive staff and people around. There are many talks and lectures that you can attend.", "Interview Questions": "NO questions"}, {"date": "20 Feb 2018", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Feb 2016", "Interview Descriptions": "After cv, there is an interview following a quiz . All about academic questions related with this position. Just prepare that as the position indicates. The quiz is also abt the academic statistic questions with SQL skill.", "Interview Questions": "Whats your future plan"}, {"date": "13 Jan 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Extensive interview process - I met with 9 different people and sent a writing example beforehand. Several officers, department director, and administrative staff. The follow up was relatively quick. The process moved quickly once I got past the useless STARS online application system. Working with a recruiter will allow a more pleasant experience.", "Interview Questions": "Be prepared to talk about your Microsoft Office skills. Questions were thoughtful and relevant"}, {"date": "11 Jun 2018", "title": "ARS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Jan 2016", "Interview Descriptions": "the interview is dependent on the professor who wants to hire you. The human resource is not responsible for the recruiting and they just support you based on the university policy. They ask the questions like why you apply and what's your strength.", "Interview Questions": "why did you apply for this position?"}, {"date": "13 Jun 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Nov 2015", "Interview Descriptions": "Long, drawn out, interview process. You will interview with at least a half dozen people. The interviews are long, usually over an hour each. There is a great amount of questioning on your experience and knowledge of working for an institution of higher education. They fail to divulge that if you are hired you will be required to pay $100+ for parking!", "Interview Questions": "What makes Yale different from other similar institutions that makes you want to work here?"}, {"date": "7 Feb 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Nov 2015", "Interview Descriptions": "Whole day interview with lab people, gave a talk for 1 hour in the afternoon, was invited to lunch in a nice restaurant. The trip was reimbursed and I like the New Haven Hotel I was staying.", "Interview Questions": "what's your future plans?\r\nHave you applied for fellowships or funding grants?"}, {"date": "14 Oct 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Yale University", "Interview Descriptions": "Simply contact a professor and say you want to work for them. They will usually just have you come into their office and tell you a project that you can work on -- may not respond or just say no if they don't have anything for you to do in their lab.", "Interview Questions": "What are your interests, why do you want to work on X project"}, {"date": "21 Jul 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "I did not interview. The job was given to me because of a friend's referral. However, interviews seem to be purely behavioral from my understanding and are typically very easy. For most student worker positions some special super ultra amazing skills are not really necessary.", "Interview Questions": "N/A"}, {"date": "12 Dec 2016", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2015", "Interview Descriptions": "Phone interview, pre-screen, length of 30 minutes only. Did not get a feel for the environment or engagement, wanting to let them have the information they needed to form their opinion of me.   This was followed by in-person interview, and discussion of a specific project.  FYI, I was hired for this position, and accepted for this position.  The day I arrived, they changed my project, slapped a 40-hour limit on billable hours and informed me I would not be allowed to work remotely.", "Interview Questions": "They asked for examples of my project plans, status reports and writing"}, {"date": "29 Aug 2015", "title": "Buttery Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in May 2015", "Interview Descriptions": "There was no interview. I just had to fill out their online form to apply for the job, then a few weeks later I was offered the position, which I accepted. I was offered the job a little over a month before I was due to start working.", "Interview Questions": "N/A"}], [{"date": "8 Aug 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Apr 2015", "Interview Descriptions": "Long process, requiring multiple interviews with several different mangers  lots if talk about company culture and vision. Large amount of questions relating to personality and character.  Difficult to get initial interview", "Interview Questions": "How do you Handel difficult coworkers?"}, {"date": "21 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Mar 2015", "Interview Descriptions": "Interview was fair and not long. Met with principle investigator and members of lab at the university. Gave overview of my past research and answered questions that they had. I was then given an overview of what kinds of research questions the lab was currently pursuing and the which areas would fit my areas of expertise. It was good to already be familiar with the lab's past research and was informative to learn about the future directions the lab would be headed.", "Interview Questions": "Describe past research projects"}, {"date": "6 Apr 2017", "title": "ITS College Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University in Mar 2015", "Interview Descriptions": "I applied early online and heard back at a reasonable time. There were a couple of interviews with different teams, but nothing overwhelming. Overall, I think applying early helped me out, but resulted in a bit of a wait to hear back after my interview, but nothing ridiculous.", "Interview Questions": "Basic questions about my background, experience, a few general CS questions that weren't too tricky."}, {"date": "6 May 2015", "title": "Accountant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "Talked briefly about the position, went over my resume, asked me some personality questions, some experience questions, problem solving, where do I see myself in 5 years. Typical questions in an interview. No Gotcha questions, very straightforward just looking for help and wanted to know if I can do the job. I also new the person hiring which made it easier.", "Interview Questions": "What previous Grant Skills I had"}, {"date": "2 Nov 2016", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "There are three rounds: First, you do a written application and a panel interview in front of a few current tour guides where you give a short spiel. Second, you do two interviews with current tour guides. Finally, you give an audition tour to a real group of guests based on observing other tours.", "Interview Questions": "What is your least favorite thing about Yale?"}, {"date": "17 Sept 2015", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "It was a phone interview, it appeared to be going well during the description of responsibilities and expectations there were no real tell me about yourself questions, things changed when asked do I have any questions. The questions I asked were based on researching the position, however, 2 questions appeared to be unsatisfactorily answered. felt a mood change.", "Interview Questions": "How comfortable would I be interacting with an affluent donor?"}, {"date": "26 Apr 2018", "title": "Post Doctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "a lot of technical questions were asked. I was talking about mostly my work from my PhD. Nothing special. They value what you've done for you PhD, and who you are.", "Interview Questions": "What do you imagine yourself 5 years from now."}, {"date": "4 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University in Feb 2015", "Interview Descriptions": "No interview needed. We just apply online, and the school returns an offer 3 month after the application. I was applying for Master program in CS with GRE 324 and TOEFL 106", "Interview Questions": "No interview needed"}, {"date": "2 Jul 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jan 2015", "Interview Descriptions": "A thorough interview with the team to assess skill level, technical skills, and soft skills.  The interview process was lengthy with multiple personalities.  I received a review of what the position would entail.", "Interview Questions": "Previous experience, what you most enjoy in your previous work."}, {"date": "1 Feb 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Dec 2014", "Interview Descriptions": "Interview process was decent, with many relevant questions asked, and responses given when you questioned in return.  Depending on interview, you may or may not interview with the Principal Investigator, which I found slightly insulting as they are the one hiring, not their staff.", "Interview Questions": "Have you ever done any bioinformatics before?"}], [{"date": "14 Nov 2014", "title": "CRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University", "Interview Descriptions": "Was contacted in a week after applying, process was very fast and straightforward, but background process is done by a third party who took some extra time. I had to meet with every team on the particular project one by one in different days as most of them were not available on the same day", "Interview Questions": "They believed I was over-qualified for the position, asked me what my rationale is for taking a low step"}, {"date": "29 Oct 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Yale University", "Interview Descriptions": "I contacted the group leader sending an email and resume. We had a telephone conversation. He requested 4 letters of recommendations. After a couple of weeks he asked me to visit the lab and give a 1-hour presentation in front of the rest of the department. After another two weeks he contacted me tell me I've been hired. My job started 9 moths later (but it could be sooner if I hadn't an agreement with the previous job).", "Interview Questions": "what are you going to bring to the group?"}, {"date": "15 Sept 2014", "title": "Associate Research Scientist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "This research faculty position was suggested by my adviser after two years as a postdoc in his lab. There was no official job posting and interview for this position and the hiring turned out to be just a smooth internal position transition.", "Interview Questions": "N/A"}, {"date": "10 Sept 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Once you get an interview it's fairly simple. You will be interviewing with another 40 students so just make sure not too stand out negatively. Prepare for meeting with individual Professors by knowing about their research and be able to talk about your own research and experiences.", "Interview Questions": "One related to my own research and the applicability in a clinical setting. "}, {"date": "29 Mar 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale University (New Haven, CT) in Sept 2014", "Interview Descriptions": "chat with the prof and see if you have related background before. profs usually be nice to you and you don't have to worry that much if your answer is not perfect. They are flexible people in the universities.", "Interview Questions": "why you are interested in this job and what you could bring to this job"}, {"date": "18 Aug 2018", "title": "Kitchen Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Sept 2014", "Interview Descriptions": "Simple meeting with the manager of the center and tour of the building followed by some questions in his office about my history, work experience, why I wanted the job", "Interview Questions": "What do you consider your strength"}, {"date": "14 May 2015", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Jul 2014", "Interview Descriptions": "Whole process took about 3 months. Very thorough. Very nice people. Had an initial HR phone screening, then a one-on-one with the HR director in person, then a one-on-one with the hiring manager, then a group interview with the whole department. It was a lot of interviewing.", "Interview Questions": "How do you feel you can contribute to the department?"}, {"date": "19 Nov 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Yale University in Jun 2014", "Interview Descriptions": "I received a telephone interview 2 months after submitting my application, and was invited for an on campus interview 2 months after that. I was offered the position 1 month later.\r\n\r\nThe telephone interview was pretty straightforward: a series of about 15 questions, mostly pertaining to my previous experience. \r\n\r\nThe on campus interview included \r\n-a dinner the night before\r\n-3 individual interviews (hiring manager, another director and the dean) \r\n-a groups interview with the office staff\r\n-a presentation for 15 people including faculty, staff and researchers\r\n-followed by a discussion period with the audience.", "Interview Questions": "There were no very difficult or unexpected questions. Mostly they wanted to hear how I would implement a new series of programs. "}, {"date": "23 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 8 months. I interviewed at Yale University (New Haven, CT) in Jun 2014", "Interview Descriptions": "Appointment with 3 different Principal Investigators in the same field. The appointment were dispatched in two days total.\r\nAround 1h each during which you talk about your past research/contributions/motivations. And a little bit informal question at the end.", "Interview Questions": "What did you do during your PhD?"}, {"date": "9 Nov 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in May 2014", "Interview Descriptions": "overall it was a good interview, the manager was very nice and did not ask anything difficult. The interview lasted about 20 min. I also met with a few library staff and librarians and had a tour of the library. Everyone was very nice and said they enjoyed working here.", "Interview Questions": "do you prefer cooking at home, or go skiing?"}], [{"date": "30 Aug 2018", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in May 2014", "Interview Descriptions": "I gave a presentation to the group for my research projects in Brown Univ and Scripps.  Supervisor was happy about my performance and productivity.  I had lunch and dinner with the group and get all the travel and related cost covered.", "Interview Questions": "What is the most critical factor for a postdoc research"}, {"date": "31 Mar 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Graduate students in my field are not interviewed prior to being accepted, but each field is different.", "Interview Questions": "Important aspects of grad school application are letters of recommendation, as well as one's personal statement, which must be aligned with at least some of the research being done at the university."}, {"date": "5 Aug 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Apr 2014", "Interview Descriptions": "Waited forever after applying to several posted online positions. No acknowledgement from HR ever if even received. Finally after two months or more, get an email stating one of the positions had been cancelled. Joke. They already have jobs so they could care less if youre left in the street.", "Interview Questions": "Why should we hire you"}, {"date": "5 Feb 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University in Apr 2014", "Interview Descriptions": "It was highly technical but brief. We talked about the research that they were conducting at Yale, we talked about my goals, the interviewer asked me why I applied and what made me think that this would be a good step for my career.", "Interview Questions": "Regarding my research. Why I want to join them. What are my goals."}, {"date": "5 Sept 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New York, NY) in Apr 2014", "Interview Descriptions": "good and easy to tackle,\r\nIf your application has been selected for an interview, a member of the department’s hiring team will contact you to set up a time. (If you don’t live in Yukon, initial interviews may be conducted by phone or Internet video.) Now, this is your chance to do some background research", "Interview Questions": "why do u apply for this job"}, {"date": "22 Jun 2016", "title": "Software Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Yale University (New Haven, CT) in Mar 2014", "Interview Descriptions": "Yale uses Brass Ring for entering formal applications for staff jobs.  The application is painstaking; none the information on an attached resume or other job site is automatically captured. In addition to the on-line application, networking is almost always necessary to get an interview.    In IT, staff jobs are rapidly being replaced by contract workers.  The interview process is very similar; count on many candidates and individual interviews with several stakeholders.", "Interview Questions": "How to you manage conflict in day to day work situations?\r\nWhat awards have you won recently from another employer?\r\nDescribe a situation where you had responsibility to make quick decisions."}, {"date": "27 Feb 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University", "Interview Descriptions": "First is phone interview. Some basic questions about research projects done before, why choose the new lab, any visa sponsorship needs. Then on-site interview to give a presentation, then meet with other postdoc working there.", "Interview Questions": "N/A"}, {"date": "28 Oct 2015", "title": "Recording Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2014", "Interview Descriptions": "My interview was at the studio with three current student staff members. It lasted for about 20 minutes. I heard back after three days. Found the opportunity on university's careers website. The three interviewers were all very nice. No tricky questions - just try to demonstrate interest and dedication.", "Interview Questions": "How flexible is your schedule?"}, {"date": "27 Jan 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Send CV first, got invited for onsite interview. The interview process took one day, including  1 hour presentation and 7-8 people one-to-one interview", "Interview Questions": "what do you plan to do if you join in the lab?"}, {"date": "21 Jan 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University", "Interview Descriptions": "My pi is great. Just the lab environment is not fit for me", "Interview Questions": "Deal with people"}], [{"date": "9 Feb 2014", "title": "Web Content Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jan 2014", "Interview Descriptions": "Applied online and was culled from interview process the same day.", "Interview Questions": "No questions asked."}, {"date": "14 Jul 2015", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Dec 2013", "Interview Descriptions": "Asked me about prior experience and interest. No hard questions, very eager to hire. Some behavioral and hypothetical questions regarding possible scenarios I might encoutner and how I'd react. Very casual, not stressful at all.", "Interview Questions": "What would you do if a customer came to you and said X is broken?"}, {"date": "20 Nov 2013", "title": "MD/MPH Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Very tight-knit community. Committed to supporting students and applicants.", "Interview Questions": "Statement of purpose."}, {"date": "1 Nov 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Aug 2013", "Interview Descriptions": "I initially contacted the PI about potential research in his group. Then we had some email exchanges about research projects. The we met in-person to discuss more about the future research projects. Offer was given shortly after. Post-offer processes went very smoothly.", "Interview Questions": "Describe your research plan. The PI provided inputs and eventually we found something that are of interest to both of us."}, {"date": "29 May 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Aug 2013", "Interview Descriptions": "The interview consisted of a full day of in depth scientific discussion with the hiring professor and a full 1 hour talk, including meetings with other laboratory members.  I was tested on my scientific knowledge and creativity, and potential work projects were defined.  The presentation is key to getting an offer, but scientists usually know you ahead of time.  I had met the hiring professor at meetings and so we were already acquainted.  They took me out to dinner at a nice restaurant in New Haven.", "Interview Questions": "What projects are you interested in doing and where do you see your future research?"}, {"date": "17 Jul 2013", "title": "Development Associate, Prospect Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Yale University", "Interview Descriptions": "There was a significant lag-time between submitting my application online and being contacted. After that, however, things moved fairly swiftly: a skills test, a chat on the phone, a Skype interview. The staff was incredibly kind, handled some technical snafus with grace, and were strangely interested in my background (which was completely unrelated to the position – frankly, I hadn't expected to be contacted at all). Overall, they seemed like a great team for which to work.\r\n\r\nAfter the last interview, they said they would get back to me in a couple of weeks or so; at that point, our brief run of incredibly consistent, frequent communication essentially fell flat. I only found out that I had not been selected when I happened to notice my status on the HR website. That being said, it remains one of the more enjoyable interview processes I've gone through.", "Interview Questions": "How do you handle distractions?"}, {"date": "22 Sept 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University (New Haven, CT) in Jul 2013", "Interview Descriptions": "There was an initial phone screen, and then a in-person behavioral interviews with HR and the managers of the group hiring you. The managers asked me about my experience, and a few light technical questions, and that was pretty much it. Much to my surprise, there was no whiteboard coding, no problem solving, nothing.", "Interview Questions": "How do you feel about working with people?"}, {"date": "26 Apr 2013", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Informal interview with a senior associate in the dept led to interviews with Principal Gifts Officer, Principal Gifts Director, and other Development Associates. Then completed a directed writing sample.", "Interview Questions": "Describe a conflict of interest you have encountered in your work and how you handled it."}, {"date": "9 Aug 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Yale University (New Haven, CT) in May 2013", "Interview Descriptions": "Following the submission of applicaiton, i was contacted by the professor who was interested to hire me. We then had a phone/skype interview following which the professor offered the position by email correspondence after a couple of weeks.", "Interview Questions": "1. area of research and how comfortable was I in the area of research that i will be working on."}, {"date": "18 Oct 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Apr 2013", "Interview Descriptions": "Phone/Skype interview that lasted about 30 minutes. Asked questions about research interest and what you want to accomplish during the postdoc period. One has to have well defined goals to accomplish anything.", "Interview Questions": "Research focus\r\nWhat you want to accomplish\r\nSend a writing sample"}], [{"date": "11 Mar 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Very informal.", "Interview Questions": "How to prioritize tasks"}, {"date": "1 Mar 2013", "title": "Post Doctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University", "Interview Descriptions": "applied online, followed by phone interview and visited the department for presentation of research work,", "Interview Questions": "None"}, {"date": "7 Dec 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Yale University (New York, NY) in Feb 2013", "Interview Descriptions": "Very brief questions on what you want to be, plans for the future, and technical questions regarding laboratory experience(if any).  The atmosphere is very casual, and informative at the same time.  If you get an interview you're pretty much hired.  So if you live in the area and looking to make some temporary money while you find a real job, this is the position.", "Interview Questions": "What do you plan to be in the future?\r\nWhat do you know about working in a laboratory setting?\r\nDescribe how your college courses prepared you to work here."}, {"date": "15 Dec 2016", "title": "Ph D Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New York, NY) in Feb 2013", "Interview Descriptions": "I applied online and got a Skype interview from my future advisor. He asked me about my skills and research. He also asked about my interests on research and talked with me about the research I was going to do at Yale.", "Interview Questions": "Describe in details on one of my research experiences."}, {"date": "24 Jun 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Sept 2012", "Interview Descriptions": "I had worked previously with the Professor during my studies at Yale and so the process began with a clear description of my tasks during the research project and discussed my ideas for the research project. She was not interviewing anyone else for the position because she had decided to hire me for it. Overall, it went very well!", "Interview Questions": "She asked if the research project was something that I was interested in?"}, {"date": "5 Dec 2015", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in May 2012", "Interview Descriptions": "Applied online through school's employment opportunities website. Called in for interview - was asked straightforward behavioral questions - and a week or so later was told I got the job.", "Interview Questions": "What's one challenge you faced?"}, {"date": "30 Apr 2014", "title": "CCE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in May 2012", "Interview Descriptions": "Application, followed by short 15 minute interview", "Interview Questions": "How would you confront people who want to have a party?"}, {"date": "23 Jul 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University (New Haven, CT) in Feb 2012", "Interview Descriptions": "Online application followed by initial contact with PI and a 45 min interview with PI and another professor.", "Interview Questions": "Have you looked into previous work done on these lines?"}, {"date": "6 Nov 2012", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Jan 2012", "Interview Descriptions": "After contacting the Professor, all it took was a submission of my resume, and transcript. I was hired within a few weeks.", "Interview Questions": "None, everything was pretty standard. Yale really tries to get it's undergrads to do lab research - even for pay!"}, {"date": "23 Mar 2015", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Sept 2011", "Interview Descriptions": "Interview was conducted by a group of senior leaders in the area, along with prospective peers.  A follow up interview was conducted by the senior manager of the team.", "Interview Questions": "Describe a challenging project that you were involved in and describe how you overcame the challenged"}], [{"date": "29 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Yale University in Sept 2011", "Interview Descriptions": "I first had a phone interview. My PI briefly discussed the position. I then flew into NH and gave a talk 2 weeks later. I met everyone in the lab.", "Interview Questions": "Specifics of my previous training and what I could bring to the lab. "}, {"date": "29 Mar 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Jul 2011", "Interview Descriptions": "A thorough scientific interview involving a seminar talk with discussion. Separate interviews with the group's PI and other faculty members from the department, as well as other scientific staff over the course of three days. It was helpful for me to have had the opportunity to discuss science with all potential future colleagues beforehand.", "Interview Questions": "How will your research proposal fit into our group?"}, {"date": "21 Jul 2015", "title": "I T Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2011", "Interview Descriptions": "You basically goto the www.yale.edu website and click on \"working at yale\".  You create an account within their system and submit your current resume. Once that is done you can search their current available jobs database. Once you find a job that you are qualified for, you can apply for the job.", "Interview Questions": "I.T. technical questions and would you handle certain I.T. situations."}, {"date": "1 Jun 2012", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 7 weeks. I interviewed at Yale University (New Haven, CT) in May 2011", "Interview Descriptions": "Shortly after submitting my resume, I got a reply back confirming that the resume had been passed along. I then received an email requesting an interview a couple of days afterward. I was interviewed by a couple of people and I had the impression that it went pretty well overall. They were being positive and encouraging, but extremely vague on the timeline and I didn't hear from them for over five weeks, other than a brief non-informative reply back to my inquiry after three weeks. Later when I checked, they'd reposted the position with a totally different job description. I get that this happens, but they could have done a much better job of not leading candidates on and keeping them in unnecessary suspense.", "Interview Questions": "Tell us about a difficult challenge you faced at work that you overcame. "}, {"date": "16 Mar 2012", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in May 2011", "Interview Descriptions": "how to calculate the sample size? how to handle the missing data? how to build regression models...", "Interview Questions": "how to handle the missing data"}, {"date": "9 Jan 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Yale University (New Haven, CT) in Mar 2011", "Interview Descriptions": "The process was quick and easy because the lab was in immediate need of assistants and the job qualifications were minimal.", "Interview Questions": "N/A"}, {"date": "8 Jul 2015", "title": "Doctoral Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Yale University (New Haven, CT) in Mar 2011", "Interview Descriptions": "App submitted online with fee. No interview was required then, but rules have changed. Applied in November, notified of acceptance in late January or February, brought in for recruiting event in March. Interview was more recruiting, as offer had been received.", "Interview Questions": "N/A"}, {"date": "8 Nov 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, IN) in Feb 2011", "Interview Descriptions": "first mails about interest and skills;\r\nand then onsite fr a more detailed technical and experience test.\r\nincuding a presentation of previous work. and answered related questions\r\nget feedback in two weeks\r\nget offer in two weeks", "Interview Questions": "give a lecture and write a short proposal"}, {"date": "3 Aug 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Jan 2011", "Interview Descriptions": "There were no interviews held for this position.  The selections committee selected postdoctoral associates based solely on the materials submitted as part of the on-line application.  There was not even a phone or Skype interview stage for this position (at least in the department in which I was a post- doctoral associate, which was surprising, but nice.", "Interview Questions": "N/A"}, {"date": "14 Oct 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jan 2011", "Interview Descriptions": "Whole day interview after a phone interview. Presented my graduate work and answered questions. Met with lab people to discuss the projects and the lab work culture. Met with administrative staff to discuss the immigration procedures and background checks. Had a 2 hour interview with PI about past experience and future goals apart from the project details.", "Interview Questions": "Scientific background"}], [{"date": "15 Sept 2011", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Nov 2010", "Interview Descriptions": "Meeting with two professor from Yale talking about own research.", "Interview Questions": "What is your research interest?"}, {"date": "23 Nov 2011", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University (New Haven, CT) in Oct 2010", "Interview Descriptions": "It is a regular interview for postdocs.  The professor came to meet me at the hotel, we had breakfast together, then we went to the lab to meet the rest.  I first give a presentation of my previous research, which didn't go great.  Then I talk to everyone in the lab, each for 30 minutes.  The last one to talk is the professor.  We then went to dinner and the whole thing finishes at 8:00.", "Interview Questions": "what is your career goal"}, {"date": "8 Feb 2012", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Yale University (New Haven, CT) in Oct 2010", "Interview Descriptions": "Interviewed with professor than the lead student. Very nice academia, people.", "Interview Questions": "Describe a difficult past experience and how you dealt with it?"}, {"date": "17 Nov 2014", "title": "Senior IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Yale University in Sept 2010", "Interview Descriptions": "Getting into Yale was very difficult.  Most of it had to do with the computer system they used for HR which would scan your resume for keywords and then kick you out if it didnt match up.  So often you would get bounced from the system without human eyes even seeing your submitted resume.", "Interview Questions": "There were not really any difficult questions in this interview.  It was a pretty standard review of past experience.  I think what really helped was the fact that I got in there and did some temporary work as an IT consultant and that opened the door for me."}, {"date": "1 Mar 2012", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jul 2010", "Interview Descriptions": "First I spoke on Skype and told what I can and what I want. Then I came to the lab to give a talk. On the seminar with the whole group  PI asked a lot of questions on the subject. It was planned to meet several group members individually so they spoke about their research. In the end it was private conversation with PI and he offered a job.", "Interview Questions": "N/A"}, {"date": "5 Jan 2013", "title": "Associate Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2009", "Interview Descriptions": "I was a postdoc for several years prior to being promoted to Associate Research Scientist", "Interview Questions": "No unexpected questions were asked. I came prepared for the interview."}, {"date": "10 Sept 2012", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Dec 2008", "Interview Descriptions": "Submitted online application, called in for a screening interview in HR. Offered a position different from the one I applied to, at a higher level based on HR interview. Yale can be slow to fill jobs, they don't have the same pressures as a private employer. It is common to not hear anything for a month or more and then be called for an interview. Very strict on requirements, especially education and years of experience.", "Interview Questions": "They focus on demonstrated accomplishments, so you will be asked to provide examples. "}, {"date": "16 Aug 2012", "title": "Associate Director of Community Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Yale University (New Haven, CT) in Sept 2008", "Interview Descriptions": "Great process with the physician who was hiring me.  I met with him at his home and spent a few hours being interviewed and being able to ask him questions as well.", "Interview Questions": "The Human Resources Department was very difficult to work with and it took 5 months to become a full time employee from a contact employee.  They always asked how I was qualified for such a high level salary."}, {"date": "17 Jun 2010", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2008", "Interview Descriptions": "After interviewing with the human resource director at the School of management i was set up to interview for several positions within the school of management each time interviewing with multiple professors who i would be working with.  Overall a good experience felt that some of the professors were not interested because they thought that I would not stay in the position very long", "Interview Questions": "What was the last book that you read?"}]][[{"date": "7 Jul 2023", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Two rounds with two interviewers each. One more senior than the first. Questions were entirely fit related, and focused mostly on thinking about career transitions. Surprisingly a very standard, one-way interview (with one or two awkward pauses while they figured out who was asking the next question), rather than an assessment masked as a conversation between people. One of the senior interviewers started smirking through one of my responses at the end, which wasn't incredibly respectful coming from a group that prides itself on incredible integrity and personal cohesion within the team.", "Interview Questions": "What factors drove x career transition? Can you tell us about a challenging time and how you dealt with it?"}, {"date": "12 May 2023", "title": "Math Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Had to fill out a written application, then had an interview process with one of the lead coordinators. The interview was over Zoom. Friendly environment. Questions were mostly behavioral. Was asked about specific concepts and content I wanted to teach over the summer.", "Interview Questions": "Why do you want to be an instructor? What courses do you want to teach?"}, {"date": "3 May 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "The initial interview was over the phone with HR. After that there were at least seven interviews with directors , senior directors, physicians, and AVPs. The entire process from start to finish took about 6 - 7 months to complete.", "Interview Questions": "How well can you interpret data and meet kpi goals?"}, {"date": "19 Apr 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Apr 2023", "Interview Descriptions": "It was very brief and informative. I learned more about the role and department in detail. The hiring manager was very pleasant and upfront about the expectations. It was overall a good experience.", "Interview Questions": "What are your goals in the next five years?"}, {"date": "28 Mar 2023", "title": "Casual Team Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "During COVID so whole process was via Zoom, email, and text. First interview was with three internal Yale managers. I was a bit confused as to who was actually hiring for the position I applied for.", "Interview Questions": "Previous work experience and working availability."}, {"date": "23 Jun 2023", "title": "IT Project Manager Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Yale University (New Haven, CT) in Mar 2023", "Interview Descriptions": "In the interview process, there are typically two rounds of behavioral questions, which primarily aim to assess an individual's personality traits and behavioral patterns. These rounds are designed to delve deeper into the candidate's character, values, and interpersonal skills, rather than focusing solely on technical qualifications. The intention is to gain insights into how the candidate might fit within the company culture and work effectively with colleagues and clients.", "Interview Questions": "Q: tell me about a time how you handled a project?"}, {"date": "21 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Phone interview, followed by zoom interview and then zoom interview with peers. HR handles all salary and benefits negations. Background check is a lengthy process. Interview process was around 2-3 months", "Interview Questions": "Tell me about your working style"}, {"date": "14 Feb 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University", "Interview Descriptions": "Upon initial resume evaluation, I then got to meet with the hiring director. This was amid COVID and the interview was with the hiring director. The interview lasted about 30 minutes.", "Interview Questions": "They were basic interview questions. They specifically wanted to know why I had chosen that particular department out of the other jobs available at the university."}, {"date": "20 Jan 2023", "title": "PhD Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview email was sent Dec last year. The interview schedule was sent at the beginning of this year. We made three 30-min interviews with 3 different PIs. The interview is held online through zoom.", "Interview Questions": "describe my research experiences; why school; why phd"}, {"date": "5 Jan 2023", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Yale University", "Interview Descriptions": "It took about a month to be contacted for an hour-long screening interview. Had an interview with a committee of four or five faculty, staff, and the director. Everyone was very gracious, well-versed in my materials, and pleasant. I was contacted two months later for an in-person interview. Met with several dozen support staff, directors, and other staff during a day-long interview. I was offered the job a month and a half later. It was a generally good experience, it just takes a long time because higher-ed moves slowly.", "Interview Questions": "What attracts you to this position? What are some initiatives and projects you could envision for promoting diversity and inclusivity?"}], [{"date": "27 Feb 2023", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Jan 2023", "Interview Descriptions": "The whole process took 3 rounds with HR, BU head and tech manager, and CTO. All went online. No difficult tech question. Everything went general. Emphasized humanity, WLB, and social impact.", "Interview Questions": "Tell me about a past SQL program you led."}, {"date": "13 Dec 2022", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Regular questions including something would not be easy. However, I like it. I hope you like it. Describe an instance where you set your sights on a high/demanding goal and saw it through completion.（", "Interview Questions": "Describe an instance where you set your sights on a high/demanding goal and saw it through completion.（"}, {"date": "17 Feb 2023", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Dec 2022", "Interview Descriptions": "Applied in October 2022, was contacted in early November for interviews. Over the course of the entire month and into late December I was invited to meet with many, many people from the department. Due to my needing to meet with so many individuals, the process took quite a bit of my time and energy. Also, no one really seems to be in a hurry even for internal candidates, so you will need to be patient and keep expectations low.", "Interview Questions": "General tell me about yourself or tell me about a time when questions. Nothing tricky or overly complicated."}, {"date": "21 Sept 2022", "title": "Communications Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I participated in an initial phone interview and was told up front that the process may be drawn out. I didn't hear back for about a month, when I was contacted for a second-round interview, which would have involved doing a presentation for a search committee. I respectfully withdrew my application at that time for personal reasons. My overall impression of the hiring manager was that they would have been a good, fair boss.", "Interview Questions": "Why I was interested in the role, why specifically that department, and additional questions about my thoughts about their current communications strategy as well as what might be improved."}, {"date": "13 Dec 2022", "title": "Active Directory Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Yale University (New Haven, CT) in Sept 2022", "Interview Descriptions": "I interviewed for this position twice once a few years ago and one fairly recently. I interviewed remotely with several people they seem to be more interested in someone who could pass a test instead of learning and growing into the job. I took the same online test twice. It generally asked obscure questions about specific command line arguments that you could look up in under a minute. I got another call from a recruiter, so they've posted it again. Not a good sign that they can't fill the position or people keep leaving.", "Interview Questions": "What command would you use to restore the default domain policy if it became corrupt."}, {"date": "19 Aug 2022", "title": "Admin Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Not as lengthy as one might expect at a large organization. A handful of interviews, verbal offer, offer letter, back-round check. Interviews can range in length depending on department. You work primarily with HR on salary and so on", "Interview Questions": "How do you work in a hybrid environment?  "}, {"date": "2 Aug 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Applied for fellowship. Got it. Nothing more to it than that. Of course, had to have some relationship building with the lab I would join. No actual interview was conducted.", "Interview Questions": "N/A"}, {"date": "5 Jul 2022", "title": "IT Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I uploaded my resume first first applying to an online IT internship application. Then it was followed by a series of interviews to place me on a team that fit my interests and skills.", "Interview Questions": "They asked me about the statistics projects I did. "}, {"date": "26 Jun 2022", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "This was for a Museum role - had 1 Zoom interview with fairly straightforward questions, but they were not your standard behavioral questions. They wanted to know more about how you see your work than details of your experience", "Interview Questions": "Why is it important that museums engage the public?"}, {"date": "20 Jun 2022", "title": "Clinical Investigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It was a 30 mins interview. The interviewer was really good and supportive. I was given a task of what I should do and what I should expect from the position.", "Interview Questions": "Tell me about yourself?\nWhat I can provide to the team?"}], [{"date": "13 May 2022", "title": "Administrative Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "The posted position was cancelled without notice following the interview. At the time, I received no feedback on the interview, although more than two weeks had passed, nor any useful information from HR on next steps. I expected better.", "Interview Questions": "What was my experience in a managerial role?"}, {"date": "18 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Two step interview process , one with the recruiter and once you pass that process you will be invited to for a second interview with the hiring team either in person.", "Interview Questions": "Tell me about your self?"}, {"date": "30 Mar 2023", "title": "Postgraduate Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Yale University (New Haven, CT) in Mar 2022", "Interview Descriptions": "The process is not as lengthy but it took me months to finalize the offer. They were very supportive and asked to send my cv, and once the cv was finalized I set up an interview with my supervisor who asked me questions and finalized the offer with the following email.", "Interview Questions": "technical questions, working habits. (Analytical questions) and the kind of person you are and what you would bring to the group."}, {"date": "4 Jun 2023", "title": "Biostatistics Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University in Mar 2022", "Interview Descriptions": "Short and very skills based and very to the point. They asked me questions on why I was interested in the role, about my previous statistical experience, my biostatistics skillset and previous coursework I have taken that was applicable to the research projects I would have been assigned to as a summer intern at the Yale Center for Climate Change and Health.", "Interview Questions": "Why are you interested in this internship? Do you have experience working with emissions data?"}, {"date": "19 Feb 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Yale University", "Interview Descriptions": "Was a very good interview.  I liked it.  People were nice.  Respectful.  I don't have any complaints about the interview at all at this time.  I liked the facilities, too.", "Interview Questions": "Tell me about yourself?\r\n\r\nWhy this position?"}, {"date": "16 Feb 2022", "title": "Senior Program Manager, Office of Postdoctoral Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "First-round interview via Zoom. It was a pleasant and cordial interaction. This is a new position. Only 3 questions. Plenty of time to elaborate.  I wasn't invited back for a second interview.", "Interview Questions": "Three questions asked. I don't remember one. But the other two were:  1) Explain ways in which you have developed and assessed programs; 2) How would you identify resources to use in this position?\r\n"}, {"date": "24 Feb 2022", "title": "Senior Regulatory Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University in Feb 2022", "Interview Descriptions": "Invited for a first round interview about a week after the posting closed. HR managed the process through the ATS and the department got a list from HR. Invited for a second round interview 5 days after that. Informed that the hiring process took a while at Yale owing to HR being backed up. Have not heard back after the second interview which at this point was 3 weeks ago.", "Interview Questions": "Asked about my prior experience in a similar position mostly."}, {"date": "19 Jan 2022", "title": "Facilities Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "A few casual questions. The manager makes sure you are willing to do manual labor, etc. Not too formal. One on one. I received an offer after one interview and accepted.", "Interview Questions": "Willing to do manual labor?"}, {"date": "17 Jan 2022", "title": "Teaching Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It was a great interview. the professor was awesome, and I really enjoy the prospect of teaching people. the interview was very collegial and respectful. have I reached 30 words yet.", "Interview Questions": "what lecture would you give?"}, {"date": "18 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Yale University", "Interview Descriptions": "got a call from the manager\nhad an interview within  two weeks. \ngot a job offer within two weeks. \ngot to negotiate the salary and sign on bonus\naccepted the offer.", "Interview Questions": "what made you apply for this position? "}], [{"date": "10 Feb 2022", "title": "Digital Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Jan 2022", "Interview Descriptions": "Virtual interview, employer was forthcoming about the challenges of the role and the potential opportunities. We had a lengthy and enjoyable discussion. Any interview is stressful but this was one of the least I've encountered.", "Interview Questions": "Experience with CMS (content management system) platforms"}, {"date": "11 Nov 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Its consists of zoom interviews with program directors and supervisors. Questions include behavioral, background specific and experiences related questions, why us and this position, long-term short-term career goals and interests, personal interests, questions for them. Overview of what they do and the position.", "Interview Questions": "Why us, why this position, resume/experience questions, and behavioral questions."}, {"date": "15 Oct 2021", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Onsite interview with managers with site tour. Very classic interview style, nothing too surprising. They asked standard interview questions. It took a while from when I applied to when I scheduled the interview.", "Interview Questions": "N/A"}, {"date": "21 Oct 2021", "title": "Clinical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Oct 2021", "Interview Descriptions": "I applied directly through Yale website in early September. Then I received an email a few weeks later stating my resume was pulled and will be contacted by the recruiter. I then got a phone call from the Manager to set up an interview. The interview was via zoom and went very well. I interviewed with the operations manager and team lead.", "Interview Questions": "Tell me about yourself?\n\nWhy did you apply to yale?"}, {"date": "6 Sept 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Conducted an online Zoom interview that lasted about an hour. Was on a call with 3 staff members and they each rotated in asking questions. Nothing too out of the ordinary was asked.", "Interview Questions": "Do you have any data driven experience?"}, {"date": "3 Sept 2021", "title": "Yale Investment Office Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Behavioral featuring two rounds. They were really amiable and would ask you the question you expect but be prepared since they cut a lot of people. Overall wasn't too hard and was a good experience.", "Interview Questions": "Q: Do you have any leadership experience? "}, {"date": "23 Aug 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "First apply online for their PhD program. Months later the faculty will schedule online Skype interview. There is only one round. Two faculties joined the interview. The result was then released in several days later.", "Interview Questions": "I consider it as a common chatting. Plan about future research was asked."}, {"date": "16 Aug 2021", "title": "Guest Experience Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "called and emailed by a recruiter on a Friday night at 6pm to set up an interview for the following week. tried emailing and calling them back the following Monday and Tuesday, but no one ever responded to me reaching out to schedule an interview.", "Interview Questions": "N/A"}, {"date": "29 Sept 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University in Jul 2021", "Interview Descriptions": "Initially a Zoom interview with the Principal Investigator about basic duties, prior experience, and how I would be a good fit for the role. After being offered a second interview, I spoke with the team as a whole to determine if I fit into the dynamic. I was also asked some additional questions specific to the research project in question.", "Interview Questions": "How have you had to adapt to a tough situation in your past research?"}, {"date": "2 Jun 2021", "title": "Nursing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "The interviewer sent me a zoom link and asked me to log in so that she could conduct the interview with me. She asked me a series of questions and asked me why I was applying to the position and what I had to offer.", "Interview Questions": "Q: Why did you choose Yale to apply to?"}], [{"date": "24 May 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview process for the project manager position at Yale university Yale School of Medicine was a satisfying experience. There were multiple interviews consisting of group problem solving and one on one discussions with multiple departmental management and staff.", "Interview Questions": "Tell us about a time you experienced conflict among team members on a project you managed. How did you handle this conflict and what was the result?"}, {"date": "14 May 2021", "title": "Program Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Two different interviews, the latter involved creating a presentation about my professional trajectory and sharing that with the team and both interviews were very “fit” / question oriented where they wanted to hear specific stories and examples of my prior experience", "Interview Questions": "How will I focus on equity in the workplace?"}, {"date": "19 Apr 2021", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It was just one interview. It took over a month to hear back. The process was very slow and there was not much communication. Everyone was very kind in the interview.", "Interview Questions": "Q: Tell us about a challenging project."}, {"date": "19 May 2021", "title": "Research Assistant, Regulatory Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Apr 2021", "Interview Descriptions": "2 Interviews: One with a recruiter, one with 2 hiring managers from the team. It's been over a month since then, and I've sent multiple emails asking about my candidacy. Nada, zip, nothing. Then they reposted the position the other day. Apply here at your own risk; expect to be ghosted along the way. I can't speak for all the departments at Yale, but the regulatory affairs one stinks.", "Interview Questions": "Tell me what attracted you to the position, what would someone reviewing your work say is your biggest strength/weakness? No surprise questions, pretty standard."}, {"date": "4 Mar 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "Great, super streamlined and easy via Zoom. They were eager to meet and speak with me. I thought the process was easy and would do it again.  All I needed was a resume and a brief CV to get the interview", "Interview Questions": "When are you available to start working?"}, {"date": "1 Mar 2021", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Very easy but this may have been due to the fact that the interview process is expexited for those already affiliated with the school. They reached out within the week of applying!", "Interview Questions": "Why are you interested in working with us?"}, {"date": "29 Apr 2021", "title": "Covid19 Vaccine Clinic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Yale University in Feb 2021", "Interview Descriptions": "easy, did not ask much, did not review resume, a lot of training and paperwork involved. Will hire anyone to work at the clinic, it was a quick phone interview.", "Interview Questions": "what is your availability out of the week? "}, {"date": "6 Apr 2023", "title": "Bachelor Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Feb 2021", "Interview Descriptions": "The questions during my interview were not hard, as my interviewer asked me questions based on my responses. For example, if I mentioned one of my extracurricular activities, my interviewer would ask me to expand on it later. My interviewer did seem like she had a sheet of paper with questions because she was looking directly at me throughout the conversation. Honestly, I think this is much better than a regular interviewer with prepared questions as my interview felt like a normal conversation with someone interested in learning more about me. The whole interview lasted about 60 minutes.", "Interview Questions": "Tell me about your high school. What was it like? What is your favorite memory of it? Tell me more about your X extracurricular activity. How did you join? What did you learn there? Why do you want to study X major at Yale?"}, {"date": "16 Feb 2022", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Yale University in Feb 2021", "Interview Descriptions": "First interactions were with Human Resources to establish the connection. I had multiple interviews with team leadership and with the entire team. Team leadership informed me they would contact HR and HR would be extending the job offer.", "Interview Questions": "Published work from the team was shared with me and we discussed this at an interview."}, {"date": "27 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "1 interview that lead to a follow up chat and finally an offer to join their team and work on a short term project that would be completed within the year", "Interview Questions": "What’s your interest in Yale?"}], [{"date": "26 Jan 2021", "title": "Post Graduate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Met with two lead researchers and two people in the current position. Each interview was about an hour and they ask you questions and you ask them questions. Also had to submit your CV and cover letter before.", "Interview Questions": "How do you see yourself fitting into the culture here?"}, {"date": "11 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Reached out via email to the PI. Interview was a conversation with PI and tour of the lab. Talked through the project I would be doing. Did not ask for resume or anything of the sort.", "Interview Questions": "Asked about what previous research experience was and what I would be interested in. "}, {"date": "19 Dec 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Yale University", "Interview Descriptions": "get an email saying to set up a time for a short interview, and ask me some behavioral questions and some resume questions and explain the job duty ask me whether I have any other questions", "Interview Questions": "some basic behavioral questions about myself"}, {"date": "16 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I was asked why I am interested in the particular lab I applied to and what type of research I was most interested in. The interview was very straightforward abd took less than an hour.", "Interview Questions": "Why are you interested in the position?"}, {"date": "19 Aug 2020", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "There were several rounds, the initial round was a phone screen by another recruiter, 2nd round was a face to face with the same recruiter, another recruiter from the team and their boss, then there were several other rounds with Leaders within HR and even an interview with a few of the Leaders you would support in recruiting for their teams. All in all the process took over a month and had at least 4-5 interviews.", "Interview Questions": "Tell me about a time you had a business stakeholder request something that was not realistic and how did you handle it? "}, {"date": "20 Jun 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "I was referred by a professor. I emailed the professor and made an appointment. I went to professor's office to talk about my research experience. In addition, I expressed my interests in applying data analysis in a research team.", "Interview Questions": "What data analysis tools do you want to use when doing research?"}, {"date": "4 Mar 2022", "title": "Controls Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2020", "Interview Descriptions": "Interview was a little unprofessional. Seems like it was put together at last minute. Interviewers grew in the ranks from reg employees so they didnt know what a real professional looks like.", "Interview Questions": "normal questions but emphisizes on a specific software that isnt common to other workplaces."}, {"date": "20 Apr 2020", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview came after I submitted my application online. It was in the form of a brief (15min) phone call. I got the sense that the interview was more of a formality. There were no difficult questions asked.", "Interview Questions": "Why Yale? "}, {"date": "8 May 2021", "title": "Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Mar 2020", "Interview Descriptions": "Two phone calls followed by a series of Zoom interviews I started the interview process at the beginning of the pandemic.  Questions were straightforward about my previous experience and what I hoped to get out of the opportunity.", "Interview Questions": "Why are you interested in this program?"}, {"date": "10 Sept 2020", "title": "Data Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Yale University (New Haven, CT) in Feb 2020", "Interview Descriptions": "Comprehensive, with a focus on technical skills and cultural fit. Initial phone screen and then face to face/Video chat. Had difficulty in decision making as collaboration was slow and arduous", "Interview Questions": "Tell me about the most complex or difficult information you had to analyze?"}], [{"date": "1 Feb 2022", "title": "Archivist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2020", "Interview Descriptions": "A thorough and streamlined interview process. We went from phone interview to flying me out for the in-person interview quickly (relatively) and the interview lasted the entire day and was very comprehensive.", "Interview Questions": "What is a problem you have encountered and how did you overcome it?"}, {"date": "22 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Yale University in Jan 2020", "Interview Descriptions": "It was fairly calm and easy. Straightforward and expected questions. No surprises.  Have a personal strength and weakness for when they ask. They are big on customer service so make sure you talk about that.", "Interview Questions": "N/A"}, {"date": "13 Nov 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "fine,  standard because they asked a lot of behavioral questions, which is quite normal in the interview process. i showed them some of my previous experiences and explained why it would be applicable to my work here.", "Interview Questions": "Why do you want this job"}, {"date": "27 Jul 2019", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale University", "Interview Descriptions": "The process was very loose - I met with people and we chatted informally. Everyone was nice and it was low stress. Each manager is free to apply their own process for conducting interviews", "Interview Questions": "no formal questions were asked"}, {"date": "9 Jul 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Quick and very direct. I only  had to meet with one person and I received a call back 3 days later and I stared the job wth a month", "Interview Questions": "How did you manage stress with trying to meet a deadline?"}, {"date": "14 Jun 2019", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "It was a day long interview with most members of the 20 person office.  When applying, it was encouraged to send information to hiring manager along with applying through the online system.", "Interview Questions": "Talk about your past work with this population of students."}, {"date": "7 Mar 2021", "title": "Senior Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Jun 2019", "Interview Descriptions": "One phone interview then one in person. There are questions online on the Yale site that guide you through the types of questions they're looking for.  They just take forever to get back to you.", "Interview Questions": "Why are you fit for this position, 5 year plan, conflict resolution, etc."}, {"date": "14 Mar 2020", "title": "Specialist Master Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University in Feb 2019", "Interview Descriptions": "Received email from HR after one week application submission.\r\nThen phone interview with HR. HR is nice and friendly and asked a lot about your personality questions. One week after, got rejected.", "Interview Questions": "Basic question"}, {"date": "16 Feb 2019", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2019", "Interview Descriptions": "It was a phone interview that lasted about 30 minutes.  It was with a dedicated HR person for that department.  They told me that their vacation policy is 2 weeks which is not really suitable for someone at my stage in life.  I would take a cut in pay to have the vacation but they can't be flexible.", "Interview Questions": " How did you handle being criticized?"}, {"date": "28 Nov 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University in Feb 2019", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Your experience in working in complex environment and work style"}], [{"date": "15 Jan 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "It took about a month, and I was interviewed on the phone at first, then came in for an in person interview. The process was fairly easy and straightforward, which I liked.", "Interview Questions": "Tell me about your previous research."}, {"date": "7 Dec 2018", "title": "Clinical Receptionist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "Was called to  interview.  Interviewed with hiring managers and then almost a week later interviewed with department managers. Interview seem to go well. Reached our to my recruiter for update 2 weeks later since i jadnt heard back.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "24 Nov 2018", "title": "Construction Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Yale University", "Interview Descriptions": "What a circus.  \n\nI was brought in, no less than 4 separate times. Meeting with all group organizational levels and recruiters.  And each time I was there, each person talked about a different position. \n\nOne interviewer asked, “So what position are you here for?”\n\nIt was like Ground Hogs Day every time.  A waste of time, each time.  \n\nEither the group wasn’t aligned on the search and/or they are woefully out of sorts  My guess is both. \n\nEventually they passed on me.  But that’s because \n\nI had to call a few weeks later and find out for myself. I was told the decision was made a week \nprior to my call, just no one ever told me.  \n\nIf the interview process was an indictment of how the group is managed then a land mine was side stepped.  \n\nPoor form Yale.", "Interview Questions": "Why Yale?"}, {"date": "17 Oct 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "easy . be passionate and energetic for the interview .not much technical questions\r\nit was taken with 3 people .Be honest and positive and aggressive.\r\ndecent pay and no benefits for contract workers.", "Interview Questions": "tell us about your excel skills "}, {"date": "28 Feb 2020", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Oct 2018", "Interview Descriptions": "The interview for the Yale Young Global Scholars program was 30-minutes long and covered questions on curriculum development and how you would handle difficult interpersonal conflicts between students in the program. They also asked about prior teaching experiences, comfort dealings with students from diverse international backgrounds, and a few other curriculum related questions.", "Interview Questions": "Describe your ideal lesson plan."}, {"date": "25 Jun 2019", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Yale University (New Haven, CT) in Sept 2018", "Interview Descriptions": "Briefly asked about past lab experience, showed around the lab and cautioned the regulations. Talked about the schedule and openings for duty hours, screened the CV and asked relevant lab questions", "Interview Questions": "How do you respond to an emergency in the after hours?"}, {"date": "9 Mar 2021", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Yale University (New Haven, CT) in Sept 2018", "Interview Descriptions": "Quite informal, met manager and another staff to discuss the role. Also interviewed for an MT role but they gave me this instead I guess. Would suggest just applying to one or the other if you only want one of them.", "Interview Questions": "Tell us about yourself.\n\nBrainteaser guess an item based on asking questions."}, {"date": "21 Aug 2018", "title": "Postgraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Browsed the Yale departmental websites (including the school of Medicine) until I found a lab that interested me. E-mailed the PI afterward and described my situation and they invited me in the lab for the coming year, with pay.", "Interview Questions": "What are your plans for your gap year?"}, {"date": "9 Aug 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "i was asked to talk about the projects written in my cv. then asked me if i had any questions about study at Yale and living in new haven.", "Interview Questions": "describe the projects in details"}, {"date": "4 Jun 2018", "title": "Director of Mentors, Advisers and Partners Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Yale University in May 2018", "Interview Descriptions": "Overall the process has taken about 2+ months. I submitted an application online and was contacted via email by HR saying my application had been passed on to the hiring team. A month after that, I was contacted for an interview. The first interview was 30 minutes with the management team and a 10 minute presentation to faculty and staff of other Yale departments. A week later I was scheduled for a second interview with a member of the team I'd be working with.  The second interview was less structured and formal.", "Interview Questions": "Hypothetical questions regarding mentorship issues"}], [{"date": "4 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The internship is a summer research position for high school students. The process is just a Skype interview followed by a specific programming question. Then a few days were given for me to complete the task; I managed to finish it early.", "Interview Questions": "Python Programming - write a code that recreates an statistical example from a paper"}, {"date": "11 Jun 2018", "title": "Master-level Statistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Yale University in Apr 2018", "Interview Descriptions": "Phone interview lasted 20 minutes, I have no chance introduce myself, and started with my nearest project. And the interviewer focused on results of multiple academic projects. They preferred SAS, instead of R.  And about the database he mentioned, I didn't learn it before.", "Interview Questions": "Describe your nearest project, how about the result?"}, {"date": "5 Mar 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "The interview was very odd, the professors didn't allow me to resent, but instead jumped  into their interpretation of my work, interrupting and talking over each other. I was made feel very small because my previous school wasn't a well known institution.", "Interview Questions": "Why would you like to be at Yale"}, {"date": "20 Feb 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Mar 2018", "Interview Descriptions": "use machine learning to do research\r\ncheck the skill of java, C++ and R \r\nask question about coding skills and talking about other behavior things\r\nmeeting with two professor from the school of medicine", "Interview Questions": "do you know how to use subject in java"}, {"date": "3 Mar 2020", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Mar 2018", "Interview Descriptions": "Phone interview and then offered a postdoc position. Lots of the details of my research was aksed and the professor is very kind and tries to get to know all your skills that can be transferred to the lab", "Interview Questions": "Could you tell you about your research?"}, {"date": "5 Apr 2018", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University in Mar 2018", "Interview Descriptions": "I have mixed feelings about the process. I received an email after applying online that my application had been sent to a hiring manager. The individual contacted me with a calendar invitation to a meeting. NOTE: there is a phone number to call in with an access number in the calendar invitation. Our meeting was scheduled for approximately one week later. The interview itself was very positive. However, despite my following through with the HR requested followup, it's been radio silence.", "Interview Questions": "What research experience do you have?"}, {"date": "27 Sept 2018", "title": "ITS College Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Mar 2018", "Interview Descriptions": "The hiring process was a little strange. You couldn't apply for a specific position, you just had to apply to the broad umbrella of ITS/Finance, indicate vaguely your areas of interest, and then hope they matched you up with an area you're interested in for an interview. The interview was very fairly informal. I had mine over Skype as I was abroad. He just explained the position and asked me questions about my resume. It wasn't very intimidating, and I didn't really do much of anything to prepare for it. They are looking to fill spots and as long as you seem to vaguely have the skill sets they're looking for, you're probably good.", "Interview Questions": "Most of the questions were really specialized toward the job itself, which changes year to year. Telling you specific questions wouldn't really be helpful... "}, {"date": "20 Oct 2017", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "Applied online, and then was contacted months later. They have a poor response time and I wonder how many applicants they actually respond for, regarding each posting. I wouldn't recommend applying, as it seems the odds are against you with such a slow response and likely too many applicants to compete against.", "Interview Questions": "How many years experience do you have in programming?"}, {"date": "12 Sept 2017", "title": "IT Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Took forever for Yale to respond to application. I was brought in on a full day to perform  multiple panel interviews.  It was way too much of an ordeal for not a lot of money.", "Interview Questions": "How do you deal with time management."}, {"date": "23 Aug 2017", "title": "Senior Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "after application was sent to the hiring department. i was contacted to do phone interviews (with director of the program and two professors) after the phone interviews I was invited to do an in-person interview with everyone that I spoke with on the phone as well as other directors within the school. (all expenses for the fly in for the interviews were paid for by the program)", "Interview Questions": "what makes you a suitable candidate?"}], [{"date": "7 Aug 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University", "Interview Descriptions": "The interview was via Skype video and was about 30 minutes long. They were very interested in getting to know me. They followed up after the interview about 2 weeks with an offer.", "Interview Questions": "Why do you want to do a PhD"}, {"date": "11 Oct 2017", "title": "PTA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Aug 2017", "Interview Descriptions": "I was questioned by Manager, RPT and HR who were very nice and polite.  After a month of waiting I got job offer but declined due to low salary. Unfortunately, salary is non negotiable.", "Interview Questions": "Tell me about your experience and education. "}, {"date": "24 Feb 2020", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University in Jun 2017", "Interview Descriptions": "Two Skype interviews.  The first interview was with the PI only to describe previous experience and skills and more general questions. The second interview was with a panel of professors in the field.", "Interview Questions": "General research experience and presentation of previous research projects."}, {"date": "6 May 2017", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "3 people including mentor and director were sitting and asking questions. It was stressful. they asked about the skills. they talked about the future.  it was trough Skype.It was stressful. they asked about the skills. they talked about the future.  it was trough Skype.", "Interview Questions": "which software do you work with?"}, {"date": "11 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Apr 2017", "Interview Descriptions": "Received call scheduling receptionist, went in for interview, have kept in touch, but position has still not been filled and never heard back in the allotted time. Told I would hear back by latest 2 weeks.", "Interview Questions": "Tell me a time where you had to deal with conflict "}, {"date": "28 Mar 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "I reached the PI via email. We arranged a 20 min phone call. I flew to New Haven to give a 1hour talk in front of faculty members of the department (they paid for everything). People were friendly but cold (you sense the Yale ambience). I met with group members and a couple of faculty in person for a 15 talk each.", "Interview Questions": "At the seminar they asked me pertinent questions on my work (after all they were expert in that). Questions were mildly difficult, as expected. Then I talked with the PI about job. He didn't into too much detail (I regret I didn't insist)"}, {"date": "25 Mar 2017", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Interviewed by 3 managers from each campus.  They asked me an assortment of questions about my work experience and what if scenarios as well as tech skills. I can't believe this mandatory to fill out a review.", "Interview Questions": "Tell us about yourself."}, {"date": "14 Jan 2019", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Mar 2017", "Interview Descriptions": "You had to prepare a section of the campus tour to perform in front of a interviewer, who is a current tour guide. It was really laid back, and they didn't mind if you made an error or two, however NEVER make something up if you don't know it.", "Interview Questions": "What is the best part of being a Yalie?"}, {"date": "24 Jan 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Yale University", "Interview Descriptions": "Hiring process was easy but drawn out too long. HR took forever too do all my paperwork.  Otherwise the interviews were fun and engaging. Your interview will depend on what department you are in.", "Interview Questions": "Why do you want to work here? "}, {"date": "20 Nov 2017", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jan 2017", "Interview Descriptions": "there is no interview process for this job. it is first come first serve. the supervisors are very friendly. it is a collaborative environment. the tasks are normally very easy. the pay rate is good for students.", "Interview Questions": "there was no interview questions asked. "}], [{"date": "18 Jan 2018", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Dec 2016", "Interview Descriptions": "Very lenient, very short. Management needed a lot of help at the time, since a lot of people had quit previously due to student protests. It was pretty quick and just consisted of the manager showing me around and making sure I knew how to use basic Microsoft Office.", "Interview Questions": "What about you makes you qualified for this job"}, {"date": "11 Nov 2016", "title": "Teaching Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Yale University", "Interview Descriptions": "The process is terrible. You are supposed to reach out to profs to find open positions. One exception is cs50, which has a weird interview process-- they ask you to present stuff and then solve a bug in the first problem set while the interviewer talks childishly and annoys you", "Interview Questions": "Personal experince"}, {"date": "9 May 2018", "title": "Athletics Video Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Nov 2016", "Interview Descriptions": "Contacted Regarding Job, Applied Formally, Phone Interview, Flown in for In-Person. Phone Interview was with three people on the phone and lasted 20 minutes. In-person was a series of 4-5 one on one interviews with different people that I would interact with on a daily basis.", "Interview Questions": "How well do you deal with quickly diagnosing problems and making sure that games make air? "}, {"date": "23 Jul 2019", "title": "Web/Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Oct 2016", "Interview Descriptions": "Cordial and professional interview with direct supervisor. Reviewed job history and current portfolio showing numerous work examples. Discussed recent job history in detail, long-term job history, and various responses to challenges in the design practice.", "Interview Questions": "What is your philosophy of design?"}, {"date": "17 Sept 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Applied in ~Late November. Got an offer for interview early January. Attended the interview weekend early February (~4 day weekend). The actual interview part was just talking research with several professors. No particularly hard questions asked, mostly just about my own research experience. The hosts were current graduate students. There were also various activities like casual lunches with current faculty, housing tours, etc. Overall an enjoyable experience.", "Interview Questions": "Tell me about your research"}, {"date": "2 Sept 2016", "title": "Programmer Analyst III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Yale University (New Haven, CT) in Aug 2016", "Interview Descriptions": "Typical process meet with the team etc.  Nothing bad or good about the interview.  Interviewing with HR usually is a total waste of time. HR seems to think they should be the final word on hiring but for what. I have never figured out what HR actually does at a company.", "Interview Questions": "What is your greatest strength?"}, {"date": "15 Apr 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Yale University (New Haven, CT) in Aug 2016", "Interview Descriptions": "Phone Interview plus face to face interview with 10 people\r\n\r\nInitial phone interview via Skype and 2 weeks later an face to face interview with 5 people\r\n\r\nThere was another followup interview with 5 more people face to face. The team tool me to lunch as well", "Interview Questions": "General interview questions about career and work experience"}, {"date": "25 May 2016", "title": "Financial Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Went on an interview a week ago still waiting to hear back. They said it could take up to two weeks before I hear anything and to make sure I stay in touch. Also to email with any questions I might have.", "Interview Questions": "Why do you wanna work for Yale"}, {"date": "1 May 2017", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in May 2016", "Interview Descriptions": "Emailed for a while. Skype Interview and then an in person interview. Quick turn around in emails but once hired there was a long process in between starting the position.", "Interview Questions": "Have you previously used SPSS?"}, {"date": "13 Sept 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale University (New Haven, CT) in Apr 2016", "Interview Descriptions": "The principal investigator of the lab asked me why I was interested in the research and the type of experience I had working with qualtrics, SPSS, etc. It was not a difficult interview to do well at", "Interview Questions": "What was a time when you had to lead a team?"}], [{"date": "9 Oct 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Mar 2016", "Interview Descriptions": "It was for a student assistant. No formal interview was there. I had a brief chat with the program manager. We discussed the expectations, my roles, and responsibilities. Overall, I enjoyed working here so far. Great place to work. Very supportive staff and people around. There are many talks and lectures that you can attend.", "Interview Questions": "NO questions"}, {"date": "20 Feb 2018", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Feb 2016", "Interview Descriptions": "After cv, there is an interview following a quiz . All about academic questions related with this position. Just prepare that as the position indicates. The quiz is also abt the academic statistic questions with SQL skill.", "Interview Questions": "Whats your future plan"}, {"date": "13 Jan 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Extensive interview process - I met with 9 different people and sent a writing example beforehand. Several officers, department director, and administrative staff. The follow up was relatively quick. The process moved quickly once I got past the useless STARS online application system. Working with a recruiter will allow a more pleasant experience.", "Interview Questions": "Be prepared to talk about your Microsoft Office skills. Questions were thoughtful and relevant"}, {"date": "11 Jun 2018", "title": "ARS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Jan 2016", "Interview Descriptions": "the interview is dependent on the professor who wants to hire you. The human resource is not responsible for the recruiting and they just support you based on the university policy. They ask the questions like why you apply and what's your strength.", "Interview Questions": "why did you apply for this position?"}, {"date": "13 Jun 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Nov 2015", "Interview Descriptions": "Long, drawn out, interview process. You will interview with at least a half dozen people. The interviews are long, usually over an hour each. There is a great amount of questioning on your experience and knowledge of working for an institution of higher education. They fail to divulge that if you are hired you will be required to pay $100+ for parking!", "Interview Questions": "What makes Yale different from other similar institutions that makes you want to work here?"}, {"date": "7 Feb 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Nov 2015", "Interview Descriptions": "Whole day interview with lab people, gave a talk for 1 hour in the afternoon, was invited to lunch in a nice restaurant. The trip was reimbursed and I like the New Haven Hotel I was staying.", "Interview Questions": "what's your future plans?\r\nHave you applied for fellowships or funding grants?"}, {"date": "14 Oct 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Yale University", "Interview Descriptions": "Simply contact a professor and say you want to work for them. They will usually just have you come into their office and tell you a project that you can work on -- may not respond or just say no if they don't have anything for you to do in their lab.", "Interview Questions": "What are your interests, why do you want to work on X project"}, {"date": "21 Jul 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "I did not interview. The job was given to me because of a friend's referral. However, interviews seem to be purely behavioral from my understanding and are typically very easy. For most student worker positions some special super ultra amazing skills are not really necessary.", "Interview Questions": "N/A"}, {"date": "12 Dec 2016", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2015", "Interview Descriptions": "Phone interview, pre-screen, length of 30 minutes only. Did not get a feel for the environment or engagement, wanting to let them have the information they needed to form their opinion of me.   This was followed by in-person interview, and discussion of a specific project.  FYI, I was hired for this position, and accepted for this position.  The day I arrived, they changed my project, slapped a 40-hour limit on billable hours and informed me I would not be allowed to work remotely.", "Interview Questions": "They asked for examples of my project plans, status reports and writing"}, {"date": "29 Aug 2015", "title": "Buttery Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in May 2015", "Interview Descriptions": "There was no interview. I just had to fill out their online form to apply for the job, then a few weeks later I was offered the position, which I accepted. I was offered the job a little over a month before I was due to start working.", "Interview Questions": "N/A"}], [{"date": "8 Aug 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Apr 2015", "Interview Descriptions": "Long process, requiring multiple interviews with several different mangers  lots if talk about company culture and vision. Large amount of questions relating to personality and character.  Difficult to get initial interview", "Interview Questions": "How do you Handel difficult coworkers?"}, {"date": "21 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Mar 2015", "Interview Descriptions": "Interview was fair and not long. Met with principle investigator and members of lab at the university. Gave overview of my past research and answered questions that they had. I was then given an overview of what kinds of research questions the lab was currently pursuing and the which areas would fit my areas of expertise. It was good to already be familiar with the lab's past research and was informative to learn about the future directions the lab would be headed.", "Interview Questions": "Describe past research projects"}, {"date": "6 Apr 2017", "title": "ITS College Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University in Mar 2015", "Interview Descriptions": "I applied early online and heard back at a reasonable time. There were a couple of interviews with different teams, but nothing overwhelming. Overall, I think applying early helped me out, but resulted in a bit of a wait to hear back after my interview, but nothing ridiculous.", "Interview Questions": "Basic questions about my background, experience, a few general CS questions that weren't too tricky."}, {"date": "6 May 2015", "title": "Accountant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "Talked briefly about the position, went over my resume, asked me some personality questions, some experience questions, problem solving, where do I see myself in 5 years. Typical questions in an interview. No Gotcha questions, very straightforward just looking for help and wanted to know if I can do the job. I also new the person hiring which made it easier.", "Interview Questions": "What previous Grant Skills I had"}, {"date": "2 Nov 2016", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "There are three rounds: First, you do a written application and a panel interview in front of a few current tour guides where you give a short spiel. Second, you do two interviews with current tour guides. Finally, you give an audition tour to a real group of guests based on observing other tours.", "Interview Questions": "What is your least favorite thing about Yale?"}, {"date": "17 Sept 2015", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "It was a phone interview, it appeared to be going well during the description of responsibilities and expectations there were no real tell me about yourself questions, things changed when asked do I have any questions. The questions I asked were based on researching the position, however, 2 questions appeared to be unsatisfactorily answered. felt a mood change.", "Interview Questions": "How comfortable would I be interacting with an affluent donor?"}, {"date": "26 Apr 2018", "title": "Post Doctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Feb 2015", "Interview Descriptions": "a lot of technical questions were asked. I was talking about mostly my work from my PhD. Nothing special. They value what you've done for you PhD, and who you are.", "Interview Questions": "What do you imagine yourself 5 years from now."}, {"date": "4 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University in Feb 2015", "Interview Descriptions": "No interview needed. We just apply online, and the school returns an offer 3 month after the application. I was applying for Master program in CS with GRE 324 and TOEFL 106", "Interview Questions": "No interview needed"}, {"date": "2 Jul 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jan 2015", "Interview Descriptions": "A thorough interview with the team to assess skill level, technical skills, and soft skills.  The interview process was lengthy with multiple personalities.  I received a review of what the position would entail.", "Interview Questions": "Previous experience, what you most enjoy in your previous work."}, {"date": "1 Feb 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Dec 2014", "Interview Descriptions": "Interview process was decent, with many relevant questions asked, and responses given when you questioned in return.  Depending on interview, you may or may not interview with the Principal Investigator, which I found slightly insulting as they are the one hiring, not their staff.", "Interview Questions": "Have you ever done any bioinformatics before?"}], [{"date": "14 Nov 2014", "title": "CRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University", "Interview Descriptions": "Was contacted in a week after applying, process was very fast and straightforward, but background process is done by a third party who took some extra time. I had to meet with every team on the particular project one by one in different days as most of them were not available on the same day", "Interview Questions": "They believed I was over-qualified for the position, asked me what my rationale is for taking a low step"}, {"date": "29 Oct 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Yale University", "Interview Descriptions": "I contacted the group leader sending an email and resume. We had a telephone conversation. He requested 4 letters of recommendations. After a couple of weeks he asked me to visit the lab and give a 1-hour presentation in front of the rest of the department. After another two weeks he contacted me tell me I've been hired. My job started 9 moths later (but it could be sooner if I hadn't an agreement with the previous job).", "Interview Questions": "what are you going to bring to the group?"}, {"date": "15 Sept 2014", "title": "Associate Research Scientist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "This research faculty position was suggested by my adviser after two years as a postdoc in his lab. There was no official job posting and interview for this position and the hiring turned out to be just a smooth internal position transition.", "Interview Questions": "N/A"}, {"date": "10 Sept 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Once you get an interview it's fairly simple. You will be interviewing with another 40 students so just make sure not too stand out negatively. Prepare for meeting with individual Professors by knowing about their research and be able to talk about your own research and experiences.", "Interview Questions": "One related to my own research and the applicability in a clinical setting. "}, {"date": "29 Mar 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yale University (New Haven, CT) in Sept 2014", "Interview Descriptions": "chat with the prof and see if you have related background before. profs usually be nice to you and you don't have to worry that much if your answer is not perfect. They are flexible people in the universities.", "Interview Questions": "why you are interested in this job and what you could bring to this job"}, {"date": "18 Aug 2018", "title": "Kitchen Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Yale University (New Haven, CT) in Sept 2014", "Interview Descriptions": "Simple meeting with the manager of the center and tour of the building followed by some questions in his office about my history, work experience, why I wanted the job", "Interview Questions": "What do you consider your strength"}, {"date": "14 May 2015", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Jul 2014", "Interview Descriptions": "Whole process took about 3 months. Very thorough. Very nice people. Had an initial HR phone screening, then a one-on-one with the HR director in person, then a one-on-one with the hiring manager, then a group interview with the whole department. It was a lot of interviewing.", "Interview Questions": "How do you feel you can contribute to the department?"}, {"date": "19 Nov 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Yale University in Jun 2014", "Interview Descriptions": "I received a telephone interview 2 months after submitting my application, and was invited for an on campus interview 2 months after that. I was offered the position 1 month later.\r\n\r\nThe telephone interview was pretty straightforward: a series of about 15 questions, mostly pertaining to my previous experience. \r\n\r\nThe on campus interview included \r\n-a dinner the night before\r\n-3 individual interviews (hiring manager, another director and the dean) \r\n-a groups interview with the office staff\r\n-a presentation for 15 people including faculty, staff and researchers\r\n-followed by a discussion period with the audience.", "Interview Questions": "There were no very difficult or unexpected questions. Mostly they wanted to hear how I would implement a new series of programs. "}, {"date": "23 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 8 months. I interviewed at Yale University (New Haven, CT) in Jun 2014", "Interview Descriptions": "Appointment with 3 different Principal Investigators in the same field. The appointment were dispatched in two days total.\r\nAround 1h each during which you talk about your past research/contributions/motivations. And a little bit informal question at the end.", "Interview Questions": "What did you do during your PhD?"}, {"date": "9 Nov 2015", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in May 2014", "Interview Descriptions": "overall it was a good interview, the manager was very nice and did not ask anything difficult. The interview lasted about 20 min. I also met with a few library staff and librarians and had a tour of the library. Everyone was very nice and said they enjoyed working here.", "Interview Questions": "do you prefer cooking at home, or go skiing?"}], [{"date": "30 Aug 2018", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in May 2014", "Interview Descriptions": "I gave a presentation to the group for my research projects in Brown Univ and Scripps.  Supervisor was happy about my performance and productivity.  I had lunch and dinner with the group and get all the travel and related cost covered.", "Interview Questions": "What is the most critical factor for a postdoc research"}, {"date": "31 Mar 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Graduate students in my field are not interviewed prior to being accepted, but each field is different.", "Interview Questions": "Important aspects of grad school application are letters of recommendation, as well as one's personal statement, which must be aligned with at least some of the research being done at the university."}, {"date": "5 Aug 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Apr 2014", "Interview Descriptions": "Waited forever after applying to several posted online positions. No acknowledgement from HR ever if even received. Finally after two months or more, get an email stating one of the positions had been cancelled. Joke. They already have jobs so they could care less if youre left in the street.", "Interview Questions": "Why should we hire you"}, {"date": "5 Feb 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University in Apr 2014", "Interview Descriptions": "It was highly technical but brief. We talked about the research that they were conducting at Yale, we talked about my goals, the interviewer asked me why I applied and what made me think that this would be a good step for my career.", "Interview Questions": "Regarding my research. Why I want to join them. What are my goals."}, {"date": "5 Sept 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New York, NY) in Apr 2014", "Interview Descriptions": "good and easy to tackle,\r\nIf your application has been selected for an interview, a member of the department’s hiring team will contact you to set up a time. (If you don’t live in Yukon, initial interviews may be conducted by phone or Internet video.) Now, this is your chance to do some background research", "Interview Questions": "why do u apply for this job"}, {"date": "22 Jun 2016", "title": "Software Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Yale University (New Haven, CT) in Mar 2014", "Interview Descriptions": "Yale uses Brass Ring for entering formal applications for staff jobs.  The application is painstaking; none the information on an attached resume or other job site is automatically captured. In addition to the on-line application, networking is almost always necessary to get an interview.    In IT, staff jobs are rapidly being replaced by contract workers.  The interview process is very similar; count on many candidates and individual interviews with several stakeholders.", "Interview Questions": "How to you manage conflict in day to day work situations?\r\nWhat awards have you won recently from another employer?\r\nDescribe a situation where you had responsibility to make quick decisions."}, {"date": "27 Feb 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University", "Interview Descriptions": "First is phone interview. Some basic questions about research projects done before, why choose the new lab, any visa sponsorship needs. Then on-site interview to give a presentation, then meet with other postdoc working there.", "Interview Questions": "N/A"}, {"date": "28 Oct 2015", "title": "Recording Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2014", "Interview Descriptions": "My interview was at the studio with three current student staff members. It lasted for about 20 minutes. I heard back after three days. Found the opportunity on university's careers website. The three interviewers were all very nice. No tricky questions - just try to demonstrate interest and dedication.", "Interview Questions": "How flexible is your schedule?"}, {"date": "27 Jan 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Send CV first, got invited for onsite interview. The interview process took one day, including  1 hour presentation and 7-8 people one-to-one interview", "Interview Questions": "what do you plan to do if you join in the lab?"}, {"date": "21 Jan 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University", "Interview Descriptions": "My pi is great. Just the lab environment is not fit for me", "Interview Questions": "Deal with people"}], [{"date": "9 Feb 2014", "title": "Web Content Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jan 2014", "Interview Descriptions": "Applied online and was culled from interview process the same day.", "Interview Questions": "No questions asked."}, {"date": "14 Jul 2015", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Dec 2013", "Interview Descriptions": "Asked me about prior experience and interest. No hard questions, very eager to hire. Some behavioral and hypothetical questions regarding possible scenarios I might encoutner and how I'd react. Very casual, not stressful at all.", "Interview Questions": "What would you do if a customer came to you and said X is broken?"}, {"date": "20 Nov 2013", "title": "MD/MPH Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Very tight-knit community. Committed to supporting students and applicants.", "Interview Questions": "Statement of purpose."}, {"date": "1 Nov 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Aug 2013", "Interview Descriptions": "I initially contacted the PI about potential research in his group. Then we had some email exchanges about research projects. The we met in-person to discuss more about the future research projects. Offer was given shortly after. Post-offer processes went very smoothly.", "Interview Questions": "Describe your research plan. The PI provided inputs and eventually we found something that are of interest to both of us."}, {"date": "29 May 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Aug 2013", "Interview Descriptions": "The interview consisted of a full day of in depth scientific discussion with the hiring professor and a full 1 hour talk, including meetings with other laboratory members.  I was tested on my scientific knowledge and creativity, and potential work projects were defined.  The presentation is key to getting an offer, but scientists usually know you ahead of time.  I had met the hiring professor at meetings and so we were already acquainted.  They took me out to dinner at a nice restaurant in New Haven.", "Interview Questions": "What projects are you interested in doing and where do you see your future research?"}, {"date": "17 Jul 2013", "title": "Development Associate, Prospect Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Yale University", "Interview Descriptions": "There was a significant lag-time between submitting my application online and being contacted. After that, however, things moved fairly swiftly: a skills test, a chat on the phone, a Skype interview. The staff was incredibly kind, handled some technical snafus with grace, and were strangely interested in my background (which was completely unrelated to the position – frankly, I hadn't expected to be contacted at all). Overall, they seemed like a great team for which to work.\r\n\r\nAfter the last interview, they said they would get back to me in a couple of weeks or so; at that point, our brief run of incredibly consistent, frequent communication essentially fell flat. I only found out that I had not been selected when I happened to notice my status on the HR website. That being said, it remains one of the more enjoyable interview processes I've gone through.", "Interview Questions": "How do you handle distractions?"}, {"date": "22 Sept 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University (New Haven, CT) in Jul 2013", "Interview Descriptions": "There was an initial phone screen, and then a in-person behavioral interviews with HR and the managers of the group hiring you. The managers asked me about my experience, and a few light technical questions, and that was pretty much it. Much to my surprise, there was no whiteboard coding, no problem solving, nothing.", "Interview Questions": "How do you feel about working with people?"}, {"date": "26 Apr 2013", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Yale University (New Haven, CT)", "Interview Descriptions": "Informal interview with a senior associate in the dept led to interviews with Principal Gifts Officer, Principal Gifts Director, and other Development Associates. Then completed a directed writing sample.", "Interview Questions": "Describe a conflict of interest you have encountered in your work and how you handled it."}, {"date": "9 Aug 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Yale University (New Haven, CT) in May 2013", "Interview Descriptions": "Following the submission of applicaiton, i was contacted by the professor who was interested to hire me. We then had a phone/skype interview following which the professor offered the position by email correspondence after a couple of weeks.", "Interview Questions": "1. area of research and how comfortable was I in the area of research that i will be working on."}, {"date": "18 Oct 2016", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Apr 2013", "Interview Descriptions": "Phone/Skype interview that lasted about 30 minutes. Asked questions about research interest and what you want to accomplish during the postdoc period. One has to have well defined goals to accomplish anything.", "Interview Questions": "Research focus\r\nWhat you want to accomplish\r\nSend a writing sample"}], [{"date": "11 Mar 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Yale University", "Interview Descriptions": "Very informal.", "Interview Questions": "How to prioritize tasks"}, {"date": "1 Mar 2013", "title": "Post Doctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University", "Interview Descriptions": "applied online, followed by phone interview and visited the department for presentation of research work,", "Interview Questions": "None"}, {"date": "7 Dec 2015", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Yale University (New York, NY) in Feb 2013", "Interview Descriptions": "Very brief questions on what you want to be, plans for the future, and technical questions regarding laboratory experience(if any).  The atmosphere is very casual, and informative at the same time.  If you get an interview you're pretty much hired.  So if you live in the area and looking to make some temporary money while you find a real job, this is the position.", "Interview Questions": "What do you plan to be in the future?\r\nWhat do you know about working in a laboratory setting?\r\nDescribe how your college courses prepared you to work here."}, {"date": "15 Dec 2016", "title": "Ph D Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New York, NY) in Feb 2013", "Interview Descriptions": "I applied online and got a Skype interview from my future advisor. He asked me about my skills and research. He also asked about my interests on research and talked with me about the research I was going to do at Yale.", "Interview Questions": "Describe in details on one of my research experiences."}, {"date": "24 Jun 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Sept 2012", "Interview Descriptions": "I had worked previously with the Professor during my studies at Yale and so the process began with a clear description of my tasks during the research project and discussed my ideas for the research project. She was not interviewing anyone else for the position because she had decided to hire me for it. Overall, it went very well!", "Interview Questions": "She asked if the research project was something that I was interested in?"}, {"date": "5 Dec 2015", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in May 2012", "Interview Descriptions": "Applied online through school's employment opportunities website. Called in for interview - was asked straightforward behavioral questions - and a week or so later was told I got the job.", "Interview Questions": "What's one challenge you faced?"}, {"date": "30 Apr 2014", "title": "CCE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in May 2012", "Interview Descriptions": "Application, followed by short 15 minute interview", "Interview Questions": "How would you confront people who want to have a party?"}, {"date": "23 Jul 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yale University (New Haven, CT) in Feb 2012", "Interview Descriptions": "Online application followed by initial contact with PI and a 45 min interview with PI and another professor.", "Interview Questions": "Have you looked into previous work done on these lines?"}, {"date": "6 Nov 2012", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Jan 2012", "Interview Descriptions": "After contacting the Professor, all it took was a submission of my resume, and transcript. I was hired within a few weeks.", "Interview Questions": "None, everything was pretty standard. Yale really tries to get it's undergrads to do lab research - even for pay!"}, {"date": "23 Mar 2015", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Sept 2011", "Interview Descriptions": "Interview was conducted by a group of senior leaders in the area, along with prospective peers.  A follow up interview was conducted by the senior manager of the team.", "Interview Questions": "Describe a challenging project that you were involved in and describe how you overcame the challenged"}], [{"date": "29 Sept 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Yale University in Sept 2011", "Interview Descriptions": "I first had a phone interview. My PI briefly discussed the position. I then flew into NH and gave a talk 2 weeks later. I met everyone in the lab.", "Interview Questions": "Specifics of my previous training and what I could bring to the lab. "}, {"date": "29 Mar 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Yale University (New Haven, CT) in Jul 2011", "Interview Descriptions": "A thorough scientific interview involving a seminar talk with discussion. Separate interviews with the group's PI and other faculty members from the department, as well as other scientific staff over the course of three days. It was helpful for me to have had the opportunity to discuss science with all potential future colleagues beforehand.", "Interview Questions": "How will your research proposal fit into our group?"}, {"date": "21 Jul 2015", "title": "I T Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2011", "Interview Descriptions": "You basically goto the www.yale.edu website and click on \"working at yale\".  You create an account within their system and submit your current resume. Once that is done you can search their current available jobs database. Once you find a job that you are qualified for, you can apply for the job.", "Interview Questions": "I.T. technical questions and would you handle certain I.T. situations."}, {"date": "1 Jun 2012", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 7 weeks. I interviewed at Yale University (New Haven, CT) in May 2011", "Interview Descriptions": "Shortly after submitting my resume, I got a reply back confirming that the resume had been passed along. I then received an email requesting an interview a couple of days afterward. I was interviewed by a couple of people and I had the impression that it went pretty well overall. They were being positive and encouraging, but extremely vague on the timeline and I didn't hear from them for over five weeks, other than a brief non-informative reply back to my inquiry after three weeks. Later when I checked, they'd reposted the position with a totally different job description. I get that this happens, but they could have done a much better job of not leading candidates on and keeping them in unnecessary suspense.", "Interview Questions": "Tell us about a difficult challenge you faced at work that you overcame. "}, {"date": "16 Mar 2012", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in May 2011", "Interview Descriptions": "how to calculate the sample size? how to handle the missing data? how to build regression models...", "Interview Questions": "how to handle the missing data"}, {"date": "9 Jan 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Yale University (New Haven, CT) in Mar 2011", "Interview Descriptions": "The process was quick and easy because the lab was in immediate need of assistants and the job qualifications were minimal.", "Interview Questions": "N/A"}, {"date": "8 Jul 2015", "title": "Doctoral Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Yale University (New Haven, CT) in Mar 2011", "Interview Descriptions": "App submitted online with fee. No interview was required then, but rules have changed. Applied in November, notified of acceptance in late January or February, brought in for recruiting event in March. Interview was more recruiting, as offer had been received.", "Interview Questions": "N/A"}, {"date": "8 Nov 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, IN) in Feb 2011", "Interview Descriptions": "first mails about interest and skills;\r\nand then onsite fr a more detailed technical and experience test.\r\nincuding a presentation of previous work. and answered related questions\r\nget feedback in two weeks\r\nget offer in two weeks", "Interview Questions": "give a lecture and write a short proposal"}, {"date": "3 Aug 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Yale University (New Haven, CT) in Jan 2011", "Interview Descriptions": "There were no interviews held for this position.  The selections committee selected postdoctoral associates based solely on the materials submitted as part of the on-line application.  There was not even a phone or Skype interview stage for this position (at least in the department in which I was a post- doctoral associate, which was surprising, but nice.", "Interview Questions": "N/A"}, {"date": "14 Oct 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Yale University (New Haven, CT) in Jan 2011", "Interview Descriptions": "Whole day interview after a phone interview. Presented my graduate work and answered questions. Met with lab people to discuss the projects and the lab work culture. Met with administrative staff to discuss the immigration procedures and background checks. Had a 2 hour interview with PI about past experience and future goals apart from the project details.", "Interview Questions": "Scientific background"}], [{"date": "15 Sept 2011", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Nov 2010", "Interview Descriptions": "Meeting with two professor from Yale talking about own research.", "Interview Questions": "What is your research interest?"}, {"date": "23 Nov 2011", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yale University (New Haven, CT) in Oct 2010", "Interview Descriptions": "It is a regular interview for postdocs.  The professor came to meet me at the hotel, we had breakfast together, then we went to the lab to meet the rest.  I first give a presentation of my previous research, which didn't go great.  Then I talk to everyone in the lab, each for 30 minutes.  The last one to talk is the professor.  We then went to dinner and the whole thing finishes at 8:00.", "Interview Questions": "what is your career goal"}, {"date": "8 Feb 2012", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Yale University (New Haven, CT) in Oct 2010", "Interview Descriptions": "Interviewed with professor than the lead student. Very nice academia, people.", "Interview Questions": "Describe a difficult past experience and how you dealt with it?"}, {"date": "17 Nov 2014", "title": "Senior IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Yale University in Sept 2010", "Interview Descriptions": "Getting into Yale was very difficult.  Most of it had to do with the computer system they used for HR which would scan your resume for keywords and then kick you out if it didnt match up.  So often you would get bounced from the system without human eyes even seeing your submitted resume.", "Interview Questions": "There were not really any difficult questions in this interview.  It was a pretty standard review of past experience.  I think what really helped was the fact that I got in there and did some temporary work as an IT consultant and that opened the door for me."}, {"date": "1 Mar 2012", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Yale University (New Haven, CT) in Jul 2010", "Interview Descriptions": "First I spoke on Skype and told what I can and what I want. Then I came to the lab to give a talk. On the seminar with the whole group  PI asked a lot of questions on the subject. It was planned to meet several group members individually so they spoke about their research. In the end it was private conversation with PI and he offered a job.", "Interview Questions": "N/A"}, {"date": "5 Jan 2013", "title": "Associate Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Feb 2009", "Interview Descriptions": "I was a postdoc for several years prior to being promoted to Associate Research Scientist", "Interview Questions": "No unexpected questions were asked. I came prepared for the interview."}, {"date": "10 Sept 2012", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yale University (New Haven, CT) in Dec 2008", "Interview Descriptions": "Submitted online application, called in for a screening interview in HR. Offered a position different from the one I applied to, at a higher level based on HR interview. Yale can be slow to fill jobs, they don't have the same pressures as a private employer. It is common to not hear anything for a month or more and then be called for an interview. Very strict on requirements, especially education and years of experience.", "Interview Questions": "They focus on demonstrated accomplishments, so you will be asked to provide examples. "}, {"date": "16 Aug 2012", "title": "Associate Director of Community Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Yale University (New Haven, CT) in Sept 2008", "Interview Descriptions": "Great process with the physician who was hiring me.  I met with him at his home and spent a few hours being interviewed and being able to ask him questions as well.", "Interview Questions": "The Human Resources Department was very difficult to work with and it took 5 months to become a full time employee from a contact employee.  They always asked how I was qualified for such a high level salary."}, {"date": "17 Jun 2010", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Yale University (New Haven, CT) in Jun 2008", "Interview Descriptions": "After interviewing with the human resource director at the School of management i was set up to interview for several positions within the school of management each time interviewing with multiple professors who i would be working with.  Overall a good experience felt that some of the professors were not interested because they thought that I would not stay in the position very long", "Interview Questions": "What was the last book that you read?"}]]