[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jul 2022", "job_title": "Adjunct Instructor in Irvine, CA", "duration": "N/A", "pros": "They provide you with great resources.", "cons": "Nothing at the moment, yet."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "quit after 1 day", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jun 2023", "job_title": "Admissions in Irvine, CA", "duration": "N/A", "pros": "Free Gym and Parking Nice people Decent office", "cons": "I left because I received a job offer for a similar role that offered a significant increase in salary, along with enticing benefits such as unlimited paid time off and catered lunches three times a week. When I initially accepted this job, I had hoped to work my way up. Unfortunately, the base pay was disappointingly low, making it an unattractive proposition. I was incredibly grateful when the other company approached me with their offer. On my first day at my previous workplace, I experienced exhaustion to the point of almost tears, and the thought of returning there filled me with dread. The employees consistently mentioned the shortage of staff and frequent turnover, which became apparent why. The workload was overwhelming, and the compensation did not justify the effort. It would have been different if the job wasn't demanding, but they themselves admitted to being weeks behind in enrollment, which I was supposed to help fix. It simply wasn't worth it. I must admit, though, that everyone there was exceptionally kind, and that made me hesitate about accepting the new offer. However, turning down a $50,000 increase in annual salary, incredible benefits, and all the other perks of the new job would be foolish."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Meh", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Jun 2023", "job_title": "Adjunct Professor in Irvine, CA", "duration": "N/A", "pros": "The students are excellent and they are passionate about their business degrees!", "cons": "The curriculum, the administration, the lack of classes, the pay is bad because it is on the LOW level of teaching and it depends on how many students you have in your classes. NOT FAIR!!!! Not worth my four months of employment there!!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Okay.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 May 2023", "job_title": "Head Coach in Irvine, CA", "duration": "N/A", "pros": "Enjoyed working with almost everyone. Close-knit community.", "cons": "Lack of facilities. Unorganized. Revolving door."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Turnover sky high and their only care is profit", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jan 2023", "job_title": "Professor in Irvine, CA", "duration": "N/A", "pros": "You get to meet a lot people who also think this place needs serious changes. Professors all agree that management is abhorrent, unskilled, and incapable of doing the smallest tasks.", "cons": "Between Glassdoor, Google, and Indeed, the never ending negative reviews should tell you anything you'd want to know. Turnover among faculty and staff is colossal. They do nothing about it. They know it is due to paying about half per hour what they should, but yet they don't change their rate and you cannot argue for more per hour. They will not offer you more hours because they do not want to have to offer any benefits. You are a hourly employee and will get less than 15-20 hours a week no matter what your education or experience. No promotions or raises of any kind. You will be assigned more work than you could ever fit into those hours and you will get emails harassing you should you go over your hours. You will also get negativity only from management. For example, if you overlook something in a class, they email you and threaten your job, but will never email you to tell you something positive that you're doing. Only negative. The micromanagement is out of this world, I have never seen micromanaging this heavy. Again, only to tell you what you've done wrong, never to recognize anything you've gone above and beyond for. They claim they are student focused but everyone knows it is all about making the professors do the most about of work for the least amount of pay. People quit left and right because they refuse to budge on pay and hours. Also due to the excessive control they have over you. They will log into your classes whenever they feel and try to find things that are wrong. Not because they have any concern for students, but because they need to make sure people are working themselves to death but are also staying under their hours. They claim you can make suggestions but no one does because they will retaliate. If they said theybwould take an anonymous poll of their faculty and staff regarding these exact issues, no one would answer honestly because they know it is not really anonymous. It's almost a cult-like atmosphere, I've seen that comment before about westcliff and now I understand it. I wonder how much longer they want to play the turnover game before they realize that paying more, giving more hours, and holding management accountable for being incapable is the answer."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Westcliff review", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Feb 2023", "job_title": "Student Services Advisor in Irvine, CA", "duration": "N/A", "pros": "Lovely environment, colleagues and staff.", "cons": "Very undeveloped and understaffed for awhile now."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Would Not Reccomend", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Dec 2022", "job_title": "Student Accounts Representative in Irvine, CA", "duration": "N/A", "pros": "It has a hybrid work system and full benefits.", "cons": "The lack of an automated system makes every single task incredibly frustrating, tedious, and time consuming. There is not enough inter detrimental communication to the detriment of both the staff and students. There is not enough staff so often student needs get neglected by necessity to get the daily tasks required to allow the university done. For example, having 900 unread emails for the student accounts department is a common occurrence- and supervisors will tell you to ignore the emails in favor of other more pressing tasks. This hurts the students most of all and understandably leads to them getting very frustrated and stressed out. The lack of an automated system and the lack of comprehensive training leaves a lot of room for human error, which again often hurts the students. Depsite having worked here for six months there are still so many student questions or questions from staffed that I haven't been trained on and thus don't know how to answer. Requesting training means my supervisor will string me along for weeks saying they'll get to it and then eventually giving me a rushed training in the last thirty minutes of my shift which covered the basics and nothing more. The management is clearly not equipped to lead even a small team to success and this makes the life of everyone on the team worse by adding utterly unnecessary complications and stress. Also despite working a full time position for more than minimum wage, I cannot afford even a studio apartment."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Head Coach", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jul 2022", "job_title": "Head Coach in Irvine, CA", "duration": "N/A", "pros": "Building programs, competitive teams, international students", "cons": "Housing, structure, facilities, balance, salary hours"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great opportunity with good environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Apr 2022", "job_title": "Finance in Irvine, CA", "duration": "N/A", "pros": "This place is really nice to work at, I've had an amazing experience and do recommend this job for anyone that wants to know more about higher education. They are growing a lot and this can come with it's problems but the process is working and I'm excited for Westcliff.", "cons": "Pay is below market and this causes turnover."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Know your worth- AVOID- Trust me, you can do better than this!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Oct 2021", "job_title": "Student Services Advisor in Irvine, CA", "duration": "N/A", "pros": "Team was great, sometimes we got free food", "cons": "FOR PROFIT UNIVERSITY (that should tell you enough), call center cubicle floor plan for all departments in one big room (not ideal for confidential student meetings, but the students don't matter here, just their tuition does) complete lack of appreciation for any staff, \"management\" is an utter joke, the university is based on nepotism, the pay is AWFUL and the \"raises\" are nonexistent (MAYBE you'll get .50 cents after a year of utter chaos. You will not make more than $20/hour here"}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Great Staff, Sad Pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Mar 2022", "job_title": "Adjunct Professor in Irvine, CA", "duration": "N/A", "pros": "Great staff, remote only, excellent students and international students, Good schedule", "cons": "Terrible pay for having a MA degree, LMS Moodle has strange quirks and things don't always work correctly"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "University that is growing too fast and hasn’t developed themselves properly", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Oct 2021", "job_title": "Anonymous Employee in Irvine, CA", "duration": "N/A", "pros": "It’s a job I guess so that’s a pro", "cons": "Too many to list but a few is the unwillingness to give raises or when a hardworking employee asks for a raise they get told no or we can only offer a few cents, poor education development focus is more on profit and image of the school than actually providing a good education system."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "A University with Heart!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Mar 2022", "job_title": "Talent Acquisition", "duration": "N/A", "pros": "Company environment\r\nHuman Resources and Leadership is passionate about inclusion and diversity", "cons": "Needs additional technology and higher pay rates for some positions."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The worst company I have every worked for", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Mar 2022", "job_title": "Associate in Irvine, CA", "duration": "N/A", "pros": "NONE. Absolutely horrible company. Dishonest and unethical.", "cons": "Management is dishonest and unethical, they break the law a million times a day. They think they are better than everyone else and can get away with whatever unethical thing they want to do."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "This place is a nightmare, but may be a good stepping stone if you're willing to tolerate it", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Dec 2021", "job_title": "Student Services Advisor in Irvine, CA", "duration": "N/A", "pros": "-All the manipulation and workplace BS we had to go through resulted in the SS team becoming my best friends\n-Flexible schedule\n-A possible pro: if you're trying to get experience/get your foot into the door in higher education, this can go on your resume", "cons": "-University and management only care about money, not the students nor the staff\n-Ridiculously low pay. many advisors had master's degrees and were not compensated for their education\n-Disorganized \n-Student Services constantly gave valid feedback about how processes, policies, etc, could be made better (because we actually CARE about the students), but no changes were ever made. We had the same problems over and over again because management never did anything in response to our concerns.\n-When we brought valid concerns to management, we were often told that we were \"negative,\" \"aggressive,\" \"complaining,\" and so on. \n-The policies are always changing, and Student Services is often the last to know about it, making our job a lot harder. Not only that, the policies often hurt the students, once again showing that the university is just maximizing profit, not truly caring about giving students an education.\n-I've heard from students that their Student Services Advisor was the only good thing about Westcliff... I think that says something\n\nDon't listen to any of the replies Westcliff management adds to these reviews. It's just another example of the manipulation they put their staff through. Just like when I was employed, instead of actually bringing our concerns into account, they just discredit us and make us look like the bad guy. \n\nI'll conclude with this: I've woken up multiple times recently where my first thought was, \"Wow, life is so much better without Westcliff.\""}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Corrupt", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Mar 2021", "job_title": "Academic Advisor in Irvine, CA", "duration": "N/A", "pros": "The location isn’t bad for work.", "cons": "Everyone here is lowballed on their salary and are overworked. Management makes you wear multiple hats and gives you tasks that are supposed to be for other departments which they are too cheap to hire for. Everything and I mean EVERYTHING has to go through the CEO who just puts his family in the high positions of the university. It’s more so a cult of his family that works in the managerial and high paying positions and new college grads that are desperate for jobs being over worked in entry level positions.  The pay is below the average and no career advancement unless you’re related to the CEO. 1/10 recommended."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Lack of quality, great coworkers", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Jun 2021", "job_title": "Admissions Advisor in Irvine, CA", "duration": "N/A", "pros": "- My coworkers were fun and we all worked hard together\r\n- Fun team outings every semester\r\n- Free food for events", "cons": "- Low pay\r\n- Poor quality students\r\n- Too many agents that were allowed to do whatever they want but were low in quality"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Overworked and Underpaid", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Feb 2021", "job_title": "Financial Aid Advisor in Irvine, CA", "duration": "N/A", "pros": "Nice, young, coworkers. Sometimes there’s free food.", "cons": "Employees spread thin due to their lack of resources and unwillingness to hire help. They expect you to work overtime. There’s constant confusion due to lack of communication between departments and no written policies."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Massive Disappointment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Apr 2021", "job_title": "Admissions Representative in Irvine, CA", "duration": "N/A", "pros": "Fun out-of-work team building exercises", "cons": "Driven by nepotism, sweatshop, and disastrous \"benefits\""}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Students", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Jan 2021", "job_title": "Professor in Anaheim, CA", "duration": "N/A", "pros": "Some of my best times have been teaching the live sessions with students", "cons": "They only offer low paying positions"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Incredible Coaching Opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Jan 2021", "job_title": "Coach in Irvine, CA", "duration": "N/A", "pros": "Family type atmosphere.\r\nThe only School that has such a tight-knit Athletics Department with outstanding leadership. \r\nFree reign on managing and operating your team as a coach. \r\nExpanding rapidly", "cons": "In more of a building stage."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Baseball", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Mar 2021", "job_title": "Assistant Baseball Coach in Irvine, CA", "duration": "N/A", "pros": "Great environment with great people to work with.", "cons": "Limited office space. Small campus."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Job Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Jan 2021", "job_title": "Anonymous Employee in Irvine, CA", "duration": "N/A", "pros": "The staff are supportive and wonderful", "cons": "Benefits and salary aren't the most competitive"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great part-time job,  not a career", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2020", "job_title": "Writing Center Tutor in Irvine, CA", "duration": "N/A", "pros": "Flexible hours\r\nConsiderate management\r\nChallenging yet rewarding work\r\nGood pay", "cons": "Low hours-per-week cap\r\nProgram is in its infancy\r\nLimited resources for students"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Love it here", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2020", "job_title": "Academic Program Chair in Irvine, CA", "duration": "N/A", "pros": "Great people\r\nValue honesty and loyalty\r\nReward good work", "cons": "None that I can find"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Loose Structure", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Oct 2020", "job_title": "Student Advisor in Irvine, CA", "duration": "N/A", "pros": "There are some very passionate people here", "cons": "The school won’t be able to create a name for itself if they expand quicker than they can lay a firm foundation"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Growing institution to grow within", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 May 2019", "job_title": "Director in Irvine, CA", "duration": "N/A", "pros": "I have thoroughly enjoyed my time work at Westcliff University. Yes, there are its ups and downs but we have worked through them. Westcliff is a teaching institution but also a learning institution. The administrators in charge find feedback and make efforts to start improvements to make the working life much more enjoyable. Working at Westcliff University has been extremely beneficial in my growth. I have found that I have learned many new skills and had many opportunities to grow and show my abilities in many different areas. I have moved up during my time at a fast pace and have grown to become a stronger leader. The administration as a whole has been improving its policies and procedures. The staff is all extremely hardworking and you can see the efforts in all that they do for each other and the students.", "cons": "The company is growing so there may be some growing pains that are being worked through. Retirement (401k) to be added soon."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "AVOID", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Jan 2019", "job_title": "Anonymous Employee in Irvine, CA", "duration": "N/A", "pros": "-There's a Walmart and Starbucks within walking distance\r\n-Work gym is pretty nice and new as it is designed by VKCC\r\n-Ambiance of the work place outside is nice, there's a pool table, volleyball court, farmer's market every thursday,  large uno cards on the vollyeball court provided by the building center\r\n-Near the Distrct\r\n-paychecks are mostly on time", "cons": "-All reviews past 2 stars are fake and posted by current employees. Highly suggest going to the interview (prepare to wait an hour), and just look at the school and ask questions.\r\n-like previous complaints, family owned, for profit, does not care about the students or employees, all about money\r\n-non existent benefits or health insurance and holidays\r\n-directors are all family/friends. No room for growth unless you are family or willing to stay past 5 years\r\n-You are monitored every minute, from the minute you enter the building, t bathroom breaks to water breaks\r\n-no one has been there for past a year and a half unless your family. student services is always hiring, admissions is too.\r\n-check out the 'campus', should speak for itself. Be prepared to move desks and chairs every 8 weeks for new student orientation, only to move it back\r\n-advice: trust the reviews"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Collaborative Environment, Caring People in All Levels", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Apr 2019", "job_title": "Finance in Irvine, CA", "duration": "N/A", "pros": "The university has been on a steady rise for years with change, growth, and improvement constantly occurring. Regionally and nationally accredited, constant growth in all facets, financially stable, great leadership, a family atmosphere within all employee levels without all of the family drama. No egos and politics. Better than average ranges for annual increases. Senior management actually addresses employee concerns and implements change very quickly.", "cons": "System inefficiencies but those are workable. There are growth opportunities but limited room for advancement past senior management level."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Genuine Review", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 May 2019", "job_title": "Student Advisor in Irvine, CA", "duration": "N/A", "pros": "I worked for Westcliff University as a student advisor for more than a year. I left the company a few months ago, and the only reason I left this wonderful place is due to an unforeseen circumstance that occurred in my life. I am truly grateful for being able to be part of the family. During my employment with WU, all I felt was love, care, and support from the staff and managers. Westcliff University can be considered as a developing and growing company, but from the CEO to all the managers of different levels or departments, they are extremely professional and kind. When I first started the job, my manager established a thorough training schedule, which definitely gave me a clear idea of the company culture and responsibilities. I had the opportunity to get to know the different managers from various professional backgrounds. While having those trainings, my manager also allowed me some time to self-reflect on what I have learned from that day. My manager would also reference outside professional experience to give me a different perspective. Moreover, occasionally we will have some cross-training with other departments to not only help us with our job but also gave us the opportunity to build great relationships with all the other departments. This enabled me to provide the best service to our students. Very often my manager would hold a team meeting to allow all of us to get to know each other on a deeper level. Therefore, our communication within the team was never an issue. Occasionally, we would also have events off campus and they always tried to accommodate everyone's schedule. I remembered I missed a couple of events, even the yacht party, but was quickly updated by my teammates with fun pictures. They always made be feel included no matter what. Some events also included staff awards to show their appreciation and recognition of our hard work. \r\n\r\nWestcliff University has a friendly working environment. Everyone treated each other as a family and genuinely cared for one another. I always felt that they treated everyone fairly. My schedule was flexible and my team and I always worked out coverage for each other if someone couldn't work a specific shift. If I made a mistake my manager would correct me immediately, but would always provide encouraging suggestions for improvements. Moreover, the company really cared about the self-development and professional development of the employees to maximize each person's potential. There were in-house presentations and guest speakers who came to provide workshops to help us with our development. Besides that, take me for an example, my manager saw my ambition and potential and specifically assigned me to work with another department in order to learn additional skills. This was a great opportunity for me and I am really grateful for that. \r\n\r\nOverall, Westcliff is a place you can call home, a place you can truly grow, and filled with joy and love while working there.", "cons": "Processes were constantly and evolving, but that makes sense in a growing company."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Growth, Loyalty, Effort, Innovation", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 May 2019", "job_title": "Admissions/Outreach in Irvine, CA", "duration": "N/A", "pros": "I saw Westcliff in it's beginning and was part of their initial growth... no one understands the tremendous pressure of starting a business unless they have done it themselves and the upper management team is a shining example of hard work and innovation. There's an incredible amount of energy and resources required to make sure students are served, employees are paid, and... as every single business is designed to do... create a profit so they can grow each year and serve everyone better. The fact that they were able to exceed expectations in this venture and become as large as they are so quickly is the result of a loyal, dedicated, hard working and innovative staff. They expect the best out of everyone. In today's society of weak minded lazy college grads they are doing something different to create strong minds with their employees through high expectations. They promote that students develop not just hard skills, but soft skills backing their education, so they don't show up to job interviews like a deer in headlights! People see what they want to see and if people are expecting to just coast by at a company like this they won't last. You'll need to exceed expectations and if you stick it out you'll be better for it. That's how it is when you're basically part of a University startup! These days they are much more than that. They've started up.\r\n\r\nThe recent change in location is evidence enough of the incredible dedication of upper management to provide a growth environment and create employment opportunities. Their  loyalty to their students and staff is truly that of a family beyond the family members that work there. People like those who leave bad reviews see what they want to see and I was a part of helping Westcliff staff filter through the best of the best staff members to create the growth environment that exists today. There are many stories of individuals that started in basic positions like admissions and student services and have now become directors and assistant directors... NONE of them related to anyone in any way.", "cons": "The bull pen style environment can get cramped, but you can't start out at the top. Pay could have been higher, but they can't go out too far on a limb and expect to keep their doors open. I've heard it's better now."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A fantastic University to grow your career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Jun 2019", "job_title": "Assistant Director of Career Services in Irvine, CA", "duration": "N/A", "pros": "I have worked at Westcliff University in both the Admissions and Career Services Departments now for about 5 years.  During my time here I was promoted vertically and then horizontally. I started off in Admissions as an advisor, and within 2 years I moved into an Assistant Director of Admission (ADOA) position helping co-manage a team of 10-13 people. After 2.5 years in that ADOA role, I decided I would like to be considered for the Career Services Dept, and I was granted this opportunity from management who believed in me, and continue to do so.  Over the last 5 years, I have seen us skyrocket in growth. Of course, there has been growing pains, but all around Westcliff University has been consistently better month after month and year after year.  We had approximately 50 students in 2014 and now we have roughly 2,400 students worldwide – 97 percent growth! This is highly impressive in an industry where several Universities are closing, yet we are flourishing.  This significant growth has been due to several factors, but mainly it is due to our high referral rate from our students who see the quality of our education (WASC & DEAC accreditation) and dedicated staff/faculty – 94 percent of students would recommend us!  When you experience growth like we have, you will attract and keep those who wish to grow with the University – those who are not only mission driven, but those who are adaptable, welcome change, like challenges, like to support each other and are excellent problem solvers.  As a reminder to those that worry about changes, the Education industry consistently changes to keep up with innovations, accrediting body requirements and public demand and with that comes process/policy changes.  I have always been drawn to innovative, challenging, yet nurturing environments, with positive people who motivate you and push you to grow, and give you opportunities to take on projects – Westcliff University has this! With time, along with my typical admissions duties, I had the opportunity to assist in the creation and development of several projects (professional University-wide videos/documents/resources, event planning, webinar hosting, technology research and development, outreach events, professional development workshop creation, and enhancing other services to students). My teammates throughout the years have also been given several projects to work on as well that have transformed them professionally. We have 2 admissions seniors that within 1-1.5 years received a title and salary promotion. I see how other staff show a sense of pride from supporting our students and having ownership on their projects. Westcliff leadership takes care of their employees, listens to feedback and takes appropriate actions when needed. Some things take time, because it involves several factors, but with time, I have seen countless developments suggested by staff: employee manual, campus events, professional development workshops, new technology, etc. I have seen promotions for many advisors across all departments through the years. It seems like every 2-3 months there is another promotion - not exaggerating. Those who get promoted (are not family/friends by the way) – It is those who consistently show their dedication to students, stay up to date with knowledge, show professionalism and maturity, those who exert leadership, take initiatives, and collaborate well with others.  Additionally, leadership shows their appreciation for all staff by offering semester employee outings, both as departments and as a company: go to local restaurants, bowling, Dave & Busters, OC Fair, Escape Rooms, Paint & Wine, Taco Catering, Staff Appreciation events. \r\n\r\nIn response to complaints on this website, just know there is ALWAYS two sides to a story, and there several employees who are happy and have continued to work here throughout the years. If you are seeking to have hard established routines, zero innovation, zero changes, only doing what is listed in your job description exactly, not support others, then this may not be for you. As a side note, Directors are not family – we call ourselves family because of how we take care of each other, support each other personally/professionally, and we have a common mission – to educate, inspire, and empower our students.", "cons": "With all the  growth and exciting initiatives,  I recommend that more communication is shared as much as possible to keep everyone in loop of all the developments."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Opportunities for Growth with Amazing People", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jun 2019", "job_title": "Anonymous Employee in Irvine, CA", "duration": "N/A", "pros": "I’ve been working at Westcliff University for several years and there are plenty of opportunities for growth. The staff and management team are amazing people and the majority of people you ask would also agree! \r\n\r\nThere are plenty of opportunities to be promoted horizontally and vertically. I actually came in as a part-time staff member to work as an assistant in one of the departments and shortly after they recognized my hard work, I was asked to stay full-time. Not only have I been promoted, I have also seen promotions throughout all departments. I have seen many staff members who have excelled from an entry-level position to mid-level and/or senior-level management position.\r\n\r\nThe university hires often because they are growing; therefore, in order to support students, staff, and faculty effectively, they need to continue to hire more staff. Those who genuinely care about students and believe in the mission of the university tend to have a more positive attitude. Unfortunately, there are some staff who do not have the same mission as the university and sometimes try to influence others. The reality is that every place you work at will have people who will gossip about their different perspectives (positive or negative). The important thing to remember is only the strong minded will NOT be influenced by just \"one\" perspective. Many of the staff members have their good days and bad days, but I truly feel a good number of the staff members can decipher between a common problem that just needs to be addressed versus what has become an individual's personal problem that was taken out of context. There are always multiple perspectives to every situation.\r\n\r\nThe university have amazing staff who work hard together to support students. Many of them come into an entry-level position and have potential to be future leaders of this current society. Why wouldn’t Westciff University want to develop them? Of course they do! Everyone treats each other like a family not only within the department but also across departments. My reference to \"family\" is the actual family \"culture\", which has been misconstrued as if there were many friends/family members working at the university. To help put into perspective based on some of the reviews, some employees have referred their friends and/or family to apply for jobs at the university. Referrals are common in every company. Nonetheless, these referrals only resulted to a few friends/family out of 100+ employees that are working at Westcliff. This is not much at all if you really think about it. There are also some employees who have worked here for many years and also share the same mission and values, which naturally allowed them to develop strong bonds and treat each other like a family. \r\n\r\nAdditionally, the management team cares about the growth of the staff and the university. There are occasional presentations that are held to promote personal and professional growth. The CEO, in particular, is an intelligent, educated individual who is also going through the same growing pains as the staff, just on a different level. He is fair to all employees, whether they are at the entry-level or management level. Everyone just has to remember that the CEO is also human and could very well make mistakes just like all of us. However, he is genuine, reflective and is always willing to make a change. In the past year there have already been great changes and I'm sure his vision is to continue to make improvements. \r\n\r\n\"Leadership is the capacity to translate vision into reality.\"  -- Warren Bennis", "cons": "Sometimes the university is growing a little too fast but these growing pains are challenges that are inevitable."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "FREE T-Shirt for this Review", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Oct 2019", "job_title": "Admissions Advisor in Irvine, CA", "duration": "N/A", "pros": "~ Hard-working coworkers\r\n~ A $15 Free meal at the end of every 16 weeks (after recruitment) \r\n~ Cubicle windows to see the faces of my coworkers", "cons": "~ Manipulative Bosses\r\n~ Free t-shirt for this review \r\n~ Most of the \"positive reviews\" on here are fake \r\n~ Not enough benefits"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Assistant Professor", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Dec 2018", "job_title": "Assistant Professor in Los Angeles, CA", "duration": "N/A", "pros": "There are many opportunities for faculty involvement.\r\n\r\nI love being a professor here!\r\n\r\nFaculty can voice their opinions in various ways. \r\n\r\nStudents are hardworking and care about their grades.", "cons": "I do not have any cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Atmosphere For a University", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Oct 2019", "job_title": "Anonymous Employee in Costa Mesa, CA", "duration": "N/A", "pros": "Amazing atmosphere, wonderful/kind people, plenty of opportunities for growth within the company, uplifting staff who is always there to help!", "cons": "The school is outgrowing it's facilities, but is managing well for their level of growth."}]]