[[{"date": "16 Aug 2022", "title": "Faculty Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Highline College", "Interview Descriptions": "teaching demonstration and group panel.  also meet with VP of academic services. you will have the opportunity to tour campus and meet other faculty members. i felt welcome and that the hiring committee was invested and engaged in the process", "Interview Questions": "Why did you close to apply at highline ?"}, {"date": "21 Jun 2021", "title": "Finance Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Highline College", "Interview Descriptions": "Applied for a different position that filled internally and was offered the next available fit. Everyone was very friendly and professional. I did not feel any preconceived judgment, it was a very fair and neutral environment.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "25 Jan 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Highline College", "Interview Descriptions": "It was an over skype business call. I spoke with a hiring committee and then to the dean of students. They had a series of questions but prior to the interview, I had a to prepare a powerpoint presentation on how I would make changes or improvements to the program.", "Interview Questions": "What experiences contributes to this job position?"}, {"date": "8 Jan 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Highline College (Des Moines, WA) in Jan 2019", "Interview Descriptions": "Excellent 1st round of panelists and questions. They made it a great experience and I would recommend taking the time to understand the full potential of the position you are applying for.", "Interview Questions": "What were my long-term goals?"}, {"date": "19 Jul 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Highline College in Jan 2019", "Interview Descriptions": "The employer was nice and simple, with useful instruction and guidance for new people.  Moreover, enjoyable and fun, and the atmosphere was not stressed out or terrifying the candidates much.", "Interview Questions": "Why do you want to choose the job?"}, {"date": "18 Dec 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Highline College (Des Moines, WA) in Oct 2017", "Interview Descriptions": "Email to inform me applications were being reviewed. Phone call for interview then confirmation email wirh the individuals who were in the screening committee with agenda for interview. Background check, screening committee interview, meeting with VP academic affairs 1.5 hour interview process. Offered position 2 days later by HR.", "Interview Questions": "How i would best support a team member with a problem with a student."}, {"date": "8 Nov 2017", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Highline College (Des Moines, WA) in Dec 2016", "Interview Descriptions": "Easy process. Just submit online, go to the interview and answer. You will get hired. They give the flexible schedule, good pay, good hours. No benefits but it's a good on-campus job.", "Interview Questions": "What is your schedule?"}, {"date": "20 Nov 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Highline College in Feb 2015", "Interview Descriptions": "I first received a brief phone interview after applying online. Next, a interview with  panel of about 6 people all from different departments conducted an interview with me. The atmosphere was fairly cordial. Lastly, I had an interview with the Vice President of my department, and the director. They were kind and warm, and difficullt to read!", "Interview Questions": "What is diversity to you?"}, {"date": "7 Jul 2015", "title": "Proctor/Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Highline College (Tukwila, WA) in May 2014", "Interview Descriptions": "I had my interview with the Supervisor and her boss at the time. It seemed to be rather quick. They just asked me about my previous jobs and what types of computer programs that I know. I was basically told at the interview that I had the position, the hours they thought I would be working and what the job position requirement were. The whole process took about less than 40 minutes, and then I was shown around to where I would soon be working.", "Interview Questions": "What kind of computer programs do you know?\r\n\r\nHow do you deal with difficult people?\r\n\r\nWhat type of work did I previously do?\r\n\r\n"}, {"date": "22 Sept 2016", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Highline College (Des Moines, WA) in Aug 2013", "Interview Descriptions": "I filled out the application online and was notified for an interview several weeks later. I sat in on a committee that consisted of people from all over the campus who had an interest in who would be hired. They asked specific questions about my background, experience, core values and what I thought about diversity and inclusion.", "Interview Questions": "How do you define diversity and what experience do you have in working with diverse populations?"}], [{"date": "3 Sept 2015", "title": "Head Volleyball Club Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Highline College (Des Moines, WA) in Oct 2011", "Interview Descriptions": "Local clubs always put out coaching offers/opportunities to the local college teams because coaching is only part time work and as a collegiate player we have the skills and knowledge to coach the sport we play. I was approached by the director of South End Jrs Volleyball Club and asked if I would be interested the position of a 15's club coach. I was interviewed by the 2 club owners John and Chris and was ultimately offered the position. I had to attend one coaching seminar in order to become certified as a club coach and I also had to pass a background check.", "Interview Questions": "How would you respond to an unhappy parent?"}]]