[[{"date": "18 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "The interview process was very straightforward. They really wanted to get to me as a person. They mainly asked behavioral and clinical questions. Very chill, felt more like a conversation than an actually interview.", "Interview Questions": "How do you handle a conflict?"}, {"date": "19 May 2023", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center in Apr 2023", "Interview Descriptions": "Only spoke with the recruiter who was wonderful and super nice. Unfortunately there were candidates ahead of me in the interview process and therefore I did not get an additional interview since the position was filled a few days later.", "Interview Questions": "How would your coworkers describe you?"}, {"date": "22 Feb 2023", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "A few interviews with leaders and initial screen with HR. Slow process overall. Negotiate high once you get an offer, if you rise through the ranks, you will get small bumps and overtime be paid well below market", "Interview Questions": "Tell me about your experience"}, {"date": "16 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "The interview was easy to set up. The staff was responsive to questions. The hiring directors and managers were kind and friendly which made it feel like more of a conversation and less of an interview", "Interview Questions": "clinical questions and behavioral questions"}, {"date": "12 May 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "On the interview there were 2 or 3 people on the virtual call which made me soooo nervous.  They'll give a you a schedule for you to pick your interview day and time.", "Interview Questions": "What are your strengths and weaknesses ?"}, {"date": "14 Mar 2022", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "It went smooth, great people and lot of opportunities for student nurse.  I was all set to start working there until covid hit and they cancelled the student nurse program.", "Interview Questions": "Where do I see myself in next few year? "}, {"date": "3 Mar 2023", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center in Feb 2022", "Interview Descriptions": "Overall, the experience was relaxed. I was interviewed by two people (nursing manager and director). They asked about my clinical experience, previous work experience, and how I respond to difficult situations. They also asked me how my classmates would describe me.", "Interview Questions": "What clinical experience have you had so far? Tell me about yourself? Tell me about a time when you had to deal with a difficult situation. How did you respond?"}, {"date": "20 Jan 2022", "title": "New Grad Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Interview process was completely virtual due to the pandemic. About a 40 minute interview with the nurse manager where I was asked some questions and then give information about the unit.", "Interview Questions": "Why do you want to work here? "}, {"date": "23 Jan 2022", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jan 2022", "Interview Descriptions": "HR personnel called me after I applied on their website. They asked me about my previous experience and the expected salary and then the lab director called me to ask me a few technical experience I had in my previous jobs. They also asked me about the work benches I want to get trained on...", "Interview Questions": "What made you apply to our organisation?"}, {"date": "25 Oct 2021", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Phone interview with the nurse director and patient care managers. They are nice people, and they asked many questions. The nurse recruiter emailed me to let me know  I got the offer after I finished the interview.", "Interview Questions": "What are your strength and weakness?"}], [{"date": "3 Aug 2021", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MedStar Washington Hospital Center in May 2021", "Interview Descriptions": "It was a Zoom interview with one of the managers. It seemed very informal like I was just having a conversation. It only took about 15 minutes total and they told me they would extend me an offer afterwards.", "Interview Questions": "Tell me about yourself. \r\nDescribe a time when you felt proud of the work that you did.\r\nWhy do you want to work on this unit?"}, {"date": "25 Feb 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "It was a Quick and easy interview. They asked a few questions and it was a phone interview instead of a zoom call. They said that I should hear back in a few days", "Interview Questions": "Why are you interested in this unit?"}, {"date": "15 Feb 2021", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center in Feb 2021", "Interview Descriptions": "I sent in my application for the hospital overall then was emailed to specify my top two areas of interest. From there they sent my application to my unit of choice and then I had one interview with the Nurse Manager.", "Interview Questions": "What makes you the best candidate?"}, {"date": "22 Jul 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "Online application, in person interview. interviewed with director of nursing first and then the individual floor that I wanted to work on with nurse manager and other floor members/nursing staff", "Interview Questions": "What has been the most challenging clinical experience"}, {"date": "30 Jan 2021", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center in Jun 2020", "Interview Descriptions": "I had a phone interview for a new graduate nurse position with the unit's Nursing Director. It lasted less than 20 minutes. The Nursing Director asked basic questions regarding my interests and past experiences.", "Interview Questions": "Tell me about a time when you worked with a difficult patient, what happened and how did you deal with situation?"}, {"date": "12 May 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Required one day of interviews, where I met with various members of the Cardiology Team. I was asked about my strengths and weaknesses, and various timeline-related questions. It was a very standard interview", "Interview Questions": "Where did I see myself 10 years from when I was in high school"}, {"date": "26 Mar 2020", "title": "Labor and Delivery RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "After a learning session, I moved on to the interview process. The interview was about 30 minutes total. I first met with the Nurse Managers and then the staff. They were very pleasant and I felt at ease.", "Interview Questions": "Tell me about yourself"}, {"date": "7 Jun 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MedStar Washington Hospital Center in Mar 2020", "Interview Descriptions": "Scheduled an interview after applying 3 or so weeks prior. Phone interview was conducted between 2 higher ups which lasted about an hour.  Not many technical questions asked, but inquired about my willingness to learn. Asked questions about current position and what tests I was familiar with. HR was very responsive through the process. A week later I received an offer for a higher position than applied.", "Interview Questions": "What tests and analyzers are you familiar with?\r\nWhat part of the lab are you associated with?"}, {"date": "4 May 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Feb 2020", "Interview Descriptions": "I interviewed for a New Grad Residency. I met first with the Director who gave information on the unit and answered questions. I then interviewed with 3 staff nurses and then later 3 of the unit Managers. Everything was a pretty free flowing conversation, very casual. I also went on a tour of the unit.", "Interview Questions": "Why this unit?"}, {"date": "23 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Oct 2019", "Interview Descriptions": "Very long interview process which didn’t feel that long as we were fully engaged the entire time. \r\nInterview lasted 2 hours. My questions were not complete but it was stopped there.", "Interview Questions": "You’re doing the change of shift report and the pct reports low gmr for one of your patients what do you do?"}], [{"date": "21 Aug 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Aug 2019", "Interview Descriptions": "This is by far one of the most negative interviews I’ve been on I got there 15 mins early for my appointment the recruiter was nowhere to be found finally another recruiter comes out 45 minutes later and apologizes and walks me over to the hiring managers office the hiring manager was nice however she seemed very busy and uninterested in anything I had to say which made me even more nervous she also seemed a little rude I was sent a rejection letter the next day but the following day she called back and said she was  going to reverse it but I would only be prn (on call) im not sure why I didn’t get the position I use to do the same work at medstar Georgetown hospital however that was temporary I live literally 5 mins away from Washington hospital center which would have been very convenient but I guess they hire who they want", "Interview Questions": "Behavioral questions"}, {"date": "3 Sept 2019", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jul 2019", "Interview Descriptions": "Met with the recruiter to do a preliminary interview with basic questions. Then taken to the unit and interviewed with the nurse manager. Also took a tour of the unit with the unit manager and was able to see the unit layout as well as the patient population.", "Interview Questions": "Asked basic questions such as my interest in nursing and my desire to work on a particular unit as well as experience. The unit manager did ask unit based practical questions about how to care for specific patients as well as questions about medications, pathophysiology and clinical scenarios. "}, {"date": "30 Jun 2019", "title": "Patient Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Simple. Interviewed with staff and with managers. Took about 3 hours total. Asked about 5 year plan and goals and where i wanted to see the staff.  Open ended Questions. Staff rated me on a scale between 1-10.", "Interview Questions": "What is your 5 year plan?\r\nWhere do you see staff? \r\nWhat are your goals for the associates?"}, {"date": "12 Jul 2019", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jun 2019", "Interview Descriptions": "The first half was okay, it was mostly the recruiters talking about the hospital and RN residency program. This was great. Second half,  was the interview with one of the units on your preference list.", "Interview Questions": " tell us about a time you had a difficult patient, and how you handled the situation. "}, {"date": "5 Mar 2019", "title": "New Grad Nurse Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Mar 2019", "Interview Descriptions": "Met with HR and nursing educators for an informal information session. They went over benefits/salary information and the general structure of the program. A staff member from the department where I was interviewing escorted me to a managers office. I had a short interview with one of the department managers to discuss previous experience and answer behavioral scenario questions. I was also asked about 4-5 clinical scenarios and asked what I would recommend in that situation. The manager then explained unit specific program structure, training, scheduling, and did a quick tour of the unit.", "Interview Questions": "Tell me about a time you had a conflict with a coworker"}, {"date": "22 Aug 2019", "title": "BMET II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Feb 2019", "Interview Descriptions": "Standard interview process. Completed over three stage 1) Phone Screening with HR, 2) Face to Face with supervisor & director, 3) Peer Interview with staff and 4) HR salary offer. \r\n\r\nUnion backed positions and salary doesn't match cost of living/market of DC.", "Interview Questions": "Questions focused more on behavioral or situational assessment skills. Such as customer service, conflict management, organization/time management & etc. Minor technical questions pertaining to some equipment.  "}, {"date": "17 Dec 2018", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Dec 2018", "Interview Descriptions": "I applied online and received a email a few days later. I met with HR recruiter and then the managers on unit I applied for. It was a panel of managers totaling 4 people.", "Interview Questions": "Tell me of a time you had a difficult patient and how did you deal with them?"}, {"date": "21 Nov 2018", "title": "Clinical Sonographer I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Oct 2018", "Interview Descriptions": "Routine interview. Went to speak with HR. Waited like 30mins for the representative. Had a great interview, or what I thought was a great interview. Then department head was called. Waited another 20 to 25 mins. Of course I had to show my skills by scanning a patient.  Again, another great interview I thought. One statement stuck to me like glue. \"I think your over qualified\". So, I believe I did not get the job b/c of only \"6\" years of experience. That must seem like a decade. Not really sure.", "Interview Questions": "How would I fit in with the team?"}, {"date": "10 Feb 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MedStar Washington Hospital Center in Aug 2018", "Interview Descriptions": "Very thorough in a way that you go through HR first, the unit manager comes down to the HR office to meet you, walks you to the unit while giving you a tour and then sits you down to ask some questions about you and what you know.", "Interview Questions": "Clinical question: A patient comes to the ED with following symptoms - foul smelling breath, vomiting and abdominal pain and distention. Patient reports he hasn't gone to the bathroom for a while. What do you suspect?"}, {"date": "14 Aug 2018", "title": "New Grad Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Aug 2018", "Interview Descriptions": "Prior to the interview a recruiter reached out after looking at my application and asked me a few questions about where I want to work, about my license, etc. Afterwards she sent me a list of dates to come out to interview. On interview day you come out to HR and give your paperwork to the receptionist. Since it was an RN interview day, there were other candidates sitting there waiting. After a little while I met with a recruiter and it was more to get to know me, understand the new grad program, and to get a feel of the hospital. The recruiter asked a few questions such as why I chose this hospital. After a little while I went back out in the receptionist area to wait for the unit manager of the unit I applied to and when he came down we went back to the unit to have another interview. I met him and the patient care manager and we interviewed for awhile. After about 20 minutes the PCM took me to meet the nurses on the unit and we had a more informal peer interview. This was great because I got a feel of the unit without it being super stressful. Everyone was incredibly pleasant and they asked me some scenario questions. Make sure you ask questions too! After awhile there I took a tour of the unit and my interview was done. Overall I probably spent maybe two hours interviewing. I received my offer about an hour after but unfortunately I had to decline due to not having enough time to transfer my license from out of state. Honestly one of the best interviews I’ve ever had. Everyone was friendly and it was great to have everyone try to get to know me and learning what makes this hospital and unit so special.", "Interview Questions": "How to deal with a difficult patient"}], [{"date": "15 Jun 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "I applied through the link online, and got an email with a couple follow up questions. I was then selected for an interview, and chose a date from a list of available dates. The interview went very well! The first portion is with HR, and they give you general information about benefits, salary, etc. Then, you interview with the unit manager. Make sure you brush up on the patho and general clinical scenarios relevant to the unit you're applying for! They want to know that you have the ability to critically think. I did well because I spent a lot of time preparing, but I know people that got denied the position and had to re-interview for their second choice unit because they were caught off guard with the clinical questions. After the interview, the unit manager gave me her information so that I could set up a shadow shift. Overall, it went very well!", "Interview Questions": "Why Washington Hospital Center?"}, {"date": "1 Jul 2018", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jun 2018", "Interview Descriptions": "You sign in and give all your documentation to the receptionist. They first sit you down with your recruiter. She asked me a few questions and asked what units I was interested in. She called all the units to see which ones needed staffing and then she set up the interview with the specific unit nurse manager. I’m not sure if this is standard but another recruiter took me to the unit to meet the nurse manager. I had two sets of interviews down there with three people. They all extremely nice and sweet. It was a great process overall. Just remember to come prepared with a lot of questions since you will be meeting with a lot of different people.", "Interview Questions": "How would you deal with a difficult patient?"}, {"date": "25 Apr 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Apr 2018", "Interview Descriptions": "Applied online. Filled out a battery test after receiving an email from HR. Was contacted by HR again and asked a few questions and then was provided an interview date and time. I met with one person from HR and then a Unit manager.", "Interview Questions": "What is your best quality that you can bring to this position?"}, {"date": "23 Jan 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jan 2018", "Interview Descriptions": "It was fun and interesting talking about the job and it's functions in the job, and what was supposed to be needed daily at the job. Then I was told that I would be called", "Interview Questions": "How I would handle a difficult and fustrating client?"}, {"date": "9 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Oct 2017", "Interview Descriptions": "First you apply . They send you an email confirmation as well as an email saying you are hired. You go in to an initial interview with a nurse recruiter then you go to an interview with the unit leader .", "Interview Questions": "What made you come to work on this unit"}, {"date": "13 Apr 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "The interview process is very thorough. Brush up on your clinical research terminologies (what is an IRB? What is a 1572? etc). Be ready to talk about how you manage your time and interact with others or handle stressful situations. Also, for whatever department you're applying to, make sure you understand the anatomy or bodily systems involved with that area of the body or disease group.", "Interview Questions": "How do you manage your time?"}, {"date": "29 Apr 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Apr 2017", "Interview Descriptions": "Met with HR for interview and general questions  and then met with the nurse manager on the unit I had applied to work on. Had more interview questions and clinically focused questions.", "Interview Questions": "Why do you want to work here? And other general questions, and then more focused clinical questions related to the unit I wanted to work on."}, {"date": "1 Mar 2017", "title": "Creative Services Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Feb 2017", "Interview Descriptions": "Met with HR, the VP of Marketing and Public Affairs, Director of Marketing and a writer, over a period of 4 hours. The HR person asked some peculiar questions, obviously from a pre-employment form that they must use for every single applicant, regardless of their role, so some of the questions did not make any sense for the position I was applying for. They also said I was required to bring in \"original proof of my highest level of education.\" I have no idea where my college diploma is and I don't think most people do unless it's framed on the wall of their study.", "Interview Questions": "What is your biggest weakness"}, {"date": "24 Jan 2017", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jan 2017", "Interview Descriptions": "I submitted my application later october and got a response in about 3 weeks. Asking to state my unit of choice, where i did my final semester preceptorship, GPA. After that, they sent me a questionnaire ... then confirmed my interview. I first interviewed with HR and then with Unit manager. Asked similar questions. not too difficult. I suggest you practice basic interview questions.", "Interview Questions": "Why Did you choose this hospital? What do you need to work out in the workplace? what is your best asset you can bring to this position? What do you need to best succeed in this position? Why should we hire you? A patient comes in with low B/P and fast heart rate a week after abdomen surgery, what do you think is wrong? What tests would you do? what drugs would you give? Tell me a time you had to provide excellent customer service, and what was the result? A patient has weakness all day, and is not aphasic, what do you think is wrong with them? what heart rhythm would you expect them to be in due to this condition?  "}, {"date": "8 Oct 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Oct 2016", "Interview Descriptions": "Interview with human resource nurse. Then interviewed with the unit director.  Had to ask to see unit after interview.  Floor had heavy patient load and high turnover of nurses.", "Interview Questions": "Tell me about a situation when you had conflict and how you resolved it."}], [{"date": "19 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Oct 2016", "Interview Descriptions": "Nurse career battery test , interviewed about past work experience and the skills I had , my application is considered as a candidate after I pass the nurse career battery test", "Interview Questions": "How to work as a team "}, {"date": "20 Aug 2016", "title": "Histotechnologist In Dermatopathology Lab Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jul 2016", "Interview Descriptions": "I applied for Histotechnologist position in Dermatopathology Lab on Tuesday, July 12, 2016.  I received an email from the human resources generalist on Wednesday, July 13, 2016 to schedule an onsite interview.  We scheduled 1:1 with the human resources generalist and panel interviews with the director, manager, and doctor on Thursday, July 21, 2016. and had an onsite one on one interview with the human resources.  At the same time, I got an email from the manager in Histology Lab at this same hospital.  I spoke to her on the phone on Friday, July 22, 2016.  I received the notification that I will not me hired due to lack of staff two weeks later.  The Histology Lab is not fully staff and unable to train me fully.  I thought that this would apply to Histopathology Lab as well.  So, I continued on searching for a Histology Lab Assistant, entry level Histology Technician, or Research Associate position.  I did not expect to get an email from the Dermatopathology Lab director on Friday morning, August 5, 2016, notifying me that the human resources generalist will contact me during the week.  After going crazy with anticipation and anxiety feelings with waiting for the email for the whole weekend.  I wasn't sure that I would be recalled for a second onsite interview, get a different job position, or a job offer.  Finally, I got an email on Wednesday, August 10, 2016 from human resources general with a job offer for this position with a salary above the expected salary.  It was worth the long wait to finally get this position.", "Interview Questions": "They asked me bunch of questions such as why do I want to work there and would I be interested in working in the grossing."}, {"date": "9 Jun 2016", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Applied Online, received an email two days later asking for some more info (what unit I was interested in) and to take the nursing career battery, which was immediately followed up by an invitation to interview. They gave me a set of dates they were interviewing new grads, I chose the second soonest date which was about two weeks later on a Friday. I brought my letters of rec and was first interviewed by HR. Then the head unit manager came to HR and walked me to the unit while continuing to interview me. After arriving at the unit the assistant unit manager interviewed me for another 30-45 minutes ending with some clinical scenario questions. I received a phone call Tuesday morning with the job offer.", "Interview Questions": "Describe one time you handled a difficult patient."}, {"date": "29 Jun 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jun 2016", "Interview Descriptions": "Efficient and well organized. Interview with HR and nurse manager took less than two hours. This interview was better organized than most other places I've applied. Clinical questions were difficult but I suppose that is to be expected. Focused on both clinical management as well as more general values / teamwork type questions.", "Interview Questions": "Clinical questions about patients you've taken care of. "}, {"date": "1 Mar 2016", "title": "Patient Care Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "I Received a voicemail from a HR nurse, I called back the same day and heard back about a week later to schedule an interview. I had a phone interview with the nurse director and patient care manager. Then HR contacted me a few days later to schedule an in person interview. I interviewed with the HR nurse first, the nurses and nursing assistants interviewed me next, then a panel of patient care managers. Unfortunately for external applicants, they seem to select a lot of internal applicants for this position. After the interview, it took 2 weeks for HR to notify me that I was not selected.", "Interview Questions": "What is a servant leader? "}, {"date": "8 Jul 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Dec 2015", "Interview Descriptions": "The process quick and straight to the point. Questions that were asked were very informative and had much to do with the job being interviewed for. The interviewer was very respectful and polite.", "Interview Questions": "How do you handle adverse situations?"}, {"date": "18 Sept 2017", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Dec 2015", "Interview Descriptions": "Group of departmental heads talked to me about the position, asked me a few question about me and work ethics .  Departmeant heads also wanted to know my 5 year plan.", "Interview Questions": "What are your strength and weaknesses."}, {"date": "24 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "apply online for RN residency program\r\ncall from HR (took a while to get this call)\r\ninterview with HR and then unit manager \r\nreceived a call back within the same day with an offer\r\naccepted", "Interview Questions": "If you have a pt with elevated HR and decreased BP what would you do?"}, {"date": "6 Apr 2016", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Aug 2015", "Interview Descriptions": "I went though a temp agency, they asked me questions about me having experience in cleaning, so it was a brief interview. It took about 3 weeks to start working ,I had to get my paper in then had to wait for my results to come back.", "Interview Questions": "You have experience in cleaning?"}, {"date": "10 Dec 2015", "title": "Laboratory Processing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jul 2015", "Interview Descriptions": "I applied online and I was called a few days after being offered a formal interview. They were very flexible in scheduling me a set date and time for my interview.", "Interview Questions": "How do my previous experience qualify me for this job"}], [{"date": "16 May 2015", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "Contacted by HR about a month after I applied. Interviewed by HR and the pharmacy department. Very straight forward questions. More of them explaining their operations than asking questions. Contacted about a month after the interview by HR", "Interview Questions": "Explain a situation where your recommendation wasn't accepted  by a physician and how you handled it."}, {"date": "21 Jul 2015", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Washington Hospital Center (Washington, DC) in May 2015", "Interview Descriptions": "It was very straightforward, and common interview questions. They asked about my past experiences and how I would fit into their department. Overall, the interview process was set up quickly, a little disorganized but that is expected when you are meeting with physicians who see patients and have busy schedules.", "Interview Questions": "Why should we hire you?"}, {"date": "24 Apr 2017", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Apr 2015", "Interview Descriptions": "Clinical based questions, scenarios on what you would do, with different patient presentations, also a few background questions. The manager who interviewed me gave me time to think through the questions. But for the most part they were all based on disease processes any nursing student would be familiar with", "Interview Questions": "Patient presents with active chest pain, radiating to right arm, sob, what is your course of action?"}, {"date": "18 Mar 2015", "title": "Pharmacy Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Great experience--had to do a power point presentation. I met with other residents, pharmacists, and managers. There was one-on-one interview session as well as group. I was asked to do a thirty-minute power point presentation to the pharmacists. They also had question and answer session. I was also asked to evaluate an order flagged as a problem order. When I answered I saw nothing wrong with it, the manager agreed that there was nothing wrong. It was a trick question.", "Interview Questions": "Asked what was wrong with an order"}, {"date": "14 Jan 2015", "title": "New Graduate Nurse Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Hiring process was easy, interviewed for a position I was not interested in.  The interview panel was friendly and courteous but I wasn't interviewed on time. Appointment was at 1030 I wasn't seen until 11.", "Interview Questions": "What is teamwork? "}, {"date": "9 Jan 2015", "title": "Medical Office Assistant II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "All applications are submitted online, HR will contact for an interview. Then, potential candidates interview with the hiring manager of the department they applied to. Hiring managers often just give the highlights and don't share any challenges the department is dealing with--it is helpful to start a conversation with an employee of the department to gauge how a current employee feels about their workplace, they will often share negatives first!", "Interview Questions": "What made you choose Medstar?"}, {"date": "3 Dec 2014", "title": "Phlebotomist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "Interviewed by phlebotomy manager, who was my former supervisor at another lab.  There was good history, so the hiring process was very smooth.  Hired within a week's time.", "Interview Questions": "N/A"}, {"date": "3 Nov 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "I applied online for the July residency program. I received an email the next day from the nurse recruiter requesting more information and asking to set up an interview with me. When I went for the interview there were many other applicants sitting and waiting. We first met up with human resources who just asked us basic questions such as why do we want to work for WHC and a little about our background. Once we were done we met up in True auditorium and waited until a manager picked up our resume and came over to do a second interview. In this interview there were more clinical type questions asked (what would you do if....what labs would you expect the doctor to order etc). Sometimes the manager may ask you if you would like to shadow for a day...if they are interested then you should receive an offer letter via email from your nursing recruiter.", "Interview Questions": "Why do you want to work for Washington Hospital Center?"}, {"date": "5 Dec 2014", "title": "MoaII Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Nov 2014", "Interview Descriptions": "Good. Very smooth and straight forward interview. HR is really on top of getting good candidates in there to work. Would recommend for anyone interested. Very solid company to want to work for.", "Interview Questions": "Why do you want to work for medstar "}, {"date": "28 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "The interview process was fairly straightforward and simple. I received a phone call to set up an interview, which occurred within a week of the initial call and met with HR, then the hiring director of the particular unit I would be working for. By the end of the day I was contacted with an offer. Once my references were checked, I received my official offer letter.", "Interview Questions": "The interviews were relaxed and there were no trick questions. They mainly wanted to hear about my experience and how I handle clinical situations. Everyone was very friendly."}], [{"date": "27 Sept 2014", "title": "Clinical Nurse Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center in Jul 2014", "Interview Descriptions": "Was contacted via email to come in for an interview. Met with a nurse recruiter and she asked me the basic questions (tell me about yourself, why nursing, complex patient, why should we hire you?). Went over the pay structure. Then I met with the department head and had a casual conversation followed by clinical questions. Nurses from the unit were brought in and asked questions.", "Interview Questions": "Prioritizing questions"}, {"date": "29 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jun 2014", "Interview Descriptions": "It was a simple interview. Easy to prepare for. Not intimidating in anyway. Comfortable and relaxed. General, expected, questions were asked. Quick and painless. Interviewer was nice and seemed to assess my personality in addition to my skills, to see if I would fit in with the work environment.", "Interview Questions": "What skills do you have?"}, {"date": "16 Apr 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MedStar Washington Hospital Center (Washington, DC) in May 2014", "Interview Descriptions": "Received a call from HR to set up the interview with the department manager, interviewed 1:1, then panel interview with the staff.  Final interview was with HR recruiter to discuss salary and benefit package.", "Interview Questions": "What's your contribution to the Medstar team?"}, {"date": "1 Apr 2014", "title": "Medical Office Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Was 15 years ago...current interview process is non existent.   The HR department will only contact you for an interview only if they currently know you.   This is a department who is partial to who they now not what they know.", "Interview Questions": "What are your strengths........as if that matters."}, {"date": "30 Mar 2014", "title": "Clinical Social Worker I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "The HR staff are very nice and friendly", "Interview Questions": "Typical interview questions"}, {"date": "11 Jan 2014", "title": "Medical Technologist Lll Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Process took 2 days for a call back. Scheduled the interview within a week.  The interview was straight forward nothing too tricky. I interviews with Hr first, then interview with the manager of the department.  Each interview took about 15 minutes, and consisted of traditional interview questions. Overall it was a good experience.", "Interview Questions": "Customer service questions"}, {"date": "22 Sept 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Was able to get an interview scheduled within a reasonable time period, however it took them awhile to get back to me about the job. I did get the job.", "Interview Questions": "I was a new grad at the time. Don't really remember."}, {"date": "6 Sept 2013", "title": "Communication Center Operator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "It was scary at first but the interviewer was pleasant and welcoming so i became more relaxed and confident.", "Interview Questions": "N/A"}, {"date": "5 Sept 2013", "title": "Clinical Informatics Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "Working in the hospital as a summer intern got me a permanent position.  There was one interview with the HR manager and director.", "Interview Questions": "How can you make this positon better."}, {"date": "29 Aug 2015", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Sept 2013", "Interview Descriptions": "Phone call to schedule an interview, interviewed with a nurse recruiter first, after that they would contact the unit director to tell them that they have a candidate for them, you would then have a 1:1 with the unit director (this unit director was very intimidating) waited about two days, phone call with an offer.", "Interview Questions": "Why are you perfect fit?\r\nWhat are you strengths and weaknesses?\r\nPut certain patient care duties in order."}], [{"date": "26 Jun 2015", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Washington Hospital Center in Jul 2013", "Interview Descriptions": "applied and was contacted about a month later. recruiter called and asked which ICU I would be most interested in as I applied to the critical care resdency. So I first interviewed with someone in HR and they sent me to interview on the unit. The interview was a group panel with the director, Patient Care coordinator and about 4-5 staff members. It wasn't difficult they asked questions about yourself and some clinical questions", "Interview Questions": "how would I deal with conflict and arguing amongst co workers "}, {"date": "24 May 2013", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MedStar Washington Hospital Center", "Interview Descriptions": "I submitted an application and wrote an email to participate in PCT Interview Day advertised on their site, they contacted me a few days later. There were 2 interviews. one with HR dude, one with supervisor of the hiring department. Common questions about what skills made you a good candidate, what your supervisor would describe as areas to work on, how to deal with lazy coworkers and angry patients/family.  Seems that the major thing they're looking for is teamwork: you want to emphasize how you manage disagreements with coworkers constructively, how you understand your limits and are willing to help out and be helped. So you should have some examples of that prepared. Very relaxed interviews, HR guy gave me a lot of positive feedback about my answers.", "Interview Questions": "What would you do if you bathed a senile patient and later on she forgot and started complaining to family that they were not bathed? "}, {"date": "24 Mar 2017", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Washington Hospital Center (Washington, DC) in May 2013", "Interview Descriptions": "Interviewing process was fairly easy.The person interviewing me was down to earth and encouraged me to relax although I was nervous. I was called back with an offer less than an hour after the interview.", "Interview Questions": "Where do you see yourself in five years? "}, {"date": "2 Oct 2012", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MedStar Washington Hospital Center (Washington, DC)", "Interview Descriptions": "I originally interviewed years ago, and prior to much automation of the process. I transitioned from a staff nurse position to a NP essentially by an internal referral.  The initial process included the routine items of completing an application which was followed by a formal interview with a non-clinical person.", "Interview Questions": "Unable to recall at this time.  The interview was somewhat informal and many years ago."}, {"date": "29 Jun 2012", "title": "Assistant Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at MedStar Washington Hospital Center (Detroit, MI) in Apr 2012", "Interview Descriptions": "I talked to Human Resources personell on the phobe. My application was pulled from the University of South Carolina job pool website. The initial interview was telephone based and that process took around 45min to an hour. There were a series of questions then I was invited to an on site one on one interview. After completing that interview process I was invited to take an inventory test in which I declined. The pay considered was great, but the work environment seemed a bit cumbersome.", "Interview Questions": "What is your greatest accomplishment? Why would you choose it? How would your greatest accomplishment influence your decision to work here?"}, {"date": "7 May 2012", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Mar 2012", "Interview Descriptions": "I applied for the position some time in March.  I was contacted April 7, via email to set up an interview.  I immediately emailed back and never received a confirmation.  I sent another email and and made a few phone calls, and still nothing...It's now May!!  I'm very disappointed in the HR department for this company.  If you changed your mind about the interview, put the job on hold or decided to choose another candidate then you should let me know something and not leave me in the dark.", "Interview Questions": "N/A"}, {"date": "22 Nov 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Jan 2012", "Interview Descriptions": "HR call, HR interview for general questions,DON interview for nursing based questions, HR offer letter and paperwork, all process took about a couple weeks, pretty smooth and quick,just be prepared and you will get it", "Interview Questions": "Where do u see yourself in 5years?\r\nSinario based questions?"}, {"date": "30 Jun 2013", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MedStar Washington Hospital Center (Washington, DC) in Sept 2011", "Interview Descriptions": "In person interview with 2 people. Basic interview questions also clinical scenarios with sample evaluation/treatment ideas", "Interview Questions": "Clinical scenario"}]]