[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Impactful, Fulfilling, Great Culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Aug 2021", "job_title": "Technical Coordinator in Sydney", "duration": "N/A", "pros": "I've found the culture to be inspiring in many ways - from the obvious reason that your co-workers are hoping to make a positive difference, to being involved in some of the most forward-thinking projects under development within Australia's built environment.\r\n\r\nFrom my early days in the role, I've felt embraced by my team. I've also been offered many perks to develop my own career. This includes opportunities to enrol in any number of courses offered by the GBCA, and also a mentorship program within the organisation.\r\n\r\nWith the ever-growing list of sustainability targets we're seeing for our built environment, and having a critical role in pushing the industry to meet these, the GBCA offers a workplace suited to those who are hard-working and enjoy a fast-paced, impactful environment.", "cons": "Getting up to speed as a Technical Coordinator can be a challenge, as the role touches on all things sustainability within the built environment. However, this presents many opportunities to learn and deepen one's understanding within the industry."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great organisation that is a welcoming family with a great culture and achieves outcomes with a positive impact", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Aug 2021", "job_title": "Anonymous Employee in Sydney", "duration": "N/A", "pros": "The people at GBCA are extremely welcoming, wonderful to work with, and supportive. Everyone works together and is committed to the work they are doing which makes it a great organisation to be a part of. GBCA also understands and strongly supports a good work/life balance, especially during the COVID-19 pandemic, making it a really positive work environment.", "cons": "Being a small not for profit, there can be challenging times with resourcing and the amount of work to be done. However, this does present many learning and development opportunities."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "5 Aug 2021", "job_title": "Anonymous Employee in Sydney", "duration": "N/A", "pros": "Company that makes a difference and genuinely values and cares for their staff. Great office and friendly team that wants to improve sustainability within the built environment.", "cons": "All the usual challenges that not for profits experience in terms of ambitious objectives with these objectives supported by a not for profit budget."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent supportive workplace that provides pathways for development", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Aug 2021", "job_title": "Anonymous Employee in Sydney", "duration": "N/A", "pros": "Flexible work arrangements\nInclusive employer\nEncourages and supports learning and development\nProvided excellent support during COVID disruptions\nProivded transparency during COVID", "cons": "Lower salaries due to charity nature of the organisation.\nThey hold too many internal meetings."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An amazingly supportive team and environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jul 2019", "job_title": "Technical Coordinator in Sydney", "duration": "N/A", "pros": "I have been at the GBCA for almost 3 months. The GBCA has such a welcoming team, who are always looking to help one another. I have always felt that my questions were welcomed, which helped me to learn and grasp the work faster than I have in other work places. Because the work environment is so supportive of agile working, it feels quite collaborative and can be tailored to our needs. I also really appreciate that management is quite understanding when it come to workload, and understanding that the learning curve exists when first starting out. It also helped that the team have a training process in place that clearly sets goals and timelines for learning certain aspects.", "cons": "When I first started, there were a lot of different processes that existed on separate systems, which was difficult to pick up immediately. This, coupled with the in-depth knowledge needed of Green Star to assist project teams, made it quite challenging to pick up. However the support made it a lot easier to progress with these."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Disappointing!", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "20 May 2016", "job_title": " in Sydney", "duration": "N/A", "pros": "Great and passionate junior and mid-level people! This is a good 3 - 5 year place to work for someone who wants to have a variety of different experiences in sustainability. Exposure to technical, marketing, communications and stakeholders management are really good and great learning experiences.", "cons": "Top management does not seem to listen to its own people. Also, they seem to use 'the board' as an excuse to do what they want, to raise their own profile only...\r\nThere should be a direct line from staff to board members, to provide direct and unfiltered feedback about top management. There isn't one and I don't think the board is aware of the weird dynamics in place within the organisation.\r\nLots of good people are leaving because of that."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "GBCA is an amazing place to work!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jul 2019", "job_title": "Manager in Sydney", "duration": "N/A", "pros": "- Flexible working, they don't only talk the talk but walk the walk. Many companies talk about offering flexible working but in reality it's just a buzz word and isn't really offered.\n- lovely culture and environment. An amazing office space and credit to HR for the amazing culture they have created.\n- The people are very passionate and dedicated to the GBCA's mission. Everyone is pulling in the same direction and wants to make a difference.", "cons": "- Being a not-for-profit budgets are always tight and you need creative thinking at times to get the job done. But at the same time, it develops out of the box thinking which is an important skill to have!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome place to work with passionate and like-minded people!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jul 2019", "job_title": "Technical Coordinator in Sydney", "duration": "N/A", "pros": "The GBCA has given me some lots of opportunities to learn, challenge myself and continue my professional development.  \n\nIn my role as Technical Coordinator I have been exposed to, and able to learn from a range of experienced industry professionals. Allowed me to deepen my technical understanding of sustainable practices in the built environment and expand my network. \n\nAmazing office space, great flexible working policies and a really supportive team culture!", "cons": "Being a small to medium sized not-for-profit there can be resourcing constraints that aren't an issue for large corporations. However, this is just the nature of being a non-for-profit, and our size means that the organisation is nimble and able to provide great internal opportunities when they arise."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "An awe-inspiring family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jul 2019", "job_title": "Senior Technical Coordinator in Sydney", "duration": "N/A", "pros": "Working at the GBCA has provided many opportunities to further develop my skill set and career. Having the fortunate opportunity to begin in Administration and now oversee a small team the GBCA has encouraged my strengths and helped develop my weaknesses.\r\n\r\nWe work in a beautiful office, surrounded by some inspiring colleagues sharing their passion to transform the built environment through their knowledge. Working here you truly become part of family that will celebrate your successes and support you when needed.", "cons": "The challenge when I first commenced with GBCA was navigating the workloads of differing teams who were also needed to provide assistance as it wasn't always clear who was responsible for different activities of the organisation"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Flexible and friendly workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jul 2019", "job_title": "Technical Coordinator in Sydney", "duration": "N/A", "pros": "Some of the pros are true flexibility, a great community of coworkers, the culture of work/ life balance, the exposure to industry and having purpose and the opportunity to invoke change.", "cons": "The big windows make me want to be outside!"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing place to work for!", "rating": "5.0", "reviewer_affiliation": "Current Intern, less than 1 year", "job_date": "17 Jul 2019", "job_title": "Intern in Sydney", "duration": "N/A", "pros": "Great people and atmosphere. Very collaborative and supportive environment.", "cons": "No cons that I have experienced so far."}]]