[[{"date": "28 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "Twas part of the school programme and thus effective and straightforward. I must enter at least 30 words, I hope this is enough. Nope it wasn't, here are more words for your.", "Interview Questions": "Why are you here, would you say, in your own words?"}, {"date": "12 Sept 2022", "title": "Adjunct Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic", "Interview Descriptions": "A panel of 4 interviewers assess my lesson planning and facilitation over 30 min before having another 30 min interview.  It was done over MS Teams.  They try to threw in obstacles like being naughty students to assess how I will respond in those classroom examples.", "Interview Questions": "Why do you want to be an adjunct lecturer with our department?"}, {"date": "15 Aug 2022", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "Normal . Conducted thru MSteam\r\nConsist of more than five interviewers, all are friendly and nice. Interview duration was quite short, only 10 to 15 minutes. Only two interviewers spoke , the rest kept quiet.", "Interview Questions": "Work job history , experience in teaching "}, {"date": "19 Dec 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Singapore Polytechnic (Singapore) in Aug 2022", "Interview Descriptions": "The process took about 3 months. 3 separate interview with RO, head of department than the Principal. First two interview were on-site while the last interview was done over teams. Questions are generally easy for me as job scope aligns with my past experience. Head of Department session was a chit chat session which was geared towards determining whether will i fit into the culture. Interviewing with the Principal was surprisingly technically, asking how I would approach certain scenario.", "Interview Questions": "Q1: Share your current & previous job experience. Q2: How do you feel about people moving quickly from job to job Q3: how often and how do you make time to learn new skills Q4: How would u approach a problem if XYZ happens"}, {"date": "17 Feb 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Singapore Polytechnic", "Interview Descriptions": "4-5 Rounds of different levels of people. Past portfolio review to see if you're legit. You do a mock 'lesson' for them to assess if you are confident and know your stuff.", "Interview Questions": "Why do you want to teach? Are you OK with doing mindless administrative work 40% of the time?"}, {"date": "17 Feb 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Singapore Polytechnic", "Interview Descriptions": "4-5 Rounds of different levels of people. Past portfolio review to see if you're legit. You do a mock 'lesson' for them to assess if you are confident and know your stuff.", "Interview Questions": "Why do you want to teach? Are you OK with doing mindless administrative work 40% of the time?"}, {"date": "12 Apr 2022", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore Polytechnic (Singapore) in Nov 2021", "Interview Descriptions": "Applied through the Workday platform. Was informed that I was selected for an online interview over MS Teams. \r\n\r\nInterview was normal with the usual questions but the interviewers were looking specifically for someone with experience in a particular sector so I was not selected for the final interview.\r\n\r\nInterviewers were polite to reply my email post-interview when I dropped them a Thank-you email plus some additional information about my achievements in my most recent job. Was notified about a week plus post-interview that I did not make the cut for the final interview.", "Interview Questions": "The usual list of interview questions. Plus about comfort level of working with youths in an IHL settings and also to share some examples of personal experiences in terms of the teaching domain."}, {"date": "29 Mar 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic (Singapore) in Nov 2021", "Interview Descriptions": "Good and friendly interviewer. Given clear description on  the job scope,  the required expectation and the challenges that may be facing. Provided case study to submit within a reasonable timeline.", "Interview Questions": "Tell me about yourself and why you are interested in the role?"}, {"date": "22 Sept 2021", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "3 rounds, last was with Head. Usual qns asked. Had to do writing test to gauge writing and comms skills. Interview panel was nice and friendly. Asked abt past experience and why I wanted to join", "Interview Questions": "Share more abt yr experience "}, {"date": "20 Sept 2021", "title": "Account Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "interviewer was busy and was a quick process . seems like  a lot of things is going on and interview was brief and quick. felt very disgenuine and expected more", "Interview Questions": "what is next course of action if offer the job "}], [{"date": "12 Sept 2021", "title": "Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "typical interviews like. Tell me about yoursef, where do you see yourself in 5 years. they also ask you about a kind of application question like, how can the government bring the economy back up now after the corona virus has come etc", "Interview Questions": "typical interviews like. Tell me about yoursef, where do you see yourself in 5 years. they also ask you about a kind of application question like, how can the government bring the economy back up now after the corona virus has come etc"}, {"date": "8 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Singapore Polytechnic in Sept 2021", "Interview Descriptions": "It was okay i guess. they asked the typical questions expected of an interview. The interviewers were quite nice as well. Overall pretty smooth process. No quirky questions were asked thankfully.", "Interview Questions": "Can you tell us about yourself"}, {"date": "25 Jun 2021", "title": "Adjunct Lectureer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "Smooth and the interviewer made you feel comfortable. Most of the questions were around the subject and were not difficult to tackle. You would know the result in about 1-2 weeks later.", "Interview Questions": "Describe your experience in this area"}, {"date": "19 May 2021", "title": "Junior Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "Went for the interview some years back and both interviewers called me by the wrong name twice. They then tried to cover up their mistake of calling the wrong candidate by abruptly ending the interview in 5 minutes.", "Interview Questions": "N/A"}, {"date": "12 Apr 2021", "title": "Account Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Singapore Polytechnic (Singapore) in Mar 2021", "Interview Descriptions": "Three rounds of interview - first with manager, then with director, final round with vice principal. In between each round, there was a lead time of approximately 2 weeks for them to go through the other candidates as well.", "Interview Questions": "How does this role fit into your career goals?"}, {"date": "6 Oct 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic", "Interview Descriptions": "First round interview with reporting manager + presentation on a topic you are familiar with for communication skills\r\nSecond round interview with Director\r\nThird round interview with Principal and panel of Directors", "Interview Questions": "Why so you want to join education?"}, {"date": "27 Dec 2021", "title": "Senior Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore Polytechnic in Oct 2020", "Interview Descriptions": "I was asked to present on a topic (give a lecture), followed by panel interview. The topic was provided before the interview and I had about a week to prepare for it.", "Interview Questions": "What is your long term career goals?"}, {"date": "11 Nov 2020", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Singapore Polytechnic (Singapore) in Oct 2020", "Interview Descriptions": "Applied in September. They only shortlisted me for interview 1 month later. \r\nFirst round was a phone screen. \r\nFollowed by a video interview. Questions asked were quite standard.  Interview lasted for 1hr.", "Interview Questions": "Describe a time when you  made a mistake at work?"}, {"date": "2 Feb 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic (Singapore)", "Interview Descriptions": "Two rounds of interview.  Panel interview then interview with management. Nothing else to raise other than the above.  Putting in more text to reach 30 words 30 words 30 words.", "Interview Questions": "N/A"}, {"date": "25 Dec 2019", "title": "Temp Staff At Call Centre Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "only a phone call interview, they seem to be desperate for manpower during the peak period (orientation, registration)\r\nonly a phone call interview, they seem to be desperate for manpower during the peak period (orientation, registration)\r\nonly a phone call interview, they seem to be desperate for manpower during the peak period (orientation, registration)", "Interview Questions": "when i was avail, no difficult questions"}], [{"date": "5 Dec 2019", "title": "Executive, Registrar Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Polytechnic (Singapore) in Dec 2019", "Interview Descriptions": "2 rounds of informal interviews, one with immediate supervisor and the second with more senior staff members. Last round of interview is with HR, and more of a formality.", "Interview Questions": "Tell me how you would respond to an instruction from your boss that you disagreed with"}, {"date": "10 May 2023", "title": "Entrepreneur Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Singapore Polytechnic (Singapore) in Jan 2019", "Interview Descriptions": "Application submission: The first step in the interview process is typically submitting an application, either online or in person. Resume review: After the application is received, the recruiter or hiring manager will review the candidate's resume to determine if they meet the minimum qualifications for the position.", "Interview Questions": "Tell me about your previous experience and how it relates to this role. What motivates you to do your best work, and how do you maintain that motivation over time? How do you handle difficult situations or conflicts in the workplace? What is your experience with [specific skill or software required for the job]?"}, {"date": "5 Sept 2018", "title": "Adjunct Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic", "Interview Descriptions": "Everyone I encountered at SP seemed extremely confused and uncoordinated. Here's my little tale.\r\n\r\nMy first contact with SP was through email, with someone from HR (let's call her Ms A). We arranged for the interview date and time after a few exchanges. It's quite strange that she never once did reveal her phone number, nor did she call me.  All these \"to-and-fro\" could have been much shortened.\r\n\r\nDays after I've got the interview arranged, a different person from HR called me (let's call her Ms B), wanting to arrange for an interview! She seemed totally unaware that I already have one arranged by Ms A. I told her about this and she never called back.\r\n\r\nFast forwarding to the day of the interview, I met up with a full-time lecturer (let's call him Mr C). He was cordial and things seemed to go quite well. I had some questions about the level and depth of the course material I was supposed to teach and he agreed to send me the course synopsis. At the end of the interview, he mentioned that he would put up a recommendation to his bosses for a second interview. The second interview would be where I would meet his bosses.\r\n\r\nDays went by and I did not hear from Mr C.\r\n\r\nEven more days went by and I heard from yet another HR staff - let's call her Ms D. She called me up wanting to arrange a first interview. I told her that I've met up with Mr C and wondered why she was arranging for one. She said something about Mr C's wish to arrange this interview. Had he forgotten that we've met?!  Ms D replied that she would check back with Mr C.\r\n\r\nThen I did not hear any more from them.\r\n\r\nI could overlook all these if my livelihood did not depend on this queer bunch. After all, it was just a part-time position I applied for. But if you are considering working full-time at SP, it might be good to think twice.", "Interview Questions": "Not difficult. It's the usual questions about my experiences, and how much time I can commit as a part-time lecturer."}, {"date": "23 Jan 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic", "Interview Descriptions": "basic questions asked such give a brief introduction about yourself, why do you apply for this job and what you hope to achieve after leaving this place? tell me about your skills?", "Interview Questions": "One word that describes you?"}, {"date": "26 Oct 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Polytechnic (Singapore) in Jun 2017", "Interview Descriptions": "There are 3 interview minimum for staff; depends on the entry level into the school; which only passing each round would you go to the next round. First interview would be with your direct supervisor. Next interview would be the department head and the faculty head. In some cases, there may be an interview or group session with the other staff of the same level. The last interview would be with HR, faculty head and cluster head. For me, each interview was quite easy to manage and fast.  Questions posted were neither too technical nor difficult.", "Interview Questions": "What is your aspiration?"}, {"date": "17 May 2017", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Singapore Polytechnic (Singapore) in Mar 2017", "Interview Descriptions": "They will ask you about your research experience and some technical questions, introduce the company and the project to you.  They will ask your understanding about the difference between different programming language.", "Interview Questions": "What is the difference between Matlab and C++?"}, {"date": "11 Nov 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Polytechnic", "Interview Descriptions": "It began with a presentation (i was informed beforehand what to prepare), followed by standard interview by a panel which include the Director of my School, HR and Continual Learning. Everything was done within about an hour.", "Interview Questions": "Why do u want to teach?"}, {"date": "6 Jan 2017", "title": "Research Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at Singapore Polytechnic (Singapore) in Jul 2016", "Interview Descriptions": "There were two rounds of interview. The first round was less technical (July) and more of knowing the skill sets I possessed. The team lead and center director were in the panel. They wanted to check if I would be a good fit in the team. I was also asked to send a presentation detailing my work via email after the first round. I was called for the second round of interview (September) and this time I was interviewed by the main director and team lead. It ended on a positive note with the team lead congratulating me. I was asked to await a call from the HR. However, I waited for a month and still did not get any call. I was following up once in a month with the team lead regarding the HR interview. He assured me via emails to wait patiently. This went on for three months and in January when I called the admin staff I was told that my application was rejected. When I called the team lead to confirm, he told me that he was unaware of it. They did not even care to update me regarding the status until I inquired. I waited for the job offer because the work was well aligned with my expertise and interesting. A truly disappointing experience.", "Interview Questions": "N/A"}, {"date": "10 Jan 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Singapore Polytechnic (Singapore) in Jun 2016", "Interview Descriptions": "It was through an employee referral. I was given a call to set a time for meeting. On arrival, I waited and was presented into a meeting with the Director and Deputy Director. They went over my past portfolio. They asked more about myself, my past experience and we discussed how I could contribute.  They were able to let me know of their decision in relatively short time.", "Interview Questions": "What is you current salary?"}, {"date": "11 Apr 2015", "title": "Program Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Singapore Polytechnic (Singapore) in Jul 2011", "Interview Descriptions": "I applied online through the government jobs portal and this was considered an entry level position.\r\n\r\nI received a call for an interview the following week, and when I went for the first interview it was amongst people in the department I was applying for. Initially they asked generic questions such as an introduction, the kind of experience I had, reasons I applied for the position, and it progressed to situation-based questions to understand what I'd do in made-up situations relevant to the work they did. The first interview completed with questions regarding my proficiency using the Microsoft Office applications.\r\n\r\nI was invited for a second interview and besides the two persons who interviewed me the first round, the deputy principal and HR director were there and this session was a little intimidating for me, but they were very nice, and asked questions such as what I'd contribute to the polytechnic if I were hired. They gave me the opportunity to ask questions and I was concerned about the performance appraisal system and culture.\r\n\r\nAside from answering \"favourably\" to the questions they asked, they took note of punctuality (I was vying for the position with 3 other shortlisted candidates who made it to 2nd round and was slated to go 2nd but I reached first and the rest reached after I was done) and what I brought to the interview (a drink was definitely not welcome).", "Interview Questions": "How would you deal with faculty who passed on tasks at the last minute?"}], [{"date": "24 Oct 2013", "title": "Lecturer (PAS 6) Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Singapore Polytechnic (Singapore) in Dec 2009", "Interview Descriptions": "2 informal interviews with the resource manager(for organisational fit)  and course manager(technical fit to the course). If you clear them, they will recommend you and there is a formal interview which consist of a technical presentation of your choice following by meeting the top management(Principal and vice-principals).The formal interview is more of a formality before hiring. Unless you make a big mistake or leave a very bad impression, you are most likely hired if you make it to the formal interview.", "Interview Questions": "Quite a routine interview. No difficult questions. They are looking for job fit and technical expertise."}, {"date": "11 Aug 2012", "title": "Lecturer (PAS 6) Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Singapore Polytechnic (Singapore) in Mar 2009", "Interview Descriptions": "It's a 2 tier interview. First tier is interviewed by the specific school Academic Resource Deputy Director. If clear this interview you are required to attend a session where you are required to show your teaching potential - meaning you need to create your own lecturer and present it to 2-3 HR and Education Department staff. If you clear this then the final stage is an interview with the principal and his deputies,", "Interview Questions": "They will ask why you decide to leave your current job to be a lecturer. Never say you want to take a break from your current work!"}]]