[[{"date": "3 Jun 2023", "title": "Public Health Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF (Khartoum)", "Interview Descriptions": "Easy fast and fair. The panelists were nice and patient . They granted me extra time. The questions were directly related to the job description. Three main questions with probing questions in the middle", "Interview Questions": "Technical questions in relation to the title"}, {"date": "24 May 2023", "title": "NATIONAL YOUTH VOLUNTEER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "It was quick and the interview it self was only thirty minutes. It was over zoom and wasn’t as stressful as it may seem. Just go in confident, calm, and you’ll do great", "Interview Questions": "Job Experience relating to job and why you want to work there"}, {"date": "30 Apr 2023", "title": "Marketing Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "The interview was virtual with three people. It was lovely and friendly however, their feedback was much harsher than was made out by them. The interview lasted nearly an hour.", "Interview Questions": "Tell me about a time you dealt with a difficult colleague"}, {"date": "15 Apr 2023", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY)", "Interview Descriptions": "No written test, only online interview. The interviewer provided feedback afterwards: Interview was well done but process was to regularize a temporary staff member. Was invited to apply for other positions.", "Interview Questions": "Interest in the position, relevant experience, a technical question and 2 competency questions."}, {"date": "7 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF (New York, NY)", "Interview Descriptions": "The interview at the UNICEF Headquarters in New York was structured using the STAR Method (a competency-based one). Therefore, answering by selecting a situation where you achieved great result will should you get the job.", "Interview Questions": "Can you tell us in details one moment where you had to manage multiple tasks at the same time and how you did it?"}, {"date": "2 May 2023", "title": "Oficial De Protección Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Ciudad de Mexico) in Apr 2023", "Interview Descriptions": "Muy profesionales en el desarrollo de la entrevista, las preguntas son muy complejas, debes estudiar mucho sobre el tema y conocer conceptos y áreas prácticas del tema pues quienes evalúan son personas con muchos conocimientos y experiencia.", "Interview Questions": "N/A"}, {"date": "12 Jun 2023", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (Ḩawwārah, Amman Governorate) in Apr 2023", "Interview Descriptions": "The process was accelerated as they said they needed someone the next week. For this reason, I accepted an interview on a Sunday afternoon, canceling my plans for that day. While they said it was an informal call, I was speaking for an entire panel that was asking for my approach, methodology etc. After the interview, I never heard back from them.", "Interview Questions": "- What is your experience in managing stakeholders - How would you start this assignment"}, {"date": "28 May 2023", "title": "Community Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Stoke-on-Trent, England) in Apr 2023", "Interview Descriptions": "It was competency-based interview questions and was very friendly and the questions were about communications in the Financial Innovation work. There was a lot of focus on financial innovation, research, and presentation. Very tough overall.", "Interview Questions": "Tell us about a complex communications challenge you have been faced with. How did you face it and what was your challenge"}, {"date": "28 Mar 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "It was hard to pass. There were three stages including exam. Human resources and technical interviews made by team. It was competency based interview. They asked me five or six questions.", "Interview Questions": "How is your carreer match with this position?"}, {"date": "22 Mar 2023", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "There were 4 interviewers, offline in their office, and went for 30-60 minutes. They responded to you quickly and you'll be called in a week if you pass the interview", "Interview Questions": "describe yourself why choose fundraiser"}], [{"date": "5 Mar 2023", "title": "Communications Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Neutral, nothing our of the ordinary. The speed in communicating was good, the entire process took a little over 6 weeks. I had one written assessment and one interview before being informed of the outcome.", "Interview Questions": "Tell us about your background and why you applied to this."}, {"date": "29 May 2023", "title": "Programme Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (Aden) in Mar 2023", "Interview Descriptions": "Interview consisted of two parts, an automated video assessment and an oral interview. The automated interview had two questions and each question was allocated five minutes of recording time. the automated interview also allowed you to repeat the question once. The questions were fair enough and were context specific . The oral interview was competency based and took about forty minutes.", "Interview Questions": "Tell us about your experience specifically highlighting your achievements and why you think you are the best person to get the job ?"}, {"date": "24 Mar 2023", "title": "Fundraising Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (Bangkok) in Mar 2023", "Interview Descriptions": "Applied online through UNICEF website. Waited for 3 weeks until they sent the invitation to take technical assessment. Technical assessment consisted of 3 questions mostly on how to convince donors to give contribution, how to secure continued contribution, how to address donor's concerns and how to overcome those concerns, give example on how UNICEF deals with others companies and how was the results - you can see that some are quite technical to those new to the position. Disturbing things happening here. There were 3 candidates including myself on Teams meeting and I could see all their names appearing on my laptop for the whole time we took the test (Been asked to open VDO but can mute). After I finished the task I googled the other candidates and one of them is already a Fundraising Specialist for years at UNICEF!!! As an organization believing in Integrity, Transparency, Accountability blah blah I can't imagine how the other candidates are going to be treated equally, let alone fairly. Considering one candidate has been doing the same job and gaining access to UNICEF's grant proposals, letter of intentions, etc for years I think this recruitment process is just a joke. I would love to hear from someone from UNICEF to tell me my understanding has been wrong.", "Interview Questions": "Have not been invited yet as I just took the assessment today."}, {"date": "28 Feb 2023", "title": "Programme Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Interview was competency based, no written less than an hour. There was no written test. Technical competencies were evaluated but not extensively. The post interview processes took long but eventually cleared.", "Interview Questions": "What was the most difficult task you have undertaken and how did you manage it"}, {"date": "19 May 2023", "title": "captador de clientes Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UNICEF (Belo Horizonte, Minas Gerais) in Mar 2023", "Interview Descriptions": "Entrevista com o gestor em um coworking perguntando sobre suas experiências com vendas, clientes. Posteriormente, apresentam a ONG e pedem para se apresentar, explicam tudo sobre como abordar e o conceito e a importância do pitch. Após a entrevista, é certo sua contratação.", "Interview Questions": "Possui experiência com a captação?"}, {"date": "22 Feb 2023", "title": "Communications Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "The interview process comprised of three stages. The aptitude test, written test, and oral interview. I didn't get shortlisted for the 3rd stage. Overall, I felt like all the stages were unnecessary", "Interview Questions": "1. Aptitude tests 2. Written tests"}, {"date": "16 Feb 2023", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Must submit required documents with methodology note and financial bid. Based on shortlisting of CV, a technical note and financial bid, selected candidates are called for an interview. The interview lasts around 20 to 40 minutes, largely on technical knowledge with some experiences of working in the field or with the government", "Interview Questions": "Q What are the challenges for girls education in Rajasthan and how a programme can address them Q Reflect on an example where I found difficult to achieve the result and how I managed that situation"}, {"date": "10 Feb 2023", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "It was a fairly straightforward process with three rounds of interviews - the first was the application, the second a written round and the third, a virtual strategic assessment with a panel.", "Interview Questions": "Past experience with M&E, which was specific to the role."}, {"date": "10 Jan 2023", "title": "Nutrition technical facilitator ( MD ) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "I want to work in the nutrition sector . for more than four years with the UNICEF IN Afghanistan in par wan province as NE ( nutrition technical facilitator ) i cover 92 HFs in part of nutrition IPD-SAM , OPD-SAM , OPD - MAM .GM , technically working , on the job training , supportive super visions , for Doctors , nurses , Mid wife , Chs", "Interview Questions": "MUAC for SAM , MAM children 6 -59 month sD ?"}, {"date": "12 Jan 2023", "title": "Education Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Interview with a panel. Compétences based interview then you need to prepare situations from your previous experiences to share with them. It last for almost 1 hour. In English language.", "Interview Questions": "Give us examples on team work, initiative, managing education projects etc"}], [{"date": "9 Jan 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Santiago) in Jan 2023", "Interview Descriptions": "Entretenido, preguntas distintas a un proceso regular. Se nota que leen tu CV y se interesan por conocerte más allá de tu experiencia. Una persona es de RRHH y otra es del departamento donde harás el internship.", "Interview Questions": "Sobre qué aprendiste en tus experiencias pasadas."}, {"date": "2 Mar 2023", "title": "Giga Mapping Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Jan 2023", "Interview Descriptions": "I applied through the portal and about 6 weeks later was contacted for an initial interview. I followed up after the interview but I received zero response. I understand UNICEF has a large pool of candidates and they state that they don't respond to every applicant. However, I think if they have interviewed someone, they should provide a definitive response.", "Interview Questions": "I had to prepare a case study, share it with a panel, and then they asked me some competency-based questions. The one that sticks out is \"give an example of when you have failed and how did you deal with failure.\""}, {"date": "21 Feb 2023", "title": "Data Analyst Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at UNICEF in Jan 2023", "Interview Descriptions": "It is a phone informal interview of 15 mins, and HR was very kind in attitude and words. The whole process was very relaxed, and he asked a few questions.", "Interview Questions": "1. Tell me about your Python experience 2. Tell me when you deal with team problems 3. What is your salary expectation?"}, {"date": "12 Mar 2023", "title": "Health Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF in Dec 2022", "Interview Descriptions": "It was good and was a competency based interview in which no focusing on a technical side rather than on the skills and management knowledge. It last about one hour .", "Interview Questions": "Introduce your self and what value will you add to this position"}, {"date": "17 Feb 2023", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Dec 2022", "Interview Descriptions": "I had an interview and was told I’d hear back within 2 weeks. I never heard from anyone despite making the time to follow up a month later. Pretty poor approach to interviews. Complete time wasters and disrespectful of your time.", "Interview Questions": "What can you bring to the role?"}, {"date": "24 Nov 2022", "title": "Wash Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Competency interview Sets high standards for quality of work; monitors and maintains quality of work; works in a systematic, methodical and orderly way; consistently achieves project goals; focuses on the needs and satisfaction of internal and external partners; accepts and tackles demanding goals with enthusiasm.", "Interview Questions": "what is drive for result skills"}, {"date": "7 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Easy, engaging, 30 minutes long. They asked questions about my motivation for the position, why I wanted to join UNICEF and what I could bring to the team. Overall, a very quick and easy interview processes", "Interview Questions": "What is your motivation to join UNICEF?"}, {"date": "20 Feb 2023", "title": "Consultant Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF in Nov 2022", "Interview Descriptions": "After doing a practical test, there was an online interview with the Tech Lead, Marketing Lead, and UX Designer. It lasted about 20 minutes. The Tech Lead seemed distracted during the process.", "Interview Questions": "They asked me about strengths, weaknesses, why I would like to work with them. They also asked me to show samples of my work during the interview ."}, {"date": "9 Nov 2022", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (Karāchi) in Nov 2022", "Interview Descriptions": "CBI Competency Based Interviews questions and answers with examples on different tools, techniques and methodologies to decide for further decision making. What is Sanitation marketing. Water, Sanitation and hygiene methods", "Interview Questions": "CBI Competency Based Interviews questions and answers"}, {"date": "13 Oct 2022", "title": "Education Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "competence based interview avec la chef de section et le chef de bureau. duration  de 45 minutes. \r\nenviron 4-5 questions avec des requestions apres chacune. En general tres gentil mais pas faciles les questions. Une fois jái du recommencer la reponse avec les indications recues par la chef de la section education", "Interview Questions": "competency based on education and project management "}], [{"date": "12 Oct 2022", "title": "ICT Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "It was great, insightful and really probed in ones experience, skills, capabilities and an insight in there work experience. By analysing there computer knowledge, cloud computing as well as LAN knowledge, configuration", "Interview Questions": "Cloud computing and examples if any"}, {"date": "10 Oct 2022", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (New Delhi)", "Interview Descriptions": "As usual telephonic Interview is organized by HR, and  interview board is composed of 4-5 members including  Head of Office/Regional Office, Program Officer, sister UN organization representative, Technical Expert, Communication Officer(optional) & HR support officer.", "Interview Questions": "In general interview atmosphere is very cordial. They try to understand your work experience, and try to understand how you handled a situation that the organization faces while working in the field. Your operation skill, managerial skill, UNICEF branding and team building capacity is judged through various questions, queries and situational analysis type of question. It varies from 40-60 minutes approx.   "}, {"date": "9 Oct 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "UNICEF is one of the biggest UN agencies. The interview was not difficult but it needed some preparation.. it lasted around thirty minutes or so. It focused on the competencies and past experience.", "Interview Questions": "Mention three things that best describe you."}, {"date": "4 Aug 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "the application procedure is the standard for all other application procedures elsewhere. relatively long and cumbersome but not a big deal. you need to fill out or answer so many areas", "Interview Questions": "do you have work experience outside of your home country"}, {"date": "12 Oct 2022", "title": "Finance Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNICEF in Aug 2022", "Interview Descriptions": "Talent pool info session first, then online interview with 3 persons involved in the discussion. 1 HR person, 1 from the relevant team, 1 more senior member from an other team. They were kind and curious, the interview was fully hold in English.", "Interview Questions": "What is the difference between policy and procedure?"}, {"date": "23 Mar 2023", "title": "Social Media Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Kigali, Kigali) in Aug 2022", "Interview Descriptions": "This was a volunteer role for which I was invited to attend an interview, and was subsequently asked to submit samples of my past work. The interview itself went very well, with two members of the UNICEF communications team in attendance, as well as another representative from UNV.", "Interview Questions": "I cannot recall the specific questions, but they were mainly related to my experience, and mostly centered around graphic designing. The main question that kept coming up was, \"Why should we choose you, and why do you think you deserve the role?\""}, {"date": "19 Jul 2022", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "For both the staff and unv positions, i applied for the interviews were competency based focusing on examples of work experience. The questions seem easy but the interviewers are looking details and achievements", "Interview Questions": "Tell us about time you worked in team to achieve something "}, {"date": "18 Jul 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Very nice process. I felt comfortable, the team was interested in both personal and professional skills. They were looking for a young professional with demonstrable experience in the field. The interview took around 40 minutes.", "Interview Questions": "What challenges I can identify about the context"}, {"date": "19 Oct 2022", "title": "Human Resources Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Budapest) in Jul 2022", "Interview Descriptions": "As an Internal candidate on Talent Pool: first I had a written test and interview to be considered for the Talent Pool, and I had an interview for the actual position with the Section Chief.", "Interview Questions": "Blended interview, real life experience and hypothetical behaviour in given situations"}, {"date": "25 Jun 2022", "title": "Senior Newborn Maternal and Child Health Specialist (Pro Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Process took two months \ncalled  out by HR officer, references reached out by HR\nNo written test but interview test with hiring manager, officer from the unit and HR officer", "Interview Questions": "questions on how to handle a conflictual situation?\nquestions on how to handle a conflictual situation?\ntime were you have to solve a difficult situation in your job?\nwhat would you add to our organization?\n"}], [{"date": "20 Jun 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "it was very smooth and recruiting did not take a lot of time. a maximum of 2 weeks after the date of the interview. no exams were conducted for an internship position.", "Interview Questions": "- weakness and strengths \r\n- where do you see yourself in 5 years"}, {"date": "11 Jun 2022", "title": "Communication Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Competency-based interview. Includes both interview and written test. Test was in accordance with the job description. Interview panel of several people, questions in line with the job description and with expectations for candidate experience.", "Interview Questions": "Always some version of why you are interested in the job or the best candidate for the job or describe yourself and how your qualifications meet the requirements."}, {"date": "8 Jun 2022", "title": "F2F Fundraiser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "It was a three step intervie,basic questions on a phone call , on zoom they asked everything in details and a small task outdoor. They also wanted a motivational video when you are applying for the job", "Interview Questions": "What ispired you for the position?!"}, {"date": "2 Jun 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Only had one interview, but was contacted, interviewed, and rejected within a few weeks - so a pretty short process overall. Interviewers were warm and no gotcha questions. They seemed to really want previous UN experience, as most UN agencies do.", "Interview Questions": "How would you approach X project?"}, {"date": "30 May 2022", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "An easy going conversation with a panel of 4 interviewers. Great questions to be expected at all interviews such as describing a marketing campaign and how I was involved, company values and culture, overcoming difficult obstacles and building relationships.", "Interview Questions": "N/A"}, {"date": "18 May 2022", "title": "Education Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Interview was poorly managed and members had no technical background, questions was mainly scenarios with very few analytical information. The did not follow the concept of competency based interview. it was online and they were late 15 minutes.", "Interview Questions": "Real scenario of project design."}, {"date": "10 May 2022", "title": "Junior Professional Officer (JPO) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Intro, personal history, technical questions, thematic questions, managment questions always in context to a real experiance from the past. Crazy thing was I had to provide 4 references within 24  hours!", "Interview Questions": "Have you had an issue with a supervisor, how did you deal with it and what did you learn from this experiance?"}, {"date": "9 May 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY)", "Interview Descriptions": "Be prepared to interview with folks in vastly different time zones as well; the reviews give some insight however the process is mercurial and protracted.  This interview was for a contract gig that spanned over 3-4 months and in the end it appeared that the hiring personnel/decision-makers were not in agreement on the role.  The role was reposted online for applications shortly after I was not invited to the 3rd round of interviews.", "Interview Questions": "How do you network across industries?"}, {"date": "16 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY) in May 2022", "Interview Descriptions": "The interview was good and my interviewers were friendly. Not too hard question and was straight to the point. Tell us about yourself and why are you the best? It was overall good and great", "Interview Questions": "N/A"}, {"date": "6 Oct 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Astana) in May 2022", "Interview Descriptions": "was given a written task to perform within 24 hours, which was to develop a plan of action for the statistical analysis. There were 3 questions in total in the task", "Interview Questions": "Describe step by step the plan for statistical analysis"}], [{"date": "26 Jul 2022", "title": "RRHH Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at UNICEF (Buenos Aires) in May 2022", "Interview Descriptions": "Fue una entrevista amena, lástima la demora para el resultado.Así y todo fue una experiencia enriquecedora. Una gran institución internacional, con mucha proyección en él área para desarrollar. Parecía un buen ambiente de trabajo.", "Interview Questions": "Experiencia en la posición \r\nCarrera estudiada\r\nPosgrado\r\nAspectos de crecimiento"}, {"date": "20 Jun 2022", "title": "READ Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF in May 2022", "Interview Descriptions": "A very long process, apply well in advance! \n-first application: a CV and letter\n-1 month later: invitation to a 3 hour quantitative / qualitative research assessment (to be done at home)\n-1 month later: invitation to an interview, then immediately invitation to \"follow up chat\" the next day\n-2.5 weeks later: the official offer, with requested start date in 2 weeks", "Interview Questions": " 3 questions, with a lot of follow-ups after each one:\n1.  tell us about your motivation for applying to this internship, and the reasons why you would be a good fit\n2. how do you organize yourself when you have a lot of work?\n3. tell us about the last time you worked as part of a team (asked in another language I mentioned in my CV!)"}, {"date": "28 Apr 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Very professional and detailed, focused on job related activities and duties.  I didn't wait long for feedback. I was relaxed and treated with respect from all panelists.  Very enjoyable experience and all the process.", "Interview Questions": "Questions related to the position. Describe a situation in which you did not agree with your superior and how you resolved it."}, {"date": "19 Apr 2022", "title": "Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNICEF in Apr 2022", "Interview Descriptions": "Contacted +1 month after I applied not via email. I almost questioned the legitimacy of it. The interview started with personal and experience questions, then proceed to directly asking the strategy for the roles, the detailed plan of actions (which was very shocking). It was intense and nerve-racking.  No case-based such as \"If you were faced with...\" at all. It was one of the most difficult and intense interview I've ever had.", "Interview Questions": "- How will you overcome the challenge?\r\n- What strategy will you plan to execute this program?\r\nThe questions are very detailed. "}, {"date": "2 Apr 2022", "title": "Senior Programme Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "No test, just a single interview with a line manager and a specialist. Both interviewers were late to start, and it took longer than the expected duration (over an hour). Focus was on subjective topics in relation to the job, which was interesting, but highlighted the lack of an objective focus. They took over 6 months to make a decision, by which time I'd already accepted another position", "Interview Questions": "What would be your short-term strategic focus in this position?"}, {"date": "17 Nov 2022", "title": "Procurement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF in Apr 2022", "Interview Descriptions": "Competencies-based interview, 4 questions related to competencies relevant to the job plus follow-up questions. 1 question on motivation fit to the job. The process took about 1 hour with 2 interview panel members and one HR.", "Interview Questions": "4 questions related to competencies relevant to the job plus follow-up questions"}, {"date": "28 Mar 2022", "title": "Protection Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at UNICEF", "Interview Descriptions": "The interviewer was very friendly and the targets of the interview were clear. The content of the questions was human-centered and focused on my ethics. The interview did not last very long.", "Interview Questions": "The questions were about my background, my targets, and future ambitions as well as focused on how I would act in a context of emergency."}, {"date": "15 Mar 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Competency based or STAR interview. There is an interview panel with a few people and length is for around an hour.  You should answer with examples demonstrating the competency they are asking about.", "Interview Questions": "They asked about the competencies that were outlined in the job description/advertisement. "}, {"date": "9 Mar 2022", "title": "Logistics Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Interview panel consisted of 5 people. Questions were mostly related to previous experience - I wouldn't call them traditional competency-based. Some were quite usual ones but a couple were, to my mind, very specific - requiring a knowledge that one could probably get only while working in the same environment as interviewers.", "Interview Questions": "Tell us why would you like to get this position"}, {"date": "9 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Two interviews, both very short and pointed; first was the Director and current intern, second was with the two team members I would actually support. All were very nice and easy to talk to", "Interview Questions": "Why did you apply? What would you like to get out of this internship?"}], [{"date": "3 Mar 2022", "title": "Graduate Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Verry Intensive and nerve-racking. needs. a lot of practice to get the job. surrounded by elites. world bank at the bootm floor. tigght sercutiry.  yes, i recommend this company and position. this place serves great opportunity and highly valued worldwide.", "Interview Questions": "1. what are your strengths?\r\n2. what are your wekanesses>"}, {"date": "1 Feb 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UNICEF (New York, NY) in Mar 2022", "Interview Descriptions": "Straightforward with basic questions asked but also job specific questions asked. Be prepared to talk about experience directly related to the job description, as most of the interview was talking about related experiences with follow up questions asked", "Interview Questions": "How have you analyzed data in the past?"}, {"date": "21 Feb 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Kigali, Kigali)", "Interview Descriptions": "The interviewers were 3 which is really amazing had a very clean and honest conversation with responsive conversations.\r\nIt was interesting with amazing conversations. They were very open to what they want in an intern.", "Interview Questions": "How do I maintain my mental health?\r\nHow would I maintain a balance between and and work. "}, {"date": "12 Feb 2022", "title": "Education Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "competency based interviews about concrete scenarios that you recall from previous experiences - you need to prepare ahead and come with ready situations that demonstrate competencies mentioned in the TOR", "Interview Questions": "N/A"}, {"date": "15 Feb 2022", "title": "Social Policy Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Competency Based Interview Format with a lot of scenario questions. Smooth but long interview process. Interviewer was hiring manager, who was very knowledgeable and friendly. It can be hard if you try to be spontaneous.", "Interview Questions": "Usual “tell me about a time when you….” kind of questions "}, {"date": "11 Nov 2022", "title": "Especialista en Desarrollo Social Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Buenos Aires) in Feb 2022", "Interview Descriptions": "Fue un panel de 4 personas. Entrevista por competencias. Preguntas de priorizacion de trabajo, dificultades, conflictos, innovacion. En todos los casos se solicito dar ejemplos. Ademas se realozaron preguntas especificas del puesto.", "Interview Questions": "Un ejemplo en el que no hayas podido cumplir un deadline"}, {"date": "4 Jan 2022", "title": "Chargé De Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "- Motivations\n- Cas Pratique sur le Marketing Particulier\nDans l'ensemble l'entretien était un échange relativement informel sans compter, bien sur, la partie étude de cas qui s'est avéré être beaucoup plus professionnelle. \nJe recommande aux postulants de bien se renseigner sur les missions du poste, savoir donner des exemples concrets s'avèrera être un grand atout.", "Interview Questions": "- Pourquoi Unicef?\n- Pourquoi vous et pas un autre?"}, {"date": "25 Dec 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "It was good at the beginning but it become difficult for me to answer all the required questions they had in the interview process  and I managed professionalism’s to get it .", "Interview Questions": "My previous experience with any humanitarian assistance "}, {"date": "8 May 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (New York, NY) in Dec 2021", "Interview Descriptions": "Very professional HR personnel. will walk you through all steps and reply to emails. The process is different, but can usually take around 3 rounds of interviews it's also lengthy and can take up to more than 4 months", "Interview Questions": "what's your motivation to work with UNICEF\r\nHow are your skills relevant to the job description "}, {"date": "23 Nov 2021", "title": "IT Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Candidates shortlisted for a position may undergo an assessment, followed by a reference check and other processes depending on the position level, area of work, and office context. Candidate assessment techniques will vary according to the contextual and business needs of the hiring office.", "Interview Questions": "Mention types of loops and provide examples "}], [{"date": "2 Nov 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Written and panel nterviews.Written was to be submitted through a computer test. Subject matter experts took the thematic interviews. The writte  npapaer was analytical and presentation type. Interviews were virtual and brief.", "Interview Questions": "How would you strategise the malnutrition reduction if the district"}, {"date": "7 Feb 2023", "title": "Programme Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in Nov 2021", "Interview Descriptions": "1-shorlisting 2- pre-assessment with questions around the job description areas and PowerPoint preparation with a deadline to share by email 3-Interview including PowerPoint presentation and motivation questions Presentation in English and questions in French (or vice versa)", "Interview Questions": "Tell us more about yourself? Why are you applying in an emergency country? Questions on some aspects of the presentation? (like Competency based Interview) What would you do differently? What did you learn? What enabled you to succeed"}, {"date": "10 Nov 2021", "title": "Human Resources Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF in Oct 2021", "Interview Descriptions": "I have applied online through UNICEF's job site where I have had to complete an application form, essentially uploading the information of my CV to this platform. I have been contacted 1 month later for an invitation for a  written test. It was a competency-based written test sent via scheduled email with 4 questions all related to only one specific field of Human Resources and only one part of the tasks related to the position as per the job description. I was given 1 hour and 15 minutes to review the questions and respond. The questions were very specific to the organizations' recruitment policies and were difficult. The evaluation of the test took another 3 weeks.", "Interview Questions": "make recommendations on how to attract IT talent and strengthen the candidate pool, draft email responses for specific queries by candidates, put together a recruitment plan"}, {"date": "10 Sept 2021", "title": "Estagiário Voluntário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "A primeira fase da entrevista é feita por um forms no google, após passar por essa fase é realizada uma entrevista pela plataforma Discord, na qual são criadas diversas salas e grupos. Devido a grande quantidade de pessoas e a dificuldade com a plataforma escolhida, a entrevista torna-se muito confusa e inefetiva.", "Interview Questions": "Qual o seu estilo de trabalho?\nComo funciona em trabalhos em grupos?\nQuais sua qualidades? E seus defeitos?"}, {"date": "8 Sept 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF in Sept 2021", "Interview Descriptions": "The questions were very general, even though I prepared for a competency-based interview. I was nervous but the panel were very warm and friendly.  My interview was done on Zoom.", "Interview Questions": "How can we improve our website?\nWhat are your strengths?\nWhy UNICEF?\nHow do you manage your time?"}, {"date": "26 Jan 2022", "title": "Admin Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY) in Sept 2021", "Interview Descriptions": "It is meant to be competency based so any answer can be considered very good or very bad based on the interviewer point of view and why not hidden agenda.", "Interview Questions": "All hypothetical situation where you can explain what would you do or have done in similar situations. "}, {"date": "25 Aug 2021", "title": "Comunicaci&oacute;n Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "The interview was really Simple and straight forward. I was very nervous but once i got there it was so easy and simple. I learned a lot. The interview was really Simple and straight forward. I was very nervous but once i got there it was so easy and simple. I learned a lot", "Interview Questions": "What are your biggest strengths\r\nWhat would you do in a particular case of conflict at work\r\nHow do you manage tight deadline\r\n"}, {"date": "24 Aug 2021", "title": "Policy Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY)", "Interview Descriptions": "I first gave a written test which was a take-home test and took three hours followed by a face to face interview (online) and then I submitted my references and writing sample. They spoke with my references via video chat and then made a decision. The whole process took about three months.", "Interview Questions": "Previous experiences and lessons learned from them"}, {"date": "9 Aug 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Took 4 weeks and in between two interviews, reference checks and offer, depend on the nature of works other positions can take up to 2 months long before the decision is made", "Interview Questions": "Competance based questions on Management or working with people"}, {"date": "5 Aug 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Aug 2021", "Interview Descriptions": "CV and cover letter had to be sent through a specific portal. After I was requested to do a written Test. The test took place at a specific date and time and I was asked to submit a PowerPoint presentation and answer a question regarding the area concerning the internship. After that I was invited to an interview through zoom of about 30 minutes", "Interview Questions": "Considering  the job description,how would you think you could use your strengths gained in past experiences and how do you think your weaknesses might impact?\nWhat is your understanding of Accountability to affected populations?\nCan you tell us a specific situation where you had to prioritize your tasks and coordinate a team to deliver those tasks?"}], [{"date": "3 Aug 2021", "title": "Captador donantes Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNICEF (Buenos Aires)", "Interview Descriptions": "Me pusieron a Prueba haciendo como si tuviera que captar un donante y darle los motivos del porque se tiene que unir a unicef y donar todos los meses con la trjeta de credito", "Interview Questions": "Porque te gustari trabajar aca"}, {"date": "23 Dec 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (Libreville) in Aug 2021", "Interview Descriptions": "Candidature sur la plateforme suivi d'un entretien en ligne moins de 1 mois après la clôture des candidatures. L'entretien s'est fait en ligne . Il y avait un panel de trois personnes avec des questions assez simple sur la mission.", "Interview Questions": "Parlez de votre parcours et du lien avec la mission"}, {"date": "23 Jul 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Colloquio su Skype con il responsabile della sezione per cui facevo application. Colloquio in Inglese, poco formale e lui mi ha messo subito a mio agio. Mi ha chiesto cose sul mio CV e sulla lettera motivazionale e poi gli ho fatto delle domande sul lavoro in questione.", "Interview Questions": "What do you know about UNICEF?"}, {"date": "14 Jul 2021", "title": "Marketing Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (New Delhi)", "Interview Descriptions": "Structured, formal interview. Not much conversation, strictly business. There were people from the team and one from HR at the panel interview. Why do you want to work for us. Some questions specific to the role.", "Interview Questions": "Why UNICEF? Why should we choose you?"}, {"date": "7 Jul 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (Toronto, ON)", "Interview Descriptions": "A thorough interview process starting with a phone interview, followed by a timed exam (remote from home), and two interviews. Everyone involved was friendly and considerate. I felt they were serious about finding the right candidate based on multiple skill sets.", "Interview Questions": "Describe a time you worked cross-functionally to achieve a goal."}, {"date": "10 Jun 2021", "title": "Consultant Specialist I Year Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "A panel interview with five interviewers. They asked pretty standard questions about past experience and competencies related to the job description. The interviewers were friendly and it lasted 30 minutes.", "Interview Questions": "Why do you apply to this job at UNICEF? \nTell me a time when you led a campaign in innovative ways."}, {"date": "19 Oct 2021", "title": "Associate Communications Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF in Jun 2021", "Interview Descriptions": "Blended interview with technical and competency based questions.\r\nThe interview took approximately 45 minutes and the panelist’s requested to provide details about past scenarios in which I had to apply my soft skills plus some technical questions", "Interview Questions": "Tell us about a time you had to implement a social media strategy\r\nTell us about a time when you had to deliver results under stressful circumstances "}, {"date": "4 Nov 2021", "title": "District Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF (Rānchī) in Jun 2021", "Interview Descriptions": "Question releated to development sector was asked\nInterview panel has 5 member\nInterview was conducted in the college. \nThere were only one round of interview. \nQues releated to social mobilization. \nWhy to join development\nCommunication for development", "Interview Questions": "About social marketing\nSocial mobilization activities\nCommunication for development"}, {"date": "24 Aug 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF in Jun 2021", "Interview Descriptions": "The first round consisted of completing a technical test (to be completed before the video call interview) which assessed my knowledge of the sector and asked me to create a short slide presentation with my recommendations for the stakeholders I would be working with in the role. They also asked for an example of a previous tool I had designed for the target community. These documents were to be emailed back two days before our scheduled interview.\n\nDuring the interview, which was with three members of the team in total, they gave me some scenarios the hired consultant might experience and asked me how I would respond in those scenarios.", "Interview Questions": "Please share your experience managing stakeholders."}, {"date": "24 May 2021", "title": "Administrative Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF (New Delhi)", "Interview Descriptions": "I had an interview with two managers, it went quite well. After a week I reach out to them and they said that I was the most promising candidate that they have and will discuss the role further with me. And ultimately end up ghosting me after several efforts. Says alot of the people and culture of UNICEF India.", "Interview Questions": "Situational base questions."}], [{"date": "16 May 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "the interview was short, half for self-introduction and half for the question \"what can you bring to us\". Following the self-introduction, the interviewer may ask some questions about detailed work experience", "Interview Questions": "what can you bring to us"}, {"date": "10 May 2021", "title": "Education Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Approximately 3 month after my application, I was invited for a written test. As I was out of my base country, I took the test in another country office. I completed the test and they did not even get back to me. \r\n\r\nI can understand because of time strain HR may be only able to inform shortlisted candidates. But I think short listed candidates needs to learn about the outcome of the test.", "Interview Questions": "-What's the biggest challenge education system faces?"}, {"date": "7 May 2021", "title": "Custom Protection Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "From what I read, your company is one of the leaders in database and website security for large corporations. I read your list of clients on your website and saw multiple Fortune 500 companies mentioned, including Verizon and IBM. Beyond that, I recently had an informational interview with James from the Marketing team, after messaging him on LinkedIn, and he shared a bit about your company culture; mainly, the emphasis on collaboration and open interaction between different departments and groups. That’s something that sounds exciting to me and that I’m hoping to find in my next job. Can you share more about how you’d describe the company culture here?", "Interview Questions": "Tell me about yourself and your last job"}, {"date": "2 May 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "I did not like the interview process. They gave me two questions to answer and not enough time. I also wish it was an in-person interview. I had to write the answers.", "Interview Questions": "What contributes to migration?\nDraw a chart"}, {"date": "29 Apr 2021", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "It is a 1 to 2 interview and it is held online. It lasts for 20-30 minutes, asking background information. You can use your mother tongue during interview and written test is required.", "Interview Questions": "why would you like to apply for this job?"}, {"date": "21 May 2021", "title": "Monitoring and Evaluation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8+ months. I interviewed at UNICEF (Kinshasa) in May 2021", "Interview Descriptions": "l'entretien ce passer sur internet je répondais à des quêtions. ensuite j'ais enregistre mon compte Gmail  .des question étais ci difficile mais par mes compétence je répondais . nous somme passer a l'étape des dossier je déposer mon cv; ma lettres de motivation adresser au directeur de la ressource humaine de l'entreprise .", "Interview Questions": "avez vous déjà  embrancher Unicef emboucher quelqu'un"}, {"date": "6 Jun 2022", "title": "Education Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at UNICEF in May 2021", "Interview Descriptions": "The interview process happened as it is described in online open resources. There were the hiring manager, HR representative, additional expert panel member. \n\nI was asked general questions and basic context-action-result questions. The interviewers were friendly. They were professional. Because of the specialized nature of the position I was applying for the interview did not seem to be the key determinant of hiring. \n\nMain tips: prepare for the interview reviewing UNICEF website, speak well and be confident.", "Interview Questions": "How did you solve a major problem in your past experience? What did you do and how it led to the result?"}, {"date": "13 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "A Short phone interview was conducted. \r\nThen, email confirmation for an interview would be received.\r\nInterview questions were mainly based on your CV (knowing more about your past working experiences and your career interest)", "Interview Questions": "Why did you apply\r\nWhat do you expect to achieve or be benefited\r\n..."}, {"date": "1 Apr 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "First I talked with the project manager in NYC. She asked me basic question Tell me about yourself and the courses I took back at college. She asked me What I was doing at that moment.Later I interviewes with her coworker on phone", "Interview Questions": "Tell me about yourself\nWhich courses you took related to law back at college"}, {"date": "20 Mar 2021", "title": "Telemarketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "First, I had a phone interview where I talked about myself, some of my experience and my motivation for working at the company.\nShortly after, I was invited to an interview in the  HQ where I was given a case and had to present it to the executives present in the meeting.", "Interview Questions": "Why would you be a good UNICEF ambassador? "}], [{"date": "22 Mar 2021", "title": "Education Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Smooth and friendly. Made me feel very comfortable and it was like a dialogue. The interviewers were very patient, gave me a chance to collect my thoughts and respond and made me feel at ease", "Interview Questions": "Describe a time when deciding on an appropriate course of action required careful and\nthrough review of complex and information from multiple sources"}, {"date": "19 Mar 2021", "title": "consultora Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "A primeira foi uma entrevista em dupla, onde nos foi perguntado algumas coisas individuais e depois Foi uma dinamica em grupo, super interessante com o que iriamos fazer no dia a dia", "Interview Questions": "Qual animal você se enxerga"}, {"date": "9 Mar 2021", "title": "Communication Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "The interview takes place after the written test. It took 45 minutes in the presence of the head of the section, another staff and the human resources representative. They ask an average of 2 questions each : Competency based interview and blinded questions after a written test", "Interview Questions": "Tell us about the digital last campaign you worked on."}, {"date": "4 Mar 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "First, you send cv and cover letter through their platform. A few month later they contacted to make a case assessment a few days later on a specific day and time. \r\nHad 2 hours to complete a case at home and send it in a specific frame of time\r\nboard interview both English and Spanish", "Interview Questions": "Why the role\r\nA crisis you managed\r\nYour relation with the values of the organization"}, {"date": "24 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (Ankara) in Mar 2021", "Interview Descriptions": "Easy and flexible interviews. Interviewers are also easy to talk with . I didn’t felt anxious or stressed in the in the interview. At the same time you should alert and confident when answering the questions.", "Interview Questions": "How you would deal with the refugees in your previous job?"}, {"date": "11 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at UNICEF in Mar 2021", "Interview Descriptions": "It was simple personality interview by UNICEF. So I entered and answered positively. The questions were difficult but I prepared and git success. The organization simply works for Education and donations are given for this purpose.", "Interview Questions": "They asked question about the progress of Education the things which are done by donors and stake holders. The positive impact if Pakistan went viral and it's builds positive impact."}, {"date": "17 Jun 2021", "title": "Camarógrafo Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (Posadas) in Mar 2021", "Interview Descriptions": "El proceso realizado fue una entrevista grupal, con preguntas de rutina, revisión de habilidades y donde vimos un poco de los trabajos que realizan. La segunda parte fue una prueba de cámara.", "Interview Questions": "Experiencia laboral en el rubro\r\n"}, {"date": "27 Feb 2021", "title": "Education Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "I had a written exam on the related areas to the job then had an interview asking me what I would do in specific situations. The written exam was easy and very much related to the jobs tasks", "Interview Questions": "Tell us about one achievement in your earlier job "}, {"date": "25 Feb 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "The process was straightforward, from the initial contact to invite to the interview. The discussions started off with my background and research interests and then I had an interview with someone more senior in which cases were discussed.", "Interview Questions": "What do you aim to have achieved by the end of the term? "}, {"date": "18 Feb 2021", "title": "Marketing Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at UNICEF", "Interview Descriptions": "Temporary role advertised through a recruitment agency.   Agency submitted application and emailed interview link for an online zoom interview. Pleasant 1:1 interviewer but have never heard anything since from the agency so I guess I wasn't successful! A simple email on feedback would have been nice.", "Interview Questions": "Give an example of an occasion when you made a mistake,  what you did and what you learned."}], [{"date": "11 Feb 2021", "title": "Programme Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "The process generally consists of two steps. Written test to reduce the shortlist then oral interview in the form of CBI depending on language requirement and location, both steps can be in two languages", "Interview Questions": "Tell us about a situation when...?  prepare Competency Based Interview and scenario in relation with the competencies required for the position"}, {"date": "12 Feb 2021", "title": "Monitoring and Evaluation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "phone interview about technical questions. they also asked me if i could speak other languages. the panel members were very frendly. if you can describe about yourself properly, there will be no problem.", "Interview Questions": "do you speak any other languages?"}, {"date": "11 Feb 2022", "title": "Project Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF in Feb 2021", "Interview Descriptions": "Pleasant interview after I applied. \r\n\r\nWas told to hear back the result next week, never heard back. \r\n\r\nAfter six weeks and numerous contact attempts was told I was rejected.  \r\n\r\nOverall, ok interview, but the lengthy process with too many applicants per place, as is the case with the UN always.", "Interview Questions": "Tell me about yourself.\r\nWhat can you bring to the job? "}, {"date": "29 Jan 2021", "title": "Promoter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Firstly they invite you for the on the job test on the street, and if you pass that they send you immediately to the office for another round with the manager of the whole department.", "Interview Questions": "Can you commit for at least one year"}, {"date": "21 Jan 2021", "title": "Immigration Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Applied for the position, then a month later did an online exam of answering two essay questions in one hour, then a couple of weeks later did a phone interview for around 30 minutes. Received a decision one month late, got rejected because my reference forgot to send reference letter!!", "Interview Questions": "Why work at UNICEF?\r\nDescribe your typical day?"}, {"date": "12 Jan 2021", "title": "Team Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England)", "Interview Descriptions": "Competency-based online interview with a panel of 3 people - everyone was very nice. The questions were quite straightforward and I could drew from my previous experiences. After 1 week, I received a call informing that I was unsuccessful.", "Interview Questions": "Why do you want to work for UNICEF UK? "}, {"date": "14 Jan 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "The interview process was very organized, structured, and the interviewers were nice. They asked only the questions directly related to the position. I received feedback in the promised time. Although the whole process is very formal and lengthy (considering the nature of the organization), the people involved are very professional.", "Interview Questions": "Tell us a time when you worked well under pressure. "}, {"date": "4 Feb 2021", "title": "Monitoring and Evaluation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Geneva) in Jan 2021", "Interview Descriptions": "Shortlist , written assessment,  interview  , second interview \nThe whole process took almost three months from application submission to get an offer.\nThe interview was over the Microsoft teams and the second was over the phone more related to technical stuff i.e SPSS, Statat, most of the question were from glassdoor and standbyroster.org website", "Interview Questions": "Q1:  Please review the attached ‘Incidents.csv’ file for ACLED data on Morocco.  Please identify the following:\n1)  How many total incidents of Riots/Protests and Violence against Civilians were there in the period 2000 to 2010, inclusive. \n2)  Using Google Docs, make a bar graph showing Riots/Protests and Violence against Civilians per year for the whole dataset.  The graph should communicate both the total number of incidents (Riots/Protests + Violence against Civilians) as well as the totals for each category\n3)  Write a paragraph describing an approach to automating the production of this graph.  \n"}, {"date": "14 Aug 2021", "title": "UNV Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Bonn) in Jan 2021", "Interview Descriptions": "6 competency-based questions, very specific to the country context and rather technical. Overall, it was pretty friendly but it required a lot of country-specific prep, the usual strategy on how to prepare for a competency-based interview didn't quite work for me. Knowing this now, I would've tried to get my hands on the programme documents.", "Interview Questions": "Country specific technical programme questions "}, {"date": "20 Sept 2022", "title": "Full Time Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Jan 2021", "Interview Descriptions": "A long but positive process. Well, thought-through questions and a friendly interviewing panel. It took around 2 months from the interview to a job offer. Only one round of interviews was involved.", "Interview Questions": "- Interest in the positions.\r\n- Previous experience with similar jobs. \r\n- 3 technical questions.\r\n- Knowledge of the region. \r\n- Understanding of global priorities on the topic. "}], [{"date": "16 Dec 2020", "title": "Education Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Step 1: Written test\nStep 2: Skype interview\nStep 3: Certificates checked in person\nStep 4: Offer\n(Step 1 was in Jan- offer received in May)\n\nThe interview was technical. Panel of 3 people. 2 people from the technical field 1 person from HR.", "Interview Questions": "Relevance of RTE\nExperience of managing teams\nExperience of mitigating field challenges\nAnd other competency based Qs"}, {"date": "23 Dec 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY) in Dec 2020", "Interview Descriptions": "The interview takes about 30 minutes and though Zoom. There will be 3 people asking the questions. Mainly, they are trying to see if you are the best candidate to do the job. The result is quite fast, after several days from the interview.", "Interview Questions": "Why should we hire you?"}, {"date": "28 Jan 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Dec 2020", "Interview Descriptions": "Focussed on past experiences and taking questions from two or more people.  There is often, but not always, a very deferential approach to the hierarchy.  Consultants are, apparently, not subjected to the requirement for regional equity that staff positions are.", "Interview Questions": "Describe a difficult situation and how you handled it."}, {"date": "25 Jun 2021", "title": "Communication for Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (New York, NY) in Dec 2020", "Interview Descriptions": "First call: initial screening\nSecond call: interview with a consultant\nThird call: interview with the direct manager\n\nMostly all behavioral questions were asked at each interview and specific questions about UNICEF as an organization.", "Interview Questions": "Why are you the best candidate?\nWalk me through your resume?"}, {"date": "23 Nov 2020", "title": "Accounts Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Copenhagen, Capital Region)", "Interview Descriptions": "Horrible experience. First step was assessment which I pass and then it was interview through zoom. It was strictly said there won't be camera through interview and then 3 minutes before start of interview they said we should use camera. I think that was also some kind of test, which I fail. I didn't want to use camera cause I didn't prepare myself . I had home clothes, without make up etc.", "Interview Questions": "Communication with other departments, with other people. Why you are for that job.. Some technical questions regarding accounting"}, {"date": "22 Nov 2020", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Intimidating in the beginning as interview was conducted with a panel of 4 people, but eased in to it as I drew from previous experiences to answer questions that were competency based.", "Interview Questions": "How did you handle a workshop"}, {"date": "15 Nov 2020", "title": "Programme Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Selection by the UNV plateform. Two weeks later, convocation for an interview. Interview by three people from the programme on skype. Duration:45 minutes. They were very kind to me. Interview directly in relation with the position. Technical questions.", "Interview Questions": "How I managed conflict situation by giving an example."}, {"date": "6 Nov 2020", "title": "Contract Software Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "After submitting my application, a recruiter reached out over email a few weeks later and asked me to complete ~3 hours of technical work, and email them back my results. As a senior consultant, I don't typically do several hours of free work without even a phone call, but it's UNICEF, so I agreed. A week later, I was notified over email that I passed the technical interview, and went on to a soft-skills assessment, which was a 50 minute phone call. The questions were scenario based. It's been months, and I never heard back.", "Interview Questions": "Describe how you have handled this extremely specific specific situation in the past."}, {"date": "27 Oct 2020", "title": "Junior Social Media Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF in Oct 2020", "Interview Descriptions": "After a lengthy online application form, I was invited to participate in a technical test. Overall, the test took around 3-4 hours. After submitting the test, I received an email about a week later with an invitation to a 30-minute interview which was conducted by Skype audio. Questions were primarily technically-focused with a focus on examples of past projects and my specific roles within those projects. I received a notice that they had gone with another candidate about a week later.", "Interview Questions": "Have you worked on a remote team in the past? \n\nWhat is a communications challenge you had to overcome? \n\nHave you ever had something go wrong? What did you do? What was your specific role?"}, {"date": "3 Feb 2021", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY) in Oct 2020", "Interview Descriptions": "Online test followed by competecny interview. Interview was conducted by HQ staff and they also required evidence to show resourceful skills. Online test followed by competecny interview. Interview was conducted by HQ staff and they also required evidence to show resourceful skills.", "Interview Questions": "Frameworks for solving humanitarian crisis.Frameworks for solving humanitarian crisis."}], [{"date": "17 Sept 2020", "title": "Public Partnerships Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "The first round was completely automated and asked me to complete a case study.  The second round was a virtual interview with real people.  HR informed me that I was not selected.", "Interview Questions": "How would you present this case to our higher ups?"}, {"date": "22 Jul 2020", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Did a 4 hour exercise before an interview - found very strange. Barely knew about the role or team before devoting significant time and effort. Seemed like a strange order of events, despite being very supportive of the exercise assignment as a key hiring component!", "Interview Questions": "Simulation of work type activity "}, {"date": "10 Jul 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "An HR Manager conducted the interview over the phone and it lasted about ten to fifteen minutes with several open ended questions. I was also able to ask questions if desired.", "Interview Questions": "What attracts you to this position? "}, {"date": "8 Jul 2020", "title": "Temporary Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at UNICEF", "Interview Descriptions": "It was more quite a casual chat and the interviewer did ask me about my background and interest. They were also very open about the job nature and about the temporary nature of the job,", "Interview Questions": "Can you describe any event management experience?"}, {"date": "1 Sept 2020", "title": "Corporate Partnership Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Minsk) in Jun 2020", "Interview Descriptions": "i was invited for a test two months after i applied for a job offer. the test took me an hour or so. UNICEF local team decided not to move forward with my candidature and then the job offer was readvertised with a slightly different description", "Interview Questions": "development of UNICEF programme in the country"}, {"date": "20 Apr 2020", "title": "Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "received an email i made it to the next round... radio silence after that. really confusing and contradictory process. i love unicef and would love to work for them but the hiring process was pretty weird", "Interview Questions": "availability"}, {"date": "18 Mar 2020", "title": ", Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF", "Interview Descriptions": "I applied with the cover letter and resume. A week later, I received a call requesting a phone interview.  On the day of the interview, I was asked background and skill based questions by two hiring individuals.", "Interview Questions": "How do you handle multiple assignments with pressing deadlines? "}, {"date": "26 Apr 2023", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF in Apr 2020", "Interview Descriptions": "There were two recruiters on a call and around 5 candidates. Each had to present their pitch. We had to explain how we would sell an object near us and connect it to UNICEF's values.", "Interview Questions": "Try to sell us an object near you"}, {"date": "9 Mar 2020", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "very unresponsive, essentially ghosted me after interview even after giving me really positive feedback and acting like they were going to move me along in the process. i followed up repeatedly but they did not even let me know of their decision as a courtesy", "Interview Questions": "experience "}, {"date": "27 Nov 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNICEF (Bhopal) in Mar 2020", "Interview Descriptions": "It was a positive experience overall. I did not know answers to most questions, but I got selected based on attitude and confidence.  The interviewer was calm, didnt bethay emotions in her voice.", "Interview Questions": "What are SDG? What is a social indicator? Etc."}], [{"date": "9 Aug 2020", "title": "ESTÁGIO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Rio de Janeiro) in Mar 2020", "Interview Descriptions": "Entrevista feita por um grupo de 3 pessoas do escritório. Primeiro, temos a oportunidade de apresentação, depois somos introduzidos ao processo de trabalho e podemos fazer perguntas para as entrevistadoras.", "Interview Questions": "Como você imagina que a UNICEF possa atuar no território carioca?"}, {"date": "25 Feb 2020", "title": "Intern - Monthly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF", "Interview Descriptions": "It was fairly easy. Just a bunch of questions on why I would like to join and how I would contribute. I ended up interning for two months. Also, it's helpful to know what UNICEF works for and their long term vision.", "Interview Questions": "Why UNICEF "}, {"date": "5 Feb 2020", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "One interview was done by phone, one interview done by skype, both technical and logistical questions. There was only another candidate. The recruitment is based on your experiences but also your motivations and what you know of the organization.", "Interview Questions": "Why the position"}, {"date": "14 May 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Ciudad de Mexico) in Feb 2020", "Interview Descriptions": "Envié mi postulación por LinkedIn\r\nMe contactaron por correo y pidieron completar mi perfil en la página oficial de la ONG.\r\nMe citaron para entrevista en menos de dos días.\r\nA la hora de la entrevista fue un poco más tarde y muy rápida. \r\nLas preguntas fueron muy breves y no relacionadas con la vacante. \r\nObtuve respuesta después de dos semanas.", "Interview Questions": "-Cuéntanos sobre ti\r\n-Cómo produces contenido audiovisual \r\n-Con qué material cuentas para producir"}, {"date": "27 Apr 2022", "title": "Planning and Monitoring Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (Addis Ababa) in Feb 2020", "Interview Descriptions": "First, the office sent me an email to confirm my availability for the \"x\" day and \"y\" time to do the interview . The interview was through the phone and it took us around 45 minutes. The panel member were four and the interview went well.", "Interview Questions": "Tell me a situation when you disagree with the decision made by your manager/supervisor? how did you address the situation? "}, {"date": "28 Jan 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF", "Interview Descriptions": "I mostly walked through my resume and talked about previous employment experience in international issues. Be prepared to talk about each of your activities in detail. If you are fluent in multiple languages, make sure to emphasize that point", "Interview Questions": "Can you walk through your resume for us?"}, {"date": "23 Jan 2020", "title": "Digital Content Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UNICEF (London, England)", "Interview Descriptions": "I was an internal applicant so didn't have to do the gigantic and unwieldy online form. Submitted resume and cover letter and then was invited to interview and do a 45 min written test which were on the same day.", "Interview Questions": "Why do you think you are a good fit for the role?"}, {"date": "9 Mar 2021", "title": "Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNICEF in Jan 2020", "Interview Descriptions": "Topic sentences are similar to mini thesis statements. Like a thesis statement, a topic sentence has a specific main point. Whereas the thesis is the main point of the essay, the topic sentence is the main point of the paragraph. Like the thesis statement, a topic sentence has a unifying function. But a thesis statement or topic sentence alone doesn’t guarantee unity. An essay is unified if all the paragraphs relate to the thesis, whereas a paragraph is unified if all the sentences relate to the topic sentence. Note: Not all paragraphs need topic sentences. In particular, opening and closing paragraphs, which serve different functions from body paragraphs, generally don’t have topic sentences.", "Interview Questions": "Topic sentences are similar to mini thesis statements. Like a thesis statement, a topic sentence has a specific main point. Whereas the thesis is the main point of the essay, the topic sentence is the main point of the paragraph. Like the thesis statement, a topic sentence has a unifying function. But a thesis statement or topic sentence alone doesn’t guarantee unity. An essay is unified if all the paragraphs relate to the thesis, whereas a paragraph is unified if all the sentences relate to the topic sentence. Note: Not all paragraphs need topic sentences. In particular, opening and closing paragraphs, which serve different functions from body paragraphs, generally don’t have topic sentences."}, {"date": "2 Dec 2019", "title": "Programmer Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at UNICEF (Hà Nội)", "Interview Descriptions": "Competency Interview and technical questions.\r\n1st candidate should pass the writing test and then short listed for interview.\r\nThe total time for processing is 2 weeks since the writing test. Interview process will last 30-40 minutes", "Interview Questions": "Working with people? Examples? Lesson learnt"}, {"date": "29 Apr 2021", "title": "Planning Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (London, England) in Dec 2019", "Interview Descriptions": "Had to fill out online application form on their system with my CV details and answer set questions. I was then invited for an interview where they told me to prepare a presentation and I had to talk through it during the interview.", "Interview Questions": "I got the sense they didn't read my online application because the interview questions were very similar so that felt like that was a waste of time. things like 'give an example when you worked well under pressure?'"}], [{"date": "6 Nov 2019", "title": "Social Policy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF", "Interview Descriptions": "The panel was very nice and the interview contained both technical and competency questions.\r\nThe questions were related to research and social policies in the country. Overall the experience was good.", "Interview Questions": "Give us an example of a challenge you faced at work and how you solved it? "}, {"date": "12 Mar 2021", "title": "Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF (New York, NY) in Nov 2019", "Interview Descriptions": "There is only one interview with my supervisor and colleague. It is pretty fast and smooth. they ask for 5 questions all related to your media experience. He also asked further questions regarding my specific experience.", "Interview Questions": "how do you think about the relationship between social media and fundraising. "}, {"date": "9 Sept 2019", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Interview process was quite regular. I found the information about work on facebook. Then wrote directly to the author of the post. He sent me the link to the position, so I could apply. Then I had interview.", "Interview Questions": "Please show your projects portfolio"}, {"date": "3 Oct 2019", "title": "Executive Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (Geneva) in Aug 2019", "Interview Descriptions": "I was contacted 1 week after the job posting closed for an interview. It was scheduled for 3 weeks later and it was a 45 min interview via Skype, mix of competency-based and behavioral questions, all very straightforward.", "Interview Questions": "Questions were asked in the required languages of the position (eng + spa + fre). "}, {"date": "23 Feb 2023", "title": "Human Resources Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF in Aug 2019", "Interview Descriptions": "Over All HR Functioning and ADMIN ROLE, logistics plan, Attendance management, Daily meetings, and over all district functioning, Daily meetings with DC and ADC1 and Other Nation Delegations, Managing over all employees of Around 9000 Staff and other parties including WHO and Govt Employees, Covered over all COVID functioning. This Role was so Time dedicated and women empowered that only females were considered for this Role", "Interview Questions": "Psychological Question Regarding Personality and traits Family history thinking patterns they way you Sit and Talk ETC"}, {"date": "23 Sept 2019", "title": "Education Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF in Jul 2019", "Interview Descriptions": "I have been invited to a written exam. After the exam, it has been 3 months. However, I have not been contacted after that. I sent them an email asking about the procedure after the exam. No answer. I learnt that somebody who had taken the exam with me has been invited to the interview and he did not hear about it after the interview for a month. I do not find it ethical. If a candidate cannot make it to further, they need to know that.", "Interview Questions": "What would you do if you were to develop a project with local authorities? "}, {"date": "4 Sept 2020", "title": "Promoter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Copenhagen, Capital Region) in Jul 2019", "Interview Descriptions": "first, there is a phone call, where you answer basic questions, after passing this step, you're invited for a trial day. After the trial, you're hired. I liked that they gave feedback for potential employees. Overall the experience is great", "Interview Questions": "practical, informational questions, on the trial day you're supposed to approach people"}, {"date": "13 Apr 2022", "title": "Captador De Donaciones Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UNICEF (Buenos Aires) in Jul 2019", "Interview Descriptions": "Entrevista grupal con actividades donde hablabamps primero cada uno de una experiencia unica que nos haya pasado, ahi cada persona tenia 5 min para hablar sola y deapuws debatir grupalmente, en un sorteo de papelitos cada uno se le asignaba una profesion que tenia que defender como la mas necesaria para ir a una guerra", "Interview Questions": "Que nos relacionaba a las causas por las que captaban fondos"}, {"date": "22 Jun 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "The interview process was fairly straightforward. I gave a written test that was for about two hours. Second round was a behavioural interview- normal strength, weakness questions. It was all online. The written test was emailed and had a time limit", "Interview Questions": "why UNICEF? "}, {"date": "15 Jan 2023", "title": "Nutrition Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF in May 2019", "Interview Descriptions": "The process was competitive there ware six of us at different time the exam process lasted 30 minutes the exam was taken in the form of telephone almost five question ware asked", "Interview Questions": "what is malnutrition gave me information ?"}], [{"date": "26 Jul 2021", "title": "M&E Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in May 2019", "Interview Descriptions": "Iterveiw process was slow compared to private organizations. It started from Application - Long-listing - Short-listing - Interview - Reference checks - Final offer. Communications are through e-mail so checking e-mail regularly is important.", "Interview Questions": "- Motivation to apply?\r\n- Experience in conducting M&E?\r\n- Challenges in conducting M&E?\r\n- Difference between development M&E and humanitarian M&E?\r\n- Challenges in office and how you dealt with?\r\n- Strength and weakness of yourself?\r\n- Communications and team play how you did it?\r\n- Experience in training people how to do M&E?\r\n- Experience in data collection, analysis and visualization?\r\n- Use of analytical softwares?"}, {"date": "15 Feb 2022", "title": "Private Sector Engagement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNICEF in Apr 2019", "Interview Descriptions": "There was a relatively easy written test (an assignment relevant to the role, to be completely remotely in 1 hour) followed by an interview. They were responsive and professional throughout the process, but I found the interview very difficult. They told me beforehand that the interview would be competency-based but after a few of those questions, the country representative asked me to explain specific technical terminology, and asked about what strategy I would take if given the position (which I had not prepared for).", "Interview Questions": "Tell me about a time you had to resolve a conflict at work"}, {"date": "24 Sept 2019", "title": "Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at UNICEF (Melbourne) in Apr 2019", "Interview Descriptions": "during the interview process they made us talk about our backgrounds and have simple conversation in a group setting about ourselves. after which on hiring they train you for a day and then start you off immediately on field.", "Interview Questions": "What are your strengths weakness and why do u want to work with us?"}, {"date": "21 Jan 2023", "title": "Promoter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Copenhagen, Capital Region) in Mar 2019", "Interview Descriptions": "30min conversation, checks for your emotional intelligence, connectives, also sense of humour but most importantly if you suit the culture. They dont really look into your background, unless you had a similar position", "Interview Questions": "Can you tell as a joke"}, {"date": "10 Feb 2023", "title": "Vendedor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (Buenos Aires) in Mar 2019", "Interview Descriptions": "Primero son entrevistas grupales , hacen juegos de roll luego si quedas pasas a una segunda entrevista con un grupo más reducido, indicando como sería el trabajo en el exterior", "Interview Questions": "Que preguntas harías para captar al cliente"}, {"date": "20 May 2019", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UNICEF (Abuja, Federal Capital Territory) in Feb 2019", "Interview Descriptions": "The interview process was transparent and i like the fact that everything was done remotely thereby saving the stress that comes with physical interview. I had a written test and after that a phone interview. The process last for about four months", "Interview Questions": "Why do you think you are the best candidate for the job?"}, {"date": "21 Aug 2020", "title": "Legal Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF (Bangkok) in Feb 2019", "Interview Descriptions": "Online phone call and series of emails setting up the internship.  I was asked about interest in the internship, how I could contribute, and why that office specifically.  Internship was listed as unpaid and stayed unpaid.  Security check and health insurance were mandatory.", "Interview Questions": " I was asked about interest in the internship, how I could contribute, and why that office specifically. "}, {"date": "25 Feb 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNICEF (Jakarta) in Feb 2019", "Interview Descriptions": "Informed for a position from their website, applied through email, received interview invitation to their office but I was only eligible via Skype call and they agreed. I was failed to get this job eventually.", "Interview Questions": "What kind of a research project you worked for and what was your role?"}, {"date": "19 Aug 2022", "title": "Diseñador Grafico Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (Querétaro, Querétaro) in Jan 2019", "Interview Descriptions": "Agradable y muy interesante, consta de conocer al empleador y a la institución, preguntas vilaterales. \r\nresponden dudas y generan un confianza , las pruebas permiten demostrar las habilidades del empleador .", "Interview Questions": "experiencia obtenida en trabajo similar ."}, {"date": "21 Aug 2021", "title": "Procurement Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNICEF (Russia, OH) in Jan 2019", "Interview Descriptions": "It was nice and friendly. \nThey've asked why did I apply for this job, asked to described several purchasing cases from my past, asked about challenges the international companies face when working on local markets.", "Interview Questions": "N/A"}], [{"date": "4 Nov 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF in Oct 2018", "Interview Descriptions": "Round 1: Online application, resume and cover letter. \r\n\r\nRound 2: Interview. One on one with the hiring manager. I was asked about:\r\n- why I was interested in UNICEF, and the role in particular. \r\n- how I preferred to work (alone or in a team). \r\n- my experience with tasks related to the role. \r\n- my prior experience. \r\n- how the people around me would describe me as a person. \r\n\r\nThe whole process took 2-3 weeks (fast).", "Interview Questions": "Why do you want to work at UNICEF? "}, {"date": "4 Jul 2019", "title": "Programmer Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (New York, NY) in Dec 2018", "Interview Descriptions": "It is a competency based interview. They ask you questions based on your past professional experiences and how you handled certain situations. Usually there is a HR person and 2 to 3 sometimes 4 staff members who are part of the team.", "Interview Questions": "Tell me about a time you had a conflict working on a team."}, {"date": "20 Nov 2018", "title": "HR Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF", "Interview Descriptions": "There were 2 interviews with many members of the management team. 1st general, second more specific for the job. Each person asked a question relevant to their position. Many questions were probing into experience relevant to the position. There were also questions regarding HR trends and practices.", "Interview Questions": "What are the most important issues in human ressource management in an international NGO?"}, {"date": "6 Nov 2018", "title": "Promoter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UNICEF (Copenhagen, Capital Region)", "Interview Descriptions": "First stage:  they test if  you can stop people on the street (no donations, just asking questions) \r\nOnce you pass that, they send you to the office for a talk with a manager", "Interview Questions": "Try to sell me this phone"}, {"date": "19 Aug 2020", "title": "National Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Jakarta) in Nov 2018", "Interview Descriptions": "Focus on competency-based interview and you can find out the sample through youtube on how to answer the interview. Mostly the panel interviewers at least 3 people, so need to prepare also the potential question related to the job description except for the competency-based questions.", "Interview Questions": "Tell me about your leadership?"}, {"date": "15 Apr 2021", "title": "Junior Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (Jakarta) in Nov 2018", "Interview Descriptions": "The interview took 1 hour, we are interviewed in a group with another applicants. The interviewer told us to communicate in a particular topic with another applicant. During communicate, the interviewer observed the way we communicate and asked applicants' opinion about the way we communicate.", "Interview Questions": "Basic question, tell me about yourself."}, {"date": "1 Nov 2018", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Brasília, Federal District)", "Interview Descriptions": "Entrevistas em agências da ONU são bem práticas. Então, eles propõem cenários e perguntam como você agiria baseado em experiências passadas, como pressão, conflitos, e habilidades práticas necessárias para o cumprimento da vaga.", "Interview Questions": "Conte uma experiência que você precisou lidar com conflitos no ambiente de trabalho e como você agiu?"}, {"date": "7 Jul 2021", "title": "Education Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at UNICEF (New York, NY) in Nov 2018", "Interview Descriptions": "I had a written exam, followed by a panel interview (competencies), followed by a second panel interview (technical). This was great, but the HR communication was not. I was provided misinformation about what to expect, and was told I had to interview at 3:30 am in the morning, without flexibility. I was told the last interview was an 'informal chat' with the Deputy Representative, when in fact, it was a panel interview grilling me on my technical knowledge. This was not a good experience.", "Interview Questions": "I was asked situation questions based on the competencies listed for the job, as per the AGORA website (free) help on competency-based interviews. They told me at the start of the interview which ones they were going to test, and I'd pre-prepared examples for each one."}, {"date": "15 May 2019", "title": "Independent Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 days. I interviewed at UNICEF (Lucknow) in Oct 2018", "Interview Descriptions": "It was a group discussion with senior unicef consultants,govt. officers and independent NGOS members regarding experience in child rights,mental health,child care institutions etc.The discussion was very cordial and enriching.it lasted around more than one hour.", "Interview Questions": "Tell us about your work experience."}, {"date": "6 May 2019", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Budapest) in Oct 2018", "Interview Descriptions": "First I had to complete a test that was sent to me via email. I had 2 hours and complete it and send back my answers. Then I was invited to an interview. I had to talk about myself then there were some competency-based question.", "Interview Questions": "Describe a situation when you had conflict with you supervisor."}], [{"date": "21 Sept 2018", "title": "National Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF", "Interview Descriptions": "I was sent an online test to complete over 2.5 hours. The questions were very specific to knowledge about the subject area and about UNICEF country plan priorities. There was also a case based scenario.", "Interview Questions": "TBC. I have not yet been called for an interview. "}, {"date": "25 Sept 2018", "title": "Temporary Appointment Finance Assistant GS-4 Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UNICEF (Budapest) in Sept 2018", "Interview Descriptions": "First I received an email, describing the who procedure. Step by step it was like 1. Written assessment 2. Open day (to know more about the job functions) 3. Skype interview (There was a choice of in person or Skype). Written assessment was bit tricky, 40 minutes for, receiving the  assessment by email and to respond and send it back, contained two interview questions, and technical part. It was not difficult but  just the time was short. however I passed some how and was invited for the open day. Next day was the interview, I could book the time and how would I like to e interviewed, in person or Skype, I chose Skype. Interview was STAR based.", "Interview Questions": "What if you have to bend the rules to get job done!"}, {"date": "28 Apr 2019", "title": "Programmer Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (Seoul) in Sept 2018", "Interview Descriptions": "Asked my interest to take a skype interview (I accepted), then set the interview date. The interview took around 30mins, there were 2 HR staff, a program chief, and a program officer.", "Interview Questions": "what was the biggest challenge from the previous job? How would you link your study in Graduate school to this work? Technical questions on the job"}, {"date": "1 Oct 2020", "title": "Heath Specialist (Supply Chain) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at UNICEF (Rangoon) in Sept 2018", "Interview Descriptions": "After passing short list and written test, I was invited to receive interview. The interview was conducted at UNICEF country office, Yangon, Myanmar. The interviewers were Immunization Health Specialist, the direct supervisor, and another two experts from immunization department and HR department.  They asked about technical and competency questions.", "Interview Questions": "What was your past experience on health commodity supply chain management area?"}, {"date": "18 Apr 2019", "title": "UNV Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Sarajevo) in Sept 2018", "Interview Descriptions": "Applied online and selected for the interview after two months. \r\nAfter the interview, the final decision was made after one to two months.\r\nPenal was kind and made me relaxed. Skype interview was not videotelephony yet it was just a voice call.", "Interview Questions": "Experience suffering from cultural diversity and how to cope with\r\nThe reason why leaders should look at peacebuilding "}, {"date": "9 Feb 2021", "title": "Public Relations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (London, England) in Aug 2018", "Interview Descriptions": "I was interviewed by three people in the marketing dept. All very friendly and the interview was relatively informal and chatty, although each had specific questions and my answers were marked on a scoring system", "Interview Questions": "If UNICEF's Soccer Aid social media team began to receive social media posts from people annoyed at being relentlessly chased for donations, how would you handle the situation? "}, {"date": "23 Jul 2018", "title": "Education Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Called to a 3 person panel interview. A line manager, a potential colleague and a schools person.  They were friendly enough and are one of the few who bothered to give informative interview feedback over the phone.", "Interview Questions": "What would be the challenge of getting schools involved in this project? "}, {"date": "24 Jan 2021", "title": "Construction Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Lagos) in Jul 2018", "Interview Descriptions": "First was a written test (Autocad, contract management and technical questions).\nThen a Skype interview which was competency based.\nAfter which was refrence check. The process was quite fast. The interviewers were nice and the interview was professionally handled.", "Interview Questions": "Tell us a time you couldn't meet a project deadline. "}, {"date": "6 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UNICEF (Beijing, Beijing) in Jul 2018", "Interview Descriptions": "After passing the written test, I had my interview conducted over the phone. My interviewer (later my supervisor) was very kind and helpful. We talked for about half an hour, she explained this position's responsibility in details and asked me if I would be interested. Then we talked about my education and work experience. It was an enjoyable interview and I knew immediately that I would like her personality and it turned out I was right.", "Interview Questions": "Why did I want to work for UNICEF"}, {"date": "26 Jul 2018", "title": "Senior Marketing Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Markham, ON) in Jul 2018", "Interview Descriptions": "antiquated process ... before the phone prescreen I had a lengthier email exchange around salary expectations, nature of contract and benefits.\nThe phone screen was 30 minutes . It included  pauses as the interviewer was taking notes.", "Interview Questions": "Why I wanted the job?\nWhat qualifications made me the best candidate?\nWould I be ok with a 12 month contract, and no benefits ?"}], [{"date": "4 Mar 2020", "title": "Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England) in Jul 2018", "Interview Descriptions": "1 interview only but I did meet the line manager before hand. I submitted a cover letter and aCV as well as showreel. There were 3 people on the interview panel.", "Interview Questions": "What is the piece of work you feel the most proud of?\r\n"}, {"date": "20 Jun 2018", "title": "Education Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Shortlisted for online written test 2 weeks post advert closure, interviewed 2 weeks post test, employment and education reference check 5 hours post interview from great and friendly penalise though no offer yet but very optimistic there will be in the nearest future.", "Interview Questions": "What is a smart indicator"}, {"date": "13 Jul 2018", "title": "Education Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF in Jun 2018", "Interview Descriptions": "Application online >> Screening of the applications >> Skype Call Interview when shortlisted (Competency-based interview): Guidelines to have CBI can be found online, which will be useful to prepare interviews with UNICEF.", "Interview Questions": "Describe a time when you applied for technical knowledge. "}, {"date": "9 Jun 2019", "title": "Hack & Quality Assurance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Ḩawwārah, Amman Governorate) in May 2018", "Interview Descriptions": "Professional and highly level interview \r\nQuestions about real cases \r\nSkills evaluation\r\nConversations skills\r\nNegotiations skills\r\nStress and conflicts managements\r\nPersonality evaluation \r\nTeam management \r\nOverall evaluation \r\nResult was good and need four weeks for result", "Interview Questions": "Case studies "}, {"date": "4 Jun 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF in May 2018", "Interview Descriptions": "Applied through their website and was asked for an interview a month later. Because this was a research internship, two researchers called were in charge of the interview.  It lasted about 20 minutes.  They asked me to introduce myself and talk about my background, studies and research projects.\r\n\r\nThey never emailed me back to say I didn't get the internship.", "Interview Questions": "What are your quantitative and programming skills?"}, {"date": "31 May 2018", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Kuala Lumpur) in Apr 2018", "Interview Descriptions": "Applied online. Received a call for interview invitation. The interviewer very friendly and the interview was conducted in a group. My advise please take an initiative to talk first and listen to other candidate story.", "Interview Questions": "Strenght & Weaknesses "}, {"date": "24 Oct 2018", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF in Apr 2018", "Interview Descriptions": "Technical Questions directly related to the job. A mix of skills was required. Questions were asked in relation to each of the areas required to accomplish the tasks. They included both the software aspects as well as the hardware components", "Interview Questions": "Key aspects of a water supply system"}, {"date": "15 May 2018", "title": "Consultant coordinateur de projets Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (New York, NY) in Mar 2018", "Interview Descriptions": "Postulé en ligne, envoi cv, lettre de motivation et proposition financière,  entretien via Skype (mars 2018). \r\nPostulé en ligne, envoi cv, lettre de motivation et proposition financière,  entretien via Skype (mars 2018).", "Interview Questions": "- En quoi votre profil correspond au poste?\r\n- Décrivez une expérience négative dans votre travail passé et expliquer comment vous avez résolu le problème "}, {"date": "21 Aug 2021", "title": "Programme Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (Beirut) in Mar 2018", "Interview Descriptions": "you are invited to discuss the shared case study with other candidates for 30 mins, then you will be interviewed alone for 15 mins to answer only 3 main questions.", "Interview Questions": "what is the added value to UNICEF"}, {"date": "21 Mar 2018", "title": "Sales and Applications Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNICEF (Calcutta) in Mar 2018", "Interview Descriptions": "worst interview process ever. they started with group discussion , at a time 25 candidate attend the GD , it was look like a fish market.. the interviewer was busy with phone, he didn't concentrate on GD. after completing GD they declare the shortlisted candidate, they shortlisted those candidate who was silent but how they did it.. that was most third class interview i have seen ever.", "Interview Questions": "GD on Demonetization"}], [{"date": "15 Aug 2019", "title": "Assistant Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Paris) in Mar 2018", "Interview Descriptions": "L'entretien s'est déroulée en anglais en francais et en présence de 3 personnes. Plusieurs questions m'ont été posé . J'ai également passé un test psychotechnique et un sujet de dissertation sur le droit des enfants.", "Interview Questions": "Quelles sont vos défauts "}, {"date": "7 Apr 2018", "title": "Brand Manager (Mat Cover) London Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at UNICEF (London, England) in Mar 2018", "Interview Descriptions": "Poor communication with internal HR team, initial call, followed up with an invite to interview with incorrect information.\nInterviewed by 2 people, felt very hostile and fake, read questions off one after another without any dialogue or interaction with me. \nFor a charity brand like UNICEF you would hope the people who work there are at least pleasant, the 2 that interviewed me weren't.\nMade my mind up when leaving that even if I was offered the role I wouldn't want to work there.\nShame as it does such great work.", "Interview Questions": "Tell me why you want to work at UNICEF?"}, {"date": "23 Apr 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UNICEF (New York, NY) in Mar 2018", "Interview Descriptions": "One interview with the team supervisor, was very specific to the project. Super kind and funny, not intimidating at all ! Second interview was with two members of the team and that was really nice to, as you got to see the dynamic.", "Interview Questions": "What SDG is most important to you? "}, {"date": "29 Nov 2020", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in Mar 2018", "Interview Descriptions": "Two people interveiewed me, including the person to whom I later reported and that person's superior.  They asked me competency based questions related to criteria listed in the job posting.", "Interview Questions": "How did you deal with conflict?"}, {"date": "12 Aug 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UNICEF (Hong Kong) in Feb 2018", "Interview Descriptions": "They (1-2 interviewers, usually your supervisor) asked about the work of UNICEF HK, e.g. Children's Rights, reasons for choosing UNICEF, and some situational questions depend on the department you are going to work.  You will also have written test about translation.", "Interview Questions": "N/A"}, {"date": "21 Oct 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Karonga, Karonga) in Jan 2018", "Interview Descriptions": "Written for about 2 hours questions are four you answer in essay formart oral Is for almost one hour you respond questions from experts in that field the questions are not difficult", "Interview Questions": "How do you develop a project that incorporate GESI approaches?"}, {"date": "18 Mar 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at UNICEF (West Melbourne) in Jan 2018", "Interview Descriptions": "Panel interview with a group of 8-10 people. There are two interviewers.  Self introduction, personal background as the first part. And then we were asked to react to a scenario.", "Interview Questions": "How did you find this position?"}, {"date": "18 May 2018", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF in Dec 2017", "Interview Descriptions": "I apply, get the invitation for written test after few days. Wait for 2 week to take the written test and then the interview. Everything takes around 3 months.", "Interview Questions": "1. Describe the time when your team has to collaborate with other team. What was the challenge and how you encourage the collaboration to take the initiative?\r\n(Competency: Working with people)\r\n\r\n\r\n2.  Explain the time when you have to adjust your team plan due to unanticipated challenge?\r\n\r\n(Competency: Planning and Organizing)\r\n\r\n3.  Describe a situation when you have to push yourself to achieve a demanding goal?\r\n\r\n(Competency: Drive for Results)"}, {"date": "26 Jan 2018", "title": "Assistant Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Dec 2017", "Interview Descriptions": "The interview consists of written test and an interview.  there are usually 10 persons selected for the written test and 4 persons are called to the interview. the interview is usually with HR, manager and one more person and it is competency based interview. you can look up the qs on the internet.", "Interview Questions": "the written interview had 5 questions: 4 related to a project proposal ( realize budget, make  a note for the specialist to sum up the project, what are the missing pieces of the project and how to make it better). the interview is competency based interview. and they analyze communication, drive for results, working with people, planning, knowledge. "}, {"date": "2 Jul 2018", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (Melbourne) in Dec 2017", "Interview Descriptions": "It was a group interview. Casual conversation, good atmosphere. I was offered the job but had to decline because the travel distance was too far. Overall positive experience, might apply again is the job location is closer.", "Interview Questions": "What makes you mad? (e.g. unfair situations)"}], [{"date": "2 Jul 2018", "title": "UNICEF Face to Face Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (Melbourne) in Dec 2017", "Interview Descriptions": "I attended a group interview to be a fundraiser with UNICEF. Casual chat, good atmosphere. I got the job but decided to decline as the travel distance was too far. Overall good experience.", "Interview Questions": "What makes you mad? (e.g. unfair things in the world)"}, {"date": "11 May 2018", "title": "Production Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Dec 2017", "Interview Descriptions": "The interview process lasted just over an hour in their main London. I was interviewed by 2 members of staff who were polite and friendly. The interview felt informal and relaxed which was good.", "Interview Questions": "Give an example of a time you overcame a challenge"}, {"date": "26 Oct 2017", "title": "Global Citizenship Fellowship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 months. I interviewed at UNICEF", "Interview Descriptions": "Submitted my application toward the end of 2015 (December I believe). Did not hear back until the end of January for a preliminary interview with a recruiter based in NYC. I was then recommended for the next step, which was a Skype interview.  Time went on and I did not hear back. Finally, in April/May 2016 I received an email stating that I was a finalist. \r\n\r\nI was invited to the Boston office to give a presentation and meet the staff. I live in another state so I paid for my non-reimbursable flight/hotels (silly of me,  I know).  After the interview, tI received 2 more phone calls:  one from the HR and another from one of the interviewers in Boston. They called my 2 references and told them I would without a doubt hear back in a week.\r\n\r\nWell guess what? I never heard back. Followed up: nothing. Silence, silence and silence. \r\nIt's fine if I didn't get the position.. But to drag a person through a LENGTHY several month application process and not have courtesy to follow-up is absolutely enraging. \r\n\r\nCompanies always expect candidates to have decorum and open communication.. etc. But when a revered org like UNICEF cannot reciprocate that, it speaks volumes.\r\n\r\nEverytime I share this experience with someone, they are absolutely appalled. \r\n\r\nThroughout entire 4-5 months I received nothing but kindness. So why after the interview can you not have courtesy to follow-up.\r\n\r\nIt was not until 3 entire months later that I received a generic reply. \r\n\r\nFor almost a year, I beat myself up over this. The rejection is not what bothers me-- it is the lack of respect for candidates after a long application process.", "Interview Questions": "You had to pitch an idea to the interview panel"}, {"date": "25 Jan 2018", "title": "Human Resources Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Budapest) in Nov 2017", "Interview Descriptions": "After submitting an application, I was called within 3-4 weeks. They called me without being informed about in in advance. The questions were very general: What do you know about UNICEF, about HR work at UNICEF, about GSSC, why do you want to work here, how would you see your future here, why do you think you are fit for this job, what do you know about it?", "Interview Questions": "What do you know about UNICEF, about HR work at UNICEF, about GSSC?"}, {"date": "11 Oct 2017", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNICEF", "Interview Descriptions": "Cleared aptitude test and technical test easily and then was called for technical test. Successfully cleared the technical test and was selected for HR round and then was asked for filling out the feedback form and when filled the feedback form and was waiting for HR interview. Got to know that I got rejected without being interviewed in HR round.", "Interview Questions": "Questions were average and only asked from your technical test."}, {"date": "20 Jun 2018", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Jakarta) in Oct 2017", "Interview Descriptions": "the questions were very programmatic. it requires in depth research as your preparation. you may share about your experience but your planning strategy is really challenged. you may also need to reserach first about the hot issue in the government sector related to your position. in my case it was Musrenbang.", "Interview Questions": "skills"}, {"date": "27 Feb 2018", "title": "M&E Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Khartoum) in Sept 2017", "Interview Descriptions": "The hiring process lasted within a month. I was invited for a written interview and later on got short-listed for the oral interview via a phone. I received the final outcome after two weeks.", "Interview Questions": "Differentiate between monitoring and evaluatiob"}, {"date": "10 Aug 2017", "title": "Administrator In Communication for Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Abidjan)", "Interview Descriptions": "Applied online. Unicef contacted me 1 week later for a written test. We waited 1 hour in the garden outside because of an issue with their system. They never gave a feedback.", "Interview Questions": "Operational questions about the job (case study)"}, {"date": "17 Jul 2017", "title": "Program Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNICEF", "Interview Descriptions": "This position is under the UNV program. The process took total of a bit over 1 month. 2 weeks or so after my submission of application, I received an invitation to take a writing test (3 hrs). Writing test was pretty hard, a combination of all skills (program development, mngmt, budget planning/fundraising/investment case). About a month later, an interview (1.5 hrs) with 4 people (chief of program, program specialist, director of UNV in Vietnam, and an HR officer). A mix of technical and competence-based questions, very straightforward questions on the post and on past experience. A challenging but a pleasant experience.", "Interview Questions": "Why this post, why this program?\nTechnical questions that align with the post (for e.g. For this post on maternal health, infant care, informatic skills,...)\nPast experience that shows working in group, that shows a lesson learned, that creates a model to base other experiences on)"}, {"date": "13 Sept 2017", "title": "Face to Face Area Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Istanbul) in Aug 2017", "Interview Descriptions": "Candidates introduce each other as far as they can know to HR person.Afterwards HR tells about Unicef and its projects.Give us approx 15 min to prepare to project presentation which consist of both convincing the locals around workplace and talking well about projects.\r\nAnd resume check question and introducing", "Interview Questions": "Could you introduce yourself ?  \r\nProject presentation roleplay "}], [{"date": "18 Jul 2017", "title": "Door to Door Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Dublin, Dublin) in Jul 2017", "Interview Descriptions": "I applied online and was greeted by an email, asking to confirm a day for my interview that turned out to be a group interview. There was 6 people on this occasion.", "Interview Questions": "How do you deal with rejection?"}, {"date": "21 Apr 2017", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Still waiting to be invited for an interview. Not sure what to expect and what type of questions I will be asked, after all. The first step will include a technical assassment.", "Interview Questions": "Why are you interested in this position?"}, {"date": "24 Aug 2017", "title": "Monitoring and Evaluation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNICEF in Apr 2017", "Interview Descriptions": "The process consisted of an online assessment, and interview. It lasted approximately 4 months and involved different levels of interaction with the regional HR team in preparation. The online resources that are widely available are also incredibly helpful.", "Interview Questions": "Why do I want to work for UNICEF?"}, {"date": "21 Jul 2017", "title": "Public Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Panama, OK) in Mar 2017", "Interview Descriptions": "I applied online in December 2016 the contacted me in February 2017 via phone call to give me a date and hour for the interview which was an online test, the time for finishing the test was 2 hours and it took me exactly that time to finish, they asked me 3 questions", "Interview Questions": "Make a press release involving UNICEF based on a story they give you,"}, {"date": "11 Mar 2018", "title": "Programmer Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (New York, NY) in Mar 2017", "Interview Descriptions": "2 panel interviews + a last interview took place. First interview was held over phone, the panel was consisted of HR person, a person from a section, the supervisor, and one more staff member. Second interview was a bilateral with my supervisor. The final was just to check my acceptance. Overall, the interview followed the competency-based questions, not only technical knowledge, but more focused on how you have learned and how that experience can be applied to the current position.", "Interview Questions": "What was the biggest challenge in your previous position?"}, {"date": "4 Apr 2017", "title": "New Ventures Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Mar 2017", "Interview Descriptions": "Online application to even get to interview is really really lengthy, is online and requires a 1000 character answer for each competency from the JD, in this one there were 10 to get through.  Then also a 2000 character supporting statement based on their 7 common approaches. \r\n\r\nThe actual interview, I was interviewed by 3 people when I was told it would be 2, they were running late and I found them pretty cold and difficult to connect  with.  I did a presentation in my interview and just found the atmosphere in there kinda odd.", "Interview Questions": "Some questions were a little odd and lengthy, the kind where you are asked 3 long questions in one go so by the time they finish asking, you've totally forgotten what was asked.  I was asked questions around insight, strategy, business planning.  I then never even heard back either way after the interview which I think is pretty poor. Interviews can be nerve wracking and require a lot of preparation, If felt like I really prepared for this interview so not to even get any answer from them is pretty disappointing."}, {"date": "20 Feb 2017", "title": "Human Resources Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Dhaka)", "Interview Descriptions": "I was hired through a technical written test and  panel interview. I was first invited for a written test with twelve other applicants and tested for two and a half hours on HR issues.  Consequently  based on the test result I was invited for the interview,", "Interview Questions": "How did a resolve a conflict among to colleagues,"}, {"date": "15 Feb 2017", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at UNICEF", "Interview Descriptions": "Applied via email. Received a response two weeks later. Conducted a half-hour phone interview. Then was called in for a 1 hour in person interview with a group of individuals. It seems they were asking competency based interview questions. Received a polite email about two or three weeks later stating that my application was no longer in consideration.", "Interview Questions": "They asked to give an example of when I had experienced a failure and how I handled it. "}, {"date": "7 Mar 2017", "title": "Website Maintenance Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Belgrade, Central Serbia) in Feb 2017", "Interview Descriptions": "I applied online, got contacted by their HR and got interviewed in UNICEF Belgrade office in February 2017.\r\n\r\nInterview was about half an hour long. One tech person and the other two from management/hr. They went through my background and experience, what I do now and what can I offer. They explained what they need and compared that to my knowledge to see if I could start working in less then a week since no training would be provided.\r\n\r\nThe general tone of the conversation was good and welcoming. Even the compensation part.", "Interview Questions": "Do I own all the licences for the software I use."}, {"date": "4 Apr 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Toronto, ON) in Feb 2017", "Interview Descriptions": "Did a phone interview 3 months after submitting my resume. Phone interview with HR was pleasant. Did a 2-hour technical assessment that tests your skills in marketing strategy, branding  and proof reading. Didn't reach the face-to-face interview with hiring manager.", "Interview Questions": "Create a marketing plan based on the conditions provided."}], [{"date": "2 Dec 2017", "title": "Education Assessment Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNICEF (New York, NY) in Jan 2017", "Interview Descriptions": "The process took 4 months, give or take. I applied on-line in November 2016, was invited to take a written test to be submitted in 2 hours. A couple of months later, I was invited for a skype  interview. That was the end of the process on my end because I am still waiting for the outcome.", "Interview Questions": "Questions were mostly based out off the kills and competencies of the job requirements."}, {"date": "11 Apr 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at UNICEF (Kano, Kano) in Jan 2017", "Interview Descriptions": "typically phone calls with HR representatives to determine if applicants have the qualifications needed to do the job, one of the final steps prior to making a job offer is reference checks to  verify candidates’ employment details including job performance, strengths, and weaknesses.", "Interview Questions": "Can you tell me a little about yourself?"}, {"date": "19 Jan 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNICEF (Kathmandu) in Jan 2017", "Interview Descriptions": "Straightforward phone interview with a panel of 3 people. As it was a consultancy role and not a full time position, the interview process was not as rigorous as usual.", "Interview Questions": "- Why do you want to work for UNICEF? \n- What strategies would you employ for this project? "}, {"date": "9 Apr 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (New York, NY) in Dec 2016", "Interview Descriptions": "Round 1: Resume and cover letter\r\nRound 2 (had two separate 30-45minute interviews): In person interview with department and then HR. The HR interview was fairly generic with mostly behavioural questions. The department interview was more conversational than I expected with back and forth questions about my experience and how that fit into UNICEF's work.", "Interview Questions": "HR: strengths, weaknesses, resume questions \r\nDepartment: resume questions, previous experience, why UNICEF"}, {"date": "27 Apr 2017", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Bangkok) in Dec 2016", "Interview Descriptions": "There was a panel of 4 interviewers and based on competency interview, based on the job functions described in the position description and you are asked to come up with various scenarios from past experiences that speaks to each function.", "Interview Questions": "Based on your experience, name a task that you took lead and initiated and resulted in success."}, {"date": "21 Oct 2016", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at UNICEF (New York, NY)", "Interview Descriptions": "Firstly I had a phone interview, talking about my experience with programming and data analysis. Then I had a online-test. I had to reply to them with results in 2 hours. It is not so hard but you need to be familiar with R programming. Then I went to their office to have a talk to each other.", "Interview Questions": "Manage child mortality data."}, {"date": "24 Oct 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY) in Sept 2016", "Interview Descriptions": "it was an on-phone interview, both interviewees made it easy, they were nice and friendly.  it was a situational interview. they asked me to introduce myself, then describe situation where I used my teamwork skills, conflict management, and working with other departments.", "Interview Questions": "Describe a situation where you used your teamwork skills. "}, {"date": "3 Sept 2016", "title": "Public Affairs Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (London, England)", "Interview Descriptions": "Invited to interview at their London offices. Was asked to complete two written tasks, one was writing a letter to an advocacy target from the previous years report, the other was a brief to accompany the letter. The interview was with three members of staff good mixture of theoretical and practical questions", "Interview Questions": "What are the current long term issues facing the industry"}, {"date": "26 Sept 2016", "title": "Policy Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UNICEF (New York, NY) in Sept 2016", "Interview Descriptions": "competency based interview and HR questions. a panel of specialists. They seemed to take the process seriously which is great. Skype interview wasn't great for inter-personal feel which is also important in determining whether you want to work with one another or not.", "Interview Questions": "Analysing skill, communication skills, closely linked to the job description and one should prepare examples close to the job description"}, {"date": "2 Aug 2016", "title": "Senior International Programmer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF", "Interview Descriptions": "About 1 week after sending the application online, I received an email saying I had been selected for an interview. The interview asked basic competency questions. A couple days later, I received an email stating I had made it to the written assessment stage. The written assessment was done at home with a two hour period. A few days after, I was contacted again for the final interview: a one hour Skype call with the supervisor of that dept, another advisor, and the human resources coordinator.", "Interview Questions": "Give an example of a time when you juggled different information for different donors."}], [{"date": "15 Nov 2016", "title": "Asistente De Recaudación Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at UNICEF (Bogotá, Bogota) in Aug 2016", "Interview Descriptions": "- Primero realicé unas pruebas técnicas para evaluar mi capacidad para dicho cargo. Esta prueba tomó 1 hora y me la enviaron por correo, así que no tuve que ir a algún lugar.\r\n- Después tuve que hacer una prueba en inglés. Esta prueba tenia una sección de gramática y una entrevista. Tuve que asistir a un lugar especifico para hacerlo.\r\n- Finalmente me citaron a una entrevista por competencias con un panel de 5 personas. Incluso me hicieron un par de preguntas en inglés. Esta entrevista la realicé en las oficinas de UNICEF en Bogotá.", "Interview Questions": "Mencione una experiencia donde haya liderado un grupo.\r\nMencione una experiencia donde haya tenido que presentar resultados.\r\nMencione una experiencia donde haya fallado. Que hizo para solucionarlo.\r\nComo manejaría una gran cantidad de información y como haría para identificar si la información es útil o no?"}, {"date": "12 Oct 2016", "title": "Consultancy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at UNICEF (New York, NY) in Jun 2016", "Interview Descriptions": "A skype interview (audio only, no video) with a panel of 3 interviewers, one person from UNICEF and two from another organization that were involved in the specific terms of the consultancy interviewed me. A half hour was given for a scheduled call.", "Interview Questions": "They asked questions specific to the consultancy, in a competency-based manner (see UNICEF competency-based framework). I.E. As outlined in the TOR, this is the challenge that we are dealing with. How do you suggest that we move forward/in your opinion, what is the next step?"}, {"date": "13 Mar 2018", "title": "Wash Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (Kabul) in May 2016", "Interview Descriptions": "One month after job application, I was invited for written assessment and moved to the next step for Competency Based Interview (CBT) by skype. 4 panel members and it took around 40 minutes.", "Interview Questions": "1.\tGive me an example of when you had to explain something difficult to someone who did not have your background/knowledge."}, {"date": "18 Apr 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (New York, NY) in Jun 2016", "Interview Descriptions": "Email was swnt asking for availability for a phone interview. The phone interview was with a panel of three current employees asking different questions. It was a Skype interview but conducted like a phone call with no video.", "Interview Questions": "Hypothetical questions on how to handle challenges or issues that come up in projects"}, {"date": "19 May 2016", "title": "Media Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "Before the interview I was asked to write a press release based on information that was provided to me. The writing test lasted for 30 minutes.\r\nI was then interviewed by three employees: head of communications, HR and another person on the communications team. \r\nThe interview lasted about 20 mins. The interviewers took turns in asking the questions.", "Interview Questions": "They asked standard interview questions : competency etc., they also asked me about current affairs and news stories."}, {"date": "1 Apr 2017", "title": "User Experience Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UNICEF (New York, NY) in May 2016", "Interview Descriptions": "The process is around one hour. My supervisor asked me to demonstrate my design projects and provide a possible solution for current projects in the unit. After the interview, she informed the good result in two days. And we went over all administrative paper around one month.", "Interview Questions": "How do you use your design skill to solve the problem in the limited resource and move the project forward?"}, {"date": "19 Jan 2018", "title": "Programmer Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF in May 2016", "Interview Descriptions": "The interview for position in Kiev Ukraine was held in 3 or 4 stages, all remote - starting with email assignment, several skype conversations and written tasks on translation and organisational sckills. Very professional staff. All as described on their website.", "Interview Questions": "What is your experience with overcomming a difficult work situation?"}, {"date": "2 Mar 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Phone interview. Very straightforward and simple. Questions about experience and why you are interested in the job. A few follow-up questions were asked about prior experience. The whole process took about 4-6 weeks (this takes into account the Christmas holiday period). Interviewers were very courteous and helpful in answering questions.", "Interview Questions": "Why do you want to work at UNICEF?"}, {"date": "21 Mar 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UNICEF", "Interview Descriptions": "Relatively straightforward: written assessment and phone interview\r\nWritten assessment was a mini test of taks to be performed during the internship, e.g. Writing an invitation letter to a UNICEF speaker and watching videos of council meetings and writing briefing notes.", "Interview Questions": "Why are you interested in this position."}, {"date": "7 Aug 2019", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Mar 2016", "Interview Descriptions": "easy. The panel was friendly. I felt though, that I was being unprepared. 4 people were on the panel all from different sections. All took turns to ask why I wanted the job", "Interview Questions": "tell us about yourself"}], [{"date": "25 May 2016", "title": "Fundraising Specialist P4 Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UNICEF in Mar 2016", "Interview Descriptions": "For the first selection, a task was emailed to all candidates at a set time. we were given 1.5 hours to complete the exercise. The job was related to fund-raising in a particular sector. I received the offer for the first selection around 2 months after the closing date. Over 2 months after the initial test, I still have not heard anything back from UNICEF  (negative or positive) despite calling HR. I was told their process was slow but I was at least expecting a reply given i made it to the first selection.", "Interview Questions": "What should be the key elements of UNICEF’s Strategy in sector xxx?\r\nWhat KPIs should UNICEF’s xxx Strategy be evaluated against?\r\nGiven the broad nature of the role, how would you prioritise your time?"}, {"date": "26 Jun 2017", "title": "Short-term Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF (Almaty) in Mar 2016", "Interview Descriptions": "It took nearly 30-40 minutes. Interviewer asked question in the beginning in English, then proposed to switch to Russian. By  the way there was only one interviewing person, no panel.", "Interview Questions": "How do you deal with conflicts?\r\nHow do you work under pressure? "}, {"date": "2 Mar 2016", "title": "Philanthropy Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Feb 2016", "Interview Descriptions": "There was a written assessment lasting 25 mins. This was a letter to a donor thanking them for their donation and asking them to donate again in 2016. A two page Unicef document was given to extract information from. \r\n\r\nThis was followed by an interview with panel members. The interview was average-hard and the questions were competency based as well as a few role play questions of handling different work situations. There were about 10 questions in total and the interview lasted about 40 mins.", "Interview Questions": "1. Why do you want the job?\r\n2. How do you prioritize competing priorities?\r\n3. What is your experience of using spreadsheets?"}, {"date": "17 Jan 2016", "title": "Porgramme Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF", "Interview Descriptions": "the entire interview is based on Competency Based Interview questions. There were 5 questions covering a number of core and functional competencies, including Driving for Results, Team work, Embracing diversity, Innovation and Persuasion/Negotiation.", "Interview Questions": "Tell me about the time when you had difficulties in managing a team?"}, {"date": "25 Jun 2016", "title": "Education Specialist NOC Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Harare) in Jan 2016", "Interview Descriptions": "The technical  written test required me  to demonstrate my knowledge  on Education statistics and  analysis. From a given data I was expected to compute Net Enrollment Ratios,Gross enrollment ratios and Gender Parity Indexes  and then do a trend analysis. The other essay-type questions elicited my understanding and knowledge on quality education indicators", "Interview Questions": "This was a competency based question where I was required to demonstrate the competency on Formulating Strategies and Concepts. \r\n\r\nTell me about a time when you had to translate a work-related strategy into actions and plans. \r\n•\tWhat did you specifically do that was effective? \r\n•\tHow did you know that your plans were clear enough to be implemented? \r\n•\tWhat would you do differently in hindsight? \r\n2. Tell me about a time when you were involved in developing a strategy for your department or organization. \r\n•\tWhat was your role? \r\n•\tHow did you approach this situation? \r\n•\tWho else was involved? \r\n•\tWhat challenges did you experience? \r\n•\tHow did it turn out? \r\n3. Tell me about a situation when you had to ensure that a particular project within your department was aligned with organizational strategy. \r\n•\tWhy was this important? \r\n•\tHow did you approach the situation? \r\n•\tWhat was the outcome?"}, {"date": "3 Jan 2018", "title": "GSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNICEF (New Delhi) in Jan 2016", "Interview Descriptions": "It was a lengthy hiring process spanning 6 months, which began in September and Letter of Intent being sent in March. Which included 1 Written Test, 1 HR round, and Final Issuance and Acceptance of Job Offer", "Interview Questions": "A. HR - Introduction about myself  and What makes me fit for the role applied?\r\nB Manager - 2 Situation based Queries, 2 Analytical Questions, 1 Logical Reasoning \r\nC. HR - Asked me if I have any questions for them."}, {"date": "8 Apr 2017", "title": "Digital Marketing Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (London, England) in Jan 2016", "Interview Descriptions": "One hour-long interview,it was competences based with 3 people asking questions and writing down answers. Not too much interaction, it's definitely not a chat. I felt quite uncomfortable. I was not selected for the job and never had a feedback on my interview. Overall quite stressful.", "Interview Questions": "can you tell me a time when you missed a deadline"}, {"date": "22 Feb 2016", "title": "Creative Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNICEF (London, England) in Jan 2016", "Interview Descriptions": "Computer based test + panel interview. \r\n\r\nTask:\r\ncopy editing (edit 200 words from a 1500 words document)\r\nselect an interesting fact from the document\r\nselect an image\r\ncreate a facebook post\r\n\r\nInterview:\r\nThe panel was friendly and approachable\r\nInterview questions were primarily competency based: relevant experience, project management, priorities, collaboration, communication, dealing with conflicts, etc\r\n\r\nSuggestion:\r\nPreparation is key. Research about Unicef work, their audiences, tone of voice and brand.", "Interview Questions": "Main differences between printed information and digital communications"}, {"date": "11 Dec 2015", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Three people called in 30 mins. First one asked general questions about your background and interest. Second one told me there were 3 roles suitable for me and asked me if I was interested. The third one tole me I can fit in a lil and asked me if I was interested.", "Interview Questions": "Did you get interview anywhere before?"}, {"date": "7 Mar 2016", "title": "Education Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in Oct 2015", "Interview Descriptions": "Interview is typically conducted via Skype or phone.  In most cases it follows the Competency-based Interview structure.  Following the brief introduction on the post, interview panel members and procedure, interviewers take turn to ask 3-4 questions on particular competency areas that they consider relevant to the post.", "Interview Questions": "Question 1: Formulating Strategies and Concept\r\n• Explain the experience when you had to translate a work-related strategy into actions and\r\nplans\r\n• Describe the situation and your particular role in particular the followings:\r\no What were the unique elements in the situation and your task?\r\no What were the key challenges?\r\no How did you approach to increase effectiveness?\r\no What would you do differently in hindsight?\r\n\r\nQuestion 2: Analyzing \r\n• Describe a time when deciding on an appropriate course of action required careful and\r\nthrough review of complex and information from multiple sources\r\no Briefly describe the situation and your task\r\no Which sources did you exactly analyze?\r\no What strategies were generated as a result of the analysis\r\no What were the particular challenges?\r\n\r\nQuestion 3: Relating and networking\r\n• Describe a time when you initiated and developed an effective working relationship with key\r\nstakeholders\r\no Why was the networking important?\r\no How did you establish the working relationship?\r\no What were the particular challenges?\r\no What would you do differently in hindsight?"}], [{"date": "2 Aug 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (New York, NY) in Jun 2015", "Interview Descriptions": "I interviewed for the position and was offered a position. Let me tell you that their hiring process is obnoxiously long. There were many required documents which I submitted as soon as I was told about them weeks after I was offered the job. I couldn't not meet the insurance requirement but no one contacted me to tell me that this would mean the job offer is not valid. I was notified of this weeks after I submitted my final documents and had checked out and cleared all of my references (all of whom also had to fill out paperwork).", "Interview Questions": "What is the difference between SharePoint 2010 and 2013?"}, {"date": "10 Mar 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at UNICEF", "Interview Descriptions": "It was very straightforward. I was interviewed by two people who asked normal interview questions, such as how do you work when under a deadline, and how do you work with people of different races and cultures?", "Interview Questions": "How do you work under pressure?"}, {"date": "29 Apr 2016", "title": "AYEP Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNICEF (Tirana, Tirane) in May 2015", "Interview Descriptions": "You have to apply through UNICEFs portal and submit your P11. After 5 months of wait you get a test which is a very difficult exam and then 2 months later you get a competency based interview. Time is one of their weakest pointd as it takes way too long for the recruitment process fron start to finish. The panel was made up of 4 people, including an officer from the regional office who was present through skype.", "Interview Questions": "The 7 Cs of resilience"}, {"date": "10 Mar 2015", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF", "Interview Descriptions": "Most posts go through a multi-level screening process - first general shortlisting at the Headquarters level, then a second level of short listing at the country office level.  This is usually followed by a written test to verify technical skills, and finally for those who pass through all of these levels of vetting, a competency based interview.", "Interview Questions": "Tell me about a time when you had to translate a work-related strategy into actions and plans. \r\nWhat did you specifically do that was effective?"}, {"date": "16 Apr 2015", "title": "UNV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Hard, all sorts of questions. I showed passion and commitment and it was highly valued. The type of interview in any UNICEF selection process is competency based interviews. There is  panel of evaluators, and each member of the panel asks questions. The interview could be in different languages, according to what is mentioned in your CV.", "Interview Questions": "How do you deal with conflcts."}, {"date": "11 May 2015", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF in Apr 2015", "Interview Descriptions": "I applied online. They arranged a test with others candidates. The test specialized on technical contents. Quite interesting questions, with case studies. Not too challenging but required deep understanding on topics.\r\nI'm waiting for the next round. They told us that they will inform us soon, in 1 or 2 weeks.", "Interview Questions": "How to solve the problem stated."}, {"date": "12 Dec 2017", "title": "Programmer Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in Apr 2015", "Interview Descriptions": "Competency based interviewing - easy if you know how.  Google \"UN Competency Based Interviewing\" for help.  Easy when you know how.  All the questions start with \"Tell me about a time when you...\"....and will be related to the \"Core competencies\" listed in the job description.", "Interview Questions": "Tell me about a time when you had to deal with a difficult ethical situation\r\nTell me about a time when you had to communicate a difficult concept to someone who didn't have that knowledge.."}, {"date": "18 Mar 2015", "title": "Planning Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNICEF", "Interview Descriptions": "When submitting the application there were around 10 eliminatory screening questions on UNICEF in general. The second round was then conducted through a software called \"Interview Master\" where your language skills (the UN languages you indicated), technical knowledge (through a very difficult multiple choice test) and writing/stress skills relevant for the post (a written test with 10 pages of reading and strategic summarizing) were tested. The third and final round was an interview via skype/phone with a panel of 3-4 people.", "Interview Questions": "UN competency questions relating to project management experience, working in multicultural teams and reactions in difficult situations at work. "}, {"date": "2 May 2018", "title": "Research Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF in Apr 2015", "Interview Descriptions": "I completed the extensive online application, then was contacted via email to take a written test online at a certain date/time. At the time, they sent me a test with reference files, one of which was corrupted. I replied to alert the staffer, but they did not reply. \r\n\r\nI completed the 2+ hour written exam, sent it in, but HR neglected to send even a form letter rejection.  After a significant time investment, UNICEF lacked the common courtesy to ever send a reply.", "Interview Questions": "They sent me a batch of documents detailing a potential partner (via email, one of the files was corrupted and inaccessible) and asked that I draft a report recommending or declining a potential partnership."}, {"date": "19 Mar 2015", "title": "Public Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNICEF (London, England) in Mar 2015", "Interview Descriptions": "Had to do a 15 minute test first: this involved drafting a short letter of thanks to a UNICEF supporter, and then prioritising 6 tasks with justification for their order.\r\nThen the interview, which was a panel interview with 2 leaders of the Public Fundraising team for approximately 40 minutes. Generally competency based.\r\nQs:\r\n1. Describe a time when you had to explain a complex concept to different audiences\r\n2. Describe a time when you have had to juggle several commitments at once and how you managed your time\r\n3. Describe a time when you had to organise an event and how you went about prioritising your time.", "Interview Questions": "Tell us about your experience and why you want to apply for the Community Fundraising role"}], [{"date": "23 Jan 2015", "title": "Operations Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNICEF", "Interview Descriptions": "Based on competency framework .reccomend to review the framework and get prepared.all behaviouru indicators are available in tbat document which makes it easy to prepare response.all should be based in real life examples", "Interview Questions": "Tell me about time when you had conflict with your supervisor"}, {"date": "26 Nov 2016", "title": "Individual Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at UNICEF (New York, NY) in Dec 2014", "Interview Descriptions": "The interview process is a bit of a front. They're required to make it look like they're publicly advertising for a post and reviewing multiple candidates, even if they already have one person in mind. I was referred into the consultancy, but still had to go through the interview process, which was sending in standard materials to the potential employer, and then having a panel interview over Skype. Fairly easy interview because, again, it was a formality. Be cautious when applying to UNICEF posts, because they may or may not be actively looking for new applicants.", "Interview Questions": "If your previous employer had to describe you in three words, what would they be?"}, {"date": "18 Jul 2017", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNICEF (Almaty) in Nov 2014", "Interview Descriptions": "Competency based interview meaning that interview panel will examine the competencies of  incumbent by asking questions related to the competencies he/she should possess.\r\nThey invite you for written test if the amount of shortlisted candidates higher than 10 persons.", "Interview Questions": "why you think you are suitable for this position? or Why you have applied for this position? (this is introduction question, just to warm up the candidate)"}, {"date": "11 Apr 2016", "title": "Programmer Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at UNICEF (New York, NY) in Dec 2014", "Interview Descriptions": "The interview was simple. They got back to me with in one week . I was recruited through a recruiting agency so all the pre-screening was done by them. I had to provide all my paperwork such my diploma, ID, passport and the recruiting agency had set the interview dates.", "Interview Questions": "Questions related to my previous work experience, future plans..."}, {"date": "2 Nov 2014", "title": "ICT Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Submitted resume, and was invited to the interview. Interview took about an hour. There were four people on the interview. HR, Deputy Chief, and two technical directors from remote office on the Skype. After general questions, and introductions those technical directors asked technical questions.", "Interview Questions": "I didn't know that there will be people on the skype, and the quality of the connection wasn't good. So there questions that I didn't understand properly, and had to ask again and again. "}, {"date": "19 Mar 2014", "title": "Any Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UNICEF (New York, NY)", "Interview Descriptions": "Unicef is part of the UN system.  The hiring process at Unicef is quite thorough and time consuming.   From when you apply to actually being interviewed may take several months.  Expect multiple interviews in the process; team members, the hiring manager as well as HR.  You may be asked to submit samples of work or take a written test to measure your skillset; this often occurs in the areas of information management.   It is a very rigorous process designed to find the best fit and to ensure all candidates are treated fairly.    All interviews are competency based; be prepared to support verbally concrete measurable examples of key competencies such as strategic thinking, examples of teamwork, organizational skills, problem solving and more.", "Interview Questions": "Give an example of a failure in a process that you were responsible for."}, {"date": "1 Feb 2014", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Applied for a job that was advertised online, was contacted for an interview by e-mail two months after I submitted the application, had a competency-based phone interview with a 3 member panel", "Interview Questions": "The broad subject of the questions (how one would react to different scenarios of collaboration and conflict) was not difficult. However, the specificity of some of the scenarios that the panel members described was a little challenging"}, {"date": "15 Oct 2014", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UNICEF (New York, NY) in Apr 2014", "Interview Descriptions": "I had one interview over the phone. It was very friendly and focused mostly on general questions about my past, relevant experiences, plus some technical questions on public finance.", "Interview Questions": "They asked something technical almost only because I mentioned it in my conversation so be prepared to give further insights of what you mentioned in your resume, cover letter or your speaking points."}, {"date": "10 Jan 2017", "title": "Programmer Analyst Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNICEF (New York, NY) in Apr 2014", "Interview Descriptions": "I applied online. The process took 6+ months. I interviewed at United Nations (New York, NY)\r\napplied online then received an email to schedule a Phone interview. The phone interview was about 20 min. I was asked about my cv, and past experiences and what I would be able to add to the department I applied for.", "Interview Questions": "What are 3 things your former employees would say about you?"}, {"date": "23 Dec 2016", "title": "Agenda 2030for Sustainable Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in Apr 2014", "Interview Descriptions": "Applied online via the UNICEF website. Got an email inquiring about interview timings about 2 months after. Had a phone interview, the consultant was very nice and welcoming. Asked me general knowledge questions about the Agenda 2030, my understanding of the UN charter, UNICEF principles and so on.", "Interview Questions": "Most UN interns are masters students, why should we take you even though you haven't even finished your undergrad? "}], [{"date": "31 Dec 2014", "title": "Social Policy Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF in Mar 2014", "Interview Descriptions": "Hiring process took more than 7 months.  Applied in January,  then went through written tests and various interviews over the phone around March and April,  then got job offer around June.", "Interview Questions": "Competency type of questions asking how one would behave in a given situation or how one dealt with a given situation and what were the results"}, {"date": "9 Jan 2014", "title": "Wash Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNICEF", "Interview Descriptions": "Applied online--> go for written test 3 after --> Interview with a panel of 3 people (1 human resource and 2 operation field officer)", "Interview Questions": "Why do you think you are qualified for the post?"}, {"date": "7 Sept 2018", "title": "Supporter Relation Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNICEF (Toronto, ON) in Jan 2014", "Interview Descriptions": "Generally friendly and pleasant. Questions are reasonable at the time. Feeling ease and relaxed. Friendly environment and nice office. Interviewed at the time that there were new campaigns were going on. Enjoyed the people there.", "Interview Questions": "Why do you want to work for Unicef?"}, {"date": "21 Nov 2013", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF", "Interview Descriptions": "Phone interview only, to be fair to candidates who are applying from abroad. However, frequently positions advertised already have an internal candidate intended for it.", "Interview Questions": "Very straightforward interview questions. Answering questions about past experience based on SWOT analysis will serve any interviewee well."}, {"date": "22 Nov 2013", "title": "Human Resources Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "One phone interview. One panel interview.", "Interview Questions": "Strategic approach to learning and development"}, {"date": "24 Jan 2017", "title": "Individual Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (Dhaka) in Oct 2013", "Interview Descriptions": "interview was done in presence of human resources staff and WASH manager and based on my CV they asked me some questions relevant to my past experience and skill on WASH field. I tried my best to answer all the questions.", "Interview Questions": "please introduce yourself"}, {"date": "27 Aug 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNICEF", "Interview Descriptions": "Had an internal contact and was hired after a resume review", "Interview Questions": "Specific questions on location were asked "}, {"date": "20 May 2016", "title": "Senior Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UNICEF (New York, NY) in Jun 2013", "Interview Descriptions": "Two interviews via phone before I was hired. It was really really simple. Even though we were in the same city they interviewed me via phone. The first day that I saw them was my first day of work. Strange.", "Interview Questions": "Tell me about your resume"}, {"date": "13 Feb 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at UNICEF (Belgrade, Central Serbia) in May 2013", "Interview Descriptions": "Only one interview. It was nice and everyone was friendly. They mostly were interested in knowing about my background and why I was interested in studying what I was studying.", "Interview Questions": "How do you see your career trajectory?"}, {"date": "8 May 2015", "title": "Wedsite Producer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (New York, NY) in May 2013", "Interview Descriptions": "A group of three interviewed for around 20 mins.  Interviewers were dress casually and even chit-chatted during our interview. The lead interviewer first asked my status and explained UNICEF policies for non-US citizens contractor before the actual interview started.  There were no hard questions.  All were job-related, your past experience, your experience on xxx filed,  your suggestions or recommendations for the website.", "Interview Questions": "Tell me about yourself; your past experience, your experience on xxx filed,  your suggestions or recommendations for the website. "}], [{"date": "8 Feb 2015", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNICEF in Dec 2012", "Interview Descriptions": "Online application in the recruitment system + a cover letter. From the closing date within 6 weeks the shortlisted candidates (5) were sent a written test which was very technical and had to be responded to within 2 hours. It was marked anonymously. The top 3 candidates were then called for a phone interview by a panel of 4 people. It took over 2 months from the interview to get the results.", "Interview Questions": "UNICEF uses competency-based interviews - the panel had chosen some relevant competencies and the response had to demonstrate the specific competency from past experience."}, {"date": "19 Oct 2012", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNICEF (New Delhi)", "Interview Descriptions": "There were three rounds and it was a very difficult interview. They asked questions from academics and proffesional course done. It was not a stress type of interview and they made me quite comfortable and allowed me to relax. They kind of do some phychoanalysis also i guess.", "Interview Questions": "high salary or work satisfaction. Your priority"}, {"date": "27 Jul 2013", "title": "Programmer Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at UNICEF (Bucharest, Bucuresti) in Oct 2012", "Interview Descriptions": "The bureaucratic steps are strictly followed and everything seem perfectly organized. There is a competency based interview but the members of the interview panel do not necessarily have competences to carry out such interview.", "Interview Questions": "Competency based interview implies normally to provide several/different examples. It may occur that the questions from the panel insist that you answer based on a single example. You may end in not knowing what to add to answer properly. "}, {"date": "25 Jul 2016", "title": "Market Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNICEF (Dubai) in Jun 2012", "Interview Descriptions": "the process started with a knowledge test. it was a multiple choice questions using a computer and powerpoint test to create a presentation and followed by a competency based interview with future line manager, HR personnel and an independent unicef employee.", "Interview Questions": "what do you know about UNICEF"}, {"date": "3 Aug 2012", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UNICEF in Jun 2012", "Interview Descriptions": "Not transparent process. They offered me the short term consultancy assignment after shortlisting my CV followed by an interview. I sent my agreement to the conditions mentioned in the mail and sent all required detail. After a couple of days they informed that the position is cancelled.", "Interview Questions": "N/A"}, {"date": "21 May 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNICEF (New York, NY) in May 2012", "Interview Descriptions": "Submit application including cover letter through the job portal. One phone interview that lasts about 30 minutes, with mainly generic and behavioural questions, though more technical questions may be asked depending on the role. An employee recommendation is very useful!", "Interview Questions": "How do you work under tight deadlines?"}, {"date": "29 Jan 2013", "title": "Wash Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNICEF in Mar 2012", "Interview Descriptions": "You need to apply online. Contacted for a written test 5 months after. and a panel interview with 3 people (human resource and 2 operation staff in the field) over the phone few weeks after the test.", "Interview Questions": "Competency Based Interview ONLY"}, {"date": "6 Oct 2016", "title": "Online Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at UNICEF (Voorburg) in May 2012", "Interview Descriptions": "Een fysiek sollicitatiegesprek gehad met mijn stage begeleidster. Informeel maar tegelijkertijd professioneel. De vragen gingen voornamelijk over mijn achtergrond, mijn motivatie en wat ik verwachte van de functie en wat zij verwachten. Op basis daarvan aangenomen. Werd op mijn gemak gesteld. Positieve ervaring.", "Interview Questions": "Waarom UNICEF? Waarom deze functie?"}, {"date": "14 Jun 2012", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UNICEF (Bengaluru) in Apr 2012", "Interview Descriptions": "I was called to attend a workshop where i had to help them out and then they asked me whether i would like this type of job. and i said yes. so they called me to join my work on 01st of May 2012 at M. S. Building, Bangalore. They said they would look after my stay and would case for the pick up from the stop i get down. For the salary first they said they would give 8000 and then they said they would give Rs. 10,000 per month including CTC.", "Interview Questions": "Would you like to work in Bangalore?"}, {"date": "2 Sept 2012", "title": "Data Base Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at UNICEF (Zagreb) in Feb 2012", "Interview Descriptions": "I had two interviews. At first I was greeted by three employees (I later learned that one of them will be my supervisor, the other two are also in high positions in the office). I should say something about myself, I said  which schools have I finished. They asked me how I handle knowledge in Excell. They asked me some specific questions from Excel and they asked me if I would be able (for a long time) to do this job, because it's quite exhausting and uniform. At the second interview, I had a conversation with someone who is right next to the boss's office. She told me what is my intended salary, warned me that my contributions will not be paid, as well as transportation. They were all very polite, and I can not at any time feel uncomfortable.", "Interview Questions": "N/A"}], [{"date": "20 Feb 2012", "title": "Programmer Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UNICEF in Dec 2011", "Interview Descriptions": "Interview was for one hour exact. It consisted on general set of questions that are included in the employment package of the organisation and everybody (who is already within the system) can access it and prepare in advance. The panel followed these questions very strictly. they may ask some questions of clarification.", "Interview Questions": "N/A"}, {"date": "5 Oct 2012", "title": "Senior Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at UNICEF (New Delhi) in Jul 2011", "Interview Descriptions": "The hiring and interview process was very smooth I enjoyed the written test and discussions with the panel it was very nice discussing my profile with them", "Interview Questions": "N/A"}, {"date": "10 Jul 2015", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at UNICEF (Lilongwe) in Feb 2011", "Interview Descriptions": "the post was advertised in the local paper for three weeks, shortlisting was done and I attended two interviews.  The panel had five people all had different portifolio, among them was the head of the department", "Interview Questions": "written and oral"}, {"date": "10 Jul 2013", "title": "Operations Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNICEF (New Delhi) in Oct 2010", "Interview Descriptions": "Since the post was advertised internally, we were well notified in advanced through internal memos and to other UN agencies also as per the Un norms.\r\nThe interview panel was very well constituted , representing HR, Staff Union, subject expert, the reporting officer to who the candidate will be reporting on selection for the post.\r\nEnough time is given to the candidate, and the team ensures that the candidate is relaxed and comfortable right from the time of entry into the interview hall.", "Interview Questions": "Questions are very relevant to the post . So if a candidate has really applied himself to any situation , should be able to answer the questions. \r\nSome technical questions , when unable to answer, one should be honest to declare his/her inability to answer.\r\nGenerally there are are technical questions on the subject and also one or two competency based questions. \r\nThe competencies are already given in the job advertisement and one need to appraise himself/herself of the competencies in advance."}, {"date": "2 Jul 2012", "title": "State Consultant Nutrition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNICEF (Jaipur, Rajasthan) in Apr 2010", "Interview Descriptions": "Be fully prepared for the interview", "Interview Questions": "How will you improve the status of Malnutrition in State?"}, {"date": "5 Nov 2011", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at UNICEF (Toronto, ON) in Nov 2009", "Interview Descriptions": "First stage of the interview was a phone call. Pretty much typical questions. Second step was 1:1 Interview, again pretty standard stuff ( teamwork, how you handle stress and pressure although the environment is far from stressfull, position related questions etc.). One of the managers interviewing me was rather uncomfortable, Im guessing candidate screening wasnt her strong suit.", "Interview Questions": "According to me, questions were really easy. "}, {"date": "27 Oct 2009", "title": "Operations Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNICEF (New Delhi) in Apr 2009", "Interview Descriptions": "The interview was nice and cordial. They tested me online first and then the results came and i was selected for the secodn round of interview whereby i was asked for a telecon interview. I passed that test too. Then i was called for a personal interview which i passed too. and then they said we will have a final round of interview which had 10 people in the panel.", "Interview Questions": "Difficluties in past job"}, {"date": "27 Jul 2010", "title": "IT Specialisat Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNICEF (New York, NY) in May 2008", "Interview Descriptions": "Getting a permanent job with any UN agency is very time consuming since they receive so many applications and the process has to be very well documented and transparent from the organisation's perspective.  Typically, there is a phone interview for shortlisted candidates.  This typically takes 1 hour. Then if selected a face to face interview with a panel and / or individuals is requested.  During this phase some written tests may be given.", "Interview Questions": "N/A"}]]