[[{"date": "5 Jun 2023", "title": "HR Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Ghosted me after telling me I made it to the next round of interviews. Came back and asked me to interview again and then ghosted me a second time and I never heard back. Don't get too excited in the interview process", "Interview Questions": "Tell us about yourself and work history"}, {"date": "18 May 2023", "title": "Logistics Assistance Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Mercy Corps (Gambēla, Gambela Hizboch) in May 2023", "Interview Descriptions": "Implementing Planning Controlling Staffing Evaluation Team working Decision making Solution to solving Documentation Purchase Procuring Ware house management Inventory management Asset management Fleet management Fuel management Repackaging Receiving Distribution Transportation Storing Reversing Reporting", "Interview Questions": "Self introduced Educational background Work experience Role and responsibility for position How to manage a position List for vehicles cost Explain about safe gurds When doing Salary expectations Well come have a question End"}, {"date": "24 Apr 2023", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "Very efficient and quick. Only one virtual interview (45min) with two people I would work with and heard back by the end of the week. Friendly and personable.; it wasn't a particularly difficult interview and the interviewers made it feel more like a conversation.", "Interview Questions": "What is your communication & work style?"}, {"date": "29 Mar 2023", "title": "Special Education Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Asnières-sur-Seine) in Mar 2023", "Interview Descriptions": "L'entretien d'embause consiste en la présence matérielle d'un recruter et d'un recruté dans une enterprise (une école , une compagnie , un établissement ..... ) . Les questions seront posées dans le but de s'assurer Des expérinces et Des compétences du candidat. SI le post est adéquat aux diplômes , aux expériences et aux savoirs être ou faire DU candidat , ce dernier va logiquement passer à un titulaire de stagiaire notamment Les premiers mois du boulot .", "Interview Questions": "Comment Vous avez trouvez l'entretien?"}, {"date": "12 Jun 2023", "title": "CARM Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Kiev, Kyiv) in Mar 2023", "Interview Descriptions": "I had a negative experience with Mercy Corps. I submitted my resume online, and 2 weeks later HR contacted me and invited me for an interview. The interview itself went well, there were 4 employees of the organization, and everyone was friendly. It lasted 30 minutes, and all this time I was asked questions about my past work experience. A week after the interview, HR informed me that I had moved on and sent the feedback form to my references. A week later a got a call from HR, and she said that I had successfully passed all the stages, clarified when I could start work, and said that the official offer would be sent at the end of next week. After 2 weeks, I contacted her, because I did not get the job offer. She calmed down and said that everything was ok, he was in the process of registration and I should wait a little bit more. So a month passed without messages from Mercy Corp, a month later I asked for an answer on whether I should wait for an offer, but my message was ignored by HR So I got very frustrating and time-wasting experience with Marcy Corps", "Interview Questions": "Tell me about situations you were overwhelmed with your duties"}, {"date": "24 Feb 2023", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps", "Interview Descriptions": "Two interviews with hiring manager and one more team member. A case study as well. The process was drawn out a little bit but nothing major. Once the process was confirmed, onboarding was very smooth", "Interview Questions": "Experience in the sector Concrete examples of applying skills to organizational change."}, {"date": "13 Feb 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Portland, OR)", "Interview Descriptions": "Very straightforward interview - no surprises. I was interviewed by a senior program officer and a member of HR. They were very polite and answered any questions I had about the company and role.", "Interview Questions": "They ask you to talk about your background and interest in the role. They also offered a couple scenarios and asked how you would handle them."}, {"date": "6 Feb 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "3 rounds of interviews with varying levels of supervisors and peers. The interviewer(s) were all very friendly and considerate -- it seemed like a great team to work with. They were communicative and open about the process.", "Interview Questions": "How does your past experience relate to this role?"}, {"date": "11 Feb 2023", "title": "Director, Direct Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Mercy Corps in Jan 2023", "Interview Descriptions": "Applied online and was contacted about 6 weeks later via email to schedule a screening. Participated in HR video screening, followed by Hiring Manager video interview the following week. After a few weeks, I was contacted by HR asking for availability to schedule the next interviews, I responded. Two days later, I was told it would probably be the following week, so I responded with my extended availability. More than a week later, I received an email from HR asking my availability for a quick phone call - which turned into a notice that the hiring manager had decided to move forward with another candidate - therefore, I would not be scheduled for any further interviews. I am disgusted by the number of nonprofit organizations that continue to prosper and waste donor funds through their dysfunctional hiring practices. It is NOT ok.", "Interview Questions": "What is your experience managing vendors?"}, {"date": "13 Dec 2022", "title": "Director, Brand Marketing and Content Strategy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Corps (Portland, OR)", "Interview Descriptions": "Unfortunately, the salary was not competitive enough for me to continue on in the interview process. The recruiter I spoke with had great things to say about the organization's impact and me as a candidate, but it also seemed like the pacing of the org and/or this department is very intense. For as great as Mercy Corps work may be, I am wary of mission-based organizations that expect people to give +110% while also paying below market rate. I do appreciate that the recruiter was transparent about salary early on in the process.", "Interview Questions": "I was asked to share about my previous experience and salary expectations."}], [{"date": "15 Jan 2023", "title": "Assistant Programme Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy Corps in Dec 2022", "Interview Descriptions": "Been contacted after a couple of months from applying. The first round of interviews was with the recruiter, over general routine questions. The second round consisted of a panel interview with potential colleagues and supervisor, to be followed by a written exercise (90 min to complete and send back, I picked the same day but availability was asked on when to do it). The latter was mostly to get to know me as a candidate and from a personal point of view. Very positive experience, both rounds were formal and very informal at the same time. Been interviewed by very friendly people. Absolutely positive experience!", "Interview Questions": "1st: why wanting to work at Mercy Corps, what is your previous experience, how would you manage your workload etc 2nd: behaviour based, a few scenarios were asked etc and of course, why would you be a good candidate for the position. The written exercise consisted of being able to manage a good load of information and report on it, tidy up documents and proofread."}, {"date": "21 Dec 2022", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Mercy Corps (Paris) in Sept 2022", "Interview Descriptions": "C’était cool, j’étais très détendu dans un espace de travail avec des gens très professionnels et qui maîtrisaient ce qu’ils faisaient. Je pense que mercy corps est une ong de professionnel.", "Interview Questions": "On m’a demandé de parler de ma personne."}, {"date": "24 Aug 2022", "title": "Operations Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps", "Interview Descriptions": "Wide range questions including logistics, procurement, and supply chain management.  Other questions were about office and administration management and a bit of Human resources management. The discussions in security management were conducted more in terms of understanding the context of the foreseen country of deployment.", "Interview Questions": "\nlogistics, procurement, and supply chain management.  office and administration management\nhuman resources management. \nsecurity & safety "}, {"date": "21 Aug 2022", "title": "Head of Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "I interviewed for a Head of Media role. The interview itself was as expected with the usual questions. I was told they wanted to appoint quickly and that the final round would be next week. A month on I still haven’t heard from them despite chasing - they ghosted me. They should have sent a rejection email or an update to say there had been a hold up.", "Interview Questions": "Developing media strategies, handling media crises"}, {"date": "21 Apr 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Abuja, Federal Capital Territory)", "Interview Descriptions": "A smart process, they only take the best. After applying, sometimes in their Job site, you could be selected for the interview. Which could also be a test. I know that to ace the interview a person needs to read well and be knowledgeable.", "Interview Questions": "You'll definitely do an interview test"}, {"date": "29 Mar 2022", "title": "Global Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "I applied for the position in the fall and got an interview after a few weeks. I did the first phone screening and was told I would hear back from them in a week. I was ghosted for 3 months. Then they came back and asked me for a second interview. I did the second interview and was told once again that I would hear back from them in a week. I was ghosted AGAIN by them.  They reposted the job online and applied for a second time, but was then told that the job had been removed and was no longer available. When I look at their job postings today, the position is still available for new candidates to apply. If they wanted to reject me, I wish they had done so initially instead of dragging me along.", "Interview Questions": "Where do you think HR trends will be going?"}, {"date": "22 Oct 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps (Kabul) in Apr 2022", "Interview Descriptions": "I passed an interview about 4 months ago it was marketing position and was the first interview for me and I answered the questions. That interview learned me something new. I", "Interview Questions": "They asked a question: When a client comes to your office and asks about the package and bundle of the network how do you detailed him or her."}, {"date": "26 Jul 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps in Apr 2022", "Interview Descriptions": "Communication preceding the interview was very positive. The interview itself was not very challenging, although the entire application process and timing was quite strung out. The most memorable takeaways were:\n\n 1) The panel was clearly disengaged while I was answering their questions (e.g looking at different monitors while I was actively speaking). This became a bit uncomfortable as it lasted the entire time. \n\n2) Complete silence afterwards. I had been in contact with this team for months preceding the Interview and would have appreciated at least a rejection email. At the time, I had received other offers and was awaiting word back as Mercy Corps was my ideal pick. Would have appreciated the respect of knowing.", "Interview Questions": "Tell us about the current projects you are working on? "}, {"date": "14 Feb 2022", "title": "M&E Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Transparent. It had balance according to gender.we were grouped into sessions. The sessions include practical and oral interviews. They were conducted in full view of all stakeholders. The ultimate winners were one male and female", "Interview Questions": "What are  your strengths and weakness"}, {"date": "10 Mar 2022", "title": "Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps (Nairobi) in Jan 2022", "Interview Descriptions": "Application was done online. I was contacted afterwards for an in person interview. The panel was very friendly. Questions weren't tooo difficult. However, they went COMPLETELY silent after the process. Even after sending an email to ask about the progress and calling I received no feedback which I found very unprofessional", "Interview Questions": "Why do you want to work for Mercy Corps"}], [{"date": "3 Jan 2022", "title": "Policy Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Straightforward interview process, starting with HR screening, then behavioral and substantive interviews.  The entire process took about one month and the team with highly communicative throughout.   A positive experience overall.", "Interview Questions": "How do you work with people who have different approaches to the same issue?  "}, {"date": "26 Mar 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy Corps (Nairobi) in Jan 2022", "Interview Descriptions": "Applied online. They contacted me after 2 months for an in person interview. The panel was quite friendly and questions were simple. But the went COMPLETELY silent after the process even after sending an email to ask for the progress. They should respect jobseekers time. According to LinkedIn though they ended up hiring internally so maybe that was the reason for the silence.", "Interview Questions": "Why do you want to work for Mercy Corps and how are you qualified for the position "}, {"date": "3 Nov 2021", "title": "Digital Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Had an interview with the HR person first then interviewed with the Director, then with a panel interview. It was fairly smooth. Wish they would have gotten back to me sooner, but regardless they team was cordial", "Interview Questions": "What was your experience in qualitative and quantitative digital marketing?"}, {"date": "26 Oct 2021", "title": "Ethics and Compliance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "there were a lot of questions back on forth regarding the details of the job, its how i learnt i have a great chance of being accepted. the interview questions were precise and to the point, away from the cliché interview questions.", "Interview Questions": "Manager: What would you should we have a difference of opinion about a problem?"}, {"date": "31 Aug 2021", "title": "Online Engagement Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Corps", "Interview Descriptions": "One interview was conducted with a manager and one additional team member, No reading material was required prior to the interview. The process took one week to deliver a decision; the interview was remote", "Interview Questions": "Technical experience, content creation experience "}, {"date": "25 Aug 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Went through three rounds of interviews, the third interview was the hardest and most intimidating as you are interviewed in front of a panel but MC sent the questions the night before to help prep.", "Interview Questions": "Programmatic Questions about DEI and Values"}, {"date": "19 Aug 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mercy Corps", "Interview Descriptions": "The interview process was run very efficiently and communication was clear and timely. The talent specialist and hiring manager were both friendly and professional. There was a timed written exercise in addition to interviews with the hiring manager, a panel of country directors, and the regional director.", "Interview Questions": "Describe your process for time management and handling multiple projects simultaneously. "}, {"date": "15 Jul 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mercy Corps", "Interview Descriptions": "Mercy Corp has a standard interview process, where you interview with multiple members of the hiring team, and then the second round of interviews was to judge your technical expertise.", "Interview Questions": "What are your greatest strengths?"}, {"date": "9 Jun 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Was contacted for an initial screen several months after applying, which I thought was a little odd but delays do happen. Met with a recruiter for an initial screen and then never heard from them again.", "Interview Questions": "All of the usual screening questions. "}, {"date": "8 Jun 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "There was an initial zoom interview that lasted around thirty minutes, which was fairly standard questions. For a second interview, I spoke to a colleague of the initial interviewer, most of which was spent talking on the same questions and subjects as the first.", "Interview Questions": "What is an example of a challenge you faced and how you dealt with it?"}], [{"date": "22 Apr 2021", "title": "Learning &amp; Leadership Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "Both interviewers were warm and welcoming, asked some general questions and gave ample time for me to ask questions as well. I didn't get an offer, so I asked for some general, candid feedback and they never responded.", "Interview Questions": "Tell us about a time you helped to reinvent or optimize an existing system or platform to make it better?"}, {"date": "6 Apr 2021", "title": "Quantitative Research Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "Interview process consisted of both a behavioral interview as well as a presentation for a potential research project to the whole team. Interviewers were very kind and respectful. They also provided a clear timeline for the hiring process and stuck to it.", "Interview Questions": "Describe your experience collecting and utilizing quantitative data sets. What kind of research questions are you interested in? How do you see this position fitting into your career trajectory? Why do you want to work at Mercy Corps?"}, {"date": "2 Apr 2021", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "Slow but thoughtful process.  First screening conversation with recruiter and then 3 person panel interview.  Good questions, interview panel represented different geographic and functional areas. Good balance between seasoned and newer perspectives.", "Interview Questions": "What did you learn about MC through your research "}, {"date": "27 Apr 2021", "title": "Assistant contrôle interne Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps in Apr 2021", "Interview Descriptions": "J'ai postulé en ligne dans le mois de Mars 2021, par la suite j'ai recu un appel telephonique en Avril pour venir passer le test écrit. Je me suis prépare pour le test avant d'y aller", "Interview Questions": "Siter cinq secteurs d'intervention de Mercy Corps"}, {"date": "11 Nov 2021", "title": "Media Relations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Chicago, IL) in Apr 2021", "Interview Descriptions": "The interview process went by smoothly. I was interviewed about things we had previously discussed and shared my opinion about numerous topics and ideas I would have as an intern.", "Interview Questions": "How do you consume news?"}, {"date": "14 Mar 2021", "title": "Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps", "Interview Descriptions": "I applied online and was shortly contacted for an interview. They were very friendly and professional in the interview the people interviewing me had good knowledge and made it an enjoyable interview.", "Interview Questions": "Why did you choose Mercy Corps"}, {"date": "21 May 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps in Mar 2021", "Interview Descriptions": "There were two people interviewing and they asked me a few questions for about thirty minutes and then asked me if I had any questions or concerns. They held a feedback call with me when I didn't get it and were very helpful.", "Interview Questions": "What are effective ways of building community resilience?"}, {"date": "22 Feb 2021", "title": "Technical Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Mercy Corps (New York, NY)", "Interview Descriptions": "I went through two rounds of interviews. The first was a 45-minute screening interview with HR, followed by a panel interview. The organization was supposed to be hiring quickly for this position, but took forever to get back to me on the next stage and did not respond to a request for an update. Months later I learned they had canceled the position, so the whole thing had been a complete waste of time.", "Interview Questions": "Standard questions about work experience"}, {"date": "12 Feb 2021", "title": "Ethics and Compliance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (New York, NY)", "Interview Descriptions": "The interview process was very fast once they contacted me.  After they emailed me requesting an interview, I had a video call with three team members 3/4 days later.  They were very friendly and welcoming, talked to me about the position, and asked questions about my work habits and background.", "Interview Questions": "\"Tell me about why you want to work with Mercy Corps\"\r\n\"How would this position help you in the future?\" \r\n"}, {"date": "31 Jan 2021", "title": "Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "I had two individual phone calls with the hiring managers, and then one large zoom video interview with the larger team. After that are references and the job offer. Overall everyone was nice and communicative.", "Interview Questions": "How do you work with dispersed team?"}], [{"date": "1 Feb 2021", "title": "Grants and Reporting Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Corps (Tunis) in Jan 2021", "Interview Descriptions": "1. Online application with CL + CV \r\n2. 40-minute phone interview with MC recruiter at the regional HQ, followed immediately by 1h30 written test (in my case aimed at testing language skills)\r\n3. 30-minute Skype/Zoom interview (with CD and PM - entirely in French as the position required fluency in French and English)", "Interview Questions": "Regular questions: experience/skills acquired in your current position relevant for this position; Why do you want to leave your current position; Where do you see yourself in 5y etc.\r\nSituational questions: ie You're completing a program report and the local teams are not sending you the data, time passes, the deadline is in a week, and you still have no data - what do you do?\r\nMore unusual questions: If I tell you safeguarding, what do you think?; \"What are you like when you're angry?\""}, {"date": "19 Feb 2022", "title": "HR-officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mercy Corps in Dec 2020", "Interview Descriptions": "Very efficient and we'll thought out. The process moves very quickly and provided with feedback. I enjoyed the process, the panellist were on time despite being on different time zones.", "Interview Questions": "Why are you interested in this job and what key skills do you bring in this role?"}, {"date": "19 Oct 2020", "title": "Senior Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "The interview was a panel setting and there were 4 people involved. The questions were insightful and the panel was willing to listen to suggestions.  I received good information before the interview and appreciated the reminder sent by telephone and sms.", "Interview Questions": "Where do I see myself making a contribution in 5 years time"}, {"date": "6 Nov 2020", "title": "Peace and Conflict Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Mercy Corps in Sept 2020", "Interview Descriptions": "Video interview via google meets. The interviewer was friendly, engaged in discussion and facilitated the process very well. There was no need to be nervous, and the questions were not difficult.", "Interview Questions": "Why do you want this position?"}, {"date": "21 Nov 2020", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Port Orange, FL) in Jun 2020", "Interview Descriptions": "Interviewed with three people the interview was easy at first and later but the response was poor as it looks like they have their eyes set on a candidate already and I was like a formality.", "Interview Questions": "Why will you manage remote working"}, {"date": "1 Apr 2020", "title": "Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy Corps", "Interview Descriptions": "Phone call interview. Lasted about 45min because it went well. Interviewer was friendly and chatty. Applied online then got an email about 2.5 weeks later about setting up a time to chat.", "Interview Questions": "How do you stay organized when managing multiple projects of varying importance?"}, {"date": "7 Mar 2020", "title": "Water and Sanitation Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "I had a technical test (reporting skills, monitoring and evaluation, log frame, some civil engineering concepts), than an oral interview (background, behavioral questions, M&E, proposal content), then a reference check.", "Interview Questions": "1- What do you know about Mercy Corps?\r\n2- Why did you choose Mercy Corps?\r\n3- What management style do you prefer?"}, {"date": "12 Jan 2020", "title": "Data Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mercy Corps (Moroto) in Jan 2020", "Interview Descriptions": "Just so fine with me, please on hiring and interview process I'm sure that I may not remember every thing but all was well though it's my first time to do so.", "Interview Questions": "Why I chose to apply for a job with Mercy Corps \r\n"}, {"date": "10 Jan 2022", "title": "Director of Programs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Mercy Corps (New York, NY) in Jan 2020", "Interview Descriptions": "Lengthy but worth it several stages and various teams interview with sometimes repeated questions it shows\r\nThe nature of the interview is very relaxed and sometimes just turn into a discussion", "Interview Questions": "Gene's questions but the several stages "}, {"date": "18 Jan 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Corps in Dec 2019", "Interview Descriptions": "Very to the point, and focused on the job description, as well as other administrative duties. team management, and other travel issues and accommodation. also salary expectations, and competencies.\r\nstarting date, contract type.", "Interview Questions": "Strength points"}], [{"date": "21 Mar 2021", "title": "Social Media Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Portland, OR) in Aug 2019", "Interview Descriptions": "Very nice and relaxed interview. I had a phone interview + in person interview. They asked me how I do in difficult situations and I learned it is because they have a ton of difficult messages on FB you have to go through and respond to.", "Interview Questions": "Do you have a car? "}, {"date": "21 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Mercy Corps", "Interview Descriptions": "It was casual and not too difficult. They asked many behavioral questions and why you wanted to apply to the internship and asked about my previous experiences. The process went relatively fast, recruiters were friendly and responsive.", "Interview Questions": "What is one recent issue you are worried about or have paid attention to? "}, {"date": "18 Apr 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps", "Interview Descriptions": "Friendly panel. Interview may have more than one rounds depending on the position.\r\nQuestions based on experience gained majorly. You may want to have your facts right prior to the interview. Also, ensure you understand the workings of non-governmental organizations.", "Interview Questions": "Questions based on experience gained majorly\r\n"}, {"date": "7 Oct 2020", "title": "Enquêteur terrain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 weeks. I interviewed at Mercy Corps (Goma, Nord-Kivu) in Apr 2019", "Interview Descriptions": "Il faut au préalable être attiré par le poste auquel il faut postuler, suivi par l'envoie de sa propre candidature, si le dossier a été apprécié par l'équipe de recrutement, il est demandé de se présenter à l'heure demandée pour passer le test écrit ensuite viendra l'étape d'interview.", "Interview Questions": "Avez vous un défaut au quel vous avez changé au cours de ces dernières années?  Lequel"}, {"date": "11 Jul 2019", "title": "Assistant Chef De Projet Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Mercy Corps (Bambari, Ouaka) in Jan 2019", "Interview Descriptions": "par skype avec les staffs de Bangui , l'entretien a eu lieu en ligne de 14 heures 30 à 16 h 30 en présence du chef de projet résident à bambari et du Admin RH terrain", "Interview Questions": "pouquoi voulez vous travailler pour mercy corps"}, {"date": "8 Sept 2020", "title": "Project Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Mercy Corps in Jan 2019", "Interview Descriptions": "It iwas really though  nderstanding the intrinsic value of each man, woman, and child as a being created in God’s\nimage, we work to serve all people—regardless of race, gender, ethnicity, religion, or creed.\nWhole systems of individual, spiritu", "Interview Questions": "what is your expectation salary?"}, {"date": "1 Dec 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mercy Corps in Dec 2018", "Interview Descriptions": "1st interview: HR interview\n2nd interview: Technical interview, mostly on JD and CV \nTechnical competency, experiences, management capacity, such as team management, financial management, security management , procurement in some cases", "Interview Questions": "Can you explain us you are the best candidate?"}, {"date": "12 Mar 2020", "title": "Assistant Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy Corps (London, England) in Dec 2018", "Interview Descriptions": "I was contacted very quickly, asked to come in for an in person interview, a few days later, the HR manager called me to tell me I got it. It was a very short very informative process.", "Interview Questions": "Mostly behavioural and situation based questions"}], [{"date": "5 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mercy Corps (Beirut)", "Interview Descriptions": "I applied online and was contacted for an interview a week later. They were very friendly and took note of everything I said. the interview was around 10 minutes and involved technical and personality questions", "Interview Questions": "What do you know about mercy corps"}, {"date": "5 Jan 2022", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps in Jul 2018", "Interview Descriptions": "The interview process began with the HR Manager, followed by the Countey Director. It went well but they are terrible at providing feedback. Feedback is a sign of respect and applicants ought to be treated better that Mercy Corp does.", "Interview Questions": "Tell us a bit about yourself?\n*competency based questions relevant to the position"}, {"date": "9 May 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Mercy Corps", "Interview Descriptions": "I heard about the position through my university and sent my resume and cover letter via email.  I went to the DC office for an interview at the end of that week. The interview was straightforward and specific to my experience. Within 2 days, I was scheduled for another interview over the phone with my supervisor. This was a shorter conversation and ended with the offer.", "Interview Questions": "-What experience will you bring to the position?\r\n-Elaborating on experiences listed on my resume\r\n-Discussing quantitative and qualitative research skills  \r\n-Discussing sector interests "}, {"date": "7 May 2018", "title": "Consumer & Market Knowledge Associate Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy Corps in Apr 2018", "Interview Descriptions": "Phone interview from Portland. It was 40 minutes long. I was asked many broad questions from describe your motivation behind your career advancement to what was the most inspiring professional experience for you?", "Interview Questions": "What is the key factors in efficient market knowledge management?"}, {"date": "8 Mar 2018", "title": "Campaign Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Portland, OR)", "Interview Descriptions": "I was initially reached out to by the HR department for a brief, 15 minute phone interview. Many of the questions were pretty normal given the nature of the position. Soon after, I interviewed a 2nd time in person with the individual hiring and two of his/her colleagues. Unfortunately, I was not offered the position and I am sure they found a better fit (as I don't feel I would have integrated well into that particular team). But I came out of the interview feeling that the individual hiring had a been a bit rude and appeared disinterested in being present, as he/she very obviously kept looking at their watch/the clock to check the time throughout. One of his/her colleagues had also asked which non-profit organization I would equate Mercy Corps to, to which I responded that I was most familiar with Red Cross, and apparently this was a humorous answer. The reality is that its unprofessional to even ask an interviewing candidate to compare the company to another, that's not the purpose in getting to know a potential employee.  Overall, I wouldn't intend to apply for a position with this organization again as I just feel there are better options for MBA graduates looking for experience and a positive work environment.", "Interview Questions": "What organization would you compare Mercy Corps to? "}, {"date": "6 Aug 2019", "title": "Finance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Corps (Dahūk) in Mar 2018", "Interview Descriptions": "I applied online on the job and I received a call that I have been shortlisted after 3 weeks.\r\nThere is written test and if you pass if they call for interview.\r\nThere are three interviewers and the questions were well organized and comforted", "Interview Questions": "They asked technical and general questions"}, {"date": "21 May 2018", "title": "Assistant Programmes Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Corps (Edinburgh, Scotland) in Mar 2018", "Interview Descriptions": "The whole process took about a month, from application to offer. I applied online, I actually applied for a different position didn't get that and was asked to interview for another job. I have 3 interviews: one 'casual' chat, one formal interview with two people and one phone interview with HR (I think it was more to confirm what I said in my last two interviews).", "Interview Questions": "Explain a time you had to solve a problem at work using analytical skills."}, {"date": "29 Mar 2018", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Corps (Jakarta) in Feb 2018", "Interview Descriptions": "The job posting is very clear. The interview covers all question related to the posted job and duties. The panelists are very open in answering questions. The office is so beautiful that it doesn't reflect non profit organization. The staff is also very accommodating during the waiting time.", "Interview Questions": "Are you a moody person?"}, {"date": "12 Jul 2017", "title": "Protection Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Corps", "Interview Descriptions": "First interview was done with HR.  second interview was held with program manager and the last one with  gender and protection advisor of the company. 3 interviews via Skype.  Procedures takes time, approach. 2,5 months. They offered me high level post.", "Interview Questions": "questions related technical knowledge on protection."}, {"date": "14 Sept 2020", "title": "Summer Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps (Washington, DC) in May 2017", "Interview Descriptions": "The interviewer was friendly with standard questions but was unable to provide additional details about position expectations, the stipend process described in the job posting, etc. Additionally, during the interview, they asked a personal question which was inappropriate and irrelevant for the position I was applying for - while I believe it was a question to assess the \"culture fit\" it was treading on illegality.", "Interview Questions": "The interviewer asked about the size of my family, which is highly inappropriate and I interpreted that they wanted to know whether or not I had children - something that is illegal to ask about. "}], [{"date": "17 Aug 2017", "title": "Emergency Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Corps in Apr 2017", "Interview Descriptions": "I applied through website,after two weeks I interviewed with HR/Technical teams, most the questions are competence based interview .\r\nFinally they gave me job offer and there is no contract", "Interview Questions": "how to select modality Cash transfer program"}, {"date": "21 Feb 2020", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mercy Corps in Jan 2017", "Interview Descriptions": "Good interview. Recruiters really nice and very communicative throughout the process. Everyone really passionate about the work and transparent about the challenge and volume of work. I met with a lot of people which felt like a lot at the time, but really glad I did then I knew these people when starting work and it helped form relationships quickly.", "Interview Questions": "What does inclusive leadership mean to you?"}, {"date": "21 Oct 2016", "title": "Talent Acquisition Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Portland, OR) in Sept 2016", "Interview Descriptions": "I applied through LinkedIn and heard back from a Recruiter within a few days via email. We scheduled a phone call and had about an hour long conversation. \r\n\r\nFrom my years of recruiting experience, the first call is a casual introduction and high level introduction to the technical background, but also involves digging for career motivators, core values and the soft skills that would make a great team fit...\r\n\r\nThis call was pretty unimpressive in that the recruiter spent about 80% of the time talking about her and the restructuring of the team (red flag!), with 20% dedicated to a pretty shallow conversation about myself with no thought provoking questions.\r\n\r\nAfter our call, there was absolutely no follow up. Just radio silence. Any good recruiter knows that closure is one of the biggest pain points for candidates in the application process, especially passive candidates. It's disrespectful, unprofessional and most importantly in this case, provided confirmation that regardless of the mission and vision of Mercy Corps, this is not a Talent Acquisition Team I'd want to work with.", "Interview Questions": "Tell me about yourself. Tell me about your global travel experience."}, {"date": "18 Jun 2019", "title": "Corporate Partnerships Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps (Portland, OR) in Sept 2016", "Interview Descriptions": "The interview process started off well, but went downhill fast. Went through the interview process and towards the end, they asked for references, which I gave. Then, they came back with a \"homework assignment\", which was weird considering my years of upper management experience. Sent what they asked for and they never responded. I followed up twice to HR and hiring VP, but nothing. It was by far the most unprofessional experience I had ever been through. I'm sure it was a blessing in disguise because based on their job postings, there is A LOT of turnover in that department.", "Interview Questions": "What corporations I have worked with? "}, {"date": "13 Jul 2016", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Corps in Jun 2016", "Interview Descriptions": "My interview consisted of four phases - 1) a phone screen, 2) a large panel interview with approximately 10 people, 3) a technical skills interview with a panel, and 4) the submission of a proposal based on my technical skills interview.  It was time consuming, but the panel was eager to know more about me and welcoming.  \r\n\r\nNo salary was posted for the position.  The HR recruiter requested my salary expectations after my phone screen.  I demurred based on not having an opportunity to ask questions about the position.  My salary expectations were again requested by HR after my first panel interview.  I complied and submitted a defined salary range, and received no response except a request to return for a third interview.  \r\n\r\nAfter a successful reference check I was offered the position with a salary that was 80% of the low range I had submitted.  I do not feel like my salary expectations (requested many times by HR) were taken seriously, based on Mercy Corps' continued requests to interview despite its budget not aligning with my compensation needs.  Another possibility is that HR has poor communication with program staff.  Either way, it was a disappointing experience - the lack of transparency made me feel like MC was not negotiating in good faith.  I declined the position.", "Interview Questions": "Tell us about your experience working with diverse communities."}, {"date": "2 May 2016", "title": "Sr Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Mercy Corps (Edinburgh, Scotland) in Nov 2015", "Interview Descriptions": "Many interviews! 5 overall with a test. I was not in a hurry but had I been I am not sure I would have stuck around for as long as it took.", "Interview Questions": "Describe the role I take normally when working in a team."}, {"date": "25 Aug 2016", "title": "Meal Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy Corps (Ḩawwārah, Amman Governorate) in Nov 2015", "Interview Descriptions": "The application was posted on the internet, many application were received, I was the only applicant to apply internally. but no one was hired!!! that has been for 9 months now, an here i am, acting manager, doing all the tasks and duties of a MEAL manager, but without being hired!", "Interview Questions": "What is your vision for the MEAL department?"}, {"date": "10 Dec 2015", "title": "Advocacy and Policy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps (Washington, DC) in Nov 2015", "Interview Descriptions": "I submitted my application/resume/cover letter online and I believe they are accepted on a rolling basis. I got an email setting up an interview, a week later and showed up and met with the woman the front desk. The interview was casual and the atmosphere was comfortable. The woman has originally an intern as well so she answered a lot of questions I had. I was told I would hear back within two weeks. After three weeks I emailed them asking for a response.", "Interview Questions": "Answered questions relating to experience in quantitive and qualitative research as well as advocacy experience."}, {"date": "6 Feb 2017", "title": "Digital Financial Capability Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Mercy Corps (Nairobi) in Mar 2015", "Interview Descriptions": "It was very short. It look less that a week from the time I sent in my CV until the time I got a call back with an interview date. The interview itself was more of a conversation than an interview. It was really positive", "Interview Questions": "How best my skills fit the role being offered"}, {"date": "15 Feb 2015", "title": "Finance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Corps (Kabul) in Dec 2014", "Interview Descriptions": "Interview was very interesting and asked questions about financial and also asked about education and experience at the end of interview I do not have any questions and concerns about company", "Interview Questions": "Introduced your self and ask accounting questions"}], [{"date": "18 Jan 2016", "title": "Human Resources Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Corps (Gaziantep) in Oct 2014", "Interview Descriptions": "They asked me a lot of questions and it was even nice to enter an interview. I saw their vacant post on web. (AB Ilan) then applied online by e-mail. They called me for an interview and after the interview procedure, they asked me for my previous company payroll. But i got an another offer from another company and they were paying good and my friend was working there. I did not now about MC. I decided to go good pay company also in order to work with my friend there.", "Interview Questions": "How you handle stress and pressure"}, {"date": "30 Sept 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Mercy Corps (Portland, OR) in Apr 2014", "Interview Descriptions": "Very long. It took 4 months from start to finish until I was offered the job. There is little communication with candidates during this long process and the system has no updates. It's very much a castle on the hill and they act like this during the interview process.", "Interview Questions": "Why are you interested in the position?"}, {"date": "3 Nov 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Corps (Portland, OR) in Feb 2014", "Interview Descriptions": "The Interview process was pretty simple - I had an initial phone interview that lasted about 30 minutes and then an in person meeting that was more like a conversation and an offer at the end.", "Interview Questions": "What type of related experience can you bring to this position?"}, {"date": "22 Jun 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Mercy Corps (Jakarta) in Dec 2013", "Interview Descriptions": "The interview process occurred over Skype with my future supervising manager. Overall it was a very comfortable and  positive experience. We covered the basics and also what I hoped to get out of the internship and how I would be able to integrate my interests within the current program activities.", "Interview Questions": "What experiences do you have that would help you contribute to the current team and mission?"}, {"date": "20 Jun 2012", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mercy Corps in Jun 2012", "Interview Descriptions": "It was very professional. From perception the person on the phone appeared happy.", "Interview Questions": "To be honest a person of your caliber is overqualified for the position. So, why did you apply?"}]]