[[{"date": "13 Jun 2023", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Frontline in May 2023", "Interview Descriptions": "It's extremely tiring and full on. Had little breaks in between activities but it was nerve wracking. The process involved 1:1 interview, group task, talking to a care experienced person (you have to lead the conversation and get nothing back) written assessment (writing an email about a care) and role play with an actor. They say they're not checking your knowledge of social work but your competencies and you can handle it but that's a lie. They expected to be a social worker with experience during this even though they say you can't have experience to get onto the training. If you haven't done lots of research and practiced, don't waste your time. I aced that interview and I was confident in everything I did. You can't show everything on camera and it shouldn't be on you to consider that but them when assessing. Their loss Had to chase them for a response but apparently they contacted me within a week...", "Interview Questions": "What is antiracism? What does antiracism mean to you? What situation have you been in where you had to make a difficult decision that impacted others? How can you support yourself? Why the frontline programme? What is leadership and how did you display it?"}, {"date": "8 Feb 2023", "title": "Trainee Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "Intense assessment centre, 5 different tasks/interviews. Based on the competencies on their website. One written task; one interview with a social worker; one chat with a care-experienced person; one group task; one 'role play' with an actor.", "Interview Questions": "What does anti-racism mean to you."}, {"date": "22 May 2023", "title": "Social Worker Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Frontline (Leicester, England) in Jan 2023", "Interview Descriptions": "Initial interview was easy however the assessment centre was difficult it went on for around 5 hours with small 10 minute breaks in between with a larger 30 minute break", "Interview Questions": "How do you know what a good parent is? How do you know what a bad parent is?"}, {"date": "15 Dec 2022", "title": "Social Worker scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Frontline in Dec 2022", "Interview Descriptions": "I applied online and I got invited to an assessment centre pretty quickly. The online portal is really easy to use and each stage of the application is very clearly laid out and the instructions are easy to follow. When booking onto the assessment centre you get a choice of about 3 days and either the morning or afternoon for each day which I thought was pretty good. The assessment day is online which I like because it means you don’t have to travel – it isn’t as easy to present yourself as you would in a face-to-face assessment day though (I hope they take this into account). For the assessment day you have 5 activities to complete. For each activity you get a brief before it starts so you are fully prepared going into it. The activities are an interview, group activity, written exercise, role play and conversation with a care experienced young person. I found the day to go quite quickly, but I did think it was laid out very well with plenty of time allocated for breaks or to have 5 minutes to just take a breather. Some of the activities were a lot harder than others. At points it felt as if they expect you to have this full catalogue of knowledge on how to be a social worker and to know exactly what to do and how to react in certain situations. This, for me, was really off-putting because it’s meant to be a 2-year scheme where you learn how to respond to these types of situations and how to deal with certain people. I do think that they could – and should – take this into consideration as it has put me off entering this field of work and I’m sure I’m not the only one who feels like this. Interview – 35 minutes and interviewed by a qualified social worker. They were friendly and allowed you time to think about your answer. The questions were pretty standard but be prepared to be asked about a difficult situation you’ve experienced. Group activity – 30 minutes. Given 5 cases and 10 minutes to discuss as a group and say what you would do about them, followed by 2 minutes to discuss with the assessors. You then get some additional information and another 10 minutes to discuss as a group followed by another 2-minute discussion with the assessors. There needs to be more group discussion time as people can easily talk over others but make sure you do speak up! Written exercise – 25 minutes for the whole task. You have to write a mock email response to a social work brief. Very clear and simple instructions and you get given a lot of background information. Keep an eye on the time as it goes very quickly – I would recommend starting a timer. Role play – 15-minute brief followed by 20-minute activity. Very difficult. You take on the role of a newly qualified social worker having a meeting with someone played by an actor. This was a very challenging activity and you’re thrown in at the deep end, and the actor gets very into their role and came across as harsh and rude. I appreciate that you do have to deal with people like this in this job but it was a lot for someone who was on an assessment day. I didn’t feel as though the assessors were as sympathetic as they could be as they could clearly see I was out of my element. Conversation with a care experienced young person. You have a 5-minute conversation where you’re completely in the lead. This is difficult as they don’t give you anything at all and it gets pretty awkward. Then they ask you questions for 5 minutes about why you want to be a social worker and your motivation for applying. Overall, the assessment centre ran very smoothly and was laid out in a very good way but I do think that they need to take into consideration that the people applying are not social workers and may not have a lot of knowledge on how to deal with certain types of people or behaviours. I also feel that the assessors could have been a bit more emphatic, they didn’t really offer any friendly smiles and came across a bit cold at times.", "Interview Questions": "Can you tell me about your background and what has led you to this career and why Frontline?"}, {"date": "9 Dec 2022", "title": "Grad Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "5 state selection. Assessment centre was interactive and people were nice - the role play was hard but just prepare well and you’ll be fine. The group activity was ranking cases etc, interview just competency based", "Interview Questions": "What is leadership to you"}, {"date": "28 Nov 2022", "title": "Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Frontline", "Interview Descriptions": "pre-recorded interview no re-recordings allowed some time to prep, followed by time to answer quite a few surprise questions, scenario based (i.e. what would you do if you walked into ...)", "Interview Questions": "based on competencies found on website"}, {"date": "20 Nov 2022", "title": "Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Frontline (London, England) in Nov 2022", "Interview Descriptions": "Application, then a combined assessment - virtual video interview and situational judgement test, untimed. Assessment centre day: discussion with a care experienced person; social worker role play with a professional actor; 30 minute interview with a qualified social worker; social work meeting role play with other candidates; case analysis written task.", "Interview Questions": "Interview questions covering the competencies."}, {"date": "7 Mar 2023", "title": "Trainee Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Frontline in Aug 2022", "Interview Descriptions": "No feedback and very difficult and long application. Would not recommend. Felt very unwelcome and was happy not to receive an offer from them. Would not apply again or want to work for this company in any capacity.", "Interview Questions": "How do you think your skills fit into this role"}, {"date": "16 Mar 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "multiple stages to the application \r\ninitial application / online interview / assessment day\r\nwent smoothly and everything was done online\r\nonline interview took about 30 minutes\r\nassessment day was half a day and had breaks in between each different stage", "Interview Questions": "Mostly based around their competencies "}, {"date": "13 Feb 2022", "title": "Manager Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Frontline", "Interview Descriptions": "I was interviewed by a panel of 3 staff members - 2 operational and 1 from HR. I answered a series of questions and there was no task involved. \r\n\r\nAlthough 2/3 staff were professional, polite and I found quite easy to speak with. One staff member who I also liaised with over email made me feel quite uncomfortable and actually laughed at a response I gave as I don't think I fully answered the question the way that they wanted. I felt quite taken aback as this has never happened to me during an interview before, and I was upset as I had also spent a lot of time preparing for the interview. Ultimately even if I am not the right candidate I deserve to not be laughed at during an interview. It brought about an uncomfortable atmosphere I think even for the two other staff members present.", "Interview Questions": "Why would you be a suitable candidate for this role?"}], [{"date": "31 Oct 2022", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Frontline (London, England) in Jan 2022", "Interview Descriptions": "Long and rigorous with online forms, virtual interviews with no one on the other side followed by an assessment day with multiple tasks. Understandably so for the role. From passing the assessment day, prepare to have to provide and pay to post certificates to prove qualifications and pay for proof of medical fitness to work.", "Interview Questions": "Scenarios of situations working with children and how you would cope with it."}, {"date": "12 Jan 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Frontline in Dec 2021", "Interview Descriptions": "The application and video interviews were standard and okay, however when I did the assessment centre, it was one of the most difficult and overwhelming things I’ve had to do. It was a very long process, 8:15 till about 1. Most of the activities finished early so you were sat at your laptop waiting for the next. I felt like the group task, everyone was just trying to talk over each other to get their point through.  At the end the day, I had to do a role play exercise with an actress pretending to be a family member and a social worker, now this was the worst experience of the day. They give you time to prep but nothing can prepare you for this, I had an actress that was literally acting as if she was in a Hollywood film, how they expect you to deal with someone who’s literally shouting at you when you’ve never been a social worker before, I have no clue. The actor talked over me, raised her voice, and obviously I understand that as a social worker you may encounter people like this, however this is an interview and I was unable to come across in a way that I wanted due to the way the actress was behaving.  It was honestly so overwhelming, I was almost in shock. I can’t even imagine what it would have been like if it was in person so thank god it was virtual. Overall, it was a long and overwhelming day, they expect you to literally already be a social worker and therefore it’s very difficult.", "Interview Questions": "This is a very vague view, in the group task, we had to prioritise cases with different options. Written exercise was an email if I remember correctly, a handover almost where you collated your information on a case and what steps you wanted to take next.  Only thing I remember about the interview was that it mentioned race and how it may affect someone in the social system I think. Role play involved pretending to be social worker meeting with a mum who had been brought to attention due to her children. "}, {"date": "1 Nov 2021", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 months. I interviewed at Frontline", "Interview Descriptions": "Very grueling, 5 hour assessment center with mixed activities.\n\nI found the recruitment team, who were monitoring the tasks to be a bit useless and rude at times\n\nDidnt let me know the outcome for months later- had to keep chasing them for them to finally let me know outcome.", "Interview Questions": "Why do you wish to work for Frontline?"}, {"date": "25 Jun 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Frontline (London, England)", "Interview Descriptions": "Interviewed by a panel of four people who were just reading questions, one after the other. It was kind of intermittent and they did not make me feel comfortable at all. They were all typing and they did not seem to listen to me when I was speaking. \nThe feedback afterwards was not helpful at all.", "Interview Questions": "What is your experience with content management systems?"}, {"date": "22 Jun 2021", "title": "Brand Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "It was an assessment centre involving one written task that gave examples of things we might encounter on the job, a group activity and then the interview. Everything took place in one day so a few hours overall", "Interview Questions": "tell me about a time you displayed leadership"}, {"date": "31 Mar 2021", "title": "Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Frontline (London, England) in Feb 2021", "Interview Descriptions": "Following a pre-recorded interview (based on Frontline's main competencies), I was invited to a (virtual) assessment centre which takes half a day to complete. Tasks involve a two part role play, a written exercise, an informal discussion with a care-experienced young person, a group task discussing a typical case and finally and most importantly the one to one interview with a qualified social worker in which they will ask questions based on their competencies and your own experience.", "Interview Questions": "How do you think the issues of race affect children in the UK?"}, {"date": "4 Jan 2021", "title": "Graduate Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Frontline", "Interview Descriptions": "Online interview as part of assessment centre. One assessor present who was a social worker. Very friendly process, asked follow up questions and able to ask to clarify any questions too. Natural discussion.", "Interview Questions": "Name a time you have worked with vulnerable individuals.\r\nHow is your experience of being in a family transferable?\r\n"}, {"date": "24 Mar 2021", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Frontline in Jan 2021", "Interview Descriptions": "Very rigorous and one of the toughest I've had personally. I felt that by the end of it you would know whether social work was for you or not. Started off with an individual interview and then a group interview. Also spoke informally with a care leaver and had a mock social work meeting with an actor pretending to be a service user.", "Interview Questions": "Give me a time where you have shown self-awareness with regards to race."}, {"date": "7 Nov 2020", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "Assessment centre containing group exercise, individual interview, conversation with care experienced young person, and two role plays. There were breaks in between all exercises and there were about 9 other candidates in the cohort.", "Interview Questions": "Describe a time you have shown leadership."}, {"date": "21 Oct 2020", "title": "Frontline Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Frontline (London, England) in Oct 2020", "Interview Descriptions": "You have to complete various online tests, an application form and a video interview. The process takes hours, apart from the video interview which only allows 60 seconds to answer most questions. They will not offer any feedback until the assessment day so I wasted many hours applying for this role.", "Interview Questions": "What attracted you to the frontline programme?"}], [{"date": "13 Aug 2020", "title": "People Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Frontline (London, England) in Jun 2020", "Interview Descriptions": "First round interview with a panel of three. Very friendly and made me feel at ease. Lasted around half an hour. Mostly competency questions and a couple about why I want to work at Frontline/why I want a career in HR.", "Interview Questions": "Describe a time you have struggled to communicate with somebody and how you overcame this. "}, {"date": "2 Jun 2020", "title": "Brand Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Frontline in May 2020", "Interview Descriptions": "Online Application form asking about why you want to work for Frontline, how you would pitch Front-line to the society president and an attachment of your CV\r\nThen due to Covid 19, the assessment centre was online", "Interview Questions": "What would you write to the President of a society"}, {"date": "6 Apr 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Frontline (London, England) in Mar 2020", "Interview Descriptions": "You are emailed a link to start 7 questions with 1 practice question. All questions are timed constrained and your answers can only be about a minute or less long.", "Interview Questions": "What experience in your life made you want to join Frontline?"}, {"date": "9 Jul 2021", "title": "Brand Ambassador Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Frontline (York, England) in Feb 2020", "Interview Descriptions": "I was placed in a group of 5 people and we had to go through various tasks for a couple of hours.  After the group task I had a one on one interview with one of the recruiters.", "Interview Questions": "Tell me a time where you had to manage your time effectively. "}, {"date": "18 Nov 2019", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Frontline (London, England)", "Interview Descriptions": "A Tough assessment day, including role-play, interview, group task and written task, but with supportive staff taking you through it. The role-play is particularly difficult and hard to prepare for, just try to relax, hold you nerve and think on your feet.", "Interview Questions": "Why do you want to work with Frontline? \r\n\r\n"}, {"date": "17 Nov 2019", "title": "Social Care Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Frontline (London, England) in Nov 2019", "Interview Descriptions": "Assessment Centre - 1:30pm-6pm. \r\nThe day consisted of a 1:1 with an individual who had been involved in the care system, a 30 minute interview with a current social worker, role play, group work and a written assessment.", "Interview Questions": "Tell us a time in your life which you have faced difficulty and how you have come through that. "}, {"date": "19 Oct 2019", "title": "Student Brand Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Frontline (London, England)", "Interview Descriptions": "Assessment centre based interview with interviews testing your core competencies. Mainly group-based - ranking scenarios and discussions. Some written exercises as well are given on the day. Be prepared and talk with confidence and passion", "Interview Questions": "- what motivated you to apply for this role compared to other companies "}, {"date": "27 Nov 2019", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Frontline (London, England) in Oct 2019", "Interview Descriptions": "It’s quite an intense morning or afternoon where you are constantly surveyed throughout a variety of activities. Activities include a group exercise with a written task, a one on one interview, a role play and a conversation to test your ability to develop relationships. It does pass relatively quickly which is a bonus.", "Interview Questions": "What is good parenting?"}, {"date": "22 Oct 2019", "title": "Regional Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Frontline (Manchester, England) in Oct 2019", "Interview Descriptions": "Panel interview and then called back to second round. Initial interview behaviour competency questions as well as a time organisation task  and second interview looking at work experience - good overall experience", "Interview Questions": "Describe a situation where you had to pay attention to detail "}, {"date": "22 Sept 2019", "title": "Brand Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Frontline (London, England)", "Interview Descriptions": "The day is spent with other candidates, the task are made up of 3 sections a 50 minutes written task, a group task and a one-to-one interview with a recruiter from Frontline.", "Interview Questions": "Name a time where you tried hard at something, however failed regardless? "}], [{"date": "12 Nov 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Frontline (London, England) in Sept 2019", "Interview Descriptions": "Two stage interview via recruiter. First stage covered background, second stage was a psychological review of the last two positions, influenced by Kim Scott's \"Radical Candor\" and Geoff Smart's \"Power Score\". A tad unnerving, which perhaps was a warning..!", "Interview Questions": "Describe your last boss and their working style. "}, {"date": "8 Jul 2019", "title": "Brand Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Frontline (London, England) in Jun 2019", "Interview Descriptions": "Group Test - have to rank social work cases\nInterview - I've listed some questions. The interview was nice and friendly. From a lot of jobs I realised being easy going and myself got me the job. But with this I don't think that approach worked funnily you really have to put on a sophisticated front. So don't let the relaxed demeanor confuse you. \nWritten assessment - a few writing related tasks that seemed a little too easy, but that might have been where I went wrong.\n–also all the non-minorities got offers so that was interesting.", "Interview Questions": "What made you essential in your previous job?"}, {"date": "25 Apr 2019", "title": "Programmer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "First round interview begins with 15 minute situational task. Discuss answer during interview, before answering interpersonal-based questions. \r\nSecond round more casual interview. Finding out how well candidate suits role tasks and whether he/she wants the position.", "Interview Questions": "If your previous colleague was here in the room, what strength and weakness would he/she say about you? "}, {"date": "15 Jan 2019", "title": "Leadership Development Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Frontline", "Interview Descriptions": "Initial application process is followed by a quick video interview process. You have some time to prepare and record your answer once. Mostly about \"what would you do in a given situation as a social worker\".", "Interview Questions": "Situational and behavioral questions mostly. "}, {"date": "26 Aug 2019", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Frontline (London, England) in Dec 2018", "Interview Descriptions": "Online tests asked a series of questions to see how you would respond in certain situations followed by video interview with 5 questions you couldn’t prepare for and ad to record yourself answering followed by assessment day with other applicants in London", "Interview Questions": "Why do you want to work for frontline?\r\nHow will you cope with demands of job?"}, {"date": "7 Nov 2018", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Frontline (London, England) in Nov 2018", "Interview Descriptions": "Video interview. 7 questions, a mix of scenario and experience-based questions testing your motivation and approach to social work. Often quite complex situations with many ways to answer in a short period of time. You have to think quickly.", "Interview Questions": "Cannot disclose fully but they want to test your ability to risk-assess and your motivation. "}]]