[[{"date": "10 Aug 2021", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Virginia Premier", "Interview Descriptions": "2 rounds of interview. One with HR and the other with team the management team.\r\n\r\nThe management team normally concentrated on behavioral questions. The people were very warm and made me very comfortable during the interview. The  HR was also very friendly.", "Interview Questions": "Personal and subjective knowledge related to job. "}, {"date": "25 Sept 2020", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Virginia Premier", "Interview Descriptions": "Received a call to schedule an onsite interview with a variety of slots available, panel interview to include managers and colleagues, familiar questions, very welcoming and not intimidating environment ,quick turnaround", "Interview Questions": "Describe your experience related to the position "}, {"date": "23 Aug 2019", "title": "Compliance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Richmond, VA)", "Interview Descriptions": "I applied for the position online, and heard back from the recruiter within a few days.  The recruiter was nice and very informative.  He asked me to provide some written responses to standard questions about my experience.  After that, I completed a phone interview with the recruiter, and was later invited onsite for a panel interview.  Everyone I met or spoke to at Virginia Premier was fantastic, but when it came time to make a decision I was told that the company had eliminated the position.  I checked their website later that day and discovered that they had removed ALL of their previously posted jobs. It’s a shame, because it seemed like a great place to work.  I’m not sure what’s going on over there, but I hope they get it figured out.", "Interview Questions": "How would you respond to someone who came to you with an example of workplace non-compliance?"}, {"date": "8 Nov 2018", "title": "Complex Care Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Virginia Premier (Roanoke, VA) in Nov 2018", "Interview Descriptions": "It started with a detailed online application. A couple days later, I received a request to schedule a telephone interview with a recruiter. After the telephone interview, I received a personality assessment to complete online.  About four days after the telephone interview, I received a call to come in for an in-person interview with a three-person panel. Two days after the in-person interview, I got a call with the offer.", "Interview Questions": "Describe a situation where something unexpected happened at work and what I did about it."}, {"date": "7 Jan 2019", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Virginia Premier (Chesapeake, VA) in Nov 2018", "Interview Descriptions": "I attended a job fair in Chesapeake va which went fairly well.I interviewed with one person,the wait was about an hour as several people were attending the job fair.He said my resume would be submitted to the hiring manager", "Interview Questions": "I was asked question about how I felt about travel ,what I like about my current job ,would I prefer telephonic roles or clinical,.He also so asked me to tell him a little bit about myself and how long I've been in the medical feild"}, {"date": "13 Nov 2018", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Richmond, VA) in Oct 2018", "Interview Descriptions": "First there was a phone screening and then there  was a Panel style interview using the STAR model. There were 3 panelists who took turns asking me questions off their sheet.", "Interview Questions": "What would you do if you were in a phone with a client who seemed disoriented and not himeself if it were a Friday, at the end of your shift, no supervisors were present and the client lived 3 hours away."}, {"date": "8 Feb 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Virginia Premier (Richmond, VA) in Sept 2018", "Interview Descriptions": "I was contacted by a recruiter, had a phone interview, and then a panel interview on site.  Seems like a great organization, but I think the position turned out to not be a very good fit for my skills and interests.", "Interview Questions": "Tell me about yourself.  Why are you interested in this position?"}, {"date": "12 Apr 2019", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Glen Allen, VA) in Jun 2018", "Interview Descriptions": ", 3 person panel, met at the office, interviewers were aloof. Met in the office , misquoted on salary by HR. The job duties weren’t accurate , told you get a company car, this is not true, told work from home at the beginning, not true.", "Interview Questions": "Tell us about yourself "}, {"date": "26 Feb 2020", "title": "User Experience Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Glen Allen, VA) in Jun 2018", "Interview Descriptions": "I approached the company from a listing on Linkedin on 06/18.\r\nThen I submitted my resume via their online portal.  It's been a while since the interview as it is about a year and a half later. I had been thinking about writing this as the experience was pretty bad, aside from the recruiter's great help. The company may have changed since the occurrences below, but overall the interview was one that showed where they were as an organization and their place in the insurance market. More importantly, how I was treated as a candidate was an experience I wanted to share so that others on glassdoor would be prepared with this knowledge and expectation.\r\n\r\nTheir recruiter approached me via email. We had correspondence over several days where there were questions asked about my qualifications and I inquired about their company, its stability, work/life balance, etc.\r\n\r\nLater, there was a phone interview that went well with one exception, the salary start.\r\nThe starting pay was less than I was making and I politely declined to proceed with next steps. \r\n\r\nAfter about a week or so the recruiter contacted me again about a raise in the salary start.\r\nI asked to be considered again and the process was started again. There were also now 2 positions within the strategic marketing and development department that matched my skill set.\r\n\r\nThere was another phone call with the same recruiter that was somewhat informative knowing that she wasn't a technical recruiter and not as well versed in applications I was familiar with and what I may be able to offer in creating user experiences for the company's web assets. There was also a very strong emphasis on the new salary for the job description and that no negotiating would be entertained at all.\r\nI also asked if it would be possible to see the environment while I was there, as I wasn't used to a communal workspace. I was told there was no way to see the workplace or department because of privacy/medical information concerns.\r\n\r\nAn interview was scheduled and I showed in a suit with an iPad as it is usually customary to present visual work processes, challenges, and solutions for a designer interview.\r\n\r\nI was greeted around 11am after checking in. There was a wait. I was eventually greeted by the potential supervisor and asked to come in. On the way there were a few times where my escort was approached to talk about future discussions or meetings about projects. Then a panel took shape with the head of several departments not there yet. At this point there was a web developer, the potential supervisor, and another person within the department. There was talk of where they were going to lunch. \r\n\r\nAfter introductions, I was asked to answer a series of questions that related to my work background and skills. After this there were multiple questions from each person in the panel. They were from a list that each of the panel had. Most were relative. When trying to correlate them back to a scenario that I had worked on or show them, there was a feeling of impatience from the panel. \r\nAlso, I started to see all of it's members begin to glance at a clock on the wall behind me. One of the panel was very negative, citing what I was showing was half completed. It was a prototype, but was relative as the job description usually starts with these. \r\n\r\nThere were then several more glances at the clock. Then, I asked them some questions. There was a lot of talk and explanation that the department and its marketing were now in-house and its infancy. There were not yet computers allocated or software decisions for a workflow of output of products. This was of concern to me.\r\n\r\nAgain, there were more looks at the clock.\r\n\r\nThe interview which seemed to only get worse was ended promptly. \r\nThere was then more talk of where the panel was going for lunch.\r\nI was then escorted out of the workplace where we were then approached by more people at the company wanting to talk about their upcoming  work.\r\n\r\nI didn't get the job, but was glad in the end. You never know if these are obligatory because you were in a pool or if there is even a position with an actual job description attached. \r\n\r\nWhat I learned most of all is that the company was undergoing some sort of massive change.\r\nAlso, that they weren't very kind to candidates. This goes a long way in predicting how life would be like in the company.", "Interview Questions": "How did you become a digital designer when you came from a print background?"}, {"date": "13 Oct 2017", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia Premier (Chesapeake, VA) in Oct 2017", "Interview Descriptions": "great, very nice and informative. described job perfectly, explained what is required. holidays and time off. call center, claims enrollment, Medicaid, dual membership. great company to work for. helps members and providers.", "Interview Questions": "what's your professional goals"}], [{"date": "20 May 2017", "title": "Configuration Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Mechanicsville, VA) in May 2017", "Interview Descriptions": "I applied and didn't hear for 2 weeks. Once they called they set up an interview the next day. After the interview they said I'd hear from them within two weeks. They called the next morning and asked me to apply for another position that was better suited for me.  Once they sent me what to apply for, I did and they called me the next morning. Panel interview was wonderful and all made you feel very welcome. Questions were nothing out of the ordinary and I had a lot of questions to ask them as well.", "Interview Questions": "What would you do if you couldn't meet a deadline in hr amount of time given?"}, {"date": "25 May 2017", "title": "Member Care Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Premier in Apr 2017", "Interview Descriptions": "Hiring process consisted of two interviews.First was a interview at the site then I was contacted one week later to conduct a 2nd phone interview.Very laid back and easy process.", "Interview Questions": "Why should we hire you?"}, {"date": "15 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia Premier (Richmond, VA) in Dec 2016", "Interview Descriptions": "I found the interview process to be very comfortable. My interviewers made me feel at comfortable before getting into the formal questions and even when asking the questions made that part very easy going.", "Interview Questions": "Panel Interview with 3 interviewers. Standard questions: Why do you feel you are a good fit for this company? Tell me a time when you had a conflict with a co-worker and how you handle it?"}, {"date": "23 Apr 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Richmond, VA) in Jan 2016", "Interview Descriptions": "The hiring process took about 4 weeks. I was first contacted by a recruiter and then they setup an in person interview. I had worked at VPHP before. The interview questions seemed rushed and unprepared. I also think they did not want to pay the asking salary.", "Interview Questions": "Are you okay with not knowing what you would be doing on a day to day basis? "}, {"date": "8 Oct 2015", "title": "IT Manager for TPM Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Premier (Richmond, VA) in Jul 2015", "Interview Descriptions": "Panel interview with direct manager, analysts, director of operations and VP of TPM. They started by explaining the position and the leader of the panel was the previous person in the role. Everyone had a list of questions that they were all working from and writing answers on the forms they had. They went around the table, one person at a time, and made me feel fairly comfortable.", "Interview Questions": "How would you describe a great manager/leader and are you one?"}, {"date": "21 Jun 2015", "title": "HROD Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Virginia Premier (Richmond, VA) in Jun 2015", "Interview Descriptions": "I applied online and within two weeks I got an email to set up an initial interview. It was a panel interview. They asked preselected questions about my KSAs. I was then invited back for another interview; a position with more responsibility. That was also a panel interview with three VPs. This interview was a combination of preselected questions and non-standard questions about my leadership KSAs. I was called four days after with an offer.", "Interview Questions": "Preselected questions about my knowledge, skills, and abilities (KSA). Second interview more leadership driven questions"}, {"date": "2 Jul 2015", "title": "Wellness Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Premier (Chesapeake, VA) in Jun 2015", "Interview Descriptions": "Interview consisted of the Office Manager and a Supervisor from the Richmond office. Also, they did a conference call with a Manager over the phone. They asked standard questions. They did know how much the salary was because it was a new position.", "Interview Questions": "How do you keep yourself positive when a coworker is being negative?"}, {"date": "16 Feb 2016", "title": "Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Virginia Premier (Bristol, VA) in Feb 2015", "Interview Descriptions": "Panel interview, extremely structured, very few skill related questions, many behavioral/situational questions. The walls of the lobby were pretty thin and as I was waiting, I heard someone mention that I was there and someone replied  \"well are you ready to get this thing over-with?\". Everyone seemed friendly enough, but I found it difficult to connect with the interviewers as they put their heads down and began writing notes every time I started to speak. It was kind of off-putting and made me feel like they were just going through the motions, especially given what I'd overheard before the interview.  After the first few questions, I pretty much sensed that things weren't going well for me and I left the interview knowing I wouldn't receive an offer. I am certainly not blaming their process for my lack of performance - I should have been better prepared. Things did not work out for me, but I rated the overall experience as positive because I definitely learned from it. Now that you know what to expect, I hope you will also benefit from my experience - best of luck!", "Interview Questions": "Discuss a time when you found a creative solution to a problem"}, {"date": "31 Aug 2019", "title": "Claims Adjuster Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Premier (Richmond, VA) in Feb 2015", "Interview Descriptions": "applied online and had 1 in person interview. I was offered a different position than what I had applied and interviewed for. Offer came within a week of interviewing. Final offer took a while due to background check issues-no fault of Premier.", "Interview Questions": "Are you familiar with our Regulatory Agencies?"}, {"date": "11 Feb 2015", "title": "Claims Systems Analyst I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Virginia Premier (Richmond, VA) in Jan 2015", "Interview Descriptions": "Submitted an application got a call for an interview like a week and a half later. Panel formed interview with 3 managers. Very friendly people. Was asked what challenges i think i may face if i recieved the position. Seems like a really good company", "Interview Questions": "Behavioral bases question pretty easy. Asked about experience with SQL Server and Excel"}], [{"date": "17 Jan 2016", "title": "Transportation Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Virginia Premier (Roanoke, VA) in Nov 2014", "Interview Descriptions": "Online application submitted. Within a week, I received a response stating VAPremier was interested and would like to interview me for a position they had available. I was referred by the Transportation Manager whom I had worked with for a few years at my previous position.", "Interview Questions": "What was one situation where you found yourself under pressure and what did you do?"}, {"date": "12 Sept 2015", "title": "Business Analyst II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Virginia Premier (Richmond, VA) in Oct 2014", "Interview Descriptions": "Resume submitted at a fairly small job fair. The phone screening interview two weeks later was pretty simple, no real questions, just checking that my background and skills lined up with what they were looking for.  The actual interview was 2 more weeks later.  (And about a month after that until I got the offer)\r\n\r\nInterview day itself: \r\nLeave plenty of time to figure out how to get to the parking deck.  If you miss the turn, it takes 6 blocks to get back given the one-way streets.  The panel was 2 potential managers, and their manager.  Entirely behavioral interview format.  \"tell me about a time when ___\" kinds of questions.  Only one major exception listed below.  Pretty standard otherwise.", "Interview Questions": "You will not be able to finish all of your projects in time.  Let's say putting in overtime won't help, or won't be enough.  What do you do? (they were rather insistent on this question)"}, {"date": "11 Jun 2015", "title": "Operations Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Virginia Premier in May 2014", "Interview Descriptions": "freaking easy, the most boring interview ever. The managers were not capable to conduct the interview without referring to the script. If I did not need a job urgently I would never have worker there!!!!! however nice people just incompetent", "Interview Questions": "behavioral"}, {"date": "16 Nov 2013", "title": "Claim Systems Configuration Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Premier (Richmond, VA) in Sept 2013", "Interview Descriptions": "Process took about three weeks, interviewed for an HR Intern position initially. I had two interviews then was referred to a Claim System Configuration Intern position for which I had one interview for and was offered the job two weeks later.", "Interview Questions": "Questions regarding my knowledge of Excel and Management Information Systems "}, {"date": "4 Feb 2016", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Premier (Richmond, VA) in Sept 2013", "Interview Descriptions": "An HR employee (and stranger) reached out to me on LinkedIn to let me know they had a position that would be a good fit for my skill set and experience. Relatively easy interview process. One interview with the Communications Manager and the Director of HR. Asked the usual questions and gave me an opportunity to present them my portfolio. They reviewed it carefully and I think having a good portfolio sealed the deal for this position. Received a call back within a week and position was offered to me.", "Interview Questions": "Standard fare, like what are your strengths and weaknesses."}, {"date": "7 Feb 2017", "title": "Claims Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia Premier (Richmond, VA) in Aug 2013", "Interview Descriptions": "It went very well. There were obvious questions that came from an interview bank. There were very few questions directly related to claims processing as I have experienced it in the past. There were not questions about interpreting policy or understanding CPT and ICD coding combinations. It was more of a focus on productivity as opposed to actual knowledge it would take to process a claim. I later found out because your work more with SOPs rather than policy and knowlege.", "Interview Questions": "Examples of my previous knowledge of claims processing"}, {"date": "30 Jul 2013", "title": "Compliance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Richmond, VA)", "Interview Descriptions": "application was submitted on a Sunday and I was contacted within a week by an outside staffing agency to discuss the position and my qualifications. The recruiter was professional and helpful, after discussion tol dme she would forward my resume to the hiring manager. I was contacted a couple of weeks later for an in-person panel interview set up through HR. The panel was friendly and provided an opportunity for good dialogue. Lasted about 1.5 hours.", "Interview Questions": "There was a quiz after the interview was over that had me answer situtational questions about how to perform an internal or external audit, as well as define certain key words in the context of the job, for example, \"providers\"."}, {"date": "15 Sept 2015", "title": "CCU Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia Premier (Richmond, VA) in Feb 2013", "Interview Descriptions": "Application submitted and an initial phone interview was conducted, then scheduled face to face interview with panel of 7 from various departments, department heads determined highest need and best fit and location.", "Interview Questions": "How previous stressful employment scenarios where handled."}, {"date": "31 Mar 2014", "title": "Claims Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia Premier (Richmond, VA) in Jun 2012", "Interview Descriptions": "1/2 hour phone interview followed by a group interview with 4 other individuals.", "Interview Questions": "The questions were all behavioral, nothing out of the ordinary."}, {"date": "28 Apr 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Virginia Premier (Richmond, VA) in Jan 2012", "Interview Descriptions": "Questions require previous work experience an analytical thinking, I was contacted by HR and did two panel interviews. Was contacted with offer and able to consider offer prior to accepting.", "Interview Questions": "How would you handle an employee who refuses to follow directions?"}], [{"date": "15 Apr 2012", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Virginia Premier (Richmond, VA) in May 2011", "Interview Descriptions": "The interview and hiring process was very smooth.  Consisted of a panel interview.  Its no different than any other panel interview.   You'll give an overview of yourself, skills and talent.  The entire interview process was very professional.  The follow up time from interview to extending an offer took about 1 week.", "Interview Questions": "Typical questions you would be asked on any interview."}, {"date": "7 Jun 2013", "title": "Business Analyst II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia Premier (Richmond, VA) in Jan 2011", "Interview Descriptions": "Hiring process is very fast, they want to get anyone in the door who has the slightest qualifications.  Turnover is very high here.", "Interview Questions": "Typical behavioral questions, nothing difficult."}]]