[[{"date": "9 Feb 2023", "title": "Early Childhood Educator (ECE) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at YMCA", "Interview Descriptions": "Everything went fast and smoothly, and I finished within one month. The interviewers were friendly, kind, and polite, and I felt welcome. Happy with the result. Recommend the working opportunity.", "Interview Questions": "Tell me something about yourself"}, {"date": "3 Nov 2018", "title": "Childcare Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at YMCA (Melbourne) in Sept 2018", "Interview Descriptions": "I was called in for an interview not long after applying.  I had to write responses to two pages of questions. I then sat in a room to answer verbal questions. I never received any communication that I had not been successful, which was disappointing.", "Interview Questions": "What is your biggest weakness?"}, {"date": "11 Sept 2018", "title": "Swim Teacher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at YMCA (Canberra) in Aug 2018", "Interview Descriptions": "Group interview. Arrived with maybe 20 other individuals and got divided into table groups. Brief introductory of oneself: \"Hi my name is [ ], I'm a [role] at [organisation], I'm interested in the swimming teacher role today. I have 5 years experience in competitive training and so think I would be an excellent candidate for the job, I also love working with kids of course!\" etc. \r\n\r\nIn table groups, we worked through scenarios-- see question section for scenarios. One (or multiple) people present on behalf of the group. \r\n\r\nOverall, they assess how well you work in your group, amiability, character traits, quality of answers. No individual interview questions were asked.\r\n\r\nI got accepted. They do a Police Check and ask for two references to be completed through XREF. I declined the offer for another company.", "Interview Questions": "Time management: a parent wants to talk to you, a child from your last class is lost, but you need to begin your lesson with some other children and can't take your eye off them. What would you do, how to prevent this next time?"}, {"date": "13 May 2018", "title": "CSO Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at YMCA (Melbourne) in May 2018", "Interview Descriptions": "Three jobs with 300 applications. I was invited to a group interview with seven others. An outline of the organisation and the three interviewers' roles were provided then we worked in pairs with specific scenarios and how we would deal with them. After sharing them, we were given other scenarios to do alone providing written answers. Pretty relaxed compared to a one on one interview.", "Interview Questions": "What makes an exceptional CSO?"}, {"date": "16 Apr 2018", "title": "Community Engagement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at YMCA (Melbourne) in Jan 2018", "Interview Descriptions": "Positive experience. First interview was with two panelists. Second round interviews involved developing a strategy to address a scenario (high rates of diabetes) through programs, services and events. This was followed by a round of questions from three panelists", "Interview Questions": "What do you expect to achieve within the first 6 months of this role? "}, {"date": "16 Feb 2018", "title": "Beginner Gymnast Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at YMCA (Geelong) in Dec 2017", "Interview Descriptions": "I applied online. I was given the chance to move forward and complete some online stuff and I followed the instructions given to me. I then  went to the interview where I was asked many questions on personal, educational, and business related topics. In the end I was offered a job a few weeks later and I accepted.", "Interview Questions": "What do you believe clients should feel when they enter the building?"}, {"date": "21 Sept 2017", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at YMCA", "Interview Descriptions": "Applied online for the position, I was asked behavioural questions at the interview with two people, one was the human resource representative and the other was the manager in charge", "Interview Questions": "About Previous experience "}, {"date": "26 Jul 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at YMCA in Feb 2017", "Interview Descriptions": "Personal presentaion, product knowledge, appearance, phone interview, group interview personal interview, reference check, questions and answers, practical interview, and they will take refernce check with at least two persons.", "Interview Questions": "Why do you want to work with us?"}, {"date": "3 Dec 2015", "title": "Cafe Attendant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at YMCA (Melbourne) in Jul 2013", "Interview Descriptions": "There was a phone interview, which just asked some simple questions, general why you want to work here etc. This was followed by a group interview with approx. 5-10 other people and again just general questions were asked. Try to stand out but not too much. Followed by a solo interview which again was just the standard interview questions. Overall the interview wasn't too difficult, fairly standard", "Interview Questions": "How would you deal with a distraught child?"}, {"date": "26 Apr 2012", "title": "Sales & Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at YMCA (Sydney) in Mar 2012", "Interview Descriptions": "It was exciting prospect. disappointed i didnt get it", "Interview Questions": "Weaknesses"}]]