[[{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Good on paper", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Oct 2021", "job_title": "Tissue Recovery Technician in Missoula, MT", "duration": "N/A", "pros": "Case meals, company car for travel, sometimes flights for bad weather travel", "cons": "Overworks and underpays employees\r\nWilling to risk employee safety for good numbers"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great clinical staff. Horrible management.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jul 2021", "job_title": "Clinical Consultant in Seattle, WA", "duration": "N/A", "pros": "Clinical staff is great but heavily taken advantage of by under qualified management.", "cons": "Management. Huge amount of nepotism, favoritism and a few other “ism’s” here. They’re disrespectful towards hospital staff, donor families and their own clinical staff. Avoid working here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good Place to Work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 May 2021", "job_title": "Organ Recovery Coordinator in Seattle, WA", "duration": "N/A", "pros": "Inclusive environment, Work with Great co-workers", "cons": "Getting a little to top heavy,"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I Can't Believe I Get to Work Here", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jul 2013", "job_title": " in Bellevue, WA", "duration": "N/A", "pros": "One of the best reasons to work here is the mission - saving lives through organ and tissue donation. Above and beyond that, the culture of this organization is one of the best I've ever been fortunate to be a part of. Not only does the leadership encourage you and actually give you support and tools to do your best professional work, they also seriously support having a healthy work life balance. I have been at plenty of organizations where the term \"work life balance\" is thrown around quite a bit and the actions and expectations of the culture don't match. That is not the case here! This company truly believes that employees who are healthy and have time for friends & family are more productive, more creative, and generally happier employees.", "cons": "I have only worked here for 3 months so I don't know that I've had time to formulate an objective con."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mission-Driven Organization Feels Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Oct 2019", "job_title": "Anonymous Employee in Bellevue, WA", "duration": "N/A", "pros": "Hands down, the reason I chose to even pursue a career with LifeCenter Northwest was because of its mission of \"Working together to save lives through organ and tissue donation.\" We all buy into this mission. We have passion for the work we do, individually and collectively, to save as many lives as possible. I am surrounded by colleagues who care about making a difference and who work collaboratively and respectfully to achieve common goals. \r\n\r\nI also really appreciate the work/life balance. This organization understand that if you commute in, finding a schedule that works for you and your family is critical. We work hard so we can live, and LifeCenter Northwest allows us to live. \r\n\r\nWhile I am currently content in my role, there are opportunities for professional growth. This organization supports developing people at all levels.", "cons": "The organization and the number of donors are both growing (a good problem), but that means that changes are happening. Change can be hard on people, but it also can help people develop professionally. It also helps us save more lives."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "They care about their employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Nov 2019", "job_title": "Training and Development Manager in Bellevue, WA", "duration": "N/A", "pros": "LifeCenter NW is a  truly unique  and innovative organization. They are a mid-sized non-profit that fully embraces continuous learning and improvement opportunities. I've seen this play out daily with a focus on strategic planning, best practices, collaborative work, and employee development.  Employees are treated as partners, and learning and  development opportunities are offered and encouraged. I feel truly grateful to be working for an organization that invests significant resources in to on boarding  and educating each staff member.", "cons": "LifeCenter is transitioning from operating as a smaller non-profit organization to a more medium sized organization, with this comes growing pains. The company is still figuring out how to scale and adjust their business practices to match their current workloads and staffing structure. Some of these adjustments move faster than others."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Room for improvement, getting there...", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Nov 2019", "job_title": "Tissue Recovery Coordinator in Seattle, WA", "duration": "N/A", "pros": "- Make a real difference every day\r\n- Overtime potential and off-call/team lead bonuses add up to be significant\r\n- On the frontline, lots of great people with the best intentions\r\n- If you enjoy strange and long hours its perfect. If not, its dreadful. \r\n- Generally a good place to work. I count myself as lucky to be here.", "cons": "- The company is top heavy\r\n- Management can be out of touch with the daily struggles of their people\r\n- In pursuit of \"honoring the gift of donation\" management is able to justify poor business practices and toxic work culture. Hard to say no when its life or death."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Hands down, the most rewarding work I've ever done.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Apr 2015", "job_title": "Hospital Development in Bellevue, WA", "duration": "N/A", "pros": "Being paid to do something I would do for free, if I didn't have to work.  Saving lives through organ donation is an incredibly rewarding, and unique, opportunity.  Engaged and smart co-workers.  Engaged and caring management.  Excellent benefits, and a real focus on work/life balance.", "cons": "If you're looking to get rich, non-profit healthcare isn't the right place to look.  Long hours on call can be rough, if you're a glass half-empty type.  There's not a lot of room for upward movement within this agency, but experience in donation will open doors, nationally."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The Best Mission & the Best People", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Jul 2020", "job_title": "Family Support in Bellevue, WA", "duration": "N/A", "pros": "Being able to say you help save lives as your job is an incredible privilege and being part of an amazing team of people working for the same mission is a gift. This organization attracts dynamic, passionate people who care about improving life and health for others, all while taking care of each other. With so many opportunities to make a difference in the lives of donor families and recipients, LifeCenter is a great place to work if you hope to find meaning in your career and be inspired daily.", "cons": "If you're uncomfortable with change, you might not be a great fit. This organization is constantly growing and adapting and sometimes at quite a pace."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "So Happy!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Apr 2015", "job_title": "Anonymous Employee in Bellevue, WA", "duration": "N/A", "pros": "Love LifeCenter! I'm proud to be part of a staff that care about what we do and care about each other. I have never worked at a place where staff and management support each other on the level that we do here.\r\n\r\nManagement does their best to support the growth, development and overall health and well-being of the organization.\r\n\r\nAnd we get to be a part of making a difference to the world in helping people live longer, better quality lives. I plan to stay for a long time!", "cons": "We are nice, motivated and hard-working staff. These are the type of people we like to be and to work around."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Misguided goals.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Mar 2015", "job_title": "Administrative in Bellevue, WA", "duration": "N/A", "pros": "The goal of saving lives is simply amazing.  Knowing that every process, major or minor, helps in keeping someone's hope to life always a potential possibility.", "cons": "The process of saving lives is definitely not an easy task, a tedious, physically laborious task.  Its work schedules are punishing and understandably, unpredictable.  These factors easily affect work attitudes and approaches.  Unfortunately, there are people who have risen the ranks, have taken advantage of their positions and have disguised their acts behind the goals of the organization.  The workplace has become a political and power-struggle arena."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I love my job!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Mar 2015", "job_title": "Office Staff in Bellevue, WA", "duration": "N/A", "pros": "LifeCenter is a wonderful place to work. It feels great knowing that my contribution to the organization helps saves lives! \r\nManagement is supportive of my goals, interests, likes and dislikes. They take my opinions and suggestions seriously. The organization isn't too large - so I feel like my contributions really mean something.   \r\nThe hours are flexible, benefits are great, and PTO is extremely generous. \r\nEveryone genuinely seems to enjoy working here. People have fun and laugh together, even though the work we do is really tough.", "cons": "A lot of the employees work out of the main office, so the team environment can be different for different groups."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Values-driven organization with a collaborative, supportive atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jun 2016", "job_title": " in Bellevue, WA", "duration": "N/A", "pros": "LifeCenter is a mission focused non-profit comprised of compassionate, intellectual people.  Leadership is very supportive and dedicated to helping me realize my career potential, both within the organization, and beyond. Knowing my work is helping save lives, and help families find solace is incredibly meaningful.", "cons": "Because our service area is so large, and a large contingency of the staff works on-call schedules or irregular hours, I don't have much interaction with many of my coworkers. The collaboration is fantastic, but it can sometimes cause projects move slowly or loose momentum while waiting for feedback from other departments."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "LCNW = mission driven + fast paced + supportive coworkers", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Oct 2019", "job_title": "Director of Clinical & Family Services in Bellevue, WA", "duration": "N/A", "pros": "LCNW is the best place I have worked for a multitude of reasons. Two important factors for me are humility at the leadership level and transparency. I think that LCNW does the best job at these things that I have witnessed in the OPO industry thus far. I feel informed and empowered to inform others appropriately of upcoming changes, and I also am proud to work at a place that learns from its missteps and endeavors to do better next time. Everyone is hyper-aware that the work we do saves lives and impacts donor families forever, and everyone takes it incredibly seriously, as they should. We celebrate the wins, and we press forward to continually improve. I also feel incredibly connected and supported by my team, and I know that this is an organization I want to stay at until retirement. No job is perfect, but LCNW comes closer than any other place I have worked by providing inspiration every day, fun celebrations of the great work the team does, good benefits, small appreciations along the way, and a great team of colleagues to learn from, work with, and feel supported together.", "cons": "There is a lot of change, and because LCNW has a growth mindset, the organization is constantly reflecting on how we can do things better, which can feel really destabilizing for some people who do not adjust to change well. We work hard to implement change well, but it is definitely an area where we can do better. With this organization being larger and many employees working remotely, it can also feel challenging to feel as connected to your colleagues as you might at a workplace where everyone sees each other every day. Finally, this is hard work in general, because while we are inspired by the mission, it still  involves dealing with death and grief every day. It may not be the right fit for someone who struggles with finding resiliency in the face of difficult days."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great on-boarding experience and training!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Apr 2015", "job_title": "Hospital Development in Bellevue, WA", "duration": "N/A", "pros": "The enjoyment of the work/life balance!  I chose Life Center from other offers because of the schedule.  It allows me and my family to do maintain the active lifestyle we enjoy!", "cons": "The pay could be more, but the great benefits make up for it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Truly a company that cares about their employees. A great company!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Apr 2015", "job_title": "Anonymous Employee in Bellevue, WA", "duration": "N/A", "pros": "Great coworkers, fun environment, making a difference, living the mission, management that's open to feedback, training opportunities.", "cons": "Pay could be better, opportunities for advancement (smaller company)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Welcoming employer with incredible mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Oct 2019", "job_title": "Administrative Associate III in Bellevue, WA", "duration": "N/A", "pros": "- Coworkers\r\n- Mission \r\n- Benefits \r\n- Free parking", "cons": "- None!\r\nOne thing to know: the interview process consists of 3 steps which ensures that the employee is the right fit for the organization and I really respect that. Just something to prepare yourself for ahead of time - its well worth the time spent interviewing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "bellevue office", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Jul 2016", "job_title": "Desktop Support Engineer in Bellevue, WA", "duration": "N/A", "pros": "fruits and food often in the cafeteria\r\n-good mission statement\r\nup to date technology\r\nnice people\r\nnew / nice office building next to T Mobile in factoria.\r\nFree parking for employees\r\nlots of holiday PTO", "cons": "HR writes company email  of employee updates/fire/layoff to employees\r\nAll staff meeting were frequent then none at all\r\nlittle to no on-call pay\r\nNo Overtime hours available"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Mission, Great People", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jun 2016", "job_title": "Administrative Staff in Bellevue, WA", "duration": "N/A", "pros": "What I enjoy most about working at LifeCenter is the culture and community that we have in the office. I feel supported to reach my goals, and it feels great to know my contributions help save lives!", "cons": "Communication is difficult across regions."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Overall great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Oct 2020", "job_title": "Organ Recovery Coordinator in Seattle, WA", "duration": "N/A", "pros": "Great schedule and great people to work with.", "cons": "Job can be stressful and traumatic at times."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to grow your career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Mar 2018", "job_title": "Anonymous Employee in Bellevue, WA", "duration": "N/A", "pros": "passionate staff, important life-saving mission, modern office, great benefits", "cons": "a lot of remote staff so hard to get to know colleagues"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jun 2016", "job_title": "Hospital Development Program Manager in Anchorage, AK", "duration": "N/A", "pros": "Great leadership team, autonomy and a very positive work environment.", "cons": "Regional staff can feel a bit isolated."}]]