[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Support manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2017", "job_title": "Support Manager in North", "duration": "N/A", "pros": "I have worked for Affinity since 2011 after being Tuped over from a health authority. I feel that Affinity are totally focussed on giving the people supported a totally person centred approach and opportunities to grow and develop to be valued members of the community. Support staff are encouraged to use their own initiative to create good quality support plans alongside the people they support and are given management support to do so. The people supported and the staff know all the management team who all visit the houses on a regular basis which ensures we provide a personal service. Meetings are held regularly with senior managers to keep information current which is then passed down to support workers to ensure a high quality service. Staff are encouraged through 1 to 1 meetings to discuss new ideas and to ensure training is up to date to ensure skills are kept fresh and to look at areas people may be having difficulty in. I feel Affinity do what they say on the box which is to encourage people with a learning disability to pursue active and fulfilled lives. We have grown as a service in a short space of time nearly doubling in size in our area  due to reputation  and positive feedback of others.", "cons": "Sometimes work comes in faster than we can recruit staff, but we now have a rolling programme of recruitment"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great Organisation", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jan 2017", "job_title": "Support Manager in North", "duration": "N/A", "pros": "I love working for Affinity Trust!\r\nThe company is very supportive of it's staff, the training they offer is second to non.", "cons": "Paperwork and administrative tasks are excessive and scoring \"Green\" on data bases should not be put before supporting clients and staff"}], [], []]