[[{"date": "8 Mar 2023", "title": "Adjunct Lecturer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Fashion Institute of Technology", "Interview Descriptions": "Quick process and met with other professionals from the fashion stylist industry who had lectured there in the past or currently lecturing there. They also got back to me with details about an offer.", "Interview Questions": "What would I be surprised to know about you that isn't on your resume?"}, {"date": "27 Apr 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fashion Institute of Technology (New York, NY) in Jan 2022", "Interview Descriptions": "It was easy to understand what the role expectations were bit I didn’t started right away. There was a background check and the process took almost a month. However, the process was very straightforward.", "Interview Questions": "What hours are you available?"}, {"date": "27 Sept 2021", "title": "Social Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fashion Institute of Technology", "Interview Descriptions": "virtual interviews and required assignment (meaning, work for free) was a fairly typical process and worked with my schedule. all parties were very friendly After interviewing a candidate, interviewers need time to think more about a candidate and their employable qualities. Writing interview feedback allows interviewers to document everything they can remember, including first impressions or unique answers.", "Interview Questions": "Tell Me About Yourself.\r\nHow Did You Hear About This Position?\r\nWhy Do You Want to Work at This Company?\r\nWhy Do You Want This Job?\r\nWhy Should We Hire You?"}, {"date": "16 Jul 2021", "title": "Adjunst Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fashion Institute of Technology (New York, NY) in Nov 2020", "Interview Descriptions": "The interview took on Google Meet because of the Pendemic situation and took around 30 minutes. Two professors joined and asked the basic knowledges of printing technique, philosophy of teaching, and former teaching experiences. I asked them how many students will be joined and what printing equipments and facilities in printing room. I have to teach via online as Zoom or Google Meet because of school was not accept in-person teaching in a class at that time.  The mood of interview was good and nice.", "Interview Questions": "Q: Do you know how to prepare digital file for printing?\nQ: How many students were in your former class/classes?\nQ: Can you set up the printing equiment at your home?"}, {"date": "22 Jun 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Fashion Institute of Technology (New York, NY) in Mar 2020", "Interview Descriptions": "You first have a group interview, which you complete an activity with other applicants and are observed by staff members. If you are selected for the next round, you then have an individual interview. All candidates are then invited to a candidate social to meet other staff members and applicants.", "Interview Questions": "Q: What is your proudest accomplishment?"}, {"date": "15 Jul 2019", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Fashion Institute of Technology", "Interview Descriptions": "Very Long process and very poorly managed. They left a job open for a very long time and I did not hear back for several months. They were not able to give firm timeline on when they wanted to hire by.", "Interview Questions": "Why do you want this job?"}, {"date": "4 Sept 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Fashion Institute of Technology (New York, NY) in Mar 2019", "Interview Descriptions": "A lot of people interviewed for position, very competitive. If you believe in yourself then you will be good to go. Be prepared an know everything about diversity and how you plan to implement change", "Interview Questions": "what does diversity mean to you"}, {"date": "27 Jan 2020", "title": "Director, Career Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Fashion Institute of Technology (New York, NY) in Mar 2019", "Interview Descriptions": "Submitting an application was straightforward. The program is user-friendly. The actual interview with the hiring manager was thought-provoking. The hiring manager wanted to ensure that the \"best fit\" candidate was selected.", "Interview Questions": "How do you prioritize your role as a manager? "}, {"date": "1 Mar 2018", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Fashion Institute of Technology (New York, NY) in Feb 2018", "Interview Descriptions": "Phone interview with search committee with reporting supervisor and 3  other staff members seemingly unrelated to the position but pleasant.  Generic questions that were pretty broad, not specific to the position.  Interviewed in February but was told that second rounds will not take place until April with the start dates in June/ July (?!?!).  Apparently the position was intended to be filled in the fall but was reposted.  Not sure whether I'll be moving forward as a candidate but it seems odd to have such an open/ extensive timeline for mid-level, Student Affairs role with a delayed start date.  Have a hunch that an internal candidate has already been selected and the posting is just a \"technicality\".", "Interview Questions": "(Why are you interested in this position? Describe your managerial style?  Describe your communications  style/ opinion on e-mail correspondences? What's your ideal work environment?  Most challenging part of your last job?"}, {"date": "29 May 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at Fashion Institute of Technology (New York, NY) in Jan 2018", "Interview Descriptions": "The full process took 9 months, from my initial application to my start date. I had 4-5 interviews, one of which was a panel interview with 14, yes 14, people. The Dean who interviewed me 1:1 wouldn’t even make eye contact with me. I later found out he didn’t want to hire me. The President of the college cancelled her interview with me at the last moment, as I was sitting in the waiting area. Made this job work for me until I got tenure, and then quickly left for a private corporation. Never looking back.", "Interview Questions": "Multiple part questions, all pre-approved and not responsive or personalized to me. Typical SUNY. "}], [{"date": "28 Dec 2017", "title": "Classroom Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Fashion Institute of Technology (New York, NY) in Oct 2017", "Interview Descriptions": "There were three members who interviewed me. Each interviewer asked a different question to determine technical skill sets and management of camera operation. The questions were technical about equipment and less about teaching or management of a classroom environment with students. The interview lasted 30 minutes.", "Interview Questions": "They asked about specific skill sets and how recent were these skills used. They also asked about technical knowledge of various equipment related to the position. The emphasis was operating multi-cameras."}, {"date": "11 Sept 2017", "title": "Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Fashion Institute of Technology (New York, NY) in Sept 2016", "Interview Descriptions": "Very quick and easy. I would definitely recommend the job to any students (freshmen especially) who want to make money on the side when they're not in class or already at a part-time job", "Interview Questions": "What do you know about our program?"}, {"date": "30 Apr 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fashion Institute of Technology (New York, NY)", "Interview Descriptions": "Was called in for two rounds of interviews, both were short and sweet but stayed within the tradition \"interview questions\" rather than diving any deeper. The process was longer than expected for a position that demanded an immediate hire, and the first round interviewers were not in the positions of authority I expected of the first meeting.", "Interview Questions": "What do you look for in a team/coworkers?"}, {"date": "5 Jul 2016", "title": "Associate Director, Residence Life Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fashion Institute of Technology in Feb 2016", "Interview Descriptions": "The HR representative offered me a 30-minute in person interview with the search committee.  As I did not live in NYC (I'm from PA), I requested if I could have a phone or Skype interview.  The HR rep told me that they would consult with the search committee.  The next day, I was informed that the committee was only conducting in-person interviews.  I then inquired about travel reimbursements, to which HR stated that anything within a 120 mile radius of the campus is considered local, so there is no reimbursement.  I declined the interview, because it was not worth the time or money to travel to NYC at my expense for a 30 minute interview.  In this field, this is highly unusual, and most first-round interviews are on the phone/Skype, and overall I felt that it was a testament to the institution's lack of desire to attract good candidates who are not from th NYC area.", "Interview Questions": "Would I be willing to come to NYC for a 30-minute interview (phone/Skype interview not permitted)."}, {"date": "16 Mar 2017", "title": "Assistant Media Manager (Museum) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Fashion Institute of Technology (New York, NY) in Nov 2015", "Interview Descriptions": "Applied in October, interviewed in November, rejected in December. Interviewer accused me of lying about skills that I never claimed I had (did not state on my resume or cover letter, never mentioned supposed experience with that skill at any point in the interview). Was thoroughly humiliated in front of higher ups. Completely unprofessional behavior.", "Interview Questions": "What experience do you have with HTML and CSS?"}, {"date": "31 Jul 2015", "title": "Communication Design Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fashion Institute of Technology (New York, NY)", "Interview Descriptions": "Went through my portfolio. Took the time to go through each piece. Asked a few questions about my process and what kind of experience I had (school etc.) Also asked questions non portfolio related to get to know what kind of person I was. Very personal and professional", "Interview Questions": "What was my process?"}, {"date": "3 Jun 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Fashion Institute of Technology (New York, NY) in Feb 2015", "Interview Descriptions": "Multiple interviews with panel, one on one and emails. HR very involved in screening and vetting, it made it challenging as they were not always responsive and delayed the process considerably.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "11 Jul 2016", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fashion Institute of Technology (New York, NY) in Sept 2014", "Interview Descriptions": "Very informal. Candidates are asked to submit a writing sample. One-on-one interview with the director. Questions about experience and working as a tutor before. Interview was not difficult. Cover letter and resume are required.", "Interview Questions": "How would you handle a student who didn't want to work with you?"}, {"date": "16 Jan 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fashion Institute of Technology (New York, NY) in Jul 2014", "Interview Descriptions": "i get call in for an interview and the main supervisor was the one i meet with. the office was busy but he made time to speack with me. he was very nice an talked with a kide voice.", "Interview Questions": " he asked how offten you were late to work in the last six months i told him 3. he asked about call out i said very really."}, {"date": "29 Apr 2016", "title": "Student Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Fashion Institute of Technology (New York, NY) in May 2014", "Interview Descriptions": "Drop off resume and chat with manager casually about availability and experience with printing. Followed up every few days to make sure I wasn't forgotten and was very friendly do the other staff there.", "Interview Questions": "Do you have any experience with printing?"}], [{"date": "23 Apr 2013", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Fashion Institute of Technology", "Interview Descriptions": "There are two steps to the interview process- the individual interview and the group interview. The individual interview is pretty straightforward. You interview with several different people, including building managers, resident councilors, and current RAs. Make sure to show that you care about campus/community involvement. Mention past volunteer work, school clubs, etc. \r\nDuring the group interview, you will be monitored while you complete a bunch of group tasks. Just try to show that you're a team player- make eye contact, show good listening skills, be willing to take a leadership position or follow someone else's lead.", "Interview Questions": "What would you do if you had to enforce a residential life policy you didn't agree with? "}, {"date": "14 Jul 2011", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fashion Institute of Technology (New York, NY) in Mar 2011", "Interview Descriptions": "Scheduling the interview spanned a few days but it was finally conducted over Skype and lasted about 45 minutes. The questions were scenario and problem solving oriented, a few additional questions were directed at the perception of myself by my previous co-workers, and individuals in other relevant circles. \r\nThey sent me a document after the interview asking me to write a memo for an upcoming meeting, the instructions sated that I send it send it back when it was completed. I gathered a week later 2nd that I did not send the document back within the specified time. The problem was the time was not specified. I had sent it back after 1.30 minutes.", "Interview Questions": "How would you handle multiple problems, printer broken, supervisor needs a document printed now, Dean calling to speak with supervisor, and student needs information to register."}, {"date": "3 Sept 2012", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fashion Institute of Technology (New York, NY) in Sept 2008", "Interview Descriptions": "One (very long) interview that incorporated a battery of tests in HR on things like customer service, Word and Excel - completely useless and not particularly related to the actual job. The in-person interview was about 20 minutes with all the expected questions. The interviewers were very open and descriptive (and ultimately accurate) of the different aspects of the job.", "Interview Questions": "Nothing that you wouldn't expect - questions about previous job experience, challenging situations, and some hypothetical situations."}]]