[[{"date": "28 Feb 2023", "title": "Lab Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at North East Medical Services", "Interview Descriptions": "Phone screen and then in person interview with manager and supervisor. The application process to getting an offer took only three weeks. Interview only went on about 20 minutes and was a review of my resume.", "Interview Questions": "Why am I interested in this position."}, {"date": "21 Feb 2023", "title": "Grant Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North East Medical Services", "Interview Descriptions": "After filling out the online application portal, a recruiter from the organization contacted me. After going over some details with the recruiter, I had to do an interview with the manager and director I would be working with.", "Interview Questions": "What relevant experience do you have with grant writing?"}, {"date": "5 Dec 2022", "title": "Community Relations Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North East Medical Services (Daly City, CA) in Nov 2022", "Interview Descriptions": "The entire process from application to decision took about a month. I scheduled a phone screen with a recruiter and was asked about my background, reasons for interest in the organization and position, and if I was okay with the salary range for the position. The next interview was with the hiring manager and lasted about an hour. During the hour, I was asked an array of questions, some of which seemed off-topic or out of the blue and some of which related to the responsibilities for the role. The final interview was with a member of the community affairs team. Prior to the interview, I overheard the recruiter and team member talking about what experience the team member had with interviewing. The interview was normal enough however and only lasted about half an hour. Of the two interviews, the interview with the hiring manager was much more helpful in understanding what the role entailed and what they expected from a candidate. All in all, I would rate my experience okay with some minor quirks. I appreciated how responsive the recruiter was.", "Interview Questions": "What experience do you have working with the community?"}, {"date": "17 Dec 2021", "title": "Operations Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at North East Medical Services (Daly City, CA) in Dec 2021", "Interview Descriptions": "TERRIBLE experience and plenty of red flags here that should be enough to tell anyone to RUN from this organization. \n\n-Recruiter was unprofessional (>15 minutes late each time to our calls without so much as an apology,) did not even bother doing any research on the candidate based on lack of insightful questions asked, and clearly did not know anything about the organization or its history (ironically, I knew more than her because I did my research.) Also, she could not answer basic questions about the position and said she’d “get back to me.” She was unprepared for the interview and it showed. \n-I shrugged the above off at the time and still proceeded with an on site interview with the hiring manager and felt we had a good conversation \n-Then, I received my first offer, which was on the lower end of the salary range that the recruiter shared with me. When I inquired to see if there was room to negotiate since I had the experience and the skillset, they said yes, but their counter was still not near the number I wanted to be. I inquired if there were any more wiggle room for the number I wanted, and again, the recruiter said yes and she’d get back to me. Imagine my surprise when she called me back and then revealed to me, “Sorry, we looked into our budget and we don’t even have room for the two higher numbers.  Also, we’re rescinding our original offer.” \n\nThis company/recruiter wasted my time by entertaining the idea of negotiating and then pulled the rug from under me at the very last minute. It’s apparent that they just wanted someone to take the position for less money. This is enough to tell anyone to RUN from this organization. They’re not looking to hire the BEST talent, just the CHEAPEST ones.", "Interview Questions": "What do you know about our organization?"}, {"date": "9 Nov 2021", "title": "Utilization Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North East Medical Services (Daly City, CA) in Nov 2021", "Interview Descriptions": "**I have not heard back from them yet. So I am not sure will I get an offer or not. **\r\n\r\nSo it took me quite a while to proceed from phone interview to in person interview. All I need to do is wait for their calls. \r\nThe interview was long. The first hour, I was asked to type answers to several questions. Then, I was interviewed  by two people. \r\nThe total interview time lasts about 1.5 - 2 hours long.", "Interview Questions": "What do you know about our company? \r\n\r\nWhat values of our company are important to you?\r\n\r\nScenario questions\r\n\r\nWhat does failures mean to you? \r\n\r\nWhat skills do you learn from your last job that can be applied to your new position? \r\n\r\nHow do you build trust among coworkers? \r\n\r\nHow do you stay organized? \r\n\r\nDo you know anyone who works in our company?"}, {"date": "17 Mar 2021", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at North East Medical Services (San Francisco, CA)", "Interview Descriptions": "White majority human resources team. Each of the interviewers encountered from bottom to top was white. This is a company that serves the social economically challenged minority groups with language barriers.", "Interview Questions": "Tell me about yourself"}, {"date": "18 Nov 2020", "title": "Clinic Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North East Medical Services (San Francisco, CA) in Oct 2020", "Interview Descriptions": "Only had one interview which was a brief phone screen that lasted about 15-20 minutes (e.g asked simple interview questions and quick introductions) The person I spoke with stated that she'd get back to me in a few days but I've never heard back.", "Interview Questions": "Tell me about yourself?\nHow did you hear about us?\nWhat do you know about NEMS?"}, {"date": "21 Nov 2022", "title": "Medical Referral Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at North East Medical Services (San Jose, CA) in May 2019", "Interview Descriptions": "There are two rounds of the interview. The first one is the phone interview with the recruiter. If they are interested in you, you will get a second interview with the hiring manager on site. Both interviews are about 30 minutes long. Most questions are common interview questions and some behavioral questions.", "Interview Questions": "What do you learn about our company? What’s your short-term goal and long-term goal? What do you want to achieve? How do you handle conflict among colleagues?"}, {"date": "1 Dec 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at North East Medical Services", "Interview Descriptions": "First they will call you for a brief phone interview. if they are interested in you, you will come in for group interview. It will last around an hour where they ask you different kinds of questions in the related position.", "Interview Questions": "Why should we hire you"}, {"date": "14 Aug 2018", "title": "Health Education Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North East Medical Services", "Interview Descriptions": "The interview was straightforward with two interviewers who were Health Education Coordinators/Registered Nurse. It was a formal interview and started with some situational questions about relationship and communication between co-workers and supervisors. They moved on to discussing experience from resume and cover letter.  They also conducted a short Chinese test at the end where you translate a paragraph from English to Chinese.", "Interview Questions": "What qualities or goals do you have that can further the organization's mission or goals?"}], [{"date": "11 Jun 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at North East Medical Services (San Francisco, CA) in Jun 2018", "Interview Descriptions": "The interview process is pretty straightforward and simple. There are three levels of interviews. However, if possible, they tried to group all the on-site interview sessions into one day hence the interviewee only need to attend one onsite meeting.", "Interview Questions": "What is the biggest mistake you made in the past year?"}, {"date": "29 Jul 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North East Medical Services (San Francisco, CA) in Sept 2017", "Interview Descriptions": "received a call from HR first, then met with the RN team lead on my second interview. Last got a chance to meet with the clinic manager on the final interview.", "Interview Questions": "What are your strength and weakness?"}, {"date": "24 Jun 2017", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at North East Medical Services", "Interview Descriptions": "Very easy-going and like a conversation. They only want to know who you are and your experience that is relevant to the position and/or how it shaped you as a person.", "Interview Questions": "What previous experiences that you have do you think would help you in this position?"}, {"date": "20 Jun 2017", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at North East Medical Services", "Interview Descriptions": "Recruiter contact and scheduled for an interview. Interviewer unprepared and unprofessional. Stated that s/he did not want to interview for position. Shouldn't have wasted my time if they were not even interested in hiring.", "Interview Questions": "Tell me about your resume."}, {"date": "11 Feb 2017", "title": "Provider Relations Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at North East Medical Services", "Interview Descriptions": "First there's a phone screen where they mainly ask questions about your resume. Then they contact the hiring managers and may potentially offer you another position. If the hiring manager is interested in hiring you, there will be a one on one interview.", "Interview Questions": "Simply asked questions on resume. "}, {"date": "25 Oct 2017", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at North East Medical Services (San Francisco, CA) in Jan 2017", "Interview Descriptions": "Met with COO in a room. Very laid back, informal, interview, more of a conversation about the industry and sharing experiences.  \"Interview\" lasted about 45 min. Was shown facilities.", "Interview Questions": "Tell me about yourself ... What sort of things did you do in your last couple of jobs?"}, {"date": "29 Mar 2016", "title": "Behavioral Health Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at North East Medical Services (San Francisco, CA) in Dec 2015", "Interview Descriptions": "Phone interview and panel interview after you pass the phone interview. There were two MDs and one LCSW interview the candidate. There were leading interview questions. Whether you agree or disagree, you won't be able to give good answers. The interview time was about 45 minutes to one hr. I did not have good impression about the interview and the interview questions.", "Interview Questions": "Do you think that the employees in the clinic should break the agency policy?"}, {"date": "24 Sept 2015", "title": "Front Desk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at North East Medical Services (San Francisco, CA) in Sept 2015", "Interview Descriptions": "A lady call after I applied online, this phone interview is asking the general question. It is take about 20 mins, and then she told me the HR will notice me there decision, but after 3 weeks, I still didn't hear back form them.", "Interview Questions": "What is your current job? Why do you looking for new job?"}, {"date": "14 Aug 2015", "title": "Health Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at North East Medical Services (San Francisco, CA) in Jun 2014", "Interview Descriptions": "It was a quick interview with the person in charge of the Health Education department. They asked me the typical questions such as strength, weakness, and tested my Chinese as it was one of the qualifications required for the position.", "Interview Questions": "They said they had a Health promotion week about 3 months from the day I had my interview and asked me what type of game would I suggest they play in order to educate the patients."}]]