[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent, Positive Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Oct 2019", "job_title": "Project Manager in Washington, DC", "duration": "N/A", "pros": "NQF is in a major period of growth and putting together new processes, procedures, and programs. I've worked here for a little over a year and have enjoyed my team and the executive team. Everyone works hard to have positive interactions focused on progress and benefit to the overall goals of a project and the company. My team has a very collaborative, supportive atmosphere, and I feel comfortable asking questions and making it clear where I see areas for infrastructural changes. They are very focused on professional development and giving opportunities for interactions with the executive team for visibility and progression. The CEO is also kind and transparent in a way I've never seen an executive behave before. All of my interactions with him have been positive. At the end of the day, he's running a business, but you can tell he's very invested in his staff and their well-being. This company is also very supportive of personal and mental health, and they strongly encourage appropriate work-life balance.", "cons": "NQF is undergoing some structural changes that include some growing pains in some departments."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Supportive, Flexible, and Agile", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 May 2023", "job_title": "Manager in Washington, DC", "duration": "N/A", "pros": "Consistently impressed by my colleagues' dedication, kindness, supportiveness, and interest in what others have to say. CEO is forward thinking, driven, and dedicated to the mission of improving health care quality and equity. Staff are not afraid to dream big and tackle big problems head on. A cultural shift for the better is noticeable in the last few years. I don't believe any of the reviews prior to 2020 are accurate anymore because of all of these changes.", "cons": "The work is changing in nature and will take some time to settle. A startup mindset is encouraged--it's not for me but some may like that. You will have to be comfortable learning on the job, but that is in the nature of health care. The work is challenging and requires creativity, flexibility, and a willingness to learn something new each day."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good entry level job", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Mar 2023", "job_title": "Analyst in Washington, DC", "duration": "N/A", "pros": "lots of experience, work/life balance, flexible hours, vacation/sick/personal time, great people to interact with", "cons": "instability of retention, work outside normal work hours"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Nice company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Feb 2023", "job_title": "Analyst in Washington, DC", "duration": "N/A", "pros": "Great work/life balance nice to work from home", "cons": "Contracted work funding concerns are an issue"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Very collaborative", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Oct 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "NQF is an incredibly collaborative environment. It can be a difficult topic to understand if you're not in the quality measurement field, but everyone goes out of their way to help. Staff are very helpful and give you their time to answer questions or help you in any way they can. \n\nBenefits are great.", "cons": "It's a busy place to work depending on which department you're in. Sr. Management understands this and is working to improve the work environment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Heading towards the right direction", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Mar 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "There is passion in every employee in the organization. Everyone is eager to help each other out and contribute to the mission. There is a wealth of knowledge in the employees from Analysts to VP’s.", "cons": "Junior staff can be underutilized and often used for too many mundane admin work"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "3/10 stars would not recommend. Promotes exclusion with cliques.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 Mar 2021", "job_title": "Project Manager in Washington, DC", "duration": "N/A", "pros": "Health insurance, full vesting after a year, assigned a laptop for use to take home when they push you to take work home and work after hours (don't worry, you won't be recognized for your work). Extremely diverse staff with varying cultural backgrounds. Clean and mostly efficient technology, that is usually up to date.", "cons": "At NQF you have to be in the IN crown to progress. They promote at whim and have no exact path for receiving a promotion that one should follow. In the latest round of promotions, they promoted folks they use as pawns. People were promoted to Director and Manager who hadn't put in work or shown that they should be put in such a position.\r\n\r\nI asked for clear directives about how to receive a promotion and was passed up by people who were not in the organization for over a year. When I was finally promoted, not even my manager could tell me what I did to receive the promotion when I inquired. I asked because I wanted to continue on the same path in order to continue moving up, my manager informed me that I should \"just be grateful for the advance and not worry about the why.\"\r\n\r\nThe end of year reviews are based on September (at best) to November and not January to November. Nothing you are praised about in the start of the year will be present in your end of year review. If you are lucky enough to receive a warning before they give you the axe, it is never written, and it is always final. NQF's HR department put people on Performance Improvement Plans because someone told them to do so, not because the employee actually needs a behavioral change - like a child's timeout.\r\n\r\nSpeaking of HR, NQF outsources their HUMAN Resources. How can the HR department support the organization or staff if they have no connections to the staff themselves. The HR is a group of randoms who are yes-men to the Senior Leadership.\r\n\r\nI worked at NQF for over 5 years and was only promoted to save face. They do not appreciate the employees they have and would rather promote unhappy employees than to address morale issues.\r\n\r\nAfter the most recent round of layoffs in 2019 - morale dropped even lower than it was and most of the senior staff left without notice after all of their support was pushed out. NQF Executive team should think on an elementary level how their actions effect their organization, staff, committees, community. You can't expect a great office attitude when you've gotten rid of all the support staff and then lied to those that remain about why and how the decision was made.\r\n\r\nTo make an active decision to work in such a harsh, cliquey, unsupportive and strict environment is to cut off your leg just to feed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Decent Company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jun 2021", "job_title": "Management Team Member in Washington, DC", "duration": "N/A", "pros": "Great benefits. Offer Flexible hours.", "cons": "Could improve the diversity of the Board."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Rocky times now, but better times are coming!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 May 2018", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "-Intelligent and dedicated programmatic staff\r\n-Good benefits\r\n-Leadership is truly dedicated to changing NQF for the better. I sincerely believe and see how much they support the mission and how hard they are trying to address the organization's challenges and set it up for success moving forward. \r\n-NQF is currently hiring and building up program staff to support NQF's expanding work\r\n-NQF is looking for ways to be more operationally efficient and effective, in order to better support programmatic work", "cons": "-A lot of organizational change has been happening over the past year or two, which is hard and can affect morale in the short term\r\n-NQF historically relied heavily on government funding, did not change and innovate at the same pace as changes in the healthcare environment over time, and became too operations heavy and inefficient. This has put the organization in a very difficult place (though leadership is addressing these challenges)\r\n-Communication and transparency were also very limited prior to the recent couple of years (but that is changing now)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great for early career", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Feb 2021", "job_title": "Director in Washington, DC", "duration": "N/A", "pros": "Exposure to leaders in healthcare", "cons": "Growth opportunities are limited particularly for those with advanced degrees/training"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Run away and don't look back", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Oct 2019", "job_title": "Project Manager in Washington, DC", "duration": "N/A", "pros": "-Intelligent and knowledgeable staff on projects\r\n-Diverse staff\r\n-Flexible hours\r\n-Good benefits", "cons": "-Incompetent executive leadership team \r\n-Members of the senior/executive leadership team do NOT value staff. Staff have extremely low morale (especially compared to past years). This is a toxic work environment and culture of fear perpetuated by leadership. \r\n-Lack of transparency & communication within the organization\r\n-No adequate training provided to newer staff\r\n-Bullying culture\r\n-No support or guidance from supervisors (QM dept.)\r\n-Work/life balance is not encouraged \r\n-Extremely high turnover rate\r\n-Dated technology/software\r\n-Lack of support and resolution of issues \r\n-HR team is heavily influenced by the CFOO & other executive team members. For that reason, you can't really trust them.\r\n-Lack of diversity in funding\r\n-Unfortunately, you cannot trust senior/executive leadership. They do not have the best interest of their employees. Many staff members have voiced their concerns over the past few years. Some concerns include: under staffed projects, lack of promotion opportunities (even when promised), lack of support from supervisors, culture of fear,  lack of transparency, little consideration of staff interests around particular subject matter/projects, etc.\r\n\r\nOne last thing, many employees in the Quality Measurement department are not supported by their supervisor. There is no meaningful discussion around growth/performance,  resolution of issues, and overall understanding. This has been an issue for quite some time, but once again, no improvements have been made."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Just ok", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Mar 2021", "job_title": "Senior Director, Quality Measurement in Washington, DC", "duration": "N/A", "pros": "Decent pay and benefits with moderate work-life balance.", "cons": "Lack of real, qualified leadership."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Smart staff, poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Jan 2012", "job_title": " in Washington, DC", "duration": "N/A", "pros": "Great mission\r\nGet to work with brilliant people - both co-workers and people in the healthcare industry\r\nExcellent benefits\r\nConvenient location downtown", "cons": "Inexperienced, unaware, overworked management\r\nGrowing pains as it evolves from small nonprofit to larger entity based on HHS contracts\r\nInconsistent, top-down communication"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "RUN FAST and definitely don’t look back", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Oct 2019", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "quality measurement staff, interesting work", "cons": "Totally agree with the previous “run as fast as you can” reviews. \n\nThe CEO is at minimum, incompetent, and has surrounded himself with equally incompetent people. He does not value NQF staff and has said numerous times that they can be replaced with anyone off the street. \n\nHR is nonexistent; a contractor that works for the CFOO and gets defensive during exit interviews when asking for feedback is not a substitute for an effective HR department. \n\nLeadership claims to be transparent but the reality is they are clouded in secrecy, scams, and lies. Asking staff to complete satisfaction surveys yet never providing the results because you don’t like them does not demonstrate transparency. Telling staff that the organization is making financial cuts and taking away resources yet ordering Italian tile for the new office kitchen sounds like a scam and an irresponsible way to spend taxpayer money."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Manager", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 May 2018", "job_title": "Manager in Washington, DC", "duration": "N/A", "pros": "Good location\nGood benefits\nComparably good salary.\nWhen CEO leaves hopefully the NQF mission can help people as it is intended.", "cons": "Bullying tactics.\nUninvolved/impersonal CEO.\nCFOO with a severe God complex, and absolutely no professionalism. \nFocus solely on padding Executives pockets with exorbitantly large bonuses.\nLosing the mission of NQF’s amazing work. \nLack of any confidentiality.\nExecutive team that cares nothing about the staff.\nLowest moral in years.\nHiring new puppet team that lacks experience and knowledge of position hired to do."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great Place to Start Out, Not to Settle Into", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Apr 2017", "job_title": "Project Manager in Washington, DC", "duration": "N/A", "pros": "On the surface this place seems very appealing. The benefits are great, it's in a really affluent and fun part of DC close to the National Mall with a lot of food options. 2-3 blocks walk from two metro stops. People are generally friendly and almost everyone you work with is competent and passionate about healthcare. Will hire people with very little experience if you're likable. They will help pay for continuing education and additional classes or conferences you may want to attend. Two years here is like 5 anywhere else because of the pace and workload so you will learn a ton in a short amount of time.", "cons": "They say they encourage work/life balance and offer a lot of leave plus flextime. However, this wholly depends on who your manager is. You may get lucky and have someone who likes you, but if you don't your options are limited. Managers do not seem to be trained to manage people and are busy with their own work so they usually barely have time for you. You are also expected to have your email and calendar on your phone and be checking these even during off-work hours. Favoritism is rampant here. It's not noticeable if you're a favorite, but if you make a mistake you'll fall from grace and notice it. Even though you work on teams, there isn't team mentality and there's a blame culture here. There is also a very high rate of turnover. In my experience, the reasons people left were because of ethics, high stress, and the inability to handle the micromanagement and multiple layers. If you want to work here, stay and learn and then get out. Make the best of it. Make sure to keep everything in writing and confirm all verbal conversations with a follow-up email.  The pay is lower than other organizations in the health field in DC even when you account for the nonprofit status."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Love it or leave it?", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Jul 2019", "job_title": "Senior Manager in Washington, DC", "duration": "N/A", "pros": "An organization with an important mission: improving health care and health by following the scientific evidence.  Staff dedicated to the mission.\r\nCompany-sponsored happy hours, team building and social activities, and recognition programs. Excellent pay and b benefits.", "cons": "Workaholic culture with unbelievable  work-life balance messaging. \r\nMission is transforming but unclear to what: non-profit consulting firm open to corporate influence or neutral convener of health care stakeholders building consensus and applying science to improve quality of health care?\r\nGeneral lack of confidence and trust in senior leadership.\r\nRoughly 60% staff turnover in past couple years, some voluntary and some not."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Highly visible and important organization", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Aug 2017", "job_title": "Senior Project Manager in Washington, DC", "duration": "N/A", "pros": "Smart people dedicated to improving the health care system. Good benefits. Friendly culture. A lot of opportunities to learn. Many opportunities to network with experts and leaders in the health care industry. High performers are rewarded.", "cons": "Constantly changing (for the good mostly but difficult on staff).        Workload can be very high at times. Learning curve is a year or more because of highly technical work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Run Away and Don't Look Back Review Completely Accurate!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Oct 2019", "job_title": "Manager in Washington, DC", "duration": "N/A", "pros": "Intelligent, hardworking staff, good benefits", "cons": "Everything mentioned in the Run Away and Don't Look Back Review is accurate.  NQF Leadership's response on 10/19/2019 only pertains to a select group of people - the Quality Innovation team, very few of the Quality Measurement team, and the senior management group.  The concerns raised in previous reviews have not been addressed by the senior management team.  In fact, they respond to most people's concerns by saying that if people don't like it, then they can leave.  This has been stated numerous times by the CEO and a few others.  Instead of addressing the many concerns about the CFOO, who in fact treats most people in a bullying manner and with complete disrespect, the CEO has chosen to ignore the information.  The CFOO employs a CYA strategy every minute of the day.  The senior team has tried to implement some measures to help the low morale problem, but a few raffles won't solve the problem when management team members only care about themselves and those who they view most favorably.  Any growth at NQF is reserved for the QI team and select people from the QM team .  Also, regarding the outsourced Human Resources staff, they main person has shown over and over again that she will act only as the CFOO desires.  As stated before, a number of concerns have been raised about the CFOO and his behavior, but each time she has shown her complete allegiance to him.  NQF is also suffering because rather than admit that many of senior management don't have the skills necessary to run  various aspects of the company, they act like the staff is the problem.  The fact that NQF has only one main source of funding is a concern too.  What happens if the one main source of funding decides to reduce the amount given to NQF? Departments are already short staffed. NQF's response that they hold true to their values of collaboration, leadership, passion, excellence, and integrity is completely untrue."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to support an important mission", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Dec 2019", "job_title": "Senior Director in Washington, DC", "duration": "N/A", "pros": "NQF is a great place to grow professionally and have ample opportunity to shape the nation's health and healthcare for the better. I work with a great team and have engaged with an impressive array of thought leaders in healthcare.", "cons": "The administrative/operational tasks are substantial at times, particularly for such a small organization."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good organization, but may not be able to stay current", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Apr 2016", "job_title": "Project Manager in Washington, DC", "duration": "N/A", "pros": "smart people who are committed to improving health care quality", "cons": "not really run like a business. needs to expand scope to stay relevant and competitive\r\nlots of attention paid to various initiatives to improve process, communications and opportunities for employees, but no follow through"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Dec 2017", "job_title": "Administrative Assistant in Washington, DC", "duration": "N/A", "pros": "Good benefits,  solid company with great purpose and so many chances to move up.", "cons": "As an administrative assistant when I was there the set up was a huge issue. I didn't like the administrative coordinator as there was loads of micromanaging on such small issues. I can't speak if that's changed or not."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "mid-level management", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Aug 2015", "job_title": " in Washington, DC", "duration": "N/A", "pros": "Work life balance\r\nSalary and benefits\r\nCommuting ease\r\nFlexible schedule", "cons": "Lack of accountability, vision and morale;\r\nOrganization floundering to find it's relevance in a changing landscape; \r\nDysfunctional management; \r\nTop heavy structure and promotion qualifications vary widely across organization and supervisor"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": "N/A", "review_title": "Doing important work", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Sept 2020", "job_title": "Senior Director in Washington, DC", "duration": "N/A", "pros": "Mission-driven, smart people, great compensation", "cons": "Too much change, not enough time for the amount of work"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Organization in transition", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Sept 2020", "job_title": "Manager in Washington, DC", "duration": "N/A", "pros": "Great colleagues outside of management", "cons": "Managements vision not quiet clear too much turnover"}]]