[[{"date": "25 May 2023", "title": "Senior Insight Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "2 rounds of interview, second round lasting 2.5 hours. 1 hour HR and 1.5 hour technical. Was given Excel and coding test to complete in 20 minutes, each followed by questions afterwards. They seem to interview for the sake of it even though they know they don’t intend to make offer! Why to technically test someone with a decade of experience on basic Excel?!?!", "Interview Questions": "What was my role in the projects I completed in the past? What I do if I have clashing deadlines."}, {"date": "12 May 2023", "title": "Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Hull, England) in May 2023", "Interview Descriptions": "Very friendly interviewer, made me feel at ease. Interview was relaxed, friendly and very enjoyable. Questions were competency based and easy to answer because of the structure of the questions that were asked.", "Interview Questions": "What relevant experience could I bring to this role"}, {"date": "16 Jul 2023", "title": "Senior Campaigns Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (London, England) in May 2023", "Interview Descriptions": "Firstly I had to do an online written test, preparing an email to campaigners about the Age UK's latest report about social care. The second stage was an online interview, and I got the questions sent to me 24 hours in advance.", "Interview Questions": "Why do you want the role of Senior Campaigns Officer at Age UK? What strengths could you bring? Please could you describe a campaign you have helped to deliver and what you learnt from it that you would apply to this role? Tell us how during that campaign or another you successfully used digital campaigning?"}, {"date": "10 Feb 2023", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Blackpool, England) in Feb 2023", "Interview Descriptions": "Introductions and was asked to describe myself e.g. previous roles, hobbies and interests. I was asked questions about dealing with awkward situations overcoming problems at work and outcomes also managing my time and how I would cope with large volumes of phone calls and much more.", "Interview Questions": "How would I deal with a angry customer"}, {"date": "14 Feb 2023", "title": "Programme Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Age UK (The National Charity) (London, England) in Feb 2023", "Interview Descriptions": "It felt like a normal conversation. Lots of information was provided about the role before and during the interview. Both interviewers were very friendly and allowed me to express myself in the best way possible.", "Interview Questions": "Competency-based questions about the skills needed for the role, as well as industry some questions."}, {"date": "16 Feb 2023", "title": "Dementia Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) in Feb 2023", "Interview Descriptions": "The interview proccess was respectful and quick. the questions were relevant and probing. The panel allowed reflextion as well as repeated the questions for clearity. The panel asked for clearificcation when required or asked to elaberate on my answer.", "Interview Questions": "was aksed to explain how I supported a Person with dementia their carers and family"}, {"date": "9 Feb 2023", "title": "Customer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Age UK (The National Charity) (Blackpool, England) in Feb 2023", "Interview Descriptions": "2 teams meetings. The first is an “informal chat” some questions and a bit about the role, the second is more formal and with two people, further questions and a test.", "Interview Questions": "Why would you like the job?"}, {"date": "15 May 2023", "title": "Programme Support Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (London, England) in Jan 2023", "Interview Descriptions": "2 of 3 interviewers were unpleasant and created an uncomfortable atmosphere during the interview. One made the odd unpleasant comment whilst the other smirked. The line manager didn’t appear to be a great listener and the whole experienced comfirmed what I had read on glassdoor in advance of the interview. Didn’t get back to me within agreed time and had to be chased. All around a negative experience", "Interview Questions": "What I knew about the company"}, {"date": "22 Dec 2022", "title": "Benefits Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Blackpool, England) in Dec 2022", "Interview Descriptions": "On Teams, two interviewers, I was given scenarios and asked how I would respond in those situations. Also asked what I knew about the charity itself and my own skills. Interviewers put me at ease.", "Interview Questions": "What I could bring to the organisation."}, {"date": "17 Jan 2023", "title": "Senior Applications Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (London, England) in Dec 2022", "Interview Descriptions": "The process was quite smooth and lively. The interviewer was friendly and open to any questions. The questions were on point and further detailed discussion gave me an insight on the role. The whole process was comfortable.", "Interview Questions": "Explain a situation in your previous role where you handled the issue with ease."}], [{"date": "19 Oct 2022", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Chandler's Ford, England) in Oct 2022", "Interview Descriptions": "The online application form for the role was easy to fill in and I was contacted very quickly after applying. I was interviewed within 3 working days by a regional manager and store manager, both of whom were professional and yet friendly and relaxed at the same time. I really felt as though I was able to be myself. The interview included a practical exercise to sort a donation bag. I really enjoyed this part. The interview questions were competency based and they made me think, but they were not tricky. I felt I was able to get all of my experience, ideas, and enthusiasm across. I was offered the role the same day and was so impressed by Rachel in the recruitment team and the process that followed. Rachel was friendly and efficient, and the online process is excellent. Forms are easy to fill in and not laborious.", "Interview Questions": "I was asked questions about my experience, my knowledge of Age UK, and what I would do in certain scenarios."}, {"date": "21 Oct 2022", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Age UK (The National Charity) in Oct 2022", "Interview Descriptions": "One interviewer was reasonably friendly and the other came across as stand off-ish and rude. I felt I did quite well in the interview but I was not offered the job and never given a reason. I think it was because I don’t have a car, which is a bit ironic considering the first question was “what does equality and diversity mean to you?” and a car is not necessary for the job. I told them about my degrees and research work and they said “you will find this job boring”, I assured them that I didn’t mind at all and still wanted the job. When I asked how I did, one of the interviewers said “we’re looking for someone friendly” and I felt like they were implying that I don’t fit that description. I just got a strange overall vibe from the interview and like they didn’t want me there the second I opened my mouth. During the interview, they kept skipping questions by saying “you’ve just basically answered that one” which I took as a sign that I did well, but really I felt I wasn’t being given the opportunity to answer them all thoroughly. If each question was scored, I would have been losing out on a lot of points. Another problem was that they gave me a specific date and time which was not negotiable.", "Interview Questions": "What does equality and diversity mean to you?"}, {"date": "9 Sept 2022", "title": "Project Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Age UK (The National Charity) (London, England) in Sept 2022", "Interview Descriptions": "It was very lively. The interviewers were open to answering all questions and they were very genuine with their answers. \r\nThe questions were very insightful giving me a chance to understand what they expect of me and what type of candidate they are looking for. \r\nIt was fresh and comfortable. \r\nEnjoyed the process!", "Interview Questions": "What are the most important skills needed for the job?"}, {"date": "4 Jul 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Interview was over the phone and very relaxed. It lasted about 30 minutes. You book online for a time and date that is suitable for you. You then get called on that date and time, and begin the interview. First few minutes is just to confirm your personal details such as your name. Nearing the end is where you have scenario based questions.", "Interview Questions": "There were 3 scenario based questions:\r\n\r\nThese would all be based on the training you have completed and the volunteer terms and conditions.\r\n\r\nYou would be given a scenario such as a scenario relating to safeguarding and you would have to use your knowledge from the online training on how you would react to the situation and what actions you would take."}, {"date": "22 Jun 2022", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Thorough and welcoming. Felt at ease. Good feedback. Well structured, competency based. Examples to explain how you carried out the task will get you high marks. Avoid being vague and generalisation. Wide scope of experience and impact very important.", "Interview Questions": "Example of project work and difficult situation "}, {"date": "30 Jun 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Tiptree, England) in Jun 2022", "Interview Descriptions": "I found the whole experience very comfortable.  The management team, who interviewed me, were respectful, professional and I felt completely at ease throughout the entire process. The questions were precise and well presented.  I was given the opportunity to answer their questions at my own pace, never made to feel awkward or unsure of how to answer. I can only give positive feedback regarding this process. Other companies could learn a lot from the way AGE UK conduct their interview process. I can't credit them enough. 10/10 for a very professional and yet relaxed,  to a degree, interview", "Interview Questions": "What does safeguarding mean to me?"}, {"date": "3 May 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Reasonable interview including a small practical assessment. Conducted by Shop Manager with a volunteer taking notes working to a pre determined series of questions. The questions touched upon all of the main areas of competence relating to the post, as far as I could tell. I may have been lucky in this but I applied last week, was interviewed this week and was told the result on the same day. That is good in my book.", "Interview Questions": "How would I go about managing volunteers? "}, {"date": "14 May 2022", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) in May 2022", "Interview Descriptions": "I applied with my CV and cover letter, turn around after deadline of post was within a week. I had three rounds of interviews and I appreciated the structure. The first was a  gathering of information from me and my background, I also got to know more about AgeCo from the panel. The second was competency based and the questions were adequate and the last a chance to speak with the CEO. I felt the panel/CEO were warm and friendly and I actually enjoyed the process. I pray the role matches up with the experience i've had so far.", "Interview Questions": "How do I feel my experience matches up with the role?"}, {"date": "29 Aug 2022", "title": "Helpline Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Blackpool, England) in May 2022", "Interview Descriptions": "I sent a CV and filled in an application. \r\nThen a request for further information was sent and I supplied this.\r\nThen a online panel Interview was arranged and took place.", "Interview Questions": "A range of questions relating to past experience, the reasons I had applied and how I would deal with certain situations. "}, {"date": "17 Apr 2022", "title": "Content Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "After initial application stage, there was an interview with two members of the team. Questions were fairly standard, including motivation for the job and general competencies. There was a short editing/ proofreading  task at the end of the interview where I was asked to correct any errors in a piece of copy.", "Interview Questions": "How would you describe yourself in 3 words?"}], [{"date": "6 Apr 2022", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "I was invited to submit a covering letter and CV followed by an interview with two people. The process was straightforward. I gave a presentation and then the standard interview with several competency based questions. The interviewers were warm and encouraging and the questions well designed. There was the opportunity to ask questions and it all felt relaxed and friendly. By the end of the interview I knew for sure I would accept if they offered me the post as they seemed like a great team to work with.", "Interview Questions": "Tell us about a time you had to work with a diverse team."}, {"date": "29 Apr 2022", "title": "Helpline Officer - the Silver Line Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Leyland, England) in Apr 2022", "Interview Descriptions": "It was very simple, I was offered an interview online so I did not need to travel. I emailed my right to work and proof of ID documents. \r\nThe interview was thoughtful and considered, the process was explained to me and the interviewers were both professional and friendly. I felt very comfortable during my interview", "Interview Questions": "They asked a range of questions which related to the role, how I would manage difficult situations and how I would manage my own wellbeing."}, {"date": "6 May 2022", "title": "Helpline Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Blackpool, England) in Apr 2022", "Interview Descriptions": "Was over microsoft teams, the two interviewers made me extremely comfortable. I legitimately couldn't have asked for a better team to be interviewed by. They asked me general questions about my experiences with older people, how I would feel, they explained the difficulties I may face and how I may deal with them, was chatty and friendly, which for me was amazing to feel.", "Interview Questions": "How would you feel dealing with a more aggressive caller?"}, {"date": "2 May 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Stowmarket, England) in Apr 2022", "Interview Descriptions": "Very through and comprehensive. Made to feel at ease. Both the store manager and area manager were professional and welcoming. I was made to feel at ease. It is refreshing to have such a good interview. Can’t wait to start work!", "Interview Questions": "Tell us about your work history."}, {"date": "10 Mar 2022", "title": "Helpline Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) in Mar 2022", "Interview Descriptions": "Application form first then all done over Teams, nice and relaxed atmosphere, the questions are not to catch you out so just be yourself and answer honestly. Took about half an hour with two people interviewing.", "Interview Questions": "what do you know about the company"}, {"date": "7 Apr 2022", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Age UK (The National Charity) in Mar 2022", "Interview Descriptions": "The process of arranging the interview was quick and simple, and helpfully two dates were offered. I was asked to prepare a 10 minute presentation beforehand. \r\n\r\nThe interviewers were friendly and positive, and gave a prompt when I hadn’t quite answered one question fully.  Questions were clear and relevant.", "Interview Questions": "Why independent advocacy is important "}, {"date": "18 Feb 2022", "title": "Senior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (London, England) in Feb 2022", "Interview Descriptions": "I was invited to interview within a few days of the closing date. My interview was a Teams call with Head of Research, Research Manager and Health Influencing Programme Director. It was a really lovely experience, the interviewers were very friendly and made me feel comfortable.\r\n\r\nI was asked about my motivation, evidence of competencies regarding the role and a few scenario based questions - all linked to the job description. I then had the opportunity to ask a few questions. The interviewers did a great job of providing me with in-depth answers. I then had a follow up call regarding working arrangements.\r\n\r\nI was made an offer within a few days of interviewing. Overall, it was a great experience and I would highly recommend applying for a job if you're interested.", "Interview Questions": "How would I advise a colleague on the reliability of a source?"}, {"date": "27 Sept 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Age UK (The National Charity) (Manchester, England) in Jan 2022", "Interview Descriptions": "Two stages, including a basic maths test and an exercise using excel. Following the practical tests there was a competancy based interview conducted by two senior staff. Very standard interview questions.", "Interview Questions": "Reasons for wanting to work there.\r\n"}, {"date": "14 Jan 2022", "title": "Store Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Age UK (The National Charity) (Morriston, Wales) in Jan 2022", "Interview Descriptions": "I was interviewed by two people asking competency based questions. I was told that I would be given points based on my answers and whoever had the most points would be offered the job. We talked about previous employment and my skills and how I would react in certain scenarios. Very nice atmosphere, and a very friendly people.", "Interview Questions": "Name a time when I had to work with a team to achieve a goal"}, {"date": "9 Dec 2021", "title": "Information and Advice Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Age UK (The National Charity) (Ashburton, England) in Dec 2021", "Interview Descriptions": "The interviewers put me at ease, explaining the process and inviting me to ask questions on anything I didn't understand or needed repeating.  There were no awkward moments and I felt I could be myself with them. Finding examples of work situations were sometimes tricky when asked but they were patient and made it easy for me to think clearly.", "Interview Questions": "Can you think of an example when a manager has had to be hard on you (not those words but that's how I interpreted it)"}], [{"date": "13 Dec 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Stowmarket, England) in Dec 2021", "Interview Descriptions": "I thought the interview process went very well and there was a detailed structure clarity of what was expected of me. Also a precise job clarity of the targets on a daily basis.", "Interview Questions": "To describe a difficult situation and how I dealt with it?"}, {"date": "12 Nov 2021", "title": "National Volunteering Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (London, England) in Nov 2021", "Interview Descriptions": "The interviewers were very gentle, explained the interview process  and they seem to know what they were looking for in me as a candidate.   I felt at ease and they seemed very interested during my presentation.", "Interview Questions": "I was asked to describe a time when I learnt something on the job."}, {"date": "1 Dec 2021", "title": "Van Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Peterborough, England) in Nov 2021", "Interview Descriptions": "The interview was friendly and undertaken by a very knowledgeable lady . She explained the role in detail and answered all the questions I had about the role.  I came away with a good impression of Age UK.", "Interview Questions": "What attracted me to the role."}, {"date": "21 Oct 2021", "title": "Social Prescribing Link Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "I submitted the application form via email. The process took two weeks. I had 1 week for preparation prior to the interview. The panel consisted of 2 members. The interview lasted for about 30 mins.", "Interview Questions": "Share an experience about how you worked with other parties to support your service user."}, {"date": "25 Oct 2021", "title": "Friendship Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Ashburton, England) in Oct 2021", "Interview Descriptions": "There were 2 stages to the interview. The first was a friendly informal phone call with two members of staff where they asked questions about why I had applied and what skills I had, as well as outlining the job role. A few days later, I was offered a second video interview with the same two members of staff. The second stage of interview consisted of two parts - the first was a 30 minute task which reflected the job role in which I had to reply to a referral email. The second part was a video interview in which I was asked competency based questions based on the job description. The whole process was professional and thorough and put me at ease, especially as I get nervous for interviews.", "Interview Questions": "What skills do you have that will help you in this role?"}, {"date": "5 Oct 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Really made me feel relaxed whilst interviewing online. They were friendly and the interview took about 45 minutes to an hour. They put me at ease and allowed me time to think about my answers.", "Interview Questions": "What are your IT capabilities."}, {"date": "17 Sept 2021", "title": "Information and Advice Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Very easy interview process got asked normal competence questions after an online application after an initual telephone conversation. I spoke to community manager and then got interviewed by the caseworker.", "Interview Questions": "Do you experience of working with older people? "}, {"date": "12 Sept 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Very Good and positive in interview feel like a welcoming place to work. Received offer and volunteered for a couple of years before going to university. Would highly recommend volunteering for age UK", "Interview Questions": "Why do you want to volunteer for age UK,?"}, {"date": "8 Sept 2021", "title": "Co-ordinatior Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Easy application process, and was contacted soon after expiry date. Interview was with two managers. Good questions applicable to the role. Interview lasted about 45 min with a 15 minute written test", "Interview Questions": "why do you want to work here - standard questions"}, {"date": "15 Aug 2021", "title": "Senior Insight Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Age UK (The National Charity) (London, England) in Jul 2021", "Interview Descriptions": "I applied via the website. This was quick and easy.  The only problem was that the reply went to the \"Promotions\" tab in Gmail and I missed it.  Then I was invited to a remote competency interview on Teams with the two senior people in the team. Then I was invited to do an online test with the team manager.", "Interview Questions": "About experience with a fairly technical area on the job spec"}], [{"date": "28 May 2021", "title": "Volunteer Services Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "A simple application process and hassle-free interview! A great charity with great values and ethos.  Make sure you apply for roles with them.\r\n\r\nProcess:\r\nA range of questions to assess my ability to effectively complete the role, personality-style questions and an opportunity to ask questions to the interviewers.", "Interview Questions": "What do you perceive to be the biggest challenge in the role?"}, {"date": "4 Jul 2021", "title": "Social Prescriber Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (London, England) in May 2021", "Interview Descriptions": "Had to prepare a scenario a response from a case study given prior to the interview and then deliver it in the interview. Interview took place with two interviewees who both asked questions.", "Interview Questions": "Why is record keeping important"}, {"date": "8 Mar 2021", "title": "Sunday Shop Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 days. I interviewed at Age UK (The National Charity) (London, England)", "Interview Descriptions": "Was like speaking to a robot, no personality,  dull, no warmth, felt like i was being interviewed by the police, really uncomfortable, long and draining. I could not wait to end the call. And after putting myself through this, no response to let me know how it went? Absolutely awful charity.", "Interview Questions": "what makes a shop run smoothly."}, {"date": "4 Mar 2021", "title": "Home Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Group interview consisted of competency tasks. Health and safety and an individual interview. Everything was a well rounded process, got an understanding of the role in a friendly atmosphere and environment.", "Interview Questions": "What are some of your strengths?"}, {"date": "16 Mar 2021", "title": "Information and Advice Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Blackpool, England) in Mar 2021", "Interview Descriptions": "The interview process was straightforward and timely, I applied online. Initially I had a telephone interview, then I was invited to an interview on Microsoft teams. Everyone I came into contact with throughout my interview process and journey was friendly, warm, professional and welcoming.", "Interview Questions": "Do I know the issues affecting older people?\r\n\r\nQuestions around me, my passions, my experiences with older people. Also questions around call handling, working from home, general competency questions also. "}, {"date": "24 Feb 2021", "title": "Activity Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Blackpool, England) in Feb 2021", "Interview Descriptions": "The initial part of the interview was via telephone, which consisted of some competency-based questions and general conversation. I was then invited to a second interview, which was conducted via pc (due to the Covid restrictions). There was an initial timed (email) exercise to fulfil and then a virtual interview.  This consisted of more competency and some situation-based questions. The entire process was straightforward and the team from Age UK were friendly, professional and knowledgeable.", "Interview Questions": "Standard Q's, general competency and experience-based incl: dealing with various situations, communication experience etc."}, {"date": "7 Oct 2020", "title": "Head of Service Delivery Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 days. I interviewed at Age UK (The National Charity) in Oct 2020", "Interview Descriptions": "3/4 stage interview. The process was very well organised and done via MS Teams. There were 3 people on the panel and all made me feel at ease. The questions were robust and in depth, some competence based and some more conversational ones. At the 3rd interview I was given a problem and asked to present a solution. They were very thorough in making sure they had the correct fit. I was successful but even if I wasn’t I would have rated this highly as it showed integrity and a good working ethic on their behalf.", "Interview Questions": "Tell me about a time you have improved a service and how did you measure the outcome?"}, {"date": "16 Oct 2020", "title": "PR and Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Nottingham, England) in Sept 2020", "Interview Descriptions": "Applied using the application form online. Must outline how you fulfil each essential skill.\r\nInvited for a virtual interview, including a 10min presentation.\r\nReceived the rejection over email rather then a call from the interviewer and haven’t  got any specific feedback.", "Interview Questions": "What do you look for in a manager?\r\nWhat experience do you have of influencing people?\r\nWhat experience do you have with photoshop, graphic design and video editing software?"}, {"date": "25 Sept 2020", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (London, England) in Sept 2020", "Interview Descriptions": "Interview as very professional but relaxed asked the appropriate amount of questions and allowed plenty of time for my responses, i was made to feel welcome and valued for my time", "Interview Questions": "Asked me about what experience i had to bring to the role "}, {"date": "3 Feb 2022", "title": "PR and Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Nottingham, England) in Sept 2020", "Interview Descriptions": "Filled a very detailed application form. You should make sure you hit every skill they are after.  Then prepared a presentation for interview and then normal interview questions. Interviewers were easy to get on with. They took a long time to get back and feedback was non existent.", "Interview Questions": "\"Why Age UK\" and some probing questions about technical skills for adobe, photoshop, website design etc."}], [{"date": "15 Feb 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (London, England) in Sept 2020", "Interview Descriptions": "It consisted firstly of an online application form where you attach your CV and then a pre-screening phone call to assess suitability. The last stage is an interview asking questions relating to the job specifications", "Interview Questions": "why do you want to volunteer? why Age UK? what experience have I had in dealing with customers? Ability to handle information"}, {"date": "6 Jan 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (London, England) in Aug 2020", "Interview Descriptions": "Two rounds, with different panels.  You always have the line manager. It’s quick and the questions are average which you can find online. Competency based in all instances. For senior roles they focus on leadership questions mostly.", "Interview Questions": "Describe how you convince your manager to fo something he/she didn’t agree before? "}, {"date": "18 May 2020", "title": "Hospital Wellbeing Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Age UK (The National Charity) (Blackburn, England) in May 2020", "Interview Descriptions": "Interview process was straightforward but quite intimidating.\r\nFelt disregarded due to past job role being very different to the one applied for.\r\nTold I would receive a call back and I never did. I had to chase us feedback myself which I felt was unprofessional.", "Interview Questions": "What do you know about Age Uk?"}, {"date": "9 Dec 2019", "title": "Project Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (London, England) in Dec 2019", "Interview Descriptions": "The interview included a telephone interview stage before a face-to-face interview. The interview was at head office in London and included a 30 minute IT test before proceeding to being asked competency based questions.", "Interview Questions": "What do you currently know about Age UK?"}, {"date": "22 Nov 2019", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Age UK (The National Charity) (London, England) in Nov 2019", "Interview Descriptions": "The interviewers were warm and receptive. Made me feel comfortable before starting with the questions. She started first by telling me the interview process and how many applicants were to be interviewed and when I was to get a feedback from them.", "Interview Questions": "Tell me what you know about Age Uk"}, {"date": "8 Oct 2019", "title": "Digital Channel Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (London, England) in Oct 2019", "Interview Descriptions": "The first step was a telephone interview where I spoke to two senior team members.  I was then offered a face-to-face interview and asked to prepare a  15-minute presentation. I presented to two senior team members. After the presentation I was asked a list of and competency-based questions.", "Interview Questions": "The questions were based on the job specification and my skill set. "}, {"date": "4 Feb 2021", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Birmingham, England) in Aug 2019", "Interview Descriptions": "In person, had a group discussion and worked on the job one day just for the team to analyse my skills. Then received a telephone phone call to be told whether i had the role or not. Through hiring, I completed a health and safety form.", "Interview Questions": "My interpersonal skills, experiences, education"}, {"date": "15 Aug 2019", "title": "Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Bristol, England) in Aug 2019", "Interview Descriptions": "The interview process was pretty standard for the position aka to tell them why I thought I was suitable to the role, some questions about my current role in the store and to elaborate on some key elements of my CV. It lasted about 45 minutes, I was interviewed by the Area Sales Manager with my current manager present as well.", "Interview Questions": "How do you think an average working day will be for you?"}, {"date": "2 Jun 2021", "title": "Volunteer Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Birmingham, England) in Aug 2019", "Interview Descriptions": "I was interviewed  face to face, asked which task i would be more comfortable with either working on sales floor at front of house or at the back of store in stock room. I completed a health and safety form and a personal details form.", "Interview Questions": "How long can I commit to working at the store?"}, {"date": "3 May 2019", "title": "Assessor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Merton, South East England, England)", "Interview Descriptions": "Friendly, professional, high expectations, warm and the process was partly computer scenario and partly rapport and questions based.  Sometimes the questions went off piste more than expected to follow up something mentioned.", "Interview Questions": "Asked about personal needs / requirements / adjustments for the job at the end. "}], [{"date": "18 Aug 2018", "title": "Cafe Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "It was very informal and they asked what experience I had, why I choose them and what I could offer them. They then asked me what days I was available to volunteer.", "Interview Questions": "Why did you choose to volunteer with us?"}, {"date": "24 Aug 2018", "title": "Psychological Wellbeing Practitioner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (London, England) in Aug 2018", "Interview Descriptions": "Applied online and heard back swiftly.  Process: Test and Interview. Test consisted of preparing presentation and presenting. Panel of four on  interview. 12 interview questions. Interviewers distracted throughout which was very off-putting and rude. Service user on panel did not ask any questions. Questions essential to job were not asked. Not warned beforehand that 'test' would be a presentation. Did not inform me of decision when they said they would. Overall, unprofessional and an unpleasant experience.", "Interview Questions": "Why do you want the job?"}, {"date": "3 Jul 2018", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "It was a panel interview with two members of staff. There was no assessment. The staff were polite but did not particularly sell the role to me. The feedback was not very helpful as I was not successful but they said it was a great interview.", "Interview Questions": "Tell us about your favourite marketing campaign"}, {"date": "21 Nov 2022", "title": "Communications Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Age UK (The National Charity) (London, England) in May 2018", "Interview Descriptions": "There were two virtual interviews with team lead followed by a written test. The interviews were not too formal or structured, more of a two-way conversation and the interviewer was friendly.", "Interview Questions": "What is your experience of running marketing campaigns"}, {"date": "27 Feb 2018", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Age UK (The National Charity) (Norwich, England) in Feb 2018", "Interview Descriptions": "Interviewed by the Area Manger and the Shop Manager.  Most of the questions asked were of the traditional variety. Knowledge of the work of Age UK and general non-profit work environment and issues is required", "Interview Questions": "How do you think working in  a charity shop would differ from an ordinary retail environment?"}, {"date": "15 Mar 2018", "title": "Warden Part Time Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Cambridge, England) in Jan 2018", "Interview Descriptions": "10 questions in certain situation, think they tend to employ someone old & female, they already turned me down for another job, but they interviewed me anyway, both jobs were part time, low pay, I replied to them afterwards and they sad keep applying, not much point when you’ve turned me down fir simple part time jobs...", "Interview Questions": "In a difficult situation"}, {"date": "5 Feb 2018", "title": "Stock Collector Team Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Age UK (The National Charity) (Newton Abbot, England) in Jan 2018", "Interview Descriptions": "Interview at Newton Abbot, Devon. Fairly easy questions...except, four questions into the interview the interviewer asks me my age. As I give my answer he says he has to end the interview there as i'm not of of the right age for them to insure me to drive their vehicles. How this wasn't screened out in their selection process is beyond me, showing a complete lacklustre effort in their interviewing shortlisting.  A total waste of time and money (45 mile round trip!). Even though I was only able to answer four interview questions, the interviewer did not take long in assuming his condescending tone.", "Interview Questions": "Tell me about yourself...\r\n"}, {"date": "1 Jan 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (London, England)", "Interview Descriptions": "Applied online and I was  invited to interview with 2 people. The interview followed the exact questions on the online application as well as further questions about interacting with the public which were not on the online application form", "Interview Questions": "Tell us about how you would interact with a negative audience? "}, {"date": "29 Mar 2017", "title": "Evaluation Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Age UK (The National Charity) (Edinburgh, Scotland) in Mar 2017", "Interview Descriptions": "I was offered an interview, where I had to deliver a presentation related to the project and answer some questions detailing my experience. The interviewers were friendly and answered questions I had about the motivation for the creation of the post and their comfort for me seeking other complimentary work (it was a part time role). I didn't get the job, and didn't appreciate having to wait days longer than they said I would but all in all a good experience.", "Interview Questions": "They asked about my experience of working with older people."}, {"date": "22 Oct 2017", "title": "Cook Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity) (Haywards Heath, England) in Dec 2016", "Interview Descriptions": "Interviewed by centre manager and someone from regional office . Made to feel welcome .Checked CV and right to work documents.\r\nAsked to prove practical skills cooking in centre. Certainly got their moneys worth.Do not feed their kitchen volunteers lunch ,one volunteer 83 lived on her own worked hard all morning had to bring her own lunch.", "Interview Questions": "Experience of recording food safety ."}], [{"date": "28 Oct 2016", "title": "Administrative Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Age UK (The National Charity) (Swansea, Wales) in Oct 2016", "Interview Descriptions": "Application was quite long but detailed and easy to answer. Around a fortnight later I was invited to interview which took place 9 days later. Interviewed for Age Cymru. I was interviewed by the two managers of the specific service that I am working with.", "Interview Questions": "What do you know about Age Cymru and their services?"}, {"date": "10 Nov 2016", "title": "Policy Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Age UK (The National Charity) (London, England) in Aug 2016", "Interview Descriptions": "Presentation, followed by competency based interview in front of two people. In total, lasted about an hour. Most of the questions were pretty straightforward - how you would influence people, management experience, etc.  However, they opened with an unusual question about policy (that couldn't necessarily have been guessed by researching the company and policy area in advance).", "Interview Questions": "What's the first thing you'd do in the job?"}, {"date": "19 Jul 2016", "title": "Hospital Transport Driver Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Age UK (The National Charity) (York, England)", "Interview Descriptions": "Standard application form, invited to interview. Overly informal, presented with range of scenarios with commonsense answers. Suspect some false assumptions made about deafness, and whole process not transparent. No opportunity for feedback, and subsequently spotted the job as a \"volunteer opportunity.\" Very poor post interview communication. Not recommended for professional people.", "Interview Questions": "Standard Q's, e.g. why do you want the job? Some commonsense scenarios, e.g. would you make sure the person is safe once taken home?"}, {"date": "17 May 2016", "title": "Financial Planning and Analysis Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Age UK (The National Charity) (London, England) in May 2016", "Interview Descriptions": "I was contacted by Age UK HR, who were friendly. It took about 2 weeks to have the first stage interview. It consisted of an interview with a finance person called Bruce, and a HR lady. They were very friendly, and I built strong rapport with them. They asked reasonable questions, such as experience relating to systems, reporting, why the role, why Age UK etc. I did well because I had done over 6 hours of interview preparations, knowing their annual report and charity inside out.\r\n\r\nThe 2nd stage interview was the following week with the CFO, Rajeev. When I first entered, he was late and wasn't prepared for the interview since it was clear that he read the CV for the first time. He didn't introduce himself, nor the charity, nor the role, but instead went directly to the first question in a rude and sharp tone \"why are you here?\". Obviously I didn't get any chance to build rapport or have flow from the interview because of that. It seemed to be purposefully designed to catch me off guard and disturb me, and ruined the rest of my interview since it made me forget much of the preparations I did, and made me nervous. \r\nHe asked similar questions to the first stage interview, but when I was speaking, he cut me off many times and moved on to the next question. This was very rude and didn't let me finish my answers. When I was speaking, he kept saying that we're running out of time and he has to see another candidate. The interview lasted 30 mins, which was not enough for this stage, and made the interview very rushed from the side of the interviewer.\r\nI've never had an interview like this, it was very unprofessional. I'm happy that I didn't get an offer.\r\nThey replied about 6 days after the interview with an email mentioning that I didn't receive an offer. They gave no feedback nor call.", "Interview Questions": "Why the role, why Age UK, what variance analysis did you do?"}, {"date": "29 Apr 2019", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Age UK (The National Charity) (Bath, England) in Apr 2016", "Interview Descriptions": "This was a part time voluntary job so just involved an informal chat. Even so, I prepared well and made sure I could answer the usual skills and why the company, why the role questions.  They really want to see your motivation and that you are passionate about the charity sector.", "Interview Questions": "What do you know about Age UK and why do you want to work there"}, {"date": "1 Dec 2015", "title": "Marketing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Normal application form, followed by a call to interview. Requested to complete pre-prepared presentation, a desk task and an interview.\r\n\r\nThe questions were fair, and the panel gave a good cross section of the organisation. Plenty of time and opportunity to put my answers across, and was given the chance to ask questions of my own.", "Interview Questions": "Do you expect to be working here by the end of the three year contract?"}, {"date": "20 Jan 2016", "title": "IT Support Graduate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Age UK (The National Charity) in Dec 2015", "Interview Descriptions": "Interview was with one of the managers and with an HR member. It consisted of an intray exercise and a personality test which was done the week before. I was given the results of the personality quiz on the day. I was informed of the decision to hire a few days later.", "Interview Questions": "Standard questions like examples of team leadership, problems faced and how you dealt with it."}, {"date": "25 Mar 2016", "title": "Business Insight Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Age UK (The National Charity) (London, England) in Apr 2015", "Interview Descriptions": "The process consisted of a telephone interview with HR, mostly to understand why I wanted to work for Age UK.\r\nI was then invited to a 2 hours on site interview.\r\nThe first hour, two managers interviewed me asking several questions taken from a questionnaire. They were behavioural questions, questions regarding my background and past projects I had worked on, and questions about the company.\r\nIn the second hour, I was presented a business case and had to do some analyses with Excel and answer some SQL questions.", "Interview Questions": "Which is your biggest achievement?"}, {"date": "21 Nov 2015", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Age UK (The National Charity) (Flitwick, England) in Mar 2015", "Interview Descriptions": "Very informal process. The only real response to several questions was yes or no, interviewer was confirming that I knew what was involved rather than assessing my skill set. I believe it was set up in this way to get a feel of my personality", "Interview Questions": "What is my preferred area of work ie Location"}, {"date": "27 Nov 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Age UK (The National Charity)", "Interview Descriptions": "Treat the interview as you would a face to face interview. If it can be seen on screen, make sure it’s smart and presentable. By doing this, you are showing you’re interviewer that you’re taking the interview seriously.", "Interview Questions": "the quieter the surroundings, the fewer the distractions. Let your family/housemates know that you’ve got an interview and ask them to keep the noise down for an hour or so. This goes for pets – you don’t really want an attention seeking cat putting you off your answers."}], [{"date": "29 Jul 2018", "title": "Advice & Information Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Age UK (The National Charity) (Worcester, England) in Jan 2014", "Interview Descriptions": "Friendly, open; put me 'at my ease'....no 'trick' questions'!   I was listened to when I asked my own questions.  Also asked about confidentiality.  I had previously worked in these types of environments and assured panel I respected confidentiality at all times; files locked away; no 'talking' about a client, unless there could be any presenting issue... with manager.", "Interview Questions": "How would you deal with a client in severe distress.   How important is client confidentiality"}, {"date": "21 May 2017", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Age UK (The National Charity) (Halesowen, England) in Jan 2013", "Interview Descriptions": "One to one interview, questions and scenarios, times available to work,  any holidays, how I would handle and awkward customer and what are my ambitions for the future and how would i get to work", "Interview Questions": "Past experience"}, {"date": "11 Aug 2016", "title": "Information and Advice Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Age UK (The National Charity) (Cranleigh, England) in Sept 2012", "Interview Descriptions": "Friendly and professional. Discussed skills as an advisor and previous experience as a Health & Social Care Agency owner being relevant to the role. Discussed and agreed training areas needed in order to carry out the required skills for the job.", "Interview Questions": "Experience of Benefits knowledge, Health and Social care, local knowledge, bid writing."}, {"date": "3 Sept 2015", "title": "Village Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Age UK (The National Charity) (Gloucester, England) in Aug 2012", "Interview Descriptions": "It was a large 'group' interview with various exercises to run through.  I know this didn't suit a couple of others I spoke to.   We also acquired a lot of information about what was then an exciting new project; then we each had an individual interview by a very pleasant manager.", "Interview Questions": "How would you react/what would you do if a client needed you urgently?"}]]