[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Best work environment with the best people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Apr 2022", "job_title": "Veterinary Assistant in Boston, MA", "duration": "N/A", "pros": "-Supportive, friendly staff \n-Workplace where staff becomes your second family\n-Passionate, hard-working co-workers\n-Fast-paced, intense, dynamic, and challenging work environment\n-Regular raises (albeit small)\n-50% discount on most products and services\n-Can bring your pet to work with you!", "cons": "-Understaffed (taxing on the staff that remains)\n-Difficult to maintain work-life balance (as is the nature of this field in general--not a criticism specific to this particular workplace)\n-Underpaid for the level of loyalty, dedication, and hard work that employees put in (again, not an institution-specific criticism, but rather a criticism of the field at-large--the organization does its best to meet wage suitable for standard of living in Boston)\n-Not enough protection/support mechanisms in place to give front desk staff the comfort, security, and safety that they deserve. They work SO hard, care SO much, and have almost nothing to do with treatments/cost of treatment/management decisions/lack of vet communication/etc., but yet receive some of the worst harassment and verbal assault (as well as, in some cases, physical assault; stalking; threats to their health/wellbeing/safety/careers; etc.) that I have ever seen, and they are required to just put on a happy, smiley customer service face and just be okay/keep doing their job. Turnover in these roles is extremely high, and yet nothing is done to make front desk staff feel more valued, protected, and cherished, as their role is critical to the function of the hospital, and they are some of the sweetest, kindest, most caring people. They absolutely do not deserve to be subjected to such a dangerous and abusive environment. It is heartbreaking to hear some of the kindest people you have ever met discussing that a client saying \"thank you\" or \"have a good day\" (or even just giving a response of \"you too!\") made their day/was the nicest interaction they've had with clients in weeks or even months."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Ultimately a very dysfunctional workplace", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Jun 2023", "job_title": "Client Services in Boston, MA", "duration": "N/A", "pros": "-There are a few (although the number decreased over my years there) really, really great doctors and technicians working here who do the kind of work that you'd be hard-pressed to find elsewhere. A few of the best of the best are still here, doing amazing things. \r\n\r\n-The health insurance plan is very good. The rest of the benefits are fine/mediocre. I know of a few compassionate and caring people in the administration/management who, while unable to improve the organization as a whole, will go out of their way to help individual employees in need if they can. Some of the small perks are nice.", "cons": "-Leadership and management are not present in the front-line operation of the hospital and that is reflected in their ineffective-to-terrible decisions and their inability to retain staff. Multiple departments are absolute disasters, like the front desk, and it negatively effects everyone else who has to interact with them in any way. \r\n\r\n-Communication from management is also very poor and ineffective. Nobody working the hospital floor has any confidence in or respect for leadership. \r\n\r\n-For mid and lower level management, a few managers and supervisors seem good (mostly in the specialty technician departments), but most seem terrible and incompetent. Hard workers are punished with a disproportionate workload and less competent employees are allowed to coast. Staff does not feel respected or valued. The hospital is perilously understaffed and managers don't step up at all to help with coverage (except again for a select few). \r\n\r\n-The average level of patient care has really deteriorated with the simultaneous loss of staff and increase in cases. It's hard to watch and really demoralizing. The functioning of the hospital completely relies on the labor of under-paid, over-worked interns who need more supervision, support, and sleep."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Best Hospital for advanced care BUT supervisors/HR lack compassion and standards", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Nov 2022", "job_title": "Veterinary Assistant in Boston, MA", "duration": "N/A", "pros": "-Many chances for learning new and important skills. -Meeting new people with different levels of knowledge. -Bringing pets to work daily for free.", "cons": "-Management is allowed to make decision that are based on personal feeling and if they have enough seniority can get people terminated or make their career and life at work miserable day to day. -The work they expect you to accomplish is not worth the pay rate they give you. -Supervisors lack compassion and understanding and are often bias when it come to conflicts between co-workers or departments. -Will single certain people out and make it very hard for them to advance their career if not every one likes said person. -Good health care plan offered but unreasonably priced. -Work life balance is non existent. -Allow bullying to go on in departments without much repercussion for the bully."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "high intensity, long hours, incredible facility", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Mar 2023", "job_title": "Community Animal Welfare Specialist in Methuen, MA", "duration": "N/A", "pros": "you will gain all the experience with basically entry level training. Great company values.", "cons": "Methuen location, specifically the large animal at nevins needs changed up"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Lack of communication - Please do better for the sake of the employees!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jul 2022", "job_title": "Manager in Boston, MA", "duration": "N/A", "pros": "The doctors and technicians are wonderful people to work with. The mission of the company is one of the reasons I really wanted to work here.", "cons": "Lack of communication.\nPolitics.\nLow compensation for most technical staff.\nLack of respect for ALL employees. Some services get preferential treatment over others for pay, respect, and incentives.\nLack on mentorship. (though they are trying really hard to work on this.\nFacade of having an interest in mental health support for employees. (You will get fired if your mental health bleeds into your duties.)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Client Liason", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Dec 2022", "job_title": "Client Liasions in Jamaica Plain, MA", "duration": "N/A", "pros": "Nice people, share mission of helping.", "cons": "The pay could be better"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management will ruin your love of shelter work", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2022", "job_title": "Animal Welfare Specialist in Methuen, MA", "duration": "N/A", "pros": "-working with animals -the best coworkers", "cons": "-horrible managers -workload is ridiculous -animals' quality of life compromised due to lack of time for their needs"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Never boring", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Mar 2022", "job_title": "Veterinary Technician Specialist in Boston, MA", "duration": "N/A", "pros": "Always busy, great cases to gain experience and knowledge. Trying to utilize technicians as best they can. The people you work with are excellent.", "cons": "Teaching hospital for doctors which can be frustrating at times, and you often lose out on opportunities to learn to new skills to the interns who often get priority on those skills."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Least toxic work environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2022", "job_title": "Certified Veterinary Technician in Groton, MA", "duration": "N/A", "pros": "Kind, accepting staff\r\nSupportive direct management\r\nLow tolerance for abusive clients\r\nFear-free practices\r\nGreat benefits", "cons": "Normal corporate issues\r\nMildly understaffed- slowly resolving"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Run the other way", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Aug 2021", "job_title": "Animal Welfare Specialist in Jamaica Plain, MA", "duration": "N/A", "pros": "- I was surrounded by an amazing, supportive, talented, and passionate co-working team on my own level, which many of us mentioned being the only reason we could exist in this organization as long as we did. Many of the volunteers are wonderful, kind people as well who I looked forward to seeing every day.\r\n- You get to work with animals, and have the power to positively impact their daily lives during a very stressful transition, as well as support people to achieve the best outcome for themselves and their pets, which can be very rewarding at times. \r\n- The organization is relatively progressive in it's views on animal welfare, including not surrender shaming and not focusing on perfect \"forever homes,\" and supporting people who are struggling to keep their pets through community outreach.", "cons": "- There are systemic mismanagement and organizational culture issues, which twisted this job from something my coworkers and I thought of as our dream job to a horrible nightmare. In the 2 years I worked at the Boston Adoption Center, 9 people in the Community/Animal Welfare Specialist position quit, and 2 more quit in the few months after I left. \"Fully staffed\" there are 8 people in this position, which isn't enough people anyways, and we operated with only 7 people for over 8 months before I left. We were constantly scrambling to play catch up, rather than existing in a place where we can be proactive and grow. Eventually, we all burnt out to the point that \"good enough\" was an incredibly low bar in terms of the quality of care or compassion we could offer to animals or clients, which makes you feel terrible but you're in such a bad place you can't even help yourself. \r\n- This is a predatory organization that falsely advertises in the interview process and preys upon the passion and dedication of talented young staff, but provides them little compensation in the form of positive reinforcement, support, a voice or choice, pay, a break room, respect for work-life balance boundaries, opportunities for growth or learning, or even enough staff to feel like we could accomplish everything that needed to get done in a quality manner. Although the Boston Adoption Center seems to operate in a high turnover, \"burn em out and replace em\" method for staffing, there is no formal training program so new staff are inevitably useless for a long time and feel confused and unconfident.\r\n- All of my coworkers and I talked about feeling invaluable and replaceable constantly, and we were all extremely burnt out and suffering mental health consequences such as compassion fatigue, apathy, low self-esteem, anxiety, depression, and more at the time I quit. Everything is blamed on the individual staff members not being able to handle such a tough job, rather than looking at this as systemic issues that the organization has the power to change.\r\n- Additionally, the pay is not a livable wage for the Boston area, nor is it proportional to the amount of experience and education they require, there is little room for growth, bias and racism are rampant regarding both clients and staff, and nothing concrete is done to promote diversity. Beware that many of the higher ups were snakes who you think you can trust but will turn and use your words against you. \r\n- Of course, the work itself can be tough too, you help animals and people who are suffering or in really hard situations, there are lots of emotions and little time/space to cope with them, clients and the public can become combative or judgemental easily, and you are involved in a lot of complicated, difficult decisions which don't always involve consistency or agreement. Plus the work can be messy, loud, dirty, scary, stressful, physically taxing, and involving bodily fluids and death."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work - Great mission.  Progressive programs. Great people.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "2 Nov 2020", "job_title": "Director of Adoption Centers and Programs in Boston, MA", "duration": "N/A", "pros": "I have been part of this organization for 26 years and I can't think of a more amazing place to work. There are a lot of humane organizations in this country, but none as dynamic as this. The animal protection division, which includes advocacy, law enforcement, adoption centers and community outreach is on the cutting edge of animal welfare and constantly finding new and creative ways to help people and animals. The hospital division is on the cutting edge of medicine and is able to provide a high level of medical care to animals in need. Not only does the hospital have the most advanced medical technology, but it also has developed many support systems to help financially challenged clients gain access to affordable care. \r\nMost importantly, though, some of the most amazing, dynamic people work here. I am constantly amazed by the dedication, compassion and collaboration of this awesome team.\r\nThe salary is competitive, the benefits are excellent and this organization cares about our staff and volunteers as much as it cares about animals and the community.", "cons": "This job involves some pretty work and it exposes you to lots of heart-wrenching situations. However, your co-workers, managers and upper level management recognizes this and support you through it."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "New leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Nov 2021", "job_title": "Development Coordinator in Boston, MA", "duration": "N/A", "pros": "Decent benefits like 50% vet services", "cons": "Old school methods are out of date. Tons of silos and grudges exists between departments and staff who have been there for decades and refuse to leave. New leadership is changing the structure of the company beware. Many organizational changes are occurring including layoffs and cuts"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Management Needs Revision", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Sept 2021", "job_title": "Surgery Assistant in Boston, MA", "duration": "N/A", "pros": "Great patients \r\nTeam environment\r\nOpportunities to contribute to improve work environment", "cons": "High stress environment because employees and middle management were unprofessional and emotional"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Huge disconnect between admin of the organization and the floor staff", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jan 2021", "job_title": "Veterinary Technician, Cvt in Boston, MA", "duration": "N/A", "pros": "Excellent veterinarian STAFF doctors, mostly fun co-workers, paid holidays, good healthcare \r\ndental plan", "cons": "Interns are running the place 75% of the time without being properly mentored/trained. Unfortunately the main focus is on production over patient care, and accommodating wealthy people for fundraising purposes. The place survives off it's reputation for greatness when in actuality it's values are decaying as a result of the greed of a handful of people at the top."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The only place I wanted to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Nov 2020", "job_title": "Business Manager in Boston, MA", "duration": "N/A", "pros": "For animal lovers and those wanting to make a difference, MSPCA Angell is THE place to work. I have wanted to work here since college, and have been fortunate enough to spend the last two years in an administrative position in the hospital where I learned a ton, and have since been promoted to a management role. There is room for growth and you have the opportunity to explore different interests and potentially move within departments; there is a lot to offer. You are surrounded by \"your people\" (aka animal people) and everyone truly cares and works hard.", "cons": "There are several locations, but the \"headquarters\" in Boston is quite large, so sometimes it can be tough to connect/get to know everyone there or at a location you do not work at."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Okay for experience and people, bad for work-life balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jan 2021", "job_title": "Anesthesia Technician in Boston, MA", "duration": "N/A", "pros": "The people you work with are amazing and make coming to work worth it. \r\nLots of opportunity for overtime or extra shifts for more money. \r\nGreat place to learn and gain experience.", "cons": "Upper management forgets that you can run a veterinary practice without technicians. \r\nLong hours and expected to do overtime. \r\nUpper management think techs want to have pizza party’s to feel appreciated, instead of actually paying us appropriately or encouraging a work life balance."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Loved the job overall", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jun 2021", "job_title": "Rehabilitation Aide%2FPhysical Therapy Technician in Waltham, MA", "duration": "N/A", "pros": "wonderful doctors, coworkers, patients and clients", "cons": "would like to see improvements with management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Understaffed and overworked", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "24 May 2021", "job_title": "Veterinarian Assistant in Boston, MA", "duration": "N/A", "pros": "The staff is comprised of mostly hard workers, management works hard", "cons": "Can't keep new hires because the work load is extreme"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Beautiful location, poor compensation", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Apr 2021", "job_title": "Certified Veterinary Technician in Boston, MA", "duration": "N/A", "pros": "Beautiful hospital with some really great tools for use.", "cons": "Pay was low. In order to make more you had to become a higher standing or complete other certifications that your department did not utilize."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Fast paced, every day is different", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Apr 2021", "job_title": "Rad Tech in Boston, MA", "duration": "N/A", "pros": "On the job training, interesting job, always changing, fast paced, fun.", "cons": "Pay is a little on the low side for MA salaries"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Everything is great except management and pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Mar 2015", "job_title": "Anonymous Employee in Jamaica Plain, MA", "duration": "N/A", "pros": "The staff are friendly and you build a family here between other staff members and yourself. If you get close to the right people they will stay your friends for years to come. And obviously, if you like animals then this is a great place to be. Employee discount is a big pro. Such dedicated doctors and hard workers work on the floor of the MSPCA.", "cons": "If you get close to the wrong people, you can be in danger of losing your job, because people will do anything to get ahead and people will stab you in the back. Upper management doesn't always have experience in managing or any kind of supervision. My superior (the first tier amongst a lot more - also a problem) is one of the most unprofessional and inexperienced people in my group, they have no idea how to manage or how to communicate appropriately, yet they received the promotion to manage us because they had an 'in' with the second tier. And that's the problem as well, people don't get promoted here because of how much experience they have, they get promoted because because they were promised the position or they made themselves look great by stepping on all their co-workers. \r\nThe pay is pretty bad, but if you can live off $30-$35k gross then fine. Raises are a slap in the face."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Non-profit with the resources of a company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jan 2021", "job_title": "Veterinarian in Boston, MA", "duration": "N/A", "pros": "Lots of veterinarians to bounce ideas off of. Friendly staff.", "cons": "Lots of new faces, high turnover of technicians, very (VERY) busy hospital."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Passionate org you can be proud of", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Feb 2021", "job_title": "Marketing Manager in Boston, MA", "duration": "N/A", "pros": "Passionate colleagues and furballs galore", "cons": "Nonprofit salary can certainly be challenging"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "CVT review", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Nov 2020", "job_title": "Certified Veterinary Technician in Boston, MA", "duration": "N/A", "pros": "Fantastic place to work - tons of resources for learning, large caseload so exposed to a wide variety of things. Excellent clinicians. Fast-paced environment.", "cons": "High turnover - people generally find out quickly if they like the large, fast-paced hospital, so there was a bit turnover between technicians and management."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Jan 2021", "job_title": "Veterinary Assistant in Boston, MA", "duration": "N/A", "pros": "Good learning environment and benefits", "cons": "There’s a lot of drama"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": "N/A", "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Internship", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Dec 2020", "job_title": "Veterinarian in Boston, MA", "duration": "N/A", "pros": "Invaluable experience as a new graduate veterinarian. Close mentorship with senior specialists and high case load", "cons": "100 hour weeks and exceptionally demanding both physically and mentally."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poor management, amazing work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Dec 2020", "job_title": "Vet Attendant in Boston, MA", "duration": "N/A", "pros": "Work with the best in the industry", "cons": "Terrible compensation and poor staffing"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Fast-paced, high pressure environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Dec 2020", "job_title": "Surgery Assistant in Boston, MA", "duration": "N/A", "pros": "No day is every the same", "cons": "Long shifts and low pay."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Dec 2020", "job_title": "ER CVT in Boston, MA", "duration": "N/A", "pros": "Good techs, great learning experience", "cons": "Management, pay, lack of appreciation"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Technician/Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jul 2015", "job_title": "Assistant in Boston, MA", "duration": "N/A", "pros": "Doctors are great, top of their class and a fun working environment if you have the right attitude, and a mix of love for crazy clients and socially-awkward co-workers. Great to work with the best though! More recent have high standards of the tech/assistant staff but not of business decisions. On call shifts not bad, and some paid extra. Scrubs and shoe allowance is adequate.", "cons": "Upper management. Immediate was great and understood our issues but often \"damage control\" seems to be the best answer, or avoiding conflict sometimes dictates their decisions. Very low pay, but that's the field. Hours can vary and not great if you aren't in a set department, but awesome if you are and like a set schedule. \r\nSome staff has been in positions too long and have gotten grumpy and stale. Bad for the staff and working environment."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Great Learning Experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Oct 2020", "job_title": "Veterinary Technician in Jamaica Plain, MA", "duration": "N/A", "pros": "a fast-paced teaching hospital (lots of interns doing rotations), everyone is really nice and helpful, since it's a larger hospital there are many referrals so you see a wide range of cases. Its a great learning experience for a few years.", "cons": "The pay isn't great for employees especially being such a large hospital especially with how expensive the cost of treatments and surgeries are (depending on which department you choose to work in). Since it's a larger hospital every field is compartmentalized, ie radiology, inpatient, clinic, CCU, surgery, etc, so once you're in a department you won't learn much else which can fade away any other skills you might have. It's a very busy hospital which in departments like inpatient, clinic and ccu can be extremely overwhelming (personally, i thrived in the chaos and learned the most, however it can be exhausting). \r\n\r\n*This company also did nothing for current employees through the COVID-19 pandemic."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "If you want to advance/ specialize as a vet tech work at Angell", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Oct 2016", "job_title": "Anesthesia Tech in Boston, MA", "duration": "N/A", "pros": "great co-workers (both techs and doctors), competitive rates of pay (I've looked around!!), lots of room for growth (I've seen many techs move to anesthesia from other departments because they want more of a challenge), cutting edge medicine (Angell is a teaching hospital so they are at the forefront of new medicine), there is every specialty under one roof, the benefits packages are great (again I've looked around! and nothing come close to what Angell offers).", "cons": "This place is so popular they need more qualified, dedicated, experienced techs, we are so dedicated we work long hours so that the quality of care is never compromised. Boston is an expensive place to live, but it is such a great city."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not what it seems", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jun 2017", "job_title": "Customer Service in Boston, MA", "duration": "N/A", "pros": "Contributing to the care of animals. Seeing really cute pets everyday. Decent benefits. The building is nice and renovated in some areas.", "cons": "The scheduling is pathetic, and that goes along with the management. It makes it difficult to balance your personal life along with your work life. As for the management, the attitude and \"cliquey\" vibe they give off is anything but professional. They repeatedly make snarky comments, make you feel stupid for asking questions and have an incredibly negative attitude. For the amount of crazy and impatient pet owners you have to deal with, the pay isn't nearly enough. I understand it's a non-profit, but for a full time position this isn't even enough to live on month to month."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "This is a organization that cares about it's employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jul 2018", "job_title": "Cert Vet Tech in Boston, MA", "duration": "N/A", "pros": "I recently met with the Angell staff Social Worker after the loss of my own pet.  What a great thing.    I've worked at other corporate animal hospitals and I've never had the benefits, or employee appreciation days that happen here.  I really like my co-workers and am lucky to be working alongside a really great vet. I've recommended friends from other jobs to come here.", "cons": "This is a very busy hospital and you are you are really tired at the end of a day."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The MSPCA is a place with heart, a great staff, and a steady rising, caring environment for animals and people.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Feb 2014", "job_title": "Anonymous Employee in Boston, MA", "duration": "N/A", "pros": "Shared mission among all staff, improving communications, and a new values based hiring and evaluation system.  And after decades of silos of animal welfare and animal health departments being so separate, there are a lot of new joint efforts to bring everyone together and understand the importance of all the parts.", "cons": "There are expectations to be all things to all people, and there just isn't enough time in the day which is 24/7 anyway."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very stressful place to work", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Aug 2013", "job_title": "Client Service Supervisor in Boston, MA", "duration": "N/A", "pros": "Everyone there really loves animals, and you can get a discount on excellent care for your own pets.", "cons": "I left MSPCA-Angell in 2007 so things may have improved since then.  I remember it as a stressful place where employees were quick to point fingers when something went wrong.  In particular the overworked interns, and some of the older doctors, were not very nice to the staff.  Turnover was high for client service positions and emotional confrontations were common.\r\n\r\nI was there during the comm center debacle. The president at the time insisted on replacing all the specialized customer service people in the various departments with a call center full of generalists.  It was a complete disaster but we tried extremely hard to make it work.  Lots of people quit or were fired over it.  MSPCA now has a new president, and from what I hear they have been gradually going back to the old client service by department model.\r\n\r\nSome of the stress comes from the fact that owners are concerned about their pets, and they are paying out-of-pocket, so they have to deal with financial situations that they wouldn't at a human hospital (if they have insurance).  This is exacerbated by MSPCA-Angell's awkward identity crisis.  On the one hand, it is a charity that gets a lot of attention for helping animals, so MANY clients come there assuming it is a low-cost clinic.  It's not!  Angell's goal is to be the best animal hospital in the country, and they charge for it.  They do give out a lot of financial assistance, but there are so many pet-owners asking for help, each person's chance of getting it is tiny.  As a result, working there you will hear tons of horror stories about people who shelled out tons of money and didn't get the results they expected, or felt pressured by the vet to put their animal to sleep because they couldn't afford high-end care.\r\n\r\nWhenever I had to deal with HR they acted as if the staff were their enemies.  Once an HR rep made one of my employees cry while discussing her medical leave."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Great place with passion, lack of employee engagement and growth opportunitities", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Jul 2019", "job_title": "Assistant/Client Care Coordinator in Boston, MA", "duration": "N/A", "pros": "Great mission, everyone cares about their role and what they do. \r\nGood benefits for a non-profit\r\nAbility to learn and move amongst different department", "cons": "lack of upward growth potential\r\nlow pay- but it's a non-profit\r\nPoor management/ hierarchies- lack of oversight allows certain employees to underperform even act negatively towards other employees with little to no punishment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "My time at Angell West was great, I learned so much!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Feb 2020", "job_title": "Kennel Attendant in Waltham, MA", "duration": "N/A", "pros": "Angell West  (in Waltham, MA) was great because it has all the amenities as the Boston location, just in a smaller facility, so it's a great introduction to veterinary hospitals if you are starting in the field. \r\n\r\nColleagues were great! Everyone from the Veterinarians to the Client care specialist was friendly and supportive. The West team was so close-knit, and I liked that as a new employee. To see team members banter, joke, and get along with each other, was beautiful and it was a nice work family. \r\n\r\nThe benefits are great! I loved getting 50% off for services/procedures/ medication/food for my pet's and working there I definitely utilized this benefit a lot. Insurance and retirement benefits are also great as long as you are a full-time employee (40 hours per week). \r\n\r\nThat brings me to my next pro; the work schedule is great. As a Full-timer, you work 40 hours a week (4 - 10 hour days), which gives you three days to relax and recuperate. Just be aware that you will probably work alternating weekends. I've listed an example below. In one month, your schedule may look like this.\r\n \r\nWeek 1 - Mon, Tue, Wed, Fri \r\nWeek 2 - Sat, Sun, Wed, Thur \r\nWeek 3 -Mon, Tue, Wed, Fri \r\nWeek 4 -Sat, Sun, Wed, Thur \r\n\r\nYou learn a lot! As someone who is passionate and was going to school to be a CVT during my employment. I learned so much from working in the field. And I can say that it helped me learn much faster than others in my class who were not working at a veterinary hospital.", "cons": "Burnout and compassion fatigue was real for me because I picked up so many hours during the first three months of employment, and this can take a toll on you very quickly and make you tired of the job right away. Don't be like me, pace yourself, and even when you want to help out and cover shifts. Remember to allocate days/time for yourself to relax and stay in the moment. There is no need to rush.\r\n\r\nOvernights were rough (9:30 pm to 7:30 am). Although it paid well with the third shift differential added to your hourly wage (additional $5.00 in my case), I wouldn't recommend it for someone who has other responsibilities during the daytime (school, children, etc.).  \r\n\r\nAnd because I worked overnights, I barely saw management. We only got to communicate during the 60 min overlap when the daytime shift would come in at 6:30 am to 7:30 am when I've got one foot out the door because I need sleep."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "employees are not valued", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Jan 2016", "job_title": "Anonymous Employee in Boston, MA", "duration": "N/A", "pros": "Most other employees are very committed to their jobs, very motivated and are pleasant to work with", "cons": "Employees are very undervalued; yearly reviews never happen, raises are non-existent,  Salaries are out of line for cost of living in the boston metro area and because of this the hospital is chronically understaffed and the vast majority of the work force is burned out"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "high stress, low pay", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jun 2017", "job_title": "Anonymous Employee in Boston, MA", "duration": "N/A", "pros": "Healthcare. Honestly it's good healthcare but sadly that's the only pro of working here.\r\n\r\nOh and the staff doctors are wonderful people.", "cons": "\"False advertisement\" during interview process. Guaranteed me certain things that I have come to find out are just not true. For example. We are told in the interview process that we will be given the opportunity to scrub into surgeries. It was made to seem like it would be a fairly regular thing. It's almost a year in and I have yet to even come close. This is sadly only one example of many. \r\n\r\nPay. It is 100% an un-livable wage in the Boston area. They will take advantage of you whenever possible. Shame on management and \"higher-ups\"\r\n\r\nForced to work overtime. Many are forced to stay late on cases (almost on a daily basis), this leads to burnout and exhaustion. When brought up to management \"well this isn't a desk job so that's just the way it is\"\r\n\r\nClear favoritism. Certain people get away with things that others do not (on a regular basis). Again, brought up with management and their response was \"no we don't\"\r\n\r\nDon't even get me started on on calls. It's a total disaster.\r\n\r\n\r\nAll in all you work very long hours with sometimes extremely difficult cases and there's almost nothing to show for it besides added stress of trying to scrounge up enough money to live. Honestly it's not worth it. And you can feel the exhaustion and burnout throughout the department, it's a very negative environment. (We try to laugh and make jokes as much as we can but at the end of the day we all feel totally taken advantage of)"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Would not recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Sept 2016", "job_title": "Veterinary Technician in Waltham, MA", "duration": "N/A", "pros": "Flexible work schedule, paid uniforms/scrubs, experience working in ER, benefits, and that is about it. Sorry. (This is making me fill 20 words in order to move onto next section of this review).", "cons": "Management is poor, technicians who have friendships with management outside of the hospital get away with their poor attitudes towards other staff members. The newbies are treated poorly and are not given the opportunity to do anything, and you are judged by everything you do right or wrong."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "AAMC allowed me to practice my career in a very innovative, rewarding and gratifying environment .", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 Sept 2018", "job_title": "Internal Medicine Vet Tech in Boston, MA", "duration": "N/A", "pros": "Multiple advance learning and continuing education opportunities, great benefits, outstanding comradarie and team work, trending animal medicine practices/theories, world-renowned and accreditated veterinarians, 15+  specialty- specific departments", "cons": "The financial politics and corporate procedures vs the welfare of an animal"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Recommend for services, NOT as a place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jan 2020", "job_title": "Client Care Specialist in Boston, MA", "duration": "N/A", "pros": "You get to see a lot of animals.", "cons": "I joined the MSPCA because I was beyond satisfied as their client. However, I do not recommend working in a front end staff position. Poor management. Understaffed so PTO often gets denied. You are constantly MICROMANAGED. NO Independence in the Front Staff positions. \r\nI can't speak for other positions, only for non-medical front desk positions. If you have a degree- you are OVER QUALIFIED and under appreciated. \r\nI was also discouraged by the lack of help they provide clients who cannot afford care."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Anesthesia tech", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Nov 2016", "job_title": "Anesthesia Technician in Jamaica Plain, MA", "duration": "N/A", "pros": "Quality medicine, good patient care.", "cons": "Too compartmentalized. In my department alone we had one main boss, two techs as bosses, and then a lead tech to manage a crew of 15. Too micromanaged. Not compassionate either it was VERY by the books. Had a very cold feeling. Also felt the people managing had no business managing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work -no other animal hospital like it!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "24 Sept 2019", "job_title": "Anonymous Employee in Boston, MA", "duration": "N/A", "pros": "try to help every animal they possibly can, flexible work schedules, lots of employee incentives, competitive wages , great benefits, fun people to work with", "cons": "hard to find technical staff"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great medicine, not so great for workers", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Jun 2019", "job_title": "Veterinary Technician in Boston, MA", "duration": "N/A", "pros": "The staff is amazing and it truly is some of the best veterinary medicine in the world", "cons": "long working shifts, sometimes you don't get a break, management doesn't connect with what happens in the hospital"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing group of people.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Dec 2013", "job_title": "Animal Care & Adoption Counselor in Jamaica Plain, MA", "duration": "N/A", "pros": "You get to do a great deal of good in the world, help people adopt the right animals for their family.", "cons": "Very emotionally draining work. You cannot save every animal, as much as you would like to."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great Clients & Coworkers! Horrible Management and Procedures", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 May 2016", "job_title": "Technician in Boston, MA", "duration": "N/A", "pros": "Coworkers are fantastic.\r\nClients and their animals are great\r\nArea of Hospital Location\r\nEvents at the Hospital", "cons": "Management is set, won't fire or change them no matter how many employees complain.\r\nMost management has no former experience (theater major running a pharmacy)\r\nWon't hire more help, just ask you to do more\r\nDon't follow standard pharmacy protocol\r\nManagement is fake and will talk behind you back\r\nNo room for advancement\r\n3 people quit at the same time."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Pretty decent", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Sept 2020", "job_title": "Community Animal Welfare Specialist in Methuen, MA", "duration": "N/A", "pros": "Base pay is decent for being an animal care position\r\nComp pay/time for holidays\r\nReviews with raises", "cons": "Finicky on approving overtime, would rather comp hours worked (come in late the next day, etc.)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Apr 2019", "job_title": "Primary Care Attendant in Albuquerque, NM", "duration": "N/A", "pros": "Amazing Benefits, parking, overtime opportunities, continued learning, understanding management, part of mspca, discounts, great community, quick job advancement", "cons": "Understaffed, underpaid, location, glorified kennel attendant, bottom of the totem pole"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Ok job", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Jul 2016", "job_title": "Veterinary Technician in Waltham, MA", "duration": "N/A", "pros": "GreaT benefits and access to amazing doctors and all the best equipment", "cons": "Treat employees like slaves and treat them all differently depending on friendship outside hospital."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great Place to work and learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Aug 2018", "job_title": "Veterinary Technician in Waltham, MA", "duration": "N/A", "pros": "High standard of medicine, training, many paid holidays, and compensation for snow days", "cons": "Lower pay than other places, hard to advance"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Adoption Counselor", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Jul 2019", "job_title": "Adoption Counselor in Boston, MA", "duration": "N/A", "pros": "working with animals all day, working for an amazing organization", "cons": "burn out, long hours, pay"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": 3, "review_title": "Worked in Kennel/Cattery", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jan 2015", "job_title": "Kennel Assistant in Boston, MA", "duration": "N/A", "pros": "Nice people, good first time job", "cons": "somewhat stressful upper management at times"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "MSPCA", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Sept 2015", "job_title": "Anonymous Employee in Dedham, MA", "duration": "N/A", "pros": "Working with people with a common goal", "cons": "Upper management and pay"}]]