[[{"date": "15 Dec 2020", "title": "Phone Call Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Lawrence Technological University (Southfield, MI) in Oct 2019", "Interview Descriptions": "The interview was brief and straight to the point. This job was for uni students on campus, so it wasn't anything too formal. It lasted less than thirty minutes and the interviewer was very kind and enthusiastic.", "Interview Questions": "What motivates you to do well?"}, {"date": "4 Oct 2018", "title": "Assistant Football Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Lawrence Technological University (Southfield, MI) in Jul 2018", "Interview Descriptions": "Great people, great support, and hreat experience. The coaches are honest snd upfront with expectations. They are willing to help with open arms. I would recommend this position to anyone that wants to get their coaching career startedz", "Interview Questions": "What brings your interest here?"}, {"date": "4 Dec 2018", "title": "Assistant Football Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Lawrence Technological University (Southfield, MI) in Jun 2018", "Interview Descriptions": "The interview process begin with an over the phone interview which lasted about 20 minutes. It was a chance for the head coach to see where my head was. Next, I was brought into the office", "Interview Questions": "What is it about coaching that caused your interest?"}, {"date": "11 Oct 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Lawrence Technological University (Southfield, MI) in Feb 2018", "Interview Descriptions": "Application. Interview with current RAs. Interview with RHCs. If you make it past this then you go into group process where they watch the way you work with other people during different scenarios.", "Interview Questions": "Tell us about yourself"}, {"date": "15 Dec 2017", "title": "Note Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Lawrence Technological University (Southfield, MI) in Dec 2016", "Interview Descriptions": "I was initially contacted via email and had a single interview where I was hired on spot. The office was small but friendly and housed other departments (besides disability services.)", "Interview Questions": "Can you type or write understandably for a student with extra needs?"}, {"date": "14 Jul 2016", "title": "Graphic Design Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Lawrence Technological University (Southfield, MI)", "Interview Descriptions": "Overall a good one, Pretty straight forward. Discussed history, your skill sets, review your previous projects. Very Friendly. Brought in both my digital and printed portfolio which aided my process greatly.", "Interview Questions": "What would you like to bring to the University?"}, {"date": "19 Jan 2016", "title": "Note Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lawrence Technological University in Dec 2015", "Interview Descriptions": "It was good. You can crack it as long as you have confidence in yourself. Be straight to the point and with right attitude. Maintain eye contact. Know the job roles beforehand.", "Interview Questions": "Why do you think you are fit for this job?"}, {"date": "23 Sept 2016", "title": "International Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Lawrence Technological University (Southfield, MI) in Jan 2015", "Interview Descriptions": "Defined clear targets and objectives and communicated them to other team members.\r\nEstablish and build connections with students from over ten foreign countries to acclimate student to campus.\r\nSupport students during move-in process and attend international Welcome Week programming alongside\r\nstudents new to the United States.\r\nMentor international students through program planning and execution, including International Festival,\r\nChinese New Year and Holi Celebration.", "Interview Questions": "Do you have anything international experience."}, {"date": "25 May 2016", "title": "Enrollment Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Lawrence Technological University (Southfield, MI) in Nov 2014", "Interview Descriptions": "Basic Behavior Based Interview. Asked about prior experience, worked through resume. Interviewed with the Registrar and the Assistant Registrar. Took only about 30 minutes or so. Then I \"interviewed\" with a member of the team I would be working with. really was just a Q and A session. Actually was offered a different job that I did not interview for .", "Interview Questions": "How do you work in a team ?"}, {"date": "16 Mar 2015", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Lawrence Technological University in Jul 2014", "Interview Descriptions": "I applied for a different position, but I was contacted by their admissions director for an admissions counselor position instead. They contacted me for a phone interview, but would never give me a straight answer or return my inquiries despite telling me they would get back to me. Keep in mind that they suggested the position to me, I did not initially apply for it. I am qualified for the position because I have interviewed for the same position with larger schools, but they seem to prefer their own graduates even if they don't have relevant experience. I can handle not getting a job, but it was very rude not to follow through like they said they would.", "Interview Questions": "Are you familiar with the territory that you would be assigned to cover? "}], [{"date": "9 Dec 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lawrence Technological University (Southfield, MI) in Oct 2011", "Interview Descriptions": "One on One Skype interview with the department chair.  Questions were asked regarding my pedagogy, practice, experience.  The process was very easy, the questions were fair and focused. Very professional even through the skype interface.", "Interview Questions": "How do you use technology in the classroom?"}]]