[[{"date": "24 Jul 2023", "title": "Property Surveyor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanctuary (London, England) in Jul 2023", "Interview Descriptions": "This company is misleading and job description does not fit role. Much heavier workload than they make out in interview process and lower salary than competitors for work involved. If this company had passion for people they would be more transparent", "Interview Questions": "What do you know about sanctuary housing"}, {"date": "31 Mar 2022", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Sanctuary", "Interview Descriptions": "Applied for the job and then two weeks later I had a interview with two location managers, questions were compentancy based, interview lasted about 45 minutes, then followed by a simple paper test that took 10 minutes to complete.", "Interview Questions": "Give me a time when you have dealt with a difficult customer, and what did you do?"}, {"date": "27 Aug 2021", "title": "12-month Rotational Placement With Sanctuary Graduates Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanctuary (London, England) in Aug 2021", "Interview Descriptions": "Interview via telephone about 15 to 20 minutes \r\nThe day-to-day activities of the role or what projects they can expect to participate on\r\nDetail on what the graduate community and company culture is like\r\nAnything which will make the applicants will feel more engaged and connected to the company.", "Interview Questions": "motivations for the role/ company, followed by some competency-based questions "}, {"date": "28 Feb 2023", "title": "Summer Vacation Scheme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Sanctuary in May 2021", "Interview Descriptions": "It was a very quick and easy process with nice people. I was successful in the position i applied and interviewed for, and was a straightforward process from there on out.", "Interview Questions": "What makes you a good candidate for this role"}, {"date": "2 Feb 2020", "title": "Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sanctuary (London, England)", "Interview Descriptions": "The interview process was pretty straight forward I first received a phone interview from the recruitment team which was successful then had a interview with the care home manager.", "Interview Questions": "What would you do if a patient to you they had been giving money to one of the staff"}, {"date": "21 Jan 2020", "title": "Mental Health Support Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sanctuary (Middlesbrough, England) in Jan 2020", "Interview Descriptions": "You apply online and if you are successful you are invited to an interview where there will be two panel members with a list of about 10 questions.  The panel will ask five questions each between themselves.  The interview was done in a relaxed environment.", "Interview Questions": "What is your definition of a person at risk?."}, {"date": "24 Nov 2019", "title": "Bank Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sanctuary", "Interview Descriptions": "Applied online. They took about six weeks to get back to me. Invited for an interview at the home. Interviewed by home manager and senior nurse. Felt very informal and friendly. They guided me to give the right answers. I was incredibly nervous going in as I'd never had an interview before, but it was honestly fine.", "Interview Questions": "What are important things to consider when taking a meal to a resident?"}, {"date": "8 Jan 2020", "title": "Personal Support Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sanctuary (Darlington, North East England, England) in May 2019", "Interview Descriptions": "Very hectic, interviewed by 3 members off staff felt bombarded with questions. Didn't get a look around the building to get some idea how works and didn't get the chance to greet other staff members.............", "Interview Questions": "Previous experience "}, {"date": "17 May 2023", "title": "Grounds Maintenance Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanctuary in May 2019", "Interview Descriptions": "Online application, relatively easy to complete and then invited to a Competency based interview on skill set, experience you bring to the role, challenges you've encountered in previous roles, customer service experience.", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "7 Apr 2019", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Sanctuary", "Interview Descriptions": "Applied with CV and supporting statement online. Several weeks later was then invited to interview at site.  Several people on the panel, both were friendly and welcoming, quite relaxed process.", "Interview Questions": "What does compliance mean to you? "}], [{"date": "25 Feb 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Sanctuary (London, England) in Jan 2019", "Interview Descriptions": "skype interview, the panel will introduce themselves, you will introduce your self, the questions will revolve based on your CV/nursing experience, you can ask questions afterwards (ex. regarding patient-nurse ratio, trainings, seminar)", "Interview Questions": "Tell me something about your nursing experience"}, {"date": "27 Nov 2018", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Sanctuary (Liverpool, England) in Nov 2018", "Interview Descriptions": "Received an email stating that I'd been successfully shortlisted to attend an interview. I was interviewed by 3 ladies who were wonderful at putting a nervous applicant at ease. Regardless of whether I'm successful or not I appreciate even being considered. All in all looks like an excellent exciting company to work for.", "Interview Questions": "Why do you want this role?"}, {"date": "20 Mar 2022", "title": "Housing Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sanctuary (Worcester, England) in Feb 2018", "Interview Descriptions": "Interview and written test structured interview asking for examples to demonstrate skills. The written test gave scenarios and you had to say how you would deal with that situation and explain your actions", "Interview Questions": "About experience and skills, give examples of situations "}, {"date": "19 Dec 2018", "title": "Asset Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Sanctuary (Hackney, England) in Jan 2018", "Interview Descriptions": "Applied online and was contacted roughly 3 weeks later by the Asset Manager from the Hackney office. I was invited for an interview 1 week later. \n\nAttended the interview and from my understanding interview went well. Typical interview questions. A few questions that might throw someone off without the  experience for this particular role. A few situational questions. \n\nI was told I would be contacted within a week as they were interviewing other candidates. I heard \nnothing for 1 week. I then sent an email to follow up and was ignored. I was not able to get through to any of the interviewers the following week. Line just kept ringing. \n\nAll my emails have been read and ignored. My final attempt was yesterday almost 1 month later after the interview and finally got through to the Asset Manager Who said he will call me back in 30 mins. Guess what...no call back. \n\nGranted, I didn’t get the role, but at least have the decency to respond and give an update to all interviewees who spent time travelling, taking time of work and preparing for the interview. \n\nIt just shows the professionalism that this company has. They do not bother to get back to you if your not a suitable candidate.", "Interview Questions": "Tell me about yourself"}, {"date": "16 Mar 2021", "title": "Surveyor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Sanctuary in Nov 2017", "Interview Descriptions": "The interview was conducted by two people, a team manager and an additional senior team member. There was a short introduction conversation which was followed by standard questions. After the interview the job offer came through in a few days.", "Interview Questions": "Describe your involvement in a project"}, {"date": "1 May 2019", "title": "Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sanctuary (London, England) in Jul 2017", "Interview Descriptions": "Asked about experiences and questions designed to explore your questions\r\n\r\nMake sure not to leave any gaps on employment history or have character references to fill them as they can greatly slow down the hiring process once a job offer has been received", "Interview Questions": "Give an example of when you have shown kindness in the work place"}, {"date": "15 Dec 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sanctuary (London, England) in Feb 2017", "Interview Descriptions": "\\the interview process was good, professional they were kind and helped me a little bit. I was so happy to get this  job; but shortly  realized it is not what i excepted. the supportive staff disappeared and for two days they wanted me to act as  have  full knowledge   for everyhting", "Interview Questions": "What was my last kindness act"}], [{"date": "28 Oct 2016", "title": "Finance Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sanctuary (Worcester, England) in Oct 2016", "Interview Descriptions": "The interview was held by the Manager and her Assistant. The interview was not hard, in addition there were two tests and 30 minutes were given to complete the test. \r\n\r\nHowever, I had no reply from them at all. I was reassured that every candidate will receive email with offer/no offer. I was waiting for two weeks, so emailed the lady who held the interview, but still no reply at all. I think it is very unprofessional and just has negative impact on the company overall.", "Interview Questions": "Competency based questions "}, {"date": "13 Feb 2017", "title": "Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Sanctuary (Ipswich, England) in Oct 2016", "Interview Descriptions": "Very relaxed but I had to do a little 20 minute test. Interviewer very friendly. Interview questions asked and interview lasted about 20 minutes. It was a one to one. The manager and I actually got on really well he made the environment so comfortable.", "Interview Questions": "What is the role of a care assistant?"}, {"date": "29 May 2016", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sanctuary (Banbury, England) in May 2016", "Interview Descriptions": "Through an agency, lady was absolutely lovely, bubbly and friendly, talked about the job role,skills I could offer, what the role entails, training process, hours required, background of the company, felt at ease with the interviewer which always makes a big difference as you can be yourself more, talked about what I had done before and how I could use it in the job, was also asked what had I done to go above and beyond for a customer", "Interview Questions": "What can you bring to the role"}, {"date": "22 Jun 2016", "title": "Surveyor Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Sanctuary (Coventry, England) in May 2016", "Interview Descriptions": "Brilliant, one to one formal meeting at hotel in Coventry; relaxed atmosphere with no interruptions. Finding the approach less formal than some other interviews recently which helped the interview more easier.", "Interview Questions": "How much experience on CDM"}, {"date": "26 Dec 2017", "title": "Deputy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Sanctuary (Banbury, England) in Feb 2015", "Interview Descriptions": "A three-person panel explain the job and ask predefined questions in turns. Each member gives scores to each answer, though scores may be adjusted to fit the desired outcome. An interviewee is given an opportunity to ask questions at the end.", "Interview Questions": "With what other organisations does Sanctuary partner?"}, {"date": "20 Jan 2015", "title": "Senior Online Marketing Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Sanctuary (Worcester, England) in Jan 2015", "Interview Descriptions": "Via an agency. Agency staff were really helpful in preparation. \r\nInterviewing staff were professional and enthusiastic about the company.\r\nThe offices in Worcester are fantastic, modern, bright. Next door to the University and racecourse so it was possible to use either their on site restaurant or the Uni's refectory or take strolling lunch outside the racecourse by the canal. They also have a small gym for staff or you can join the Uni's.\r\nThey were keen to offer ongoing training and development including 'knowledge bursts' at lunch-times.\r\nI would have loved to join the team.\r\nThey did not keep me waiting long for a decision and gave positive feedback through the agency (Blue Skies)", "Interview Questions": "Can you describe a incident of conflict at work and how you managed the situation?"}, {"date": "18 Jan 2018", "title": "Finance Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sanctuary (Worcester, England) in May 2013", "Interview Descriptions": "Competency based interview, questions aimed at scenarios, asking  you how you've coped with situations in the past. Include customer service, how you communicate and keep customers up to date. I was over qualified due to my previous job, so I found it really easy.", "Interview Questions": "If you have two customers with the same deadline, what do you do?"}, {"date": "20 Feb 2013", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sanctuary (Worcester, England) in Nov 2012", "Interview Descriptions": "This was a very structured interview, and had an uneasy edge. I had to give a presentation but was given no opportunity to use paper or powerpoint. I was asked about my computer skills", "Interview Questions": "I was asked how the current scheme compared to schemes they are using at the moment, but there was no way of finding out what they use at the moment because the information was not on their website."}, {"date": "16 Feb 2016", "title": "Cleaner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Sanctuary (Dundee, Scotland) in Apr 2012", "Interview Descriptions": "Very quick, we literally got given a couple of minutes with the interviewer. There were tables lined up, and we were all given numbers and called up to a table to have the interview.", "Interview Questions": "When have you shown leadership?"}]]