[[{"date": "11 Jan 2023", "title": "Certified Medical Assistant (CMA) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Health First", "Interview Descriptions": "You will be contacted by a recruiter first, then if you make it through, you will go to a manager then, possibly another interview with the team. Make sure that you know about the values of the company! This is an important part of the job and the company!", "Interview Questions": "Define integrity in your own words. (This is part of the I-care values!)"}, {"date": "13 Jan 2023", "title": "Phlebotomy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Health First (Miami, FL) in Jan 2023", "Interview Descriptions": "very fast and non complicated questions were asked. mostly about your experience and how you attach their core values to your everyday life. overall the interview processes is very fast and the recruiters are super friendly and helpful", "Interview Questions": "what are your strengths ?"}, {"date": "20 Nov 2022", "title": "Appeals Nurse Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (New York, NY)", "Interview Descriptions": "It started with a 15 min phone call from a recruiter then the following week a 1 hr zoom call with two managers on video. They were professional yet friendly and wanted to know why I was interested in the company.", "Interview Questions": "Describe a time when you handled a difficult situation inappropriately and what you could have done differently."}, {"date": "26 Sept 2022", "title": "Customer Service Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Health First", "Interview Descriptions": "1st Phone call followed by an in person and another phone call. The process is long and the talent acquisition team is not the greatest! Good luck if you pass the screening! ", "Interview Questions": "What your prior positions required and references "}, {"date": "3 Dec 2022", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in Sept 2022", "Interview Descriptions": "Easy interview done via zoom. Basic interview questions. I got the job after one zoom interview. Training is a long process, lots of online course work to complete with mandatory in person days at the training center. Be sure to request off from your current position to accommodate these training days.", "Interview Questions": "Tell me about yourself, how do you do under pressure, why did you choose to apply to this unit"}, {"date": "16 Oct 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Health First in Aug 2022", "Interview Descriptions": "Interview was done over Microsoft Teams with the Director. Lasted about 30 minutes. She asked me what questions I had for her, if any. She shared her vision for the role and what my tasks would look like.", "Interview Questions": "What experience did I have in similar roles. How do I view myself working with numbers and analyzing. How do I prioritize tasks. When was a time I had to be creative in solving a solution."}, {"date": "31 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in Jul 2022", "Interview Descriptions": "Interviewed with nurse recruiter as new grad. They were very friendly and easy to talk too. The recruiter was knowledgeable, and got back to me at a timely manner. The interview was recorder through the phone (COVID time) and sent to unit i applied too.", "Interview Questions": "why are you interested? strengths and weakness?"}, {"date": "29 Jul 2022", "title": "Nurse Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in Jun 2022", "Interview Descriptions": "The process consists of applying and being declined immediately.  One of this positions qualifications require that you be enrolled in an LPN/RN program and ypu must've completed at least the 1st Semester and so on....well get ready to hurry up and wait or to have all of your apps declined. Exactly what's happening to me. I meet ALL of the qualifications and because of that I was confused as to why I was being declined..so I asked and was told they don't hire LPNs so if I eas hired I'd be fired when done with school....\nYET THE JOB SAYS LPN!! MAKE IT MAKE SENSE!! This place is terrible at hiring. The process is entirely too long and forget it if you've ever had a run in with anyone there or God forbid someone is threatened by your education and/or knowledge. They'll decline ypu because they're insecure and afraid you'll take their job.", "Interview Questions": "N/A"}, {"date": "12 May 2022", "title": "Health Information Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Health First", "Interview Descriptions": "Phone interview and in person interview.  The process was fairly fast. First I got an interview invitation on my email. I then did and electronic phone interview. I was then called for another interview", "Interview Questions": "What was a difficult situation you were in and how did you handle it. "}, {"date": "7 Apr 2022", "title": "Patient Services Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in Apr 2022", "Interview Descriptions": "Non-existent. I was scheduled for a 9AM teams interview with the hiring manager through a recruiter. I signed in on the laptop and even called in and nobody else came to the interview. I reached out to the hiring manager about this through LinkedIn but he never responded back. I also called the Health First hiring center. A different recruiter called back the next day and stated that the interview was cancelled and that someone else was hired for the position beforehand. when asking why I wasn't notified beforehand, he stated they have been having technical issues the past few days. He could not, however explain why someone could not have called me to inform that it was cancelled beforehand.", "Interview Questions": "N/A"}], [{"date": "24 Feb 2022", "title": "Business Intelligence Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Health First in Feb 2022", "Interview Descriptions": "Submitted through a recruiter. After a week or so they put the job on hold. Then a few weeks later reopened the job after a rewrite. Recruiter gets in touch and says the hiring manager wants to schedule an interview, likes what they see. Great! Scheduled the call on short notice and then after a few hours the call is cancelled.\r\n\r\nNext day recruiter calls to say they are again rewriting the job duties/description. Hiring manager changes direction again, says background isn't a fit.\r\n\r\nTime to move on. If this is an indication of how the dev environment is managed I'll pass, thank you very much.", "Interview Questions": "N/A"}, {"date": "31 Jan 2022", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First", "Interview Descriptions": "1) Preliminary phone interview 2) In-Person interview in clinic 3) Phone Call with HR for job offer. Very organized and professional process. I was not able to negotiate higher salary.", "Interview Questions": "They asked about my experience, strengths, and weaknesses. "}, {"date": "14 Sept 2021", "title": "Cardiac Sonographer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Health First", "Interview Descriptions": "Typical interview process. Reviewed job requirements and asked technical questions.  Nothing out of the order.  Be prepared to offer scenario based answers. Friendly series of interviews that weren’t too long in length.", "Interview Questions": "What is my formal education? "}, {"date": "1 Sept 2021", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Health First (Melbourne, FL) in Aug 2021", "Interview Descriptions": "Difficult only because I have never applied as a phlebotomist but they made me feel comfortable.  Waiting to hear from the reqruting agent . Asked me questions on why do I want to work for this company \r\nHow would I describe myself as a person \r\nWhy should we hire you", "Interview Questions": "What describes me \r\nWhat difficult situation have I been in that I resolved "}, {"date": "9 Sept 2021", "title": "New Nurse- Trauma Neuro Surgical Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Health First (Melbourne, FL) in Jul 2021", "Interview Descriptions": "Easy interview, mostly the leadership for the floor telling me about the position and asking me what my favorite part of nursing is.  They said I would hear back from them and I got an offer letter the same day.", "Interview Questions": "What is your biggest weakness?"}, {"date": "4 Feb 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL)", "Interview Descriptions": "The entire process was pretty slow, each party was slow to respond, not kept updated on process, recruiter was nice but did not seem to know what the hiring parties were actually looking for.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Feb 2021", "title": "Patient Service Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First in Feb 2021", "Interview Descriptions": "It was a two-step interview process. The first step is done through the phone (or computer) where you dial into a number and answer 4-5 pre-recorded questions. From here, I received a call from a hiring recruiter who set up a virtual interview with the supervisor and manager. Both the manager and supervisor were very friendly and created a relaxing environment.  Waiting to hear if I was selected.", "Interview Questions": "Tell me about yourself, where do you see yourself in the next five years"}, {"date": "21 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in Feb 2021", "Interview Descriptions": "Automated questions over the phone,  received a call for an in person interview within an appropriate amount of time and was set up with an interview in the next few days.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "19 Jan 2021", "title": "Patient Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Health First (Melbourne, FL) in Jan 2021", "Interview Descriptions": "My interview experience was great, we spoke in detail about the various aspects of the position and what experience I’ve had working in roles similar to this. There were some behavioral questions. All in all this was probably one of the better interview experiences I’ve had.", "Interview Questions": "Tell me about a time where you dealt with a difficult customer, how did you turn the situation from a negative to a positive?\r\n\r\nMost of the questions were very common place with what I’ve experienced with various other companies."}, {"date": "16 Feb 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First in Jan 2021", "Interview Descriptions": "The interview process was quick. I got an email the next day to do an online interview and then following that were two additional interviews,  one with the recruiter and then the hiring manager.", "Interview Questions": "Tell me about a time you handled a difficult situation?\nWhat makes you a great candidate? "}], [{"date": "24 Dec 2020", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Miami, FL) in Dec 2020", "Interview Descriptions": "Phone screening and business interviews were well conducted and pleasant. Looking forward to hearing from the company on whether or not I was selected. So far I'm pleased with their interview performance.", "Interview Questions": "Explain with detail a notable professional accomplishment."}, {"date": "13 Nov 2020", "title": "Health Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL)", "Interview Descriptions": "Interviewer was late and the had no structure to their questions. Was unprofessional. Questions didn't all apply to position. Expected me to know all their protocols and not willing to train.", "Interview Questions": "How would you explain congestive heart failure and the package we give to go home with?"}, {"date": "11 Nov 2020", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Health First (Rockledge, FL) in Oct 2020", "Interview Descriptions": "Easy going. It was virtual and the management made you very comfortable. I was asked a total of 5 questions.  They were not hard.  Make sure to research the company and be ready. They want to make sure you are going to stay.", "Interview Questions": "They asked about the company and why you wanted to work there."}, {"date": "30 Sept 2020", "title": "IT Field Services Tech II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Health First (Melbourne, FL) in Sept 2020", "Interview Descriptions": "Virtual interview due to Covid-19. Found the job listed through a college job site, yet I was told there were no entry-level positions available and my years in tech support were insufficient because it wasn't done in the sort of environment they wanted them in. Why post on a COLLEGE job site if you won't even consider an entry-level candidate?! It makes NO sense to me at all.", "Interview Questions": "What my IT background was, and how many years of experience I had?"}, {"date": "25 Aug 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in May 2020", "Interview Descriptions": "30 minute phone call interview. The questions were very basic. The phone interview went well and I was told I could expect to hear back in 2 weeks. After follow up several times, i never heard anything back.", "Interview Questions": "Why did you chose to apply at this company?"}, {"date": "26 Jan 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in May 2020", "Interview Descriptions": "Screening interview and then team interview.  Much of the interviewing revolves around the core values of the company so make sure you are able to discuss related to your experience.  The interview is not overly-hard, but I was caught off-guard by the questions since I was expecting a more technical interview.", "Interview Questions": "What is our company's core values and give an example for each as you have demonstrated in your life before."}, {"date": "2 Jul 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Health First (Melbourne, FL) in May 2020", "Interview Descriptions": "HR called me to set up time for phone screening interview.  Phone Screening Interview with general questions and then Zoom Team Interview about two weeks later with more specific questions.", "Interview Questions": "List the company's core values and give examples of how you exhibit these values."}, {"date": "18 Jan 2020", "title": "HIM Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First in Jan 2020", "Interview Descriptions": "The initial interview process was automated. Everything was set up and completed online. I was sent an email and asked to answer a series of questions. I was then provided a phone number to call to answer a series of questions over the phone. My responses were recorded and sent to the company for further review.", "Interview Questions": "Have you ever had difficulty completing a task? Why? How was it solved? "}, {"date": "2 Dec 2019", "title": "Nurse Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Health First", "Interview Descriptions": "10 minute interview, the managers seemed interested , thought it went well only to find out I was not offered the position because They hired a candidate that was a better fit yet I was 100% qualified for the position.  I was turned down for personal reasons is my guess.", "Interview Questions": "How I handled a difficult patient "}, {"date": "12 Aug 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First", "Interview Descriptions": "Phone interview followed by face to face. Panel group interview on the unit, and a brief tour of the unit. A few questions asked by each interviewer, mostly conflict resoultion and personality based questions.", "Interview Questions": "Describe a time you had a conflict and what you did to resolve it"}], [{"date": "14 Jan 2021", "title": "Patient Services Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in Aug 2019", "Interview Descriptions": "First I filled out application online, then scheduled an interview which included answering pre-recorded questions which felt very impersonal. Didn't hear anything for a while and then got an email that I was rejected.", "Interview Questions": "Describe your biggest achievement in your life."}, {"date": "3 Sept 2019", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Providence, KY) in Aug 2019", "Interview Descriptions": "I was asked to drive 55 miles from my location to interview. The interview lasted about an hour. I never received an email or phone call of the outcome. Company completely ghosted me.", "Interview Questions": "Why would I be a good fit for the company "}, {"date": "4 Aug 2019", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in Aug 2019", "Interview Descriptions": "they were starting with screening interviews, which is on the phone to find only the most qualified applicants for the job.  then it followed by in-person interviews. After assessing the candidates, the company decides which applicant will be offered the position", "Interview Questions": "How do you feel about working on a team"}, {"date": "2 Jun 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Health First", "Interview Descriptions": "I had a phone interview for an internship position. The Recruiter asked me about my previous experience and my knowledge about the company as well as the health care industry. She also asked me a few personalities, behavioral questions, which she didn't seem bothered to listen even though she initiated it. Although, as a student, I need experience, but based on the experience that I had through the phone interview, I would rather not work for this company.", "Interview Questions": "Out of our mission values: Integrity, Compassion, Accountability, Respect, Excellence--which one most resonates with you?"}, {"date": "13 May 2019", "title": "RN New to Practice Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First in Mar 2019", "Interview Descriptions": "It was a recorded phone interview. They had pre-recorded questions and I had to record it. There were no redos, but it was pretty simple to do. They are keeping me updated, but I am still waiting on a decision to possibly go further.", "Interview Questions": "Why are you the best person for this job?"}, {"date": "23 Oct 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in Mar 2019", "Interview Descriptions": "Initial telephone interviews were very engaging.  Interviewer was enthusiastic and conveyed genuine excitement about the potential my skills and experience could bring to the organization. Overall the interviews (3) were very pleasant and informative.", "Interview Questions": "Describe your most challenging situation as a program manager, and how did you respond to it?"}, {"date": "29 Mar 2019", "title": "Non-Medical Stretcher Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Health First in Feb 2019", "Interview Descriptions": "I had two interviews, one over the phone and a face to face with the supervisor. Everything went very smooth in both processes of the interview and I was very glad I made the choice to join the Health First family for employment.", "Interview Questions": "Why do I want to work for their company? I replied that I'm a great people person and I was willing to help others no matter what even though I did not have a medical background."}, {"date": "8 Nov 2018", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Health First", "Interview Descriptions": "I applied online and received an email for a phone interview. It was a recording of a few questions and then they recorded my answers. A lot of questions that required examples. Still haven't heard one way or the other after 2 weeks.", "Interview Questions": "Which of their values resonated the most with me and why."}, {"date": "15 Oct 2018", "title": "IT Field Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Health First (Rockledge, FL) in Oct 2018", "Interview Descriptions": "Telephone based interview, very friendly and helpful. Plenty of the typical qualification questions, and a few of the behavioral type. I was quite amazed at the professional and helpful interviewer, even though I performed terribly. Quick response following interview. Even though it was not the response I wanted, it was very nice to have an answer right away!", "Interview Questions": "Relate an instance where you used bad judgement for a previous employer, and what you did to correct it."}, {"date": "11 Dec 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First in Oct 2018", "Interview Descriptions": "The first round of the interview was a phone interview. It was a 30 minutes interview and they ask you about your background, relocation, salary expectation. So, I would definitely recommend Glassdoor to check the salary range so that you are on the same page when an interviewer asks you about salary expectations.", "Interview Questions": "Tell me something about your background and how this position is relevant to you?"}], [{"date": "28 Oct 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in Oct 2018", "Interview Descriptions": "It was smooth and very personable. The interviewer asked detailed questions. I was able to answer, and ask questions if needed. I actually enjoyed the experience. I was a little worried about the lack of feedback after the interview.", "Interview Questions": "What is your greatest accomplishment?"}, {"date": "7 May 2019", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Viera, FL) in Sept 2018", "Interview Descriptions": "They sent me an email and asked me to go on line and set an interview time that works for me.  The website was not working and ended p having to call to set an interview.", "Interview Questions": "What made you apply for a position at health first"}, {"date": "2 Jul 2018", "title": "Lean Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Health First", "Interview Descriptions": "It was a phone interview conducted by a Human Resource executive who asked me about my education background, my strengths, my career plans in the future and invited me to ask any questions about the company etc.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "14 Jul 2018", "title": "PACU Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Port Saint Lucie, FL) in Jul 2018", "Interview Descriptions": "First phone interview with Human resources. Second call by Human Resources for phone interview with manager of department. Mileage needs to be less than 30 min away for call. First phone interview questions on patient experiences.", "Interview Questions": "N/A"}, {"date": "27 Jun 2018", "title": "Director of HIM Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Health First (Rockledge, FL) in May 2018", "Interview Descriptions": "Working with their talent acquisition team initially, prior to onsite interview, was pleasant.  First discussion with hiring manager was via phone and was good enough to schedule a onsite interview.  The onsite interview went very well.  Throughout the day, the hiring manager made comments that he was definitely interested in offering me the job, but not coming right out and saying it at that time.  He ended the day with saying that he feels we would be a great fit and the next step may be to bring me back onsite to meet his boss.  However, he did have a few other internals and one external to interview over the next few weeks.  Which he stated that the internals, as he feels, are not ready for this level of management and that the external did not have the innovation that he needs in this role.  Well, 3 and 4 weeks went by and no follow up was received from either the hiring manager or their talent acquisition team.  Therefore, I sent an email to talent acquisition, two/three days later no response.  I called them and left a voicemail, again, 2-3 days no response.  So I decided to email the hiring manager directly to get a response.  Within 30 minutes, talent acquisition called me.  Finally, received word that they offered to someone else.  Terrible follow through post interview from this group of individuals. I hope that this is not the case across the whole organization.  Candidates need to hear soon after an interview what decision was made.  Especially when the hiring manager practically offered during the interview, without coming out and saying it right then and there.", "Interview Questions": "The last question the hiring manager asked me was about my interest after meeting with them today and he felt this was going to be a perfect fit."}, {"date": "4 Mar 2018", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First", "Interview Descriptions": "I applied online and was contacted by an out of state recruiter. It's confusing that a company that is based out of Brevard County, FL has recruiters in Wisconsin and Pennsylvania. Why not just have a team of recruiters locally--as Brevard County could certainly use more jobs. Also, it's frustrating that the pay range they list on LinkedIn is false advertisement as I was told during the phone screen it was actually  $20,000 less per year than the listed range.", "Interview Questions": "Out of our mission values: Integrity, Compassion, Accountability, Respect, Excellence--which one most resonates with you?"}, {"date": "20 May 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Health First (Melbourne, FL) in Apr 2018", "Interview Descriptions": "Interview with three people. One of them was a vice president and another vice president and two other executive assistants, Enjoyed talking with them. This was my second time interviewing for an executive assistant position and have noticed at this level of administrative support, do not see much diversity. Can't help but wonder if this is the reason I don't get the offers.", "Interview Questions": "Why should we hire you?"}, {"date": "5 Mar 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First", "Interview Descriptions": "A phone interview was conducted almost 2 months back and yet to receive feedback or information regarding the next steps although the recruiter said they would mail or call in a week. It shows no value for people who are waiting to hear from them.", "Interview Questions": "Behavioral type questions"}, {"date": "18 Aug 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Health First (Melbourne, FL) in Feb 2018", "Interview Descriptions": "Very long and drawn out.  The time frame given for a response to your interview was not met.  I  called several times and was told I would have an answer by the end of the week.  They got back to me with a job offer 3 months later!  By that time I had taken another job.  From other nurses I know who have applied this is not uncommon.", "Interview Questions": "What are your goals for the next 5 years."}, {"date": "25 Jul 2018", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Health First (Melbourne, FL) in Feb 2018", "Interview Descriptions": "Started with a phone interview, then in person interview (accepted position right then and there), and finally orientation which is lengthly. If I recall correctly, their was about 2-3 weeks of orientation.", "Interview Questions": "Tell me about yourself"}], [{"date": "23 Jan 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Viera, FL) in Jan 2018", "Interview Descriptions": "They had to reschedule my original appointment but didn't tell me why. Phone interview was very quick and easy. They asked very basic behavioral job questions. lasted about 20 minutes. They said they would let me know about setting up a face-to-face interview", "Interview Questions": "Why do you want to work for Health First?"}, {"date": "31 Dec 2017", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Health First (Melbourne, FL) in Dec 2017", "Interview Descriptions": "They make the interview process very easy and convenient. The initial one was done via telephone and then there was a face to face interview. I am still waiting to hear if I have been selected or not but it's been a good experience so far.", "Interview Questions": "What are your long term and short term goals?"}, {"date": "26 Nov 2017", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Health First (Melbourne, FL)", "Interview Descriptions": "Interviewed by sit-in assistant manager. She seems friendly, but no critical questions which I didn't understand how she used my interview to determine my critical thinking skills and performance. Questions type: standard behavior questions that you see online.", "Interview Questions": "Why do you want to work for health first?"}, {"date": "13 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Health First", "Interview Descriptions": "Recruiting/ HR rep will call and ask a bunch of questions after your application is submitted online. These questions seem to determine to some degree the opportunity that will be offered.", "Interview Questions": "Interview in person on unit was more geared to critical thinking, problem solving, and managing potential conflict resolution among coworkers and clients."}, {"date": "15 Nov 2017", "title": "Claims Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Health First (Melbourne, FL) in Oct 2017", "Interview Descriptions": "Received email to set up phone interview.  Was able to choose date and time.  Then received phone call from the recruiter.  Very pleasant.  The questions they ask are very simple and basic.", "Interview Questions": "They asked about knowledge of medical claims.  "}, {"date": "3 Oct 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Health First in Sept 2017", "Interview Descriptions": "Recruiter , VP, Dept head (via phone), five online tests, then a psychologist.  The next step would be a final round...which ironically would have been the first time the candidates get to see the place.  Pretty outlandish process to work for meh wages and benefits at a hospital.  Too many red flags throughout, and when the recruiter didn't return my email after I spent five hours on a Saturday taking their tests, I withdrew.  If they need five tests and a psychologist to validate a hiring decision...that's just pathetic.", "Interview Questions": "Standard behavioral based.  The psychologist interview was mostly about motivation in taking/leaving positions"}, {"date": "29 Oct 2019", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Health First in Sept 2017", "Interview Descriptions": "Talent Acquisition rescheduled this interview at least four times. When I finally interviewed with the hiring manager, they told me the department was restructured, the job description changed, and as such I was no longer interested (or qualified). Total waste of time.", "Interview Questions": "Is the new role something that you would be interested in?"}, {"date": "31 Jul 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Rockledge, FL)", "Interview Descriptions": "Had a phone interview and all went well. At the end of the interview the person stated he wanted to move to face to face interview. Waited more than 2 weeks and finally got a call to set up interview. The interview was a 4 person panel. Each took turns asking questions while the other 3 furiously took notes. Mostly behavioral questions, \"tell me about a time....\".  All went well. Toured the facility. I was told I would hear back on next steps. Never heard a word. No email. Nothing. Very unprofessional. I spent a lot of time between the phone interview and taking time off my job to complete in person interview. It is very disrespectful not to even respond via email at the very least. I will not apply again here.", "Interview Questions": "Tell me about a time you had a conflict with a supervisor and how did you handle it. "}, {"date": "20 Dec 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in Jun 2017", "Interview Descriptions": "Very relaxed and inviting. Got to talk and it felt less like an interview and more like a conversation. Made me very comfortable and the process a lot less stressful.", "Interview Questions": "Where I see myself in 5 years."}], [{"date": "1 Mar 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Health First in Jan 2017", "Interview Descriptions": "After applying, I was contacted via email to set up a phone interview.  The interviewer was 10 minutes late and then proceeded to ask me the same questions that were on the web application that I already answered.", "Interview Questions": "The questions were very generic. The interviewer asked the same questions that were listed on the application."}, {"date": "5 Feb 2017", "title": "Patient Experience Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Health First (Melbourne, FL) in Dec 2016", "Interview Descriptions": "You apply online, go through a phone interview, then through a face to face interview. It can range from 3-7 people interviewing you. They like to have panels and stick with behavioral interviewing. From there, you will find out if you get the job or not.", "Interview Questions": "When was the last time you got caught doing something you shouldn't on the job or in life and how did you seek forgiveness?"}, {"date": "12 Dec 2016", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Health First (Cape Canaveral, FL) in Nov 2016", "Interview Descriptions": "I received a phone call asking me to come in for an interview the following week. I went into the interview, it was 20 minutes late. The lady was very nice, informative, and talked a lot.", "Interview Questions": "Tell me about yourself"}, {"date": "3 Nov 2016", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Health First (Melbourne, FL) in Sept 2016", "Interview Descriptions": "Submitted my resume online and got a call next day to setup phone interview which went very well. I got email to setup a face to face interview.  Because I applied for other positions, I did another phone interview. This interview with Scott, was unprofessional because he seemed preoccupied and hurried to get through my answers - that interview lasted all of 10 minutes as compared to my first one. Needless to say, I didn't get contacted back from my 1st interview for the face to face because this person was hurried and assumptive.  I'm very disappointed in the professionalism.", "Interview Questions": "Basic interview questions like what was your biggest mistake in a previous job and how you recovered, How do you work with others, etc...."}, {"date": "25 Mar 2018", "title": "CNA/HHA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Health First in Sept 2016", "Interview Descriptions": "I filled out the application online, I was called a day later. It was easy and smooth. I enjoyed the questions the asked, the way they went over the skills portion.", "Interview Questions": "How did you hear about us?"}, {"date": "4 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Melbourne, FL) in Jan 2016", "Interview Descriptions": "All interviewees were late it started 20 minutes later than it should have. They were unprofessional and were constantly on their phones and walking in an out of the room while I was answering questions. Felt like a total waste of time, especially since I had to drive all the way from a city 4 hours away.", "Interview Questions": "Why do you want to work in the OR?"}], [{"date": "22 Oct 2015", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Health First (Fort Worth, TX) in Oct 2015", "Interview Descriptions": "Waiting on Interview, Got a call from Medsynergies and was screened over the phone a little bit, and is scheduled for an interview coming up. Hopefully i will have a good experience and to get hired on. I have done a lot of review search.  .......................................................................................................................................................................................................................................................................................................", "Interview Questions": "N/A"}, {"date": "27 Jul 2015", "title": "Business Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Health First (Melbourne, FL) in Jul 2015", "Interview Descriptions": "Initial phone interview with hr generalist to determine if I was the right candidate to move on to the next phase of the interview process. Asked general questions: prior experience, familiarity with position applying for, availability, salary expectations, etc. At the conclusion, the interviewer said they will recommend me for next steps. Two weeks passed and finally heard back that I would have a 2nd interview.\r\nI was contacted 30-minutes prior on the day of my second interview that they changed the position requirements and now need someone with oncology experience.\r\nNot a good way to attract and retain talent, especially in this area where word-of-mouth travels quickly. I was warned by former employees this is not a good place to work; this interview process proves the point.", "Interview Questions": "How many years of medical billing experience do you have?"}, {"date": "27 Jul 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Health First in Jul 2015", "Interview Descriptions": "3 interviews, 2 phone 1 in person. \nSpoke with HR, hiring manager and then panel interview. Process took about 2 months. After panel interview I was told I would hear back in 3 weeks. Was notified in less than a week for an offer.", "Interview Questions": "behavioral questions"}, {"date": "10 Oct 2016", "title": "IT Customer Support Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Health First (Rockledge, FL) in May 2015", "Interview Descriptions": "Apply online. Wait a few days to be contacted by Staffing, then setup interview 2 weeks out with staffing then if select to move on you get interviewed over the phone again for the position.", "Interview Questions": "Basic behavioral customer service questions"}, {"date": "11 Apr 2015", "title": "General Sonographer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Health First (Sebastian, FL) in Apr 2015", "Interview Descriptions": "Phone interview after receiving my online application. I was emailed by the interviewer and set up a time for phone interview. The phone call was prompt and the interviewer was very regimented. Robotic and not friendly. \r\nI wasn't prepared for a couple of questions.", "Interview Questions": "What mistakes have you made as a technologist and how would you correct them."}, {"date": "19 Feb 2015", "title": "HRA Verifier Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Health First (Tampa, FL)", "Interview Descriptions": "Two months after applying, I received a call from HR and given the details on the interview location, etc. I was given a very brief description of the job which turned out to be temporary and surprising as I had not applied for a part time position. Was told that HR would contact me.", "Interview Questions": "There were no questions asked of me, I had to ask questions to gain a better idea of what was expected of someone in that job position."}, {"date": "23 Mar 2015", "title": "Front Desk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Health First in Feb 2015", "Interview Descriptions": "I applied online, was contacted for a phone interview a few days after and was told I would receive a follow up call. I never had a face to face interview", "Interview Questions": "When did you demonstrate \"integrity\" in the work place"}, {"date": "24 Sept 2015", "title": "Member Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Health First (Lake Mary, FL) in Jan 2015", "Interview Descriptions": "Very easy interview. When you are called to the conference room they ask you what your availability is and if you can work any schedule between 8am-8pm. Pretty basic questions like why do you want to work for the company,why should they hire you, and other behaviorial questions.", "Interview Questions": "Why should we hire you?"}, {"date": "5 Jun 2014", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Health First (Rockledge, FL)", "Interview Descriptions": "Met with HR Department for initial interview after interviewed with supervisor.  Interviewed with 2 people at the same time and then given a transcription test, then followed up with results and more questions, making me feel judged on everything and uncomfortable.", "Interview Questions": "Was asked personal questions making me feel uncomfortable about working with past supervisor and problems prompting me to leave."}, {"date": "6 Apr 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 6 weeks. I interviewed at Health First", "Interview Descriptions": "Handled by a headhunter", "Interview Questions": "There were no unexpected questions but they were behavior based"}], [{"date": "22 Sept 2017", "title": "Case Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Health First (Melbourne, FL) in Feb 2014", "Interview Descriptions": "The process was fairly simple. Phone interview and background check. I met with the supervisor who asked a few quesstions. It is mostly about qualifications. The next step was Human Resources. This took time due to the extensive background check.", "Interview Questions": "What are your goals?"}, {"date": "24 Nov 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Health First (Rockledge, FL) in Feb 2014", "Interview Descriptions": "Very basic questions, asked about leadership qualities, ability to work on a team, abilities in excel were very important, they are looking for people who are knowledgeable in Excel, especially in the use pf pivot tables.", "Interview Questions": "Where do you see yourself in 3-5 years?"}, {"date": "15 Feb 2014", "title": "Certified Surgical Scrub Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Health First in Dec 2013", "Interview Descriptions": "All resumes have to go through their online database. After submitting mine, I received a call for an interview within a day or two. After one short interview and walk though, I was called by their HR dept and offered a job. I started the following day.", "Interview Questions": "Very few questions actually. The hiring manager spent most of the time explaining their specific policies and the environment at their facility. I mostly just interjected with comments about how much I liked what she was saying and how I thought I would be a good fit for their team based on what she was saying."}, {"date": "24 Sept 2013", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Health First (Cape Canaveral, FL) in May 2013", "Interview Descriptions": "My interview with Melissa Smith went very well.  She explained what was needed of her associates, Explained that  I would also be training in the Lab Dept., asked a few questions about Draw of Blood, then proceeded with a tour of the Lab Dept.\r\nOnce I was hired I had 3wks of training in both Lab Dept., and Out Patient.  Not so much time was spent on the floor actually doing pokes.  I enjoyed myself and learned more then I came in with", "Interview Questions": "question;  If you were an animal, which animal would you be?"}, {"date": "30 Aug 2015", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Health First (Viera, FL) in Mar 2012", "Interview Descriptions": "I was met and spoken to in the lobby of hospital by general manager and morning supervisor. I was then asked a few questions and then had the position, the layout of the facility and what was expected from me described to me. I was introduced to the morning supervisor told that I should hear a result in a few days.", "Interview Questions": "Experience, contributions"}, {"date": "15 Apr 2015", "title": "Ed Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Health First (Melbourne, FL) in Nov 2011", "Interview Descriptions": "The interview process was friendly and steady with questions and answers. 2 to 3 people asking questions and answers were recorded. There was a job duty walk through to experience the environment and location of things and where people are.", "Interview Questions": "N/A"}, {"date": "24 May 2012", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Health First (Melbourne, FL) in Feb 2011", "Interview Descriptions": "Pretty basic they called me to set up an interview. It was actually an easy interview they asked the basic questions. Why do you want to work for us, what can you bring to the company. The other questions were scenarios what would you do if this happened ect. It was no more than 12 questions. Then they called me the 2 weeks later an offered me the job.", "Interview Questions": "Since Health First in a medical company it was a lot of patient care questions. Can you be trusted with patients valuables, What would you do it a patients fell on the floor and the same time another patient who was bed rest got out of bed… questions like that."}]]