[[{"date": "30 Apr 2023", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC)", "Interview Descriptions": "The HR reached out to me first. It is a 30 minutes interview. She asked about my previous intern experience and volunteer experience. Then a week later, the future supervisor reached out to me to have another video interview.", "Interview Questions": "Walk through your resume; describe your volunteer experience."}, {"date": "3 May 2023", "title": "Project Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Apr 2023", "Interview Descriptions": "I had an interview with the recruiter manager and hiring manager. During the interview everything was good, I felt comfortable answering common questions about my professional experience. However, I felt really disappointed, I did not have feedback about my process, and they never contacted me again!!, that's very unprofessional. I prepared for many days for my interview and I was excited to get this job, That is really unfair with job-seekers :(", "Interview Questions": "Why do you want to work with us?"}, {"date": "25 Mar 2023", "title": "Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "I had an extremely negative experience interviewing with World Resources Institute. The interview process was lengthy and exhausting, and the recruiter I worked with was incredibly discourteous and disrespectful. After the initial interview, I was left in the dark for nearly a month with no communication from the company. Eventually, the hiring manager reached out to me, only to ghost me for nearly two weeks after that. When she finally did get back to me, she told me that she didn't think I would be a good fit for the role and that I would be frustrated with the job and her ability to manage me effectively. I found this to be incredibly discriminatory and judgmental, especially given that she had initially told me that I was highly qualified. To make matters worse, she then went on to say that there were other applicants who would be able to step into the role more easily and that the company wasn't interested in training anyone. She even went so far as to suggest that my location on the West Coast would make it difficult for me to succeed in the role, despite my qualifications and abilities. Overall, my experience with World Resources Institute was totally unfair and unprofessional. The company clearly has a lot of work to do in terms of its hiring practices and treating candidates with respect and dignity. I would not recommend applying for a job with this company based on my negative experience.", "Interview Questions": "Tell me about yourself and your background."}, {"date": "13 Feb 2023", "title": "Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at World Resources Institute (New York, NY)", "Interview Descriptions": "Process was super long and HR staff is inexperieced and unprofessional. Process took more than 3 months. After moving thru 4 rounds of interviews, they went ghost and I never heard back from them. Stay away from this organization. While they have a great mission, they clearly don't value candidates or employees considering their low pay and unprofessional hiring practices. This is the type of organization you only work for if you are  desperate and have no other options. No wonder why their turnover is so high.", "Interview Questions": "tell me about a time you had to go above and beyond for a client"}, {"date": "4 Feb 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "A short phone screening. Asked questions that you would usually get at interviews: introduce yourself, why do you think you would be a good fit for the job, etc. Even if you applied for multiple position at the same time, you are screened only once.", "Interview Questions": "Why do you think you are a good fit?"}, {"date": "30 Jan 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "It was fun. The HR team especially was very nice and describe the job really well. The research team's questions were very specific. However, the process is quite long and they haven't called me back despite my request for personal feedback. It would be nice if they can provide it.", "Interview Questions": "How do you develop research question?"}, {"date": "27 Jan 2023", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "The process was pretty fast and seamless but there were multiple rounds which took some time. Everyone was respectful of my time and I felt gave me sufficient time to ask my own questions.", "Interview Questions": "Describe your experience with social media strategy"}, {"date": "22 Jan 2023", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Very fast and responsive. I had 3 rounds of interviews. One with the reporting manager, one with the team and then the HR round. The interview process was a conversation more than an interview to try and understand past experience and interest in the sector", "Interview Questions": "Questions related to past experience and interest in the sector"}, {"date": "23 Mar 2023", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at World Resources Institute in Jan 2023", "Interview Descriptions": "first stage conversation with hiring focal point, simple conversation to get to know each other expectations for the role and the strategic goals they have sought out. Did not get a sense of what future conversations or process would like.", "Interview Questions": "Why did you apply for this role"}, {"date": "27 Jan 2023", "title": "Research Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute (Washington, DC) in Jan 2023", "Interview Descriptions": "Panelists were extremely friendly and seemed to enjoy working at WRI. Seems like a collaborative, mission-driven environment. Questions were very resume-based and the process was well-streamlined. Phone screen --> video panel interview --> writing sample --> offer.", "Interview Questions": "Tell me about a time when you encountered a problem during your research and how you overcame it."}], [{"date": "12 Dec 2022", "title": "Sustainable Mobility Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute in Oct 2022", "Interview Descriptions": "The interview lasted for around 40 minutes, and there were 3 interviewers: HR, the project lead, and a mobility consultant. The interview session started with the HR explaining about the project brief, including the timeline of the whole project, and what to expect of the role on each phase of the project.", "Interview Questions": "- Understanding about sustainable mobility - Knowledge about current issue on the specific city of the project - Skills in GHG emissions and transportation/ mobility software"}, {"date": "13 Sept 2022", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Phone screen with supervisor followed by in person discussion. Writing exercise required. Fair and transparent process with reasonable people. Ultimately the role wasn't for me but wouldn't discourage someone from applying! ", "Interview Questions": "Why do you want to switch into a comms role (I'd been in a different position at my then-employer). "}, {"date": "2 Sept 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "I applied and a few days later was contacted to schedule interview for the job, which was great. After I was contacted to schedule the interview I replied promptly with my availability for the next two weeks, but was not contacted until 3 weeks later to schedule my first interview, which was only a screening interview. I followed up appropriately during that period of not hearing anything back, but sometimes my emails were met with no reply. Nearly one month later I was moved forward to a panel interview with the team, who asked some tough and technical questions but I felt I answered them well. After that interview I promptly was moved forward to a writing sample, which was one hour and asked me to write a blog post about the topic for the job I was applying for. The writing sample was difficult and I did my best, but I definitely could have done better. Either way, what followed was a series of emails with the HR recruiter. I kept getting led on by the recruiter and got a few emails and calls saying I would hear back from him soon, but I never did. The process was dragged out for a few months and I was effectively ghosted by the HR recruiter. I don't think this reflects much on the actual team I would be working for but it definitely did not reflect well on the organization as a whole.", "Interview Questions": "How do you approach working with a new subject area?"}, {"date": "1 Sept 2022", "title": "Policy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "early-round interview, conducted by phone with a program lead; it was informational both ways, and brought to light that relocation might be a sticking point for moving forward with the process", "Interview Questions": "Why would I want to transition from my industry to WRI?"}, {"date": "22 Aug 2022", "title": "Events Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "There are 3 stages in the interview process. The first one is with the HR, the 2nd is with the position-specific 2 people and the third one is with the panel of 5 people (obviously all related to the position/project). It is very smooth, friendly, calm and quick process. HR gets back to you in around a week with the outcome and next steps. Questions were regarding - previous and relevant experience, crisis situations, communication skills, managing multiple stakeholders, position-specific technical skills, what one find exciting and challenging in this job, future prospects. Overall, it was a very pleasant experience.", "Interview Questions": "Questions were regarding - previous and relevant experience, crisis situations, communication skills, managing multiple stakeholders, position-specific technical skills, what one find exciting and challenging in this job, future prospects. Overall, it was a very pleasant experience. "}, {"date": "27 Apr 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Received an interview request after a few weeks. Talked with someone over the phone for a bit who seemed unprepared to interview someone. The next steps was a panel interview then a skills test.", "Interview Questions": "How does your skill relate to this job"}, {"date": "5 Jul 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Resources Institute in Apr 2022", "Interview Descriptions": "The entire process took 4 months, with 4 weeks between the second interview and communication regarding the outcome of that interview. Eventually after 4 months, I was notified that they decided not to fill the role.", "Interview Questions": "Q. Why did you choose WRI?"}, {"date": "31 Mar 2022", "title": "Project Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "The process was very laid back. I heard back after applying online. I gave two interviews before I got the offer. However, the part time position did not offer benefits.", "Interview Questions": "Tell me about yourself. \r\nHow do you see yourself in this role? "}, {"date": "29 Apr 2022", "title": "Learning and Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Resources Institute (Washington, DC) in Mar 2022", "Interview Descriptions": "15 minute phone screening with HR. 30 minute phone call with hiring manager. 60 minute panel interview with 4 people, some from team some from elsewhere on the organization. 60 minute work sample exercise.", "Interview Questions": "What excites you about work? "}, {"date": "23 Jun 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute in Mar 2022", "Interview Descriptions": "Interviewed at WRI twice for an internship position. A couple of general questions at Screening. Followed by a 30 minute interview with the hiring manager about interest in the position. Smooth process although they tend to ghost after the final round of interviews.", "Interview Questions": "Why are you interested in this position "}], [{"date": "13 Feb 2022", "title": "Intern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Interviewer seemed ill prepared for the interview. Did not seem like their team cared to hire anyone. Instead just asked basic questions and I was surprised to make it to the next round.", "Interview Questions": "Tell me about a time you worked on a team"}, {"date": "8 Feb 2022", "title": "Communications & Engagement Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "I applied online, went through a phone screening with HR followed by two interviews and a writing exercise. I didn’t have enough time to really get through the exercise properly but I’d say just do your best.", "Interview Questions": "How would you manage if abc situation came up with partners/stakeholders?"}, {"date": "11 Mar 2022", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Resources Institute in Feb 2022", "Interview Descriptions": "Screener call with HR followed by a 1 hour call with hiring manager followed by one hour Zoom panel with Director and two senior managers.\r\n\r\nIt was rather straight forward. The team was engaged in the conversation, making it feel very comfortable and easy. Clear commitment to the work!", "Interview Questions": "Why are you interested in WRI and this role?"}, {"date": "9 Feb 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Resources Institute (Washington, DC) in Feb 2022", "Interview Descriptions": "First a phone screening with a recruiter, normal questions, then a call with hiring manager, and then a panel interview.  Panel interview is much more technical than the phone screening, and they all asked unique and intentional questions.", "Interview Questions": "What drew you to this job opportunity "}, {"date": "10 Jan 2023", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Feb 2022", "Interview Descriptions": "The interview process followed several steps as follows: - 30-minute phone call with a human resources representative - Call with manager for the position - Virtual panel interview - Written exercise", "Interview Questions": "What interested you in this position? Tell us about yourself. Do you have experience curating social media profiles?"}, {"date": "10 Jan 2022", "title": "Finance Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Had three interviews with five different people, one of which was a panel of three staff in the immediate office of employment. Questions were appropriate for the position. Not too serious, we were able to have a few laughs.", "Interview Questions": "Have you had experience managing up?"}, {"date": "20 Apr 2022", "title": "Program Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute in Jan 2022", "Interview Descriptions": "15 min phone screen with recruiter and then interview with hiring manager and then a third interview with a panel group. Also included a timed work exercise before checking references", "Interview Questions": "Describe a time where you had to solve a complex problem"}, {"date": "8 Jan 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Resources Institute in Jan 2022", "Interview Descriptions": "The first interview was with HR, introductory for the most part.  They asked basic questions- why are you interested in the job etc.  The interview also included some logistical questions such as when you would like to start working if you were hired.", "Interview Questions": "Why are you interested in the job?"}, {"date": "5 Oct 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "First there was a basic phone screening with an HR employee lasting around 15 minutes. Next I attended an in-person interview with a panel of 4 employees. Finally I did a budgeting exercise.", "Interview Questions": "There were a lot of \"tell me about a time\" type questions, so it is helpful to prepare anecdotes in advance. "}, {"date": "10 Oct 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Friendly, on time, good experience. CV asked expectations asked, synergies explored, discussed other ambitious projects, Salary discussed., benchmarks & renumeration. company culture, climate change in India and in the global south", "Interview Questions": "What is your salary expectation"}], [{"date": "14 Aug 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Had my first round interview with a manager on the team and it was a normal, get-to-know-you type of conversation. Overall was pleasant and straightforward and indicated that I'd hear back about the role soon as they were hoping to have a start date within the next month. I followed up 3 times (over the course of 6 weeks) and never heard back about the role. I thought this was incredibly unprofessional and rude!", "Interview Questions": "Tell me about your background in this field."}, {"date": "5 Aug 2021", "title": "Analista De Mobilidade Urbana Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Porto Alegre, Rio Grande do Sul)", "Interview Descriptions": "Entrevista em grupo, um pouco corrida. Poucas oportunidades de ser avaliado, reconheço que processos individuais demandam muito tempo, porém acho pouco efetivo entrevistas coletivas como foi realizada. No entanto, uma instituição muito interessante para quem deseja evoluir na área da mobilidade e do transporte urbano.", "Interview Questions": "Se apresentar de forma criativa."}, {"date": "10 Jul 2021", "title": "Junior Product Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "I had a quick screening with a member of the HR team (who was able to give me details about company culture, etc), an hour-long call with the hiring manager, a third panel interview with people who would eventually be my teammates, and then a writing test.", "Interview Questions": "What is a situation in which you've had to pay close attention to detail?"}, {"date": "2 Jun 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "First round is a 20 minute call. Questions included basic get-to-know-you and specific knowledge. Second round is a panel interview with other staff members in the office. Similar to other types of panel interviews.", "Interview Questions": "Specific knowledge about Articles within the Paris Agreement. "}, {"date": "7 Jul 2022", "title": "Energy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Jun 2021", "Interview Descriptions": "Three levels - Two interviews and One Writing test. One was estimating fit, the second was a knowledge and experience test, and the last a writing test clocked at one hour.", "Interview Questions": "Basic energy-related questions that one would expect if they've done their research"}, {"date": "18 Oct 2022", "title": "Marketing Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Jun 2021", "Interview Descriptions": "Applied directly on the website. First had a phone screening. Then, a panel interview with key team members. This was followed by a writing test that had to be returned within an hour of receiving it. Questions on the writing test consisted of drafting tweets and proposing graphics, and copyediting a press statement.", "Interview Questions": "Give an example about working in a team environment."}, {"date": "30 Apr 2021", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Applied & heard back within 2-3 weeks. Recruiter screener call (10-15 mins), 1st round panel (2 similar level interviewers), 2nd round panel (3 director-level interviewers). Style of situational STAR method responses - no case studies, exams, or anything.", "Interview Questions": "- What is your leadership style?\n- Tell me about a time when X, Y, Z...\n- How would you juggle multiple priorities?"}, {"date": "30 Nov 2021", "title": "Sustainable Cities Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at World Resources Institute (Beijing, Beijing) in May 2021", "Interview Descriptions": "The whole interview atmosphere is very relaxed, no test, basically personal introduction, past experience, past project introduction, personal ability. received the offer during the interview, and an official email acceptance a week later.", "Interview Questions": "1. personal introduction;\n2. portfolio & paper introduction;\n3. personal abilities introduction (software/language/writing skills)\n4. attendance date departure time.\n5. the interviewer introduces the internship allowance."}, {"date": "23 Apr 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "It was generally smooth. The panel interview was a bit daunting. I wish they’d give more clarity on the exam format. Overall, it was a good interview experience — very smart group of experts, who are obviously very passionate about what they do.", "Interview Questions": "Writing sample & excel exercice"}, {"date": "15 Apr 2021", "title": "Research Associate - Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC)", "Interview Descriptions": "Easy and very good communication, positive interactions, helpful staff, interesting position. Had to submit basic materials such as resume, cover letter, and examples of work. I really enjoyed getting to know WRI through the process.", "Interview Questions": "How is your work ethic "}], [{"date": "10 Mar 2023", "title": "Legal Counsel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Mumbai) in Apr 2021", "Interview Descriptions": "good. It was taken by HR and CEO. The questions asked were mainly about the past experience and FCRA compliances. Final interview as taken by Legal Counsel, US. The interview process was about 30 days long.", "Interview Questions": "What was your past experience"}, {"date": "24 Mar 2021", "title": "Clean Energy Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Applied online and received an email to set up initial phone screen with recruiter about 3 weeks later. The initial call was 30 mins, pretty easy questions. I was then asked to have a virtual interview with 2 people on the team. The email from the recruiter was sent around 10am asking for my availability, she then emailed again at 12 to provide my availability ASAP. \n\n45 min virtual interview with 2 people. No feedback for 2 weeks until I received a generic email thanking me for my time, but that I was no longer a candidate. Process seemed impersonal.", "Interview Questions": "Tell me about a time when you had to learn a new skill"}, {"date": "21 Mar 2021", "title": "Corporate Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "The interviewe process was smooth. One thirty-minute behavioral interview with both hiring managers followed by a writing assessment. The questions were not overly difficult, but do research beforehand! They were impressed by my knowledge of the company. Heard back shortly and accepted the offer.", "Interview Questions": "What do you know about WRI?"}, {"date": "15 Mar 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Process overall ok but extremely drawn out. Felt like my time was wasted - taken to final interview and then ghosted. Position was meant to start in February ’21, then pushed back to March ’21. I don’t even know what’s going on with it now as I was never notified of anything and emails to hiring managers have been ignored. \n\nApplied November 2020. Invitation for initial interview with two staff in December 2020. Got asked to do a short writing task in January 2021. A few weeks later asked to do a second interview in February 2021. Interviews themselves were fairly straightforward questions about my background and a few open-ended questions about different things related to strategy and evaluation as this was the focus of the internship. No behavioural questions. Writing task was summarising some program information on a one-pager.", "Interview Questions": "Tell us a little more about your experience etc? "}, {"date": "2 Mar 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Fairly standard process. I interviewed remotely due to COVID. It was a group interview. \n\nI heard back within 2 weeks or so and was then asked to supply 2-3 references and complete a sample work assignment.", "Interview Questions": "Why WRI? \nWhat relevant experience do you have that would help you succeed at this internship? "}, {"date": "26 Mar 2021", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Mar 2021", "Interview Descriptions": "Some from the company calls to screen applicants they want to invite for interviews, they will share the benefits that come with the role and compensation, if you accept them, then you're invited for a first interview with your immediate supervisor and after a panel interview", "Interview Questions": "Describe a time you had a conflict with a colleague and how did you solve it? "}, {"date": "14 Jun 2022", "title": "Consumer & Market Knowledge Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Mar 2021", "Interview Descriptions": "Application procedure involved CV, Cover letter, interview and then assessment round. The assessment round encompassed the submission of a report review which needed to detail specific requirements related to the role of the application.", "Interview Questions": "Why are you interested in the role? What are some of the things which link you to this role? Very basic questions"}, {"date": "22 Dec 2021", "title": "Consultant for Gender Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Mar 2021", "Interview Descriptions": "There is only 1 session of interview and it's rather straightforward. They asked question specific to the jobs and has diversed range of panels (across multi-national team). After interview, they will follow up with the decision. I like it as they did not drag the recruitment process too long", "Interview Questions": "What method do you use to conduct gender assessment?"}, {"date": "25 Jun 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Mar 2021", "Interview Descriptions": "Very very long interview process, took over a month and a half just to receive a rejection. Way too many steps for an entry-level position with no research aspect. Asked the same questions at each interview phase. However, everyone I spoke with was very nice.", "Interview Questions": "Why would you want to work at WRI? What are three strengths and weaknesses? "}, {"date": "7 Feb 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Phone interview - Horrible experience. The interviewer was just visibly not interested and even sounded bored. It felt like she was just conducting the interview to get it over with.", "Interview Questions": "Why do you want to work for WRI?"}], [{"date": "10 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "A month or two after sending my application, I interviewed over the phone. Then, shortly after, I was invited to complete a timed written exercise. I heard back a week or two later with an offer.", "Interview Questions": "[cannot recall at this point, but it was very relaxed]"}, {"date": "3 Jul 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at World Resources Institute (São Paulo, São Paulo) in Jan 2021", "Interview Descriptions": "Fine, friendly and fair. Exposition about overall interest and challenges. Interviewer was well intended and motivated but poorly briefed from intl direction and board. Apointed to hiring but was later on counter feit.", "Interview Questions": "General, about specific track record and management skills"}, {"date": "2 Nov 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (London, ON) in Jan 2021", "Interview Descriptions": "They take a long to share feedback which often leads to candidates' fatigue. The salary scale also doesn't correspond to the position. More investment needed in the hiring and recruitment", "Interview Questions": "How do you rate yourself to the role advertised"}, {"date": "7 Dec 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Open-minded, welcoming, several practice assignments, overall smooth. Space to ask questions and tell them about your ideas. The interview itself was conducted in a very friendly environment. WRI was quick to respond and the overall process was transparent and pleasant,", "Interview Questions": "Why WRI?\r\nPractical skills\r\nPractice assessments\r\nLearning opportunity"}, {"date": "5 Dec 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "There were two stages of interviews. Both of them were semi-technical. The interviews went good but the interviewers didn't give any feedback or result. It's been more than two months now and I don't think they will contact me again.", "Interview Questions": "If I get a PhD offer while I am working for them, will I accept the offer? "}, {"date": "7 Dec 2020", "title": "Epp Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "By Microsoft team about 20 minutes they have taken the interview by 2 persons. They were very calm, positive and supportive throughout the interview.\r\nThen they asked me some questions about my previous jobs. The questions they have asked was very logical.", "Interview Questions": "Tell me something about yourself was the first question."}, {"date": "4 May 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Jakarta) in Dec 2020", "Interview Descriptions": "I applied for an internship position for a project that has been going on for the past 2 years. The interview was attended by 4 people from the company - 1 of them was the HR, 2 of them are from the project, and 1 being the specialist but was not part of the project. The interview took approximately 90 minutes, all held in English (the job was in Indonesia).", "Interview Questions": "How do I know the company, my thesis project/research (I applied for his position 3 months after graduation), my technical/engineering skills, my overall basic knowledge of how the project is gonna be."}, {"date": "13 Nov 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Due to COVID-19, the interview was over Zoom. There were several technical difficulties but the interviewer was very understanding about them. The interview was about 45 minutes. After the initial interview, they asked me to perform a one-hour technical writing test, where I needed to write LinkedIn, Twitter, and Facebook posts.", "Interview Questions": "N/A"}, {"date": "10 Jul 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute (Washington, DC) in Oct 2020", "Interview Descriptions": "30 minute phone interview with technical recruiter followed by 30 minute general phone interview with hiring manager, followed by a panel interview with hiring managers and a coding assignment to demonstrate skills", "Interview Questions": "What data analytics tools do you have experience with?\n\n"}, {"date": "4 Sept 2020", "title": "Communications Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "The interview process was done with the HR, project lead, and the user. It is a case study basis which will depend on your experience, network, and skill. \r\n\r\nAdditionally, there will be a reference check as well.", "Interview Questions": "1. How do you communicate issue such as [project name] to audience such as public, government, or other parties\r\n\r\n2. What tools do you use to communicate\r\n\r\n3. Give one example of how a successful campaign would be"}], [{"date": "26 Oct 2020", "title": "Digital Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Sept 2020", "Interview Descriptions": "Very frustrating interview process overall. I had an initial enjoyable phone screen interview with a member of the team, and was shortly moved to a panel interview with a couple more members of the core communications team. After the panel interview, I received  a writing exercise that I had 24 hours to complete--and from there, finding out whether I got the internship or not. I love what WRI stands for and the work that the team accomplishes together, but the communication is sorely lacking. Prepare to sit and wait unemployed while a \"decision\" is being made, and hope that the process won't take a full month and a week long like it did for me.", "Interview Questions": "Why do you want to work at WRI?\r\n\r\nWhen working on a project, what are the steps you would take to complete it?"}, {"date": "17 Feb 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Aug 2020", "Interview Descriptions": "I was contact by an automatic email and requested interview times. I had the initial interview which was about 20 min long, and then the second interview was with one additional person and that was about 30-45 min. I never heard back after the second interview about my status. I reached out directly to the hiring manager after some time had passed, and still did not receive a response.", "Interview Questions": "Scenario question about if the entire world ran on renewable energy, would public transportation still be an important initiative? "}, {"date": "4 Apr 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Jul 2020", "Interview Descriptions": "I submitted an application online and received an email several weeks later asking to set up and interview. We discussed the position and my previous research background and then I received an email later that day offering the position.", "Interview Questions": "What previous research experience do you have? Why did you apply for this position?"}, {"date": "1 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at World Resources Institute in Apr 2020", "Interview Descriptions": "After submitting my cover letter and resume I had a phone interview with the supervisor and a manager from the department.  Roughly two weeks later they followed up to ask for 2-3 references and provided a mock assignment.", "Interview Questions": "Why WRI? \n\nWhat experience do you have that will prepare you for this specific role? "}, {"date": "18 Nov 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at World Resources Institute in Jan 2020", "Interview Descriptions": "Interview process was relatively easy, with only one interview. There was a team of three people that I met with virtually. I was offered the position after one interview and providing some references and writing samples.", "Interview Questions": "They asked me to describe in depth my research experience"}, {"date": "6 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at World Resources Institute in Oct 2019", "Interview Descriptions": "My two interviewers were really interested in what specific experiences prepared me for this position, especially with regards to data analysis. Overall, it was a positive experience and I accepted my offer.", "Interview Questions": "What separates you from other applicants?"}, {"date": "10 Dec 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Resources Institute (Ciudad de Mexico) in Sept 2019", "Interview Descriptions": "Entrevista varía según el puesto. \n\nTres entrevistas con preguntas de conocimiento sobre el puesto. Primera entrevista de \"Screening y conocimientos generales\", segunda entrevista sobre escenarios supuestos y posibles soluciones con jefe directo y tercera entrevista con director del área.", "Interview Questions": "Escenario de un proyecto y cómo lo resolverías"}, {"date": "15 Jan 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Sept 2019", "Interview Descriptions": "Normal Interview, not hard. First they did an introduction of the company then asked me some questions related to my resume. Also, asked me BQ and related work experience.  Last they asked for three references.", "Interview Questions": "what will you do if you have a different opinion from your teammates? "}, {"date": "11 Aug 2019", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Overall basically felt like the hiring committee was winging it. I was originally told the process would include an initial phone screen, a more in-depth phone interview, a writing test, then an in-person panel interview. Completed all those, was then put through two additional phone interviews and asked for a references check.\nWas then told the final decision was tougher than expected, so much so that they were considering adding an additional role to hire us both. Received a very generic rejection email and, in response to my question about the other role, was told it was no longer an option.", "Interview Questions": "Why WRI vs similar nonprofits/think tanks?"}, {"date": "13 Jul 2019", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC)", "Interview Descriptions": "I interviewed for a job with them last year. My friend had a similar experience with them very recently, so I decided to pop in here and leave a review. \r\n\r\nIt was just a phone interview for me, brief (as was scheduled), but the hiring person I spoke with was honestly quite rude and sounded distracted/annoyed the whole interview. I think we both realized I was not a good fit for this role. For sure. But combined with having heard negative things from 2 colleagues who had worked there (Washington DC) previously a few years ago, it all left a sour taste in my mouth regarding this company. It was the first time I had ever sort of given up halfway through an interview and just wanted it to end, personally. Just being honest.", "Interview Questions": "Describe your experiences working backwards on your resume."}], [{"date": "9 Jul 2019", "title": "Finance Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "Fairly standard process. Initial call with the project manager and then a panel interview over Skype followed by a technical writing/research assignment. Most of the questions were around experience in similar roles and questions to see if I was a fit for the dynamic environment at WRI.", "Interview Questions": "Why work at a thinktank like WRI?"}, {"date": "18 Jun 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Allegedly, three step interview process and then whether you receive the offer or not. However, I never got a follow up call about the third and final interview. Also discussion that stated I would have to complete some form of a writing assessment. I was told I would receive that information the next day but instead got a rejection letter about a month later.", "Interview Questions": "Why do you think you should work for WRI?"}, {"date": "5 Jan 2020", "title": "GIS Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Resources Institute (Washington, DC) in Apr 2019", "Interview Descriptions": "First step was a phone screen, then a 30 minute phone interview with the hiring manager. Then, there was a panel interview that consisted of a 10 minute PowerPoint presentation on previous work I've done as well as a series of questions from panelists. After that, I had a 2 hour timed assessment that I felt was not nearly enough time to complete the work. The whole process, which took about 2 1/2 months, was very dragged out.", "Interview Questions": "How does your past experience relate to this role"}, {"date": "21 Jun 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Atlanta, GA) in Apr 2019", "Interview Descriptions": "From start to finish, I had a positive experience. I spoke with the HR rep for a 30 minute phone screen, the manager for the role for an hour,  an hour-long Skype panel interview with 5 people, and then had a test to demonstrate abilities applicable to the role. The test was the most difficult as I wasn't sure what to expect, but it was more to show I could create a budget proposal rather than looking for exactly correct numbers.", "Interview Questions": "Why are you interested in this role?"}, {"date": "20 Feb 2021", "title": "Senior Energy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Apr 2019", "Interview Descriptions": "It was a 3-step interview process with written assignment. The first interview was with HR, the second was with the hiring manager, and the third was a panel interview with the team I would have been working on.", "Interview Questions": "What is your current Role"}, {"date": "13 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Mar 2019", "Interview Descriptions": "The interview is pretty standard for WRI interview process. Applied online with a resume and cover letter. I heard back less than a week for a phone interview. \r\nAfter, I heard back again about a week later for the second stage of the interview which is to write a report based on a provided assignment in under 48 hours. \r\nAfter sending the report, I proceeded to the third stage of the interview process which was a reference check on two provided references.", "Interview Questions": "How do you implement sustainability into your own personal life?"}, {"date": "26 Feb 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at World Resources Institute in Feb 2019", "Interview Descriptions": "I submitted my application from univesity internal portal, and get a phone interview two weeks later. After I passed the phone interview, I received a writing test one week later. After the writing test, I was asked to provide reference sand that is all.", "Interview Questions": "Why WRI? Why position? Ask about past experience"}, {"date": "1 Oct 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Mumbai) in Jan 2019", "Interview Descriptions": "seven rounds of interview and written test. Technology was used so that travel can be avoided, they also take panel interviews to save rounds. The turn around time is slow and it becomes difficult to track the progress.", "Interview Questions": "Tell me something about you?"}, {"date": "8 Feb 2019", "title": "Grant Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute in Jan 2019", "Interview Descriptions": "I had a 15-minute phone screen with the HR recruiter,  a second round 30-minute call with the hiring manager, and a third round panel interview in-person. The final candidate got a written skills test to complete.", "Interview Questions": "What would your current supervisor say is a strength of yours? Weakness? "}, {"date": "3 Oct 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "I applied online and heard back within two weeks. The process included an initial interview, writing assessment and a final interview. Overall, it was a positive experience. The people who interviewed me were amiable throughout the whole process.", "Interview Questions": "Could you describe how your previous experiences relate to the skills required in this position? "}], [{"date": "12 Sept 2018", "title": "Program Coordinator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at World Resources Institute (Washington, DC) in Jul 2018", "Interview Descriptions": "Was recruited via LinkedIn. Had a phone screen with recruiter then a phone interview with hiring manager the next day. About a week later, I was asked to come in to talk with a panel of 4 on the team and then the VP. Heard within a few days after the panel interview that I had been offered the job.", "Interview Questions": "Why WRI?"}, {"date": "27 Jun 2018", "title": "Research Consultant Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at World Resources Institute", "Interview Descriptions": "The person who guided me through the process was a known person. He was the head of one of the departments. He reviewed the resume and asked some questions. The next round was a Skype call to understand the company culture and my role in the company.", "Interview Questions": "What is your 5 year plan? "}, {"date": "6 Jun 2018", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "I felt like the interview process could have been much more organized. I felt like I was not given a fair opportunity to present the totality of who I am as a candidate. I prepared for a phone interview and realized that I was not asked any questions about my knowledge, skills or abilities. I was only asked questions that seemed to screen me out for the running for this position. This was one of the poorest interview experiences that I've had in my entire career.", "Interview Questions": "Tell me about yourself."}, {"date": "11 Jun 2018", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 7 weeks. I interviewed at World Resources Institute (Washington, DC) in May 2018", "Interview Descriptions": "Applications for open positions are reviewed 3-4 weeks after job is posted as a batch. After I was contacted for the first phone screen to offer the process was 3 weeks. 1) 10 min phone screen by HR, 2) 30 min phone screen by hiring manager, 3) 1 hour panel with 4 ppl, 5) 1.5 hour Excel and writing skills test. Dorsey in HR is a superstar! Interview was well coordinated, great communication, and very professional.", "Interview Questions": "What types of contracts do you have experience in? "}, {"date": "4 Feb 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute in May 2018", "Interview Descriptions": "Quick and straightforward. I applied online. I was called for an initial phone interview, After that I received email for an online skill assessment. After completing the screen assessment I was then called for a video interview.", "Interview Questions": "Priority management"}, {"date": "16 Jul 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute (Washington, DC) in Apr 2018", "Interview Descriptions": "I had the first interview with my hiring manager and Project Coordinator and then a writing test. They sent me a question that I needed to answer in 30 minutes. The process was quick.\r\nI didn´t do an HR screening, I talked directly with the hiring team.", "Interview Questions": "What elements and skills from your past experience would be useful for this position?"}, {"date": "3 Jul 2019", "title": "SummerAt the Economics Center Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Apr 2018", "Interview Descriptions": "Three rounds of interview. The first round was through the phone with two economists, mostly about my education background and research I did. The second round was a writing test, and the third round was in person with two economists.", "Interview Questions": "What do you know about WRI?"}, {"date": "11 Jun 2018", "title": "Climate Policy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at World Resources Institute (Washington, DC) in Apr 2018", "Interview Descriptions": "2 rounds - phone and in-person interview with 2 people. There was also a writing test about a topic related to climate change. Mostly behavioral questions, and the process was very slow", "Interview Questions": "What is your future career goals?"}, {"date": "6 Aug 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at World Resources Institute (Washington, DC) in Mar 2018", "Interview Descriptions": "Had a phone call, then a group phone call, and then a memo editing exercise, after which contacting recommenders and that was it.\r\nTheir focus was on my knowledge on energy policy, and social media understanding along with how I can edit and re-write material more suited to their needs", "Interview Questions": "About my experience in climate work and writing experience"}, {"date": "24 Jan 2018", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "Six week process - analytical exam, individual interview, panel interview, writing sample submissions. Before a hiring decision was made, they pulled the position all together for strategic reasons. Frustrating but really great people working at WRI, very warm interviews and engaging discussions.", "Interview Questions": "Motivation for applying, my background,"}], [{"date": "16 Mar 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at World Resources Institute in Jan 2018", "Interview Descriptions": "The interview process will took months, which was odd, given that the position was meant to only last for 6 months. Although I approve of the great work WRI puts out, their hiring process takes a needlessly long amount of time. This lengthy interview makes WRI come off as somewhat elitist and difficult to deal with. Weeks-months can go by before you hear back on whether you will get to the next round of interviews.", "Interview Questions": "Why do you feel qualified for this position?"}, {"date": "3 Apr 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Resources Institute (Washington, DC) in Jan 2018", "Interview Descriptions": "The process was quite straightforward. I applied online and got shortlisted for an interview. The interview was taken by the project leads and was quite formal. Almost immediately after the interview, I was asked to submit a written test based on which I was rejected after a week or so.", "Interview Questions": "Why did you apply for this internship? "}, {"date": "12 Dec 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Resources Institute (Washington, DC) in Dec 2017", "Interview Descriptions": "Friendly, easy going with general interview questions. Consisted of phone screen, panel interview with 3 people and a written assignment. Applied online, has phone screen within a few days, interview was a week after.", "Interview Questions": "Why WRI?"}, {"date": "8 Jan 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute in Oct 2017", "Interview Descriptions": "The process included an initial interview, writing test, and follow-up interview over Skype with an associate and a director. They were both very personable and kind both during the interview and in our correspondence over email.", "Interview Questions": "What made you interested in this position?"}, {"date": "3 Sept 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Washington, DC) in Jun 2017", "Interview Descriptions": "I had a brief phone screening then a full Skype interview with the researcher I would have been working with. The interviewer followed up with my references and got back to me after about one week. Very communicative.", "Interview Questions": "What was something I am proud of"}, {"date": "5 May 2017", "title": "Sustainability Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at World Resources Institute", "Interview Descriptions": "there are two rounds of interviews: a phone interview and a written test.  the interviewer is the manger of the sustainability program.  and  I learn a lot about the sustainability initiatives at WRI.", "Interview Questions": "Why are you interested in sustainability?"}, {"date": "22 Apr 2017", "title": "GIS Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "Submitted an application and received an initial interview request after about 2 weeks; then made it through 2 separate rounds of interviews, each about a week apart and lasting about 40 min to an hour long. A few days after the second interview I was asked to scheduled a writing test via email. The test lasted 3 hours long and required me to create a powerpoint presentation from a large, confidential spreadsheet -- although the subject of the data was relevant, the \"writing test\" didn't require me to write nor did it involve GIS. Three weeks after the test I received an email stating that I was not selected for the position.", "Interview Questions": "Nothing unexpected--why do want to work within the organization, give examples of projects that you've worked on, etc."}, {"date": "14 Jun 2021", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute in Jan 2017", "Interview Descriptions": "Consisted of a 20 min phone screen with HR, followed by 30 min phone interview with the hiring manager, 2 one hour in person panel interviews and 1 written test. All over the course of a couple weeks.", "Interview Questions": "Questions focused mostly on the tasks at hand\r\n"}, {"date": "15 Nov 2016", "title": "Restoration Associate India Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at World Resources Institute", "Interview Descriptions": "Application submitted on the ending date.  communication through personal channel.  It's quite unprofessional. Looks like they already had a candidate in mind. Somehow it feels like I wasted my time. Before you apply ask for offer in terms of salary", "Interview Questions": "N/A"}, {"date": "8 Feb 2017", "title": "Project Coordinator II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Resources Institute (Washington, DC) in Nov 2016", "Interview Descriptions": "40 minute skype interview, casual and friendly. Asked mostly about past experience and how I would handle certain situations, what about the company interested me, then asked to complete an online assessment. Completed and didn't hear back after following up about a week later and about 3 weeks later received an email that I didn't get the job.", "Interview Questions": "What interests you about our company?"}], [{"date": "18 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Oct 2016", "Interview Descriptions": "Two phone interviews with three people total. In-person preferred, but I did not live in DC at the time. The process went fairly smoothly, and the people I spoke with were nice and laid back.", "Interview Questions": "What type of experience do you have working with large data sets?"}, {"date": "29 Sept 2016", "title": "Mid-management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "The communication with the team (email) was good. The phone interview was quite unprofessional: the person was over 10 mn late and didn't apologize, had a very poor connection, in addition to dogs barking in the background (working from home?), and abruptly ended up the interview after 20 mn because they had another meeting. \r\nIf you're not interested in interviewing candidates, then don't do it! Candidates are not responsible for your poor time management and interview skills.  WRI should provide recruitment training to their managers, some really don't give a positive image of the organization.\r\nI have interviewed many candidates in previous jobs, and always ensured to at a minimum be respectful and listen to what they had to say if I invited them.", "Interview Questions": "How would you accomplish the main tasks requested?"}, {"date": "15 May 2017", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Resources Institute (Mumbai) in Sept 2016", "Interview Descriptions": "It was a good experience. The process was timely. I was made to feel comfortable.\r\nthey took some time to get back to me after the interview with their final offer but it was worth the wait. There were 2 rounds of interview and both were crisp and precise. The questions were strictly work related o gauge my understanding of the field, my previous experience, and to check my fitment to the organization culture and environment.", "Interview Questions": "My understanding of the current trends in the field"}, {"date": "8 Jul 2016", "title": "Research Role, Mid to Senior Level Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Terrible process.  Had two interviews with my prospective supervisor - one on the phone and one in person with a panel.  Both times the interviewer was 15 minutes late, which is not by itself terrible, but considering I work full-time and they offered no apology, I considered quite rude.  Both times the interviewer spoke about 80% of the time and repeatedly interrupted me.  I found the questions to be combative and quite frankly inappropriate for the level of the position and my level of experience.  At the end of the interview, I told the person that I had not had an interview like this one for about 12-13 years (for an entry-level consulting position), that I was shocked by the combative nature of the questions, and that I was hoping that it would be a more collaborative tone. An hour after the interview, I wrote and informed them that I was no longer interested in the position.  Later on I looked up the interviewer's teaching profile (they were formerly an academic) and found mostly negative reviews and low ratings at two universities.  \r\n\r\nWRI does good work, but they need to seriously reconsider their hiring process.  Positions that require a PhD and 10+ years of experience do not need to take a writing exam (would have been the next step) and interviewers should be trained in appropriate techniques and questions.", "Interview Questions": "What would an appropriate sample size be?"}, {"date": "27 Sept 2016", "title": "Trasport Research Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Resources Institute (Washington, DC) in Jun 2016", "Interview Descriptions": "I applied the position on line for couple of days, and then received an email for the hiring manager. We scheduled a time and had a phone interview later on. There are two interviewers, who were quite kind. After the phone interview, they required sending them recommendation letters and writing samples.", "Interview Questions": "What are the possible ways to slow down traffic speed? How is your experience on VISSIM"}, {"date": "11 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Telephonic interview. I got an internship through a competition. I was easier and there were less questions, but the the organization did not seem to be interested in taking interns.", "Interview Questions": "About the area of internship and what ideas do I have of my own?"}, {"date": "26 Aug 2019", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute (Washington, DC) in May 2016", "Interview Descriptions": "First a phone call, then a panel interview over Skype and then an in person interview. People are pretty nice and ask relevant questions to your work style. Need to know that you'll be able to put it all in.", "Interview Questions": "Tell us more about how your experience relates to this job. "}, {"date": "25 Apr 2016", "title": "Senior Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "This is actually for two interviews for different positions. In the first, I was asked an illegal question about my ancestry. In the second, I was asked a similar one, both times very casually, as one might do when meeting someone in social circumstances. The first process went on for months with various phone and Skype calls, and then an in-person with several people over an entire day. The second position involved only one call, and then an entire day in their office, including a presentation. Both times, the in-office process seemed chaotic with them running around to find conference rooms, etc., and I wasn't provided a schedule in either case. \r\n\r\nIf you look around their office and website, you will see a very homogeneous American work force with a sprinkling of foreigners, but either no or very few US minorities. Very strange for an institution based in DC that presumes to handle global problems, but with a staff with very limited perspectives.", "Interview Questions": "Illegal questions re ancestry"}, {"date": "11 Apr 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at World Resources Institute", "Interview Descriptions": "The initial phone interview was conducted with the Human Resources department. The second and final interview was conducted via phone with the entire team and last for maybe 40 to 50 minutes. During the interview, it was expected that I understand the team's mission and basic technical approach. The entire interview process lasted for 2 to 3 weeks. The human resources department spoke with me again (via phone) after the second interview was conducted to follow up.", "Interview Questions": "What is your experience with grant management?"}, {"date": "19 Apr 2016", "title": "GIS Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Resources Institute (Durham, NC)", "Interview Descriptions": "I had 5 rounds of interviews with the GFW team that lasted over 3 months, and was completely shocked to know that I wasn't selected. \r\n\r\nThe first 2 rounds were the longer interview rounds wit the first being a phone screening followed by a panel. I was then asked to make a 30 min presentation related to geospatial analysis which was followed by another half our of interviewing with the extended GFW team. Lastly, I wrote the written test that had 3 GIS related questions.\r\n\r\nThe whole process took so long which needs to be rectified. Yes, every team is busy but I thought that is what sets WRI and GFW team apart.", "Interview Questions": "Considering I had multiple rounds the range of questions included general forestry related general knowledge based questions, written and oral communication based questions and GIS."}], [{"date": "9 Sept 2016", "title": "Urban Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (New York, NY) in Apr 2016", "Interview Descriptions": "Applied online. First interview was organised fairly quickly, and was by telephone. Interview process was very professional, relaxed and pleasant. The follow up has been very slow though. Although the timeline was given as two weeks after the interview, it has now been close to eight weeks, with no response, other than they are still undergoing the review process and will be in touch.", "Interview Questions": "Tell me about yourself"}, {"date": "16 May 2016", "title": "Transportation Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at World Resources Institute (San Diego, CA) in Feb 2016", "Interview Descriptions": "The first phone interview took 70 minutes and was conducted by two people in the department. After that, I did a 4 hour writing/data analysis exam. I had at max 4 hours, but felt that even that wasn't enough.", "Interview Questions": "They asked for me to develop a hypothesis and a process of evaluation for a new bus policy in a city such as Sao Paulo, Brazil. \r\n\r\nThey also asked why I chose my undergrad major and they asked about past research papers I have done in school and what my thesis/conclusions were."}, {"date": "22 Feb 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Jan 2016", "Interview Descriptions": "I did a phone screen with a Program Manager and was invited to DC for an in-person interview. The interview consisted of 2 hour-long panel interviews with 3-5 staff members. One panel was with supervisors and the other with peers. Then I was given an hour-long writing test, which wasn't too difficult.", "Interview Questions": "Tell us about a time you've had a conflict while working on a project. "}, {"date": "23 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Resources Institute in Jan 2016", "Interview Descriptions": "Applied three weeks before they got back. Set up interview via email. Phone interviews were for 20 and 30mins each. Gave a job description and asked how I was a good fit for it. Ask you to describe your project work and about your opinion on their work. Friendly short interview", "Interview Questions": "WHy WRI ?"}, {"date": "9 Dec 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Had an initial hour-long skills analysis online. Fairly basic. During interview, interviewer asked general basic questions, as well as tried to fill in some missing information. Interviewer was very helpful, gentle.", "Interview Questions": "What are your top three selling points as a candidate? What is your experience in (subject area)?"}, {"date": "8 Nov 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "Phone screening interview that lasted 20-30 minutes-- very general in nature. \r\n\r\nTwo weeks later, panel interviews. 2 panels with writing/excel test in between. Was offered the position about a week later.", "Interview Questions": "How do you handle stress?"}, {"date": "8 Oct 2015", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at World Resources Institute", "Interview Descriptions": "Response to my application was very rapid. Had a Skype interview, and quickly received notice about setting up a second. The second took longer to organize. After the second, they said they'd be in touch, but I didn't hear for several months. Eventually had to contact them because I was offered a position elsewhere.", "Interview Questions": "What excites you about this position?"}, {"date": "3 Oct 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "The interview process was pretty straight forward. They make you comfortable to speak during the interview process. Also they are very open minded people. \r\nThe process consists of :\r\n1) Exam\r\n2) Personal Interview", "Interview Questions": "What did you do during your work at Doordarshan?"}, {"date": "17 Aug 2015", "title": "Fellowship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute in Aug 2015", "Interview Descriptions": "I was contacted by email to set up an appointment. I then had to take a writing test on a topic related to the position.During the phone interview, my interviewer started by telling me more about the position then asked me the following (not necessarily in this order): why are you applying? why are you interested in this position? What is your working syle (e.g., prefer to work alone, in group, minimal supervision, etc.); tell me about your experiences relevant to the position; tell me about what you are doing now; where do you see yourself in the future?", "Interview Questions": "During the phone interview, my interviewer started by telling me more about the position then asked me the following (not necessarily in this order): why are you applying? why are you interested in this position? What is your working syle (e.g., prefer to work alone, in group, minimal supervision, etc.); tell me about your experiences relevant to the position; tell me about what you are doing now; where do you see yourself in the future?"}, {"date": "15 Sept 2015", "title": "Economist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at World Resources Institute (Washington, DC) in May 2015", "Interview Descriptions": "Everything was done by online. I applied through online system and sent my cover letter and resume.\r\nThey asked me to send my previous writing related to the issue they were dealing with.", "Interview Questions": "They asked me to send my previous writing related to the issue they were dealing with."}], [{"date": "18 Apr 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC)", "Interview Descriptions": "The interview process required 2 panel interviews and an intensive writing assignment, which was quite a lot considering the level of job they were hiring for.  At the end I had the impression that an internal candidate was in line for the position. No feedback was given as to why an offer wasn't made.", "Interview Questions": "N/A"}, {"date": "15 Feb 2017", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Resources Institute (Beijing, Beijing) in Apr 2015", "Interview Descriptions": "Several rounds of interviews. The first one is a written test, which is very intensive on issues in the subject that matters. The coverage is very wide and real test on one's understanding of the issue and the breath of the coverage of the issue. The second round is a panel interview. Then talking to line managers on concrete issues of the work.", "Interview Questions": "Very much focused on past experience, with a focus on a) fund raising records; b) connection to government--to make an impact on policy c) management experience of the team."}, {"date": "12 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Resources Institute in Apr 2015", "Interview Descriptions": "I was shortlisted first for an interview, which was followed by a written test that included making a map from WRI datasets and writing a few paragraphs to describe it. The interview was pretty laid back, and the interviewers were very friendly and encouraging, yet curious and asked some very pertinent questions that required critical thinking. It was done over the phone with 2 interviewers.", "Interview Questions": "Nothing surprising."}, {"date": "18 Feb 2015", "title": "Water Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Resources Institute", "Interview Descriptions": "The phone interview took less than half an hour. Two of their program associates conducted the interview with me. Questions were closely related to the qualifications and past experience. Asked about internship experience, writing and programming skill.", "Interview Questions": "Your experience in using geospatial analysis tool during your internship"}, {"date": "25 Feb 2015", "title": "Position In the Administrative Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Resources Institute in Feb 2015", "Interview Descriptions": "Had a 20 minute one-on-one phone interview followed by two in person interviews. Each of the in person interviews were with 2-3 people; there was no one-on-one. A short writing test was giving at the first in person interview. Things moved very quickly.", "Interview Questions": "Describe a time...\r\nExplain how you...\r\nWhat do you think you'd bring to this position?\r\nHow do you think your current coworkers would describe your working style?"}, {"date": "27 Jan 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "The interview process Took three weeks. Phone interview then there was a skype/in person interview, and then I had to take a writing test. The staff was very nice and I felt comfortable.", "Interview Questions": "Nothing out of the ordinary, basic interview Qs"}, {"date": "4 Mar 2015", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Resources Institute (Washington, DC) in Jan 2015", "Interview Descriptions": "Very quick response after applying, set up phone interview at end of the week, in-person interview the next week, followed by a standard writing test that required some knowledge. Friendly and personable interview staff, but firm and challenging questions. Enjoyed the process but there was kind a bit of wait time in between each step.", "Interview Questions": "What would you find particularly easy and difficult in this position?"}, {"date": "22 Oct 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Resources Institute (Washington, DC) in May 2014", "Interview Descriptions": "They sent an email to me in order to schedule a phone interview (a few days after I submitted my application online), after the phone interview they asked for my writing samples, after I sent my writing samples via email, they gave me an in-person interview at WRI. I was interviewed by two people. The interview also included a task simulation (writing test).", "Interview Questions": "Why are you interested in this position? What do you know about WRI? They asked a lot of behavioral questions based on hypothetical scenarios. I also took a writing test, which was basically a simulation of ordinary tasks I was going to do if hired. I had to process a lot of readings and then summarize in a very short time, according to the format they specified."}, {"date": "18 Nov 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Resources Institute (Washington, DC) in Feb 2014", "Interview Descriptions": "Everyone was kind and welcoming. They had a general vision of the job but were very open to additional opportunities given the interest of the employee. Overall it was positive and brief. I wasn't a great fit (we both figured that out) but it seems like a great place.", "Interview Questions": "Why do you like development?"}, {"date": "3 Aug 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at World Resources Institute", "Interview Descriptions": "phone interview, checking with background and related experience. about 30 min", "Interview Questions": "N/A"}], [{"date": "4 Jun 2013", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Resources Institute (Washington, DC)", "Interview Descriptions": "Met hiring manager at UN conference on climate change, establish connection.\r\nApplied internship online and went through 3 phone interviews and one in-person interview.\r\nIn-person interview is rare for intern candidates that are non-DC residents. However, if you can travel to DC this is highly recommended.", "Interview Questions": "n/a"}, {"date": "23 Nov 2013", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Resources Institute in May 2013", "Interview Descriptions": "Online application. Interview process started one month later. Two rounds of interview. First interview was with an Associate and the second one was with the Senior Associate. People were really nice. Two weeks after the last interview they offered me the internship.", "Interview Questions": "Behavioral question: what was the most difficult/unexpected situation you had to handle at work?"}, {"date": "23 Nov 2014", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Jun 2011", "Interview Descriptions": "A phone interview followed by two in-person interviews and a writing assignment (on site). The phone interview was with just an HR person, the first in-person interview with a group of 5 (one of them was video-conferenced in) from various departments of the Institute, including HR and Communications.\r\nThe interviews were very standard but pleasant. \r\nThe third interview included a 30-minute talk with an HR rep about salary and benefits. At the end of the third interview, I was given a scientific text and asked to write a press release about it. The assignment itself was easy but it had a \"high school exam\" feel to it, which I found inappropriate for a professional organization in Washington DC. \r\nHowever, the most inappropriate aspect of the interview/hiring process was that after the third interview, I was told I was one of two candidates left in the running, and asked to submit references - which they never checked.", "Interview Questions": "The interviews were really standard, including questions about your greatest strengths and weaknesses. One question I found interesting was that I was asked how much push-back (in form of promotions, salary raises, etc) they should expect from my current employer if I were to leave for WRI."}, {"date": "16 Jun 2011", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Resources Institute (Washington, DC) in May 2011", "Interview Descriptions": "Asked some behavior questions and let me express my thinking of their current project.\r\nAsked me what date I can start to work. But they need someone to start pretty quick and I can't finish my current project. That's the reason I didn't get in.\r\nThe interview was easy. And the people were friendly. Must be nice to work with if there was no time conflict.", "Interview Questions": "Are you better in working independently or as a team?"}, {"date": "22 Aug 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Resources Institute (Washington, DC) in Mar 2011", "Interview Descriptions": "-Met the recruiter in person before the job becomes available\r\n-Applied online through the careers portal when it did\r\n-Went through a group phone interview approx. 3 weeks later\r\n-In-person interview at hq a month after with 4 team members\r\n-Short writing test (1-2 pages in 24 hours)\r\n-Reference check\r\n-Offer and negotations", "Interview Questions": "N/A"}, {"date": "28 Mar 2011", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Mar 2011", "Interview Descriptions": "I first had an interview by skype.  They then contacted me about a week later for an in-person interview, which consisted of an hour-long interview with the project manager and an hour-long interview with three other people working on the project.", "Interview Questions": "The questions were fairly standard.  Make sure you know about both the technical issues that you will be dealing with in the job and why you want to work for the organisation."}, {"date": "31 Oct 2010", "title": "GIS Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at World Resources Institute in Jul 2010", "Interview Descriptions": "I submitted the on line application on line on May 23th, and received the e-mail telling me to interview on May 24th and I got offer on 25th. The whole process is very quickly.", "Interview Questions": "Describe your profession skills in GIS  "}, {"date": "7 Aug 2010", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at World Resources Institute (Washington, DC) in Jan 2010", "Interview Descriptions": "Recruiter telephone interview and writing sample", "Interview Questions": "N/A"}, {"date": "7 Jun 2009", "title": "International Climate Policy Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Resources Institute (Washington, DC) in May 2009", "Interview Descriptions": "I only had a phone interview.  It was a cold call; I thought I was returning a call to set up an actual meeting, but ended up having an in-depth interview over the phone.  Questions were pretty standard - asked me about my background, different experiences listed on my resume and why I wanted this position.  Also, how my particular skills would be an asset for the job.", "Interview Questions": "no specific question - it was more that I was unprepared because there was no indication that there would be an interview when I was returning a voicemail.  "}, {"date": "11 Feb 2010", "title": "Environmental Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at World Resources Institute (Washington, DC) in Jan 2009", "Interview Descriptions": "Did initial phone screening interview with lower level employee.  Did another phone interview with two higher level employees.  After a week was asked to come in for a full day interview with 6 people.  Was flown in and put up in hotel during process which took about 3/4 of the day to complete.  One week later received offer letter, contract and phone call about position with 2 weeks to respond yes or no.", "Interview Questions": "Walk us through your resume"}]]