[[{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic work culture, nepotism", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Mar 2023", "job_title": "Humanitarian Aid Worker", "duration": "N/A", "pros": "Builds your experience and if you're lucky to have a supervisor that is supportive, you get recommended for better opportunities.", "cons": "Depending on the country, you might experience nepotism, slander and a toxic work culture first hand. My first few years there were okay until some key leaders changed starting from the HR department. I saw how the organisation stirred up slander just to get rid of certain employees that they did not like, no matter how hardworking, and this reaulted in the loss of bigger projects. I also witnessed how relatives to top people in the organisation were offered positions that they didn't qualify for. It may be different at the HQ office, but the organization is slowly losing it's credibility. Overall, the work culture takes a toll on your mental health and I'd choose joblessness over it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Enjoyable place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 May 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great people all going for the same mission of healthier lives worldwide", "cons": "Hiring practices could be better"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working at CMMB", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Dec 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good work environment with friendly staff and management team.", "cons": "N/A - I had positive work experience at CMMB."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Nov 2022", "job_title": "Finance Officer", "duration": "N/A", "pros": "Good managers at heart in work place", "cons": "No cons working at the organisation"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Apr 2022", "job_title": "Senior Specialist in New York, NY", "duration": "N/A", "pros": "CMMB has had growing pains but is a great place to work. I am thankful daily to be there.", "cons": "It's small and if you're ambitious, it may be hard to move up. But . . . that does not affect me."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Place to Work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Sept 2021", "job_title": "Major Gifts Officer in New York, NY", "duration": "N/A", "pros": "4-Star Charity Navigator\r\nEngaged staff\r\nLife-saving mission", "cons": "Staff turnover is periodically high\r\nNot well known despite being more than 100 years old"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A good employer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jul 2021", "job_title": "Project Officer in Nairobi", "duration": "N/A", "pros": "good work ethics, Team players, and very flexible working hours", "cons": "Most programs aren't renewed, hence you might not be reabsorbed into another program like in other organizations"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jan 2021", "job_title": "Intern", "duration": "N/A", "pros": "Great people, good working environment", "cons": "no real cons, good place"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A perfect case study for all things that goes wrong in an organization", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Dec 2016", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "- The office is closed during Christmas week\r\n- Flexible working arrangement\r\n- The staff at the Long Island City warehouse are lovely and get the job done", "cons": "A very weak and not professional leader leads to a shaky financial situation. \r\n\r\n3 years after implementing the new program, they still can articulate and show results of the program.\r\n\r\nFor an organization that claims love and respect as their values, they treat its employee very poorly. The management fired highly experienced and professional staff all the time so that their inexperienced close-knit can still have jobs.\r\n\r\nNepotism - bypassing formal recruitment process by bringing in friends as volunteers and consultants, and later hire them as full-time staff.\r\n\r\nThe innovation team actually lacks vision, leaderships, experience, strategy, and professionalism. They are highly inexperienced and do not have a solid understanding regarding the global health landscape, marcomm, and fundraising. They rely on Google search to help do their jobs or find a new “innovation”\r\n\r\nDoes very little work that actually helps the beneficiaries. Most money raised from donors is spent on the ridiculous amount of management salaries and benefit as well as “marketing” as opposed to actually funding the program and ground work. That’s why they still unable to show significant results of the “program”\r\n\r\nIt is infuriating that the board members choose not to care and close their eyes"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Lots of changes and a sense of building momentum.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Exciting and relevant mission, strategy and programs with lots of new faces around the office. Field staff are inspiring to work with when you get the chance to interact with them and the international volunteer program is really good.\r\n\r\nThe office culture is pretty relaxed compared with most other places I've worked. Most colleagues and leadership seem committed and seem like they care about you as a person, and the CEO usually has an open door and makes a point to try to get to know everyone.", "cons": "Disjointed teams without a clear culture... complaining, underperformers and defensiveness tend to overshadow the good work being done or stop progress in its tracks. For an organization that is depending on the success of a lot of internal changes, many teams are surprisingly risk-averse and lack creativity and the ability to execute."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great mission focused on maternal child health and small, family friendly workplace", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Nov 2018", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Very family friendly, encourages work-life balance (their mission is maternal child health after all) with very generous time off including Catholic holidays, vacation leave, sick days, personal leave, and public holidays, not to mention option for occasional remote work for many staff. Small size allows all staff to assume different roles and new experiences if interested in doing so. Very mission-driven organization, which permeates throughout departments and locations, moreso than most in this sector in my opinion. Although a Catholic FBO, it has a very diverse workforce including many women and minorities in top leadership positions and is data-driven (it was founded by a New York doctor a century ago who lost his wife and child to disease).", "cons": "Wall Street location is a commuting inconvenience to some, although the Manhattan location is a pro in other ways (e.g. networking events).  Some benefits If career advancement is important to you, you may find opportunities limited due to small size of org (most people here are in it for the mission)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Strategy & Innovation Team", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Jan 2017", "job_title": "Innovation Assistant in New York, NY", "duration": "N/A", "pros": "My favorite part about being apart of CMMB is their positive, supportive environment. You will find that a majority of the employees are very down to earth, friendly and willing to help you out when needed. Your supervisors and teammates are willing to work with you to accommodate your needs, I felt appreciated knowing that my comfortability was a priority to them. \r\n\r\nAnother aspect that I favored was how much room you have to grow. You're given enough freedom to express your creativity within your assigned projects.\r\n\r\nAlso, the office has such a great location in the financial district. It's close to plenty of public transportation and great places to eat.\r\n\r\nIt was a joy to come to work everyday. You will feel cared for and there's plenty of opportunities to showcase your abilities that you have to offer the organization. It was a pleasure to be apart of CMMB, they are really working hard to improve the lives of those in poverty.", "cons": "I can honestly say that I did not experience any downsides while working at CMMB. It was such a pleasant experience and I truly have nothing to complain about."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A Lot Going On", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 May 2015", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "To be in a place where there are shared values, with people motivated to work to improve the lives of the most disadvantaged and poorest people in the world in places like the South Sudan, Haiti, etc., is a great feeling.", "cons": "This is a turn-around of a 100-year old non-profit.  The old, sleepy guard was replaced a few years ago, and a new team is at work executing a new plan. It takes time to turn a large, moving ship with legacy systems and new systems both requiring resources.  There is much work to do, and it requires a particular type of person to be comfortable working with one foot in the old, and one foot in the new."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Noble mission, remarkably bad execution", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "A small minority of field operations are well run. \r\nJunior staff at headquarters are hard working.", "cons": "CMMB's leadership is bloated (top heavy personnel and resources), incompetent, and rife with cronyism. During the time I worked there, unqualified people were regularly hired and paid six figure salaries solely because they had personal connections to other managers. At best, these managers added little value to the organization and at worst they undermined the valiant efforts of a small number of committed junior staff. CMMB has a noble mission, making it all the more tragic  that it wastes such a large % of donors' money on astoundingly bad management. To top it off, CMMB benefits are bad and the general work atmosphere is marked by distrust and low morale."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Headed in the right direction.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Oct 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Such a great family. People care about the work and they care about each other...makes it easy to get up and go into work every day. Sense of movement and future-oriented. You get to meet some truly amazing people doing incredible work in some difficult areas around the world.", "cons": "Typical growing pains with a new strategy and new people and new leadership. A little too bureaucratic for the size of the organization, which means things move much slower than they need to."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "International experience, inspiring work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Getting some good international experience, people are really nice. Summer hours, work/life balance pretty solid. Not as big as some other NGOs but it's cool to not have the layers so some of the senior people actually talk to you.", "cons": "Whoa, guess they fired somebody in the past who has issues with basic math and honesty? How many reviews can one person leave?? No big complaints from my time here, but it does seem a bit top-heavy. Basic business expertise a little hit or miss, but seems to be getting better."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Mission-driven team working towards a healthier world for women and children", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Oct 2018", "job_title": "Specialist in New York, NY", "duration": "N/A", "pros": "People are driven by their desire to serve women and children living in poverty, spirit of entrepreneurship, leaders care for staff professionally and personally, , opportunities to visit programs, lean and efficient, opportunity to grow (I began my journey as an intern and have been given many opportunities to grow since then)", "cons": "We work really hard but the work is fulfilling and the people are supportive and kind, in recruiting we need to ensure the people we are choosing are the right fit"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "So much potential.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Dec 2018", "job_title": "Partnerships in New York, NY", "duration": "N/A", "pros": "Great mission. Very ambitious and miraculously saw some good growth.", "cons": "Managers did not know how to manage. Very disorganized and there was very little trust and communication among senior management. Very political and WAY too much turn over; almost 20 people in my short time, and since leaving there have been many others. Keep in mind there were only about 35 in our NYC headquarters. Those who have been there a long time weren't of much help."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Questionable ethics and grossly overpaid, ineffective CEO", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Potential to do much good through the faith-based health systems in countries where they work, if there were a strong vision and will to add value.", "cons": "The CEO doesn't care--and hired a group of unqualified personal friends or people with whom he has previous relationships to leadership roles for which they are totally not fit. He fires people left and right if they disagree or dare to strive for actual accountability or impact or vision. Sickening to see the total lack of commitment and work ethic from the leader--and the nepotism, backstabbing, dirty politics in what is supposed to be an NGO built on Catholic values. Self serving CEO gathering a wildly over-inflated salary while barely working."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Highly accountable NGO", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Fantastic mission, highly accountable \"boots on the ground\" approach; great team of people working together on new initiatives.  Reasonably innovative leadership willing to try new things.", "cons": "New roles being filled take a long time and this delays progress on existing projects; some decisions take a long time.  Overworked staff."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Growing organization, facing significant change and moving forward", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Apr 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Inspirational leadership\r\nPowerful strategy\r\nNew team and culture in formation\r\nCompelling vision and mission", "cons": "Lack of a uniform culture\r\nNegativity of some teams\r\nNo sense of urgency\r\nLack of field experience in critical teams\r\nNot enough doers and too many complainers"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Very unusual place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Oct 2018", "job_title": " in New York, NY", "duration": "N/A", "pros": "Some lovely and very friendly people.", "cons": "Very unusual leadership style and strange dynamics. The innovation-strategy-comms team is unorganized, does not work with a plan and changes direction frequently. Very high turnover. Bloated salaries for the senior executive level.  Some highly questionable relationships.  \r\n\r\nOverly target oriented and seemed dishonest in fundraising approach.  They were raising donations to hit the funding target for causes that are not part of the mandate.\r\n\r\nAlso not honest about the job requirements and later disclosed parts of the job that changed the role drastically."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Human Resource Officer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Sept 2015", "job_title": "Human Resource Officewr in Yambio", "duration": "N/A", "pros": "Employee Well fare is paramount in CMMB\r\nTeam work and collaboration well evident in CMMB\r\nGood working employee-employer relationship", "cons": "Portfolio is limited and thereby job security is threatened\r\nStaff development is also minimum,no exposure and external training"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Inspiring work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Dec 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- inspiring vision and mission\r\n- amazing work in the field\r\n- great professionals and beautiful team work", "cons": "- not enough room to grow \r\n- great to have more diversity on the board and leadership\r\n- recruitment process needs to be improved to prevent high turnover"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "extremely high turnover", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A mission that really drives the organization", "cons": "Management doesnt trust their employees to do the job they were hired for"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poisonous atmosphere", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Oct 2014", "job_title": "Anonymous", "duration": "N/A", "pros": "Decent salaries for non-profit, good location (until they move next year), yogurt on Wednesday mornings.", "cons": "Horrible atmosphere, completely rudderless, no real programs, tons of HR interference and red tape, the most us-v-them place I've ever worked, nothing but silos. Completely top-heavy - more senior vice-presidents than admins! Initiative is neither encouraged nor rewarded... Just keep your head down and don't have any opinions of your own."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great place to learn, initiate and have impact.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Apr 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Hard working people that devote their lives to the work.", "cons": "Leadership has some high learning curves."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "My time at CMMB has been wonderful. Interns are given important tasks and their work is valued to not only your team but the organization as a whole.", "cons": "I really cannot think of anything I would change"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Financial Controller & Compliance Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jul 2016", "job_title": " in Port-au-Prince", "duration": "N/A", "pros": "Small and tight knight team of highly skilled professionals...", "cons": "Not enough room to grow professionally"}]]