[[{"date": "13 Apr 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hahnemann University Hospital (Phila, PA)", "Interview Descriptions": "Great, smooth and simple. The manager at the time was very sweet and understanding. Explained everything in great detail. I was given a tour of the until and a daily break down of what would be expected .", "Interview Questions": "Am I team player ? "}, {"date": "29 Jan 2019", "title": "ERS Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Hahnemann University Hospital", "Interview Descriptions": "it is god  easy i have to enter 30 words that is too much for me, this website should be responsible for its low quality you have to comment to see others comment", "Interview Questions": "what is your name"}, {"date": "21 Sept 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Sept 2018", "Interview Descriptions": "Applied online and about two weeks later heard from a nurse recruiter to set up an interview. Interview was with floor manager and clinical manager and lasted about an hour. First half was talking about the position and the floor as well as answering typical interview questions. Second half was getting oriented to the unit and speaking with nurses on the floor. Was offered the job a week and a half later.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Jun 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hahnemann University Hospital", "Interview Descriptions": "Interviewed once by HR and then the director of the unit. Everyone was very professional and stayed in contact throughout the entire process. They eventually called me to follow-up and ask additional interview questions.", "Interview Questions": "Why did I want to work in the hematology/oncology population?"}, {"date": "20 Jul 2019", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Apr 2018", "Interview Descriptions": "Had to email HR repeatably and they gave me the wrong start date. Took a long time to get in contact with them. Completed online application then received a phone screen and an in person interview. Heard back within a month. Had to remind HR to update me on my status. Should have taken that as a sign not to start because the hospital went bankrupt a year later.", "Interview Questions": "Here's the fridge where you should get your specimens but really they could be in any of these fridges."}, {"date": "21 Jan 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Hahnemann University Hospital in Dec 2017", "Interview Descriptions": "Met with HR, the director, and the manager. Took a brief tour of the unit and met with other nurses. I was encouraged to ask the nurses questions as well and had positive interactions and vibes with everyone I met. I was called two days later and offered the position,", "Interview Questions": "Why did you choose Hahnemann?"}, {"date": "14 Jun 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Hahnemann University Hospital", "Interview Descriptions": "Phone interview, in person interview. Human resource will call you first then set a up an interview . The person will explain about the job and how long the interview will take.", "Interview Questions": "Tell me about yourself"}, {"date": "22 May 2017", "title": "Certified Nursing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Hahnemann University Hospital (Upper Darby, PA)", "Interview Descriptions": "Went to job fair for first interview \nFor second interview was with director of nursing I thought interview went good but I guess it didn't because 3 wks has passed and no phone call so I reached out to them and they told me that they picked the people they wanted", "Interview Questions": "What would your current job say about you if I was to call"}, {"date": "16 Nov 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hahnemann University Hospital (Philadelphia, PA)", "Interview Descriptions": "Met with HR who walked me up to the floor to meet with the nurse manager. Interview was one on one with a series of questions. Never heard from HR after the interview. Tried to follow up but no answer.", "Interview Questions": "Why nursing?\r\nHow do you handle stress and conflicts in the work environment?"}, {"date": "7 Jun 2016", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Hahnemann University Hospital", "Interview Descriptions": "Your average interview, friendly people, typical interview questions. Offered a time to shadow after interview, was not able to participate in this part.  Interview lasted a short twenty five or thirty minutes", "Interview Questions": "Typical questions: Why do you want to work here? Why this position? 5 year plan? Best patient interaction? Worst clinical day and how you handled?"}], [{"date": "8 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Mar 2016", "Interview Descriptions": "Very brief, no shadowing on unit, quick overview of expected requirements, almost seemed like I wouldn't get the job it was so short, was offered the position less than 1 full day later", "Interview Questions": "Do you understand the current nursing model?\r\nHow would you handle an upset patient or family member?"}, {"date": "7 Jul 2016", "title": "Registered Nurse Per Diem Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Aug 2015", "Interview Descriptions": "After I put my transfer in to change my status from full time to house pool I was called for an interview in the staffing office. It was casual since I was already an employee. I was told about the expectations, the pay scale, and what was required of me. I felt it comfortable and that all my questions were answered by the end of the interview.", "Interview Questions": "Will you be able to manage floating to different floors and assignments on a daily basis?"}, {"date": "23 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Jun 2015", "Interview Descriptions": "I had an initial interview with Human Resources manager, where salary, shift, and benefits were discussed. Next, I interviewed with the Director from the specific hiring unit. Then I returned at a later date to meet with the Nurse Manager and Asst. Nurse Manager for a third interview. The last step of the interview process involved shadowing a nurse for 4 hours on the unit. Within hours after the shadowing experience, I received a call from Human Resources with an offer.", "Interview Questions": "How comfortable do you feel working in an inner city hospital?"}, {"date": "18 Sept 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Jun 2015", "Interview Descriptions": "I was contacted by the HR 2 days after the interview and started training in 2 weeks. The interview as quite easy because the manager basically only asked me to tell her a little about myself.", "Interview Questions": "Tell me about yourself "}, {"date": "5 Apr 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hahnemann University Hospital", "Interview Descriptions": "Met with both HR and nurse manager. HR asked the basic why here, strengths, weaknesses, goals, and went over insurance information,  etc. Meeting with the nurse manager was similar with job description,  the unit, what would be expected. Similar questions asked as HR. Offered a shadow experience. Shadowed another RN for 3 hours. Never heard back from the nurse manager or HR even after a follow-up phone call regarding the position.", "Interview Questions": "If you could choose one word to describe yourself what would that word be and use it in an example."}, {"date": "16 Dec 2019", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Hahnemann University Hospital (Phila, PA) in Apr 2015", "Interview Descriptions": "The interview process was a one on one with the HR department and the director of the department I was interviewing for. It was a very relaxed and down to earth interview.", "Interview Questions": "Can you work in a multi cultural atmosphere?"}, {"date": "20 Apr 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hahnemann University Hospital in Jan 2015", "Interview Descriptions": "I applied online. I received a phone call from HR in two weeks. I met the Blood Bank Manger. I was offered a position in one week. I took the position.", "Interview Questions": "Past experience, instrumentation"}, {"date": "22 May 2014", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hahnemann University Hospital", "Interview Descriptions": "After applying for a position on Tenet Health System web site, I was called by HR for an interview. At the interview, I met first with the HR rep, who asked me various predictable questions--what are your greatest strengths and weaknesses, why do you want to work here, can you describe a time in which you had to handle a difficult situation, et cetera. The questions were all very generic, and afterwards, the HR rep described the benefits. After meeting the HR rep, I met with the department manager who asked me questions more related to the job. In particular, I was asked whether or not I could handle saying \"no\" to nurses and physicians when necessary, and whether or not I could handle a potentially very stressful job. I was also asked what is was I enjoyed about the type of work I was applying for, and where I saw my career going in the future.", "Interview Questions": "Nothing really--questions were generally predicable and expected. "}, {"date": "16 Jan 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hahnemann University Hospital in Sept 2013", "Interview Descriptions": "Submitted application online. Called HR recruiter and she pulled up my application and reviewed it on the spot, submitting it hiring managers in several departments.  Got a call back in about a week to set up an interview.  Met first with HR rep for about 15 mins and answered very basic questions like \"why do you want to work for HUH?\"  She gave me info on benefits and then escorted me to the department manager's office where I had a one on one \"conversation\" with her for about an hour.  I changed into scrubs and hung out on the unit for about 2 hours observing and schmoozing with staff.  Got a call back in about a week with a job offer.", "Interview Questions": "None, very straight forward interview "}, {"date": "5 Dec 2016", "title": "Lab Supervisor Central Processing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Jun 2013", "Interview Descriptions": "I was interviewed by the lab managers from each department. The managers sat around a long table and introduced themselves to me. I answered many questions that they asked me which had to do with my experience and my work history. I was made to feel comfortable even though the situation was a little intimidating.", "Interview Questions": "Why I think I would be a good fit."}], [{"date": "13 Sept 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Oct 2012", "Interview Descriptions": "QUICK and to the point. Met with HR rep for paperwork and introduction. Was taken to the floor i applied for where i met with the Nursing director and was interviewed. After the interview I was given a quick tour of the floor and introduced to available nursing staff. Opportunity was then given to ask and answer any questions", "Interview Questions": "describe what characteristics you can offer which will benefit our company"}, {"date": "29 Jun 2016", "title": "Patient Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hahnemann University Hospital (Philadelphia, PA) in Aug 2012", "Interview Descriptions": "You meet with the HR manager , then floor staff, then get a call back to come in for a final interview. This is when I was given the position and had to get a drug test and file out mounds of papers.", "Interview Questions": "Why would you like to work here as a tech?"}, {"date": "4 May 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hahnemann University Hospital in Oct 2011", "Interview Descriptions": "It was a little drawn out (had to go in 3 times) because people I was supposed to interview with suddenly had meetings at the time I was scheduled. But it was nice to be able to meet with so many people before officially accepting the offer.", "Interview Questions": "Why do you think you're best for this job?"}, {"date": "1 Jul 2015", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hahnemann University Hospital (Phila, PA) in May 2011", "Interview Descriptions": "Call from HR after 2 weeks, meet with departmental leadership a week later, was offered the position and started 2 weeks later after all the background checks and pre-employment screening was completed", "Interview Questions": "Describe a time that a new process was implemented in your department, what did you do to help facilitate to the process?"}]]