[[{"date": "12 Jan 2023", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Fleming College", "Interview Descriptions": "Offer of interview was emailed Interviewed by two people who each asked half of the questions which were multi-part questions A presentation or practical test to complete demonstrating Excel or PowerPoint skills", "Interview Questions": "Behavioural questions, primarily - Tell me about a time when..."}, {"date": "21 Nov 2022", "title": "HR Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fleming College (Peterborough, ON) in Oct 2022", "Interview Descriptions": "Had an introduction call (30 minutes) and then a secondary formal interview (1 hour). First was 1:1 and second was a panel interview with 3 interviewers total. Scheduling took a big long but otherwise good.", "Interview Questions": "Please describe the typical types of talent acquisition activities you have been directly involved with in your past roles."}, {"date": "27 Sept 2022", "title": "Career Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fleming College", "Interview Descriptions": "Panel interview with 2 other people. Was required to do a presentation on why I was the best person for the job which was a replacement for the tell us about yourself question.", "Interview Questions": "Why do you think you are the best fit for this job? "}, {"date": "21 Nov 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fleming College", "Interview Descriptions": "Interviewed via webX because of COVID protocols. The interview was with a panel of 3 staff, it took the full hour time allotment. \nI was given a pre-interview assignment (presentation) to work on a week before the interview to be presented the day of. \nThe interview panel posted the questions as they were asked to the webX chat box which I found very helpful. They were also very willing to clarify anything if need be. \nInterview questions were mainly experience based, meaning that they took experiences from your resume and ask you to expand on them. \n\nOverall a good experience, although maybe a little daunting of you're not used to panelled interviews.", "Interview Questions": "Why I was looking to leave my current position."}, {"date": "23 Mar 2021", "title": "Lab Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fleming College (Toronto, ON) in Dec 2020", "Interview Descriptions": "Good. Questions were focused on my core lab skillset and how I would be able to apply them as well as soft skills to the position in applied for. Also asked about interaction with students at the post secondary level", "Interview Questions": "What were my skills and how would I apply it to the job."}, {"date": "9 Jan 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fleming College", "Interview Descriptions": "I applied through email first. The the recruiting director replied me back to arrange a Skype interview. After the confirmation of the employment , we met during her travelling in Beijing.", "Interview Questions": "What was your former experience?"}, {"date": "5 Dec 2017", "title": "Curriculum Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Fleming College (Peterborough, ON)", "Interview Descriptions": "Meeting with manager and program coordinator. Discussed expected job requirements and exchanged thoughts on the main aspects of the position. I offered to expand the role of this position to include assisting faculty with their lesson plans. This would include enhancing the power point experience to provide increased motivation for the students.", "Interview Questions": "Will you be able to do most of the development work from your home and attend a monthly meeting?"}, {"date": "16 Oct 2017", "title": "Professor, School of Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fleming College (Peterborough, ON) in Apr 2016", "Interview Descriptions": "Short listed candidates were invited for an interview where they had to lead a 20-minute session about a specific topic. (Mock-up learning session). Starting with learning objectives and moving to activities.  I thought it was quite good and professional.", "Interview Questions": "What would you do with a student who is not doing so well?"}, {"date": "8 Mar 2016", "title": "Financial Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Fleming College (Peterborough, ON) in Jan 2016", "Interview Descriptions": "The hiring process consisted of a three part computer test and a panel interview. Their were three individuals on the panel. One from the department that was hiring, human resources and an instructor.\r\nEach person took turns asking questions and the interview lasted about 35-40 minutes.", "Interview Questions": "How would you deal with a difficult student?"}, {"date": "19 Jul 2015", "title": "Publisher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fleming College (Peterborough, ON) in Jul 2015", "Interview Descriptions": "I applied on line by submitting my resume. A cover letter was not asked for so I simply wrote a short, to the point email which accompanied my resume submission. Within a few days, I was asked to make myself available for a phone interview. A couple of days later, I had a very friendly phone interview with a Manager. The following day, I received an email asking me to be available for a 2nd phone interview...because of the distance this interviewing process is happening via phone. My 2nd phone interview will happen in the coming week.", "Interview Questions": "1. When have you seen conflict result in a positive change?\r\n2. Tell us how your experience relates to this job."}], [{"date": "31 Jul 2015", "title": "Manual Note Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Fleming College (Peterborough, ON) in Feb 2015", "Interview Descriptions": "I met with my employer on a one on one interview a day after I submitted my resume and example note handout electronically through an email. After meeting with the employer, she looked over my resume and note exemplar. They decided whether I was appropriate for the job at the end of that initial meeting.", "Interview Questions": "How much notes do you write down for each class on average? "}, {"date": "19 Mar 2015", "title": "Academic Chair Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fleming College (Peterborough, ON) in Jan 2015", "Interview Descriptions": "Panel interview with typical behavioural questions preceded by a 10 minute timed presentation made by the candidate. The requirements for the presentation were emailed 3 days in advance of the panel interview. Panel arranged on both sides of boardroom table with candidate on end. Interviewers made notes on pre-printed interview record.", "Interview Questions": "Describe a time when you encountered a conflict and how did you resolve it?"}, {"date": "6 May 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fleming College (Peterborough, ON) in Mar 2014", "Interview Descriptions": "The interview process was very simple and straight forward. The interview was simple and short in time. The interview kind of gave me a chance to expand on my experience working in customer service and problem solving.", "Interview Questions": "what would you do in a situation that involved conflict between two other staff members"}, {"date": "13 Apr 2016", "title": "Student Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fleming College (Peterborough, ON) in Sept 2012", "Interview Descriptions": "Meet with two supervisors, discussed my work history, why I wanted to work in education, and what my expectations where. I was phoned a few days later and offered the position. I knew that I wanted to work there during my interview. It went very well and I felt welcomed.", "Interview Questions": "I cannot remember exactly. Mostly about student services, supports, confidentiality,"}]]