[[{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Unacceptable management policies", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Feb 2023", "job_title": "Administrative Assistant in Moscow, Moskva", "duration": "N/A", "pros": "The convenient location of the office", "cons": "The employee can be sacked very easily. There was no protection guarateed even though I was a full-time employee and had a full-time contract. Somebody does not like you, and that is enough to sack you. My annual bonus was 1 500 Russian roubles, which equals approximately to 20 British pounds, but the CEO decided to strip me of my bonus although they had said multiple times that there had been no complaints regarding my work-performance. Everything was finalised 3 days before Christmas , when I received a letter signed by the CEO , and the letter said that according to the annual performance assessment my annual performance was unsatisfactory and no bonus at all was to be paid. The CEO signed the letter , although he was unaware of anything at all because I had been working in Russia all the time and he had never spoken to me, or written to me , or in any way communicated with me."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The unacceptable and unfair attitude to the employees,  double-standards, poor corporate ethics", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Feb 2017", "job_title": "Office Administrator in Moscow, Moskva", "duration": "N/A", "pros": "the office is conveniently-located,\r\nit is a modern office near the underground station", "cons": "The employees all day run around the city providing private English classes to their private students during working hours and even the top manager does the same giving private classes at the office or wherever she can get a client. So, it is not a company but a club of private teachers. When they get together at the office (which happens very seldom) they boast in front of each other how many classes they have and how much they earn, and the main problem which they discuss is how to increase the rate. Also, the employees get paid a double rate for working  on Saturday or Sunday: even if  they only worked for an hour they may get a pay for 16 hours on Saturday + 16 hours on Sunday. No one ever checks if they ever work.  The top manager fully approves of this \"strategy\"."}]]