[[{"date": "7 Jun 2023", "title": "Associate Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Such a positive experience. The process is long but it is worth it. You will learn a lot about yourself and what God is calling you to. I have to put thirty words on this review", "Interview Questions": "Tell me about a time you failed"}, {"date": "7 Jun 2023", "title": "Support Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Life.Church (Edmond, OK) in Jun 2023", "Interview Descriptions": "It was intense! I understand why they do it that way. Plus I agree with wanting to make sure it's the right fit. But the overall process was very long.", "Interview Questions": "If I were to start and within 90 days, they decide I'm not a good fit what would be the reason?"}, {"date": "25 May 2023", "title": "Marketing Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church in May 2023", "Interview Descriptions": "The process was intense and thorough. They spent a lot of resources trying to find the right people who fit their culture. the technical interview part is fair and reasonable. I felt that it will be a good representation of the job. the behavioral interview is tough because they ask good questions to gauge your level of self awareness in areas that the candidate is weak in", "Interview Questions": "How will your boss know when you are overwhelmed with work?"}, {"date": "12 Apr 2023", "title": "ELP Engineer (Engineering Leadership Program) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Life.Church", "Interview Descriptions": "The interview process was long, challenging, and rewarding. There were several rounds, including a technical evaluation and follow-up interview, multiple rounds of personal interviews, and a final weekend-long interview event. Overall the process took about 3 months.", "Interview Questions": "What does it mean to be devoted to God?"}, {"date": "29 Mar 2023", "title": "Associate LifeKids Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Life.Church (Edmond, OK) in Mar 2023", "Interview Descriptions": "The staff was very good at greeting us and keeping us informed of every step coming up. They made sure to keep the energy up and provided refreshments to keep us charged. They also provided calming spaces to help us decompress between interviews.", "Interview Questions": "Why did you choose LifeKids to do ministry at LifeChurch?"}, {"date": "3 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Mar 2023", "Interview Descriptions": "The interview process occurred over the course of several months. It included tests, phone calls, and an in person interview. The tests were over topics such as grammar, math skills, and spiritual gifts, personality tests, and tests of that nature. The interview event itself was in Edmond, Oklahoma which we flew there for. Overall it was a rigorous but amazing process! I learned so much about myself and the internship hasn’t even begun.", "Interview Questions": "Name a time when you cut corners."}, {"date": "11 Jan 2023", "title": "ELP Engineering Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Life.Church (Edmond, OK) in Jan 2023", "Interview Descriptions": "First of all I’d like to say the dedication to a thorough and robust interview process brings credit to individuals serving on the leadership team, to their ministry, and a core value of excellences show. I open with that because while the process was many steps and over many weeks every aptitude test and interview type was value added. I learned more about the behind the scenes and the employer than I had expected and they learned a lot about me. A significant and important difference with how Life.Church stands out is that my spouse was invited to several stages or phases of the interview process. The appreciation and understanding of how we work together in life to succeed was deeply felt and appreciated. Be prepared to know yourself well and to be provided with many challenges and resources to tackle those challenges throughout the process. From recruiting & talent acquisition to hiring managers and panel interviews the process was engagement but for me the most pleasant and meaningful for me to date in 15 years of professional work history. 20 years if you count jobs that helped me through college. Now with all this testing a lot of coordinating with schedules and staging out different phases was handled excellently and is subject to continuous improvement. So your process may be different than mine but you can expect to work with genuinely curious and professionally dedicated people with a high caliber of skills you could expect to see in any STEM / growth talent industry. Another significant and noteworthy stage was a central campus tour. You can tell people are comfortable working here and the intentionality is easily seen in the layout and setup or design of the office space. Soft glow light versus hard bright fluorescent makes the place feel inviting and welcoming! The campus is equipped better than any Fortune 500 or any campus I’ve toured to date in terms of amenities. New construction and expansion ongoing has well to facilitate growth!", "Interview Questions": "What would you do if two relation departments are competing for placement or rotation of the same engineer? Who’s department should get priority? How would you go about determining that?"}, {"date": "6 Dec 2022", "title": "Associate LGLM Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Life.Church (Edmond, OK) in Dec 2022", "Interview Descriptions": "How do I describe the interview process… amazing, challenging, tenuous, exciting, nerve-wracking, and so many other thoughts come to mind. It is clearly designed to bring all of your qualities to the surface. Kind of like how a tube of toothpaste being squeezed shows its colors, you will show yours in this interview process. And that’s a beautiful thing because it allows you to be able to know what your next step is with Life.Church quickly. The old adage goes that when pressure and heat are applied, you’ll create diamonds from coal, however this simply untrue. The diamonds have actually been there this entire time, and the interview process does a great job at uncovering the diamonds and reviewing the coal.", "Interview Questions": "They asked a lot of questions and are genuinely interested in you as a person. They care a lot about your ministry career and want to make sure you are in the right place to step into full-time ministry. They cared enough to take the time to find a spot that worked better for me than the one I had applied to initially."}, {"date": "31 Dec 2022", "title": "Chief Technology Officer (CTO) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Life.Church (Edmond, OK) in Dec 2022", "Interview Descriptions": "I loved the whole interview process and experience. I wished the rest of Silicon Valley and corporate America were just as thorough and thoughtful in their hiring practice. Well Done!", "Interview Questions": "Tell me about your blind spots."}, {"date": "13 Dec 2022", "title": "Senior Marketing and Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Dec 2022", "Interview Descriptions": "3 video calls, personality testing, work test project, and final in-person interview. Thorough, enjoyable, professional. The hiring team was extremely helpful and spent lots of time helping my fiancee and I decide if the role was a good fit.", "Interview Questions": "What is your biggest obstacle to taking this role?"}], [{"date": "11 Nov 2022", "title": "Worship Filmmaker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Nov 2022", "Interview Descriptions": "It was very professional, since the first approach to the last interview. People involved in the process were very kind and respectful. I felt listened every time, and was given the opportunity to ask questions.", "Interview Questions": "How do you manage stress?"}, {"date": "2 Nov 2022", "title": "Marketing Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "The experience was great from my perspective. Overall communication and exceptions were clear as I progressed in the process. The interviewers were welcoming and I know that they were fully engaged in the interview.", "Interview Questions": "They asked relevant questions related to my work experiences and the expectations of the role."}, {"date": "3 Nov 2022", "title": "Logistics Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Life.Church (Oklahoma City, OK) in Oct 2022", "Interview Descriptions": "The interview process was lengthly, but this also gave both myself and the hiring team a several weeks to decide if this was truly the right fit. The team really cares about who they hire, and they desire to know you and your story.", "Interview Questions": "Lots of questions require vulnerability, such as \"What are some weaknesses that you struggle with?\""}, {"date": "7 Sept 2022", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "The process was very smooth as it had many steps and you were challenged in many ways. Started with one interview, then a video interview, testing, and a final interview", "Interview Questions": "What makes a leader successful?"}, {"date": "14 Sept 2022", "title": "Associate Operations Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Sept 2022", "Interview Descriptions": "Two words.  Intentional and Intense\nBe prepared to dive deep. \nInitial phone call, followed by 3 video interviews, then a 2 day global hiring event.  My journey was long as everyone hired goes to the hiring event, it depends on where you land in the cycle.  The overarching sentiment is that the interviewers truly care about you as a person.  They ask tough questions not to trip you up but as an opportunity to clarify how you fit into LC and how LC fits for you.  ", "Interview Questions": "Every question that is listed here in others interview reviews was asked.  They follow the Sustaining Attributes of LC and how, based on your earlier interviews, you have used or failed to use the attributes.  A lot of questions about how you handled situations and failures."}, {"date": "20 Sept 2022", "title": "YouVersion Social Media Video Content Creator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Life.Church (Edmond, OK) in Sept 2022", "Interview Descriptions": "This was a pretty lengthy interview process, with 5 total interviews, 2 rounds of test projects, and additional pre-employment testing over the course of a month and a half. \n\nThe test projects and pre-employment testing were actually a really great tool to help show my skills and allow the team to ask questions about how I work and what my process looks like. In these projects specifically, some where more detailed and gave a lot of direction, while others were more open-ended to see what I could come up with on my own. \n\nEach interview was about an hour long, except for the final interview which was closer to 2 hours in total. The YouVersion team asks some pretty in-depth questions and really vet their people well. And it's all out of a heart for really getting to know you as a person and making sure it's a good fit for everyone! \n\nLife.Church and YouVersion really value connection as a staff. They really do want to make sure you feel integrated into the team and feel seen and known. And because of that, it really helps to be open and honest about where you're at personally and professionally throughout the interview process. \n\nWhen I was flown out for my final interview, I also had coffee with my supervisor-to-be, and a few other guys on the YouVersion team in the morning before the interview, which really helped me feel at ease and feel like a part of the team before even being offered the job. \n\nThe final interview itself was probably more intimidating than the first 4. It was in a room with 8 different people and was split up into 2 rounds of questions with a short break between them. And again, each person asked some pretty in-depth questions about how I work and how I respond to certain situations. And again, it was all out of a heart to see who I was as a person and make sure we would mesh well as a team. ", "Interview Questions": "Name a time where you totally missed the mark on a project, and how did you react to that feedback? What's something you could have done to prevent that situation?"}, {"date": "4 Aug 2022", "title": "IT Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "They have a very intense process. They do lots of different interviews with different teams and do tours of the facilites and meeting lots of people. I felt respected and seen,", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Aug 2022", "title": "Benefits Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Life.Church (Edmond, OK) in Aug 2022", "Interview Descriptions": "Intern to Staff transition. I needed to complete a final interview to complete the hiring process. It was a panel interview with me and four others. They were very sweet and wanted to connect with me on a deeper level.", "Interview Questions": "Tell me how you will manage your time to reduce stress."}, {"date": "16 Mar 2023", "title": "Quality Assurance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church in Aug 2022", "Interview Descriptions": "I loved the interview process! The whole process included multiple rounds and took some time, but it was an awesome way to discover more about myself and Life.Church! I also loved getting to learn so much about the work and church culture in the process.", "Interview Questions": "Share about a time that you had to have a difficult conversation."}, {"date": "11 Aug 2022", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Aug 2022", "Interview Descriptions": "It has been a very life-giving process, from beginning to end. I have been encouraged, supported, and cared for along the way. I have felt confident that my well-being matters to those hiring me, and that it is important to them to ensure that this role is the best fit.", "Interview Questions": "In this new role, what do you think a hard day will look like?\nIn a role where you will be working on your own a lot, how will you manage your energy as an extrovert?"}], [{"date": "31 Aug 2022", "title": "Digital Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Jul 2022", "Interview Descriptions": "Multi step interviews, online testing. Testing included personality, spiritual gifts, and logic testing. Very friendly team which made the interview process very enjoyable. Interviews included direct team, HR member, and smaller group. Final interview is in person at the Life.Church office.", "Interview Questions": "Experience, spiritual connection, leadership style."}, {"date": "19 Jul 2022", "title": "Freelance Filmmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Jul 2022", "Interview Descriptions": "The process was thorough and organized. I had a total of five interviews, and over the course of those five interviews I spoke with 14 different employees at Life.Church. The questions I was asked touch on job experience, personal faith, leadership, marriage, conflict resolution skills, and lifestyle. I was and am very impressed with Life.Church’s intentionality and commitment toward finding unique people who fit their culture. It may sound like an oxymoron, but it’s true. When I was flown in to Oklahoma City for my final in-person interview, I was blown away by the authenticity of the Life.Church staff. I didn’t feel like I had to perform for acceptance, nor did the employees I was privileged to interact with. The final interview was intimidating to say the least. My wife and I were placed in a large room with an oddly-shaped table across from eight LC employees who worked in several different departments. Each of them took turns asking questions and answering ours. Midway through the interview, we were given a break which helped me calm my nerves and receive feedback from my wife. At the conclusion of the interview, we were provided lunch and we able to hear back from the hiring managers on the final results.\r\n\r\nThe only disappointment I have concerning the interview process is not being able to interact with an employee of my own race. When I brought this up in my final interview, the LC staff members were aware that they had fallen short in this aspect, apologetic, and receptive of my feedback.", "Interview Questions": "In what ways do you anticipate being spiritually attacked during your employment with Life.Church?"}, {"date": "25 May 2022", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in May 2022", "Interview Descriptions": "The overall process from sending the application to  getting hired was close to 2 months. There were about 4 steps in all. There were phone calls and then testing and then a hiring event that started with a tour of the campus/central office followed by the actual interview event that was about 6 hours long. Throughout the entire process each person that I spoke with I could tell cared about me and wanted to see if I was the right fit for the position.", "Interview Questions": "What are 3 qualities that make a great leader? \r\n\r\nHow do you embody them?"}, {"date": "4 May 2022", "title": "Kids Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Apr 2022", "Interview Descriptions": "It was a long interview process but they go so in depth that things can come out you didn’t even consider prior to. But they pastor you through tough moments and tough questions because they not only want what’s best for the church but what’s best for you and I loved that!", "Interview Questions": "Has there been a time when you saw a change that needed to happen in the ministry and what did you do?\r\n"}, {"date": "27 Apr 2022", "title": "System Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Apr 2022", "Interview Descriptions": "I was an internal hire for this position, so my interview process was shorter than the average process. I had a final in-person interview with several leaders in the organization. My wife was there as well and they asked her some questions as well.", "Interview Questions": "If you are going to fail in this role, how would that happen?"}, {"date": "23 Mar 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Very weird process. You must be a member of Life.Church or they will not consider you for employment. Even if you are connected to another church, that is not acceptable for them.  Don’t waste your time unless you are ready to jump ship from your church.", "Interview Questions": "Are you willing to be a dedicated member for Life.Church?"}, {"date": "10 Mar 2022", "title": "Social Media Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church", "Interview Descriptions": "Interviews are very in-depth and at times can feel overwhelming. Just remember: the people are truly very kind and care about who you are as a person and not just your resume.", "Interview Questions": "Q: When was a time you felt like you failed?"}, {"date": "3 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Life.Church (Oklahoma City, OK)", "Interview Descriptions": "Thorough and enjoyable process, but somewhat time consuming. They spend more time on your personal and religious life than your technical qualifications, although all three are important to their recruiters. \r\n\r\nSo worth tho.", "Interview Questions": "Your journey with God and faith."}, {"date": "23 Apr 2022", "title": "Copywriter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Life.Church in Mar 2022", "Interview Descriptions": "The screener and I had one interview on the phone. It was very cordial and friendly. No pressure at all. They wanted someone to work on location, not remotely. I recommend this institution.", "Interview Questions": "Tell me about your family."}], [{"date": "7 May 2022", "title": "Copywriter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church (Telephone, TX) in Mar 2022", "Interview Descriptions": "Telephone interview.  The interviewer was kind and cordial - we had about an hour interview.   I felt like the interview went well.  Afterwords, they indicated that they were selecting another candidate.", "Interview Questions": "Why do you want to work at Life.Church?"}, {"date": "15 Mar 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Mar 2022", "Interview Descriptions": "It was the most intense and intentional interview process that I have ever been a part of. Four interviews, two personality indicators, a survey and several tests. It really shows why Life.Church is a world class workplace. I have learned a great deal about myself and will forever be thankful for this process!", "Interview Questions": "What would be something about the YouVersion app that you would change if you could."}, {"date": "16 Feb 2022", "title": "Fulltime Filmmaker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Life.Church", "Interview Descriptions": "I have been trained in interviewing and based off of that knowledge: the interview process is pretty intense at Life.Church. You'll definitely want to prepare extensively with basic questions, creative questions and very deep/vulnerable questions. They are not afraid to put you on the spot and will not shy away from personal topics. There is no malicious intent but it can be pretty intense to be the one on the hotseat. Before I interviewed, it was made clear to me that many people are known to cry during the interview process, and I found that to be true even for me. \r\n\r\nIf you are married they will allow you to bring your spouse along which I would imagine can be incredibly helpful. \r\n\r\nDuring my time there (I will try my best to remember), the process began with a type of \"speed-date\" style interviewing where you were given 5 minutes or so with 2-3 people before switching to another set of 2-3 people. The questions here are more basic, low-intensity and general and it's meant to be fast. This goes on for 6-8 sets of people before the second phase of the interview begins. The second phase is more intimate as you are in a room with 3 sets of 2-3 people, each set spending about 15-20 minutes with you. The questions in this phase are very personal and intense. After that, you are free to go and the interviewers all enter a conference room to discuss each candidate one-by-one. Thankfully, you are not there for this portion.\r\n\r\nHowever, I had another interview with Life.Church where a portion of the interview was in a conference room with about 5 people and they all took turns asking me a variety of questions. But I cannot say if that was standardized interviewing procedure or if it was specific to the job I was applying for.\r\n\r\nAll that to say your best course of action is to: prepare your answers ahead of time, be ready to be honest/vulnerable and definitely don't forget to pray!", "Interview Questions": "(Forgive me as I cannot remember many)\r\n3 of your best qualities & 3 of your worst qualities.\r\nTell me a joke (\"I can't think of one\" or \"I'm more of a witt person\" are not acceptable answers!)\r\nWhy do you want a job in ministry\r\nWorst feedback you've ever received\r\nWorst failure you've ever experienced and what did you learn\r\nWorst mistake you've ever made"}, {"date": "23 Feb 2022", "title": "Senior Site Reliability Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church (Edmond, OK) in Feb 2022", "Interview Descriptions": "Very thorough which was positive because it shows how important the employer cares about the process and abount finding the right candidate. There were 4 stages in total with the last one being a panel with several people.", "Interview Questions": "Technical knowledge, soft skills and your response to different scenarios."}, {"date": "15 Jan 2022", "title": "Associate LGLM Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Very thorough and friendly and they take the process very seriously and make sure your excited about the position.They want you to follow the calling and passion it's a calling not a job.", "Interview Questions": "How do you fit this role"}, {"date": "15 Apr 2023", "title": "Central Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Jan 2022", "Interview Descriptions": "Casual conversations to get to know you! Fun experience, many different stages of the process. All of my interviews were through video calls. I got to meet different people through every interview.", "Interview Questions": "Why I wanted to apply"}, {"date": "21 Dec 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "It was a lengthy two-day interview with a series of phone interviews beforehand. The staff gave constructive criticism but the interview was intense. They were very hospitable, I think it would be a great place to work.", "Interview Questions": "Name a time you cut corners to achieve a goal"}, {"date": "14 Dec 2021", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Lengthy, in-depth, thorough. There are several levels and rounds of interviews with various employees. Overall, I liked the people who interviewed me. I would rate it as a positive experience.", "Interview Questions": "How do you address conflict?"}, {"date": "14 Dec 2021", "title": "Associate LifeKids Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Dec 2021", "Interview Descriptions": "It was a tough interview for sure. It’s not your average interview where you are asked general questions. The pastors interviewing you really want to get to know you and your heart so they will dig deep. You learn so much about yourself through the process though.", "Interview Questions": "What risk would Life.Church be taking by hiring you?"}, {"date": "20 Jul 2022", "title": "Associate LifeKids Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Oklahoma City, OK) in Dec 2021", "Interview Descriptions": "There are three phone screens before an in person interview that consists of multiple interviews. There is also a testing portion before going to an in person interview. The in person interview is a full day of interviewing with multiple different people who are apart of the company and may not be in the role you are applying for.", "Interview Questions": "What’s the hardest piece of feedback you’ve received and how did you handle receiving that feedback? "}], [{"date": "15 Dec 2021", "title": "Associate LifeKids Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Dec 2021", "Interview Descriptions": "The interview process was intense but in the best way possible. I'll echo what others have said here...I felt incredibly cared for and could see that the process was both in my best interest and to make sure that LifeChurch was the right fit for my family! I don't have any negative feedback about this process!\r\n\r\nA lot of talking/discussion about strengths and weaknesses. Just a lot of talking! It was so important to know why you are passionate about what you are applying for, and this process was really great for me.", "Interview Questions": "Give us an example of how you lead in a non work position?"}, {"date": "15 Dec 2021", "title": "Associate LifeKids Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Dec 2021", "Interview Descriptions": "This interview process was the most sufficient, well structured,  and encouraging interview process I have had the chance to participate in.  It is a two day event with expenses paid. It included campus tours, dinner, and a day of interviewing. The process is dedicated to making sure both sides are suitable for one another and extremely honest in their expectations. They are also sincerely supportive during the process.", "Interview Questions": "Name three qualities that you would use to describe a good leader?"}, {"date": "13 Nov 2021", "title": "YouVersion Video Content Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Convenient phone call and video call process. The recruiter was very easy to talk to and up front about the position. It was a good experience and didn’t have to take personal time off", "Interview Questions": "One question was what attracted me to the position "}, {"date": "29 Sept 2021", "title": "Associate Operations Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Sept 2021", "Interview Descriptions": "2 phone/zoom interviews followed by personality, spiritual gifting, and \"can do attitude\" testing then a 3rd zoom interview.  After that there is a weekend interview with your spouse in Oklahoma City that is very intense but everything I would hope a ministry would do.", "Interview Questions": "Give us an example of  feedback you received that you didn't agree with in the moment but later realized it was for the best. "}, {"date": "29 Sept 2021", "title": "Associate LGLM Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Sept 2021", "Interview Descriptions": "Extremely well communicated. I understood exactly what was happening and when it was to happen. So much detail was put in to this event including planning timeline, snacks and food. Very much a 5 star hiring experience. I learned so much about my self and have some great take aways for leadership growth opportunities to prepare for the next interview with in the organization down the line.", "Interview Questions": "How do I define a healthy marriage?"}, {"date": "1 Oct 2021", "title": "Associate Life Groups Life Missions Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Sept 2021", "Interview Descriptions": "In total there were 4 interviews. The first 2 were to really get to know you as a candidate and to also learn more about Life.Church and the position you are applying for. After the second interview, a series of test were sent to you to complete. Interview #3 was going through the results of those test and how you compared to the current team. Interview #4 is when I flew out to OKlahoma, met others applying for the same position and other roles as well. It is a 2 day event where you get to tour the campuses, attend a service, meet various teams and day 2 was a day full of interviews. Day 2 is when I had an offer!", "Interview Questions": "1. What drew you to this position \r\n2. Describe your faith journey/background?\r\n"}, {"date": "10 Aug 2021", "title": "Associate LifeGroups/LifeMissions Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Aug 2021", "Interview Descriptions": "A very positive experience, allowing for self reflection, feedback, and also leadership development throughout the process. The questions were deep thinking and relevant for life and for being a Pastor.", "Interview Questions": "Tell us what makes you a fit for this position, as opposed to other candidates that you’ve met?"}, {"date": "25 Jun 2021", "title": "Product Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church", "Interview Descriptions": "It was lengthy but SO worth it. It felt like they were seeking to really get to know me and my journey before actually talking about my skills. \r\n\r\nA tough interview process, but the most rewarding I’ve ever been through.", "Interview Questions": "Go ahead and tell me about yourself."}], [{"date": "14 Jun 2021", "title": "Human Development and Training Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Several stages designed to get to know the candidate and their family, as it is a holistic part of your life and your family will be joining their extensive family. This is an out-of-the-box process designed to not only showcase job-related competencies but also maturity, interests, and initiative.", "Interview Questions": "Favorite book and tell me a joke"}, {"date": "8 Jun 2021", "title": "Worship Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 months. I interviewed at Life.Church (Edmond, OK) in Jun 2021", "Interview Descriptions": "Life giving! My wife and I were excited to see how the process would go, but our expectations were blown out of the water. Life.Church is so gracious and graceful through this entire experience and we are so glad we went through this process.", "Interview Questions": "Give an example of a time when you lead someone or a group of people in a non profession setting? "}, {"date": "18 May 2021", "title": "Senior Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church", "Interview Descriptions": "I  never felt so loved and cared for during an interview process before. These guys care about your heart, spirit,  and soul,  and it comes across in how they steward and serve you as a recruit.", "Interview Questions": "How would you improve the Bible App?"}, {"date": "5 Oct 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church in May 2021", "Interview Descriptions": "The process is intense, time consuming, and exhausting, but also rewarding and revealing of both self and the Life Church. Your spouse will also be involved in this multiday process.", "Interview Questions": "Why do you feel called to this position"}, {"date": "27 May 2021", "title": "Construction Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in May 2021", "Interview Descriptions": "Very thorough and overall a great experience. It’s nice to be with an organization that takes the time to make sure they have the right person for the job for both parties.", "Interview Questions": "How I was prepared to deal with the battles that would come from the devil if I was working for the church"}, {"date": "24 May 2021", "title": "HR Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in May 2021", "Interview Descriptions": "Very thorough. Phone screening, in person interview with multiple director level staff, skills & personality tests, a phone call to go over those, final interview (in person couples interview with 8 staff members)", "Interview Questions": "What is your biggest concern about working at Life.Church? How could you be spiritually attacked? "}, {"date": "7 Aug 2021", "title": "Junior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Life.Church (Edmond, OK) in May 2021", "Interview Descriptions": "The Interview process was kind of long, but I think it felt that was especially since there was a 2 month gap between the first  few rounds of interviews and the last 2.  \n\nAs an overview, there were 2 video interviews, a take home coding challenge, a personality/general-skills test, and then a final panel video interview. Both of the tests had debriefs afterwards, which was really nice.", "Interview Questions": "What is one risk the we would incur by hiring you?"}, {"date": "26 Apr 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church", "Interview Descriptions": "I worked very hard on my application which took months to perfect. I want to make it clear I'm not mad at God I am upset on the amount of respect I received during the interview process. I received a phone call by this person a couple minutes late and I felt that this persons tone when speaking to me and demeanor meant that they didn't care for me. I feel that If I was interviewed by someone else I atleast would've gotten a shot at the internship. Overall I felt really sad after that interview.", "Interview Questions": "Tell me about yourself?\nA difficulty you had at a job?\n"}, {"date": "9 Apr 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Apply, initial phone conversation, scheduled interview date, multiple round mini interview with many questions with different people and opportunity to share communication abilities, call next day of job was received", "Interview Questions": "What is one area you know you need to grow in?"}, {"date": "14 Nov 2021", "title": "Construction Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church in Apr 2021", "Interview Descriptions": "Many rounds of interviews. First-round with line manager, the second-round was a group interview. The third round was a big online test and 4th round debriefs and 5th round case practice and last round interview with a spouse.", "Interview Questions": "What's your weakness? And share one mistake /failor you have made in your work?"}], [{"date": "23 Apr 2021", "title": "Church to Church Resources and Support Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Life.Church (Edmond, OK) in Apr 2021", "Interview Descriptions": "The process started with a phone screening, followed by an initial interview. Then a set of online personality and aptitude tests were sent to be taken. Another interview was conducted where we went over the results of the tests. A final interview was held and a call was made to extend the offer post interview. The process was intense but encouraging.", "Interview Questions": "Q: What does your relationship with Christ look like right now?"}, {"date": "15 Mar 2021", "title": "Pastor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Life.Church", "Interview Descriptions": "Grueling interview process. Be prepared for at least 4-5 different interviews (via phone calls or video chats), including a large group interview with multiple people from a variety of areas asking broad rapid fire questions.", "Interview Questions": "Q: What is authority?\nQ: Tell me about a time you had a conflict.\nQ: How healthy is your marriage?"}, {"date": "2 Apr 2021", "title": "Database Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Mar 2021", "Interview Descriptions": "It was a very different experience for me. When you are being interviewed in a regular place, you feel the pressure, and you feel like you are being evaluated and tested the whole time. But at Life Church was different. This a very serious place, and they execute the whole process very seriously (I think I had to go through 7 steps), and of course, I was being tested and evaluated, but I did not feel the pressure. I felt comfortable enough to be clear and transparent. For the first time, I knew they were really concerned if the position would be suitable for them as much as it would be for me.", "Interview Questions": "They really want to know you, so I question that everyone will ask you to tell your story. "}, {"date": "5 Mar 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church in Feb 2021", "Interview Descriptions": "As many of these reviews have stated, it is a very thorough interview process. For me, everything was explained in the initial phone screen. This was followed by a video interview. After that, if you move on, you take several tests. You will then have an interview to go over your results. The final interview is with multiple people and usually broken up into 30 min sections. Due to Covid, I did this online, however, it usually done on campus.", "Interview Questions": "What is something in your current job that motivates you? What is something that drains you?"}, {"date": "24 Feb 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church in Feb 2021", "Interview Descriptions": "1. Applied online on their website\n2. Received an email to schedule a time for a phone interview\n3. Talked with a recruiter on the scheduled time\n4. Received an email for rejection", "Interview Questions": "What are your 2 strengths and weaknesses?"}, {"date": "17 Jan 2021", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Mostly asked questions relating to your religion and beliefs.  Didn't seem to care about my business experience. They even passively changed the topic anytime I mentioned it.  Also kept asking about my fiancee to find out if we were living together or not.", "Interview Questions": "Tell us a joke.\nWhat would the devil do to come between you and your career and personal life?"}, {"date": "4 Feb 2021", "title": "Associate Social Media Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Life.Church (Edmond, OK) in Jan 2021", "Interview Descriptions": "It had a lot of variety, beginning with a phone screening, then followed by an initial video interview and project. After getting through those initial phases, they paid for my wife and I to visit Edmond and have the final interview in person.", "Interview Questions": "What was one recent significant failure you had, and how did you deal with it?"}, {"date": "16 Feb 2021", "title": "Site Reliability Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Life.Church (Oklahoma City, OK) in Jan 2021", "Interview Descriptions": "No real technical questions whatsoever. Only typical interview questions followed by constant persistence on whether you assist their particular brand of church and if you're willing to fully commit to theirs, regardless of whether you're a Christian or not and what that actually means to you and what it has cost you.\r\n\r\nThe people doing the interview didn't know anything about the subject matter, they were placed there (apparently based on availability) only to see if you would be willing to live according to their Church doctrine. No heads up was given about this unusual, awkward and strange approach.\r\n\r\nBesides that, the pay is a little on the low side even for their market plus you have to do Voluntary work and assist their particular Church. But that would be all o.k., and in the right context even great!! Except for one detail: \r\n I've never experienced anything so awkward and strange in my professional life. It was really off-putting. \r\nI understand this is a non-profit and that non-profits do get some exceptions on Chapter VII but I didn't find it that ethical to be asking if a person is going to agree with your organization as if it was an army: 100%, 100% of the time, much less a non-profit,  before asking the very first actual technical question on the subject matter to measure competency.\r\n\r\nGiven the negative reviews posted here I can't say I'm  surprised, they are probably trying to reduce their turn around and for their applicants to end up disappointing themselves by turning a blind eye due to excitement and then finding out they're not pleased with their decision, on either end.\r\nI wouldn't recommend unless you're a previous member of their Church and want to serve them or don't care about your individuality in the face of other human beings telling you how to think.\r\nAt the very least, it was optional. Through their awkward persistence they did give me an opportunity to make a decision and I decided against moving further.", "Interview Questions": "Watch our Live stream and see if you would like to move to basically live inside this Church, even before we know if you can get the actual job done. "}, {"date": "19 Jan 2021", "title": "Senior Software Engineer and Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Life.Church (Edmond, OK) in Jan 2021", "Interview Descriptions": "Multiple interviews over several days, as well as online testing.  Very thorough and professional, but also felt like they were truly wanting to get to know me and my spouse.", "Interview Questions": "What are my top  strengths and weaknesses"}, {"date": "10 Dec 2020", "title": "Infrastructure Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Awesome process, initial interview phone call, honest, open, and personal. Obviously looking for the proper fit, and that’s a good thing.\r\n\r\nMore interviews to come I hope as we move to the next part of the process", "Interview Questions": "What is your favorite joke"}], [{"date": "3 Jan 2022", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Nov 2020", "Interview Descriptions": "For Life.Church, there are 2 main types of interviews, namely those for Central roles (those that help the whole church) and Location/Ministry roles (ones specific to a Campus). My role is at Central and it had 4 steps.\n1. Phone screening: about a 30 min conversation that covered general things, including what my salary expectations were.\n2. Phone call: I was remote when I applied, so I got a phone call instead of an in person visit. Again, this was 30 min and was more specific to my history, calling, and expectations moving forward.\n3. Skills Assessment: A series of like 5 different kinds of tests from personality to problem solving, etc. This also comes with a debrief conversation. The main point is to know yourself and share about who you are.\n4. Final interview: Mine was over Zoom cause of COVID. It was 2 45-min sessions with my spouse. Questions were about my work history, calling, marriage relationship, product questions, etc.\n5. A video call job offer: Later that day I got a video call offering me the the job. They also asked my wife what her resume was because they were interested in her working at Life.Church as well.", "Interview Questions": "Since you have not been a Product Manager before, what relevant experiences do you have?\nHow would you describe your relationship with Jesus?\nSince this role is located at Central, are you willing to relocate?\nWhat has been a struggle in your marriage?\n(To my spouse) How does your spouse respond to stress?"}, {"date": "8 Jan 2021", "title": "Ios Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church in Nov 2020", "Interview Descriptions": "The process was a little long but it was during the holidays, so i believe that this must has affected the timing. Over all it was an amazing experience with lots of prayers.", "Interview Questions": "Questions varied between personal, technical, and spiritual."}, {"date": "15 Oct 2020", "title": "Staff Kids Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Very simple and great communication. Very friendly and made me feel very comfortable. Very clear on expectations and deciding mutually if I would be a good fit.  It was more of a conversation a nd getting to know one another.", "Interview Questions": "What I could bring to the table "}, {"date": "20 Sept 2020", "title": "Host Team LXP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "First is a round robin speed round which had 8-10 groups with 3-4 questions each.  You have a couple minutes at each group. Then two 30 minute interviews with 2-3 people. At the second 30 minute interview they want to know what you learned from the first. You’re also required to do a “huddle”. It’s a very hard and intense day.", "Interview Questions": "What is one way you have cut corners in the past? Why did you cut corners that way? What was the outcome?"}, {"date": "25 Aug 2020", "title": "Marketing and Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Life.Church (Edmond, OK) in Jul 2020", "Interview Descriptions": "I had a phone screen, a series of exams, an assignment, a follow up call to review my assignment and testing and an in-person day of interviews. The entire process provided an incredible journey that really encouraged both my husband and I to understand the impact that we could have both personally and professionally by working in ministry. It was clear that Life.Church cares deeply about an entire family—rather than just the individual they're hiring.", "Interview Questions": "How would working in ministry put a target on your back? "}, {"date": "21 Jul 2020", "title": "Engineering Leadership Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Life.Church (Edmond, OK) in Jul 2020", "Interview Descriptions": "The interview process with Life.Church is probably the most intensive process I have experienced. If you are reading this as someone just about to go through the process, I'd actually recommend refraining from going through reviews until the end of the process. I didn't check glassdoor until my final interview, and that actually helped me as the entire process is very unorthodox. \r\n\r\nMy first interview was phone screen, and it was probably the most fun I've had in an interview. My interviewer asked very interesting question that caught me off guard many times. No youtube video could prepare me for this call, and the same can be said about the entire interview process. \r\n\r\nThere was a period of about one week between each round of interview.  By the final interview, six weeks had passed, and I went through a rollercoaster of emotions. I figured, and was later confirmed, that this was all an intentional part of the interview. I loved it and hated it at the same time. I personally get very excited initiallly and regret the decisions I make later on, so having this process force me to take my time benefited me signficantly. It's as if they saw my weakness and adjusted the process to help both sides.\r\n\r\nAll in all, I had an amazing experience. Even if I wasn't offered the job, I still would've benefited from the process. Every person I interacted with from HR and the interviewers themselves were amazing and very helpful. I'm glad to be a part of the team!", "Interview Questions": "What excites you about the opportunity?"}, {"date": "26 Mar 2020", "title": "Creative Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church", "Interview Descriptions": "Life.Church's process is very detailed, lengthy and fun. They hire top notch people from each field, so they are very intentional in their interview process. The last part of my interview process involved me bringing my husband to a panel interview. I really appreciated and enjoyed that part of the process.", "Interview Questions": "As an extrovert, how would you correspond/communicate with someone who is introverted?"}, {"date": "4 May 2020", "title": "Director of Accounts Payable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Oklahoma City, OK) in Apr 2020", "Interview Descriptions": "I applied online and received an email to set up a phone interview. I then did a few video interviews, both panel and one on one, one including my husband. This would typically be in person but due to the COVID pandemic the whole process was on video for me. There was also a series of tests that helped you learn more about yourself which I really enjoyed. They took the time to discuss your results, and you could tell that the employees interviewing you genuinely cared.", "Interview Questions": "How do you deal with conflict in the workplace?"}, {"date": "11 Jan 2021", "title": "Software Engineer Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Mar 2020", "Interview Descriptions": "The interview process started out with me giving a brief but detailed description of my life story and who I am as a person. It then transitioned into my work/academics activity in which he asked me some questions about solving software problems. He went over some of my test results that I received from the screening process, and then we concluded with him allowing me to ask some questions back to him. The interview was about an hour long.", "Interview Questions": "I can't remember the interview questions exactly, but several of them had to do with solving random software examples/problems"}, {"date": "7 Mar 2020", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Feb 2020", "Interview Descriptions": "Before the process begins, I encourage you to pray and speak with leaders in your faith community. Each step was intentionally designed to search my heart and the calling before me.  It begins with a phone screening to get an initial check of culture and intent. For engineering roles, a technical interview follows that to assess your skillset. The next round is testing. This round is super insightful even if the process doesn't end with an offer. There is an opportunity for growth. After the testing, I discussed my results with a panel. Finally, my wife and I were invited to an interview event that lasted two days. The first day you attend a service and learn about Life.Church. The last day is a series of interviews that create a discernment process for both sides. At the end of the day, both you and your spouse and the interviewing team will know if Life.Church is where you are called to be. Slow down and enjoy the whole process. No matter the outcome, you will be impacted and grow from it.", "Interview Questions": "How are you leading outside of work?"}], [{"date": "11 Jan 2021", "title": "Associate Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Feb 2020", "Interview Descriptions": "I had an amazing time interviewing with Life Church back in February 2020. It is a lengthy process as they want to ensure that you fit with their culture as a Jesus follower. I had a total of coding challenge + 3 phone-interviews before they turned me down. The first 2 are culture-fit. The last one is with their Software Engineer. Despite of the outcome, this is one of the company that I will keep an eye on in the future", "Interview Questions": "Please tell me a joke"}, {"date": "25 Mar 2020", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Jan 2020", "Interview Descriptions": "After submitting an application, I heard back about a month later a request for a short video to be submitted. Then multiple video interviews and phone calls took place before I was flown to Edmond OK. with my wife for an in-person interview. This process was high pressure and a full day of interviews. This was by far the most rigorous interview process I have ever taken part in and yet I have absolutely no complaints! I very much appreciate the intentionality with each interview.", "Interview Questions": "Describe a working relationship in the past where a fellow employee did not like you very much. How did you handle that relationship?"}, {"date": "22 Feb 2020", "title": "Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Life.Church (Oklahoma City, OK) in Jan 2020", "Interview Descriptions": "It was wonderfully intense. Real experienced based questions allowed them to gauge my actual fit. The process was thorough & encouraging when I was told I made it through! There were many strategic questions asked. Basic answers where not accepted; each interviewer dug deep into my responses.", "Interview Questions": "Describe a time when you were overwhelmed in your job responsibilities & what you did about it."}, {"date": "4 Feb 2021", "title": "Associate Operations Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Jan 2020", "Interview Descriptions": "It was a very involved interview process. Initial online application followed by a phone call interview followed by multiple video interviews. Then we were invited to Central location for 2 days of information and multiple face to face interviews.", "Interview Questions": "Share a story about a time you sacrificed for a mission? \r\nTell me about a time you tried something and failed.\r\nTell me about a time you received negative feedback and applied it."}, {"date": "20 Feb 2020", "title": "Associate Host Team Pastor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Oklahoma City, OK) in Dec 2019", "Interview Descriptions": "The process I went through was very intense but amazing. They ask questions that make you think about the next steps in your life, and encourage feedback from both sides. Such an awesome opportunity!", "Interview Questions": "How would you handle an issue during the middle of a service? "}, {"date": "20 Nov 2019", "title": "Operations Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Life.Church (Oklahoma City, OK) in Nov 2019", "Interview Descriptions": "The interview process is no joke, but don't be scared! I was a ball of nerves going into it, but shortly after it started I recognized that everyone there has our best interest at heart and wants to make sure you are the right fit and that they are too. Be prepared for lots of questions and getting out of your comfort zone. Lots of down time. Highly recommend formulating friendships through the weekend, it helps to lean on the other candidates, and let others lean on you too!", "Interview Questions": "What is one thing you will have to sacrifice if you come on staff?"}, {"date": "20 Nov 2019", "title": "Associate Life Groups Life Missions Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Life.Church (Edmond, OK) in Nov 2019", "Interview Descriptions": "The interview process was made up of 3 video interviews, project simulation, testing and finally a 2 day interview event. Day One is a tour and greater understanding of Life.Church culture. Day Two is filled with intense self awareness interviews designed to identify those that best fit the culture, pace and heart necessary to be effective at Life.Church.", "Interview Questions": "Tell us your strengths and weakness and how you identified them?"}, {"date": "31 Oct 2019", "title": "Director of Marketing and Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Life.Church", "Interview Descriptions": "It was very thorough, they made it clear they wanted to create a good fit both for themselves and for me. Everyone with whom I spoke was very friendly, and it was very natural and easy to hold conversations with them.", "Interview Questions": "Share a situation at work that made you uncomfortable, and how did you deal with it?"}, {"date": "7 Nov 2019", "title": "Product Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Oct 2019", "Interview Descriptions": "The interview process with Life.Church was super life-giving.  They were extremely generous, loving, and prayerful while also being professionally rigorous and following standard corporate interview procedures. Ultimately, it was so clear that what they wanted was for each candidate was to understand their call from God and to discern if each candidate was sent by God for the role. Through my interview process, through personally praying and listening to God it became clear to me that I did not feel called to work for Life.Church. Ultimately, though I did not end up accepting a role from Life.Church it was a positive experience that blessed me in many ways.", "Interview Questions": "What do you see as the purpose and goals of Life.Church. How do you feel like you could help Life.Church achieve that vision? Please give a concise statement of why you feel called to Life.Church."}, {"date": "3 Sept 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Life.Church (Oklahoma City, OK) in Oct 2019", "Interview Descriptions": "It was a great process! They really care about each applicants personality types and skillset that would be contributing to their company. Several step process with interviews to several different departments as a way to understand the company culture.", "Interview Questions": "What am I looking for long-term in a company?"}], [{"date": "27 Apr 2020", "title": "Associate Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Oct 2019", "Interview Descriptions": "Whew!  The interview process was an epic tale lol. It consisted of 5 parts. \r\n\r\n1. Online application and initial interview (along with a 3-minute \"why you\" video)\r\n2. Second interview (upon entry to next round you have a project based on the position you applied for.)\r\n3. Third Interview discussing project (passage to next round is aptitude assessment/personality quiz/spiritual gifts test)\r\n4. Interview goes over the results and final questions ( passage into last round is an invitation to Global Interview Event in Edmond, OK)\r\n5. Global Interview Event* - All day interview event (round robin, one on one, and one on two's) \r\n*note: from the time you land in OKC, the inview starts, so be on from the time you reach the airport.", "Interview Questions": "It is recruitment season. Your task is to grow the current life groups from 100 to 140 life groups by the end of the season (4 weeks) what strategy would you put in place to meet the goal?"}, {"date": "25 Nov 2019", "title": "Host Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Life.Church (Oklahoma City, OK) in Sept 2019", "Interview Descriptions": "The interview process was one that really pushed you to your limits and made you grow both in your leadership and your spirituality. The process made you be honest and forced you to not hide things and to show them who you really are.", "Interview Questions": "What is a sacrifice you are not willing to give up?"}, {"date": "6 Mar 2020", "title": "Human Resources Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Aug 2019", "Interview Descriptions": "Tough but so rewarding! The interview process was done with so much grace and respect, I left each step feeling so valued! My husband joined me for my final interview and that was a first for me. It was nice having felt so valued myself but also having my husband feel included on the process. Life.Church is really about the whole person (including family!).", "Interview Questions": "I was asked a quality that I was working to improve upon in myself."}, {"date": "24 Jul 2019", "title": "YouVersion Content Management Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Life.Church (Edmond, OK) in Jul 2019", "Interview Descriptions": "The interview process is unlike any other. It definitely challenges you, but you will learn a lot about yourself during the process. Depending on the role you've decided to apply for, your interview process may differ.", "Interview Questions": "Tell us about a time you received feedback, and how you applied that feedback. "}, {"date": "28 Jun 2019", "title": "Pastor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church", "Interview Descriptions": "So far it has been very pleasant. They seem to be mindful and aware of the stress that each applicant goes through. They also seem to be very sensitive of our time.", "Interview Questions": " What do we most need to know about you? "}, {"date": "11 Jun 2019", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Life.Church in Jun 2019", "Interview Descriptions": "Submitted online resume, got an email asking to schedule a phone interview to get to know more about me, had the phone interview and was told I would hear back in several days, and finally I heard back in an email after several days that they would not be moving forward with me for the current position.", "Interview Questions": "Mostly behavioral question."}, {"date": "22 Jan 2023", "title": "Campus Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Jun 2019", "Interview Descriptions": "The interview process is challenging but exciting. I learned a lot about the organizational values and I learned a lot about myself in the process as well. The rather lengthy process helps to ensure that those who get through will be a good fit culturally.", "Interview Questions": "Talk about a time you led a team towards a desired outcome."}, {"date": "5 Jul 2019", "title": "Android Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Jun 2019", "Interview Descriptions": "I personally did not believe the phone interview went well but was surprised when I received another e-mail the following day asking me to schedule a video interview. The second interview involved one very simple technical question and, overall, I thought it went well but I did find it a bit odd that the interviewers used that one question to gauge my technical knowledge.\r\n\r\nTwo weeks after my video interview, I received another e-mail inviting my wife and me to fly out for an in-person interview.  This \"interview event,\" as they called it, included a full weekend experience and we were told up-front that there would be other candidates there as well. Turns out, the other candidates were all there to interview for different roles.\r\n\r\nWhen we arrived to pick up our rental car (all paid for by the church) we found it a bit odd that the person at the rental agency asked us if we were interviewing with Life.Church and, when we said yes, she advised us to \"be careful how we interact with people because they're watching you.\" We thought, surely that can't be the case. Who would do that? That was the first red flag that we ignored.\r\n\r\nOur first night there, we attended services at the OKC campus. A couple more red flags, that we initially ignored, began to surface. They don't call their worship centers anything of the sort. They are referred to as \"studios\" and we were left with the strong impression that this was more of a production company than a church...again, we ignored this at first because they put up a good front.\r\n\r\nSunday morning, we toured a number of their local facilities and attended multiple worship services in the process. Another red flag appeared when, in the middle of worship, videos of the senior pastor, Craig Groeschel, began to play. It felt very much like the congregation was worshipping Craig and not God.\r\n\r\nDuring the tours of the \"central offices,\" we also noticed that there were a number of quotes and phrases written all over the walls. As a church, you would expect these to be scripture. They were not. They were all things that Craig himself has said, not one word from God on their walls. Again, in our excitement, we initially ignored what is a huge red flag for a church.\r\n\r\nDay three is when the actual interview took place. This began with all of the candidates and their spouses in a single room, moving from one table to the next in a \"round robin\" style interview. Each candidate had 6 minutes to answer 6 questions at each table. I did find this concept somewhat interesting.\r\n\r\nAfter the \"round robins\" we were all taken into a conference room and then separated for the \"second round\" into different rooms. In our \"second round\" the first thing that was said to us was that they didn't feel I was being genuine in my answers and that they felt I had rehearsed my answers. Which as interesting since I had no way of knowing what they were going to ask me, so how could I rehearse for this? My wife and I both, rather desperately, tried to explain to them that this is simply my personality and that I was being 100% genuine in my responses.\r\n\r\nThe \"third round\" wasn't an interview at all. They asked us what we thought of their church. We were on the spot, so we gave them a glowing review (which we now regret.) Once they got what they were looking for there, they rather abruptly told me that they were not going to be moving forward because I don't have the amount of experience they were looking for.\r\n\r\nRead that again: My resume explicitly states that I am a fresh graduate with no industry experience. This fact was discussed in great detail in both of my previous interviews. Why would they fly us all the way out for a \"final interview\" if my lack of experience was an issue for them? There was no way they weren't already aware of this.\r\n\r\nI was in complete shock and had no idea how to respond. My wife began to cry because of the realization that they had wasted two months of our time and took us away from our children for the weekend for absolutely no reason hit her very abruptly. The moment she started to cry, they kicked us out of the building. This was at noon. Our flight home as at 6 pm.\r\n\r\nSo we suddenly found ourselves in a city hundreds of miles from home, with nowhere to go for six hours while we waited for our return flight. While we were at the airport, they called us. Not to check on us or make sure we were okay or even to apologize; but to inform us that the reimbursement check for our flights was ready and we needed to pick it up at the front desk...at the building, we just got kicked out of.\r\n\r\nAs we were sitting in the airport waiting for our flight, the other candidates began to arrive over time. They all had almost identical experiences.", "Interview Questions": "Why are you here? (Multiple times, with increasing aggressiveness)"}, {"date": "9 Apr 2019", "title": "Associate Host Team Pator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Apr 2019", "Interview Descriptions": "There was an initial phone call interview that was about 15 minuets. After that, testing was done and a follow up 45 minute video interview with 3 staff members. After that we (my spouse and I) did a 2 day interview event that was pretty much all day. I wish every company interviewed this way. It really shows the amount of care they put into who will be in charge of driving the passion that Life.Church has at each campus!", "Interview Questions": "Are you willing to live outside Oklahoma? "}, {"date": "9 Aug 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Life.Church (Edmond, OK) in Apr 2019", "Interview Descriptions": "There was a phone call, some testing, another phone call, then an interview event! The interview event had several other interns there and comprised of speed dating-style interviews and multiple rounds of one-on-one interviews with different people on different teams. The testing was things like your personality type, your attention to detail, etc.", "Interview Questions": "What is a strength of yours? How is it a strength?  Why Life.Church? Why the internship?"}], [{"date": "19 Feb 2019", "title": "Operations Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Life.Church (Oklahoma City, OK) in Feb 2019", "Interview Descriptions": "The screening process is thorough with a phone screen, testing, Skype interview, and video submission. Then candidates are invited to an interview weekend. This event is pretty intense, but if you can be yourself and be honest it is doable.", "Interview Questions": "What is critical feedback you’ve received that you didn’t agree with? "}, {"date": "15 Mar 2022", "title": "Digerati Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Feb 2019", "Interview Descriptions": "Phone-screen, video interview, pre-employment testing, large interview weekend with Monday interview day.\r\n\r\nThe first couple of things are standard-fare so I'll focus on the rest. It's worth noting this whole process can take weeks.\r\n\r\nFirst, the testing is IQ/spatial awareness/intelligence stuff followed by psuedo-science Myers Briggs testing. The effectiveness of these is highly debated and most scientific studies about them have revealed bias, so it's surprising a church would continue to use them. \"It's the only thing that's consistent\" they say, but so was not hiring POC back in the day, so I feel like times can change and there's just refusal to do so.\r\n\"We only use them for information, not qualification\" they said before I took it, but the hiring folks beat me over the head with the results of it, so I feel a bit like they were kidding themselves on this. I outscored their \"average\" employee score in every area but one, they picked that one out to ask why I wasn't good at it. That worried me as foreshadowing culture here (focus on the negative instead of your strengths). Just because they've used bad tools for so long is what they're continuing to do so. Tradition! From a claimed non-traditional workplace. For a perspective employee, these are large red flags.\r\n\r\nSecond, the interview weekend is on their expense, but it is a significant time investment, so just be forewarned. You'll attend and do tours on the weekend, and then on Monday you'll do several rounds of interviews with other folks. Your spouse (if you have one) is expected to attend, too. It's a significant ask and investment in the process itself for no guarantee on the other side.", "Interview Questions": "Tell me your best joke"}, {"date": "6 Mar 2019", "title": "Associate Host Team Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Feb 2019", "Interview Descriptions": "The interview process was pretty rigorous.  After I submitted an application, I was contacted within 14 days to schedule a video interview. Because I originally applied for two positions, I interviewed with two people simultaneously. Several days later, I received an email letting me know that I was moving into the next round and requested that I fill out several forms, documents, and take some tests to identify spiritual gifts, personality, and skills.\r\n\r\nThis testing was followed by an additional video interview and, finally, and interview to travel to Edmond, OK for a \"Global Interview Event.\" The event was two days long. The first day consisted of tours, visits, and more information question asking. The second day was a long, emotional one consisting of round-robin style interview and small group interviews. At one point, they brought us into a large room with all of the interviewer, handed us a microphone, and said, \"You have one minute to tell us everything that we need to know about you.\"\r\n\r\nIt was a taxing process but I think that it really spoke to the care that they take in ensuring that all staff members are a good fit, not just for the position but also for the organization and staff culture.", "Interview Questions": "We know that working in ministry paints a target on our backs. How would Satan take you out?"}, {"date": "19 Jun 2019", "title": "Social Media Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Feb 2019", "Interview Descriptions": "There were several rounds beginning with a phone interview followed by a series of testing, another phone interview and then a  weekend on site. Overall, the process was very intense, but it ensured that the role was a good fit both for me and for them.", "Interview Questions": "What does your spiritual growth look like?"}, {"date": "3 Jun 2021", "title": "Operations Pastor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Life.Church (Minneapolis, MN) in Jan 2019", "Interview Descriptions": "In the first round of interview, I was asked baseline ministry leadership questions. Near the end, I was informed that the position I was applying for would not be the role I would be initially hired for. (I was only told this near the end of the interview and not in the posting itself nor in the initial email)\n\nThe recruiter made it sound as if this is “how we hire this role”. \n\nVery unprofessional to post a job, offer an interview for said role, only to be told that this is actually a entry-level train-in position which would result in the eventual role after 6months - 2 years of “training.”\n\nLife Church, be upfront with your postings, emails, and interviews. If the position is a “trainee” position then say that up front. Bad form.", "Interview Questions": "What interests you in Life Church / this role?"}, {"date": "20 Dec 2018", "title": "LeadershipXP - Central Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Dec 2018", "Interview Descriptions": "I applied online and went through a preliminary phone interview where they asked some simple questions about how I felt I related to some of their values, my strengths/weaknesses, and why I applied for LXP. From there I received some testing (personality test, can-do-attitude test, spiritual gifts test, some math/reading/comprehension). I was then contacted several weeks later to participate in the final round of interviews, which were a \"speed dating\" type of interviews. They had 8 of us at a table, 8 stations around the room. We had 6 minutes to each interview with 1 group of interviewers, and then would all rotate around to the next group (each of us individually were with a different group of interviewers). They asked lots of intentional questions that actually made me learn more about myself. After the interviews, we were each placed in separate rooms so the interviewers could come in and review some of our answers and give us feedback or insight. After they had asked some follow-up questions, they ended up saying some really good things that were encouraging and helped me to see some things about myself that I hadn't before. The interview process was incredible and I would say that even if you don't get hired, there is tremendous value in the process, so don't count it as a failure.", "Interview Questions": "Which one of our values do you think you would need the most improvement in?"}, {"date": "24 Sept 2019", "title": "HR Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church in Dec 2018", "Interview Descriptions": "HARD! SO worth it though. The process took four months and involved a phone interview, testing, in person group panel interview, spouse interview, presentation, and multiple projects before receiving an offer. If you are meant to be here you will get an offer. Don't pretend to be anything you are not, they will see right there. Be honest in your answers and true to yourself. This job is not temporary. You can make a career here and their goals are long term. Once hired you are family.", "Interview Questions": "When is the last time you received feedback?"}, {"date": "15 Nov 2018", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Life.Church", "Interview Descriptions": "They asked me to select an phone interview time online. But nobody called me at that time, and even not any explanations after I asked by email. I think they are so unprofessional!", "Interview Questions": "N/A"}, {"date": "30 Oct 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Oct 2018", "Interview Descriptions": "Tons of communication! I had 4 pre-screens and pre-interview testing. It was challenging, but it correlates with the importance of the work we do at LC. Interview process was a bear, a full day of very personal and intense questions. They want to make sure you know what you are betting into and they want to make sure you are the right fit. They gave a ton of feedback for positive things and things to work on.", "Interview Questions": "Biggest failure in your life, how did you respond"}, {"date": "19 Sept 2018", "title": "HR Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Life.Church (Edmond, OK)", "Interview Descriptions": "We really had an incredible experience and felt like the interviews themselves were development and growth opportunities. While those experiences were the most challenging  interviews I have had in my career, they were by far the most welcoming, curious and authentic.", "Interview Questions": "If there is one thing that Satan will do to destroy you, what will that be?"}], [{"date": "18 Sept 2018", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK)", "Interview Descriptions": "The interview processes is not only to assess your skills for the job, but your fit within the organization.  Are you involved in the church and community, actively serving, participating in a life group, etc.", "Interview Questions": "How has God gifted you for this role?  What challenges do you anticipate and how will you overcome those?  What expectations do you have coming in to the organization?  Are you comfortable working in a high feedback culture?"}, {"date": "19 Sept 2018", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Life.Church", "Interview Descriptions": "Preliminary Process included multiple phone screens, one informal interview and candidate testing on everything from intellect to personality type. Which lead to an interview event where a group of candidates and myself where interviewed by multiple interviewers.", "Interview Questions": "If anyone could play you in a movie who would it be?"}, {"date": "3 Oct 2018", "title": "Digerati Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in Aug 2018", "Interview Descriptions": "VERY long process.  I could see it being much longer for a pastor level (stage time, etc). From first apply to interview weekend was a good 3-4 weeks.\n\nFor me: initial phone screen, then 3 hours worth of competency testing, then video call to review your results, then an interview weekend. The Interview weekend is with all of the candidates and their spouses. \nOn Saturday, you attend the broadcast campus to see Pastor Craig live, and then go out to dinner.\nSunday begins early and you visit about 3 different OKC Metro churches.\nAt any point, they might ask you to be done, however this didn’t happen for any of us on Sat/Sun.\n\nOn Monday, you go through the gauntlet of interviews of several group-style interviews, and they send all the candidates back into a conference room to wait while they talk about you, and then you do another one: rinse and repeat. The group interviews are full of people from both your team (usually leader-level) as well as other teams.\nLife.Church is high feedback, and this entire process is designed to see how you react to that and let them know about you as a person. You cannot fake your way through it. Don’t even try: if you aren’t on board with the Life.Church vision and mission, they’ll find out and you won’t make it.\n\nThe entire weekend (even touring the campuses) is an interview. They’re watching your personality, how you interact with people, etc.\n\nYou’ll hear it said, and it sounds cliche, but just be yourself. You can’t fake it, and if they don’t like you for you: you won’t make it anyway. They definitely are not looking for SKILL as much as they are your fit as a person. The intentionality they put into making sure your personality fits the hole on the team is second to none and why Life.Church functions as well as it does. Trust the process.\n\nTowards the end of the day, after a few rounds: one of the couples didn’t show back up into the conference room “holding” cell. They don’t tell you what’s going on, it’s slightly stressful (are they offering those people? Did they quit? Were they sent home?). When it was just two candidates left, they separated us again. After about 15 minutes of sitting in the conference room alone, the team leaders came in and offered the position to us. I had no idea what to think: they don’t tell you anything. Are they offering the other person a position in the other room during 15 minutes? Etc, etc, etc. It stinks to go through, I won’t sugar-coat it, but it certainly exists for a purpose and I can imagine dismissing the other candidates in such a way (separately from the others) is a graceful way to handle it.\n\nAgain, Life.Church is high-feedback, so if you can’t handle feedback well, I wouldn’t even bother applying.", "Interview Questions": "How would Satan take you out? Tell a joke (if you can’t take humor- you won’t survive working at LC). Tell me about your biggest challenges. Tell me how you handle stress. \nThey also very quickly latch onto things you say and ask un-scripted follow-up questions: there’s really no way to prepare. Traditional “canned” responses don’t work, here, and if you give them: they will find a way around your canned response."}, {"date": "12 Sept 2018", "title": "LifeKIDS Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Life.Church (Edmond, OK) in Aug 2018", "Interview Descriptions": "The interview process is extensive and intense, as it should be. But just as much as it's extensive and intense, it's fun, engaging, and energizing too! We built relationships with people that will last a lifetime. On the first day, all candidates attended a service together, Life.Church provided dinner for all candidates and we took a tour of Central. The second day we visited another campus and had the opportunity to meet with the campus pastors to ask questions and listen to words of wisdom from them, the third day was a full day of interviews with lunch provided.", "Interview Questions": "What was your work ethic like as a teenager?"}, {"date": "12 Mar 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Aug 2018", "Interview Descriptions": "The most difficult interview process of all time. Be prepared to cry. They get really deep into your personal life as well, so be prepared for that. If you are married or engaged, your spouse is expected to attend the interview as well. The spouse will get asked questions about themselves too.", "Interview Questions": "When was the last time you lied?"}, {"date": "19 Sept 2018", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Life.Church (Edmond, OK) in Jul 2018", "Interview Descriptions": "I applied online and was initially turned down - I had to emphasize some of my previous experience to get the interview. Then there was a phone screening, aptitude testing, two panel style interviews with 4-5 interviewers (one with spouse present).", "Interview Questions": "How do you problem solve? (What is your process)"}, {"date": "21 Sept 2018", "title": "Accounts Payable Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Jul 2018", "Interview Descriptions": "The LC interview process is a long one, but more thorough than any I have experienced.  This communicated to me that they are not only very careful with who they choose as staff but their intentionality with the process.", "Interview Questions": "Describe a time when you failed at a task & how did you overcome it?"}, {"date": "24 Mar 2020", "title": "Associate Host Team Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Jun 2018", "Interview Descriptions": "In a word, intentional. Not only were they looking at performance, but also character. I appreciate how intentional the team is to ensure a fit job wise and interpersonally.", "Interview Questions": "What are you most passionate about?"}, {"date": "19 Sept 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Life.Church (Edmond, OK) in May 2018", "Interview Descriptions": "I had a brief initial phone interview. After that I was requested to have an in-person panel interview. After being selected for a final panel interview, I was also asked to complete extensive testing prior to that interview. This whole process took about 3 weeks.", "Interview Questions": "If you were to not be selected for this job, why would you think you didn't get it?"}, {"date": "11 Jun 2018", "title": "Employee Relations Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in May 2018", "Interview Descriptions": "One of the most challenging experiences and by far the hardest interview I've ever had!  This organization is committed to finding the right fit for the culture.  The questions asked are intended to gauge reactions and get a feel for who you are deep down.  They also  do a bunch of online testing prior to the major interview event (personality assessment, spiritual gifts assessment, logic/reasoning tests, etc.).  I left feeling a great deal of insight into myself and have grown so much as a person during my short two weeks here!", "Interview Questions": "Tell us about a time when you failed at work."}], [{"date": "23 Jul 2019", "title": "Worship Pastor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (NONE) in May 2018", "Interview Descriptions": "Applied online.  Took two months to get any notification back.  Very impersonal.  Found it interesting that they didn't even do a follow up based on my creditials.", "Interview Questions": "N/A"}, {"date": "11 Jun 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Oklahoma City, OK) in May 2018", "Interview Descriptions": "The interview process was in 4 parts. \r\nPhone Interview\r\nTesting - personality, critical thinking, and common sense etc... \r\nVideo interview\r\nInterview event - this was split out over 3 days. \r\n     Saturday evening - tour, attend a service, & dinner\r\n     Sunday morning - tour, attend portion of services, office tour\r\n     Monday - 8 station micro-interviews, break and self-evaluation, introduce yourself to the \r\n     group, one-on-two interview, break, one-on-two interview.", "Interview Questions": "What is something you might lose or have to give up to work here?"}, {"date": "22 Oct 2018", "title": "CENTRAL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Life.Church (Oklahoma City, OK) in May 2018", "Interview Descriptions": "I applied online and had an initial phone interview about 6 weeks later. I did testing about two days later. I was invited to the Central Offices to interview with a group of about 6 leaders from the organization. I had a second interview with several other leaders which my husband attended.", "Interview Questions": "Tell me a joke. "}, {"date": "27 Apr 2018", "title": "Operations Pastor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church", "Interview Descriptions": "First interview was great. Then invited to do a battery of tests that took about 90mins. Second interview was a panel video conference. Was difficult to know how you were coming across because you were speaking to 6 people simultaneously. I got really nervous, didn't expect panel, & did not do amazing. Even though they said all my aptitude scores were above their averages, I did not get an offer.", "Interview Questions": "What risk would we be taking in hiring you?"}, {"date": "18 Sept 2018", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "The interview process was very challenging, but fun at the same time. I learned a lot about the organization and about myself. There was a lot of attention to detail, and the interviewers really wanted to get to know the candidates. The process began with a phone interview, then several online tests/assessments, two interviews via web conference, and ended with an interview weekend that my wife and I were flown in for.", "Interview Questions": "What area of your life would Satan use to take you out?"}, {"date": "9 Apr 2018", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Life.Church (Edmond, OK)", "Interview Descriptions": "One of the most challenging, yet rewarding interview I have ever done. You leave the interview thinking I just grew so much as a leader in the past 3 hours. Be ready for hard questions. If you are honest, open and be willing to grow you will be okay!", "Interview Questions": "Name a time you failed"}, {"date": "31 Jul 2018", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "Applied online. Received a message from the central team a month later to set up an interview the next day. Then took a series of tests that took up to 90 minutes straight through. After that another youth pastor called me to discuss test results and some of my answers.  A week later I was invited out to the Edmond campus for the interview event. The interview event was incredibly intense. The first night we got to watch the service at the OKC campus followed by dinner with the department heads. The second day we got to go to the Midwest city campus and tour it and the central offices. Thankfully we got a break for majority of the afternoon because the third day was crazy. We came in on the third day and right away we had a series of 6 minute interviews where we were grilled with questions about the different values of the church.  When those were done we had lunch. That was followed by us taking turns getting up in front of a room full of people to talk about ourselves for 1 minute, no more and no less. When that was done we were taken into different offices to have a couple longer more in depth interviews. Throughout the process whenever the group of interviewees would come back together you would tend to notice that people were either dropping out themselves or were being asked to go home. The people who were left at the end of the day all received an intent to offer on the spot", "Interview Questions": "When was the last time your integrity was called into question? "}, {"date": "11 Jun 2018", "title": "Host Team Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "The interview process is intense but very well done. First phone call was 25 minutes, then you go through all the screenings (personality test, spiritual gifts test, competency testing, application, and essay questions), video interview, then a 3-day hiring event. ENGAGE in the entire process! Everything is a part of the interview.", "Interview Questions": "We define sacrifice as giving up something you love for something you love even more. What is something you've had to sacrifice recently?"}, {"date": "17 Apr 2018", "title": "LifeGroups/LifeMissions Pastor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Apr 2018", "Interview Descriptions": "I applied online and within a month took part in a video FaceTime interview, took part in extensive testing, a phone call interview to discuss testing results, and then was invited to the Global Interview weekend in Oklahoma City.  The overall experience was positive as LifeChurch clearly communicates their culture and how they operate.  The Monday interview process was intense and exhausting.  I appreciated their honesty, feedback (positive and negative), and how warm and inviting everyone was.  An overall very pleasant experience that I don't regret in the slightest.  That being said one applicant questioned whether this was a church masquerading as a business or a business masquerading as a church.  If you are seeking the more \"traditional\" pastoral role with regards to teaching/preaching/counseling/etc this may not be the best fit for you.  That is the conclusion my wife and I reached by the end of the weekend.  That being said Life Church is a fantastic organization and do everything with excellence in mind.  I am very appreciative of the opportunity to get to know them better through this process.", "Interview Questions": "What is one example of challenging feedback you have received and how did you receive and apply it?"}, {"date": "30 May 2018", "title": "LeadershipXP Full-Time Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "Hardest but greatest interview process I have ever been through. They really consider you prayerfully at Life.Church and take the whole process very seriously. Once you apply, they ask you to take some additional testing to get to know your personality, spiritual gifts, and overall aptitude better. They use all this information in the first phone interview where you interview with a recruiter and someone from the department. I was lucky enough to be flown down to Edmond for the second round interview event. They try to keep the interview event private, but candidates are prayerfully considered and everything they do is intentional. They make you feel at home with a warm and welcoming staff member keeping you calm throughout the day. It really is a great experience and seems like an amazing place to work. Ended up declining the offer due to health issues and being unable to move away from my doctors at the time.", "Interview Questions": "Would you hire yourself for this position at Life.Church?"}], [{"date": "14 Jun 2018", "title": "Youth LeadershipXP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "It was extremely challenging. You will walk away physically, emotionally, and mentally drained. It is a great learning experience and you receive a ton of feedback in real time. The process starts out with an internship application; continues to the first phone interview; then involves a job application, background check, personality test, spiritual gifts test, and a series of aptitude tests; followed by the second phone interview, then an on-site two day interview event. The on-site interview event involved a weekend service, an evening dinner, round robin interviewing, public speaking, role playing, and purity/spiritual integrity interviews.", "Interview Questions": "Tell me about a time where you experienced your greatest failure? How did you respond to your failure?"}, {"date": "10 Oct 2019", "title": "Central Ful-time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "I did a phone interview for about 30 minutes. I took a lot of tests, ranging from personality to ability to ministry tests. I had a skype interview where they went over my test results, and they really dug into my results. After that, I was invited to the Central Offices in Edmond to participate in a group interview (the final step). They had us do speed dating interviews, and then broke us up into rooms for two longer interviews to dig deeper into our responses. I received my internship offer and placement 3 days later. A few reviews say \"get ready to cry\", but as long as you are confident in yourself and who you are, you will do great. No tears were shed during my group interview.", "Interview Questions": "Tell us about a time where you received feedback you did not agree with at first, but now agree?"}, {"date": "17 Apr 2018", "title": "Associate Youth Minister Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "Process is intense, to say the least. Starting off with round robin interviews, which is a series of short, back to back interviews; similar to speed dating. The staff is great about breaking up the day, before heading to more personal, one on one interviews. It’s a log, exhausting day.", "Interview Questions": "How does Satan attack your marriage? "}, {"date": "30 Jul 2018", "title": "Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Life.Church (Edmond, OK) in Apr 2018", "Interview Descriptions": "It was a 2-3 month process.  I applied, had a phone interview, skype interview, online testing that took a few hours followed by a weekend interview with a large group.", "Interview Questions": "What is the hardest sacrifice you have ever had to make?\r\nTell me about a time you tried something and failed.\r\nWhat was your work ethic like as a teenager and how is it different?"}, {"date": "23 Mar 2018", "title": "LifeKIDS Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Mar 2018", "Interview Descriptions": "Interview is intense spiritually, mentally and physically. I submitted my application online and had two phone interviews the following week and was asked to take different tests so they could get to know me better. A couple days after I submitted the test I was called and the test and the results were explained to me at the end of the phone call I was invited to the interview event. The interview event was on a Sunday and Monday and my spouse had to come with me. The interview was in depth and extensive.", "Interview Questions": "Why Life.Church?"}, {"date": "18 Sept 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Mar 2018", "Interview Descriptions": "This interview process was extremely challenging, many rounds, lots of hard questions, lengthy process but very rewarding. This was a very eye opening experience and a great time for development.", "Interview Questions": "How would others describe you?"}, {"date": "9 Apr 2018", "title": "Associate LifeGroups LifeMissions Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Life.Church (Edmond, OK) in Feb 2018", "Interview Descriptions": "Tough interview, but worth the time for the self awareness. Started with phone interviews & video calls. Online testing. Finally with a weekend interview on site. This is the best interview process I’ve ever been a part of.", "Interview Questions": "How are you developing yourself as a leader?"}, {"date": "9 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Life.Church (Edmond, OK) in Feb 2018", "Interview Descriptions": "Absolutely amazing and completely uplifting from start to finish.  Loved it all. Very in-depth and structured extremely well. They were all about connecting and setting you up for success whether you got an offer or not.", "Interview Questions": "So many"}, {"date": "9 Apr 2018", "title": "Associate Operations Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Feb 2018", "Interview Descriptions": "It was a high level, multi step interview process that included phone calls, video interviews, and a 2 day in-person interview event. Throughout the entire process, you learn so much about yourself.", "Interview Questions": "Why did I feel called to this position. "}, {"date": "9 Apr 2018", "title": "Life Groups Life Missions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 days. I interviewed at Life.Church (Edmond, OK) in Feb 2018", "Interview Descriptions": "Tough gauntlet process but growth will follow if are chosen and even if you’re not. Interviewed twice and would have interviewed  a third time if it came down to it.", "Interview Questions": "What does excellence look like to you?"}], [{"date": "9 Apr 2018", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Life.Church (Edmond, OK) in Feb 2018", "Interview Descriptions": "The process itself was difficult but at the same time very empowering to you as a leader. The interview  process will help you know if Life.Church is a fit for you and who you are as a leader.", "Interview Questions": "Tell me a joke?"}, {"date": "9 Apr 2018", "title": "Digerati LXP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Life.Church in Jan 2018", "Interview Descriptions": "Incredibly molding. I found out more of the kind of person God wants me to be through the process. Extremely difficult, I cried the entire interview. I truly do not doubt that I was meant to be at Life.Church.", "Interview Questions": "What does sacrifice mean to you?"}, {"date": "10 Dec 2017", "title": "Project Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Life.Church (Oilton, OK)", "Interview Descriptions": "I applied online to this role and they scheduled a phone interview. I was excited to talk to them and use my 20+ years of technical skills for good.  The lady was nice, said I had great skills. But her only interest was in my faith, how religious I was. She asked me to tell her about when I accepted Christ into my life. While I'm deeply spiritual I am also very private. I am not an evangelist type. There were no questions related to the job or my technical skills. She is the front end \"gate keeper\" to see how religious I was. I was deeply disappointed in the process and finding out that they are very exclusive in this manner.", "Interview Questions": "Tell me about then you accepted Christ into your life."}, {"date": "12 Apr 2018", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Dec 2017", "Interview Descriptions": "By FAR the most intense thing I’ve ever been through. I applied and about a month later I had a general 15 minute phone interview where they asked questions like “What is your favorite movie?” and “Who would star in a movie about you?”. Then I had 48 hours to fill out and do several questionnaires, background checks, personality tests, etc. Then I had another phone interview where they asked more in depth questions about my skills, expectations, passions, ministry strategies, etc. Then I was flown to Oklahoma for a weekend interview event. We were able to attend a service, go to different campuses, meet leaders, and then the actual interviews began Monday. I’m not going to tell you all they do and ask because I don’t want to ruin the fun ;) but basically I slept 20 of the 24 hours the next day. It was crazy!", "Interview Questions": "Tell me about a time where you failed and learned something"}, {"date": "4 Nov 2021", "title": "LifeGroups/LifeMissions Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Oklahoma City, OK) in Dec 2017", "Interview Descriptions": "The interview process is intense but fun! It is designed to see who you are and if your passions align with the mission. \r\n\r\nThere are several attributes that lead to a lasting employment with LC. The interview creates opportunities for this attributes to display themselves if they are present.", "Interview Questions": "They wanted to know my story. "}, {"date": "9 Apr 2018", "title": "Hospitality Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Life.Church (Oklahoma City, OK) in Dec 2017", "Interview Descriptions": "The interview process was lengthy but worth it. It was obvious that Life.Church invests in their potential employees through the extensive screening process. They wanted to make sure I was the right person for the job and that I would be a great fit for Life.Church.", "Interview Questions": "What would the person who knows you best say is your worst quality? "}, {"date": "9 Apr 2018", "title": "Worship Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Life.Church (Edmond, OK) in Dec 2017", "Interview Descriptions": "A very involved process that helps develop you whether or not you get a job from this organization. They care about you and for you through the entire process and make you feel welcome and valued.", "Interview Questions": "What was the most difficult feedback that you’ve ever received? "}, {"date": "9 Apr 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Oct 2017", "Interview Descriptions": "Thourough and intense, very rewarding.  The team made it clear that the purpose of the process was to make sure that i was the right fit for the team and that Life.Church was the right fit for me.", "Interview Questions": "All of them! "}, {"date": "10 Apr 2018", "title": "IOS Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Life.Church (Edmond, OK) in Aug 2017", "Interview Descriptions": "It was a well planned and they really care about who you are as a person. They have plenty of screenings and tests to make sure you are the right fit.", "Interview Questions": "Are you a Christian?"}, {"date": "9 Apr 2018", "title": "Worship Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Jun 2017", "Interview Descriptions": "Challenging and life-giving interview process. Began with a phone interview, then walked through some self awareness testing, and finally went through an on-site interview. This on-site interview consisted of a round robin style phase of questions, then two one on one interview sessions.", "Interview Questions": "What was one time you took a risk and failed?"}], [{"date": "17 Aug 2021", "title": "Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Oklahoma City, OK) in Jun 2017", "Interview Descriptions": "The entire process is very intense. There are many rounds of interviewing and each comes with a different difficulty. There is round robin style questions, communication run through, and intense leadership questioning.", "Interview Questions": "Why do you want to work for Life.Church? "}, {"date": "6 Jun 2018", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Life.Church (Tulsa, OK) in May 2017", "Interview Descriptions": "a group of people applying for the job interviewed altogether. there were 6 people interviewing us and we had 5 minutes to answer each person's questions. we moved chairs every 5 minutes but we couldnt hear the others because we were far enough away", "Interview Questions": "why you're a good fit"}, {"date": "22 Mar 2017", "title": "Frontend Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Life.Church in Mar 2017", "Interview Descriptions": "I would have loved to work here, but they REQUIRE you to be apart of the congregation. Which means they want to take 15% of your income for tithing.\r\n\r\nI've been to the church and after the band the pastor speaks on a TV for 45 minutes and 15 minutes is about tithing with automatic deductions.", "Interview Questions": "Can you show me some of the websites you've done."}, {"date": "28 Jun 2016", "title": "Life Groups Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Life.Church", "Interview Descriptions": "It was lengthy and unclear. I was told to attend an informal interview at a coffee shop and it ended up being more of an interrogation than an interview. One person was very nice the other very rude. Strange. It was an unusually process and it took them a very long time to make a decision. I have heard other people say the same things about this organization.", "Interview Questions": "Tell us a joke was the final question."}, {"date": "26 Apr 2019", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church (Edmond, OK) in Jul 2016", "Interview Descriptions": "The interview process was like none I had ever been a part of. It was very detailed and thorough and intense. Ultimately it ended on an interview weekend where I spent the entire day going through different interview aspects designed to to get to the heart of who I was and would I be a fit culturally for the organization.", "Interview Questions": "Tell me about a situation in which you had to lead?"}, {"date": "29 Jul 2020", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Life.Church (Edmond, OK) in Apr 2016", "Interview Descriptions": "Lots of superficial questions that did not relate to the job I was applying for. If you gave what they deemed \"cookie cutter\" answers, they would tell you they would not accept the answer and to come up with another.\r\n\r\nAbout halfway through the interview, I could see that all of this was fake, and that the questions were designed to build a character bio to see if you would be pleasant to work with, not if you would actually be good at the job.\r\n\r\nDue to my answers, I didn't get the job. As someone who grew up going to that church, who knew the ins-and-outs, and who went to the Christian school that was adjacent to Life Church's main campus, I was appalled by their decisions to see people as a number as opposed to a person. A friend of mine got the graphic design position there a year later and they hated it. Within 3 months, they were already trying to desperately leave that place. I was able to find a less superficial church to freelance for that actually wanted me as a person and not as a minion.", "Interview Questions": "What accomplishment are you most proud of in your life so far?"}, {"date": "2 Mar 2016", "title": "Directory of IT Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Life.Church (Oklahoma City, OK) in Mar 2016", "Interview Descriptions": "4 month process involved missed calls, no replies and multiple excuses as to why/how an email or call didn't make it to me. Tried to involve management and they didn't care to improve or take ownership of process either.", "Interview Questions": "N/A"}, {"date": "19 Apr 2016", "title": "Online Host Team Pastor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Life.Church (Oklahoma City, OK) in Mar 2016", "Interview Descriptions": "First round interview was scheduled quickly.  They explained what the process would be.  I knew by the end of the week I was not moving on to the next round.  It was handled very professionally.", "Interview Questions": "It was really an interview to get to know me as a person.  I could tell they knew what they wanted in the applicants.  They covered personal, professional and spiritual questions."}, {"date": "5 Nov 2015", "title": "Central Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Life.Church (Edmond, OK)", "Interview Descriptions": "A bit drawn out. Very thorough with testing and multiple interviews. It's clear that they care about getting the right people in the right role. Team chemistry and cultural fit are very important. My spouse was required to be in the final interview, which I really appreciated. It's great when you can process together and make the decision together.", "Interview Questions": "How would Satan take you out?\r\nWhat do you value in a leader?"}, {"date": "14 Jul 2017", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Nov 2015", "Interview Descriptions": "The interview process was absolutely wonderful.   After reviewing my resume, preliminary testing, and phone screenings, Life.Church paid for my flight and hotel stay to interview.  All details were fully communicated about the process.  For other candidates, spouses were even flown in for the event.  You could tell the staff really cared for the people they were hiring.  Their goal was to make sure you fit in the culture and love the mission of the church otherwise it would not be a good fit for either party.", "Interview Questions": "They asked me what was a big failure of mine in life and what I did about it"}], [{"date": "3 Mar 2017", "title": "Host Team Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Life.Church (Edmond, OK) in Oct 2015", "Interview Descriptions": "The full interview process was a 3-day experience designed to help us understand the culture of Life.Church and for them to get to know me and my family. The interview event itself pulled multiple candidates (and spouses) for multiple open positions together to do basic interview questions through a rotation process. Then each candidate was ranked. Folks who made it to the next couple rounds had the opportunity to be interviewed in more of a one-on-one setting with their spouse. After that, the final portion was a communication practice, where we drew a topic out of a hat, had 10 minute to prepare a 6-minute talk on the topic and present it to the whole group of candidates and interviewers.", "Interview Questions": "The most difficult question I was asked was about how failing in my previous job shaped me."}, {"date": "21 Mar 2017", "title": "LifeGroup & Missions Project Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Life.Church (Jenks, OK) in May 2015", "Interview Descriptions": "Very intense but well worth the process. You learn a lot about yourself in the interview and every conversation regardless of if you are in the actual interview or just at dinner is part of the process. If you make it to the other side there is a very high rate of success,very few will not make it past the 90 days. This is why the interview is very intense because they want to set the organization as a whole up to succeed. Know that it is not just you interview, your spouse is also a part of the interview as well.", "Interview Questions": "If I told you in 2 months you had to recruit 50 Lifegroups how would you make that happen?"}, {"date": "9 Feb 2015", "title": "Associate Youth Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Life.Church (Edmond, OK)", "Interview Descriptions": "Lots of intentional questions and \"pressure cooker\" situations. They want to get to know the REAL you. Not just an interview master. They'll ask a lot of situational questions to see how you would react in different circumstances, and they'll ask you to tell stories from your life to help them understand if you're a good fit for them. They're not looking for just someone who can do the job. They're looking for someone who is already on board with the vision they have as a church.", "Interview Questions": "How would the enemy attack you if you took this job?"}, {"date": "16 Aug 2015", "title": "Technical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Feb 2015", "Interview Descriptions": "Multiple levels of pre-interview phone calls, testing (Aptitude, CDAT, M/B, Spiritual Gifts...) prior to on-site interview.  On-site interview was panel style and included my spouse.  I enjoyed the process very much as it showed the premium they place and the time they take on trying to hire the right candidates.", "Interview Questions": "N/A"}, {"date": "22 Jun 2018", "title": "Production Artist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church (Edmond, OK) in Aug 2014", "Interview Descriptions": "I had a one-on-one interview with the department director.  It went well and I was impressed with the department - unfortunately, I was the only female in sight.  After a 2-month hiatus in communication, I was asked in for a second interview which as horribly intimidating after such a long lull. I was introduced to a boardroom of people.  I am hopeful the process hole that leads to the lag and the communication shortcomings has been fixed.  And that the team has added some female perspectives since then.  In the end, I did not get an offer and I respect their decision in that.   I was overqualified for the job and they saw that my contentment with the position would not last.", "Interview Questions": "Where I wanted to be in 5 years"}, {"date": "6 Jun 2014", "title": "Worship Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Life.Church", "Interview Descriptions": "The interview process at LifeChurch.tv is pretty intense! Typically a round-robin interview style, the candidate and spouse will encounter three, 30 minute interviews with a team of 6-10 LifeChurch team members. There's really not a way to prepare for the interviews and my advice to a potential candidate would be to simply be yourself.", "Interview Questions": "We didn't expect the process to be as spiritually life-giving as it was. It was hard but incredible."}, {"date": "30 May 2014", "title": "Campus Administration Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Life.Church", "Interview Descriptions": "The interview process had several steps but was quick and clear. After submitting my résumé, I had an initial Skype interview, testing, a follow-up Skype interview, and then an in-person interview. Other final candidates were also present at the in-person interview, which was very awkward. Several questions asked were borderline inappropriate, but the intention was clear and understood.", "Interview Questions": "If we don't hire you, which of the other candidates present do you think we should hire?"}, {"date": "29 Aug 2017", "title": "Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Life.Church (Edmond, OK) in Apr 2014", "Interview Descriptions": "Several Skype interviews followed by an intensive one day onsite. The one day onsite consisted of several panel interviews, testing, and a final meeting with the planned manager. Very thorough interview.", "Interview Questions": "They asked me to tell them a joke about something."}, {"date": "15 Nov 2017", "title": "LifeGroups/LifeMissions Pastor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Life.Church (Clayton, NC) in Oct 2013", "Interview Descriptions": "I went through three different interviews before even going to Oklahoma City for the interview weekend. The weekend in Oklahoma City begins with attending the main campus on Saturday night and then a follow up get-together. On Sunday morning all of the candidates meet at the central office and tour four different campuses. That sounds fine until you realize that you were being interviewed in the car between every single campus. There is absolutely no downtime. You are constantly being interviewed and looked over. Then, if you make it to the Monday morning interviews, that’s where you go in for testing and afterwards the interview process begins again. You are sitting in the lobby and they come out and select you to go back and be interviewed by two people in an office. That goes on for about 10 minutes and then you go back into the lobby and hope your name is called for the next round. This repeats two or three more times. If you make it through all of those rounds like I did, then you are taken into the Conference room where you are told to choose number 1, 2, or 3. After you have chosen a number they give you a topic that you have to construct a sermon off of without using your phone. Some of the topics included plastic surgery and masturbation. After the 10 minutes is over for your preparation you are taken into what they call, Studio B, where their guest speakers preach from. You go on stage and preach in front of a crowd of people. It’s very intimidating. But I did feel like I grew as a leader through this entire process. I do think it was a little bit over-the-top, but they have to weed out all of the non-hackers.\n\nI didn’t get this particular job but I did get another position at one of the campuses which was also a pastoral position.", "Interview Questions": "If you were on the football field, would you rather be the quarterback or the head coach?"}, {"date": "31 May 2014", "title": "Associate Campus Pastor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Life.Church (Oklahoma City, OK) in Sept 2013", "Interview Descriptions": "The interview process at LifeChurch.tv is very intense, but very informational and infighting.  You will truly walk away from the process learning so much about yourself and the LifeChurch.tv culture.", "Interview Questions": "The questions are unclose and personal"}], [{"date": "2 Jun 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Life.Church (Edmond, OK) in Aug 2013", "Interview Descriptions": "Initial Communication-very professional yet friendly, genuine. Somewhat of a lengthy interview process (but its because they want to make sure that you are right for the job and that the job is right for you.) Application with portfolio/resume, phone interview, testing, and finally a team chemistry interview.", "Interview Questions": "What is one weakness that you have and how do you manage it?"}, {"date": "16 Oct 2017", "title": "Content Partnerships Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church (Oklahoma City, OK) in Jul 2013", "Interview Descriptions": "The interview helped me get to know the people I'd be working with, what the role is, and some of the set backs that I might experience if I got the role. I felt appreciated and that their questions were to really get to know me. I left my interview feeling like this team is doing important things and will thoughtfully consider the best person for the role.", "Interview Questions": "How do you think your experiences [in the customer service industry] will impact the way you view this role? "}, {"date": "30 May 2014", "title": "Crestive Media Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Life.Church (Edmond, OK) in Mar 2013", "Interview Descriptions": "Began with email, phone interview, then two in person interviews in front of a panel, one with my spouse and one without. I've also seen interviews with others via Skype. The process was very transparent, and any information I requested was given. Be honest, and make sure you are passionate about furthering the ministry of Christ in the area you are interviewing for. If you just apply for a lot of different positions because you want to work for LifeChurch.tv, you will not get interviewed.\r\nMy interview process took 4 months, but that is atypical. I would expect most processes to take between 2 weeks to 1 month.", "Interview Questions": "Defending the direction I took in the project that I submitted prior to the interview, and speaking about what might make me most vulnerable in the future in regards to being able to successfully fulfill the demands of my position."}, {"date": "30 May 2014", "title": "IT Development Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Life.Church (Edmond, OK) in Nov 2012", "Interview Descriptions": "Job posting on website, application with resume, Phone screen, Skype Video Screen, In-person visit, personality testing, competency testing, spiritual gifts testing, In-person interview with two different panels, phone and email offer, counter offer, accepted", "Interview Questions": "What risk is LifeChurch.tv taking in hiring you?"}, {"date": "7 Jul 2012", "title": "Central Team Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Life.Church (Edmond, OK) in Mar 2012", "Interview Descriptions": "Very long process. Applied for position, emailed 3 weeks later and asked to answer questions via email. A few days later I was asked to interview via Skype and then over the phone. A panel interview was scheduled for a week later. The panel consisted of 5 people at a round table. LOTS of questions, took just under an hour. They tried to make it comfortable and pleasant but if you answered a question in a way they didn't like, they all passed looks at each other and you definitely knew you didn't answer right. That made me feel uncomfortable :(  They did not let me know if I had the job or not until I contacted them a week later.  I didn't get the job and when I asked for feedback they just told me they didn't think I would like it and I didn't have enough passion for the job.", "Interview Questions": "Why do think you would be good at this job?"}, {"date": "17 Jun 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Life.Church (Edmond, OK) in Sept 2011", "Interview Descriptions": "I submitted my resume online and was contacted within 1 week. Initial phone screening was scheduled for a few days later, after that I was asked to complete extensive testing (CDAT, Keirsey temperment, spiritual gifts, etc.), and based on those results I was selected to move on to the last round, which was a group interview in which test results are discussed.", "Interview Questions": "Questions about some of the test results were difficult, as they hold these results very high and will challenge you with questions about your weaknesses"}]]