[[{"date": "31 Mar 2023", "title": "Working Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Jan 2023", "Interview Descriptions": "They have helped me so much in getting an internship which is turning out to be a future career. The head robotics professor showed up to my first meeting with the company owner and gave a good word about me. They staff at UAT are so awesome", "Interview Questions": "Here is what we need in a robot. Do you have any Ideas?"}, {"date": "17 Sept 2019", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at UAT (University of Advancing Technology) (New York, NY)", "Interview Descriptions": "They called me in to just meet me and do one of those tired and overplayed DISC assessments. Then called me back in so the president could try to get information on the school I work for in the next interview. They made me do a background check and never called me again.", "Interview Questions": "How many ads is your college currently running?"}, {"date": "18 Aug 2019", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ)", "Interview Descriptions": "The Interview was long. We started with a one page DISC assessment and together with the interview I was there for a total of one hour. The interviewer was very rude. She was constantly interrupting me and her tone of voice was rather strong. I don't think I got through a single question without her interrupting. I could not give a proper answer because of this.\r\n\r\nOverall, I was getting the feeling the school is not very friendly towards certain individuals.  The interviewer was asking information that would reveal my ethnicity and background information. I should mention I did not see any colored people working on the campus. The students did not appear diverse either. \r\n\r\nDuring the interview, the woman interviewing me also did not take my paperwork which already suggests that she knew she did not want to hire me before she even started asking questions. \r\n\r\nI was also told I would get called the following week after they complete interviews. I received a rejection letter immediately after leaving the building and then a second rejection as a reminder a week later. Thanks for taking me into consideration.", "Interview Questions": "I see you have experience working with a diverse group of people but why did you choose to work with Hispanics?"}, {"date": "4 Jan 2021", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UAT (University of Advancing Technology) (San Francisco, CA) in Jan 2019", "Interview Descriptions": "It was very easy.  I enjoyed meeting all the people and the online forms were easy to navigate.  The HR was great and made the process streamlined via electronic verification and ZOOM.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "7 Dec 2018", "title": "Nationa Admissions Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at UAT (University of Advancing Technology) in Nov 2018", "Interview Descriptions": "This was probably the best interview process I have ever been in.  It was so welcoming and easy going.  This university seems like a family.  Every conversation I had I laughed and both myself and the interviewer made jokes.", "Interview Questions": "What is your favorite type of food?"}, {"date": "1 Feb 2018", "title": "Senior Staff Accounting Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Jan 2018", "Interview Descriptions": "Had one-page DISC personality test once I met my interviewer. Kind of weird opening.  10 min finish the test. 15 min interview. Short and sweet one. Did not have any Excel test at all. Plain talking.", "Interview Questions": "What are your strength and weakness?"}, {"date": "21 Sept 2016", "title": "Career Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Aug 2016", "Interview Descriptions": "I spent 4 weeks going through rounds of interviewing and then was asked to come in for an in person interview. I was informed that up to this point they were extremely impressed and the recruiter told me that i would certainly be hired for this position or another one at UAT  The next round interviewer was out on vacation so i met with the president of the university. He asked me several inappropriate questions unrelated to my ability to accomplish the job tasks as assigned in the job description. Two days later i received a phone call that they had already hired someone for the position i was interviewing for. After that conversation i noticed that the job description was posted once again and when i asked about it i was informed that it was posted just to collect resumes. I was told that they wanted me to meet with another director for a position in a different office and that it was my choice to turn down this new position. This was not a meeting it was an interview that I was unprepared for because i was denied a job description after requesting one several times. I was then informed 2 weeks later that i would not be hired for this position either, with no further explanation. This university lies to its candidates and has extremely poor recruiting practices including asking illegal questions during interviews.", "Interview Questions": "You recently moved to AZ, so are you going to be comfortable here with the heat?"}, {"date": "13 Dec 2015", "title": "Manager of Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Oct 2015", "Interview Descriptions": "The interview was a bit different than others I've experienced.  UAT functions as an open-concept office, so I interviewed with the talent specialist in a very casual, yet private, common space.  The interview took about an hour and focused on culture and fit.  I did have operational questions, but the specialist couldn't answer them because of the nature of this first interview.  I was not prepared for this type of interview; I do wish I had known the nature of it before going in.\r\n\r\nI was most disappointed with the conclusion of the interview.  The specialist spent significant time telling me of next steps -- I'd be brought back in the following week for the next rounds, that I'd have three more sets of interviews, that two would be scheduled on the same day, and other indicators that I'd be moving forward.  I followed up afterward with my thank-you email and how I was looking forward to the next steps.  The next communication I had was a week later, informing me that the position had been filled by someone else.  A few days after that, the position was readvertised.\r\n\r\nI requested feedback from the specialist but I heard nothing.\r\n\r\nIMHO, the specialist should not have led me to believe I was moving forward, whether or not I had a chance of doing so.  There are other ways to explain next steps to make clear to the applicant what the steps are without leading the person on.", "Interview Questions": "What is something that you believe in that none of your friends or colleagues believes in?"}, {"date": "22 Dec 2016", "title": "Bindery Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Sept 2015", "Interview Descriptions": "Everything was very smooth and fast. It felt like I had the job before the interview started. i.e. the interview was simply a formality. Filling out the paperwork was super fast and easy. The entire HR staff was great and made sure I understood everything I was signing and/or filling out.", "Interview Questions": "What are your greatest weaknesses?"}, {"date": "9 Mar 2015", "title": "Associate Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UAT (University of Advancing Technology)", "Interview Descriptions": "I met with HR. Then the faculty manager. They said I may be asked to show a presentation later to show my teaching skills.\r\n\r\nIt was a nice interview process. They are very clear about everything", "Interview Questions": "They ask very straight forward questions. \"what do you do for fun?\""}], [{"date": "28 Aug 2014", "title": "Manager of Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Aug 2014", "Interview Descriptions": "The Talent Acquisition Specialist was very quick at getting me in the door to interview (next day after submitting my resume), however I am not sure what happened after the 2 hour interview that made them not want to bring me in to meet with the Provost and Owner.  I was really bummed out as I felt as though I did everything spot on and really gave the interview my ALL.  As a person dedicated to continuously improving, I asked the recruiter for some feedback regarding what I could have done (if anything) to increase my chances of a second interview and I never heard back from her.  \r\n\r\nThey have a really cool office building with a touch screen tablet that is bigger than a 55 inch plasma TV.  I really liked being around all the cool technology that the students are working on there.", "Interview Questions": "Please describe a situation from your last job that really annoyed you (this was like a no-win question as you aren't supposed to air your dirty laundry but this question lends itself to that behavior).  "}, {"date": "26 Jul 2015", "title": "Student Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UAT (University of Advancing Technology) (Tempe, AZ) in Jul 2014", "Interview Descriptions": "The HR team should be a model for other organizations. I never experienced such professionalism,  responsiveness and effective interactions with an HR team prior. They were kind, smart, well versed in the UAT culture and organized.  They asked great questions to really assess if I would be a good cultural fit.", "Interview Questions": "Describe a time when my integrity was challenged and what did I do?"}]]