[[{"date": "12 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Good Samaritan Hospital (Los Angeles)", "Interview Descriptions": "Interview had a lot of clinical scenarios but definitely doable. Definitely a bit nerve wracking but just take your time. It helps if you admit when you’re not sure or don’t know. The interviewers were nice and take their time with you.", "Interview Questions": "Patient with pulmonary embolism Prioritization Isolation Precautions"}, {"date": "17 Dec 2022", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Good Samaritan Hospital (Los Angeles) (Los Angeles, CA) in Dec 2022", "Interview Descriptions": "Very fast. Applied one day (Wednesday night), next day received call to set up interview for the following Tuesday and on Thursday of that week got the news that I got the position.", "Interview Questions": "The usual questions such as why I want to work for the company, my previous experience, how I handle conflict, what if my preceptor does something wrong, and clinical questions regarding ICU patient care."}, {"date": "5 Jan 2021", "title": "Nurse Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Good Samaritan Hospital (Los Angeles)", "Interview Descriptions": "Before the pandemic. I was interviewed by 3 nurses. One director. One assistant and one ICU nurse. Questions were normal and process was quick.  They let me know if I was hired on the spot or not.", "Interview Questions": "Difficult situation and how would you solve it. "}, {"date": "29 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Good Samaritan Hospital (Los Angeles) (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "Interview was done with educator and manager. It was pretty straight forward.  I was nervous in the beginning but once I calmed my nerves it was very conversational. They said I would hear back in a week.", "Interview Questions": "How do I handle stress, what do I like to do for fun, why do I like this specialty, how to handle a dispute, where do I see myself in 5 years"}, {"date": "2 May 2023", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Good Samaritan Hospital (Los Angeles) (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "It was rather easy. I received an email to setup an interview date, after I had sent my application. Met with the director and HR. They asked questions to get to know you, they asked why I applied and then told me about the job. They called me the next day to let me know I had got the job.", "Interview Questions": "Tell me about yourself? Why do you feel you’d be a fit for this company? What’s your availability?"}, {"date": "23 Aug 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Good Samaritan Hospital (Los Angeles)", "Interview Descriptions": "It was a panel interview - director of critical care, supervisors of ICU, CVICU and CVDOU, as well as 2 managers. \r\nFirst round of questions are typical personality questions \r\n2nd round are clinical questions", "Interview Questions": "Name two strengths and weaknesses "}, {"date": "30 Jul 2018", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Good Samaritan Hospital (Los Angeles) (Los Angeles, CA) in Jul 2018", "Interview Descriptions": "10 people are interviewing you. It was intimidating but they were helpful. they tried to explained everything. I asked if they could repeat the question around two times and they did. The interview was around 40 mins long.", "Interview Questions": "Why do you want to work with us?"}, {"date": "9 Aug 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Good Samaritan Hospital (Los Angeles) (Murrieta, CA) in Jul 2018", "Interview Descriptions": "Panel interview with approximately 8 interviewers. Each asked 3 questions. Need to be prepared to answer a range of questions. Interview was intense with behavior questions and patient scenario questions. Interviewers mostly had poker faces.", "Interview Questions": "Name a failure you’ve had"}, {"date": "8 Dec 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Good Samaritan Hospital (Los Angeles) in Oct 2017", "Interview Descriptions": "Applied online. HR called me for an interview with background check paperwork to be completed. It was a Panel of three people. Plus, some case studies and personal statement. After this, you’ll receive an email to send and check references and wait for your offer letter. I received a letter that I was accepted into a new grad program but still haven’t received the offer letter. The nursing director said they’d have a decision by the end of November. I called HR after November and I was told within the next two weeks. Tomorrow makes it the end of those two weeks, so I hope I hear something", "Interview Questions": "Tell me a time you had a difficult patient and how you handled this"}, {"date": "19 Feb 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Good Samaritan Hospital (Los Angeles) (Los Angeles, CA) in Feb 2017", "Interview Descriptions": "there was a panel of 4 interviewers, they asked me two questions each. mostly situational questions about previous experiences. it was a very non-intimidating interview experience. the panel was nice and direct to the point. they asked follow-up questions.", "Interview Questions": "the most significant accomplishment you have in your profession"}]]