[[{"date": "8 Apr 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College", "Interview Descriptions": "Very long process, meet multiple people before selection. It is a very through process, I believe I interviewed 5 times before selection took place of course on top of background and reference checks", "Interview Questions": "Can you handle numbers driven environment?"}, {"date": "1 Sept 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heald College (Sacramento, CA)", "Interview Descriptions": "Literally a phone call. At the tie there was only one other criminal justice instructor and they had n applicants.  I had no teaching experience and they hired me in a week and loaded me with two classes. Fortunately I was able to do it and become successful at it.", "Interview Questions": "Standard employment questions, employment background, etc."}, {"date": "28 Aug 2016", "title": "Senior Finance Accountant & Cost Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Heald College (Madera, CA) in Jul 2016", "Interview Descriptions": "A company recruiter contacted me to schedule a phone interview. The interviewer was some regional director, who didn't speak English well and had a tight schedule as he was preparing to fly to Mexico. I also work part-time until I can get hired by someone full-time and tried to schedule any interviews around my part-time job. The interviewer wasn't that accommodating and I had to sit in my car outside of my job in the middle of a hot Fresno summer just to talk to him. I was also scheduled for a face-to-face interview the next day, but that got cancelled because this regional director didn't believe I was a good candidate, based on a phone interview. The situation wasn't very professional on their part, they could have at least allowed me to meet them face-to-face for additional insight from a different person's perspective.", "Interview Questions": "Tell me about yourself."}, {"date": "2 Sept 2015", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heald College", "Interview Descriptions": "The whole process took about 2-3 weeks.  Interviews consisted of meeting with the department manager, the rest of the department employees, and the Campus President.  No major lag times or gaps in communication and they reached out as needed regarding progress or the need for additional information.  They were all professional and cordial and everyone seemed nice.", "Interview Questions": "How do handle rebuttals from students regarding employment, unemployment, and professionalism?"}, {"date": "16 Aug 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 1 week. I interviewed at Heald College (Honolulu, HI)", "Interview Descriptions": "Fill out application and meet with manager on the spot. 2nd interview was scheduled two days later. Immediately after interview start date was given and background initiated. Total process time was about 7 days. They were really quick in hiring.", "Interview Questions": "How soon can you start?"}, {"date": "29 Mar 2015", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Heald College (Sacramento, CA)", "Interview Descriptions": "I was an Adjunct who applied for a Full Time position via the Heald Intranet site. My current supervisor contacted me within a week. I met with the Supervisor to go over my resume and qualifications. Then, I was invited to provide a sample lesson plan to a panel of Instructors/Program Directors/AA Director which lasted about 15 minutes.  They were excellent \"students\" and responded well to my example lesson. I used the White Board and a handout and made sure to engage the panel and elicited feedback/responses from them as if I was teaching students. \r\nI got very nice comments and questions and was offered the position.  It helped that I had been adjunct on another campus with great results and got an excellent  recommendation from my Supervisor there, but I was also qualified for the position and very enthusiastic about providing a great classroom experience and following all company policies and goals. \r\nI was given an offer letter and was started out on a salary dictated by corporate for my level of experience and education.", "Interview Questions": "How would handle a diverse population of students?"}, {"date": "18 Feb 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Heald College", "Interview Descriptions": "I Receieced a phone call and was asked to come in for a group interview. It as only me and 1 other lady. They gave us a tour of heald and gave us some history of the school. Showed us what they offered the students . Then we met with the president and he interviewed us but he didn't really ask us questions he mainly discussed the working environment of the job . Which sounds great they emphasized on how fun and nice they are there . He was nice . He didn't give us an exact description of the job . It was about an hour long total with the tour and he said if we were interested to email him back if we liked what we saw . He said the hours are not a normal 9-5 they are constantly changing. He said they offer medical, dental and I think vision", "Interview Questions": "What do you know about heald college? , what does success mean to you ? What do you like about heald college ?"}, {"date": "22 Feb 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College (Modesto, CA) in Feb 2015", "Interview Descriptions": "The job posting didn't specify the \"crappy\" hours. Don't be SURPRISED! it was a group interview with 15 applicants present. Three step interview process. Lasted about 2 hours. 3 interviews before hired.", "Interview Questions": "40 hour work week. Three nights until 8:30 pm and every other Saturday."}, {"date": "5 Jul 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Heald College (Fresno, CA) in Feb 2015", "Interview Descriptions": "Met with two people, then again with multiple individuals.  A group panel is typically utilized as part of their screening process. Went through a background test and was offered the position.", "Interview Questions": "do you know the difference between empathy and sympathy?"}, {"date": "17 Oct 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College (San Francisco, CA) in Feb 2015", "Interview Descriptions": "30 Min Powerpoint on history of company, followed by a speech about how to \"sell\" the school without sounding like a sales person. Afterwards we chatted among ourselves, and were given the opportunity to leave, or to move forward with the next interview.", "Interview Questions": "What motivates you in life?"}], [{"date": "7 Jan 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Heald College (Portland, OR)", "Interview Descriptions": "The interview process was simple - submit resume, interview with Academic Director, and complete a teaching demonstration. However, the lack of timeliness and correct information on when, where, and what he teaching demonstration was to be made preparations difficult. Also, they did not respond to follow-up phone calls in a timely manner.", "Interview Questions": "Tell us a time when you were faced with a difficult situation. What was the situation, what did you do, and what was the outcome?"}, {"date": "28 Sept 2014", "title": "Student Records Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heald College", "Interview Descriptions": "I applied and received a call from the Registrar himself a week later, met with him later that week. It was simple wanted to know what my strengths were, what I could contribute. Mostly he talked about the department and what he was looking for.", "Interview Questions": "Not difficult, he talked most of the time."}, {"date": "29 Sept 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College", "Interview Descriptions": "The \"interview\" was terrible! I was placed in a room with at least 30 other people and had to sit and go over a 30 minute powerpoint presentation. The whole job is being a telemarketer and they said you have to be prepared to answer 500+ calls a day. All they care about is their numbers and don't really care about the well being of the student. I was expecting something more personal with students and helping them reach their goals. Not having them just be a number for my quota.", "Interview Questions": "Are you prepared to be on the phone all day?"}, {"date": "7 Sept 2014", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College", "Interview Descriptions": "Initial interview with director, then team, campus president, and finally corporate director of career services. Process went really quickly considering all the people to meet with. Processes for other positions are not as easy as career services.", "Interview Questions": "How would you handle a student who is unresponsive to you?"}, {"date": "22 Sept 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 days. I interviewed at Heald College (Salinas, CA) in Aug 2014", "Interview Descriptions": "Applied to Admissions Advisor position online early in the week and received a call the following day regarding my interest in the position. The interview--or group interview--was held the Friday of that same week in the evening. \r\nAs the job description focused on helping students find their career interests and getting them enrolled, I was very much interested. However, this description was misleading. \r\n\r\nDuring the beginning of the group interview, the interviewer was honest and straight forward about the position--it was a sales job. A sales job that would require making 100-200 calls daily to get a lead that may or may not end up with a potentially interested student. \r\n I actually appreciated his honesty very much. It gave me the opportunity to learn what the job entailed and how sales-focused it actually was. \r\nI did not stay for the group-interview portion; I knew I wasn't fit to be in sales. However, if you have sales experience and are good with people on the phone, this may be a job for you. Best of luck to you!", "Interview Questions": "I did not stay for the interview portion."}, {"date": "12 May 2014", "title": "Career Services Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heald College (Fresno, CA)", "Interview Descriptions": "Phone Interview, then face to face with Manager, and then another phone interview with Regional Manager. The Face to Face was the most important if you get past that you are hired.", "Interview Questions": "How would you deal with a student that will not contact you back?"}, {"date": "30 Jun 2014", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Heald College (San Francisco, CA) in May 2014", "Interview Descriptions": "initial communication was for a one-on-one interview, however when I arrived it was a group interview. I didn't mind it once we got going, but it was a little awkward at first.", "Interview Questions": "What makes you \"not\" a good fit for this position?"}, {"date": "6 Feb 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College (San Francisco, CA)", "Interview Descriptions": "They asked me to come in as soon as possible. So I did, the next day.\r\nI was excited. When I got to the interview, they asked me some basic questions about myself and told me a lot about the company, it's mission, it's goal, its vision. \r\nThe interview felt more like they were selling me the job instead of my applying. However, after i was hired, the interviewing process god harder.\r\n\r\nNow: You have an interview with the president of the school or the senior director of admissions, then you can have either one or two interviews with senior admission staff.", "Interview Questions": "Why do you think you are qualified for this position?"}, {"date": "3 Aug 2015", "title": "Medical Assistant Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Heald College in Feb 2014", "Interview Descriptions": "on-line application, heard back from heald in about 2-3 weeks. Next was a test teach, on any subject I choose. Immediately after I got to meet the staff, took a tour\r\nheard back with in a few weeks, its the background check that takes forever!", "Interview Questions": "how did you handle difficut situtations with students"}, {"date": "17 Jan 2014", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Heald College", "Interview Descriptions": "Mini lesson and interview", "Interview Questions": "What are you passionate about? "}], [{"date": "3 Jan 2014", "title": "High School Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Heald College", "Interview Descriptions": "The hiring process is long, and competitive.", "Interview Questions": "How do you handle stress in a stressful situation? \r\nWhat keeps motivating you when you do not feel like working?"}, {"date": "2 Feb 2017", "title": "Instructor, College Or University Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (San Leandro, CA) in Jan 2014", "Interview Descriptions": "I am writing to announce my resignation from Med Center Medical Clinic effective today February 2, 2017. Unfortunately I have lost my child care provider that I had lined up to take care of my 3 month old daughter. The option for an alternative child care provider is not available to me at this time due to where I reside. I would like to thank you and the Med Center Medical Clinic for allowing me to be a part of a dedicated team of health care professionals", "Interview Questions": "How much pay"}, {"date": "25 Nov 2013", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (Concord, CA)", "Interview Descriptions": "Group interview with Director, meet and greet and review of actual job specifics. Heavy sales requirement. Two step interview process, only a few will be called back for individual interview with Director.", "Interview Questions": "After introducing ourselves and background we were asked to pick one person that they should hire, not ourselves, and why."}, {"date": "5 Nov 2013", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Heald College", "Interview Descriptions": "I was called out of the blue after applying to a job posting. The person I spoke with seemed very friendly, and they invited me to an in-person interview.", "Interview Questions": "\"What is your weakness?\""}, {"date": "6 Oct 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Heald College", "Interview Descriptions": "Be prepared to discuss specifics of the subject being taught and to give a teaching demonstration.", "Interview Questions": "How would you handle a distracting student. "}, {"date": "19 Sept 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Heald College", "Interview Descriptions": "Depending on how the hiring manager handles interviews can be the difference. Just be you and bring your A game. You might have a direct or group interview. This will proceed with another interview either or both with piers and middle management. They will make the decision and then a formal approval through upper management's final interview.", "Interview Questions": "Role playing for the postion"}, {"date": "7 Sept 2013", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heald College (Hayward, CA)", "Interview Descriptions": "Interviewed with the Director of Career Services, the Campus President, and finally Corporate Director. It's all about personality and fit", "Interview Questions": "Describe how you would work with challenging students."}, {"date": "27 Mar 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Heald College (San Francisco, CA) in Aug 2013", "Interview Descriptions": "I originally had a brief phone interview and was asked to come in person that same day. Of course that didn't give me enough time to prepare and get ready so I requested for the next day. Went in and met with the Senior Director, Regional Director, the Admissions Director, and then the Senior Director again. I was there for 4 hours. They technically offered me the job on the spot, but made sure I passed the background check to make a formal offer.", "Interview Questions": "Where do you see yourself 5 years from now?"}, {"date": "16 May 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (San Francisco, CA) in Aug 2013", "Interview Descriptions": "They changed the interview process. Now you have to prepare to do a \"mock\" phone call, and pretend you're speaking to a potential student while the interviewer is on the other line. It can be hard especially because this might be your first sales job. Very intimidating", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Jan 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Heald College (Stockton, CA) in Aug 2013", "Interview Descriptions": "I had to apply online and submit my resume and cover letter.  I received a phone call to schedule and interview.  I prepared for the interview and arrived on time.  I interview with a variety of personnel and then received a tour.  After the interview I sent out thank you cards.", "Interview Questions": "How do you handle conflict?  How well do you manage a wide variety of clients?  What is your success in mentoring and coaching, developing a team?"}], [{"date": "28 Mar 2017", "title": "Student Loan Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College (San Francisco, CA) in May 2013", "Interview Descriptions": "simple two week process, contacted by phone for a short 15 minute interview. Invited to a interview within a week, lasted a hour. During interview, Manager really seemed anxious to hire someone right away. She was going on maternity leave. Received a call within 3 days with a job offer. I should have seen the red flag.", "Interview Questions": "What is your proudest accomplishment"}, {"date": "14 Sept 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College (Sacramento, CA) in Apr 2013", "Interview Descriptions": "It w a s   p r e t t y    s t r a i g h t f o r w a r d.", "Interview Questions": "They asked about my previous experience in higher education."}, {"date": "19 Jan 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Heald College", "Interview Descriptions": "The candidate for instructor position requires giving a mock lecture in front of a panel of audience composed of  directors, instructors, staff and students.", "Interview Questions": "What could you give to the students to contribute to their success in the field they have chosen?"}, {"date": "8 Nov 2017", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heald College (San Francisco, CA) in Jan 2013", "Interview Descriptions": "You are initially interviewed with 20+ other applicants in a room at the same time.  They later eliminate you by groups and only keep the group of people they like to move onto the next interview process.", "Interview Questions": "Why are you here?"}, {"date": "13 Sept 2012", "title": "Addmissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Heald College (Rancho Cordova, CA)", "Interview Descriptions": "The hiring and interview process went very well. The Admissions Director was very well organized and professional. I was scheduled to come in on a Saturday for an interview to accommadate my busy schedule. Interview was about 30-45 minutes and she immediately gave me an aswer and I was able to give my previous employer a 2 weeks notice and started working 2 weeks later.", "Interview Questions": "What would you do if someone started to enroll but never finished the process"}, {"date": "9 Feb 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (Milpitas, CA) in Jan 2012", "Interview Descriptions": "I underwent two interviews for the position. The first interview was more of a screening process. Each interested applicant stood up in front of the other applicants and the interviewer and gave a short introduction about him/herself, as well as why he/she wanted to work for Heald College. The second and final interview was much more thorough and lasted about two hours. I was interviewed by two different people at separate times. I received a tentative offer that same week, pending a background check. I received a final offer the following week.", "Interview Questions": "\"You just graduated from college not too long ago and don't have much long-term work experience. Why should we hire you despite this lack of experience?\""}, {"date": "28 Jan 2012", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heald College (Milpitas, CA) in Sept 2011", "Interview Descriptions": "I initially responded to a job posting online. It was one of those generic electronic applications where you answer questions for what seems like forever. Upon clicking the submit button, it took 1-2 weeks to hear back from anyone. When I finally did get a response, I had a 30-45 minute phone interview, scheduled an in-person interview for the next week, and 1 day before I was to show up, was told by my interviewer (hereinafter cold shoulder) I needed to prepare a 30-minute presentation for a group interview that best reflected my teaching abilities. I completely winged it.\r\n\r\nTwo weeks went by and I heard nothing. I called a couple of times, always getting the run-around from cold shoulder; she acted like she didn't even remember me. Finally, less than a week before the start of a new quarter, cold shoulder offered me the job and stipulated that I had to create a syllabus and lesson plans from scratch for two courses that were never listed on the job announcement or discussed as possible job assignments during the interview or presentation phase. Again, I winged it.\r\n\r\nI was also told I'd get paid $2000 per course, but later discovered that with all the administrative expectations involved to meet compliance, what should have been $22-25 an hour quickly dissipated to $7-8 an hour if you were to ever do the job the way Heald demanded. Again, I winged it.\r\n\r\nThere were plenty of warning signs that I shouldn't have accepted this job. There were also plenty of warning signs that I shouldn't have kept this job either. Suffice to say, I had no reservations about leaving.", "Interview Questions": "If you had a student abruptly act up, how would you respond? "}, {"date": "11 Feb 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heald College in May 2011", "Interview Descriptions": "Group interview first, then they call back the ones they liked out of the group interview. Some people get interviewed once after that and are offered a position, some have to return multiple times. Just depends on how desperate they are to get someone in there. Background check can be a very time consuming process though. Mine was completely clean and still took weeks to go through.", "Interview Questions": "None too crazy honestly. They are looking more for a personality type and a work ethic than anything."}, {"date": "14 Jun 2015", "title": "Legal Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Heald College (Stockton, CA) in Jan 2011", "Interview Descriptions": "It was a series of three interviews. After that, I met with the campus president. It was more laid back than the prior interviews. I had asked for more money than the position paid. I focused on my experience and ability to teach, and write curriculum. Then I stated that because I took a pay cut to work there and based on my experience as a Judge, it would add prestige to the school and more credibility to the new legal program. He then,agreed to pay me what I was asking. He welcomed me aboard and told me that I could easily move up the company if I wished.", "Interview Questions": "What would you consider to be your biggest strength? What event was the most difficult to handle at a past position and how did you resolve it? What do you think is your weakness and how would you resolve it?"}, {"date": "26 Nov 2010", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Heald College (Hayward, CA) in Aug 2010", "Interview Descriptions": "Multiple interviews with all levels of the organization including a presentation.Poor follow-up after the process.", "Interview Questions": "No hard questions"}], [{"date": "9 Mar 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Heald College in Jul 2010", "Interview Descriptions": "Just a typical sales process interview questions.  They are all about quotas.", "Interview Questions": "N/A"}, {"date": "22 Jul 2014", "title": "Business Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heald College (Salida, CA) in Jul 2010", "Interview Descriptions": "I received a phone call from a staff member to attend an open house at a local conference room at a hotel.  I attended with my resume.  The room was full with over 150 attendees for various positions (Admin, faculty, etc.). We were each asked the same questions (name, position, and why we are here).  This was tedious and took over an hour to complete.\r\n\r\nWe were then divided based on decision to move forward and offered a time to come back for an actual interview/teach-back.  This was scheduled almost a week later (actually less, I believe).  The teach-back and interview was a very smooth process and they communicated very clearly.  The interview was a group interview, however, it was like a circuit where we individually were asked questions by different staff members.\r\n\r\nMost of us received a phone call in a few days on the decision.\r\n\r\nOverall, the interview process was painless and, actually, fun.  For a brand new campus, they were very efficient and organized.", "Interview Questions": "Why do you want to teach college as opposed to any other grade or level and what can you offer students that sets you apart from another candidate?"}, {"date": "26 Sept 2014", "title": "Network Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Heald College in Jul 2010", "Interview Descriptions": "Interview and hiring process was pretty straightforward and laid back, no special comments here. I was a student at first and was hired as a federal work study, which led to my getting the interview to begin with. Positions here are few and far between and I just happened to be in the right place at the right time. The interview was held with the local campus network administrator and the regional IT manager both were very laid back and very easy to talk to.", "Interview Questions": "non really as long as you know your stuff."}, {"date": "25 Sept 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Heald College (Hayward, CA) in May 2010", "Interview Descriptions": "Very professional interview. Felt a connection with my director immediately. \nShe showed me around the campus, I met with some directors, teachers, and the campus president. \nOverall a great interview. I was offered the position before I left the building.", "Interview Questions": "How do you feel networking with employers on a daily basis? This would include occasional site visits as well."}, {"date": "12 Jun 2010", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Heald College (Honolulu, HI) in Jan 2010", "Interview Descriptions": "First interview - Presentation by company to the group.  Tour of facility.  Scheduling of second interview\r\nSecond interview - Interview with manager.  Take assistant manager on tour of facility (as if making presentation to prospective student).\r\nThird interview - Interview with president.\r\nSales position and they make it clear!", "Interview Questions": "How would you handle someone who did not want to enroll?"}, {"date": "16 Jul 2010", "title": "Teaching Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College (Hayward, CA) in Oct 2009", "Interview Descriptions": "The interview was rescheduled at the last moment. I found it extremely uncomfortable. I was disappointed that they did not call me to let me know I didn't get the job, even after I followed up with them.", "Interview Questions": "N/A"}]][[{"date": "8 Apr 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College", "Interview Descriptions": "Very long process, meet multiple people before selection. It is a very through process, I believe I interviewed 5 times before selection took place of course on top of background and reference checks", "Interview Questions": "Can you handle numbers driven environment?"}, {"date": "1 Sept 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heald College (Sacramento, CA)", "Interview Descriptions": "Literally a phone call. At the tie there was only one other criminal justice instructor and they had n applicants.  I had no teaching experience and they hired me in a week and loaded me with two classes. Fortunately I was able to do it and become successful at it.", "Interview Questions": "Standard employment questions, employment background, etc."}, {"date": "28 Aug 2016", "title": "Senior Finance Accountant & Cost Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Heald College (Madera, CA) in Jul 2016", "Interview Descriptions": "A company recruiter contacted me to schedule a phone interview. The interviewer was some regional director, who didn't speak English well and had a tight schedule as he was preparing to fly to Mexico. I also work part-time until I can get hired by someone full-time and tried to schedule any interviews around my part-time job. The interviewer wasn't that accommodating and I had to sit in my car outside of my job in the middle of a hot Fresno summer just to talk to him. I was also scheduled for a face-to-face interview the next day, but that got cancelled because this regional director didn't believe I was a good candidate, based on a phone interview. The situation wasn't very professional on their part, they could have at least allowed me to meet them face-to-face for additional insight from a different person's perspective.", "Interview Questions": "Tell me about yourself."}, {"date": "2 Sept 2015", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heald College", "Interview Descriptions": "The whole process took about 2-3 weeks.  Interviews consisted of meeting with the department manager, the rest of the department employees, and the Campus President.  No major lag times or gaps in communication and they reached out as needed regarding progress or the need for additional information.  They were all professional and cordial and everyone seemed nice.", "Interview Questions": "How do handle rebuttals from students regarding employment, unemployment, and professionalism?"}, {"date": "16 Aug 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 1 week. I interviewed at Heald College (Honolulu, HI)", "Interview Descriptions": "Fill out application and meet with manager on the spot. 2nd interview was scheduled two days later. Immediately after interview start date was given and background initiated. Total process time was about 7 days. They were really quick in hiring.", "Interview Questions": "How soon can you start?"}, {"date": "29 Mar 2015", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Heald College (Sacramento, CA)", "Interview Descriptions": "I was an Adjunct who applied for a Full Time position via the Heald Intranet site. My current supervisor contacted me within a week. I met with the Supervisor to go over my resume and qualifications. Then, I was invited to provide a sample lesson plan to a panel of Instructors/Program Directors/AA Director which lasted about 15 minutes.  They were excellent \"students\" and responded well to my example lesson. I used the White Board and a handout and made sure to engage the panel and elicited feedback/responses from them as if I was teaching students. \r\nI got very nice comments and questions and was offered the position.  It helped that I had been adjunct on another campus with great results and got an excellent  recommendation from my Supervisor there, but I was also qualified for the position and very enthusiastic about providing a great classroom experience and following all company policies and goals. \r\nI was given an offer letter and was started out on a salary dictated by corporate for my level of experience and education.", "Interview Questions": "How would handle a diverse population of students?"}, {"date": "18 Feb 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Heald College", "Interview Descriptions": "I Receieced a phone call and was asked to come in for a group interview. It as only me and 1 other lady. They gave us a tour of heald and gave us some history of the school. Showed us what they offered the students . Then we met with the president and he interviewed us but he didn't really ask us questions he mainly discussed the working environment of the job . Which sounds great they emphasized on how fun and nice they are there . He was nice . He didn't give us an exact description of the job . It was about an hour long total with the tour and he said if we were interested to email him back if we liked what we saw . He said the hours are not a normal 9-5 they are constantly changing. He said they offer medical, dental and I think vision", "Interview Questions": "What do you know about heald college? , what does success mean to you ? What do you like about heald college ?"}, {"date": "22 Feb 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College (Modesto, CA) in Feb 2015", "Interview Descriptions": "The job posting didn't specify the \"crappy\" hours. Don't be SURPRISED! it was a group interview with 15 applicants present. Three step interview process. Lasted about 2 hours. 3 interviews before hired.", "Interview Questions": "40 hour work week. Three nights until 8:30 pm and every other Saturday."}, {"date": "5 Jul 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Heald College (Fresno, CA) in Feb 2015", "Interview Descriptions": "Met with two people, then again with multiple individuals.  A group panel is typically utilized as part of their screening process. Went through a background test and was offered the position.", "Interview Questions": "do you know the difference between empathy and sympathy?"}, {"date": "17 Oct 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College (San Francisco, CA) in Feb 2015", "Interview Descriptions": "30 Min Powerpoint on history of company, followed by a speech about how to \"sell\" the school without sounding like a sales person. Afterwards we chatted among ourselves, and were given the opportunity to leave, or to move forward with the next interview.", "Interview Questions": "What motivates you in life?"}], [{"date": "7 Jan 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Heald College (Portland, OR)", "Interview Descriptions": "The interview process was simple - submit resume, interview with Academic Director, and complete a teaching demonstration. However, the lack of timeliness and correct information on when, where, and what he teaching demonstration was to be made preparations difficult. Also, they did not respond to follow-up phone calls in a timely manner.", "Interview Questions": "Tell us a time when you were faced with a difficult situation. What was the situation, what did you do, and what was the outcome?"}, {"date": "28 Sept 2014", "title": "Student Records Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heald College", "Interview Descriptions": "I applied and received a call from the Registrar himself a week later, met with him later that week. It was simple wanted to know what my strengths were, what I could contribute. Mostly he talked about the department and what he was looking for.", "Interview Questions": "Not difficult, he talked most of the time."}, {"date": "29 Sept 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College", "Interview Descriptions": "The \"interview\" was terrible! I was placed in a room with at least 30 other people and had to sit and go over a 30 minute powerpoint presentation. The whole job is being a telemarketer and they said you have to be prepared to answer 500+ calls a day. All they care about is their numbers and don't really care about the well being of the student. I was expecting something more personal with students and helping them reach their goals. Not having them just be a number for my quota.", "Interview Questions": "Are you prepared to be on the phone all day?"}, {"date": "7 Sept 2014", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College", "Interview Descriptions": "Initial interview with director, then team, campus president, and finally corporate director of career services. Process went really quickly considering all the people to meet with. Processes for other positions are not as easy as career services.", "Interview Questions": "How would you handle a student who is unresponsive to you?"}, {"date": "22 Sept 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 days. I interviewed at Heald College (Salinas, CA) in Aug 2014", "Interview Descriptions": "Applied to Admissions Advisor position online early in the week and received a call the following day regarding my interest in the position. The interview--or group interview--was held the Friday of that same week in the evening. \r\nAs the job description focused on helping students find their career interests and getting them enrolled, I was very much interested. However, this description was misleading. \r\n\r\nDuring the beginning of the group interview, the interviewer was honest and straight forward about the position--it was a sales job. A sales job that would require making 100-200 calls daily to get a lead that may or may not end up with a potentially interested student. \r\n I actually appreciated his honesty very much. It gave me the opportunity to learn what the job entailed and how sales-focused it actually was. \r\nI did not stay for the group-interview portion; I knew I wasn't fit to be in sales. However, if you have sales experience and are good with people on the phone, this may be a job for you. Best of luck to you!", "Interview Questions": "I did not stay for the interview portion."}, {"date": "12 May 2014", "title": "Career Services Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heald College (Fresno, CA)", "Interview Descriptions": "Phone Interview, then face to face with Manager, and then another phone interview with Regional Manager. The Face to Face was the most important if you get past that you are hired.", "Interview Questions": "How would you deal with a student that will not contact you back?"}, {"date": "30 Jun 2014", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Heald College (San Francisco, CA) in May 2014", "Interview Descriptions": "initial communication was for a one-on-one interview, however when I arrived it was a group interview. I didn't mind it once we got going, but it was a little awkward at first.", "Interview Questions": "What makes you \"not\" a good fit for this position?"}, {"date": "6 Feb 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College (San Francisco, CA)", "Interview Descriptions": "They asked me to come in as soon as possible. So I did, the next day.\r\nI was excited. When I got to the interview, they asked me some basic questions about myself and told me a lot about the company, it's mission, it's goal, its vision. \r\nThe interview felt more like they were selling me the job instead of my applying. However, after i was hired, the interviewing process god harder.\r\n\r\nNow: You have an interview with the president of the school or the senior director of admissions, then you can have either one or two interviews with senior admission staff.", "Interview Questions": "Why do you think you are qualified for this position?"}, {"date": "3 Aug 2015", "title": "Medical Assistant Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Heald College in Feb 2014", "Interview Descriptions": "on-line application, heard back from heald in about 2-3 weeks. Next was a test teach, on any subject I choose. Immediately after I got to meet the staff, took a tour\r\nheard back with in a few weeks, its the background check that takes forever!", "Interview Questions": "how did you handle difficut situtations with students"}, {"date": "17 Jan 2014", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Heald College", "Interview Descriptions": "Mini lesson and interview", "Interview Questions": "What are you passionate about? "}], [{"date": "3 Jan 2014", "title": "High School Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Heald College", "Interview Descriptions": "The hiring process is long, and competitive.", "Interview Questions": "How do you handle stress in a stressful situation? \r\nWhat keeps motivating you when you do not feel like working?"}, {"date": "2 Feb 2017", "title": "Instructor, College Or University Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (San Leandro, CA) in Jan 2014", "Interview Descriptions": "I am writing to announce my resignation from Med Center Medical Clinic effective today February 2, 2017. Unfortunately I have lost my child care provider that I had lined up to take care of my 3 month old daughter. The option for an alternative child care provider is not available to me at this time due to where I reside. I would like to thank you and the Med Center Medical Clinic for allowing me to be a part of a dedicated team of health care professionals", "Interview Questions": "How much pay"}, {"date": "25 Nov 2013", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (Concord, CA)", "Interview Descriptions": "Group interview with Director, meet and greet and review of actual job specifics. Heavy sales requirement. Two step interview process, only a few will be called back for individual interview with Director.", "Interview Questions": "After introducing ourselves and background we were asked to pick one person that they should hire, not ourselves, and why."}, {"date": "5 Nov 2013", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Heald College", "Interview Descriptions": "I was called out of the blue after applying to a job posting. The person I spoke with seemed very friendly, and they invited me to an in-person interview.", "Interview Questions": "\"What is your weakness?\""}, {"date": "6 Oct 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Heald College", "Interview Descriptions": "Be prepared to discuss specifics of the subject being taught and to give a teaching demonstration.", "Interview Questions": "How would you handle a distracting student. "}, {"date": "19 Sept 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Heald College", "Interview Descriptions": "Depending on how the hiring manager handles interviews can be the difference. Just be you and bring your A game. You might have a direct or group interview. This will proceed with another interview either or both with piers and middle management. They will make the decision and then a formal approval through upper management's final interview.", "Interview Questions": "Role playing for the postion"}, {"date": "7 Sept 2013", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heald College (Hayward, CA)", "Interview Descriptions": "Interviewed with the Director of Career Services, the Campus President, and finally Corporate Director. It's all about personality and fit", "Interview Questions": "Describe how you would work with challenging students."}, {"date": "27 Mar 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Heald College (San Francisco, CA) in Aug 2013", "Interview Descriptions": "I originally had a brief phone interview and was asked to come in person that same day. Of course that didn't give me enough time to prepare and get ready so I requested for the next day. Went in and met with the Senior Director, Regional Director, the Admissions Director, and then the Senior Director again. I was there for 4 hours. They technically offered me the job on the spot, but made sure I passed the background check to make a formal offer.", "Interview Questions": "Where do you see yourself 5 years from now?"}, {"date": "16 May 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (San Francisco, CA) in Aug 2013", "Interview Descriptions": "They changed the interview process. Now you have to prepare to do a \"mock\" phone call, and pretend you're speaking to a potential student while the interviewer is on the other line. It can be hard especially because this might be your first sales job. Very intimidating", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Jan 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Heald College (Stockton, CA) in Aug 2013", "Interview Descriptions": "I had to apply online and submit my resume and cover letter.  I received a phone call to schedule and interview.  I prepared for the interview and arrived on time.  I interview with a variety of personnel and then received a tour.  After the interview I sent out thank you cards.", "Interview Questions": "How do you handle conflict?  How well do you manage a wide variety of clients?  What is your success in mentoring and coaching, developing a team?"}], [{"date": "28 Mar 2017", "title": "Student Loan Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Heald College (San Francisco, CA) in May 2013", "Interview Descriptions": "simple two week process, contacted by phone for a short 15 minute interview. Invited to a interview within a week, lasted a hour. During interview, Manager really seemed anxious to hire someone right away. She was going on maternity leave. Received a call within 3 days with a job offer. I should have seen the red flag.", "Interview Questions": "What is your proudest accomplishment"}, {"date": "14 Sept 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College (Sacramento, CA) in Apr 2013", "Interview Descriptions": "It w a s   p r e t t y    s t r a i g h t f o r w a r d.", "Interview Questions": "They asked about my previous experience in higher education."}, {"date": "19 Jan 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Heald College", "Interview Descriptions": "The candidate for instructor position requires giving a mock lecture in front of a panel of audience composed of  directors, instructors, staff and students.", "Interview Questions": "What could you give to the students to contribute to their success in the field they have chosen?"}, {"date": "8 Nov 2017", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Heald College (San Francisco, CA) in Jan 2013", "Interview Descriptions": "You are initially interviewed with 20+ other applicants in a room at the same time.  They later eliminate you by groups and only keep the group of people they like to move onto the next interview process.", "Interview Questions": "Why are you here?"}, {"date": "13 Sept 2012", "title": "Addmissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at Heald College (Rancho Cordova, CA)", "Interview Descriptions": "The hiring and interview process went very well. The Admissions Director was very well organized and professional. I was scheduled to come in on a Saturday for an interview to accommadate my busy schedule. Interview was about 30-45 minutes and she immediately gave me an aswer and I was able to give my previous employer a 2 weeks notice and started working 2 weeks later.", "Interview Questions": "What would you do if someone started to enroll but never finished the process"}, {"date": "9 Feb 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Heald College (Milpitas, CA) in Jan 2012", "Interview Descriptions": "I underwent two interviews for the position. The first interview was more of a screening process. Each interested applicant stood up in front of the other applicants and the interviewer and gave a short introduction about him/herself, as well as why he/she wanted to work for Heald College. The second and final interview was much more thorough and lasted about two hours. I was interviewed by two different people at separate times. I received a tentative offer that same week, pending a background check. I received a final offer the following week.", "Interview Questions": "\"You just graduated from college not too long ago and don't have much long-term work experience. Why should we hire you despite this lack of experience?\""}, {"date": "28 Jan 2012", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Heald College (Milpitas, CA) in Sept 2011", "Interview Descriptions": "I initially responded to a job posting online. It was one of those generic electronic applications where you answer questions for what seems like forever. Upon clicking the submit button, it took 1-2 weeks to hear back from anyone. When I finally did get a response, I had a 30-45 minute phone interview, scheduled an in-person interview for the next week, and 1 day before I was to show up, was told by my interviewer (hereinafter cold shoulder) I needed to prepare a 30-minute presentation for a group interview that best reflected my teaching abilities. I completely winged it.\r\n\r\nTwo weeks went by and I heard nothing. I called a couple of times, always getting the run-around from cold shoulder; she acted like she didn't even remember me. Finally, less than a week before the start of a new quarter, cold shoulder offered me the job and stipulated that I had to create a syllabus and lesson plans from scratch for two courses that were never listed on the job announcement or discussed as possible job assignments during the interview or presentation phase. Again, I winged it.\r\n\r\nI was also told I'd get paid $2000 per course, but later discovered that with all the administrative expectations involved to meet compliance, what should have been $22-25 an hour quickly dissipated to $7-8 an hour if you were to ever do the job the way Heald demanded. Again, I winged it.\r\n\r\nThere were plenty of warning signs that I shouldn't have accepted this job. There were also plenty of warning signs that I shouldn't have kept this job either. Suffice to say, I had no reservations about leaving.", "Interview Questions": "If you had a student abruptly act up, how would you respond? "}, {"date": "11 Feb 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Heald College in May 2011", "Interview Descriptions": "Group interview first, then they call back the ones they liked out of the group interview. Some people get interviewed once after that and are offered a position, some have to return multiple times. Just depends on how desperate they are to get someone in there. Background check can be a very time consuming process though. Mine was completely clean and still took weeks to go through.", "Interview Questions": "None too crazy honestly. They are looking more for a personality type and a work ethic than anything."}, {"date": "14 Jun 2015", "title": "Legal Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Heald College (Stockton, CA) in Jan 2011", "Interview Descriptions": "It was a series of three interviews. After that, I met with the campus president. It was more laid back than the prior interviews. I had asked for more money than the position paid. I focused on my experience and ability to teach, and write curriculum. Then I stated that because I took a pay cut to work there and based on my experience as a Judge, it would add prestige to the school and more credibility to the new legal program. He then,agreed to pay me what I was asking. He welcomed me aboard and told me that I could easily move up the company if I wished.", "Interview Questions": "What would you consider to be your biggest strength? What event was the most difficult to handle at a past position and how did you resolve it? What do you think is your weakness and how would you resolve it?"}, {"date": "26 Nov 2010", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Heald College (Hayward, CA) in Aug 2010", "Interview Descriptions": "Multiple interviews with all levels of the organization including a presentation.Poor follow-up after the process.", "Interview Questions": "No hard questions"}], [{"date": "9 Mar 2013", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Heald College in Jul 2010", "Interview Descriptions": "Just a typical sales process interview questions.  They are all about quotas.", "Interview Questions": "N/A"}, {"date": "22 Jul 2014", "title": "Business Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Heald College (Salida, CA) in Jul 2010", "Interview Descriptions": "I received a phone call from a staff member to attend an open house at a local conference room at a hotel.  I attended with my resume.  The room was full with over 150 attendees for various positions (Admin, faculty, etc.). We were each asked the same questions (name, position, and why we are here).  This was tedious and took over an hour to complete.\r\n\r\nWe were then divided based on decision to move forward and offered a time to come back for an actual interview/teach-back.  This was scheduled almost a week later (actually less, I believe).  The teach-back and interview was a very smooth process and they communicated very clearly.  The interview was a group interview, however, it was like a circuit where we individually were asked questions by different staff members.\r\n\r\nMost of us received a phone call in a few days on the decision.\r\n\r\nOverall, the interview process was painless and, actually, fun.  For a brand new campus, they were very efficient and organized.", "Interview Questions": "Why do you want to teach college as opposed to any other grade or level and what can you offer students that sets you apart from another candidate?"}, {"date": "26 Sept 2014", "title": "Network Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Heald College in Jul 2010", "Interview Descriptions": "Interview and hiring process was pretty straightforward and laid back, no special comments here. I was a student at first and was hired as a federal work study, which led to my getting the interview to begin with. Positions here are few and far between and I just happened to be in the right place at the right time. The interview was held with the local campus network administrator and the regional IT manager both were very laid back and very easy to talk to.", "Interview Questions": "non really as long as you know your stuff."}, {"date": "25 Sept 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Heald College (Hayward, CA) in May 2010", "Interview Descriptions": "Very professional interview. Felt a connection with my director immediately. \nShe showed me around the campus, I met with some directors, teachers, and the campus president. \nOverall a great interview. I was offered the position before I left the building.", "Interview Questions": "How do you feel networking with employers on a daily basis? This would include occasional site visits as well."}, {"date": "12 Jun 2010", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Heald College (Honolulu, HI) in Jan 2010", "Interview Descriptions": "First interview - Presentation by company to the group.  Tour of facility.  Scheduling of second interview\r\nSecond interview - Interview with manager.  Take assistant manager on tour of facility (as if making presentation to prospective student).\r\nThird interview - Interview with president.\r\nSales position and they make it clear!", "Interview Questions": "How would you handle someone who did not want to enroll?"}, {"date": "16 Jul 2010", "title": "Teaching Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Heald College (Hayward, CA) in Oct 2009", "Interview Descriptions": "The interview was rescheduled at the last moment. I found it extremely uncomfortable. I was disappointed that they did not call me to let me know I didn't get the job, even after I followed up with them.", "Interview Questions": "N/A"}]]