[[{"date": "18 May 2023", "title": "Section Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "The interview was super easy and quick. They had a decision back very quickly. Not very hard questions. They were just looking for the right skills and personality. The people were very nice.", "Interview Questions": "What experience do you have as a writer?"}, {"date": "27 Feb 2023", "title": "Advising, Admission, & Student Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Utah Valley University (Orem, UT) in Feb 2023", "Interview Descriptions": "Two interviews, took a long time to get back to me about a decision. They were nice, but looking for something very specific that I couldn’t give to the program. Seemed like a good job with benefits.", "Interview Questions": "How did you handle conflict among past coworkers?"}, {"date": "9 Apr 2023", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Utah Valley University (Orem, UT) in Jan 2023", "Interview Descriptions": "met with a 3rd party recruiter. talked about salary expectations and my experience as a pm. it was pretty easy and straightforward but i didn't get a chance to interview with the actual school", "Interview Questions": "what experience do you have as a pm?"}, {"date": "13 Feb 2023", "title": "Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Utah Valley University in Dec 2022", "Interview Descriptions": "The first interview was a panel of 5. There were about 9 questions asked back to back. They called a few days later to set up the second interview. The second interview was with the director and other supervisors. There were about 6 questions asked back to back. Two of the interviewers seemed to be on their phones and not engaged. When I asked questions it didn't seem like they were open for discussion.", "Interview Questions": "What does diversity and inclusion mean to you?"}, {"date": "5 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Utah Valley University (Orem, UT) in May 2022", "Interview Descriptions": "Met over zoom for the Student life and wellness center director position. In person would have been much better.  They asked a few questions but none that felt like they had much to do with the actual position.", "Interview Questions": "Why should they pick me for the job?"}, {"date": "23 Oct 2021", "title": "CFI Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "I turned in an application through their website and a week later I got an email about having a phone interview and I got to talk to them over the phone another week later.\r\nAlthough it was an initial phone interview process, they mostly asked technical questions. The only HR question that was asked was why would I want to work for them.", "Interview Questions": "Why do you want to work for us?"}, {"date": "22 Sept 2021", "title": "Admission Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "It was a group interview with the supervisor and other admission counselors. They each took a turn asking a question for a total of seven to nine questions. At the end of the interview, I needed to do a 5-minute mock presentation in any form I desired.", "Interview Questions": "Describe a time when you disagreed with someone."}, {"date": "4 Feb 2021", "title": "Purchasing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "Worked with direct manager. Simple and easy. They reached out via email and then a phone call. After the interview on the phone there were two in person interviews. Overall it was a simple process.", "Interview Questions": "How are you the most qualified?"}, {"date": "12 Jan 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "-Very professional and down to earth people. \n- I feel they were looking for someone that would jive well with the other advisors. \n- They asked common interviewing questions like: when did you have to tell someone bad news and how did you handle it.", "Interview Questions": "Why do you want to work as a academic advisor?"}, {"date": "8 Nov 2020", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Utah Valley University (Orem, UT) in Dec 2019", "Interview Descriptions": "Very easy, just experience. I was not in town they did a Skype call with me and just few questions and why I want to work for them. What math experiences I have?", "Interview Questions": "Why do I want to be a math tutor"}], [{"date": "5 Oct 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "The interviewer called and set up a time that worked for both of us. Very relaxed and informal. He was very kind and informed me of all the duties that needed to be covered. He also informed me of the benefits I could receive while working there.", "Interview Questions": "What experience do you have with a manual transmission?"}, {"date": "12 Aug 2021", "title": "Staff Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Utah Valley University (Orem, UT) in Aug 2019", "Interview Descriptions": "Long wait, then met in a conference room with three or four people. They took turns asking very basic questions. Very focused on speed and output in this position, as well as interview skills.", "Interview Questions": "What do you think it takes to get to the heart of a story?"}, {"date": "22 Aug 2019", "title": "Content Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Utah Valley University (Provo, UT) in Aug 2019", "Interview Descriptions": "I came into the office for an interview with three people, two of whom were the future team members of the new hire. We sat at a conference table and they took turns asking questions. It lasted about 30 minutes.", "Interview Questions": "How do you listen to someone when you're not really interested in what they're saying (interviewing scenario)?"}, {"date": "12 Aug 2019", "title": "Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Utah Valley University (Orem, UT) in Apr 2019", "Interview Descriptions": "Applied on indeed, got a call for an interview. I was interviewed by a panel, with rotating questions. The questions were all based on how much experience I had working with various systems required for the job. They asked about office 365, OU Campus, troubleshooting procedures, etc. I had little experience with many of the systems, but received an offer anyway.", "Interview Questions": "How much experience do you have managing a website?"}, {"date": "2 Feb 2019", "title": "Admissions Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "They asked me to come prepared with a presentation, one I would use to influence students to come to UVU. There were a lot of people in the board room, they all took turns asking scripted questions.", "Interview Questions": "If you had all the money in the world what would you spend it on?"}, {"date": "12 Jun 2023", "title": "Marketing Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Utah Valley University in Jan 2019", "Interview Descriptions": "Simple but long process. They asked a lot of questions regarding experience and how you felt about certain social issues, which was inappropriate. The process took a long time to get started and advance to the next stage. Ultimately it wasn't for me.", "Interview Questions": "What was your biggest failure?"}, {"date": "9 Jan 2020", "title": "Software Developer I - IT Administrative Programming Svcs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Utah Valley University in Dec 2018", "Interview Descriptions": "I came in for an interview. There were 3 people who asked me questions. It took about 20 minutes. A few days later I received a rejection email that was signed by the \"Chief Inclusion & Diversity Officer Search Committee\" (I'm a white male for the record). I emailed that particular office asking what role they play in UVU's hiring process and they never replied.", "Interview Questions": "They asked what a left-join SQL table was."}, {"date": "29 Jan 2018", "title": "Temporary Floor Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Utah Valley University (Orem, UT) in Dec 2017", "Interview Descriptions": "It was nice. My first interview so I was nervous. They were very formal but I could tell they were great people. So I tried to be myself. I think they found my responses adequate", "Interview Questions": "How have you dealt solving a customer issue in the past?"}, {"date": "6 Dec 2017", "title": "Public Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Utah Valley University (Orem, UT) in Nov 2017", "Interview Descriptions": "Group interview with team of people I would potentially be working with.  I was able to meet each person as they explained their role in the company and as it would pertain to working with me.", "Interview Questions": "Share how my experiences would help make me successful in this new position."}, {"date": "15 Jan 2018", "title": "Floor Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Utah Valley University (Orem, UT) in Nov 2017", "Interview Descriptions": "The hiring and interview process is the easiest I have ever been in. They asked simple questions and the hiring manager was very friendly.  The interview felt like I was having a friendly conversation with my friend. I liked it because it helped me calm down.", "Interview Questions": "Why do you choose to work here? "}], [{"date": "31 Jan 2017", "title": "Assistant Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Utah Valley University", "Interview Descriptions": "The process was quick. I applied and got a phone call from them the next week about setting up an interview. I was interviewed by three people on the marketing and communications team. They got back to me within 2 days. I didn't get the job but I appreciated how quick they were with getting back to me and actually calling me to let me know I didn't get it instead of ghosting me. In the interview, we went through my online portfolio, they took turns asking questions, and I asked a few questions.", "Interview Questions": "What makes you stand out as a graphic designer?"}, {"date": "30 Nov 2021", "title": "Math Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Utah Valley University in Jan 2017", "Interview Descriptions": "very simple interview, basic questions and they wrote down my answers. They also gave me the questions in advance which was nice.  Not much prep was needed. There was a director and an admin present.", "Interview Questions": "Describe your problem solving style. "}, {"date": "15 Apr 2017", "title": "Intramural and Club Sports Assistant Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Utah Valley University (Orem, UT) in Oct 2016", "Interview Descriptions": "I applied on the university website and got a call from them a few weeks later. They scheduled a Skype interview. I had the Skype interview with 3 members of the department. It took awhile to hear back from them after the interview. It was my first interview for a real-life career type job out of college so it was a little intimidating. They didn't tell me ahead of time I'd be talking to 3 people.", "Interview Questions": "What sets you apart from other candidates?"}, {"date": "14 Mar 2017", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Utah Valley University (Orem, UT) in Oct 2016", "Interview Descriptions": "super friendly and simple. HR is very knowledgeable, although slow sometimes. Be ready to make friends during the interview process! UVU is a great place to start your labor experience, the entire school staff makes the process veery simple and fun.", "Interview Questions": "why would you like this position?"}, {"date": "1 Apr 2017", "title": "Business Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Utah Valley University (Orem, UT) in Apr 2016", "Interview Descriptions": "Sat in a room with two directors and two other employees. Fairly casual but wanted to know past experience in my own business endeavors. Each person asked me questions and then I was able to ask any questions I had about the position.", "Interview Questions": "How would you deal with individuals personal feelings while talking about their business. "}, {"date": "31 Mar 2016", "title": "Student Proctor Examiner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Utah Valley University (Orem, UT) in Dec 2015", "Interview Descriptions": "They ask you to come in at a certain time, then deliberately made you wait to see how you would react to waiting for a time period (they told us this later). Bring you into a small room, and two of the managers interview you.", "Interview Questions": "What do you think about cheating?"}, {"date": "20 Oct 2015", "title": "Insturictional Aide/Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Utah Valley University (Orem, UT) in Sept 2015", "Interview Descriptions": "A formal sit down with tutoring instructor in the academic tutoring center offices.  She asked me about my background and had me justify some of my poor grades.  She then asked me why I wanted to be a tutor and what hours I could work.", "Interview Questions": "How would you respond to a student who just wanted the answer"}, {"date": "7 Sept 2015", "title": "Coordintator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Utah Valley University (Orem, UT) in Aug 2015", "Interview Descriptions": "The interview and Human Resources are very well organized.  They treated each interviewee fairly and just.  The questions were scored and were very thorough according to the job description.  The interview was on time and only lasted as long as expected.  The Panel was nice and didn't veer from the questions.", "Interview Questions": "What resources are available to the current students at UVU?"}, {"date": "4 Jul 2015", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Utah Valley University", "Interview Descriptions": "Application filled out in a dingy office building --> One-on-One interview with company manager in office setting where the details of the position were explained and outlined--> Callback if manager thinks you're qualified.", "Interview Questions": "How comfortable are you with cold selling?"}, {"date": "20 Jun 2015", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Utah Valley University (Orem, UT) in Mar 2015", "Interview Descriptions": "First of all, they put in either a YES, Maybe, or NO pile. They are looking for people who exceed the minimum requirements if your application shows this most likely you will be placed in YES or Maybe. \r\n\r\nThe Search Committee is made up by a Search Chair (this person is picked by the Hiring Agent) and at least a a second person and maybe 2 others. \r\n\r\nThe Search Chair submits the best candidates to the Hiring Agent, usually the Hiring Agent stays out of the selection process, but not always. \r\n\r\nIf you are selected for an interview don't be surprised if it take 2-4 weeks to get invited to an interview. The Search Committee is in charge of screening all the applicants and they have other items on their schedule too which is why it may take so long to hear back from them. \r\n\r\nThey there could be a 2nd interview with the actual Hiring Agent. The Hiring Agent would be the one making the final decision. \r\n\r\nThe interview is your chance to gush about how you love students and can't wait to serve them etc.", "Interview Questions": "Why are you the best candidate for this position?"}], [{"date": "5 May 2015", "title": "Academic Advisor Training Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Utah Valley University (Orem, UT) in Mar 2015", "Interview Descriptions": "Uninspiring.  They had unqualified people on the panel which became doubtful that this group knew what it was doing.  Suggested that it was about how popular you could make yourself out to be in order to have more pull as a department.  Suggested politicking was key, even though it wasn't in the job description.", "Interview Questions": "How are you a self-starter?  What sets you apart? What should an advisor know? What do you feel is essential to the job?"}, {"date": "16 Jun 2015", "title": "Zylun Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Utah Valley University (Lehi, UT) in Mar 2015", "Interview Descriptions": "I was interviewed by the CEO of Zylun.  We stated with a brief but engaging conversation before the interview, and then moved into interview. He asked some really good behavioral questions, ones that made me think. He is a great interviewer!  When he was done, we talked a bit more about the job and his timing.  Then he asked me if I had any additional questions for him.  I asked him a couple I had planned on asking, we chatted a bit and we wrapped it up.  If you get to interview with the CEO at Zylun, be prepared, but jut be yourself.  He's a great interviewer!", "Interview Questions": "Tell me about a time you stepped up into a leadership role when you were NOT the team leader.  What made you step up?  How did the group accept it?."}, {"date": "14 Nov 2015", "title": "Web Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Utah Valley University (Orem, UT) in Dec 2014", "Interview Descriptions": "I applied online. I was interviewed and the interviewer put me completely at ease. It was like speaking with a friend. I was greeted warmly, asked a few questions about my resume and that was about it. I was told I interviewed very well. I've done a lot of job interviews.", "Interview Questions": "So, you have an English degree?"}, {"date": "8 Oct 2015", "title": "IT/Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Utah Valley University (Orem, UT) in Dec 2014", "Interview Descriptions": "Received an e-mail a couple of days after I submitted the application. In the e-mail, we specified when and where to meet for an interview. Met with the IT program Manager and his Assistant.", "Interview Questions": "What is the difference between a safe shutdown and a hard shutdown?"}, {"date": "10 Nov 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Utah Valley University", "Interview Descriptions": "I applied online. The application is extremely important and you MUST address all knowledge skills and abilities directly. Provide examples and any prior experience that can back up your claims of having those skills. I recommend you write your explanations in a word document and upload it to the online application. Interviews are committee style interviews, with about 5 or 6 people interviewing you. Questions included: tell us about a conflict you've had at work and how you resolved it, what's your biggest weakness, what will you bring to the team, what sets you apart from other candidates, etc. I also had to prepare a real event plan with a budget and everything. They asked me to write a thank you letter on the spot.", "Interview Questions": "Create an event plan and present it to the interview committee, and write a donor thank you letter on the spot."}, {"date": "22 Jul 2014", "title": "Associate Director Dining Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Utah Valley University (Orem, UT)", "Interview Descriptions": "Group interview process 3 to 5 people all asking questions lasted approxamently 45 min told I would be contacted with in a few days one way or the other. It was three days later a call was made and I was given an offer.", "Interview Questions": "Tell us of a time you didn't get along with your supervisor, what happened and how was it resolved"}, {"date": "12 Jun 2013", "title": "TypeWell Speech-to-Text Transcriber Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Utah Valley University", "Interview Descriptions": "I got a phone call and was asked to take a brief online typing test at typewell.com. Later I was called in for an interview where I was asked about myself, if I was punctual, what I would do if a student complained about a mistake in my transcript.", "Interview Questions": "What would you do if a student insulted you because of a mistake in your transcript?"}, {"date": "16 Jun 2017", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Utah Valley University (Orem, UT) in Feb 2013", "Interview Descriptions": "Very brief interview. She asked very basic questions about me and then offered me the job on the spot. It's not hard work and the employee turnover is pretty high so it's not very difficult.", "Interview Questions": "Why do you want this job?"}, {"date": "14 Oct 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Utah Valley University (Orem, UT) in Jul 2012", "Interview Descriptions": "Utah Valley Universities hiring and interview process is top notch. They are really fair in their questions and respond back to you in a timely manner. It was a pleasant experience.", "Interview Questions": "If you were a kitchen appliance what would you be?"}, {"date": "8 Dec 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Utah Valley University (Orem, UT) in Sept 2011", "Interview Descriptions": "The interview process was not straight forward. I didn't get an interview after i submitted an application until I found someone who personally recommended me to the department chair. Then I got an opportunity for an interview. The questions mostly had to do with what i have written in the interview and how much experience i had and what kind.", "Interview Questions": "What subjects have you taught, on what level, how many years of teaching experience do you have, how familiar are you with certain textbooks and courses."}], [{"date": "30 Apr 2014", "title": "CFI Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Utah Valley University (Provo, UT) in Aug 2010", "Interview Descriptions": "Was hired without interview as I was a very hard working flight student.  These days there are interviews for the CFI position but I know any student who is trained there will be monitored and will be chosen for a CFI position based on performance as a student.  These days I hear it is fairly indepth.", "Interview Questions": "N/A"}, {"date": "26 Jun 2012", "title": "TypeWell Speech-to-Text Transcriber Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Utah Valley University (Orem, UT) in Jul 2010", "Interview Descriptions": "I initially received a phone call and was asked to take a typing test online. I took the test which consisted of typing a paragraph or two of text as quickly as possible to assess WPM. I got a call later to come in for an interview. I was asked about how I would react in certain situations in the class room (if someone stole my computer I was typing on, if the teacher insulted me, if a student just left, etc.) as well as other personal get-to-know-you questions.", "Interview Questions": "How would you handle negative feedback from someone you were providing services for?"}, {"date": "20 Sept 2013", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Utah Valley University (Orem, UT) in Jun 2010", "Interview Descriptions": "Initial communications via the internet. The area head was already familiar with me, my work and my experience, so the intent was to hire me from the beginning", "Interview Questions": "N/A"}, {"date": "25 Feb 2010", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Utah Valley University (Salt Lake City, UT) in Aug 2008", "Interview Descriptions": "You just have to talk one-on-one with a school counselor so they can see if your personality fits in with the program.", "Interview Questions": "Why do you think you are capable? "}, {"date": "12 Dec 2012", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Utah Valley University (Orem, UT) in Apr 2008", "Interview Descriptions": "I check for the position online, applied and just got accepted.", "Interview Questions": "None."}]]