[[{"date": "10 Feb 2023", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "I was interviewed both online and with a few phone conversations. Interviewer asked about previous classroom and research experience. Interviewer asked about graduate school experiences and future plans in academia.", "Interview Questions": "Research and Classroom management, experience in field"}, {"date": "14 Oct 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "Standard interview. Typical interview questions. Situational questions. Interview was about 30 minutes long. Three people interviewed me. Only one interview then received a call a couple weeks later with the offer.", "Interview Questions": "How did you prepare for this interview?"}, {"date": "30 Jul 2022", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Minneapolis, MN)", "Interview Descriptions": "easy interview process\nwith management  group interview is taken place among a candidates of the management teams A series of questions are asked of you and then you complete a individual interview process", "Interview Questions": "tell me about a time \n"}, {"date": "12 Jun 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "The interview took place over the telephone. Multiple team members that I would eventually work with asked several interview questions. There were two rounds of interviews. Basic interview questions about my background were asked during the first round. More job specific questions were asked during the second round.", "Interview Questions": "What can you contribute to our organization?"}, {"date": "28 Mar 2023", "title": "Academic Advisor I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Walden University (Minneapolis, MN) in Jun 2022", "Interview Descriptions": "I was interviewed by a recruiter, he was late to the phone interview by 15 minutes and apologized, we had a 20 minute interview, and then I never heard from them again, even though I thought the interview went well.", "Interview Questions": "Tell me about what you do in your current role."}, {"date": "2 Jul 2022", "title": "Graduate Assistant Writing Center Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Walden University in Jun 2022", "Interview Descriptions": "Super comfortable and simple to access. Login to Microsoft teams and speak with two hiring managers. One is the big boss the other is the reporting manager the role reports to. Both were genuinely kind, interesting, and welcoming. They started off by describing the flow of the interview and highlighted that “it’s just a conversation,” which made me feel even more comfortable. After about 30 minutes to an hour it’s over, and if they like you, you’ll get an email to work through sample response emails. The interview plus the email helps determine if you will be hired or not. If you don’t get an email after the interview it’s safe to say you didn’t get the job.", "Interview Questions": "Why do you want to be a graduate assistant? What experiences have prepared you for this position? How familiar are you with the APA Manual?"}, {"date": "6 Jul 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Walden University (Dallas, TX) in Mar 2022", "Interview Descriptions": "Easy to complete. Very friendly. It was easy to complete. They ask general questions and are nice. They will reach out relatively quickly to schedule a interview. They will also offer the position soon after the interview if you are accepted", "Interview Questions": "General interview questions. Very nice people "}, {"date": "10 Nov 2021", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "Three management interview good at first first.\r\n\r\nWhat is motivation?\r\n\r\nWhat are your goals?\r\n\r\nTell me about time you had to deal with an anger customer? \r\n\r\nGive an example of time you helped a customer ?", "Interview Questions": "Last employer , what are your strength management? "}, {"date": "2 Dec 2021", "title": "Student Success Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Walden University in Nov 2021", "Interview Descriptions": "I had a quick, painless phone screening and then the next day I had an interview with my future supervisor and another gentleman.  The offer came about the middle of the next week.", "Interview Questions": "Why are you interested in working for Walden University?"}, {"date": "1 Dec 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Cleveland, OH) in Nov 2021", "Interview Descriptions": "The interview process was a positive experience! The questions were intense and the interview was a full hour but I was well informed about the university and position. I’m overall very pleased with the process and my experience thus far at Walden!", "Interview Questions": "Tell us about one of your failures and what what was the outcome. This is a great question, one that I had not been asked before. "}], [{"date": "2 Dec 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Walden University (Chicago, IL) in Nov 2021", "Interview Descriptions": "I was reached via phone for the first interview - this is interview not only determined my eligibility, but the Walden recruiter also utilized this opportunity to educate me regarding the University, its processes for hire, its expectations, and the role itself. Moreover, the interviewer made me feel confident and valued throughout the entire process.", "Interview Questions": "How do you deal with a stressful situation, a series of situations, or an entire day?"}, {"date": "1 Nov 2021", "title": "Student Success Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Walden University (Baltimore, MD) in Nov 2021", "Interview Descriptions": "The process was quick and easy. The interview was extremely nice and passoinate.  The interview went smoothly.  She covered all the basics and gave great insight into the company, salary and what will be expected.", "Interview Questions": "Why are you interested in changing jobs?"}, {"date": "1 Dec 2021", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Walden University in Oct 2021", "Interview Descriptions": "The interview process was seamless. It started with a round with HR, then a round with managers, finally a round with the enrollment director. The process lasted around a month in length.", "Interview Questions": "Tell me about a time you overcame an objection."}, {"date": "2 Dec 2021", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Walden University in Oct 2021", "Interview Descriptions": "Interview process is great! Very organized and a great team to talk with, follow ups were quick and professional. There are three different interviews done-HR, manager and director. Scheduling of the interviews were also very flexible!", "Interview Questions": "Do you work well in a fast pace environment? "}, {"date": "29 Sept 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University (Minneapolis, MN)", "Interview Descriptions": "The interviewers were nice. They made it seem like there were multiple levels of interview stages. They were very encouraging of doing well, but never followed up after the second round.", "Interview Questions": "Something challenging you’ve had to work through in a workplace."}, {"date": "19 Apr 2021", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "Two rounds of interviews,  first one was with  hiring staff the second was with two managers. Everyone I talked to was very friendly and informative of the expectations of the position", "Interview Questions": "Name a time where you made a mistake and how did you go about fixing it?"}, {"date": "4 Feb 2022", "title": "Customer Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Walden University (Baltimore, MD) in Apr 2021", "Interview Descriptions": "My recruiter was very knowledgeable, and had great communication. Everything was a breeze! Didn’t have any questions but my recruiter did check in and follow up promptly, Thank you again!", "Interview Questions": "N/A"}, {"date": "28 Jan 2021", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "Typical process -- a phone interview, a hiring manager interview and then a final interview and there was also some conversation with HR.  No assessment or other hoops to jump through.  Everyone was very nice and friendly and the culture seemed to be a very good place to work.", "Interview Questions": "What are your long term goals?  "}, {"date": "20 Jan 2021", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Walden University", "Interview Descriptions": "Easy process. Computer/ Personality Assessment. Phone interview that took like max 30 mins.  asked about previous experience and a couple situational questions. And zoom/video interview with two managers that was around 45 mins.", "Interview Questions": "Describe a time you spoke with a difficult customer and overcame the situation"}, {"date": "6 Dec 2020", "title": "Enrollment Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Walden University (Reno, NV) in Dec 2020", "Interview Descriptions": "First there's a phone interview with talent acquisition, then a teams interview with enrollment managers then an interview with assistant directors. The phone interview is relatively easy  pay attention to how long the enrollment managers and the directors have been in their jobs. It appears people get in those roles and never leave.", "Interview Questions": "Why do you want to work for us?"}], [{"date": "3 Nov 2020", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Walden University in Oct 2020", "Interview Descriptions": "I had a phone interview with the Talent Acquisition Partner in October 2020. The interview went very well and she scheduled me for a second interview with two Enrollment Managers. It was a virtual interview. That interview went well too. I was told by one of the Enrollment Managers that they were hiring for a few Enrollment Specialists positions. I received a decline letter four days later stating that Managers decided to move forward with another candidate. During my virtual interview I was told they were hiring a few Enrollment Specialists.  The next day, after receiving my decline letter, I saw a new job posting on LinkedIn for the same position I was told they filled.\r\n\r\nMy advice to potential Walden University candidates, pay attention the negative reviews on Glassdoor.", "Interview Questions": "Tell us about yourself. Where do you see yourself in three years? What challenges were you faced with in your previous role? What do you think are the three most important things in sales?"}, {"date": "2 Apr 2020", "title": "Writing Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Walden University", "Interview Descriptions": "I applied and received a screening interview request from a Talent Acquisition Specialist about 6 weeks later.\r\n\r\nIt seemed like my interviewer was unfamiliar with the position for which I was interviewing: she repeatedly called it by a different name and, when she did ask questions, they were vague and revealed little about my relevant experience. There were few follow-up questions or attempts to dig deeper into my background or skills (very little talk about my teaching experience, for example). I eventually had to verify we were even talking about the same job opening because the conversation felt so tangential.\r\n\r\nIn short, we spent much more time ruminating on Walden as an institution than on the job, my qualifications, or my experience. I left with a fuzzier understanding of the position and didn't understand what my interviewer was looking for.", "Interview Questions": "What do you already know about Walden?"}, {"date": "4 Sept 2020", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (San Antonio, TX) in Aug 2019", "Interview Descriptions": "Standard Interview Questions. It felt very inviting and comfortable. I did not really understand the position until I started the job. You must ask specific questions. I do not have more to add but I have to write at least 30 words.", "Interview Questions": "N/A"}, {"date": "11 May 2019", "title": "Doctoral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University", "Interview Descriptions": "Initial interview was by phone with a corporate recruiter, second interview was in-person at the local office with two managers. The conversation was about an hour long. It would be a good idea to be prepared to answer questions both on advocacy of the student and encouraging the student to take ownership of consequences.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "15 Jun 2022", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University (Columbia, MD) in May 2019", "Interview Descriptions": "Interview process was great. They were looking for someone who loved to talk and connect with other students. They were upfront with what they were looking for and what you could bring to the table.", "Interview Questions": "How do you get prospective students to enroll into school. "}, {"date": "16 Feb 2019", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Walden University (Baltimore, MD) in Feb 2019", "Interview Descriptions": "Phone Interview  I have to talk the interviewer about myself. She asked questions regarding my work experience as it relates to the position. Over all a pretty straight forward interview. Didn’t drill me with a million question.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Mar 2019", "title": "Contributing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Walden University (New York, NY) in Feb 2019", "Interview Descriptions": "Questions about interests and possible contributions. I was educated on history of  institution which some facts that I found was surprising and impressive. I was informed of mission of organization. Interview was conducted online. I was told about the expectations of faculty.", "Interview Questions": "How do you deal with difficult student's behavior? How do you resolve issues of student's inappropriate responses online?"}, {"date": "8 Nov 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Walden University", "Interview Descriptions": "Short, 20 min. phone call. Generic questions about ability to react in difficult situations, strengths, problem resolution, the typical interview questions. She was pretty willing to yes me to death and didn't seem to expect much, as I had little relevant experience to the position. Then again it was a temporary position.", "Interview Questions": "Name a difficult situation at your job."}, {"date": "6 Nov 2018", "title": "Course Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Walden University", "Interview Descriptions": "There was a phone interview with two coordinators. The interview lasted about 30 minutes. It was clear they had my resume in front of them. The interview was more conversational than question and answer.", "Interview Questions": "What is your philosophy regarding how to be successful as an adult learner in an online environment?"}, {"date": "9 Oct 2018", "title": "Contributing Faculty PT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Walden University (Minneapolis, MN) in Sept 2018", "Interview Descriptions": "The interview was open, the supervisor was personable, and made me feel comfortable. Non biased open ended questions. didn't feel pressured, it was done a Skype video call.  dressed appropriately fro the interview.", "Interview Questions": "what  is 1 thing about your self would you change"}], [{"date": "18 Jul 2018", "title": "Field Education Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Minneapolis, MN) in Jul 2018", "Interview Descriptions": "Applied online and was emailed 2 days later by HR asking to schedule a phone screening interview. The phone interview was very basic and only lasted about 10 minutes. At the end of the call, the HR rep said that she would like to move forward to schedule an in person interview. I emailed a few days and times that I was available and the in person panel interview was scheduled for 1 week later.\n\nThey scheduled two separate interviews. One interview was with two managers in the department for an hour and a half and the second interview was with the director of the department for 30 minutes. The interview went great and everyone was very friendly and respectful. I was told that I would hear back with a decision the next week. I didn’t hear back from HR like MPS office said I would so I followed up and they continued to keep pushing the decision date further back. After a couple of emails following up with the HR rep, I finally found out nearly 2 weeks later that they chose another candidate.  \n\nThe MSP communication was great, but I wish the HR department would have been more responsive and at least updated me with a short recap of why an offer or rejection wasn’t made yet.", "Interview Questions": "What is an example of you going above and beyond for a client?"}, {"date": "18 Jan 2018", "title": "Associate Field Education Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Minneapolis, MN) in Oct 2017", "Interview Descriptions": "I applied for a different position and this one was suggested as I don't have a Masters degree. I had a telephone interview and then went in for a panel interview. I want to say that Walden University still seems like a good environment to work in. One of the interviewers made the comment, \"At least you got to see downtown (Minneapolis).\" just as I was leaving. That comment made it clear that a decision has already been made and every single person I have run that comment by for a different perspective responded with a combination of shock and disgust. That is not something that you should say at any time during an interview. Some people have chalked it up to 'Minnesota Nice' but I think it was actually Minnesota Rude. It gave me the impression that I was interviewing at a place that was not so professional after all. I really enjoy my current job and the professionals who I work with. I'm haunted by that comment and if anyone from Walden who conducts interviews is reading this, please learn from that interviewer's mistake. You can close the interview by saying \"Thank you for your time today.\" or \"We'll be in contact with you about a decision soon.\" or you can say absolutely nothing at all if a comment like that is all that comes to mind. It left such a bad impression with me that I don't even consider their graduate programs. I'm considering the University of Minnesota instead.", "Interview Questions": "Tell us about yourself. "}, {"date": "26 Aug 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University (Orlando, FL)", "Interview Descriptions": "Relatively simple process. They seemed to have a very large number of forms, some of which needed to be notarized, but other than this, the application was okay. The interview took place on the phone and was not too difficult.", "Interview Questions": "If I was interested in chairing doctoral committees."}, {"date": "1 Aug 2017", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University (Phoenix, AZ)", "Interview Descriptions": "It was truly a great experience. The managers were respectful and also respectful of my time. They did not ask trick questions. They were a le to joke around a bit which was nice. They seemed very comfortable. Did not bring their laptops into the room (again...respectful).", "Interview Questions": "N/A"}, {"date": "6 Jun 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Walden University (Columbia, MD) in Jun 2017", "Interview Descriptions": "I felt as though they didn't like how much education I have because they joked about it. I didn't answer one or two questions with answers they felt are appropriate because I didn't answer them immediately either. Every university is different and has different processes.", "Interview Questions": "How did you handle issues with employees concerns at previous employment with for-profit controversy years ago?"}, {"date": "29 Mar 2017", "title": "Temporary Field Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Walden University (Minneapolis, MN) in Oct 2016", "Interview Descriptions": "I obtained the interview through a staffing agency.  My interview was very plesant.  The managers are fun and approachable. The director of the program is caring and considerate of others.  I enjoyed it.", "Interview Questions": "How would you handle an escalated customer?"}, {"date": "27 Jun 2019", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Tempe, AZ) in Jun 2016", "Interview Descriptions": "First there is a phone interview,  which is pretty basic. Then, the in person interview is usually with 2 managers and they ask questions about how you handle challenges and if you can give examples of how you overcame the challenges.", "Interview Questions": "They use the STAR model to ask questions "}, {"date": "13 Aug 2020", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University (Columbia, MD) in May 2016", "Interview Descriptions": "Rapid interviews (people waiting in hall for you to finish). Really have to sell yourself (because you will be selling people on the phone to apply). Several people in interview with you.", "Interview Questions": "Talk about past experiences, strengths, weakness, showcase selling skills. "}, {"date": "1 Jun 2016", "title": "Student Mentor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Walden University (Salt Lake City, UT) in Apr 2016", "Interview Descriptions": "Received a call the next day after completing the online application to schedule an interview.  They send you a link and you schedule a time that is convenient for you and you can also change it online if needed.  You get an email confirmation of the change. \r\n\r\nWhat turned me off is it was clear the screener did not review my resume prior to calling me.  They are a little sensitive about not listing your salary history on the application.  To me, unless you are working in nursing education now your salary history is irrelevant if your job is currently clinical.  I have filled out many applications for jobs that requested the same information, never disclosed it, and never had anyone to question it. \r\n\r\nIt sounded like they send you a special phone to use at your home so they can monitor the amount of time you spend with students.  When you have an MSN, we are all professionals and monitoring phone calls is something you do at a call center not with other professional nurses.  I researched this and apparently you only get \"credit\" for the call if the student calls you from the number the university has on file. If they call you from a different number you don't get credit for the call...yet you completed work.  To me, it would reveal itself quickly if you were not doing your job.\r\n\r\nShe said she wanted to move me to the next step and scheduled a second interview and we settled on a time.  She said I would receive an email confirmation. Nothing came by email.  I figured they changed their mind.  On the day of the second interview I realized I had a missed call from Utah.  So apparently it was scheduled and I wasn't notified.  I had decided before then that I did not want the job due to negative reviews, so that is why I didn't return the call.", "Interview Questions": "Q.  Why do you want to come and work for Walden University?"}, {"date": "23 May 2017", "title": "Temp AFEC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Walden University (Minneapolis, MN) in Mar 2016", "Interview Descriptions": "Contacted by recruiter, interviewed the next day and was hired when I got hjome from the interview. Short interview, normal q and a session. The interview was mostly behavior based questions.", "Interview Questions": "What was a time you failed and how did you fix it?"}], [{"date": "21 Jul 2015", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walden University", "Interview Descriptions": "I had a very short phone interview, about 7 minutes. Never heard back after, therefore emailed them two weeks later to ask about my application status. They could be nice enough to at least email me back and tell me we do not want to continue hiring process with you. I had a phone interview a month ago, and they did not even answer my email.  I think such ignoring is very rude.", "Interview Questions": "What were my problem-solving skills"}, {"date": "18 Apr 2015", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Walden University (Los Angeles, CA)", "Interview Descriptions": "Pretty Typical. Their HR department actually found my resume online and contacted me. I had a phone interview, then 3 same day in person interviews. The interview questions were pretty typical for a sales position.", "Interview Questions": "Why do I want the position?"}, {"date": "13 Nov 2015", "title": "Core Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Seattle, WA) in Jan 2015", "Interview Descriptions": "It was over the phone and there were multiple interviewers. The questions were fair and the questions were what you would expect. It took approximately 45 minutes. The questions were what was expected.", "Interview Questions": "Research experience?"}, {"date": "8 Jul 2015", "title": "Contributing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Walden University (Minneapolis, MN) in Jan 2015", "Interview Descriptions": "Applied online, contacted through email. A phone interview was set up with lead faculty.  She asked several questions about my experience teaching online. The entire interview lasted about one hour. She explained the position and asked which classes I would like to teach. She also discussed how many students I could expect in the class as well as instructor requirements.", "Interview Questions": "How do you stay organized to complete all of your tasks for the day?"}, {"date": "12 Nov 2014", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Walden University", "Interview Descriptions": "Don't respond to emails or calls in a timely manner. Very laid back. Ask situation questions. They will hire anyone if you interview well regardless of your background. All you have to say is you have experience building rapport and a team player.", "Interview Questions": "They were all easy questions "}, {"date": "20 May 2018", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Walden University (Baltimore, MD) in Sept 2014", "Interview Descriptions": "Met with 5 different people who each had a list of questions that focuses mainly on undercovering behaviors. They each had a list of questions. They then took me out to lunch", "Interview Questions": "Behavioral questions "}, {"date": "21 Nov 2014", "title": "Enrollment Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Walden University in Sept 2014", "Interview Descriptions": "1 week. Had a 30 minute phone interview and set up a face to face interview a few days later. The interview was a 3 person panel and I thought it went while. Five days later I called and was told they loved me but feel I am a better fit for a different position in their company. They told me to apply, which I did but they never called me back.", "Interview Questions": "no question was difficult"}, {"date": "15 Oct 2016", "title": "Contributing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Walden University (Telephone, TX) in Aug 2014", "Interview Descriptions": "It took several weeks before I was called for an interview. I had a phone interview with program director was easy, personable, positive. We discussed the program and my teaching experience and interests, as well as training requirements. I was hired during the call and started training within a couple of weeks.", "Interview Questions": "Experience with online learning?"}, {"date": "7 Sept 2015", "title": "Fullt Time Student for A Year Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Walden University (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "This was over the phone and easy with the recruiter. This was over the phone and easy with the recruiter. I did have to re-apply after returning from deployment from Iraq. This was very annoying. The school's counselor told me that I would have to drop out and re-apply. Then, after returned, I learned that there was indeed a way to put my program on hold.", "Interview Questions": "Why did I want to be there. This was a good open ended question. Why did I want to be there. This was a good open ended question."}, {"date": "3 Jun 2016", "title": "Contributing Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Walden University (Baltimore, MD) in Aug 2012", "Interview Descriptions": "My interview with the human resources professional and the program director went well.  I was asked the pertinent questions about how my skill set fit the position. I was also asked if I would agree to sit on the dissertation committees of those students who need help with my particular area of practice.", "Interview Questions": "What courses have you taught in this field?"}], [{"date": "14 Feb 2016", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Walden University (Los Angeles, CA) in May 2012", "Interview Descriptions": "You are interview by several managers and they will determine if you meet the needs of the organization.  If you skills and background match their current job opening you will have a great chance for hire.", "Interview Questions": "Why would you like to work for this organisation?"}, {"date": "8 Sept 2014", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Walden University in Dec 2011", "Interview Descriptions": "Your first interview is a phone interview with the Human Resources department and they just ask you basic knowledge of the company and your exprience.\r\nYour second interview is with the Enrollment Managers and they ask scenario based questions as well as questions to get to know you.", "Interview Questions": "The questions were pretty general, just know background information and be ready to explain how you would handle different situations."}, {"date": "21 Aug 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Walden University (Columbia, MD) in Oct 2011", "Interview Descriptions": "Each applicant is interviewed by two managers from the department they are applying to. My interview was conducted over the phone as I was not yet living in the state of the open position. I was pleased that both managers were willing to interview me over the phone and did not require an in-person interview prior to offering me the position.", "Interview Questions": "Tell us about a time when you had an issue and how you solved it"}, {"date": "20 Mar 2015", "title": "Self-directed Course Salary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Walden University (Baltimore, MD) in May 2011", "Interview Descriptions": "Online application, phone interview with HR person to vett my experience and fit for the position, interview with program director by phone, successful completion of training, post training interview, performance with teaching first class.", "Interview Questions": "How long teaching\r\nTeaching philosophy\r\nExperience with online teaching\r\nExperience with doctoral student mentoring"}, {"date": "17 Jun 2010", "title": "Enrollment Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Walden University (Phoenix, AZ) in Jun 2010", "Interview Descriptions": "I was called by HR and interviewed over the phone.  Next I was asked by HR to come in for an interview.", "Interview Questions": "Tell us about yourself?"}, {"date": "27 Feb 2012", "title": "EA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Walden University (Columbia, MD) in Mar 2010", "Interview Descriptions": "There was an open house for all interested candidates to come in on the same day.  This open house is by invitation only, once you pass the initial phone screen with the HR person.  When you come in, you'll intially meet with the human resources lady.  You'll then meet with (2) Managers in a different room.  Then you may meet with one additional person, pending the outcome of the first few rounds.  IF they like you, you will be asked to complete a background form", "Interview Questions": "Describe your experience with cold calling and a time where you had to overcome objections.  How did you handle them?"}, {"date": "20 Nov 2013", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walden University (Minneapolis, MN) in Sept 2009", "Interview Descriptions": "Initial communication with Laureate (parent company) hiring staff was positive. They were very informative and helpful. Then proceeded to interview with college academic leadership and a number of faculty members. All were collegial and positive. Interview questions were challenging - be prepared to come up with experiences from your background to illustrate points. Then final interview with college associate dean was very pleasant!", "Interview Questions": "The most difficult question had to do with assessment, and this does not mean grading. Assessment as a function of fulfilling college mission and goals and achieving positive learning outcomes for students."}, {"date": "29 Sept 2012", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Walden University (Baltimore, MD) in Dec 2008", "Interview Descriptions": "There was a brief telephone interview. I called Walden and managed to get through to Human Resources through an employee slip up. I submitted my resume online but through conversation I realized it had never been reviewed. I managed to get an interview...the day after Christmas.", "Interview Questions": "I was very prepared for the interview and expected it to be difficult but it wasn't. The interviewers were very lax and I don't remember a challenging question."}]]