[[{"date": "30 May 2023", "title": "Content Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Impact Guru (Mumbai) in May 2023", "Interview Descriptions": "The interview process was good, atleast for the first couple of rounds. They started of with HR round, followed by assessment, then the technical round and final one with the \"Founder\" of the company. All the rounds were fine, except the one with the Founder. This so called founder was so full of herself and arrogant. She said and i quote \"While this is a fund raising org, we're also profit making business, and we are not doing social service here. We want people who're flexible and can hustle\". While there is nothing wrong in making profit and like she said they're running a business here. I had to do my bit of research too. Which brought me to glassdoor, to do a research on company work ethics. The total negative review sums up the state of the company. While she did mention they have strict clock-in time, when i asked her about the clock-out time, her reply was \"This is a fast-paced environment and i can't guarantee that\". As an employee who has worked over the years, it's important to realise, this is just business for them and you can be replaced anytime. When i asked her about the Glassdoor reviews, she said \"I don't care what the former employees say about us, you should go look at the Google reviews, the people who left, it was their problem\". This Founder like mentioned in the Glassdoor review is exactly a micromanaging person who like to get involved in tiniest of the matters and acts arrogant if expected equal value and opportunity. If you're thinking of giving an interview here, make sure to go through Glassdoors and make an informed choice.", "Interview Questions": "Q1 - Why do you want to join IG? Q2 - What do you look for while writing a copy? Q3 - How flexible are you when it comes to writing?"}, {"date": "30 Jun 2023", "title": "Quality Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Impact Guru (Mumbai) in Jun 2023", "Interview Descriptions": "1st Technical rounds taken by team member and 2nd technical round taken by the Manager and there is 3rd round also in which CPO takes for your business understanding and also check your product knowledge", "Interview Questions": "Project related real time quetion"}, {"date": "29 Mar 2023", "title": "Business Management Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Impact Guru (New Delhi) in Mar 2023", "Interview Descriptions": "I was called for an offline face 2 face interview and was told that the interview process will be from 11 to 1 and we are expected before 15 mins to 11, I reached at 10:35,  I was called for the interview at 11:20 Akshay asked me some basic questions as take me through your CV and then he asked me to show my past work which It took me by shock as I was not prepared for that and as it took me time to search for my past work, the interviewer Akshay asked me to do a assignment where Power BI is used. There were 4 Basic Excel questions, 4 Pivot table questions,2 Power BI questions and 3 Go to Market questions and this was sent to me at 11:35 and I was surprised how to complete all this before 1. Long story short I could complete all questions by 3:15 including lunch break and waiting outside the office to be called inside. I informed HR Neha about my completion of the assignment she told me 5 mins and there would be an interview after review of the assignment by that time it was already 6 hours. At 4:10 I informed her about my other commitments at 6 and my need to leave by 4:30 at 4:20 I told her that I can't wait anymore. At 4:20 me and another interviewee were relieved by hr and were told that our review will be given by mail or call. My only concern here is if there was a lengthy assignment and the interview was supposed to be based on why not the assignments given before and if they liked it the further process could have been done offline it would have saved so much energy and time for both the parties. The time waste which was done and the misinformation or no information about the time commitment required. After this experience I personally was not going to go ahead with the job because if someone can't respect their commitment and make others wait I don't think I can learn much from them.  Also the role demands sometimes extended working hours and work on weekends.", "Interview Questions": "Take me through your CV"}, {"date": "13 Apr 2023", "title": "Business Development Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Impact Guru (Mumbai)", "Interview Descriptions": "Fast interview process, clear dates shared. No rescheduling. Interviewed for 1 round with mgr. Interview went for 30 mins. Standard policies shared after selection by HR. Result shared within 1 week approximately.", "Interview Questions": "Where do you see yourself in 5 years? Take me through your CV? Why Impactguru?"}, {"date": "27 Mar 2023", "title": "PHP Laravel Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Impact Guru in Mar 2023", "Interview Descriptions": "Had 3 round of interview 2 technical and 1 non technical. my interview went average even though the questions weren't that hard. The HR and interviewers were very nice and easy to talk.", "Interview Questions": "Explain some of the OOPs concepts"}, {"date": "31 Jan 2023", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Impact Guru (Kharghar) in Jan 2023", "Interview Descriptions": "one on one interview half a dozen questions relating to the job description if you clear it then you move on to another interview with one or more than one head of the company", "Interview Questions": "where do you see yourself in five years"}, {"date": "21 Dec 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Impact Guru", "Interview Descriptions": "It was a good and positive overall experience. I will recommend it to others. Human resource is supportive and smooth process and offer letter given. Onboarding was smooth over all work culture is good", "Interview Questions": "Describe your journey as a PM? Your task"}, {"date": "29 Nov 2022", "title": "Frontend Developer ReactJS Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Impact Guru (Mumbai) in Oct 2022", "Interview Descriptions": "The interview was scheduled in 3 rounds, the interview went well, except the HR round. I had already informed my expected salary to be 50% hike, but after clearing every round, the HR suggested to give max 10% hike, including signing bonus of 10K, and worst of all, they would want upfront contract signed stating, \"you would pay 1Lac, if not joined after serving notice period at your current company\" and for the contract sign, they want you to visit the office. I declined the offer, and I got 100% raise from an MNC.", "Interview Questions": "1:- The first round was telephonic, questions were basics on react, and es6 concepts. 2:- Technical Round, a logical question was given, and again verbal questions were asked on React. 3:- The HR Round/Management Round,"}, {"date": "4 Nov 2022", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Impact Guru", "Interview Descriptions": "It was a good process, was done remotely and smoothly. Included questions on aptitude logic etc. There was clarity on what work i would do. Was also given tasks to complete.", "Interview Questions": "Questions on Industry analysis were asked"}, {"date": "24 Jun 2023", "title": "Business Management Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Impact Guru (Mumbai) in Jun 2022", "Interview Descriptions": "Once your interview is done & you are shortlisted, hiring process is fast and you can discuss in detail regarding the compensation with HR You can also discuss regarding the work culture & facilities provided for better understanding", "Interview Questions": "Why should we hire you & which skills of you do you think will help this organization to grow?"}], [{"date": "1 Jun 2022", "title": "Business Development Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Impact Guru (New Delhi) in May 2022", "Interview Descriptions": "total 4 rounds interview, 3 rounds web meeting, 1 round face to face.\n\noverall the interview was good, but in the salary discussion they didn't offer more than 30k per month. \n\ni was getting past company 40k,  now this company offered 30k. \n\ndon't waste your time.", "Interview Questions": "JD AND PAST EMPLOYMENT EXPERIENCE"}, {"date": "9 Apr 2022", "title": "React Js Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Impact Guru (Mumbai) in Mar 2022", "Interview Descriptions": "Interview was taken on google meet. And was asked to write some basic css code. And basic react questions. Also asked to explain previous projects.  Also to share the links of the projects.", "Interview Questions": "What are React lifecycle methods? "}, {"date": "2 Feb 2022", "title": "Business Development Associate (BDA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Impact Guru", "Interview Descriptions": "Quite an Interactive Interview. Questions were almost Centric to the CV and why do you want the job in this profile. Also, Some Questions were on why Social Sector and why not something else.", "Interview Questions": "why Social Sector and why not something else?"}, {"date": "10 Feb 2022", "title": "Associate Product Strategist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Impact Guru in Feb 2022", "Interview Descriptions": "(1) Telephonic Screening : Candidates are screened\r\n(2) PM Round 1 interview: Candidates interviews with current PM.\r\n(3) VP Product interview round: Candidates interviews with VP of Product.\r\n(4) Assignment to check analytical knowledge: Candidates are expected to complete an analytical assignment\r\n(5) Salary negotiation.", "Interview Questions": "(1) Prior experience ?\r\n(2) Familiarity with Product trends and tools?\r\n(3) Previous instances where the performance of website was directly affected due to my effort.\r\n"}, {"date": "13 Dec 2021", "title": "AM TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Impact Guru", "Interview Descriptions": "Smooth and nice. They were polite and humble. Good environment. All young people. There were 3 rounds and were checking on all experiences details and explaining about the role and responsibilities.", "Interview Questions": "Relevant Experience and references. Last drawn CTC"}, {"date": "6 Nov 2022", "title": "Business Developer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Impact Guru (Mumbai) in Dec 2021", "Interview Descriptions": "tell me about yourself and situational questions were asked with some basic questions from the resume and past experience with any company. it was an easy interview process from my point of view.", "Interview Questions": "tell me about yourself and situational questions were asked with some basic questions from the resume and past experience with any company."}, {"date": "26 Oct 2021", "title": "Business Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Impact Guru", "Interview Descriptions": "There are two interview rounds for BDA role first one is a group discussion round and the second one is a personal interview round. The whole interview process was very smooth.", "Interview Questions": "Simple questions were asked like about yourself , situation based questions etc"}, {"date": "2 Jul 2021", "title": "Social Media Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Impact Guru", "Interview Descriptions": "First they called for social media marketing and they they wanted me to do at least 30 call a day. And the told me first I will get 2nd and 4th Saturday off and later they said only once a week off.", "Interview Questions": "They don't ask much questions they made me do a assignment and they didn't respond back after that."}, {"date": "19 Jun 2021", "title": "Big Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Impact Guru (Mumbai) in Jun 2021", "Interview Descriptions": "Worst process, HR gave me company website to scrap, and scheduled round with one of company employee. \r\n\r\nIn an interview he didn't asked single question on code which I have written or no question as Data Engineer. He only asked networking concepts and one query at end (second highest salary). Interviewer has no stable internet connection, he dropped multiple times because of not having stable internet connection. Interview was only about 10-15 min.\r\n\r\nAt the end i got mail from HR that i was not shortlisted.\r\n\r\nOne of the worst interview I had faced.", "Interview Questions": "How to scrap website if your IP is blocked"}, {"date": "17 Jan 2023", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Impact Guru (Mumbai) in May 2021", "Interview Descriptions": "Three rounds of interview which includes first 2 technical and last is managerial round . Also they asked small small program . Concepts of Oops . Basic MySQL questions , laravel and logical questions", "Interview Questions": "Logical, OOPs , laravel, MySQL"}], [{"date": "23 Dec 2021", "title": "Investor Relations Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Impact Guru (Mumbai) in Apr 2021", "Interview Descriptions": "The team was very responsive and interactive during the whole process. The HR provided amazing support during the whole process. The salary was below the industry standards and the company not flexible with negotiations.", "Interview Questions": "Basic questions to understand the financial sanity."}, {"date": "20 Jan 2021", "title": "Management Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Impact Guru", "Interview Descriptions": "Company came for campus placement. First, student were short listed based on resume. Placement talk was scheduled for shortlisted candidates. \r\nGroup discussion among shortlisted candidates. \r\n2 round of personal interview.\r\nWhole process took one day.", "Interview Questions": "What inspires you to work with us?\r\nWhy you want to do social work? "}, {"date": "18 Jan 2021", "title": "Digital Marketing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Impact Guru (Mumbai) in Jan 2021", "Interview Descriptions": "During the telephonic screening, the recruiter asked me a couple of questions along with my salary expectations. It was so unprofessional bizarre on the recruiter to bring my personal relationship into the conversation to negotiate my CTC just because I am married and my husband resides in the same city I am about to move in. \r\nIt is most illogical interview I have ever been across.", "Interview Questions": "Profile walk-through and salary expectations"}, {"date": "28 Sept 2021", "title": "Business Development Associate (BDA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Impact Guru (Patna, Bihar) in Dec 2020", "Interview Descriptions": "Multiple rounds including technical and HR. \nHeavy checking on culture fit and sales fit. \nEasy to crack. Practical problem based scenarios were given.\nParticipated in campus interview. includes aptitude test. Smooth process.", "Interview Questions": "Tell me something about yourself."}, {"date": "8 May 2021", "title": "Business Development Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Impact Guru (Hyderābād) in Dec 2020", "Interview Descriptions": "There was an GD and two rounds of interview. GD was not a regular one. We have to discuss how much you want to donate for 4 different patients.", "Interview Questions": "Make an act such that you are dealing with a patient relative and you have to convince him to enroll in impact Guru"}, {"date": "11 Apr 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Impact Guru (Mumbai) in Jan 2020", "Interview Descriptions": "Two stage process. First stage was related to the position and tasks one would need to perform and related responsibilities. The second stage included HR questions and a little more explanation from the interviewer's side about what the company does", "Interview Questions": "HR questions were asked mostly. And the job and position was explained. "}, {"date": "19 Oct 2019", "title": "Front End Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Impact Guru (Andheri) in Oct 2019", "Interview Descriptions": "I got a call from impact guru HR. There were total 3 rounds at same day.\n1st round was technical test which consists of 3 programming questions (1 on JavaScript and 2 on React js).\n2nd round was technical interview based on my technical test.\n3rd round was managerial round.\nAfter that they asked to do me 1 more assignment to integrate Rest API.\noverall experience of interview process was good.", "Interview Questions": "interview was based on past experience and work"}, {"date": "24 Dec 2018", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Impact Guru", "Interview Descriptions": "They asked me questions regarding my interest in the field, my likes and dislikes when it came to different types of content, my willingness to work dynamically, my level of initiative and how proactive I usually. They also gave me two tasks to work with, the replies were prompt and fast. They were quite friendly too and I didn't feel like I was being grilled in the process.", "Interview Questions": "Why do you want to work here? Where do you see yourself in 5 years?  "}, {"date": "17 Jan 2021", "title": "HR-Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Impact Guru (Marol) in Oct 2018", "Interview Descriptions": "The process was a pathetic one. I received a call in the morning at 10:30 AM for an interview and they told me it's an urgent opening and they're looking for an immediate joining and asked me to come to their office at 2 PM the same day. The CEO had a very rude approach. I didn't get any response after the interview.", "Interview Questions": "Tell me about yourself\r\nWhich job portals do you know"}, {"date": "4 Jun 2018", "title": "SEO Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Impact Guru (Mumbai)", "Interview Descriptions": "In first round of interview with CMO Dheeraj Bansal answered his all questions related to seo and also explained current issues status of his website where is lacking in seo, how we can improve each n everything explained well then he asked me to make a site report and seo plan of 3 months for impactguru and meet me after 2 days. \nAfter 2 days i had interview with ceo and after asked basic questions he said will call you and let you know.\nGood thing is they started making changes in seo according to my report/assignment.\nBad thing is I still not received any call from  hr.\n\nGood job team\n\nHow campaigners will trust you impactguru for crowdfunding ?", "Interview Questions": "All About SEO"}], [{"date": "19 Jul 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Impact Guru (Mumbai) in Jan 2017", "Interview Descriptions": "They don't know what to ask. They just hire you and fire you may be in few days they are making fool to anyone fake company  i can say", "Interview Questions": "N/A"}, {"date": "22 Sept 2017", "title": "Product Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Impact Guru in Oct 2016", "Interview Descriptions": "I interviewed for a full time product manager via iimjobs. There was a case study for which I worked very hard, followed by multiple telephonic rounds, all of which went good. However, after being selected, they offered me a consultancy role instead of full time. Moreover the offer letter stated just 6 paid leaves and 6 sick leaves annually, which is in violation of the labour laws of India, I think. There was no correction made on these fronts even after requesting the CEO. Doesn't look like they respect or care about their employees at all. Hence, I declined.", "Interview Questions": "Prepare a comparison between impact guru and its competitors with respect to product UX"}, {"date": "4 Jan 2018", "title": "Digital Media Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Impact Guru (Mumbai) in Mar 2016", "Interview Descriptions": "It was good since it was based only on my CV and also tested knowledge required for the job and since there were two parts to the interview it was extremely thorough also", "Interview Questions": "All about SEO and SEM "}]]