[[{"date": "28 Jun 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PYXERA Global", "Interview Descriptions": "I had two interviews — the first was a basic screening call. The second was longer and more in-depth with staff members from the PYXERA Global. The entire process took about a month", "Interview Questions": "Why are you interested in working here? What is your communication style?"}, {"date": "5 May 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PYXERA Global", "Interview Descriptions": "Straightforward interviews and interactions. no real guidance needed. The questions were not hard. The company seems interesting and are people passionate. There is a work processing activity but it's not difficult.", "Interview Questions": "Tell me about yourself please"}, {"date": "30 Mar 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PYXERA Global (Washington, DC)", "Interview Descriptions": "This was by far the best interview I had. There were two interviewers: Senior Program Manager and Program Coordinator. They were very friendly and asked common interview questions and some related to the private sector (SMEs) development in the country.", "Interview Questions": "Tell us about yourself? Why should we hire you? What qualities should successful managers have?  What are the biggest obstacles to growth of SMEs in the country?"}, {"date": "20 Oct 2017", "title": "Intern - Hourly Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at PYXERA Global (Washington, DC) in Apr 2017", "Interview Descriptions": "The interview process occurred remotely via a phone call and was conducted by two interviewers who alternated in asking questions. The questions generally emphasized trying to understand if you are a good fit for the organization and gauging your understanding of the organization and whether you knew about the development process through PYXERA. It was a fairly easy phone call but I believe they seriously assess your enthusiasm of the organization, its operations, and the overall mission that it stands for. I would recommend that those who are interested in development processes attempt the application and do their research on PYXERA beforehand. Overall not a terrible nor difficult process.", "Interview Questions": "What is your understanding of PYXERA's operations?"}, {"date": "11 Nov 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PYXERA Global", "Interview Descriptions": "I interviewed via Skype. They didn't have an operational webcam, so it felt a little odd to be watched without the ability to watch back. But overall, they were very nice and courteous and didn't waste my time. Cut to the chase, seemed genuinely interested in me and my experience.", "Interview Questions": "What is one of your biggest weaknesses?"}, {"date": "18 Aug 2016", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at PYXERA Global in Aug 2016", "Interview Descriptions": "Interviewer left voicemail when I missed call. I returned call twice, leaving a message the first time and was answered the second time. The interviewer cut to the chase with the questions and when confirmed that I had to relocate became immediately dismissive because they wanted to fill the role immediately.", "Interview Questions": "When are you available to start?"}, {"date": "3 Feb 2017", "title": "Local Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at PYXERA Global (Guangzhou, Guangdong) in Dec 2015", "Interview Descriptions": "First I submitted online application. Then I received an email for making phone interivew appointment with the Project Manager. (You can choose time). Interview with him is as formal as other job interview. He askes serious questions that you'd better have prepared answers for. After passing him, I recieved a phone call from the Country Manager. This round is for her to confirm I'm good to work with.", "Interview Questions": "What are your strengths?"}], []]