[[{"date": "16 Jun 2023", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "I got an email about a week after I applied and set up a virtual interview. They asked me multiple questions about my background and my working type. The interview was quick, concise, and to the point. There wasn’t a ton of back and forth conversation", "Interview Questions": "How do you approach a difficult situation?"}, {"date": "27 May 2023", "title": "Student Success Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Zoom and final round in-person Interview. Zoom very straight forward and in-person interview was about half the day. Enjoyed meeting the staff. Didn't hear back for 2 months about final decision.", "Interview Questions": "Tell us about why you're interested in the position"}, {"date": "28 Feb 2023", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "It was performed remotely with two hiring managers in the psychology department . Questions asked were relevant to the job I applied for and were indicative of what the job would entail.", "Interview Questions": "If you had 300 emails one morning, how would you prioritize them?"}, {"date": "26 Jan 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "It was good, nice interviewer and we had a good rapport. I liked that he was personable and explained the job responsibilities well. It was generally a good experience and I hope to get an offer.", "Interview Questions": "Please tell me about yourself"}, {"date": "12 Jan 2023", "title": "College of Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky", "Interview Descriptions": "You are asked to complete an online interview. Then, complete a video interview to enter the University of Kentucky College of Nursing. There is no in-person interview at this time.", "Interview Questions": "Why do you want to be a nurse?"}, {"date": "29 Dec 2022", "title": "CATS Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "No interview was given. Just got emailed that I was hired after I submitted my job application which included a resume and cover letter. This is the easiest job to apply to at UK.", "Interview Questions": "They did not ask any."}, {"date": "14 Oct 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2022", "Interview Descriptions": "I was emailed and asked for a time which worked for me. After setting that up, I was asked general information about myself then asked to walk through some of my previous work and explain my reasoning behind my methods. This took place over Zoom.", "Interview Questions": "What is your weekday availability"}, {"date": "28 Jun 2022", "title": "Health Education Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "This interview process was slow, drawn out over a lengthy period of time. However, there was great communication with supervisors and HR. In addition, they offer excellent benefits, including medical, tuition assistance, retirement, and even housing assistance!", "Interview Questions": "My experience working with disgruntled clients."}, {"date": "17 Jun 2022", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "The interview process is smooth. The interviewers ask question on different fields. For example, the length of working experience, the strength and weakness of the candidate, the future career plan., et al.", "Interview Questions": "What is your strength,\r\nWhat is your weakness\r\nWhat is your future plan"}, {"date": "3 Jun 2022", "title": "Senior Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "The interview consisted of about four different levels - phone screening by committee, interview with committee in person, interview with colleagues, and interview with the executive director. I hope this helps give insight!", "Interview Questions": "Name a time when you dealt with a challenging student and/or situation and how you overcame the challenge."}], [{"date": "4 Apr 2022", "title": "Events Set Up Team Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Lexington, KY) in Jan 2022", "Interview Descriptions": "We went through my resume, and they asked questions about my past jobs. We talked about when I could work and then I was given a tour of the building.", "Interview Questions": "Are you able to lift at least 40 pounds?"}, {"date": "7 Dec 2021", "title": "Blood Bank Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Informed me about everything I need to know about UKY healthcare. Talked about salary and benefits. Asked me questions and gave me a knowledge quiz. Lengthy but a very good interview.", "Interview Questions": "What 3 qualities would your friends describe you with"}, {"date": "26 Nov 2021", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Kentucky", "Interview Descriptions": "talked about the previous experience, and discussed the potential solution for future studies. the previous experience is important to show your ability to complete the task, and show your determination for problem solving.", "Interview Questions": "Please introduce your previous projects."}, {"date": "5 Sept 2021", "title": "Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "The interview process is applying to your wanted position and waiting and hoping they call, the best option is apply for multiple listings and increasing your call back chances.\nAlso watch the deadline for application, if they didn't call back the first time reapply when they resubmit the open position", "Interview Questions": "Q: why did you chose UKY?\nQ: Why did you leave your other position?"}, {"date": "12 Mar 2022", "title": "Risk Reduction Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky in Sept 2021", "Interview Descriptions": "Zoom interview with direct supervisor. Approximately 30 minutes. General questions regarding background and work history to start. More specific questions followed about experience in specific field that I was applying for.", "Interview Questions": "Tell me about yourself. \r\nHow you dealt with a difficult situation.\r\nWhat type of leadership style do you have."}, {"date": "9 Mar 2022", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jul 2021", "Interview Descriptions": "Very professional, organized, and related to the job. \r\nI was contacted by HR first then met with the hiring manager. \r\nI had two interviews then I was offered the job.", "Interview Questions": "Projects I worked in.\r\nWhat will I do with a difficult colleague or manager. \r\nMy background.\r\nMy expectations "}, {"date": "20 Oct 2021", "title": "Patient Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2021", "Interview Descriptions": "Process we pretty easy. First was a screener interview then a second interview with more managers. The boss was very laid back. He gave me time to think of what I was going to say and helped me not be nervous.", "Interview Questions": "What was a time I rushed to make a decision and what was the outcome?"}, {"date": "19 May 2021", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "The initial interview was with an HR manager. They asked for an overview of your qualifications for the position applied for. After that interview, I interviewed with the search committee.", "Interview Questions": "Why are you interested in UK and how does your background align with the advertised position?"}, {"date": "2 Feb 2022", "title": "Certified Surgical Technologist (CST) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington, KY) in May 2021", "Interview Descriptions": "Very easy over the phone interview , asked normal interview questions and was very easy experience overall , hiring process was very easy as well . This was all during Covid time so some things could have changed but process was very fast", "Interview Questions": "How do you handle a stress full situation "}, {"date": "27 Apr 2021", "title": "Health Education Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "Online application and questionnaire. Essay style questions. Was sent several automated response emails confirming my application. Was told someone would reach out in 6 weeks to set up an interview (if they were interested), but regardless I would be notified once a candidate was selected. It took them over 4 months to notify me that another candidate got the job. For reference, I’m a UK alumni and over qualified for the position and never got a call back.  I know others who have had similar experiences.", "Interview Questions": "Tell me about you relevant experience."}], [{"date": "21 Apr 2021", "title": "LLP Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "The interview was fairly standard and geared towards those who had had ample volunteering experience, but not necessarily career experience. Questions vary widely depending on the LLP interviewing your work.", "Interview Questions": "What research experience do you have?"}, {"date": "21 Jun 2023", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Apr 2021", "Interview Descriptions": "A personal interview with the professor you are applying to work for. The interview process is overall straight forward, easy to prepare for, and has no surprises. You usually get a tour of the facilities and lab you will be directly working with after the meeting process.", "Interview Questions": "Why are you interested in working with my lab?"}, {"date": "7 Mar 2022", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Kentucky in Apr 2021", "Interview Descriptions": "The interview process at the University (at least on the healthcare side) is very long and drawn out. I applied for my current position in May of last year and didn't start until October. \r\n\r\nFirst, it can take 2-3 weeks AFTER the position closes to even hear about a phone screen. After you schedule your phone screen you can expect to wait another 1-2 weeks for one of the handful of panel interviews you will likely have. These panel interviews can also be spaced out 1-2 weeks apart. Then you can expect a THIRD interview with the department head. Not all positions require this, but many do. After getting a verbal offer it can literally take 3 weeks or more to hear back with a start date. All in all it's not the most efficient process. Things run really slow at the University so do not expect to apply and be hired within 2-3 months.", "Interview Questions": "These are all mostly behavior based. They will ask you a situation you were in and what you did in the situation. For example \"Tell us about a time you went above and beyond for a customer\". "}, {"date": "25 Mar 2021", "title": "Resident Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Kentucky", "Interview Descriptions": "Super quick and simple, went really fast I applied and then a week later I scheduled and interview for that week. I was a comfortable and casual interview. I would totally recommend applying to be an RA if interested. they just want to know more about what kind of mentor you would be for new and incoming students.", "Interview Questions": "why do you think you would make a good RA?"}, {"date": "22 Mar 2021", "title": "Lecturer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "Two days with dinner the first day and a full second day. Very tiring day with no breaks, not even for using the restroom, but enjoyed seeing the campus and surrounding area.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "17 Jun 2022", "title": "Ekg Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Mar 2021", "Interview Descriptions": "Filled everything out online, then had to fill it out again on their forms.  Waited to be contacted. I hadn't heard in 2 weeks so I shot them an email, they were very layer back.", "Interview Questions": "Very typical.\r\n-what have you did in a difficult situation\r\n-can you follow protocol "}, {"date": "17 Feb 2021", "title": "Nursing Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2021", "Interview Descriptions": "Zoom interview with multiple managers from different shifts and departments. Spent time talking to each manager about previous experience, my strengths and weaknesses as well as training that I have previously received", "Interview Questions": "Difficult situation with co workers or family I have overcome"}, {"date": "16 Jan 2023", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of Kentucky in Feb 2021", "Interview Descriptions": "I had an initial screen and then a follow up group-interview with several hiring managers . Didn’t hear back for over a month, which was a bit puzzling as it went well. Though ultimately got the position. I enjoyed the interview process overall, the group aspect was not as rough as I anticipated, but I didn’t enjoy the lack of contact.", "Interview Questions": "Tell me about a time you had a to solve a problem?"}, {"date": "2 Sept 2021", "title": "Tax Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2021", "Interview Descriptions": "First, they told me the process will be on the phone but I had to tell them that the interview will be in a different country. They had to change their interview to a virtual platform and I really appreciate their kindness. Despite, the unorganized pattern. One couldn't ask me questions because her/his audio stopped working.", "Interview Questions": "What was your past experience, dealing with tax documents?"}, {"date": "27 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "I scheduled the interview via email and met virtually with multiple people who were already working on the project.  Despite some technical difficulties the interview seemed to go well.  They were professional and easy to converse with. My only complaint is that I never heard anything back via email or through the portal I used to apply in which you can check the status of the job post-application.", "Interview Questions": "How would you help participants feel more comfortable answering personal questions?"}], [{"date": "11 Jan 2021", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Discussion of class schedule and working duties, along with identifying goals that will be achieved by the end of the employment or semester. Provided clarification on what you can do in the summer time, so that you are not overworked or doing something that you are not passionate about.", "Interview Questions": "What is your class schedule like?\r\nHow many hours do you intend to work during the semester/summer?\r\nWhat was interesting about this lab specifically before applying?\r\n"}, {"date": "2 Dec 2020", "title": "Facilities Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "It was easy and they asked very basic interview questions. They asked a lot of questions about student life and involvement in order to gauge how work may play a role in your personal life.", "Interview Questions": "What are some skills you can bring to this job?"}, {"date": "15 Jan 2021", "title": "Administrative of Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky in Nov 2020", "Interview Descriptions": "The process was roughly 8 weeks with 3 virtual interviews. Expectations and directions were clearly communicated prior to each interview. Communication was great between myself and the UK team.  Overall the experience was really good.", "Interview Questions": "Why am I the best fit for the role?"}, {"date": "10 Sept 2020", "title": "Patient Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "Mostly behavioral interview types of questions. Tell me about a time you went above and beyond for a client, tell me about a time you disagreed with a superior, etc.", "Interview Questions": "Do you have any insurance experience?"}, {"date": "9 Mar 2021", "title": "EAPAEducation Abroad Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Sept 2020", "Interview Descriptions": "Very informal, submitted an online application including resume and answering a few what-if/perspective questions and then went on to a virtual interview. Where I was asked about my time abroad and then some what-if situational questions that could arise while working.", "Interview Questions": "How has you time abroad impacted your life back in the US?"}, {"date": "18 Oct 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jul 2020", "Interview Descriptions": "A 30 minute session answering general situation questions. They review applications then message you for different time slots available. You choose, and it was done over ZOOM. A couple days later you are notified if you got the job.", "Interview Questions": "How would you handle x situation? If a tutee needed additional support aside from the group, how could you assure they get the support they need? What is your biggest strength? Weakness?"}, {"date": "7 Jun 2023", "title": "Central Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jul 2020", "Interview Descriptions": "Was a phone interview due to Covid. Mainly asked about hours available and if I was comfortable with the job duties described. Hiring process was quick. Questions were easy. Offer was next day.", "Interview Questions": "What shift and days are you available"}, {"date": "30 Jun 2020", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "The was initiated quite quickly, seems to be a very busy company with many employees. I can see this being problematic. I applied and got a call back the next day or so. They scheduled a technical interview.", "Interview Questions": "My experience with OOP"}, {"date": "27 Jul 2020", "title": "OTC Student Marketing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2020", "Interview Descriptions": "After applying I hear back from the Senior Marketing Manager a few days later to schedule a zoom meeting. The interview was a maybe a little over 30 minutes and I learned a lot about her role and the office.", "Interview Questions": "She asked about my experience with marketing/advertising."}, {"date": "18 Sept 2019", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "First I received a phone call to talk about my past experiences then I came in for two interviews. The first set was a panel interview with data scientists, the second one was with database developers and business analysts.", "Interview Questions": "N/A"}], [{"date": "8 Dec 2021", "title": "Steps Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2019", "Interview Descriptions": "First you exchange emails with the HR department, then have to go in for an informal interview with the HR department and then you get passed along for the interview with your department", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "5 Aug 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2019", "Interview Descriptions": "Very Quick! Got the job the next day, I would recommend taking your time with answering questions and wear business casual because you do what to seem professional however this isn't a high level job so business formal is not required", "Interview Questions": "what is a time you had to deal with a difficult customer and how did you deal with it ?"}, {"date": "28 Jul 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Kentucky", "Interview Descriptions": "The hiring pool was limited to in-house candidates, and this was very open. Although I benefitted from this, one thing that did bother me is that current employees were told that they would have input into the hiring process, which in the end was not the case.", "Interview Questions": "What would you bring to the position. "}, {"date": "21 Mar 2019", "title": "New Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at University of Kentucky", "Interview Descriptions": "I applied online and then about two weeks later got a phone call and then set up a phone interview. It was a good brief interview and they called me within 2 days with a job offer", "Interview Questions": "How do I handle conflict "}, {"date": "23 Jan 2020", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2019", "Interview Descriptions": "Interview was smooth. But time taken for the overall process was longer. The pace at which paper work moves is slow. They give preference to internal candidates a lot. By the time I applied and when they called for interview, it basically took 2 months. Not only that, even after selected, it took long time for the paper work to be completed. I thought I will start looking for elsewhere...it was frustrating", "Interview Questions": "How to manage work-life balance in research"}, {"date": "14 Jan 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "quick and streamlined, no technical questions, only 2 in person behavioral interviews before an offer. The questions were simple and open ended, seemed more like a conversation than an interview.", "Interview Questions": "Any previous research experience?"}, {"date": "17 Dec 2020", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Dec 2018", "Interview Descriptions": "The interview was online and very fair. In this process, you are able to talk directly to the people you will be working under and that was very beneficial. You also get to see the type of work atmosphere you will be working in.", "Interview Questions": "What is your background knowledge on marketing?"}, {"date": "17 Dec 2018", "title": "Information Technology Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky in Dec 2018", "Interview Descriptions": "Email, then a hone call. After that they wanted me to come in for a face to face. I received an email the next day with an intent to hire.", "Interview Questions": "What do you hate most about computers?"}, {"date": "29 Nov 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY)", "Interview Descriptions": "Took them a long time to process application. I did not hear back for almost 5 weeks after submitting application; however, overall the interview process was not difficult. Everyone from HR to manager were very helpful in completing the process.", "Interview Questions": "N/A"}, {"date": "11 Nov 2018", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "I have applied for the job and got a call from them to be reviewed. First, I was asked to explain my previous experience with the technologies i was using and they asked me several technical questions. Later another round of technical question interview.", "Interview Questions": "Explain your experience with semantic web and working on Linux operating system"}], [{"date": "23 Jun 2022", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Nov 2018", "Interview Descriptions": "I had a 30 minute phone screen and then was invited for in person interview. During my in person I met with Director of Advising, then with a current group of the advising staff as well as the Associate Dean of the College.", "Interview Questions": "What is your philosophy on advising.\nWhat do you think you can bring to this advising team.\n "}, {"date": "21 Aug 2018", "title": "Student Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Very easy, not stressful. Just had a conversation and talked about prior work life. Talked about what would be expected from me as a worker and any thing they definitely needed.", "Interview Questions": "What does your class schedule look like?"}, {"date": "15 May 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Kentucky", "Interview Descriptions": "super easy,. Was recommended by a professor whose class I did well in, and was reached out to by email to set up an interview. the interview was short and easy, with only a few questions being asked. they just wanted someone who was dependable and timely.", "Interview Questions": "are you dependable?"}, {"date": "13 Mar 2018", "title": "Communications Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Kentucky (Lexington-Fayette, KY)", "Interview Descriptions": "The interview was with my direct supervisor and the leader of the research center. Questions were easy and appropriate for the job description. I applied for the job online and went through one phone interview and then came for an in-person interview. The in-person interview was informal and I was provided with the job description and additional details and requirements regarding the job.", "Interview Questions": "How would you promote a national event?"}, {"date": "28 Feb 2018", "title": "Nursing Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY)", "Interview Descriptions": "Very fast process, will usually do large hires in May/December around graduation time or when opening a new floor. They will call and ask to do a preliminary phone screening. At the end of the call, the recruiter will set up an in-person interview which you will meet with a nurse recruiter and the floor manager. The managers are very nice and happy to answer all of your questions", "Interview Questions": "Describe a stressful work situation that you have been in and how you handled it."}, {"date": "30 Jan 2018", "title": "Student Center Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Kentucky", "Interview Descriptions": "It was a phone interview. It was easy and took very little time. Very easy questions and standard for interviews. They got back to me later that day.  It took a while for the paperwork to go through, but once it did, it was an easy set up and start.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Mar 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Kentucky (New York, NY) in Jan 2018", "Interview Descriptions": "I was directly contacted by the interviewer through email. The interviewer was a professor from the same department. The interview was via Skype. The overall experience was quite positive. He mostly asked about research.", "Interview Questions": "In what way you can be an asset to the research group if you are recruited."}, {"date": "13 Jul 2019", "title": "Cardiopulmonary Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Kentucky (Lexington, KY) in Jan 2018", "Interview Descriptions": "Phone interview with HR department.  Checked with my referrals . Some positions require letters of recommendation. Interview with manager.  Drug screen and background check. Basic normal interview process.", "Interview Questions": "Basic interview questions - ex: How have you handled a difficult situation? "}, {"date": "26 Nov 2017", "title": "Student Systems Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "Easy, laid back. Direct questions, mostly about things on your resume. I submitted the online application through the UK student employment portal and received an email asking to set up a time to interview over the phone. I then got the offer to come in and do a face-to-face interview and was offered the job on the spot.", "Interview Questions": "Tell us about your experience with \"XYZ\" Technology"}, {"date": "4 May 2018", "title": "MHA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Kentucky in Sept 2017", "Interview Descriptions": "Very informal. It was not a very long process and you didn't really have to put in a lot of effort. I was pretty unimpressed to be honest. I thought that it would be a lot harder to get through.", "Interview Questions": "Describe a tough situation"}], [{"date": "7 Jun 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2017", "Interview Descriptions": "Giving a technical presentation to the research group and leave time for answering questions. \r\nThen had individual meetings with the ad visor to discuss with the project will work on.", "Interview Questions": "What is your research about"}, {"date": "28 Nov 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Kentucky (Lexington, KY) in Mar 2017", "Interview Descriptions": "I was asked if I wanted the job, and I made it clear to the supervisor that I was interested in working for the University as I completed my graduate studies. In all honestly, the following questions below are what were asked of me; all questions were softball questions.", "Interview Questions": "Would you be interested in this position?"}, {"date": "22 Dec 2020", "title": "Creative Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jan 2017", "Interview Descriptions": "The interview was fairly casual since it was for a student position in the creative office. The people were all very kind and interested in my background, but more interested in my potential.", "Interview Questions": "Walk me through how you made this piece..."}, {"date": "5 Nov 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Kentucky (Lexington, KY)", "Interview Descriptions": "It was pretty casual. I already knew most of  the people who was going to interview me. The job offer was already has been mentioned to me by the employer.", "Interview Questions": "Why do you want to go to Graduate school?"}, {"date": "5 Mar 2017", "title": "Customer Relations Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Oct 2016", "Interview Descriptions": "Two co-workers you will work with. Supervisor. \r\n\r\nYou will be called by the supervisor first and then will be brought in for a person-person interview. Two co-workers along with a supervisor will ask you common interview questions.", "Interview Questions": "What do you plan to do 5 years from now? "}, {"date": "13 Sept 2017", "title": "Radiology Attendant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington, KY) in Aug 2016", "Interview Descriptions": "easy, face to face meeting with only one manager, easy questions, laid back, asked if you were able to push heavy beds, you will be pushing more than a few hundred pounds of a person in a hospital bed if you get this job. The interview was very easy, if you make it to the interview you will get the job", "Interview Questions": "There was no difficult questions, very laid back, asked about your self "}, {"date": "2 Jul 2016", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Kentucky", "Interview Descriptions": "I interviews at the university of Kentucky for an RA position shortly before the housing switched over to a private company. The interviews are very behavioral and focus entirely on your ability to think quickly and professionally. It's not about why you're saying, but how you say it. Make sure to draw in your experiences from high school, as these can prove to be solid answers. Don't forget general interview courtesies, like hand shakes and smiling. These are also looked for during the interview process.", "Interview Questions": "Tell us about a time you had to bring two different people together."}, {"date": "8 Aug 2020", "title": "Emergency Communications Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jul 2016", "Interview Descriptions": "The hiring process was simple. It was made of a single panel interview of five people. They mostly just wanted to know my work experience, along with making sure I had enough experience for the job.", "Interview Questions": "How did you handle a horrible situation?"}, {"date": "14 Jun 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2016", "Interview Descriptions": "Had worked part time while so they aiready knew me.  I had a lot of customer service experience which was a big plus.  The person interviewing was nice at the time.", "Interview Questions": "Are you flexible."}, {"date": "4 Oct 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2016", "Interview Descriptions": "Not that smooth. Take a quite long time to work with. It's very difficulty to get the response from DGS. \r\nI am kind frustrated with that. Otherwise, everything is fine.", "Interview Questions": "math skill"}], [{"date": "27 May 2016", "title": "Physical Therapy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "It was a very simple interview. Alot of  the questions were about yourself and a few that were position related. The questions were very broad and random at times. It seemed to focus on yourself and your previous job encounters.", "Interview Questions": "What is a challenging moment you've encountered on your job"}, {"date": "24 May 2016", "title": "Medical Contact Center Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Kentucky (Lexington-Fayette, KY)", "Interview Descriptions": "Easy, very standard questions. I had to interview one-on-one with an immediate supervisor, not senior management. So there was zero intimidation factor. I wish I knew that a good interview does not equal a good job where I was valued and respected. \r\n\r\nI felt very prepared for the interview and was taken back to the break room to meet other employees right away. They made an offer that day and were very cordial. \r\n\r\nNone of the questions caught me off guard, and I wasn't made to feel nervous at all. I enjoyed the interview process, but it was one of the few times management treated me like a human being.", "Interview Questions": "Tell me about a time you exceeded expectations for a customer and how they responded."}, {"date": "25 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Kentucky (Lexington-Fayette, KY) in May 2016", "Interview Descriptions": "Literally just asked a few question about me and my work experience. It was a very easy interview. They really needed someone so they were eager to get through the process.", "Interview Questions": "Tell me about yourself.\r\nWhat is your prior work experience?\r\nCan you use Microsoft Office?"}, {"date": "4 May 2016", "title": "Statistician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Apr 2016", "Interview Descriptions": "The current employees will first give an interview, asking general interview questions for about half an hour. And then the 2 directors will continue the interview for half an hour.", "Interview Questions": "Introduce your self.\r\nProject experience."}, {"date": "28 May 2019", "title": "Sales Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Kansas City, MO) in Apr 2016", "Interview Descriptions": "It was okay but intimidating. They dont ask anything personal which is good. They mainly ask about certain situations if we come across them. It was a fun experience.", "Interview Questions": "How do you handle an uncomfortable situation?"}, {"date": "18 Mar 2016", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Kentucky (Richmond, KY) in Mar 2016", "Interview Descriptions": "Ceo not present, group interview, round table questions.   Will meet with ceo today at starbucks.  Met with 2 upper management.   Had very few questions.   Asked me for examples of teaching situations were conflicts arouse and how I hammock that situation.", "Interview Questions": "Went do you want to leave current job"}, {"date": "27 Feb 2016", "title": "Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Kentucky", "Interview Descriptions": "The entire interview process was conducted online and via phone interviews, which is reasonable in the beginning of the process. The contact was responsive to email (questions, and so forth).", "Interview Questions": "They asked for an editing test."}, {"date": "1 Apr 2019", "title": "Education Abroad Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Kentucky (Lexington, KY) in Feb 2016", "Interview Descriptions": "Initial Phone Screening followed by in-person interview. Was asked to deliver a presentation on curriculum engagement in front of the entire office. Sat down with 4 different teams for what was essentially the same interview", "Interview Questions": "How would you handle a student that is abroad and dealing with severe homesickness?"}, {"date": "18 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Kentucky", "Interview Descriptions": "Very easy interview.  One on one.  Basically only concerned about GRE score and GPA.  If funding is available and you exhibit the ability to perform the required work, everything goes very smoothly.  Completed almost everything via email.", "Interview Questions": "Why do you want to be here?"}, {"date": "15 Jul 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Kentucky (Lexington, KY) in Nov 2015", "Interview Descriptions": "Interviews are not difficult. The entire process was relaxing. Professors are friendly. We also have a chance to have lunch and dinner and talk to the current PhD students. Both the professors and students gave very honest suggestions about the program and comments whether I could fit the program.", "Interview Questions": "Why do you want to have a PhD."}], [{"date": "26 Apr 2019", "title": "Support Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Sept 2015", "Interview Descriptions": "Application process is lengthy. Took awhile to hear any updates on the status. Individuals that conducted the interview were friendly and easy going. Felt welcomed but took a long time after I applied to hear back about the interview.", "Interview Questions": "My experience with accouting."}, {"date": "26 Aug 2015", "title": "IT Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "Had a short one-on-one interview with IT Director. Discussed qualifications for the position and history with IT and customer support. We just met briefly in his office, and then I was offered the job a few days later. A very informal process, and very low stress. This was not unexpected, as the position is in a small office.", "Interview Questions": "How would you help a client resolve a problem you didn't know the answer to?"}, {"date": "13 Aug 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Kentucky", "Interview Descriptions": "I was invited to campus for an all day interview where I met with future supervisor, colleagues, Deans, students. I was asked different questions in each of four rounds of interviews. The building was really nice and everyone I met was very nice also. I was there for approximately three to four hours.", "Interview Questions": "Tell us about a time you had to provide critical feedback."}, {"date": "4 Jan 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2015", "Interview Descriptions": "I handed in my resume, and within about one week they had me in for an interview. The interview was very simple. They just asked me questions about myself and my resume, and about my hours schedule for school. A few days later they called me and told me that I got the job.", "Interview Questions": "Do you really speak portuguese?"}, {"date": "19 Nov 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2015", "Interview Descriptions": "I got  the email of the program director from the Wildcat job posting. I emailed her to talk about the position, and quickly set up a time to meet. By that week I had went in, talked to her about my previous experience tutoring, and she gave me the forms to fill out for the job.", "Interview Questions": "Do you have any previous experience tutoring?"}, {"date": "31 Jul 2015", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Kentucky", "Interview Descriptions": "pretty straight forward standard interview. you are asked behavioral and situational questions and they are not necessarily looking for cookie cutter answers but really to hear about how you would react in certain situations. Give a confident vibe and own your answer with a positive attitude and you should be fine", "Interview Questions": "tell me about at time..."}, {"date": "14 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Applied online via school listerv. Was contacted within 2 weeks for an interview and received a job offer about a week after that. Position took a little time to formally go through HR so it was another month before I could actually start.", "Interview Questions": "which projects would you be most interested in; apply past experiences; basic stuff"}, {"date": "1 Dec 2016", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2015", "Interview Descriptions": "I applied online and 2 weeks later they called me in for a interview. I interviewed and thy offered me the job on the spot. I then went and got my finger prints scanned the same day. After that I took the drug test a week later. After the drug test I waited about 5 weeks for the next orientation to start. The hiring process is extremely long but the job is worth it.", "Interview Questions": "Simple questions about your experience and a couple scenario questions about what you may experience. "}, {"date": "27 Jan 2017", "title": "Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2015", "Interview Descriptions": "Quick and easy phone interview conducted by one of the Graduate Assistants at the University of Kentucky Student Center. Asked basic questions about the university, directions, and why I wanted to work for the University of Kentucky.", "Interview Questions": "Asked to give directions from Bowman's Den to Chem-Phys building."}, {"date": "17 Jul 2017", "title": "Nutrition Education Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in May 2015", "Interview Descriptions": "The interview process a slight change of pace for me at the time. Its was in a board room with a panel of interviewers. They all asked me questions viable to the process of hiring. I thought that this style of interviewing was a bit more formal than a normal interviewing process. Nevertheless it was a great experience!", "Interview Questions": "How do you think you are going to benefit your coworkers with this position?"}], [{"date": "2 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington, KY) in Apr 2015", "Interview Descriptions": "The interview and hiring process was smooth and fast. You go in for an interview with the manager, assistant manager, and sometimes a nurse from the unit is there as well. They ask you basic questions about your experience and skills, and tell you about acuity and staffing levels. They were very friendly and try to put you at ease.", "Interview Questions": "What made you select this specialty ICU, and why do you think you would excel in it?"}, {"date": "2 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Kentucky in Mar 2015", "Interview Descriptions": "Talked to the professor and asked about open positions.  I was told about the open positions and I took the one that I wanted.  This is stupid I should have to have a minimum word count.  I've said all I wanted to say.", "Interview Questions": "There were none... I had the professor in class"}, {"date": "1 Sept 2017", "title": "Graduate Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Mar 2015", "Interview Descriptions": "It consisted of two 30 minute interviews. The questions were behavioral based question with the primary focus on your leadership skills and how they can translate to the position. I was able to ask questions back at the end of each interview, and that was it.", "Interview Questions": "Behavioral based questions"}, {"date": "16 Mar 2017", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Mar 2015", "Interview Descriptions": "We reviewed my qualifications, had a couple of phone interviews and finally met in person.  I also had the opportunity to communicate with the current employee that I was interviewing for and they relayed their experience.", "Interview Questions": "What agricultural experience do you possess?"}, {"date": "18 Dec 2015", "title": "Pharmacy Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2015", "Interview Descriptions": "Just a phone interview, if you know someone in the pharmacy it is very easy to gain employment as they have trouble retaining employees. It took one month after acceptance of offer to begin work", "Interview Questions": "What other pharmacy experiences have you had?"}, {"date": "28 Oct 2015", "title": "Lab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jan 2015", "Interview Descriptions": "General questions about computers and generic software , both Apple and Windows. Character evaluating questions such as handling situations and people . Knowledge on specific software a plus. Ex: Matlab, Verilog etc.", "Interview Questions": "How did/will you handle a harsh customer ?"}, {"date": "27 Jun 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jan 2015", "Interview Descriptions": "Interviewed for the position of the Ph.D. candidate. I had a phone interview. Questions were mostly related to my educational background in engineering and a few behavioral questions. It was scheduled to do a background check.", "Interview Questions": "Why do you want to join our department?"}, {"date": "10 Apr 2018", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Dec 2014", "Interview Descriptions": "Very difficult to get the job.  3 different interviews before you can get the job. It took a least 5 years before I got a call for an interview", "Interview Questions": "Tell about yourself"}, {"date": "18 Apr 2018", "title": "Student Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Kentucky (Lexington, KY) in Oct 2014", "Interview Descriptions": "The process was fairly simple. I applied for the job via the UK jobs site. I went to a building on campus for an \"informational interview\" where they informed me of the details and possible hours for the jobs. I accepted their terms. A day later I received an email about an official interview with the office management. At the interview I was informed that they make it a priority to work around a students schedule and that I would be working within multiple offices. The interview was very lax and quick. I received an email about two days later stating that I received the position and information about when orientation would be.", "Interview Questions": "What are your preferred days and times?"}, {"date": "21 Feb 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Oct 2014", "Interview Descriptions": "Lots of scenario questions. Write down a few of your most memorable experiences, positive or negative before the interview. Always speak about how you resolved the issues that came up", "Interview Questions": "In your experience, what was your biggest problem you faced and how did you work through to resolve it?"}], [{"date": "23 Sept 2014", "title": "Student Development Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Kentucky", "Interview Descriptions": "Fast paced group Group interview. They will go around to each person and ask the same question. Each person will then be asked to name a positive situation and turn it around into something negative.", "Interview Questions": "Why should we hire you? "}, {"date": "8 Sept 2017", "title": "Systems Administrator/Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Sept 2014", "Interview Descriptions": "The interview was easy, and the questions asked were basic Linux operating system questions, hardware, RAID configuartion, critical thinking and basic programming questions.I applied online.The process was straight forward and the interview lasted for an hour.", "Interview Questions": "RAID, Linux basics"}, {"date": "18 Aug 2014", "title": "Communications Network Installer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "I applied for the position and was asked for an interview. The interview was one on one and I was mostly asked about my interest in the position. The interviewer also explained to me the regular duties of the position and the demands of the job, after which I was asked if I was still interested. The position was not especially technical and I felt that I presented myself as bright enough to learn, while being trained on the job.", "Interview Questions": "There were questions regarding my handling of customer service type situations, which made sense because the installs occurred in peoples' workspaces throughout the university."}, {"date": "27 Jan 2018", "title": "Extension Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2014", "Interview Descriptions": "Phone Interview, followed by two in-person interviews. Final interview was the job offer. Use Extension resources to prepare for interview. Their organization teaches programs on how to interview. Sleep well, eat a good breakfast!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Aug 2014", "Interview Descriptions": "The professor I worked sent me an email telling me about the opportunity and to contact them if I was interested. I emailed them and some day that week I went to his office for an interview. I walked in to professors office and was asked a series of questions about my schedule. There were no skill specific questions.", "Interview Questions": "What was my current schedule?"}, {"date": "15 Jul 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "The interview proccess was very straight forward.  All positions are advertised on the UK job site.  After applying online, I was contacted by nurse recruitment and my interview was scheduled.  I met with the manager of the unit I was applying for.  I was given a tour of the unit and given the opportunity to meet some of the other nurses working that day.", "Interview Questions": "There were no difficult or unexpected questions.  Just typical questions regarding my experience as a nurse.  Very straight forward"}, {"date": "19 Jun 2014", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Kentucky (Lexington-Fayette, KY)", "Interview Descriptions": "Call interview, followed by group interview. Second interview with additional management team. Questions were asked about background and work experience. Interview team was not clear which tools they used, and I think used alternative tool experience against the potential employee in terms of rating their skills.", "Interview Questions": "Tell us about a time when you ....... What were your actions and thoughts? What did you do? Situation interview."}, {"date": "2 Jun 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at University of Kentucky", "Interview Descriptions": "Hiring process was very drawn out; I applied in january and didn't hear anything until September. Interview was informal, just asking the usual interview questions nothing to specific or out of the norm.", "Interview Questions": "Nothing unusual, a ladi back, informal interview."}, {"date": "18 May 2017", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Kentucky in Mar 2014", "Interview Descriptions": "I applied and was contacted by ResLife that I made it through to an interview process. I had an interview with several different people - it lasted about an hour. And then about 2 weeks later I heard that I had got the position.", "Interview Questions": "They asked about times I've dealt with conflict, how diversity is important,  how I would handle adversity and tough situations, etc."}, {"date": "27 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington, KY) in Mar 2014", "Interview Descriptions": "They will review the application material first, and then give me a call to schedule the interview. After the phone interview is finished. They will arrange the on-site interview. After that is done, they will do some background checking.", "Interview Questions": "They asked me about what I have done in the undergraduate school (e.g, projects). They also ask some questions about basic major."}], [{"date": "18 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2014", "Interview Descriptions": "you will be asked more general questions about your employment history, education, strengths, weaknesses, achievements, goals and plans. Will be asking about your background and interest in that particular position of the department", "Interview Questions": "We like to think of ourselves as a team at this company.  What skills will you bring to our team?"}, {"date": "17 Jan 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Online application through UK's employment portal system.", "Interview Questions": "Did not have any particularly difficult questions."}, {"date": "15 Jan 2014", "title": "Engineer Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Did not go through formal interview...knew internal hiring team and was able to get the position", "Interview Questions": "N/A"}, {"date": "6 Jan 2014", "title": "Clinical Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY)", "Interview Descriptions": "I applied for the job online but was referred to the position by a current employee. Around two weeks after I applied for the position, I wad called for an in person interview. Did the in person interview and a week later was offered the position.", "Interview Questions": "Very general interview questions. Most difficult question was what is your greatest weakness."}, {"date": "30 May 2016", "title": "Social Worker, Emergency Department Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at University of Kentucky in Jan 2014", "Interview Descriptions": "I received an initial phone call to set up my in person interview. This first interview went well, but I was concerned about the lack of definition to the position's schedule. I asked to meet with someone currently in the role to get more information and the hiring manager was willing to do this. During this second interview I decided to withdraw myself from the process due to the inability to define a schedule.", "Interview Questions": "Personal goals"}, {"date": "13 Sept 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Lexington, KY) in Jan 2014", "Interview Descriptions": "Meet in a room with a board of interviewers(usually 3-5). they ask scenarios and you have to answer them with the best possible answer. Lasts about an hour. Once the interview is done, the interviewers will talk amongst themselves and call you back with an invitation to take the job or let you know that they chose someone else.", "Interview Questions": "How do you treat patients that you may know outside of your job?"}, {"date": "17 Nov 2015", "title": "Program Assistant Ecuador GO Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Kentucky (Lexington, KY) in Oct 2013", "Interview Descriptions": "Very Casual. I was a graduate student in a sister department. Everything was low key. Basically just an overview of the job responsibilities and the question of whether or not I was ok with them. There was also a short discussion about what hours I would be available.", "Interview Questions": "Do you know any Spanish?"}, {"date": "25 Sept 2013", "title": "Software Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Well defined", "Interview Questions": "Tell us about yourself"}, {"date": "5 Sept 2013", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Kentucky", "Interview Descriptions": "Behavior questions for the most part. Few technical questions.", "Interview Questions": "N/A"}, {"date": "6 Jul 2017", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Sept 2013", "Interview Descriptions": "It was a great interview. I spent the morning with my potential supervisor discussing possible projects, and was then taken out to lunch with him and one other faculty followed by two ~30 minute interviews with related faculty. I then gave a seminar, and then we went to dinner.", "Interview Questions": "Would you like to play with my robot?"}], [{"date": "26 Nov 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jul 2013", "Interview Descriptions": "During application to Grand.school they ask to indicate are you interested in assistantship or not--unless you have $$ to pay your grad.school you are to take such an offer.", "Interview Questions": "Very simple: you write yes or no to have a part-time job as a TA"}, {"date": "18 Apr 2013", "title": "Student Affairs Officer II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Kentucky", "Interview Descriptions": "Once you apply, you will recieve a notification that your application has been \"forwarded to the hiring official\"\r\nIt could take weeks/months to hear anything so do not get discouraged.  \r\nInitial phone interview followed by a panel interview before hiring.", "Interview Questions": "Strengths/Weaknesses"}, {"date": "4 Nov 2017", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2013", "Interview Descriptions": "The hiring/interview process takes a while at UK Healthcare, but is relatively straight forward upon your initial call. A group consisting of management staff from various pharmacies on campus may interview to see if you are a good fit. Interviews are usually pretty relaxed.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "12 Feb 2016", "title": "Radiology Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Kentucky in Dec 2012", "Interview Descriptions": "The interview was fairly easy, I just sat down with the supervisor and he asked me questions. However he did tell me that usually there are more people in the room with him to interview you.", "Interview Questions": "What would you do in a certain situation with a patient that is being difficult?"}, {"date": "6 Jun 2014", "title": "EFNEP Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Kentucky (Pikeville, KY) in Aug 2012", "Interview Descriptions": "Newspaper ad, Resume, Telephone interview, and face to face interview. In the interview very detail questions on nutrition and my past experience. I had two different people interviewing me, both whom was very business like , but personable.  I was very comfortable during the interview process", "Interview Questions": "I did not feel as if they asked any difficult or unexpected question during this interview. "}, {"date": "15 Mar 2016", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2012", "Interview Descriptions": "the hiring and interview was conducted as a one on one experience with my future boss. It was fairly informal and thus was fairly comfortable. I believe this description meets the 50 word minimum.", "Interview Questions": "why do you want this job"}, {"date": "15 Feb 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2012", "Interview Descriptions": "There was no interview.  Rigorous application process and that is it.", "Interview Questions": "N/A"}, {"date": "12 Nov 2014", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jan 2012", "Interview Descriptions": "Once after submitting a detail CV and cover letter, its better to talk to the employer in-person to talk about your interest in that particular job. \r\nInterview question can be expected to be more about previous work experience.", "Interview Questions": "N/A"}, {"date": "11 Jun 2015", "title": "Telephone Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Dec 2011", "Interview Descriptions": "If you get called for an interview, you already have the job, so long as your background check clears. Basically, the hiring managaer will be alerted you have applied, and they will review your application. If they feel you are a fit, they will call and ask you to come in for an interview, which really consists of showing you around the office, and what your job will entail.", "Interview Questions": "Can you use a computer, and can your read?"}, {"date": "26 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Kentucky (Lexington, KY) in Jul 2011", "Interview Descriptions": "I was referred to this position by a college professor whose former student was looking to fill this position. The interview process was comfortable and surprisingly enjoyable. Business casual dress was appropriate.", "Interview Questions": "Describe your responsibilities in your current work position."}], [{"date": "5 May 2012", "title": "Clinical Research Human Resources Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 days. I interviewed at University of Kentucky (Lexington, KY) in Jul 2011", "Interview Descriptions": "The process was very professional and meeting all of the members of the team I was to be working with was great.  The original posting stated a salary of 125,000 per year, but because most of my experience was in the military (13 years) they decided I was worth only 95,000.  I", "Interview Questions": "They asked me why I wanted to live in Lexington?"}, {"date": "19 Mar 2015", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Apr 2011", "Interview Descriptions": "Multiple interviews over the course of the day. Interviewed by current resident advisors and faculty. These resident advisors would read off pre-written and thought out questions (not by them) from a worksheet like robots and would jot down the response.", "Interview Questions": "When was a time you handled conflict?"}, {"date": "11 Nov 2015", "title": "Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Apr 2011", "Interview Descriptions": "Pretty much your standard interview. Actually graduated here, so put in application at career fair a month or two before graduation. Contacted via phone, and was asked a few behavior-based questions. Went to on-site interview, and was hired within week. Typical behavior-based interview. Random mechanical aptitude skills test at the end...no math...pfffff.", "Interview Questions": "Tell me about a time you..."}, {"date": "11 Oct 2015", "title": "Nursing Care Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Feb 2011", "Interview Descriptions": "I submitted an application online. I received a phone call several months later to set up an interview for a couple of weeks later. I interviewed with the Nursing Manager and one of the floor nurses from the unit I was being interviewed for.", "Interview Questions": "Name a situation where a patient and or family member were difficult to deal with and how did I handle the situation"}, {"date": "1 Nov 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Kentucky (Lexington, KY) in Feb 2011", "Interview Descriptions": "Standard 3-step academic interview. The first step is to talk with the search committee chair over a recruiting conference. The second round is an Adobe interview with the search committee regarding my research and mutual interests. The third round is a day and half campus visit, when you give  a presentation, usually based on the dissertation, meet individual faculty for some friendly chat, have lunch with graduate students, have dinner with 1 or 2 faculty members.", "Interview Questions": "what's your research plan for the next 5 years."}, {"date": "21 May 2012", "title": "Assistant Professorffice Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Kentucky (Lexington, KY) in Sept 2010", "Interview Descriptions": "mediocre", "Interview Questions": "why are you best for this job"}, {"date": "1 Aug 2011", "title": "Employment Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Kentucky (Lexington, KY) in Jul 2010", "Interview Descriptions": "1.  Phone Screen with manager of department\r\n2.  In-Person interview with manager of department and upper-level management\r\n3.  Peer/Panel interview with co-workers", "Interview Questions": "Asked for specific examples from previous work experience: -process improvement -difficult co-worker -project you are/were proud of -something you did/mistake you made that you wish you hadn't"}, {"date": "11 Mar 2014", "title": "Head Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jun 2010", "Interview Descriptions": "3 interviews. Middle management changed too often. Too many supervisors", "Interview Questions": "N/A"}, {"date": "9 Sept 2014", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Kentucky in Feb 2010", "Interview Descriptions": "Usually, this post is available for current graduate students - Masters or PhD. You can apply for the position while you are already in school or right at the point of applying to the program. All depends on the department. You need to take a couple of exams - especially the GRE, get evaluated by a selection committee who reviews both your GRE scores, transcripts from all previous schools attended and your resume. \r\nIf you pass this phase, you get selected for interviews - usually one-on-one with up to 8 different faculty, selected based on your statement of research interest you turned in during the application process.\r\nIf you get a good review from most of these people, as well as if there's funding for research available at the laboratory of your choice, then you get selected for the position as a funded graduate student. Taking classes full time, while working for a faculty member at least 20 hours a week. Often times you end up working for close to 60 hours a week during the last 3 years of the doctoral studies since most people get done with required classes within the first 2 years", "Interview Questions": "Based on your CV, it doesn't seem you've have a lot of research experience, how do you expect to succeed here?"}, {"date": "5 Aug 2009", "title": "Lab Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Kentucky (Lexington, KY) in Aug 2009", "Interview Descriptions": "Applied online and once the job closed, HR sent me an email saying I had been referred to the hiring official. About two weeks later I received an e-mail from the faculty member running the lab saying that I had qualified and wanted to set up an interview. The interview was about an hour long in his office. There were no behavior based questions. He asked about my previous lab experience and if I was familiar with certain techniques, then explained the purpose of their study and what would be expected of me. I asked several questions and then we parted ways.", "Interview Questions": "Tell me what you were studying in your previous lab job and what conclusions were reached?"}], [{"date": "13 Oct 2013", "title": "Housing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at University of Kentucky (Lexington-Fayette, KY) in Jan 2009", "Interview Descriptions": "If you apply with the University of Kentucky in the housing department, you will then get reviewed and if the University of Kentucky is interested in you, you will receive some form of contact. If they contact you, you may be asked to come in for an interview. Go to the Interview if you want the job.", "Interview Questions": "What part of a car would you be if you were a part of a car?"}]]