[[{"date": "28 Feb 2023", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American Dental Association", "Interview Descriptions": "Overall, the ADA was pretty responsive which is nice. That said, when I interviewed with the team, they sounded overworked and miserable. So much so that, when I was asked to move on to the next step in the interview process, I withdrew my application. Transparency about workload and expectations is awesome, but the way the information was presented made me want to turn around and run away, which is exactly what I did. Additionally, the test you’re required to take related to word puzzles, math problems and personality was ridiculously long and antiquated.", "Interview Questions": "None of the interview questions were too difficult, all focused on background/experience/examples of previous work, etc."}, {"date": "9 Mar 2023", "title": "Dental Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Dental Association (Chicago, IL) in Jan 2023", "Interview Descriptions": "Two interview process. First interview was held over a zoom call. Second interview was held in person at their downtown location. Both were very quick interviews that lasted for about 10 minutes.", "Interview Questions": "Why are you interested in working in dental?"}, {"date": "20 Jun 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Dental Association", "Interview Descriptions": "Bureaucratic.  Met with supervisor, supervisor's boss and HR.  The process is very dependent on the supervisor and their level of preparation.  Would have preferred to also meet with individuals who report to the position", "Interview Questions": "The questions were generic and didn't inform me a lot about the job"}, {"date": "3 May 2022", "title": "Manager, Education Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Dental Association", "Interview Descriptions": "There are several layers to their job interview process. HR staff is amicable. The technology used to interview includes Zoom, individual, and panel discussions.  Most teams have been in their roles for a while.", "Interview Questions": "Please provide examples that demonstrate the detail-oriented work you have performed in current and prior positions."}, {"date": "13 Apr 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Dental Association", "Interview Descriptions": "1st round with hiring manager\r\n2nd round with team\r\n3rd round with manager\r\noverall not too bad, pretty standard and easy. Don't stress everyone is super nice and friendly. would recommend this company to everyone", "Interview Questions": "Why do you like ADA?"}, {"date": "8 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at American Dental Association in Dec 2021", "Interview Descriptions": "Phone screen with a recruiter, followed by a Zoom interview with the hiring manager. Both interviews went fine, but it took them over a month to tell me “no.” Having to constantly follow up was a bit of a pain, and felt like they were keeping me on the back burner or completely forgot about me.", "Interview Questions": "Do you work well with difficult people?"}, {"date": "13 Nov 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at American Dental Association (Chicago, IL) in Sept 2021", "Interview Descriptions": "Had an initial phone screening that went well, asked about my experience with both print and digital design as well as my knowledge of design programs. Was asked for a 2nd interview with a member of the design department, and I declined that interview as another opportunity was presented.", "Interview Questions": "Asked about my knowledge of print and digital design. Basic HR questions about what programs I would use to execute specific roles. Also asked about content management platforms such as Hubspot to post scheduled content."}, {"date": "26 Jun 2022", "title": "Test Facilitator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American Dental Association (New Home, TX) in Aug 2020", "Interview Descriptions": "The interview process took months.  I was pushed quickly to the final one and they had already begun the background check because the hiring mngr wanted to hire me. But then the upper management didn't like that I didn't have a Masters Degree", "Interview Questions": "Describe a project that you had to work on. How did you approach it, from start to finish?"}, {"date": "16 Aug 2020", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Dental Association (Chicago, IL) in Jun 2020", "Interview Descriptions": "Due to circumstances it was a good interview. It was over zoom and the manager was pretty accommodating for the interview time. Asked fair questions about what kind of person I am and if I was aware of the dental industry. It was a nice calm, open and relaxed interview. Did not feel pressured of uncomfortable either.", "Interview Questions": "Why do you think you are a good fit for the company?"}, {"date": "1 Oct 2020", "title": "Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Dental Association in May 2020", "Interview Descriptions": "Applied online. Someone reached out with an email to set up a phone interview. This took a few weeks. The final interview was in-person and about an hour or two. Interviewed with multiple people and spoke to various members of the department.", "Interview Questions": "Your biggest strength and biggest weakness"}], [{"date": "5 Mar 2019", "title": "Senior Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at American Dental Association (Chicago, IL) in Feb 2019", "Interview Descriptions": "A series of Interviews; Started with a phone interview with HR Recruiter,  an in person interview with 2 hiring managers and a final interview with the head of the Program.", "Interview Questions": "What is your preferred managment style?"}, {"date": "19 Aug 2018", "title": "Senior Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at American Dental Association", "Interview Descriptions": "Responsible for building the website for ADA in asp.net.  Build to take surveys from the dental organizations across the nation. This included online forms with MS SQL Server back end.", "Interview Questions": "Do you have any questions ?"}, {"date": "11 Jun 2018", "title": "Event Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Dental Association (Chicago, IL) in Jun 2018", "Interview Descriptions": "I applied online. Received the standard \"I was highly impressed with your resume and would like to schedule a phone interview this week or next week. Please let me know what times and dates work best for you\" email in response. \r\n\r\nDuring the phone interview, the recruiter was cool and standoffish. Asked me to run through my resume, then immediately told me I was not qualified for this position. The recruiter told me they give the 'benefit of the doubt' and interview even if the candidate does not seem qualified, in case something has been left off of a resume. In reality, that 'benefit of the doubt' cost me hours of preparation and anxiety, as well as time I could have been applying for other positions.", "Interview Questions": "Run through your resume, how many years does it add up to?"}, {"date": "17 Sept 2018", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at American Dental Association (Chicago, IL) in Jun 2018", "Interview Descriptions": "Initial phone interview which lasted about an hour, followed by two in person interviews at their office a month later. The hiring manager read questions straight off a sheet and didn’t seem very interested or engaged in being there. I never received any kind of update or follow up  after that.", "Interview Questions": "Describe a time you had to suggest something against a manager’s wishes "}, {"date": "27 Sept 2017", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at American Dental Association (Chicago, IL)", "Interview Descriptions": "I was informed of the job and applied online. I had a phone interview with HR and then two rounds of in person interviews. I waited less than a week fir the offer.", "Interview Questions": "What about this job attracts you?"}, {"date": "19 Sept 2017", "title": "Human Resources Administrator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Dental Association (Chicago, IL) in Sept 2017", "Interview Descriptions": "Recruiter called and emailed.  Surprised to hear their HR team is so small, and primarily temps/contractor.  Disappointed in the professionalism of the recruiter. Unable to provide compensation range for this position.  Recruiter had very little knowledge or authority to provide additional information. Does not sound like an organization with sound HR practices.", "Interview Questions": "How do you \"feel\" about your Microsoft Office skills?"}, {"date": "9 Feb 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Dental Association (Chicago, IL)", "Interview Descriptions": "You are invited for a short interview that provides you with more information regarding the position.  Then, depending upon the position for which you are applying, you are required to take short reading and writing competency exams and are tested on a few Microsoft Office components.", "Interview Questions": "What does working for a non for profit organization mean to you?"}, {"date": "10 Sept 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Dental Association (Chicago, IL) in Sept 2011", "Interview Descriptions": "Met with eight people I would be working with (either directly or indirectly) in two groups. The questions were informative and staff was engaged. I have to write at least 30 words on the hiring and interview process and honestly, it was nothing more than I wrote above.", "Interview Questions": "What attracted me to the position?"}]]