[[{"date": "25 May 2022", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "It was general and they gave more situations asking how we will handle it. Also, more questions were asked on the time management, risk management, etc. The whole interview process was very generic", "Interview Questions": "What made you apply for this role"}, {"date": "26 Mar 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "There is no interview. The decision made based on your transcript and grade you earned in each courses that you took in your degree. Also, it makes on your ability to make commitment for the job for the whole semester.", "Interview Questions": "N/A"}, {"date": "28 Nov 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Houston-Clear Lake in Aug 2021", "Interview Descriptions": "The interview process was surprisingly through and a good introduction to a professional interview process for students with great feedback afterwards. It was conducted entirely through zoom with interviewers asking basic questions to more complex questions regarding diversity, inclusion, and work preference", "Interview Questions": "Why did you apply for this position? "}, {"date": "25 Jun 2021", "title": "Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "The inteview was actually three stages and it was easy to after application pick in which they will be looking after the experience I do have in the same field and the question will be asking in the same situation", "Interview Questions": "How is your experience in handling team"}, {"date": "10 Jun 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jan 2021", "Interview Descriptions": "They asked few questions academic standing matters,\n it was quick not too hard more situational questions, interview when I applied was held through zoom. Overall it was simple and straightforward no need to be nervous", "Interview Questions": "How to provide student with care if showing sign of struggling on topic?"}, {"date": "25 Jun 2021", "title": "Student Diplomat (On-campus Job) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Feb 2020", "Interview Descriptions": "Really straightforward  quiestions and very specific with the requirements. Quick process and quick response.  All the duties were explained completely and in detail.  good experience overall. Friendly people and flexible.", "Interview Questions": "can you tell me your availability during the week?"}, {"date": "25 Jun 2021", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston-Clear Lake in May 2019", "Interview Descriptions": "There was no interview. I submitted an online application and later received an offer via voicemail and email. The director of my department later told me that they were too behind on some things to make time to interview me for the position.", "Interview Questions": "No interview questions were asked"}, {"date": "18 Feb 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX)", "Interview Descriptions": "Two rounds of interview with four co-ordinators which was mostly behavioral questions. Only thing is if you are an international student you should have a little bit of luck for you to get an interview.", "Interview Questions": "Mostly behavioral questions."}, {"date": "21 May 2019", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Dec 2018", "Interview Descriptions": "It was a normal interview with 15 mins presentation followed by behavioral and logical questions that involved critical thinking  and cross questioning past experience is the key for all the answers where you can support your answers", "Interview Questions": "Behavioral question with scenarios"}, {"date": "28 Jan 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston-Clear Lake (Houston, TX) in Apr 2018", "Interview Descriptions": "Group interview with 3 employers in total - they took turns asking questions. Very normal questions mostly asking about things like what did you do when a customer was upset with you, etc.", "Interview Questions": "Anything about FERPA - they will probably ask you something about a husband trying to find their wife and asking you to look up their class and where they are, saying it's an emergency, and what would you do."}], [{"date": "29 Nov 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jan 2018", "Interview Descriptions": "It was very straight forward because I had previous experience in the position. The lecturer had already come in with my resume. So he quickly scanned through it and said I will hear back from him. It did not take long before he got back to me.", "Interview Questions": "So why do you think you are the best person for this position?"}, {"date": "25 Aug 2021", "title": "Part Time Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston-Clear Lake (Houston, TX) in May 2017", "Interview Descriptions": "Was nice and easy as it was a part-time work study job as I am a student at University of Houston-Clear lake and I left the job when I graduated from the University.", "Interview Questions": "Why are your expectations for this job?"}, {"date": "30 Jul 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake in Apr 2017", "Interview Descriptions": "Applied for the job online. Got called for an interview about a week or so later. Skype interview with 4 members of the advising team. The interview lasted about 20 minutes.", "Interview Questions": "Tell us about a mistake you made and what you did to correct it."}, {"date": "19 Jul 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jan 2017", "Interview Descriptions": "Everything went well. It's student job so it's easy to get the job. They ask about my grades, my experience working with international students, commute time and class schedules. There is no hard or technical questions.", "Interview Questions": "About my experiences in resume."}, {"date": "2 Feb 2017", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Houston-Clear Lake (South Houston, TX) in Mar 2016", "Interview Descriptions": "First I received an email asking if I could come in for an interview.  It was casually written and was a tip off of things to come.  My advice is to pick up on how you are treated from the very first communication.  It gives clues how your time will go in the future.   My future supervisor was the interviewee.  It was very informal.", "Interview Questions": "How would I handle conflict?"}, {"date": "20 Dec 2016", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Nov 2015", "Interview Descriptions": "The interview process was in two rounds : \r\n1. COding question 1. I could solve this in one day\r\n2. Coding question which took 3 days to solve and submit.\r\n\r\nThis was a great experience. I could prove my talent and obtain this job amongst many students.\r\nThis brought a real change in my career and helped me improve professionally and get accumsted to the American work culture.", "Interview Questions": "The interview process was in two rounds : \r\n1. COding question 1. I could solve this in one day\r\n2. Coding question which took 3 days to solve and submit."}, {"date": "28 Sept 2015", "title": "Web Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Houston-Clear Lake (Denver, CO) in Sept 2015", "Interview Descriptions": "Email contact based on qualifications. Asked questions related to my courses at my University. Asked questions on Drupal, .NET and object oriented programming questions. Asked me questions on sql and pl/sql. Asked me one question on resolving a networking issue. They also asked me about my experience in the IT industry. Additionally they asked about the assignments as a Teaching Assistant.", "Interview Questions": "Asked me questions on drupal and .net"}, {"date": "14 Jan 2019", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Aug 2015", "Interview Descriptions": "Fairly Straightforward \r\nOne on one with professor\r\nYour GPA\r\nKnowledge of the subject\r\nPassion to coach and help students\r\nInterest in research assistance\r\nAbility to work with students\r\nIf professor satisfied, she will recommend to HOD. Seek approval from HOD and move forward with HR formalities", "Interview Questions": "What is your experience with the subject?"}, {"date": "10 Nov 2015", "title": "Secretary Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Aug 2015", "Interview Descriptions": "They have a search committee for most any job.  If you are very qualified for the job you may get an interview.  Everything is very slow because the HR office is missing a director and poorly operating.", "Interview Questions": "There is a standard bank of questions which always include:  how did you handle a recent conflict? why do you want this job? why do you want to work here? The interviews are long (perhaps an hour) and you will more than likely be in the room with at least 2 people asking questions.  My recent interview I was interviewed for a low level secretary job by 5 people at once.  It will really help you if you review the materials for interviews on glass door and prepare your answers ahead of time because they will always ask you a lot of questions.  if you have a general idea what you'll say, you'll feel much more at ease.  "}, {"date": "4 Dec 2019", "title": "Music Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Houston-Clear Lake (Pasadena, TX) in Jun 2015", "Interview Descriptions": "it was an interview with the head of the music director. i was offered the job on the spot. the director of the school was my jazz band director twenty years ago", "Interview Questions": "will you work for less money than UH"}], [{"date": "5 Apr 2019", "title": "Environmetal Safety and Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston-Clear Lake (Houston, TX) in Mar 2015", "Interview Descriptions": "After the phone interview, you may receive another call for a group/panel interview. The panel will consist of 1 director, 2 coordinators,  and 1 staff & 1 faculty member from another department. They will call references.", "Interview Questions": "Tell us about a time you handled a difficult situation at work? And other basic interview questions. Nothing out of the ordinary."}, {"date": "5 Dec 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston-Clear Lake (Houston, TX) in Dec 2014", "Interview Descriptions": "Initially, only students with exceptionally high GPA and great performance in class are eligible to apply for the position. Students who meet the requirements will then apply online in the UHCL system. The required documents include:recent Transcript, Three recommend letters, etc. The faculty will pick a short list and ask for an interview.", "Interview Questions": "What extra curriculum activities you've done for the school?"}, {"date": "12 Apr 2018", "title": "Senior Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Oct 2014", "Interview Descriptions": "I Received a call to set up an  interview from a search committee.  There we're three commitee members that interviewed me. Several weeks afterI received a call from HR to verify I got the job and If I would accept.", "Interview Questions": "Tell us about yourself"}, {"date": "3 Sept 2014", "title": "Senior Secretary Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "The interview was more like a casual conversation versus a typical one.  Kind of odd but refreshing at the same time.\r\n\r\nSkills test was and still is required, but it is very easy and the HR staff are great.", "Interview Questions": "There were no difficult or unexpected questions."}, {"date": "5 Sept 2015", "title": "Business Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jun 2014", "Interview Descriptions": "Face to face, then second interview, phone call from HR with offer and started two weeks later, easy very personable interviewer. Tour around department and introductions to other co-workers. Given some information on what they do include such as quick review of benefits etc.", "Interview Questions": "Strengths/Weakneses,related experience"}, {"date": "29 Jun 2017", "title": "Customer Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jun 2014", "Interview Descriptions": "Laid back and casual. Someone will be sent down to show you where you go for the interview. Initially there is just the supervisor but another associate will be in the room later.  Mostly questions on your availability and if you really understand the position you are being hired for.", "Interview Questions": "Can you come to work on time consistently or at least give a day notice if you will be unable to come in."}, {"date": "24 Feb 2014", "title": "Enrollment Management Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "If your resume gets selected it will be a 2 to 3 step process. First step will the phone interview, if you do well on the phone interview then you will be called to do an in person interview. For your in person interview, they will ask you to prepare a 5 to 10 minute presentation about the university admission process - basically they want you to act as if you are the EMC presenting to a group of prospective students. After your presentation, you will then have a Q&A interview with the committee and then there will be a one-on-one interview with your future direct supervisor. Generally there are about four members in the hiring committee, however, in the presentation portion all EMCs (your future co-workers/team members) are invited to sit in on the presentation, even if they are not on the hiring committee. The EMCs present will also be rating you on your presentation skills and will give the evaluation to the hiring committee.", "Interview Questions": "They will give you a few situational questions to see how you would act/react in a certain situation to prospective students, parents and even staff."}, {"date": "4 Dec 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston-Clear Lake (Houston, TX) in Aug 2013", "Interview Descriptions": "Simple processing. I just filled a TA application form. And later on, my adviser called me about my application. We met his office and asked several questions about subject and my teaching experiences. He would like to learn my dedication about the subject. I just played a positive role because this will my first teaching experience.", "Interview Questions": "They asked that do I know subject or not? Asked several questions but they are general questions. "}, {"date": "26 Sept 2017", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston-Clear Lake in Jan 2013", "Interview Descriptions": "Well-informed and thorough recruitment process. The interviewers knew what skills and expertise they were looking for and communicated clearly during the interview. The interview climate was very supportive and friendly.", "Interview Questions": "Question about your weakness."}]][[{"date": "25 May 2022", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "It was general and they gave more situations asking how we will handle it. Also, more questions were asked on the time management, risk management, etc. The whole interview process was very generic", "Interview Questions": "What made you apply for this role"}, {"date": "26 Mar 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "There is no interview. The decision made based on your transcript and grade you earned in each courses that you took in your degree. Also, it makes on your ability to make commitment for the job for the whole semester.", "Interview Questions": "N/A"}, {"date": "28 Nov 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Houston-Clear Lake in Aug 2021", "Interview Descriptions": "The interview process was surprisingly through and a good introduction to a professional interview process for students with great feedback afterwards. It was conducted entirely through zoom with interviewers asking basic questions to more complex questions regarding diversity, inclusion, and work preference", "Interview Questions": "Why did you apply for this position? "}, {"date": "25 Jun 2021", "title": "Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "The inteview was actually three stages and it was easy to after application pick in which they will be looking after the experience I do have in the same field and the question will be asking in the same situation", "Interview Questions": "How is your experience in handling team"}, {"date": "10 Jun 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jan 2021", "Interview Descriptions": "They asked few questions academic standing matters,\n it was quick not too hard more situational questions, interview when I applied was held through zoom. Overall it was simple and straightforward no need to be nervous", "Interview Questions": "How to provide student with care if showing sign of struggling on topic?"}, {"date": "25 Jun 2021", "title": "Student Diplomat (On-campus Job) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Feb 2020", "Interview Descriptions": "Really straightforward  quiestions and very specific with the requirements. Quick process and quick response.  All the duties were explained completely and in detail.  good experience overall. Friendly people and flexible.", "Interview Questions": "can you tell me your availability during the week?"}, {"date": "25 Jun 2021", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston-Clear Lake in May 2019", "Interview Descriptions": "There was no interview. I submitted an online application and later received an offer via voicemail and email. The director of my department later told me that they were too behind on some things to make time to interview me for the position.", "Interview Questions": "No interview questions were asked"}, {"date": "18 Feb 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX)", "Interview Descriptions": "Two rounds of interview with four co-ordinators which was mostly behavioral questions. Only thing is if you are an international student you should have a little bit of luck for you to get an interview.", "Interview Questions": "Mostly behavioral questions."}, {"date": "21 May 2019", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Dec 2018", "Interview Descriptions": "It was a normal interview with 15 mins presentation followed by behavioral and logical questions that involved critical thinking  and cross questioning past experience is the key for all the answers where you can support your answers", "Interview Questions": "Behavioral question with scenarios"}, {"date": "28 Jan 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Houston-Clear Lake (Houston, TX) in Apr 2018", "Interview Descriptions": "Group interview with 3 employers in total - they took turns asking questions. Very normal questions mostly asking about things like what did you do when a customer was upset with you, etc.", "Interview Questions": "Anything about FERPA - they will probably ask you something about a husband trying to find their wife and asking you to look up their class and where they are, saying it's an emergency, and what would you do."}], [{"date": "29 Nov 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jan 2018", "Interview Descriptions": "It was very straight forward because I had previous experience in the position. The lecturer had already come in with my resume. So he quickly scanned through it and said I will hear back from him. It did not take long before he got back to me.", "Interview Questions": "So why do you think you are the best person for this position?"}, {"date": "25 Aug 2021", "title": "Part Time Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Houston-Clear Lake (Houston, TX) in May 2017", "Interview Descriptions": "Was nice and easy as it was a part-time work study job as I am a student at University of Houston-Clear lake and I left the job when I graduated from the University.", "Interview Questions": "Why are your expectations for this job?"}, {"date": "30 Jul 2017", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake in Apr 2017", "Interview Descriptions": "Applied for the job online. Got called for an interview about a week or so later. Skype interview with 4 members of the advising team. The interview lasted about 20 minutes.", "Interview Questions": "Tell us about a mistake you made and what you did to correct it."}, {"date": "19 Jul 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jan 2017", "Interview Descriptions": "Everything went well. It's student job so it's easy to get the job. They ask about my grades, my experience working with international students, commute time and class schedules. There is no hard or technical questions.", "Interview Questions": "About my experiences in resume."}, {"date": "2 Feb 2017", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Houston-Clear Lake (South Houston, TX) in Mar 2016", "Interview Descriptions": "First I received an email asking if I could come in for an interview.  It was casually written and was a tip off of things to come.  My advice is to pick up on how you are treated from the very first communication.  It gives clues how your time will go in the future.   My future supervisor was the interviewee.  It was very informal.", "Interview Questions": "How would I handle conflict?"}, {"date": "20 Dec 2016", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Nov 2015", "Interview Descriptions": "The interview process was in two rounds : \r\n1. COding question 1. I could solve this in one day\r\n2. Coding question which took 3 days to solve and submit.\r\n\r\nThis was a great experience. I could prove my talent and obtain this job amongst many students.\r\nThis brought a real change in my career and helped me improve professionally and get accumsted to the American work culture.", "Interview Questions": "The interview process was in two rounds : \r\n1. COding question 1. I could solve this in one day\r\n2. Coding question which took 3 days to solve and submit."}, {"date": "28 Sept 2015", "title": "Web Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Houston-Clear Lake (Denver, CO) in Sept 2015", "Interview Descriptions": "Email contact based on qualifications. Asked questions related to my courses at my University. Asked questions on Drupal, .NET and object oriented programming questions. Asked me questions on sql and pl/sql. Asked me one question on resolving a networking issue. They also asked me about my experience in the IT industry. Additionally they asked about the assignments as a Teaching Assistant.", "Interview Questions": "Asked me questions on drupal and .net"}, {"date": "14 Jan 2019", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Houston-Clear Lake (Houston, TX) in Aug 2015", "Interview Descriptions": "Fairly Straightforward \r\nOne on one with professor\r\nYour GPA\r\nKnowledge of the subject\r\nPassion to coach and help students\r\nInterest in research assistance\r\nAbility to work with students\r\nIf professor satisfied, she will recommend to HOD. Seek approval from HOD and move forward with HR formalities", "Interview Questions": "What is your experience with the subject?"}, {"date": "10 Nov 2015", "title": "Secretary Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Aug 2015", "Interview Descriptions": "They have a search committee for most any job.  If you are very qualified for the job you may get an interview.  Everything is very slow because the HR office is missing a director and poorly operating.", "Interview Questions": "There is a standard bank of questions which always include:  how did you handle a recent conflict? why do you want this job? why do you want to work here? The interviews are long (perhaps an hour) and you will more than likely be in the room with at least 2 people asking questions.  My recent interview I was interviewed for a low level secretary job by 5 people at once.  It will really help you if you review the materials for interviews on glass door and prepare your answers ahead of time because they will always ask you a lot of questions.  if you have a general idea what you'll say, you'll feel much more at ease.  "}, {"date": "4 Dec 2019", "title": "Music Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Houston-Clear Lake (Pasadena, TX) in Jun 2015", "Interview Descriptions": "it was an interview with the head of the music director. i was offered the job on the spot. the director of the school was my jazz band director twenty years ago", "Interview Questions": "will you work for less money than UH"}], [{"date": "5 Apr 2019", "title": "Environmetal Safety and Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Houston-Clear Lake (Houston, TX) in Mar 2015", "Interview Descriptions": "After the phone interview, you may receive another call for a group/panel interview. The panel will consist of 1 director, 2 coordinators,  and 1 staff & 1 faculty member from another department. They will call references.", "Interview Questions": "Tell us about a time you handled a difficult situation at work? And other basic interview questions. Nothing out of the ordinary."}, {"date": "5 Dec 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Houston-Clear Lake (Houston, TX) in Dec 2014", "Interview Descriptions": "Initially, only students with exceptionally high GPA and great performance in class are eligible to apply for the position. Students who meet the requirements will then apply online in the UHCL system. The required documents include:recent Transcript, Three recommend letters, etc. The faculty will pick a short list and ask for an interview.", "Interview Questions": "What extra curriculum activities you've done for the school?"}, {"date": "12 Apr 2018", "title": "Senior Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Houston-Clear Lake (Houston, TX) in Oct 2014", "Interview Descriptions": "I Received a call to set up an  interview from a search committee.  There we're three commitee members that interviewed me. Several weeks afterI received a call from HR to verify I got the job and If I would accept.", "Interview Questions": "Tell us about yourself"}, {"date": "3 Sept 2014", "title": "Senior Secretary Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "The interview was more like a casual conversation versus a typical one.  Kind of odd but refreshing at the same time.\r\n\r\nSkills test was and still is required, but it is very easy and the HR staff are great.", "Interview Questions": "There were no difficult or unexpected questions."}, {"date": "5 Sept 2015", "title": "Business Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jun 2014", "Interview Descriptions": "Face to face, then second interview, phone call from HR with offer and started two weeks later, easy very personable interviewer. Tour around department and introductions to other co-workers. Given some information on what they do include such as quick review of benefits etc.", "Interview Questions": "Strengths/Weakneses,related experience"}, {"date": "29 Jun 2017", "title": "Customer Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Houston-Clear Lake (Houston, TX) in Jun 2014", "Interview Descriptions": "Laid back and casual. Someone will be sent down to show you where you go for the interview. Initially there is just the supervisor but another associate will be in the room later.  Mostly questions on your availability and if you really understand the position you are being hired for.", "Interview Questions": "Can you come to work on time consistently or at least give a day notice if you will be unable to come in."}, {"date": "24 Feb 2014", "title": "Enrollment Management Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Houston-Clear Lake", "Interview Descriptions": "If your resume gets selected it will be a 2 to 3 step process. First step will the phone interview, if you do well on the phone interview then you will be called to do an in person interview. For your in person interview, they will ask you to prepare a 5 to 10 minute presentation about the university admission process - basically they want you to act as if you are the EMC presenting to a group of prospective students. After your presentation, you will then have a Q&A interview with the committee and then there will be a one-on-one interview with your future direct supervisor. Generally there are about four members in the hiring committee, however, in the presentation portion all EMCs (your future co-workers/team members) are invited to sit in on the presentation, even if they are not on the hiring committee. The EMCs present will also be rating you on your presentation skills and will give the evaluation to the hiring committee.", "Interview Questions": "They will give you a few situational questions to see how you would act/react in a certain situation to prospective students, parents and even staff."}, {"date": "4 Dec 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Houston-Clear Lake (Houston, TX) in Aug 2013", "Interview Descriptions": "Simple processing. I just filled a TA application form. And later on, my adviser called me about my application. We met his office and asked several questions about subject and my teaching experiences. He would like to learn my dedication about the subject. I just played a positive role because this will my first teaching experience.", "Interview Questions": "They asked that do I know subject or not? Asked several questions but they are general questions. "}, {"date": "26 Sept 2017", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Houston-Clear Lake in Jan 2013", "Interview Descriptions": "Well-informed and thorough recruitment process. The interviewers knew what skills and expertise they were looking for and communicated clearly during the interview. The interview climate was very supportive and friendly.", "Interview Questions": "Question about your weakness."}]]