[[{"date": "16 Jun 2021", "title": "Senior Teaman Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Nobody Likes Onions", "Interview Descriptions": "Was good, checked if I brought tea to people properly. Was good, checked if I brought tea to people Was good, checked if I brought tea to people properly. .", "Interview Questions": "How are you doing today"}, {"date": "10 Nov 2020", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nobody Likes Onions (London, ON) in Jan 2019", "Interview Descriptions": "Fair process and satisfying overall. The interview then group discussions than a personal interview with the director and confirmation letter overall good for freshers and satisfying would recommend everyone", "Interview Questions": "Tell me about yourself "}, {"date": "20 Feb 2014", "title": "Marketing Store Items Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nobody Likes Onions (Los Angeles, CA) in Jan 2014", "Interview Descriptions": "Home Depot - Wow!  Nowadays, nobody can see anybody before filling out an application online and answering a HUGE amount of questions.  You go to any of these stores and the Manager says, \"You will have to apply at our website!  I cannot help you get a job here!\"  When you go to the website you get this super LONG amount of questions that you answer.  With Home Depot you can apply for many jobs a once.  \r\nThen a person from Atlanta calls you and asks you a bunch of questions on a job that can barely pay the gas to the store...LOL!  \r\nThen the Manager is forced to call you if you meet the requirements of the job and give you an Interview. \r\nOne can tell that the Manager is disgusted with this whole process also.  This is something that a Human Resource person used to do!  These Upper Management people have delegated everything to a few people by these companies continually Downsizing and Decreasing Pay for more work, except the greedy Upper Management themselves!  The Manager who is paid 400 times less than a greedy Upper Manager sits down with you with this Big Book of questions to ask you. \r\nWhen you are done the Manager is really as disgusted as you are, you get the idea that they do not have much of a say in hiring you or not.", "Interview Questions": "What was you biggest mistake and what did you do about it? "}, {"date": "27 Sept 2015", "title": "Freelancer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nobody Likes Onions (Red Onion, MO) in Jan 2014", "Interview Descriptions": "It is a pretty good interview, applied through a online portal, received a call back from one of the employees to take the phone interview. Did the Phone interview. They asked to complete the challenge, which I did and they had two more online challenges which I completed. Overall It was a fun interview.", "Interview Questions": "Do you like onions"}], []]