[[{"date": "1 May 2023", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "The communication was quick and clear, they were expecting me and prepared for my arrival for the interview. I had a phone call screening, and then met with the to lead of the department one on one for in person interview.", "Interview Questions": "Why was this position of interest to me?"}, {"date": "18 Apr 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "application submitted followed by an intro call then followed by a group interview. pretty straightforward process and easy to navigate. very friendly people and very personable and questions fit the job description", "Interview Questions": "What experience do you have?"}, {"date": "19 Mar 2022", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "I had an initial phone interview and the interviewer was kind, relatable and an all around joy to speak with. I was asked back for another interview in center that will conducted soon.", "Interview Questions": "Do you have thick skin?"}, {"date": "18 Jan 2023", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Dec 2021", "Interview Descriptions": "I completed 2 interviews. One with a recruiter and one with a supervisor. There was only 1 person in both I -person interviews, and they were very relaxed and comfortable.", "Interview Questions": "Past experience Time I struggled with a past work relationship Example of past negative feedback"}, {"date": "5 Mar 2021", "title": "Patient Care Provider Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "Took too long to hear back from human resources. Then having to wait till the next open training date was almost a month away.  Once you did  get the interview scheduled it was super easy", "Interview Questions": "Dont remember any question they asked"}, {"date": "8 Jan 2021", "title": "RN Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Jan 2021", "Interview Descriptions": "Was very calm and relaxing. I felt good about the interview. I had 2 different managers interview me so I could also get to  determine which unit I would rather work.I was not asked too many questions. They told me more about their units and what they do and how they use nurses.", "Interview Questions": "Why do you want to work for Pine Rest?\nAre you interviewing with other companies?\n\n"}, {"date": "10 Dec 2020", "title": "Mental Health Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Dec 2020", "Interview Descriptions": "This interview was not too difficult. It was a phone interview that lasted maybe 15-20 minutes. The interviewer asked some questions and then talked about hours of availability and scheduling.", "Interview Questions": "Work History, Education, What are your goals for the future, Have you worked with inpatients for mental health before, What are your strengths and weaknesses, When are you available. That was my whole interview. "}, {"date": "18 Sept 2020", "title": "Psychiatric Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "I went for the interview shortly after applying which seemed a quick turnover to me, interview was going over the application and was fairly easy. I was not surprised by any questions and it was all very predictable.", "Interview Questions": "Why do you want to work at Pine Rest? "}, {"date": "10 Dec 2019", "title": "Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "It was a relaxed conversation with the director, very open to questions. I was asked back for a second interview shortly after. The director purposefully left me to talk to various staff in an informal lunch, without her there so that they could be honest with me about the place.  \r\n\r\nThe longest part came after the interview and offer were over. It is a 3 month process to get credentialed that involves a lot of paperwork. Part of that is about dealing with the company bureaucracy, part is about background checks, etc. that are always a part of this work and most is about dealing with the nightmare of modern insurance credentialing (not Pine Rest's fault). Not a huge deal if you're not in a rush to start...for me, having some time to transition is a good thing.", "Interview Questions": "Standard interview questions for the most part. "}, {"date": "27 Apr 2019", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "Phone interview with a recruiter. Waited for references to be verified. Then 2 weeks later, an interview with the Contact Center Supervisor. 2 weeks later, job was offered through email.", "Interview Questions": "What are your weaknesses?"}], [{"date": "16 Jan 2019", "title": "Nurse Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "The interview was fair. I came in dressed nice, yet I believe you should at least dress professionally. I came in with a tie and a nice shirt. Hair was groomed and I looked neat. Yet, I did not have previous patient experience, and I believe that was a major factor in what they were looking for. So I eventually did not get the position that I desired for, which is ok.", "Interview Questions": "Tell me a little bit about yourself?\r\n"}, {"date": "11 Jul 2018", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI)", "Interview Descriptions": "This was the worst interview I have ever had in my life. I was told that I was being interviewed for an online therapy position.  I had extensive conversations over the phone with two different people including the person running that program regarding the online therapy position, I was applying specifically for that position. They asked if I would be willing to do a follow-up interview in person at the Northwest Clinic. \r\n\r\nThere were two people conducting the interview and one was quiet and one was very unpleasant. When I explained that I had talked to someone about the online position and that I was coming into interview for that, I was told they didn't have enough clients for that position and they might never have enough clients for online therapy.  To me this was very odd, as a therapist who works online part of the time, that is a thriving field and I have a very full caseload. \r\n\r\nI was told that the position that they had was a contracted therapist position in person at that clinic. I was really confused at that point and I must have looked puzzled, because the interviewer asked me if there was something wrong. I wasn't even sure what to say, so I mentioned that  I lived on the other side of town and I stated that I didn't know I was interviewing for an in-person position and that being from the other side of town that was quite a drive for me. The interviewer was very cold at that point and stated that I didn't need to finish the interview and that she lived over near my area (she was not that close to where I lived, but this girl was making a lot of assumptions).   I told them I might still be interested and asked them to please tell me more about the position. It felt surreal but I was trying to stay positive. I was told that this was a contracted position and that the pay was $40.00 an hour. My face must have shown a little shock at that number because they told me that obviously wasn't enough money for me and that the interview was over.  During the telephone conversation I had, I was given a much higher number and was told that this was a salaried position, with the opporutnity to see additional clients for additional pay. As a hard worker I had excited about that.  I  was quite shocked by the rude tone and the interviewer's attempts to assume my thoughts by 'reading' my facial expressions. It wasn't professional. \r\n\r\nI spent 10 years in public service, working as a therapist with high risk clients. I had an excellent resume and excellent references. Pine Rest has a great reputation, so I was excited to be applying for a position with them. At the very least I expected a courteous interview and a professional atmosphere. I was really disappointed. This is a big organization and I have had multiple postive interactions with their various programs over the years but I would never, ever even refer a client to this particular clinic. I think something has gone wrong there.", "Interview Questions": "They didn't really bother to ask questions. "}, {"date": "30 Oct 2018", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in May 2018", "Interview Descriptions": "Interview was quick and flawless. Management was very pleasant to meet with and made you feel comfortable. It was the easiest interview I have attended. I would highly recommend this company.", "Interview Questions": "Provide something positive about yourself"}, {"date": "21 Nov 2018", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Pine Rest Christian Mental Health Services (Pella, IA) in Jan 2018", "Interview Descriptions": "Met with the director individually first to discuss the job to see if it was something I wanted to apply to, later I had a brief phone interview with someone from HR, and final was at staff meeting for us to ask questions to each other", "Interview Questions": "What is your theoretical orientation?"}, {"date": "29 May 2018", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Oct 2017", "Interview Descriptions": "Found the job on LinkedIn and was called back rather quickly, was called in for an interview and was hired on the spot because of how short staffed they are. Then training took a number of weeks and most of the learning actually takes place on the job where you keep a small amount of your training but mostly use a faster variation that's less proper", "Interview Questions": "Name a Time you overcame a challenge"}, {"date": "11 Jul 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI)", "Interview Descriptions": "Got a call within 48 hours of applying on Pine Rest website. Phone call interview was about 25 minutes and was basic questioning. Came into Grand Rapids for an interview with HR and then interview with RN managers in the hospital. Total time was about 1 hour. Questions were good and everyone was nice and seemed interested in my answers.", "Interview Questions": "Describe a time when you dealt with a combative patient. "}, {"date": "8 Jul 2016", "title": "PCP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "Generic questions. They're so desperate for employees, they'll practically hire anyone. Just prepare for standard questions. Here are some more words, so I meet the minimum required amount. And I guess I'll add even more here...", "Interview Questions": "\"How did you handle conflict with a coworker in the past?\""}, {"date": "24 Feb 2016", "title": "Position On Human Resources Team Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Jan 2016", "Interview Descriptions": "I was contacted fairly soon after applying for the position. There was an initial phone interview with the recruiter where I was asked typical questions and for a sort-of run down of my interest and experience. I came in the following week for an in-person interview with the HR team (4 people), and they were all very nice and friendly.", "Interview Questions": "The people interviewing me actually had a long list of pretty detailed questions, many that took some serious on-the-spot thinking back to specific situations. This was kind of difficult because it's hard to remember specific situations from several years ago, but as long as you have a solid understanding of you past experiences, you should be okay."}, {"date": "12 Apr 2016", "title": "Patient Care Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Jul 2015", "Interview Descriptions": "Applied online, immediately got a call from a recruiter to set up an interview for about a week later. Interviewed with two hiring managers for about 15 mins. The questions were entirely based on the work of the employees, not the stupid \"tell me about a time\" questions. All the questions were relevant to the work on the job. The most important one was about how you would handle a potentially dangerous situation with an agitated patient. I got that question from every behavioral health facility I interviewed in.", "Interview Questions": "How would you handle a situation in which a patient became agitated and threatening toward you?"}, {"date": "10 Jan 2015", "title": "Patient Care Provider Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Pine Rest Christian Mental Health Services", "Interview Descriptions": "Phone interview was decent with standard interview questions. Did not hear back from the phone interview for 3 weeks. \r\nIn person interview was basic. I was offered a job at the end of the interview.", "Interview Questions": "What is your previous experience working with children? "}], [{"date": "11 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Feb 2014", "Interview Descriptions": "It was very relaxed, and open interview with questions regarding my passion for the field and about my personality. \r\nQuestions about my flexibility and ability to work under pressure as the only RN per shift with a nurse to patient ratio of approx 1:6 however this is ambulatory detox - the patients are not critically ill or bedridden. They are in a voluntary setting and WANT to get treatment. They want help so the environment is positive.", "Interview Questions": "How do you handle stress"}, {"date": "13 Oct 2015", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Sept 2013", "Interview Descriptions": "I applied online but also knew someone that worked there so I received a call back right away. Went in for an interview - got a call back the next day and accepted the position.", "Interview Questions": "Q: Tell me about your previous experience\r\nQ: Why would you be good for this job?\r\nQ: What is your greatest strength and weakness?"}, {"date": "12 Jan 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Sept 2013", "Interview Descriptions": "Phone interview with HR and then past on to unit manager for in person interview.   You will need to pass a background check and then drug screen.", "Interview Questions": "What do you do for self care of yourself?"}, {"date": "16 May 2016", "title": "Resident Care Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Mar 2013", "Interview Descriptions": "It was very easy and laid back. I had an interview for maybe 15 minutes. Then I hopped in the  managers car for a tour of the home I would be working for because I got the job within the 15 minutes. They never drug tested me like they were supposed to though. I only got it because of my sister working there.", "Interview Questions": "How do you handle stress? How are you with bad smells?"}, {"date": "20 Jan 2013", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Jul 2011", "Interview Descriptions": "I had to be aggressive and conisitantly contact the hiring manager via email/phone.  The interview was somewhat cansual and comfortable.  The hiring manager seemed tired and therefore as long as I catered to her situation and let her kinda open up about herself, it made the interview easy.", "Interview Questions": "Explaining my leaving my former emplyment.  I felt as if she was completely analyzing my and dissecting every word."}, {"date": "25 Jul 2012", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Pine Rest Christian Mental Health Services (Traverse City, MI) in Apr 2011", "Interview Descriptions": "I had a one on one interview. The manager was very laid back. I have been told the manager has since changed and that the replacement is very laid back as well. There were not many questions. It was more of just a long conversation of what my experience was like etc.", "Interview Questions": "N/A"}, {"date": "3 Oct 2011", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Pine Rest Christian Mental Health Services (Grand Rapids, MI) in Aug 2010", "Interview Descriptions": "A few weeks after I applied I received a phone call and an impromptu phone interview with the staffing office. It was a very basic interview (i.e. Why do you want to work for Pine Rest?, What experience do you have?). During that same phone call I was scheduled for an in-person interview with the nurse manager of the unit. I met with her a few days later. She asked me some of the same questions, in addition to others such as:\r\nWould you be comfortable retraining a patient if necessary?\r\nGive examples of an adverse work environment that you have experienced and how you handled this?\r\nWhy should we hire you?\r\n\r\nIt was a pretty easy interview. She offered me the job on the spot.", "Interview Questions": "Are you looking elsewhere for a job?"}]]