[[{"date": "15 Feb 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Junior Achievement USA (Chicago, IL) in Dec 2022", "Interview Descriptions": "I was contacted for an interview, set a date and time, then no one showed up to the interview. I followed up with an email and called and no one ever responded to me. JA clearly does not respect applicant’s time", "Interview Questions": "No one attended the interview"}, {"date": "14 Jul 2022", "title": "Telephone Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Junior Achievement USA", "Interview Descriptions": "Too casual in demeanour and approach, it seemed that they had a disregard for others time. Disappointed that it isn’t all of which it seems which is a shame. Im sure it may have been a one off then an organisational culture", "Interview Questions": "Typical routine activities you would deem related to this role.\r\nRate them in priority order and justify your choice"}, {"date": "14 Sept 2021", "title": "Program Manager Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Junior Achievement USA (Milwaukee, WI)", "Interview Descriptions": "Received a phone call, spoke for a while, said he would be reaching out to the Director and HR Manager to set up interview and would get back to me the following day. It took two weeks to get a call back and another 2 plus weeks to get a start date after being offered the position.", "Interview Questions": "What is your availability like?"}, {"date": "19 May 2021", "title": "Design Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Junior Achievement USA", "Interview Descriptions": "The interview process wasn't anything unexpected. The questions asked were pretty straightforward and not challenging because they wanted to get to know you more as a person and see your potential.", "Interview Questions": "Why do you want to work at our company?"}, {"date": "29 Jan 2021", "title": "Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Junior Achievement USA", "Interview Descriptions": "Good experience where I felt at ease but not completely due to the wide ranging variety and difficulty of the questions. Kept me on my toes  but there were moments of anxiety and  friendliness at the same time.", "Interview Questions": "Tell me about yourself and career goals."}, {"date": "20 May 2021", "title": "Engenheiro Civil Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Junior Achievement USA (Chicago, IL) in Jan 2021", "Interview Descriptions": "show demias foi bem bacana muito educados e legais na entrevista, gostei muito! Além de ser uma otima empresa nos estados unidos da america. Me fizeram uma oferta mas recusei pois nao quero sair do brasil no momento.", "Interview Questions": "perguntaram se eu gostava de hugby"}, {"date": "31 Aug 2019", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Junior Achievement USA", "Interview Descriptions": "I had a phone screening with Wendy, a newly hired talent manager. She either didn't read my resume or didn't understand what was on it, which is not a problem I've encountered before. Also, she was verbose in many of her questions and descriptions of what the position would be like. This would be less of a problem in person but is made worse over the phone. While I was already slightly negative towards the position because of the company's reviews on Glassdoor and Indeed, my experience with Wendy has snuffed out any interest I had whatsoever; if these are the people that Junior Achievement of Chicago hires, I don't want to be a part of it.", "Interview Questions": "N/A"}, {"date": "12 Sept 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Junior Achievement USA (Chicago, IL) in Aug 2019", "Interview Descriptions": "Phone interview then in person interview. She asked me if I had experience in selling a program and how I would do it. Then in the in person interview they asked me general questions. After that I gave a presentation of the program.", "Interview Questions": "They asked about my background. "}, {"date": "15 Jul 2019", "title": "Monitoring and Evaluation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Junior Achievement USA (New York, NY)", "Interview Descriptions": "After the application, you get psychometric questions to answer, then a situational interview process in which is 3 stages. The final interview is with the board of directors, pretty fun when you get the hang of it.", "Interview Questions": "How would you describe paying attention to detail?"}, {"date": "22 Jan 2019", "title": "Education Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Junior Achievement USA", "Interview Descriptions": "A brief interview with former manager and President. They sat me down asked me a hand full of questions about their mission and so on and so forth. After the first round, I was called back for more of the same.", "Interview Questions": "What matters most to you "}], [{"date": "11 Oct 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Junior Achievement USA", "Interview Descriptions": "I had to do a mock teaching session in front of 5 current program managers. I didn't really know what they were looking for in my presentation, but it was a little stressful.", "Interview Questions": "Why do you want to work for us?"}, {"date": "15 Feb 2019", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Junior Achievement USA (New York, NY) in Oct 2018", "Interview Descriptions": "I applied online and then two weeks later, I did a phone interview with the office manager and then I was called in for an in person interview. Two days later, I got the job.", "Interview Questions": "Describe a situation when you had to manage multiple demands on your time? How did you prioritize your time and what was the outcome?"}, {"date": "19 Oct 2020", "title": "President Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Junior Achievement USA (Toledo, OH) in Jul 2017", "Interview Descriptions": "Provided well documented information about the organization including financials, strategic plan, and programs. Completed an initial screening interview, then met with the hiring committee which consisted of national employee and the local executive committee.", "Interview Questions": "Quite a bit of the discussion revolved around working with a board. "}, {"date": "25 Feb 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Junior Achievement USA", "Interview Descriptions": "I interviewed with a number of staff, including president, VP, and other managers. There were phone calls and one-on-one interviews. They were very comfortable and not intimidating. You get to meet a few people you'll be working with during your interview process and ask them questions (this of course depends on the area where you'll interview).", "Interview Questions": "Tell me about your experiences you'd bring to this job \r\nWhat is one weakness, strength you have \r\nHow do you manage / prioritize your time "}, {"date": "21 Feb 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Junior Achievement USA (Houston, TX) in Sept 2016", "Interview Descriptions": "Referred by a friend. Called in for an interview. Following week was called again for second interview and met the team. 2 days later was called and made an offer.", "Interview Questions": "What do you know about junior achievement?"}, {"date": "15 Nov 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Junior Achievement USA (Cleveland, OH) in Apr 2016", "Interview Descriptions": "I had to send an email stating that I was interested with my resume and cover letter attached. Then I had a phone interview. After the phone interview, I was invited for an in-person interview. Then you have a final interview where you have to give a presentation to the entire office.", "Interview Questions": "Do you enjoy working in a fast paced environment"}, {"date": "18 Oct 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Junior Achievement USA (Houston, TX) in May 2015", "Interview Descriptions": "Pretty easy, it was your typical job interview. Parking was a bit confusing at first, but I was able to find it after a few mins. I found the job through a referral, emailed the VP my resume,  and was set up with an interview a few weeks later. Once there I filled out a small questionnaire, got a tour of the building, and then had my initial interview.", "Interview Questions": "Why do you think you'd be perfect for this job?"}, {"date": "7 Nov 2015", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Junior Achievement USA (Pittsburgh, PA) in Mar 2015", "Interview Descriptions": "There were many people hoping to be interviewed for the position.  Apparently, the hiring manager was hoping to see as many individuals as possible to find a select few to join the team. The entire process had an in and out sort of feel. The hiring representative was nice and friendly. The location was a small office building.", "Interview Questions": "Give an example where you worked in a team."}, {"date": "18 Jul 2017", "title": "Intern Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Junior Achievement USA in Jun 2014", "Interview Descriptions": "They meet me early in the morning, gave me tea and they were very friendly. They had me complete a personality test online. They had my resume in hand and read it over while asking questions about the work.", "Interview Questions": "What do you know about JA?"}, {"date": "1 Nov 2012", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Junior Achievement USA", "Interview Descriptions": "Interviews are in 2 visits. The first visit you will meet with HR to go over the position. Then you meet with the senior management. Finally, you'll go through a panel of peers, usually 3-4 people. If all goes well, you'll be invited back to meet with the President. Candidates are discussed among the team. Although peers have a say, they don't have a vote. Offers are given via phone. Decisions are relatively quick, but they wait until everyone has interviewed.", "Interview Questions": "They have a very specific script and are looking for detailed and specific answers. "}], [{"date": "8 Oct 2012", "title": "Marketing Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Junior Achievement USA (Evansville, IN) in Dec 2011", "Interview Descriptions": "The process was quite straightfoward. Apply online and then I was called in for an interview. The interview asked me what kind of specific experience I had in Marketing. After being interviewed, it was a two week period before I was hired as an intern", "Interview Questions": "What do you think makes you different than anyone else?"}, {"date": "23 Jun 2015", "title": "Bookkeeper, Special Events/Progams Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Junior Achievement USA (Jackson, MI) in Sept 2011", "Interview Descriptions": "None, just called me up when the last bookkeeper left.  she new me through my husband.  I hired in in September 2011 and since then 11 people special events and program coordinator had quit because of the president.", "Interview Questions": "Do you know peachtree?"}, {"date": "26 Sept 2011", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Junior Achievement USA (Orlando, FL) in Aug 2011", "Interview Descriptions": "Very simple process of submitting resume for consideration.  One on one interview with VP followed immediately with one on one interview with President.  Was told they would discuss and call me the following day.\r\n\r\nWas asked general knowledge questions, asked about my technological skills and confirmed my sought salary.\r\n\r\nWas called the following day and offered the position.  I explained that I had to consider it and would be in touch the following Monday.", "Interview Questions": "What is your technological background "}]]