[[{"date": "20 Oct 2022", "title": "Head Coach Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Detroit Mercy", "Interview Descriptions": "Process was typical college athletics combination of phone interview and campus interview. Unfortunately, it was clear that the institution was not willing to commit the basic resources necessary to compete with peers within the conference. The department is full of great people doing their best under extreme constraints and poor support.", "Interview Questions": "Would you be willing to work for a salary at the rock bottom of the pay scale for NCAA Division I athletics?"}, {"date": "20 Oct 2022", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Detroit Mercy", "Interview Descriptions": "Submit cover letter, teaching philosophy, writing sample, and 3 recommendation letters. Phone Interview first followed by on campus interviews with administration, hiring committee, and then a teaching demonstration with an actual course relevant to my research.", "Interview Questions": "Teaching philosophy, scholarly goals, how I would connect with surrounding community."}, {"date": "5 Jun 2023", "title": "Associate Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Detroit Mercy (Detroit, MI) in Jun 2022", "Interview Descriptions": "LV and DS Questions about mission, vision of UDM Personal questions about how you work with others (there is a reason for this due to toxic work environment) most people leave before a year.", "Interview Questions": "Q. Tell me about a time you had to have a difficult conversation with a co-worker?"}, {"date": "19 Oct 2021", "title": "I/O Psych Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Detroit Mercy (Detroit, MI) in Aug 2021", "Interview Descriptions": "Scheduled Zoom Meeting with my supervisor where he asked a series of questions. These question included case scenarios of what I would do in situations with students who feel off track with their projects.", "Interview Questions": "What would you do in a situation where a business is falling off track. "}, {"date": "27 Jan 2021", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Detroit Mercy (Detroit, MI) in Sept 2020", "Interview Descriptions": "It was a thorough process to make sure you are the right fit for the position. You will normally have a second interview with a larger group that has direct relevance to your position.", "Interview Questions": "Questions relating to the details of the job and my interest in the position."}, {"date": "1 Jul 2019", "title": "Web Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Detroit Mercy (Detroit, MI) in Jun 2019", "Interview Descriptions": "Panel of eight people interviewed me. I asked beforehand who would be there and was told hiring manager and maybe a couple other people. This was a surprise.\r\n\r\nMost questions were asked by one or two people. The other panel members were quiet, in my opinion. Most were informative and responsive as I asked questions. A couple of people stood out in the process, as I felt they went way out of their way to engage and make me feel welcome.\r\n\r\nI was invited to a \"finalist\" interview and asked to interview panel members and complete a writing test, which would be followed by more take-home writing.\r\n\r\nI was given an AP-style editing test using traditional proofreader’s marks, along with a PR writing piece, both to be completed within a half hour. Manager told me to do editing first.  \r\n\r\nI had conveyed that I hadn’t done AP writing in a number of years. I haven’t seen manual proofing since high school.\r\n\r\nFor the PR piece, I was given several sentences and no other instructions. There was no time to complete it after the editing. The take-home assignment was an article and social posts based on PR piece.\r\n\r\nThe next day, the manager demanded, via email, my personal notes/questions from my \"interview.\" I asked later, after the process, what the purpose of this was.  He never answered me. The lengthy interview process, in my opinion, was never completely transparent, and I received a negative response when I asked questions about it (from the hiring manager). The department assistant, on the other hand, was very polite and helpful.\r\n\r\nWhile this was  partially a web editing job, there were no tests given for coding. I was tested on my self-revealed weakness--AP-style editing.\r\n\r\nThe other \"finalist\" had a journalism degree and specialized in sports writing. He also did AP editing. \r\n\r\nI asked if there was an internal candidate. There was a long awkward silence before one panel member said, “uh, no.”\r\n\r\nThey hired an intern who worked at U of D at the time of the posting. He is a white male and less than half my age. Had I known there was such a candidate, I would have withdrawn from the process early on.\r\n\r\nAfter job rejection, I wrote thank you letters to seven of the panel members. Two members wrote back to wish me well.\r\n\r\nOther:\r\nMarketing department diversity: two women, one possibly Asian, seven apparently-white males. \r\n\r\nThe University sports marketing department appeared to be all males last I checked. \r\n\r\nI was a minority candidate.\r\n\r\nI lost out on a part-time opportunity while waiting out this nine week \"process.\" \r\n\r\nU of D Mercy posts the following on their website: \"University of Detroit Jesuit High School and Academy is an Equal Opportunity Employer and considers all candidates for employment equally regardless of age, color, national origin, race, sex, or handicap. Because of its status as a religious entity the school may consider a candidate’s religious affiliation in its employment decisions, consistent with State and Federal law.\"\r\n\r\nThey have a different more inclusive EEO policy listed on their online application.", "Interview Questions": "What can you do for us right now if hired?"}, {"date": "12 Apr 2018", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Detroit Mercy (Detroit, MI) in Mar 2018", "Interview Descriptions": "Interview was informal. Mostly talked about your life story and had few questions relating to the actual job. The interviewer was very kind. The supervisor thought very highly of her employees and trusted them with any task.", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "1 Aug 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Detroit Mercy (Detroit, MI) in Jul 2016", "Interview Descriptions": "Very informal, only lasted about 30 minutes. Interviewer wanted to get to know your strengths and weaknesses. Must perform skill test as well. The skills test is just an assessment of your knowledge", "Interview Questions": "Name a time when you had to manage different projects at once "}, {"date": "13 Mar 2020", "title": "Architectural Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Detroit Mercy (Detroit, MI) in Jan 2016", "Interview Descriptions": "the hiring process went well... hr mangar contacts applicants,then applicants require vhanging of and then interview process begins. then sfter interview, a few dys...hr reaheds bsck to confirm ststud fo improvrmentd", "Interview Questions": "how i work in teams"}, {"date": "18 Nov 2016", "title": "Director of Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Detroit Mercy (Detroit, MI) in Jun 2015", "Interview Descriptions": "First has a phone interview. This was only with one person. Then had to talk to multiple  departments of the athletic department. Went through multiple panel questions which each person represented a different part of the department.", "Interview Questions": "What can you do to  help move the program forward?"}], [{"date": "19 Oct 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Detroit Mercy (Detroit, MI)", "Interview Descriptions": "I received a phone call to schedule an in person interview less than a week after my online application was submitted.  The interview was with the supervisor and and hr administrator.  It lasted about an hour and both interviewers were very nice and sophisticated.  They were very knowledgeable about the university and made me even more interested in the position.", "Interview Questions": "strengths and weaknesses"}, {"date": "13 Jun 2017", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Detroit Mercy (Detroit, MI) in Oct 2013", "Interview Descriptions": "A face to face meeting with supervisor. I was asked a various number of question that regared my overall computer skills and how I would tackle certain situations if I were hired.", "Interview Questions": "Any prior experience with computers"}, {"date": "22 Apr 2015", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Detroit Mercy (Detroit, MI) in Jun 2013", "Interview Descriptions": "Almost six months between job posting and request for interview.  Met directly with the decision makers for the position.  Did not have to go through Human Resources and was not subjected to the the rapid fire panel of questions that have never seemed relevant.  HR is rarely informed and objective about what constitutes an appropriate and solid accounting/financial candidate.  Those conducting the interviews were professional, interesting and rational.", "Interview Questions": "Why was I leaving my current position?"}, {"date": "28 Feb 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Detroit Mercy (Detroit, MI) in Jul 2012", "Interview Descriptions": "Had a screening interview on the phone then met with faculty. Once that was done, I met with the Dean and Provost. The questions were behavior based questions and examples from my experience.", "Interview Questions": "Give an example when...."}, {"date": "26 Nov 2013", "title": "General Maintenance Man Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Detroit Mercy (Holland, MI) in Sept 2009", "Interview Descriptions": "HVAC testing", "Interview Questions": "why did you leave your last job? answer --"}]]