[[{"date": "21 Dec 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City College of New York", "Interview Descriptions": "I applied the position through a friend's referral and the interview is reasonable and professional. The process is quick.  I didn't take the offer because my personal reason. This position is a short term/temp position.", "Interview Questions": "Why you think you are a good fit for this position? "}, {"date": "16 Aug 2021", "title": "FWS Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at City College of New York", "Interview Descriptions": "The interview went smooth and friendly. The employer is nice and willing to teach employees the skills to do the job. Common questions were asked such as what past experience do you have.", "Interview Questions": "Why are you qualified for this job?"}, {"date": "15 Apr 2021", "title": "Note Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City College of New York", "Interview Descriptions": "No interview required, the professor asked if anyone would be willing to take notes for a student in the class. From there, I was directed to the AccessAbility office, filled out paperwork, and just had to submit my time card for taking notes.", "Interview Questions": "Are you willing to put your notes into a format that another student can have access to them? (i.e. Google Drive) "}, {"date": "6 Nov 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City College of New York", "Interview Descriptions": "met with the PI of the study and they interviewed me for the position. asked me for my previous research experience and how much I know about the work being done in the lab", "Interview Questions": "How familiar are you with the research that we do in this lab"}, {"date": "28 Sept 2020", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at City College of New York", "Interview Descriptions": "Very friendly and felt like a conversation with positive exchange of information. Interviewers were kind and welcoming so I did not feel intimidated. Lasted 20 min and went well with behavioral questions specific to my experiences. Got back to me with offer within 24 hours after the interview.", "Interview Questions": "Why are you interested in this position?"}, {"date": "4 Jul 2018", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at City College of New York", "Interview Descriptions": "I met with a professor that was in charge of hiring.  She reviewed my resume, asked questions, and gave me information regarding the position.  She also informed me of the process that I needed to go through with human resources.", "Interview Questions": "How do feel about working with students from diverse backgrounds and various age ranges?"}, {"date": "17 Nov 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at City College of New York", "Interview Descriptions": "Submitting the necessary paperwork (transcripts, GRE, TOEFL - for foreign students, recommendation letters etc.). After the first screening, you receive an email with the next steps if you are selected.", "Interview Questions": "Questions regarding my scientific background"}, {"date": "12 Sept 2020", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at City College of New York (New York, NY) in Jan 2017", "Interview Descriptions": "I was asked about any previous tutoring experience. I was also asked about the classes I've taken and what my GPA was. Overall, the interview was fair and not too long.", "Interview Questions": "What courses have you taken so far?"}, {"date": "11 Sept 2017", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at City College of New York (New York, NY) in Dec 2016", "Interview Descriptions": "The interview was pretty laid back and friendly. I was interviewed by my manager and the HR Specialist.  All the questions were HR related and 0% technical. It was 30 mins long.", "Interview Questions": "Experience from the past where you had to pacify a costumer."}, {"date": "12 May 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at City College of New York (New York, NY) in Nov 2016", "Interview Descriptions": "I met with “The search committee”. It felt a bit intimidating, but they were all very friendly. \r\nThey all asked several questions regarding my current and previous positions. Unfortunately I did not get the position but it was a great learning experience.", "Interview Questions": "Give us an example of a challenge at work and how you resolved it."}], [{"date": "3 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at City College of New York (Saint Louis, MO)", "Interview Descriptions": "The interview was conducted over the phone.  I answered several questions about myself and my previous research experiences.  In turn, I also asked several questions about various research programs and the curriculum.  The interviewer appreciated my previous research experiences and my interest in their research programs. I explained what type of research I would like to do, and the interviewer suggested various research programs that I might find interesting.", "Interview Questions": "Previous research experience."}, {"date": "5 Oct 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at City College of New York (New York, NY) in Aug 2016", "Interview Descriptions": "Email correspondence with the professor to submit my resume and set a date to meet for an interview. The interview was in the professor's department office - after proper face to face introductions, I was asked about my background (education, degree, current/prior job), my qualifications (experience teaching), and my availability (times I will be able to work, and if my current schedule does not conflict with class time). I was told on the spot at the end of the interview that I received the job.", "Interview Questions": "How familiar are you with the subject matter - what experiences have contributed to your current knowledge?"}, {"date": "21 May 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at City College of New York (New York, NY)", "Interview Descriptions": "The interviewers asked me about my research and my teaching style. They kept on warning me about how poor the students were and they were right. They tried asking me a couple of trick questions, but I think I managed to answer those questions correctly. After the interviews, I had to give a public hour long presentation of my research.", "Interview Questions": "Do you think you can collaborate with other researchers at City College."}, {"date": "26 Apr 2015", "title": "IT Support Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at City College of New York", "Interview Descriptions": "Interview was relatively normal. There are 2 interviews. One interview with people you may end up working with, the second with the VP or the one responsible for hiring.", "Interview Questions": "Tell me about yourself?"}, {"date": "28 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City College of New York (New York, NY) in Apr 2015", "Interview Descriptions": "Emailed professor to ask if I could drop by his lab. He responded and we discussed what the lab was working on and how I could fit into the group. It was very casual and the professor was eager to get me started.", "Interview Questions": "What was your previous experience"}, {"date": "11 Oct 2017", "title": "Undergraduate Teaching Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at City College of New York (New York, NY) in Mar 2015", "Interview Descriptions": "Interviewed with head of the Chem department: short, sweet and comfortable. The previous and outgoing head was there, as well as the department administrative assistant whom you're required to work closely with.", "Interview Questions": "Previous experience "}, {"date": "14 Jun 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at City College of New York (New York, NY) in Mar 2015", "Interview Descriptions": "It was brief with basic questions.I applied online, received an email and then scheduled an interview date. There was an opening for a receptionist position in one of the departments and I applied.  The hours were somewhat flexible. It was a basic Nine to Five Job. They wanted people who could stick to  a long-term schedule.", "Interview Questions": "Tell me about yourself/"}, {"date": "13 Aug 2015", "title": "Post Doctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at City College of New York (New York, NY) in Feb 2015", "Interview Descriptions": "Skype interview followed by in person presentation of the research in front of couple faculties, where they later ask you questions about your publications and research. After that they take you to lunch and after lunch you are presented with decision.", "Interview Questions": "About my research"}, {"date": "15 Sept 2014", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at City College of New York", "Interview Descriptions": "You can apply to teach as an adjunct lecturer with a bachelor degree, at least in most departments. Once you apply it takes about a week or two for you to be called for a interview with an adjunct supervisor. The questions, at least for math department, were of the type: \"here's a pre-calculus problem on the board, pretend I am the class you are teaching to and while you are solving the problem explain each step.\" \r\nSolving the problem is easy. What might get difficult is the part where you explain, since the interviewer will ask you all the typical question that students ask during class and that might throw you off a little bit, especially if you never taught before. \r\nEven if you get confused and interviewer does throw you off its ok, don't panic. You can always say:\"I would prepare for the class in detail, before each lecture, and I would be able to explain better.\". As a matter of fact, try to throw that sentence in there in any case, they like to hear that (you should prepare for each class anyway)", "Interview Questions": "Explained in the hiring process part"}, {"date": "25 Apr 2016", "title": "Digital Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at City College of New York (New York, NY) in Sept 2014", "Interview Descriptions": "The interview process was extremely comfortable. My interviewer made me feel at ease and was interested in matching my skills to the needs of the organization. The job requirements were made extremely clear and there was a quick follow up afterwards.", "Interview Questions": "Explain one of your key strengths?"}], [{"date": "18 May 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at City College of New York (New York, NY) in Jul 2014", "Interview Descriptions": "Interviewed with senior counselor and associate director. A very selective process as they sought out individuals with both counseling and customer service experience. One needed to have experience and have personality in order to move to the next level", "Interview Questions": "Questions were grounded in history of campus, problem solving, and decision making"}, {"date": "11 Jun 2014", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at City College of New York (New York, NY)", "Interview Descriptions": "It was a while ago, but I simply gave my resume to the department I wanted to work at.  I was called for an interview a month later.  I would say it was an easy interview process.  I was then told to come back for some skills test.", "Interview Questions": "Why are you interested in working here? "}, {"date": "11 Jan 2017", "title": "Adjunct Lecturer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at City College of New York (New York, NY) in Apr 2014", "Interview Descriptions": "I applied online and was fortunate to have an employee referral. After applying I heard from the recruiter and hiring manager and scheduled a phone interview. The phone interview was about 30 minutes long- make sure to do your research on the company, why you want to work there, know about the products/climate. After that I did an in-person interview with hiring manager and one other manager which lasted about 45mins - 1 hour. I heard from the hiring manager that day and was told I would be doing a final interview with regional manager the following week. I received an offer the following week.", "Interview Questions": "why we should hire you?"}, {"date": "9 Mar 2014", "title": "Tutor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at City College of New York (New York, NY) in Sept 2013", "Interview Descriptions": "First thing is that the department head looked for my resume and my transcript. Once that was submitted his secretary called me for an interview with him. Upon finishing the interview, I was hired. After hired, I started working.", "Interview Questions": "Where do you want to work here?"}, {"date": "23 Jan 2013", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at City College of New York", "Interview Descriptions": "referred by the professor based on performance in class.", "Interview Questions": "What makes you qualified for this line of work?"}, {"date": "16 Feb 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at City College of New York (New York, NY) in Jan 2013", "Interview Descriptions": "I got an phone interview at first. It took about 40 minutes to finish the whole process. After the phone interview, I waited for about 2 weeks and then received an email for onsite interview. I chose a time when both the company and me were available.", "Interview Questions": "what's your weekness?"}, {"date": "1 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at City College of New York (New York, NY) in Apr 2011", "Interview Descriptions": "Standard graduate student interview to gain acceptance for PhD program.  Briefly met with several faculty members about research interests.  Also met with gradate program director.  This was all after submission of undergraduate transcripts and GRE scores were reviewed.  Overall, chances of being accepted to the CHE department for graduate students is very high.", "Interview Questions": "Desired resreach field"}, {"date": "10 Jul 2013", "title": "College Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at City College of New York (New York, NY) in Apr 2010", "Interview Descriptions": "I was referred to by a friend who still works there.", "Interview Questions": "There were questions about availabity since I was attending classes at the time."}]]