[[{"date": "7 May 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MU Health Care (Columbia, MO)", "Interview Descriptions": "The interview process was easy and efficiant with little of no trouble. I do remember being asked not technical questions and was more focused on the general vibe as opposed to specific terms.", "Interview Questions": "Why do you want this job?"}, {"date": "6 Dec 2022", "title": "Patient Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MU Health Care in Aug 2022", "Interview Descriptions": "two step interview first a phone call and they confirm that they will require a drug test and a pre- employment background check, second interview is with the manager you will be working for easy questions good experience", "Interview Questions": "About your job experiences, why you applied, career goals"}, {"date": "5 Jun 2020", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MU Health Care", "Interview Descriptions": "Applied online. Received a response within a few days. Interviewed with a recruiter and set up interviews with departmental managers/interviewers. None of the specialties I was interested in had offers/interviews available, so I declined the offer.", "Interview Questions": "How do you deal with frustration? Do you consider yourself a hard worker? Talk about a time a patient was dissatisfied with your care. "}, {"date": "1 Jan 2020", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MU Health Care", "Interview Descriptions": "After applying online, a Human Resource manager will call for a phone interview and will send the results to the appropriate department. If interested, the department will then call to set up an in-person interview.", "Interview Questions": "Describe a time when you had to resolve a conflict with a coworker."}, {"date": "9 Dec 2019", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MU Health Care (New York, NY)", "Interview Descriptions": "Person who was supposed to do interview \"vanished\" and management scrambled to get my interview done. Interview was disorganized because of this. I felt rushed throughout the interview. A training manager ended up interviewing me because of all this.", "Interview Questions": "Tell me your strengths/weaknesses."}, {"date": "2 Jan 2021", "title": "Administrative Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MU Health Care (Columbia, MO) in Dec 2019", "Interview Descriptions": "The interview process consists of an Interviewer along with the Head faculty of the department. Interview questions are basic behavioral questions along with some technical questions if necessary. Rarely situation based questions might also be asked.", "Interview Questions": "Tell me your greatest strengths."}, {"date": "30 Jul 2019", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MU Health Care (Columbia, MO) in Oct 2018", "Interview Descriptions": "Apply online...3 Phone interviews....to finish you were required to put a former supervisor. I have only had 1 boss for the last 10 years and she did not know I was leaving. I could not finish the application.", "Interview Questions": "Why are you leaving your current position"}, {"date": "7 Feb 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MU Health Care", "Interview Descriptions": "I interviewed for a PSR for the Emergency Room.  This was a working interview where I sat in the ER for 2 hours to observe the environment. It is great exposure if a person does not have ER experience.", "Interview Questions": "N/A"}, {"date": "31 Aug 2017", "title": "Nutrition Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MU Health Care (Columbia, MO)", "Interview Descriptions": "the interview was so easy. you had to go into like a dingy office and it lasted 5 minutes and i got a call back saying i got the job", "Interview Questions": "why do you want to work for us?"}, {"date": "2 May 2017", "title": "Patient Kitchen Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MU Health Care", "Interview Descriptions": "After I applied it took them two weeks to contact me. After that, I had an interview with one of the managers. The interview went well. I was later sent an email to submit my references.", "Interview Questions": "It was the basic type of questions. Like why do you want to work here and how did you find out about us"}], [{"date": "8 Jan 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at MU Health Care (New York, NY) in Dec 2016", "Interview Descriptions": "Overall the interview was very simple. First I had a phone interview with recruiter then I went in and filled out some paper work and meet with the interviewer . they took me up to the department and we talked . after the interview i got to meet with some of the nurses and CNA's that I would be potentially working with After that they showed me around the Department .A couple weeks later i got the call that they wanted to offer me the job.", "Interview Questions": "Why do you want to work in our department?"}, {"date": "18 May 2016", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MU Health Care", "Interview Descriptions": "I applied online and got a call from HR the next day to set up a phonr interview with HR recruiter. Got a call back a few days later to schedule an in-person interview with the unit manager. They may require a peer interview as well, but I did my practicing there so I did not need one. Got an offer about 9 days after my 1:1 interview.", "Interview Questions": "Describe a situation where there was a miscommunication and how it was resolved."}, {"date": "19 Mar 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MU Health Care (Columbia, MO) in Apr 2016", "Interview Descriptions": "Started with over the phone screening. Then sit down interview with the clinic coordinator and their boss. During the interview they brought in members of the staff currently working in the role I had applied to and allowed us to as each other questions.", "Interview Questions": "Why are interested in working in Psychiatry?"}, {"date": "3 Oct 2016", "title": "Office Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MU Health Care (Columbia, MO) in Dec 2015", "Interview Descriptions": "I had began working as a temporary employee, but I had grown to really enjoy the work and the atmosphere of my department. I applied for the position and was hired, after an interview, for the position.", "Interview Questions": "How would your schooling affect your work week."}, {"date": "29 Jan 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MU Health Care (Columbia, MO) in Sept 2015", "Interview Descriptions": "Very relaxing\r\nRelatively easy questions\r\nFast paced, but I did not feel rushed\r\nThe whole process was very organized\r\nI felt very prepared for my interview after having the phone interview\r\nThey kept me very informed about paperwork, orientation, and job expectations", "Interview Questions": "Where do you want to be 5 years from now?"}, {"date": "17 May 2017", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MU Health Care (Columbia, MO) in Aug 2015", "Interview Descriptions": "Applied, got called for a phone interview and told her where my areas of interests were. She set me up with 3 interviews in one week. I got an offer for my top choice of the 3 and accepted it.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "9 Jul 2015", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MU Health Care", "Interview Descriptions": "Interview with HR then interviewed with 3 people from the radiology department, HR interview almost all behavoral, interview with department was fairly easy but felt fake, hospital large make sure you know where you are going", "Interview Questions": "What&#039;s your strengths/weaknesses? What&#039;s your favorite and worst exam? Behavioral questions"}, {"date": "26 May 2015", "title": "Mental Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MU Health Care (Columbia, MO)", "Interview Descriptions": "Process was very short and HR was very efficient. Was called a week after submitting application online to schedule a phone interview with HR the following week. Phone interview went well and was asked to come in for an in person interview the following week. Met with manager of my department. Manager did not appear to be very animated or responsive to answers, but interview went okay. I took it as a good sign that she decided to show me around the unit. I asked about the process and she described she would make her decision and would send it to HR for the rest to be done.\r\nThe interview was on Monday. By Wed I had a voicemail from HR about getting into contact with one of my professional references. After contact info was cleared up, was called with a job offer on Friday.\r\nProcess took about 3 weeks from submitting application", "Interview Questions": "Most interesting question was: 'If someone ran into you with a shopping cart at a grocery store, what would you do?' (used to determined response to aggressiveness)"}, {"date": "8 Apr 2017", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MU Health Care (Columbia, MO) in May 2015", "Interview Descriptions": "Easy interview process as new graduate, friendly faces and offered tour of unit/ hospital. The process took 4+ weeks from application to offer, but was through in deciding what unit would be a good fit for new graduates.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "2 Oct 2017", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 7 weeks. I interviewed at MU Health Care in Apr 2015", "Interview Descriptions": "Very easy going.  Not a super formal process which was nice.  You typically have some familiarity with the person or team that you are interviewing with.  Overall it's likely to be an easy interview depending on how well you know the team that you will be interviewing with and how applicable you believe the position to be to your overall career goals.", "Interview Questions": "Can you speak to me about how you believe this position might benefit you in the future?"}], [{"date": "28 Sept 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MU Health Care (Columbia, MO) in Jan 2015", "Interview Descriptions": "Confusing and horrible. I waited about 2 months for a call. I was supposed to go to another area but sent to another, ended up interviewing there and one month later I got the job.", "Interview Questions": "What do you look for in a manger? "}, {"date": "9 May 2016", "title": "Care Team Associate- Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MU Health Care (Columbia, MO) in Jun 2014", "Interview Descriptions": "The first step was a phone interview, and then an in-person interview. Both went very well. I was asked typical behavioral and situational questions. Immediately after I finished the phone interview, I was asked to set up the in- person interview. The environment was very relaxed and the HR office has waters and magazines to ensure that you are comfortable.", "Interview Questions": "How would you handle conflict in the workplace?"}, {"date": "12 Feb 2014", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at MU Health Care (Columbia, MO) in Jul 2013", "Interview Descriptions": "I applied online and was contacted by HR about a month later. Having an inside referral sped the process along. The first interview is with the HR specialist, where she discusses openings and asks basic personality questions. Then after she picked out two clinics looking for PSRs, she set up interviews. The interviews were a week apart and actually took place in the clinic. My first interview was with the clinic coordinator, the clinic supervisor, and a long-term employee. My next interview with the other clinic was just an interview with the coordinator. I received offers from both clinics and ended up picking the first clinic I interviewed with.", "Interview Questions": "How do you deal with Nurses and PSRs fighting? Do you take criticism well? How do you handle being yelled at? What is your age? \r\n\r\nThe questions from the clinic coordinators were actually quite inappropriate and could have been a liability.\r\n"}, {"date": "28 Apr 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at MU Health Care (Columbia, MO) in Mar 2011", "Interview Descriptions": "Went in and met with the nurse recruiter to start with and then was given a second interview to meet with the supervisor of the area I would be working at.  I also met with one of the nurses I would be working directly with in the office.  The interviews were both very short and sweet and to the point.", "Interview Questions": "What do you like about our organization?"}, {"date": "11 Feb 2014", "title": "Office Support Staff III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at MU Health Care (Columbia, MO) in Sept 2010", "Interview Descriptions": "long - interview was group type", "Interview Questions": "my short comings"}, {"date": "3 Nov 2011", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MU Health Care (Columbia, MO) in Feb 2009", "Interview Descriptions": "It was with a department manager and a hospital manager.", "Interview Questions": "Why do you think you would be a good employee?"}]]