[[{"date": "12 Dec 2022", "title": "Call Center Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Columbus State Community College", "Interview Descriptions": "Not your usual questions. One was “name a time you improved a process at your previous place of employment”. Not typical at all. Great job thought and opportunity to move up", "Interview Questions": "Not your usual questions. One was “name a time you improved a process at your previous place of employment”. Not typical at all. Great job thought and opportunity to move up"}, {"date": "13 Apr 2022", "title": "Computer Programmer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbus State Community College", "Interview Descriptions": "Horrible recruiting slash HR process. Unclear expectations and options were given. Not up to date tech platforms but was not made aware until interview. Rude employee interaction. Very disappointed in CSCC.", "Interview Questions": "What is your weekend availability?"}, {"date": "14 Apr 2022", "title": "Benefits Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Columbus State Community College (Columbus, OH) in Mar 2022", "Interview Descriptions": "It started with a phone screening, then I interviewed with the recruiter and the supervisor of the benefits department, then finally interviewed with a different recruiter, the supervisor and the head of HR. I was told that I would get notified either way of the decision they made, but after three months of interviewing and several emails to the second recruiter to find out the status isy the position, I still haven't gotten a response but I assume that I am no longer a candidate for the position.", "Interview Questions": "They asked about a time that I had the opportunity to interact with others of a diverse nature"}, {"date": "16 Jul 2022", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Columbus State Community College (Columbus, OH) in Jan 2022", "Interview Descriptions": "The Initial Interview was with the Hiring Manager over the entire program, then there is a group meeting with manager, associates, and HR representative where a line of questioning and conversation take place upon you moving to the next step in the application process.  You are then informed you will be contacted should they decide on your hiring.  You are informed via a phone call and email.", "Interview Questions": "The interview questions are Confidential"}, {"date": "10 Aug 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbus State Community College", "Interview Descriptions": "It was engaging and pleasant. The search committee questioned related to many aspects of the position which helped me understand the responsibilities of the position very well. It was overall a very good experience.", "Interview Questions": "What is you approach to passive learning"}, {"date": "25 May 2021", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbus State Community College", "Interview Descriptions": "This felt like an easy, casual process. The Dean asked how I've handled conflicts with students or other colleagues, about my strengths and weaknesses as an instructor, and other standard questions. She was willing to discuss the pay and benefits (or lack thereof, rather) up front and was eager to answer any questions.", "Interview Questions": "In the past, how did you handle a conflict with a student?"}, {"date": "11 Feb 2021", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbus State Community College (Columbus, OH)", "Interview Descriptions": "Pretty standard interview.  They asked question based on the job and your resume. It was a group interview with a group on people interviewing the applicant. Overall a pretty standard interview.", "Interview Questions": "Q: Tell me do you see yourself in 3 years?"}, {"date": "27 Sept 2017", "title": "Bookstore Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbus State Community College", "Interview Descriptions": "The interviewer was very friendly and she engaged with me , so I felt easy and calm as I answered the questions.I was asked a few questions, mainly focusing on personality. I was asked about my strengths and weaknesses and my problem solving skills.", "Interview Questions": "Name 3 strengths  that you have ?"}, {"date": "28 Mar 2017", "title": "Bookstore Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Columbus State Community College", "Interview Descriptions": "Very relaxed, nice people that helped you understand what you would be doing. It was a temp job so it was great for me and my schedule. I would recommend if you need something convenient.", "Interview Questions": "Nothing out of the ordinary, typical questions."}, {"date": "10 Jun 2016", "title": "Learning Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Columbus State Community College (Columbus, OH)", "Interview Descriptions": "After applying online and almost forgetting about my application, I received an email to come in for an interview. I went in, had my interview, and was told I'd hear back in a few days. Got a phone call a few days later that they wanted to hire me and to fill out all the paperwork including getting drug tested. The whole process was quick and easy after the interview.", "Interview Questions": "How many hours are you wanting to work?"}], [{"date": "28 Dec 2017", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Columbus State Community College (Columbus, OH) in Mar 2016", "Interview Descriptions": "He asked about what brought me to Columbus State, what my plans were for the future, and was generally speaking about student life but it was mostly to get a feel for how personable I could be", "Interview Questions": "What is one club that I’m active in at the moment"}, {"date": "12 Sept 2015", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbus State Community College (Columbus, OH) in Jan 2015", "Interview Descriptions": "I had to complete a couple of interviews to finally land the position. The position I interviewed for was with CSCC's Computer Science Department so I first had to interview with the tutoring organizer. Next I had to interview with a member of the Computer Science Department to finally land the position. This has helped to prepare me for future interviews.", "Interview Questions": "Where do you see your self in 5 years?"}, {"date": "13 Nov 2014", "title": "Part Time Specialist - Non Credit Registration Office Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbus State Community College in Oct 2014", "Interview Descriptions": "Initially received a phone call from the secretary to set up a phone interview. The interview was with the Director of Basic Language Instruction and the director of Workforce Development, and lasted about an hour. The interviewers were very friendly, but spent a lot more time describing the office and the job, including some challenges with the GED program that sounded unpleasant, than asking questions about me.", "Interview Questions": "What experience do you have working with international students?"}, {"date": "26 Nov 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Columbus State Community College (Columbus, OH) in Aug 2014", "Interview Descriptions": "You submit your resume to the adjunct pool. If it looks solid (and if they need more instructors for a semester), a department chair will reach out before a semester begins. Once you're in, you're in. The interview is easy if you have prior experience. Just show example lesson plans and discuss your familiarity with the types of assignments required by C-State (they follow OSU's specifications to make it easier for their students to transfer).", "Interview Questions": "Have you taught a research essay before?"}, {"date": "1 Aug 2013", "title": "IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbus State Community College (Columbus, OH)", "Interview Descriptions": "The interview was for a Federal Work-Study Program job, working at the IT Help Desk.  After applying for the job via the college's web site, I was contacted within a few days by a manager. I was able to set up an interview within the week. The interview was extremely informal, and I felt like I only needed to show a minimal amount of comfort with computers to get the job.  I was offered the position at the end of the interview, and there was no negotiation of pay because of the Work-Study nature of the job.", "Interview Questions": "There really weren't any difficult questions, and I really feel like anyone who can use computers comfortably would be qualified for the job."}, {"date": "3 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbus State Community College (Columbus, OH) in May 2013", "Interview Descriptions": "I applied on the website, and within several days, I was called in for an interview I did a brief teaching demo, followed by a discussion of expectations and a Q&A with several faculty. We discussed what I would be willing to teach, based on my experience, and what typical class assignments and expectations would be.", "Interview Questions": "What would you do in a typical class session?"}, {"date": "16 Nov 2012", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at Columbus State Community College (Columbus, OH) in Aug 2012", "Interview Descriptions": "Very straight forward with no tricks", "Interview Questions": "Tell me what you will change about yourself."}, {"date": "22 Feb 2013", "title": "Advisor (Disability Services) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbus State Community College (Columbus, OH) in Feb 2012", "Interview Descriptions": "I submitted an application online and received a call from their receptionist for interview within two weeks. There was no pre-screening interview, I met with Director and Associate Director of the department. They were pleasant and professional. The interview process was comfortable. Focus was on self-motivation and job completion. A self-starter role to help students with disabilities to be successful in college.", "Interview Questions": "n/a"}]]