[[{"date": "9 Jun 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Shepherd Center (Atlanta, GA) in Jun 2023", "Interview Descriptions": "Very quick. I spoke with a recruiter who said she would hand over my information with the manager for interview scheduling. The manager called back in few minutes and an interview was scheduled same day.", "Interview Questions": "Who is an exceptional nurse? Tell me about yourself"}, {"date": "21 Feb 2023", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shepherd Center", "Interview Descriptions": "Group interview with all current therapists and therapy manager present. I was allowed to ask questions regarding the position with the therapy manager present and also with just the therapists alone.", "Interview Questions": "Situational and preferential. Standard questions ( strengths, weaknesses, where do you see yourself in 5 years, etc.)"}, {"date": "8 Nov 2022", "title": "PRN OT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Shepherd Center", "Interview Descriptions": "Lots of steps but interviews were fun and everyone is respectful and kind. First had Hr then manager then teammates over lunch. Also observed some time on the floor which was extremely helpful during the interview process.", "Interview Questions": "What is your role on a team. Lots of questions about specific experience"}, {"date": "18 May 2022", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Shepherd Center", "Interview Descriptions": "This company is very open and inviting. I felt welcomed and excited to become a part of the team.  The interview process was easy to schedule and laid back compared to most places.", "Interview Questions": "Why do you want to work at the shepherd center "}, {"date": "10 Jun 2022", "title": "Engagement Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Shepherd Center (Atlanta, GA) in May 2022", "Interview Descriptions": "The first stage of the process (face-to-face interview) with the hiring manager was great; however, the second stage of the process was uncomfortable and awkward. The higher ups were unfriendly and created a racially inclined  tension. I felt they were doing a Wells Fargo act...going through the process with diverse candidates only to hire another Caucasian applicant.", "Interview Questions": "What is your dream job?"}, {"date": "20 Jan 2022", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Shepherd Center", "Interview Descriptions": "Very efficient and easy. Went into the interview with less preparation than others and still did fine. Shepherd center is good about conducting interviews via phone as well. What else can I say for thirty words.", "Interview Questions": "They asked me about my work experience "}, {"date": "25 Jun 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Shepherd Center", "Interview Descriptions": "It was a good interview experience. They asked basic questions such as how I would handle a difficult situation and what would I do to ensure patient safety in a particular situation. They knew that I had not been employed in the field yet so they just asked me about what training I had. They showed me around the unit and explained what goes on in that unit and what my role would be if I were hired. Then they offered me the job on the spot!", "Interview Questions": "They asked basic questions such as how I would handle a difficult situation and what would I do to ensure patient safety in a particular situation. "}, {"date": "4 Mar 2021", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Shepherd Center", "Interview Descriptions": "Very easy & professional asked where I worked before & if I could start as soon as possible. Also asked me about the different thing so did at the other job that could relate to theres", "Interview Questions": "When can you start the job?"}, {"date": "21 Oct 2020", "title": "Exercise Physiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shepherd Center", "Interview Descriptions": "I had two interviews. One in-person and one via zoom. I applied online and received a phone call about two weeks later asking for me to come in for an interview. I heard back about a week and half later and was asked to come in for a second interview.  It took about two weeks to hear back. Everyone was very communicative and it was a great process.", "Interview Questions": "Why do I want to work for the Shepherd Center? "}, {"date": "13 Oct 2022", "title": "PT/OT Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Shepherd Center (Atlanta, GA) in Jan 2020", "Interview Descriptions": "First you meeting with the other therapy aides and talk with them about their role. Then you spend the morning shadowing several therapy sessions. After talking with the aides and meeting the physical therapist there is a thirty minute interview.", "Interview Questions": "Describe a time where you demonstrated team work."}], [{"date": "16 Feb 2023", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Shepherd Center in Oct 2019", "Interview Descriptions": "I was provided ample notice to prepare my interview. I interviewed with the department team, but I felt comfortable and welcome. The interview was long, and the entire team asked questions. I was notified in a week that I did get the job.", "Interview Questions": "Why do you want to work at the Shepherd Center."}, {"date": "12 Jan 2021", "title": "Prospect Research and Moves Management Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Shepherd Center (Atlanta, GA) in May 2018", "Interview Descriptions": "Very comfortable interview with Director involved great history of department and current needs. More informal conversation with key questions on competencies and experience for the role. Had opportunity to meet other staff as well", "Interview Questions": "Familiarity with CRM and Donor reporting"}, {"date": "3 Dec 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Shepherd Center (Atlanta, GA) in May 2018", "Interview Descriptions": "Straightforward, friendly, upfront about the job and the people they are looking for. They are looking for someone who is willing to learn and will always ask for employess to grow professionally.", "Interview Questions": "Is there anything that drew you to Shepherd Center in particular?"}, {"date": "31 Oct 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Shepherd Center (Atlanta, GA) in Jan 2018", "Interview Descriptions": "Very comfortable and relaxed. They want to get to know you and see if you fit well within the work culture. Patients come first at Shepherd Center, so a good attitude is a must!", "Interview Questions": "Many of the patients have experienced a traumatic injury, how will you help them on their journey to recovery? "}, {"date": "14 May 2016", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Shepherd Center", "Interview Descriptions": "applied online , got a call back within a week .\r\ninterviewed with the department manager. at the end was told i would move on to the next part, interviewing with the charge nurse. \r\nThey called the next day and said they liked me but wanted me to work on day shift and if a position open they would contact me. \r\n4 months later they contacted me and i got the job", "Interview Questions": "do you have any experience with patient  care?\r\nHow do you deal in Stressful Situations"}, {"date": "12 Oct 2015", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Shepherd Center (Atlanta, GA) in Apr 2015", "Interview Descriptions": "In person, toured the facility and my dept, we discussed the patient population and if I had experience prior and as to what my goals would be working there.  It was a great experience as I saw the whole facility and not just one room and met other co workers and saw them interacting with patients before making a decision for myself.", "Interview Questions": "What is yoru experience with this patient population?"}, {"date": "21 Nov 2013", "title": "Senior Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Shepherd Center", "Interview Descriptions": "I participated in a remote team teleconference interview and then an in person team interview followed by individual interviews. I was asked to deliver a center wide presentation on my research plan and vision. The team was very engaged, interested and asked relevant questions", "Interview Questions": "The center has a large database that they were seeking details on how I might mine and leverage existing historical data. "}, {"date": "28 Oct 2016", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shepherd Center (Atlanta, GA) in Jul 2012", "Interview Descriptions": "The interview was incredible. You reported for a full day of shadowing many therapists on the floor and then sitting down for a group interview at the end of the day. It let you see a real \"day in the life\" before committing to the job.", "Interview Questions": "Standard Interview questions. Also, questions about experience with brain and spinal cord population."}]]