[[{"date": "7 Jun 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OSF HealthCare (Urbana, IL)", "Interview Descriptions": "The job was posted online. I submitted resume online and I received a short interview over phone from the Regional Headquarters. They recommended that I submitted all my credentials and licenses with the resume for prior review.", "Interview Questions": "What was my background? (Credentials reviewed)"}, {"date": "4 Apr 2023", "title": "PI Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Group interview process asking general questions about dealing with challenges, negative feedback and working with a team. Required interviewee to take initiative to tie answer in with direct experience. Provided with feedback after the process.", "Interview Questions": "Describe a way in which you managed conflict in the past"}, {"date": "8 Feb 2023", "title": "Student Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "10 minute phone interview with HR, fairy easy questions, why you want to work there, why you went into nursing, describe a time of conflict, professional goals you had, etc. Got a call about a month later offering the job", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Jan 2023", "title": "Executive Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Exhausting and too drawn out. It took forever to set up and then to go thru all the levels. Far too long of a process to complete- i dropped out after the 4th interview Don't want to work for a company that is that obsessed", "Interview Questions": "On line screen for an executive position is appalling"}, {"date": "14 Jan 2023", "title": "PI Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare", "Interview Descriptions": "Standard panel interview format - typically focused on shared experiences specific to examples of working through challenges. Interviewers take turn asking questions. Option for follow-up. Organization tends to value brevity in answers.", "Interview Questions": "Talk about a time you had to give direct feedback to a senior manager."}, {"date": "7 Dec 2022", "title": "Oncall Concierge Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Nov 2022", "Interview Descriptions": "Super friendly interview process! Everything was smooth sailing and they are super clear on expectations and answered any questions. Osf kept in touch the whole time. I'm super excited to start working here.", "Interview Questions": "What previous experience do you have that is relevant to this job?"}, {"date": "3 Jun 2022", "title": "Professional Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Great experience! The interview process moved along fairly quickly and I was always in the loop with when to expect next steps. There were 2 rounds of interviews that included a phone screen and video interview.", "Interview Questions": "How do you overcome working with others who may not agree with you?"}, {"date": "21 May 2022", "title": "Customer Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "A phone interview was conducted by a HR representative. Following that, a face-to-face interview with hiring managers was completed. There were a total of 3 interviews but I have had colleagues who have had to complete more than 3 for OSF.", "Interview Questions": "Know the mission Vision and values"}, {"date": "19 Mar 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at OSF HealthCare", "Interview Descriptions": "I interviewed at a career fair with a manager- broad questions about how I work as a PCT (e.x. How do you work in a team? are you organized? How do you prioritize? Why do you want to work here?)", "Interview Questions": "How do you work in a team? are you organized? How do you prioritize? Why do you want to work here?"}, {"date": "1 Apr 2023", "title": "Data Engineering Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OSF HealthCare (Peoria, IL) in Mar 2022", "Interview Descriptions": "3 part interview. First was a phone screen with recruiter, then technical interview with the 2 hiring managers, third was interview with the hiring manager and members of the team", "Interview Questions": "They asked technical questions about what tools I had used in the past, and if I had any other experience that I hadn't listed on my resume. They were more interested about how I would fit into the team though, asking a lot of questions about why I'm interested in healthcare and how I would handle certain situations."}], [{"date": "15 Feb 2022", "title": "Or RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Applied online through the portal- HR called me  within the week- In person interview was conducted. Offered a walked in my shoes. Was called later with the job and accepted over the phone", "Interview Questions": "What is your spirit animal?\r\nStrengths and Weaknesses?"}, {"date": "20 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "Was efficient in their time and application process. They are starting a new process that involves using a recruiter and then talking to the clinical manager. From there I would recommend asking about shadowing the unit and then doing the meet and greet with the unit manager.", "Interview Questions": "Mission, Vision, Goals, \r\nHow to manage a difficult situation\r\nWhy OSF"}, {"date": "10 Jan 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare", "Interview Descriptions": "Easy and straightforward everything went smoothly. Everyone was pleasant he and manager was very friendly. The process maybe took two weeks all together from the first initial call with the recruiter to the hiring manager and peer interview", "Interview Questions": "What makes you a team player and when did you have to show it"}, {"date": "6 Jan 2022", "title": "Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "it was a good overall process, I enjoyed it very much.  I look forward to hearing back from them.  I would recommend people to work there from the Peoria area.  I like the clinics.", "Interview Questions": "it was really very good"}, {"date": "19 Mar 2023", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OSF HealthCare in Dec 2021", "Interview Descriptions": "Phone screen with recruiter, then received the behavioral assessment to see if personality, general reasoning, attitude, engagement fit organizational culture Data Scientist Hiring Test from HackerRank: SQL, Python coding challenge After a successful technical assessment, it's a 60-minute team-based interview", "Interview Questions": "Prepare a 20-minute presentation appropriate for an audience of mixed technical talent on relevant work"}, {"date": "6 Apr 2022", "title": "Telemetry Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at OSF HealthCare (Peoria, IL) in Nov 2021", "Interview Descriptions": "Poor and unprofessional just a really strange interview process. I’m still under review for a tech position three months later. Hopefully the lady is nicer to her next potential candidate", "Interview Questions": "What would make you a good mission partner \r\n"}, {"date": "27 Sept 2021", "title": "Report Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "HR screening was basic conversation via email.  Interview with multiple managers and staff members.  Discussion of duties in job and recap of experience.  Discussion of technologies used, training process, certifications that would be earned.", "Interview Questions": "Describe your past database experience."}, {"date": "2 May 2023", "title": "Member Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OSF HealthCare (Peoria, IL) in Aug 2021", "Interview Descriptions": "Application online on external system. After 6 weeks received email with link to 20 minute Behavioral Assessment test followed 2 days later by initial phone screen regarding work history and availability. Then two hour long phone interviews with HR recruiters followed by email link to provide 4 professional references. Two weeks after that was the in-person interview at site with department manager and offer. You will be assigned an HR Representative to guide you through next step. Work began 3 months after application.", "Interview Questions": "Speak to how you will work towards the Mission. Explain what makes you a good fit for this Mission-driven culture."}, {"date": "4 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Interviewer was very prompt with the scheduled time for the phone interview. Very pleasant & fast experience. She described the company & asked why I was looking for a job and why I would like to work there.", "Interview Questions": "Describe your experience with a difficult patient "}, {"date": "3 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Interview was great. I was contact within 24 hours of submitting an application by a member of the Recruitment team. Followed up by quick contact from the leadership team. Interview time from start to finish was 2 weeks.", "Interview Questions": "Research their mission, extremely important to them and it truly is lived out in their daily work. They are very proud of their mission and want to ensure you are as well. "}], [{"date": "25 Apr 2022", "title": "Marketing Strategist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OSF HealthCare (Peoria, IL) in May 2021", "Interview Descriptions": "Having three individual interviews plus two panel interviews with another three to four interviewers each and numerous weeks in between was arduous. Rigor was expected but the process should be more succinct.", "Interview Questions": "Questions ranged from general background to specific examples of managing complex issues. "}, {"date": "27 Apr 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL)", "Interview Descriptions": "Was a very calm interview over the phone. Talked about salary, asked interview questions, and answered any questions I had. Talked highly about their facility and made it feel like a good choice for a company to work for.", "Interview Questions": "Based on our mission statement how would you be a good asset to our team?"}, {"date": "16 Apr 2021", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "great interview with great people I was asked easy relevent questions and got quick easy truthful answers the company has great benefits  and a wonderful pension the other great thing about the company  is their quick response to emails and wonderful care for there patients and staff  truly  one of the best companies  to work for in the area", "Interview Questions": "what makes you want to work for osf"}, {"date": "1 Apr 2021", "title": "Dispatcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "It was an excellent experience. They provide a relaxed atmosphere.  Interviewed by seven to eight interviewers. Management and staff made me feel very welcome and at ease. It was by far the best experience Ive had as a job candidate.", "Interview Questions": "Why did you choose dispatch?"}, {"date": "24 May 2021", "title": "IT Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Apr 2021", "Interview Descriptions": "The whole interview was an hour. It was in Microsoft teams. The interview was fine and done by the boss. It was well formed as well. The person asked a few questions", "Interview Questions": "What is my position that I want?"}, {"date": "10 Sept 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at OSF HealthCare (Evergreen Park, IL) in Mar 2021", "Interview Descriptions": "Attended a job fair and was contacted in the following order. \r\n1 -phone screening\r\n2 -behavioral screening\r\n3 -interview (meet staff, floor, explanation of benefits and job requirements).\r\n4 -references were requested\r\n5 -HR called to offer position.", "Interview Questions": "Why do you want to work at this hospital? \r\n"}, {"date": "12 Feb 2021", "title": "Medical Laboratory Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at OSF HealthCare", "Interview Descriptions": "It was a long process which the interviewer was not prepared for because I had to wait an extra 10 minutes after my scheduled interview before being called into the office. They had obviously not looked at my resume beforehand and reacted negatively to the questions I asked about the position. They were extremely unprofessional and visibly reacted negatively to my experience and qualifications. Instead of respectfully ending the interview, they continued to drag me through the entire interview while visibly being unimpressed.", "Interview Questions": "Can you keep up with the workload?\nHow well do you think you would fit in here?"}, {"date": "23 Jan 2021", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Brief interaction with recruiter via phone & email.  Recruiter then passed information on to operational team for phone interview with them.  Then met in person with site manager and lead app at the urgo clinic.  Lasted about 45 minutes to learn more about urgo model, tour facility and go through basic interview.", "Interview Questions": "What interests you in urgent care?"}, {"date": "18 Jan 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL)", "Interview Descriptions": "Phone interview, followed by in person meeting with management. When meeting with the manager they conducted peer interviews with staff members. After the interview, HR called with an offer including salary, benefits, PTO, and sick time.", "Interview Questions": "Describe a conflict between you and a coworker and how you handled it. "}, {"date": "22 Apr 2022", "title": "Student Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Jan 2021", "Interview Descriptions": "I spoke with someone from HR for my interview and it took about 15-20 minutes. I thought the questions were pretty simple and straightforward.  They asked maybe around 5 questions and gave me a time that I should expect to hear back from them.", "Interview Questions": "Why did you apply to the nurse intern program at OSF?"}], [{"date": "6 Mar 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Jan 2021", "Interview Descriptions": "Screener call, to Hiring Manager, to any number of additional interviews including peer, staff, physicians, hospital management, etc.  You'll get a call from someone in Peoria, to screen, then they will make their recommendation to the hiring manager.  That can be a short process, but beyond that, it will most-likely drag on for several weeks to months, at which time great candidates have already moved on.  Based on the process,  and strictly my opinion, if you're \"older\" and/or \"male,\" the likelihood of moving forward falls dramatically.  Their was a hint of arrogance in talking with the hiring manager and it felt as if \"degrees\" mattered more than \"experience.\"", "Interview Questions": "Many questions fell into the \"behavioral\" category.  \"Tell me about a time,\"  \"Give me an example of,\"  etc.  A lot of questions were theoretical, \"How would you....,\" which are no where nearly effective as a behavioral question with very specific examples."}, {"date": "16 Dec 2020", "title": "Strategic Ambulatory Development Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare in Dec 2020", "Interview Descriptions": "Absolutely the best interview process I have ever encountered.  I interviewed with the director of this division, and she eschewed the traditional Q&A format and basically let me talk about myself, my work history, and my aspirations with OSF", "Interview Questions": "How would you approach a project without a clearly defined goal?"}, {"date": "13 Oct 2021", "title": "Rehab Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at OSF HealthCare (Urbana, IL) in Dec 2020", "Interview Descriptions": "The interview itself wasn't a problem. The amount of hoops you have to jump through to start it though; you'll find something else in the time it takes.\nVERY basic questions, they're pretty desperate getting anybody in there at their current 40% turnover.", "Interview Questions": "Why do you want to work for OSF?\nWhat makes you the best candidate for this position?\nHow would you handle conflict with a coworker?"}, {"date": "14 Oct 2020", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at OSF HealthCare (Rockford, IL)", "Interview Descriptions": "My interview was very laid back and conversational. I felt really comfortable with the team and my supervisor, Kim. We sat in the cafeteria and I told her about my life and I totally forgot it was an interview.", "Interview Questions": "How much do you expect to get paid? Tell me about yourself. What job experience do you have? Basic questions like these."}, {"date": "9 Oct 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at OSF HealthCare", "Interview Descriptions": "Interview process was great manger was in contact the whole time. Interview I was walked around building and got to talk to some staff about the day to day job. Got to meet a provider. Building very clean and new looking. Everyone was very polite and welcoming.", "Interview Questions": "Tell me about a time when you encountered a difficult patient. "}, {"date": "15 Sept 2020", "title": "Assistant MOA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at OSF HealthCare (Galesburg, IL) in Sept 2020", "Interview Descriptions": "Two part interview process. First you meet with the office manager. Second you will have a peer interview. Recruiting will reach out to you first to complete a screening. Lastly, if an offer is made, recruiting will also be the ones to reach out.", "Interview Questions": "What we’re some of my weaknesses and strong points. How I could improve upon those. How to handle work place conflict."}, {"date": "3 Sept 2021", "title": "Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare (Peoria, IL) in May 2020", "Interview Descriptions": "The interview process was completely remote. There are several layers when moving through the process. Each time meeting more and more of the team. First you are contacted by an HR mission partner, then the direct supervisor and finally you meet with the whole", "Interview Questions": "What is your idea of success"}, {"date": "12 Jan 2021", "title": "Performance Improvement Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in May 2020", "Interview Descriptions": "Applied for the Performance Improvement Specialist position via the careers website in November 2019.  Had a phone screen with the recruiter in January 2020.  Then was scheduled for a separate phone screen with a program manager in January 2020.  I was then asked to prepare a presentation for a group/panel interview in February 2020.  I prepared a presentation with handouts and a PowerPoint for 9 other Performance Improvement Specialists.  Then immediately went to an interview with the PI Manager and PI Director.  I was moved forward in the interview process.  They asked me to meet with 3 members of executive leadership in March of 2020.  it was canceled due to COVID.  It was rescheduled for May of 2020.  This was an extremely long and difficult interview process even without the delay of COVID.  They were very thorough as they only had one position available.  I was called 3 weeks later by the PI manager.  I was not offered the position because the candidate they offered the position to had more experience.   When asking for feedback, I was told I interview very well, but I need more direct experience.  He suggested I should get involved with a RIM project.", "Interview Questions": "What PI methodologies are you familiar with."}, {"date": "13 Jul 2022", "title": "Applications Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OSF HealthCare (Peoria, IL) in May 2020", "Interview Descriptions": "Standard interview with primary focus on independent working ability and prior knowledge of EPIC. Went over typical duties that would be done on a daily bases. Team lead was also in the interview.", "Interview Questions": "What was your previous experience with EPIC systems?\r\nHow well are you at working with a remote position?"}, {"date": "25 Feb 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Phone interview first then in person interview. Hiring process was fairly slow. Don’t know what else to say about it so I will continue until I get 30 words oh my god it still wants more why is it doing this.", "Interview Questions": "Handling stress"}], [{"date": "22 Oct 2021", "title": "Assistant MOA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at OSF HealthCare (Chicago, IL) in Feb 2020", "Interview Descriptions": "Manager sounded amazing but they don't allow you to sit. So your entire 12 hour shift you will be standing. When I asked, she said the company wants to make sure the patient feels  like we are ready to help as soon as they walk in that door.", "Interview Questions": "What makes you fit for this job position?"}, {"date": "28 Mar 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Feb 2020", "Interview Descriptions": "The phone interview that I had was average. It was easy getting it set up with human resources. This was done mainly through email. The interview itself only lasted about 15 minutes. They only asked a few questions. A few weeks later I was called to do an in-person interview which is scheduled for next week.", "Interview Questions": "Strengths and Weakness"}, {"date": "9 Apr 2023", "title": "Image Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Nov 2019", "Interview Descriptions": "Mostly asked situational questions like tell me about a time when… how did you react and what was the outcome. They also asked about strengths and weaknesses, and to tell about yourself.", "Interview Questions": "Tell me about a time when you dealt with a difficult coworker. What did you do and what we the results."}, {"date": "9 Sept 2020", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Ottawa, IL) in Jul 2019", "Interview Descriptions": "Phone interview first with Director because I was from out if town and then in person peer review with director/supervisor/ 2 other techs. It wasn't too invasive but they wanted a list of all the different kinds of equipment I've worked on.", "Interview Questions": "What was your most expensive mistake on the job?"}, {"date": "29 Apr 2023", "title": "System Application Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Jun 2019", "Interview Descriptions": "In person with several managers, not only from the team I was applying to but also for the other teams. It was a very casual interview with a decent amount of non-work based topics.", "Interview Questions": "What interests you about this position ."}, {"date": "2 Jan 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare (Urbana, IL) in Apr 2019", "Interview Descriptions": "First I interviewed one on one with someone in the volunteer services, then interviewed with 3 different managers from different units. Then I rated 1-3 which unit I wanted the most, and the managers did the same and I was matched with the department that I best fit.", "Interview Questions": "Why do you want this position? What are you strengths and weaknesses? What makes you stand out over other candidates? Describe a time you had a conflict with a coworker?"}, {"date": "22 Jul 2019", "title": "Service Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OSF HealthCare (Peoria, IL) in Mar 2019", "Interview Descriptions": "Applied online. Spoke briefly with management before having a phone screening with Human Resources. The recruiter was direct and to the point, but personable and friendly. Knowing OSF's mission statement and core values; having the ability to tie this into your role as a potential mission partner is a big hit. Other than that the interview was very situational.", "Interview Questions": "How did you resolve a difficult conflict in the past in a former job role?"}, {"date": "16 Jan 2022", "title": "Transport and Lift Team Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Feb 2019", "Interview Descriptions": "It was an entry level job, so business casual was allowed. I sat down with my manager and lead for basic interview questions. It was a laid back setting, and I received a call 2 days later.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "1 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at OSF HealthCare", "Interview Descriptions": "good experience nice people. good company benefits and vacay time. Nice company. Fairly routine interview question about my resume and past experience. Quiet unit. Great staff and good working place to be employed.", "Interview Questions": "weakness"}, {"date": "6 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Jan 2019", "Interview Descriptions": "You first get a phone interview and if you pass that you proceed to a face-to-face interview.  The people I met with were very easy to talk to and made the interview process more comfortable.", "Interview Questions": "They asked my thoughts on their mission statement. "}], [{"date": "21 Nov 2020", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare in Jan 2019", "Interview Descriptions": "Email from a recruiting agent-I let him know my interest and availability- they contacted the manager in the the department I was interested in and set up a meeting- submitted a list of references-recieved an offer", "Interview Questions": "Name a situation in which you wished you would do something different. "}, {"date": "12 Oct 2018", "title": "Front Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "An email and a text requesting a phone screen was received. Dates and times were given to choose from, and an appointment was made.  The interviewer called on time, asked basic questions.  The whole conversation lasted 15 minutes.", "Interview Questions": "Why did you leave your last job?"}, {"date": "28 Nov 2020", "title": "Room Service Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Oct 2018", "Interview Descriptions": "More of a conversation than an interview. It was short and easy to follow. The manager told me what I would be doing and asked if I'm willing to perform those duties. Had an offer after the end of the conversation.", "Interview Questions": "I wasn't asked any questions. Mostly talking about myself and my previous positions. "}, {"date": "12 Jul 2018", "title": "Telemetry Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare", "Interview Descriptions": "I received a call back and set up the first interview. After the first interview they had me come back for a pier interview. Which in a few days I got a call offering me the job.", "Interview Questions": "At the end they asked why should I be selected for the job?"}, {"date": "16 Jul 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Bloomington, IL) in Jul 2018", "Interview Descriptions": "I applied through the website for an ICU nurse position and got a call 20min later for a phone screening. The OSF recruiter was very friendly and the interview started off with general questions about shift times, pay, and etc. Then started asking me behavioral questions.", "Interview Questions": "How will I contribute to OSF's mission? "}, {"date": "8 Jun 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare", "Interview Descriptions": "Applications taken on line.  Followed by phone interview with HR rep.  After progressed to interview with direct supervisor and director of department.  References were then checked electronically.  Offer received.  Process was approximately two weeks.  Very efficient process.", "Interview Questions": "Situationally how would you handle..\r\n."}, {"date": "30 May 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OSF HealthCare", "Interview Descriptions": "Questioned by two supervisors. Was very intimate and comfortable. They made me feel like it was just a meeting rather than an interview. Asked questions based off of my resume. Gave a computerized keyboard skills test.", "Interview Questions": "What is it that you believe that you can bring to our team?"}, {"date": "24 Apr 2018", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "This was a phone interview.  Phone interview is the first step, once you do it it's good for 6 months for any job you apply for.  Interviewer spoke very quickly, it was a little difficult to process the question she spoke so fast.  Interview itself was rather quick", "Interview Questions": "Something about how will you apply yourself in the Sisters' Mission?"}, {"date": "30 Apr 2019", "title": "Privacy Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Apr 2018", "Interview Descriptions": "Called by HR for screening questions about salary which is quite low, but person was very nice and said they’d work with me; impromptu call from the manager who was very nice; onsite panel interview; tour by employee who didn’t know where anything was and had me wandering around in heels and dress in the rain; lunch in the hospital cafeteria and final interview with Chief Compliance Officer and manager.", "Interview Questions": "What is 164.512? What are the patient rights under HIPAA? Numerous other trivia questions. Have you updated a Nop? Handled a breach over 500? What kind of training have you been involved with? Do you write breach letters and report to OCR? Standard behavioral."}, {"date": "27 Mar 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at OSF HealthCare", "Interview Descriptions": "Manager was prompt and kind, peer interview panel of several employees. No surprises, pretty straightforward, good experience and I accepted the position. They got back to me in a few days.", "Interview Questions": "Please describe what about this position is attractive to you."}], [{"date": "28 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at OSF HealthCare (Peoria, IL)", "Interview Descriptions": "It took a long time to hear back from Human Resources after putting in an application, but actual interview process and hiring  moved quickly. The actual interview questions were what is typical for a professional interview.", "Interview Questions": "How I handle conflict"}, {"date": "10 Nov 2017", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at OSF HealthCare in Oct 2017", "Interview Descriptions": "I applied online on the OSF website and about 2 weeks later I received an email from a recruiter to set up a phone interview. The phone interview was short and sweet. I ended up applying for about 10 different positions. It took about a month to get a phone call from a manager to set up a in person interview. About 2 weeks later, I got a phone call from the recruiter to check my email and do the reference check.  Three days later she called and offered the job.", "Interview Questions": "tell me about yourself."}, {"date": "29 Sept 2017", "title": "Guest Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OSF HealthCare (Peoria, IL) in Sept 2017", "Interview Descriptions": "I applied online. Waited a few weeks before getting a phone call which turned out to be a fairly standard phone interview. Easy. Then I went a few months without hearing anything, which was disappointing because I knew I had done well in the phone interview.. Nevertheless, I was called a couple months later and told about a few of the open positions and hours available, etc.  Once we were on the same page with what I was looking for, we set up a time for an in person interview. I went in and met with a supervisor. We sat and talked for maybe 20 minutes. Very short and to the point -standard. I then got to go and observe a couple different positions that would be closely related to what I would be doing. There was a peer interview where an employee evaluated me as I answered questions (more standard interview questions, nothing too complicated). Then I just got to observe and ask questions about the different positions it was actually really cool to see first hand the job environment and duties. After all of that, I was told that the reference check was next and after that was done, I would hear about an offer. About a week later, I got a call saying my interview and reference check went GREAT and they would love to have me. Now just waiting for HR to contact me with drug test dates and then I'm all set!! *TIP: Know the OSF mission statement and how to relate it to yourself*", "Interview Questions": "Name a time you had to adjust to change in the workplace."}, {"date": "29 Jun 2017", "title": "General Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "Applied online, was sent a small questionnaire about salary requirements and personal experiences related to this position, was then contacted about an in person interview and they were quick to accommodate. They asked a lot of questions some were related to the position and some were not. I felt uncomfortable because they asked me if I was okay with having crucifixes on the wall/ okay with them praying before meetings. I don't have any issues with that but found it walking a fine line of illegal/discrimating questions during the interview.  After the interview they asked me to do a small quiz. The decision process was a little frustrating because there wasn't much communication.  I feel as though if I didn't reach out, they would have not told me either way.", "Interview Questions": "Are you okay with crucifixes on the wall/ okay with prayer before meeting? "}, {"date": "22 Sept 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Chicago, IL) in May 2017", "Interview Descriptions": "It was Very straightforward and easy. The interview is only behavioral basic questions such as hobbies, clubs, passion for volunteering. They also asked about what your weakness and strengths are.", "Interview Questions": "What do  you enjoy about volunteering"}, {"date": "27 Sept 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Danville, IL) in Mar 2017", "Interview Descriptions": "Don't do it. It's not worth the hell you go through. They don't care for their employees  never have. Just care about patient satisfaction scores always understaffed and over worked.", "Interview Questions": "Why should we pick you?"}, {"date": "30 Jan 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at OSF HealthCare in Jan 2017", "Interview Descriptions": "After applying online I was contacted to do a phone interview with a recruiter. After a typing test I had a interview with the manager and 2 other mission partners. Waited a few days to be contacted and offered the position.  Then had to finish paperwork and visit occupational health for a exam and provide records of immunizations and be fingerprinted. All in all took about a month from first phone interview  to start date.", "Interview Questions": "how would you deal with conflict"}, {"date": "2 Feb 2017", "title": "Process Improvement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Jan 2017", "Interview Descriptions": "Cold, impersonal phone interview. Rapid fire questions about job and past experience. Overall, it seemed to go well, with an expectation that a face interview would be scheduled with next level of management within a week or so. Job status remained 'under consideration' for 3 weeks, then changed to 'no longer under consideration'. Seems to be a very cold process for people who would very much like to work there.", "Interview Questions": "What is Process Improvement about"}, {"date": "3 Aug 2016", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "the process was straightforward. I was interviewed on the phone with HR and the pharmacy manager before invited to an onsite interview. on site interview, was interviewed by peers and pharmacy managers then tour around the hospital", "Interview Questions": "what is the importance of pharmacy technician?"}, {"date": "11 Apr 2017", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Rockford, IL) in Jul 2016", "Interview Descriptions": "Know the Mission Statement and Core beliefs.  Otherwise interview is pretty basic.  Be able to explain examples of \"times when\" and how you handled the issue. Know everything listed on job posting, except billing codes.", "Interview Questions": "Explain a time you worked as a team and how it worked well."}], [{"date": "10 Mar 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at OSF HealthCare (Peoria, IL) in Jul 2016", "Interview Descriptions": "It is all scripted questions. Nothing too detailed about the questions, describe situations with teamwork and crisis situations. Generic questions due to they have multiple applicants so they would like to compare answers to the same questions.", "Interview Questions": "Describe a time you worked as a team player"}, {"date": "28 Nov 2016", "title": "Technology Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OSF HealthCare (Peoria, IL) in May 2016", "Interview Descriptions": "Social questions, asked about technology projects, interviewed with manager from my school. Asked about a conflict situation during my previous employment and how I resolved the situation. Social questions, asked about technology projects, interviewed with manager from my school. Asked about a conflict situation during my previous employment and how I resolved the situation.", "Interview Questions": "Tell us about your SQL experience"}, {"date": "5 Apr 2016", "title": "Healthcare Analytics Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (East Peoria, IL) in Apr 2016", "Interview Descriptions": "They were extremely rude and snooty about the whole thing starting when I walked in the door. Additionally, they didn't seem to know what they were actually looking for. It's a summer internship but they got irritated when I said that I probably wouldn't be able to work while still in school and even more irritated when I said I might be going out of state for grad school in the Fall. Overall I was very disappointed in their lack of professionalism and realized that whether I got an offer or not, I didn't want to work in that environment.", "Interview Questions": "If you were given an assignment to use a program you have no experience with and knew nothing about and had no mentor, what would you do?"}, {"date": "7 Mar 2016", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare", "Interview Descriptions": "Questions about who I was as a person,  my likes and dislikes,  previous employment and how do I handle stress on the job. The interview was Conducted by the sweetest person ever and she remains that way till this very day.", "Interview Questions": "What made me apply for the position?"}, {"date": "16 Jul 2018", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OSF HealthCare (Urbana, IL) in Jan 2016", "Interview Descriptions": "Apply online, interview over phone, meet with human resource, meet department manager with senior technician in that department.  Interview with both.  Questions are asked from a printed paper that are asked for you to answer.  Based on your response, body language, demeanor and overall impression in fulfilling the posting you are offered the position.", "Interview Questions": "Your experience."}, {"date": "29 Sept 2016", "title": "Manager Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at OSF HealthCare in Jan 2016", "Interview Descriptions": "Called me fast, get to back to me within one day of the interview. Excellent streamlined process; expectations set forth; met my culture expectations from the CNO down. Was there for several hours, which is expected for a manager position., but I was done in one day and didn't have to return several times", "Interview Questions": "Many Questions: patient satisfaction: accountability: industry standards: etc"}, {"date": "30 Sept 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at OSF HealthCare (Alton, IL) in Nov 2015", "Interview Descriptions": "I applied for this position in August of 2015. I was called at the end of November 2015 for an interview. I completed a quick 15 minute interview with the department manager. Then I was called back the following week for a second interview with administration. I was offered the job at the end of December and finally started on January 2016.", "Interview Questions": "Why do you feel you would be a good fit for OSF?"}, {"date": "14 Sept 2015", "title": "Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at OSF HealthCare (Peoria, IL)", "Interview Descriptions": "A overly 'professional' panel interview with an assortment of unqualified staff to ask pre arranged questions who's 'reveiws' were ignored in the end in favor of the most senior management opinion. The hired candidate was grossly unqualified compared to most of the staff applying but she was friends with management.", "Interview Questions": "What would you do in case of a fire on the floor?"}, {"date": "5 Oct 2015", "title": "Education Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Sept 2015", "Interview Descriptions": "Since I lived an hour away, the first interview was a phone interview. It seemed to go very well.  \r\n\r\nThey called about a week later for a face to face, which was scheduled another week later. An hour before the interview, they called saying that the interviewer was having to cancel for a family emergency. I had already driven 65 miles and was in town. They couldn't interview me on my next day off. I was rattled by the late cancellation and asked about the number of interviews.They said they interviewed 10, but I was \"one of three to get a call back.\"\r\n\r\nThey called back ten minutes later as I started to drive home to have me come in at the scheduled time. They had someone else to interview me, who I learned was the head of the department.  They showed me around and introduced me to everyone I would encounter on the job.  They told me that my interview was the last of all the interviews and they would be in contact. I followed up with emails and \"thank yous\" just days after the interview.\r\n\r\nDay 11, I still had no letter, email, or call so I emailed the administrative assistant.  She did not reply for over 24 hours, so I emailed the first interviewer to follow up.  She replied almost immediately and and they told me they would have a decision by the end of that week. Five minutes later the admin asst finally replied saying the same thing. That time frame came and went.  \r\n\r\n18 days after the second interview, I finally called the first interviewer and was told they had made an offer to another candidate and were waiting for things to be tied up with them before they contacted the candidates that were not getting the job. I asked what qualifications I was short on, and she said that I was qualified, but they \"found a candidate they thought was a better fit for the team.\"", "Interview Questions": "How many times have you called off work in the last year?\r\nWhat are your career goals?\r\nWill you miss your old job? \r\nHow will you handle winter drives with your commute?\r\n"}, {"date": "30 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare", "Interview Descriptions": "I don't even remember much of my first interview. You have an in person interview and then if they like you, they pass you on to the \"Firday Interview\" which is the CEO, nuns and HR people.", "Interview Questions": "Why do you want to work for us?"}], [{"date": "30 Jun 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OSF HealthCare (Peoria, IL)", "Interview Descriptions": "The interview process went fairly quickly yet smoothly.  My initial interview was conducted over the phone by a recruiter.  After they processed that interview, they elected to proceed through to the next stage.\r\n\r\nThe interviewer (my manager) worked around my hectic school and current work schedule to accommodate the face to face interview.  This impressed and pleased me greatly.  The initial interview with her went well, and she contacted me to schedule a peer interview with my shift leader.   This too went well after another round of questions.", "Interview Questions": "How do you feel you can help with the Sister's mission?"}, {"date": "4 Jun 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OSF HealthCare (Peoria, IL) in Jun 2015", "Interview Descriptions": "I was one of four interviewees.  I was telephoned after I submitted a more in depth interview form.  I was interviewed 1:1 by the Director, who asked me situational questions.  After the interview, I was asked to fill out another situation questionnaire.  If selected, I will go on to be interviewed by the Supervisor's I will be working under.  There will then be a skills test.", "Interview Questions": "Why should everyone come to OSF for healthcare?"}, {"date": "16 Jul 2015", "title": "Utilization Review Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Jun 2015", "Interview Descriptions": "Two nurses asked questions from prepared pamplet. Provided scenarios and asked how you would handle situation , providing examples. Interview was set up in quiet, comfortable setting. Very non threatening.", "Interview Questions": "Name incident you had difficult caller and how you handled it. They asked for example from past experience."}, {"date": "25 Jan 2016", "title": "Supply Chain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at OSF HealthCare (Peoria, IL) in May 2015", "Interview Descriptions": "Not to bad, interviewed with a few people that worked there! They are great people and want to learn about you and what you know about supply chain within the hospital!", "Interview Questions": "Tell me about your experience"}, {"date": "12 Mar 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at OSF HealthCare (Rockford, IL) in Mar 2015", "Interview Descriptions": "5 managers of different floors asking you interview questions.  You were able to pre-select your preferences, but managers of floors with greatest need tried to sell you on taking job on their floor.  Had a good \"in\" because had completed a \"Student Nurse Internship\" at facility.", "Interview Questions": "Goals in 5 years.  Patient scenario.  How would you handle patient assignments."}, {"date": "15 Jan 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OSF HealthCare in Mar 2015", "Interview Descriptions": "The hiring process was smooth and questions asked during panel interview were relevant and pertinent to the job requirements. Hiring process consisted of two interviews, a screening with a Human Resources department staff member and a final panel interview with the nurse manager.", "Interview Questions": "Give me an example of a time when you had to go above and beyond the call of duty to get the job done?"}, {"date": "16 Oct 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OSF HealthCare (Peoria, IL) in Feb 2015", "Interview Descriptions": "Basic HR Phone call then meeting with manager review panel.   Questions were fairly easy. They wanted to know about your abilities and the role you play in your current job.", "Interview Questions": "Describe a positive business contribution you made?"}, {"date": "28 Jan 2015", "title": "Sterile Processing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at OSF HealthCare", "Interview Descriptions": "submitted resume, received a response within days quick interview with the manager then the HR department contacted me. had to do a full physical and week long orientation. overall pleasant experience and I was in an out in an instant", "Interview Questions": "nothing, questions were straightforward and easy to answer"}, {"date": "6 Apr 2015", "title": "Physician Assistant, Family Medicine Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at OSF HealthCare (Galesburg, IL) in Dec 2014", "Interview Descriptions": "Two phone interviews, then an in person interview.\r\nThey provide transportation and housing for the interview, if needed\r\nEveryone was very nice, very positive\r\nThey initially told me that they would get back with me within a week, regardless of whether or not I received the job, but they did not contact me. I called the recruiter, because I needed a definite answer for another job, and it took me an additional two weeks to get in touch with her. She told me I did not get the job because they decided they needed someone sooner.\r\nThey are very nice and kind, regardless of whether they intend to offer you the position or not.", "Interview Questions": "Why did you choose to become a PA?"}, {"date": "14 Nov 2018", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OSF HealthCare (Peoria, IL) in Apr 2014", "Interview Descriptions": "Recruiting set up the interview. I had two interviews, one with hiring manager and one with Human Resources. I was asked about my prior experience and why I wanted to change companies. I was offered the job after the second interview .", "Interview Questions": "Prior experience"}], [{"date": "15 May 2015", "title": "Orthopedic CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OSF HealthCare in Apr 2014", "Interview Descriptions": "I only had one phone interview and they called back a month later offering me the job.  During the interview they asked me questions about what I had experience with, and specifically asked about urinary catheters, bladder scans, chest tubes, and charting program experience to name a few.  Overall it was a fairly simple interview performed by the nursing manager and one of the nurses from the orthopedic floor.", "Interview Questions": "What experience have you had that makes you a qualified candidate for this position."}, {"date": "18 Oct 2016", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at OSF HealthCare (Peoria, IL) in Sept 2012", "Interview Descriptions": "Informal walkthrough of facility.  Asked about my experience, hospital size (that I was currently working at), list of procedural knowledge, RAI procedures, technical questions about cameras, etc.  Discussed goals, future plans for the department, call hours, expectations of work, dress code.  Spoke to the values of the hospital and organization.", "Interview Questions": "Which camera system do you use at your current facility?"}, {"date": "22 Mar 2014", "title": "Guest Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OSF HealthCare (Peoria, IL) in Jan 2012", "Interview Descriptions": "Initial contact was made through online application and resume submission. Next, I received a Phone call from human resources to set a time for a over the phone initial interview. After the phone interview was completed, I had a 1-on-1 interview with the department manager, and then with the supervisors. Approximately one week later I received phone call from human resources with a job offer.", "Interview Questions": "Why did you apply to OSFMC, as opposed to our main competitor Unity Point?"}, {"date": "6 Sept 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at OSF HealthCare (Alton, IL) in Jan 2012", "Interview Descriptions": "Previous to OSF taking over; interview process was fine, No interview ; former employee; Not a nice place to work for. No life to work balance; want you to wok all the time.", "Interview Questions": "About reliable car"}, {"date": "20 Oct 2011", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at OSF HealthCare (Galesburg, IL) in Jul 2011", "Interview Descriptions": "They called and offered an interview.  Then did a short phone interview.  Very comfortable.  Then went in for a one on one and a tour and it was comfortable and very nice.  It is a very laid back atmosphere and people are friendly and generally kind to one another.  They asked basic question like what are your strong points and what are your weak points and such.", "Interview Questions": "what are your strong points?"}, {"date": "27 Feb 2014", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 months. I interviewed at OSF HealthCare (Peoria, IL) in Jul 2011", "Interview Descriptions": "The hiring manager was a former boss, she contacted me to get my resume and set up a lunch interview including her boss. I wasn't given a job description and it was very informal; I was told to wait a month or so until they had the job nailed down and see if I went further in the process.  That was July.  I kept in touch and tried not to call too much; about every couple of weeks at first.  I was continually told to hold on, they were still considering me, but the job was up in the air.  By October I was still kind of hoping it was a possibility but checked back less often.  Finally after we got back from our Christmas vacation I called to see what was up.  By that time I had pretty much decided to forget about it, but just wanted to close the loop.  I was finally told that they had actually reorganized the team and there was no job available as they had thought.  I don't have any sour grapes but the process was extremely long and it seemed as if no one could make a decision.  I'm not sure I would enjoy working in that type of environment, so it's probably all for the best.", "Interview Questions": "I remember being asked to explain about my career path, and I think it was stated something like, \"What's your story?\"  Which seemed vague but was good-natured. It was a casual interview.  Perhaps they felt that might rattle certain people, but I guess I enjoy talking about myself! :)"}, {"date": "1 Jun 2015", "title": "Supervisor, Sales and Marketing, OSF Systems Laboratories Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OSF HealthCare (Peoria, IL) in Feb 2011", "Interview Descriptions": "Interviewed by team of 5 laboratory departmental managers, laboratory director and 2 paid consultants from another state.  The interview lasted about 1 hour, consisted of scripted questions that the staff apparently was not familiar with prior to the interview.  None of the interview team had any experience in sales, business development or marketing.  None of the staff had any knowledge of managed care, current market conditions or insight into major competitors in the region.", "Interview Questions": "If given the position, what would be the first thing you would do?"}, {"date": "28 Mar 2009", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at OSF HealthCare (Galesburg, IL) in Mar 2009", "Interview Descriptions": "Initial phone contact with the company very positive. They were looking for a Physician Assistant or Nurse Practitioner to work in a small rural clinic. Very good at describing on the phone all parts of job description.\r\nIncluding benefits, pay structure, etc. They were very eager to fill the position. Did seem a little slow at returning initial phone call. I got the feeling sometimes the right hand did not know what the left hand was doing. It must be a smaller operation where everyone goes to lunch at the same time. No one answers the phone at that time.", "Interview Questions": "Do you feel comfortable working without a physician in the office?"}, {"date": "20 Dec 2010", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at OSF HealthCare (Peoria, IL) in Dec 2008", "Interview Descriptions": "It was an on site interview with several other IT staff members.  It seemed to be an ad hoc interview and the questions asked weren't probably asked of other people interviewing.  In other words the people interviewing didn't have a standard set of questions on any form or questionnaire.   \r\nIf I had to do it all over again I would have asked technical questions of those doing the interviewing to get a feeling of their technical expertise.  Had I knew their low level of expertise I would have walked away.  Ask them if any of them are certified in anything at all.", "Interview Questions": "N/A"}, {"date": "28 Feb 2010", "title": "SummerFoundation Offices Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at OSF HealthCare (Peoria, IL) in Jun 2008", "Interview Descriptions": "It was easy, and primarily centered around \"fit\"", "Interview Questions": "N/A"}]]