[[{"date": "27 Jan 2023", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at LIFT", "Interview Descriptions": "Interview process was great. Everyone was really kind and gave me a tour of the facility. Very clean office environment as well as Shop area. Owner was extremely kind and giving. All employees were also very kind and helpful.", "Interview Questions": "Normal interview questions regarding to position"}, {"date": "21 Jan 2023", "title": "Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LIFT (Washington, DC) in Nov 2022", "Interview Descriptions": "I had a screening interview with a recruiter (from First Choice Talent Solutions). It was a standard screening interview. But I never heard a peep from him again - nothing to tell me I wasn't moving on to the next step in the process. I understand if I wasn't, but it's only courteous to tell me so since I had spent time talking to him about myself. This is such unbelievably rude treatment of applicants, even if they are choosing not to consider them anymore.", "Interview Questions": "I was asked standard interview questions."}, {"date": "1 Sept 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at LIFT", "Interview Descriptions": "The recruiting process was a mess from the start. I was reached out by a hr recruiter and did the typical screening. A week later another recruiter reached out by mistake. They asked me to send times for a follow up. Was told there was scheduling issues but wanted to let me know they were interested. A week passed and no response. I followed up and was scheduled to meet with one of the hiring managers . It was clear from the interview vibes that the org didn’t care about the interview or already chose someone . The person  showed up late and was clear that she did not review my resume beforehand as she took moments to read over it while in the interview and made up questions on the spot. I wrote off the job half way through the interview because if hiring is this messy then the job has to be too.", "Interview Questions": "What is your management style?"}, {"date": "10 Feb 2022", "title": "Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at LIFT (Washington, DC) in Jul 2021", "Interview Descriptions": "The interview process was thorough, personable, and informative. Interviewers asked powerful, direct questions to gauge both interest and competency in relation to the organization's mission.  All questions served a purpose and the interviewers answered questions clearly.", "Interview Questions": "Which of the core principles resonated most?"}, {"date": "22 Feb 2023", "title": "Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at LIFT (Washington, DC) in Jul 2021", "Interview Descriptions": "I was connected via my graduate program and then reached out to the program managers. I was interviewed virtually and the process was swift and amenable. The mission of the organization and position expectations were communicated clearly.", "Interview Questions": "Questions which gained a sense of who I was and also how my vision/values aligned with the organizational mission."}, {"date": "11 Apr 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at LIFT", "Interview Descriptions": "I had a negative experience interviewing with this organization. I felt rushed through the entire process and no follow up regarding the position. The first round was an interview with HR. It was a standard interview.  I wanted to ask more questions but the HR person rushed me off quickly. Then I was asked to complete a project with a quick turnaround time. I completed it and then met with a senior leader. She was open and explained that the Chicago office was going through transition and she would serve as the interim Executive Director. The interview was fine. I moved to the next phase in the process which was a zoom interview with several people in various positions in the Chicago office, a senior leader from the national team, and a program manager from the LA office. The questions were typical interview questions but I few hands ones. I finished the interview and send individual thank you emails. They said I would hear something in a few weeks but I didn’t hear anything. I checked in via email but no response. I’m okay getting rejected for this role but it would have been nice to be notified of this especially since I went so far in the process in a short time frame. Even if they went in a different direction but I didn’t appreciate not having any kind of follow up.", "Interview Questions": "What is your coaching style?"}, {"date": "17 Sept 2019", "title": "Accounting Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at LIFT (New York, NY)", "Interview Descriptions": "Submitted my resume online and was contacted by the HR manager for a phone interview.  During the phone interview, I was invited in for an in-person interview where I was interviewed by 3 people from 3 different departments.  The interview lasted about 45 minutes.  Every interviewer was under the age of 30. As a seasoned professional, I observed that diversity is not practice in the workplace.  They asked generic questions just to go through the motions when they had no motivation to hire me because I wasn't in their age range. This demonstrated that diversity is not practice in the organization and evaluation of resumes are extremely shallow for my experience spoke for itself. No disrespect to the younger generation but sometimes wisdom & experience is needed when making sound judgments. Needless to say, I didn't get the job due to age discrimination because there was no way in hell that my professional background didn't align with the job description. So in my professional & personal observation age was a factor for I have experienced age discrimination when interviewing with younger staff members.", "Interview Questions": "What is not on your resume that we should know about you?"}, {"date": "7 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at LIFT", "Interview Descriptions": "It was short and sweet. The whole process took about two weeks to get through. The questions they asked during the phone screen were your general interview questions. Easier than most processes I've been through.", "Interview Questions": "Why do you want to intern here? What attracts you to our organization?"}, {"date": "10 Aug 2016", "title": "Community Advocate () Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LIFT", "Interview Descriptions": "I applied online and a week or two later I received an email to set up a phone interview. The interview lasted about twenty minutes. I was asked to discuss past experience and why I would be a good fit for the position. There were also some scenarios where I had to describe what I would do. Overall, pretty straight forward.", "Interview Questions": "How would you describe email to someone?"}, {"date": "4 Aug 2015", "title": "Community Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LIFT", "Interview Descriptions": "I first submitted an online application along with a resume. Then, I had a brief phone interview that consisted of several questions - the second half of the interview was about different scenarios and what I would do in each of them and how I would handle the situation.", "Interview Questions": "A question along the lines of - how I dealt with working with diverse communities"}], [{"date": "5 Oct 2015", "title": "Summer Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LIFT in Apr 2015", "Interview Descriptions": "It was a very interesting interview! They asked series of hypothetical situations to see how we would deal with real issues that their clients deal with. The recruiter was very nice and answered my questions well. He was looking for people passionate and knowledgeable about the mission statement. I recommend looking at their website ahead of time to really understand what the non profit does. They have an amazing staff that works well together and I would recommend applying to work for this organization!", "Interview Questions": "What does it mean to be in poverty?"}, {"date": "28 Mar 2015", "title": "Summer Advocate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at LIFT (Chicago, IL) in Mar 2015", "Interview Descriptions": "It was just a thirty minute Skype interview with the woman in charge of hiring.  The woman was very friendly and personable and the interview felt very informal and conversational.  I was told that I would be notified by the following week if I had been chosen for the Advocate position.  After the interview, I received an email stating I would actually be notified in two weeks time.", "Interview Questions": "Why do you want to work with LIFT?  What experience do you have volunteering?"}, {"date": "20 Aug 2014", "title": "Summer Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at LIFT", "Interview Descriptions": "Submit resume, and phone interview. I interviewed with NY, Philadelphia, and Chicago. Got accepted to NY and Philly on the spot, rejected by Chicago a week later. The interviewers are Americorps members.", "Interview Questions": "What is poverty?"}, {"date": "1 Sept 2015", "title": "Student Advocate () Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at LIFT (Philadelphia, PA) in May 2014", "Interview Descriptions": "Fairly straightforward: submitted my resume, completed a few short essays.  No references or letters of  recommendation required.  They also do not request a transcript.  The interview was by-the-books and not exceptionally difficult.  I heard back from the hiring manager very quickly (believe it or not, two hours after my interview!).  Onboarding was smooth with minimal paperwork.  I found that overall they were easy to communicate with and effective at answering my questions.", "Interview Questions": "Tell us about your experience doing community service"}, {"date": "14 Feb 2014", "title": "Site Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LIFT (Chicago, IL) in Feb 2014", "Interview Descriptions": "Round 1 of a phone interview took 2 weeks since applying. Waiting for an update/round 2 longer phone conversation. \r\n\r\nWith that said, this interview was more of a conversation. It only took 30 minutes. The first part was the Executive Director informing me on the organization's goals and mission. What services they offer, the role and responsibilities of the SC, and what required skills (i.e. language) are necessary for which office (i.e. Pilsen, Uptown). \r\n\r\nThe interviewer asked if I had any questions for clarification or logistics. I had none. \r\n\r\nThen, we moved onto the \"get to know you\" questions. \r\n\r\n1. What are some social issues that interest you?\r\n\r\n2. Have you felt that your involvement with LIFT in the Philadelphia office has met this interest? \r\n\r\n3. What about LIFT most interests you? What drew you to AmeriCorps programs and this program in particular? Why Chicago?", "Interview Questions": "Nothing unexpected. But, since I was familiar with the organization and how its run. A lot of the questions were phrased to see whether or not LIFT has lived up to my expectations in terms of the social justice issues that concern me, but also--why Chicago as opposed to Philadelphia, NY, Boston, etc. Since, I have prior experience. "}, {"date": "17 Jun 2013", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at LIFT", "Interview Descriptions": "I used internal contacts to more easily get through to the interview round.  However, often candidates are external or found through the AmeriCorps website.  The interview was in-depth about my qualifications for the job, philosophy of service and social justice, etc.", "Interview Questions": "What social justice issues inspire you the most?"}, {"date": "30 Jan 2014", "title": "Advocacy/Outreach Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LIFT (Chicago, IL) in Jan 2012", "Interview Descriptions": "I applied through a website and received an in person interview. The questions were mostly behavioral questions and the interview was pretty easy. She asked questions like \"when have you faced a challenge in your life?\", \"what makes you an exceptional candidate?\" The interview was in a weird kind of room and I only met with one person .", "Interview Questions": "\"What does LIFT do?\" Honestly, I didn't have much of an idea from the website. "}, {"date": "29 Sept 2015", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at LIFT (New York, NY) in Sept 2011", "Interview Descriptions": "Sent my resume and got a phone Interview... They were looking for employees at their site in New York City. I saw the post online and looked at their website. I then looked at any job openings and just sent my resume to the human resources department via email. I waited for a week and then suddenly I got a phone call from one of the staff members, I think it was the site manager, but I know didn't know. I just answer all the phone interview questions and then the person just hired my on the spot. I was very happy, I thought it could have been harder though.", "Interview Questions": "Why are you passionate about Lift?\r\nWhat are your greatest strengths and weaknesses?  \r\nPlease describe a time that you worked on a group project together, and had problems with your teammates. How did you resolve the issue?"}]]