[[{"date": "21 Apr 2023", "title": "Executive Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at John Muir Health (Walnut Creek, CA)", "Interview Descriptions": "Straight forward with a panel interview with mixed panel of executives and physicians. Questions were challenging and panel interview was engaging. Interview process moved quickly and ahead of schedule, Less of a wait than I anticipated", "Interview Questions": "N/A"}, {"date": "5 Apr 2023", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at John Muir Health (Walnut Creek, CA) in Jan 2023", "Interview Descriptions": "Made the final round. Environment felt very relaxed. Be sure to sound confident. I just wish they would have provided feedback on what I could have improved on to get the position.", "Interview Questions": "Describe a time that you received critical feedback from an employer. How did you respond?"}, {"date": "15 Dec 2022", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at John Muir Health in Dec 2022", "Interview Descriptions": "Situational experience questions series and tell you hiring process steps and except a call or email if being chosen. Question was series left and right non stop fast explanatory.ask if any question.. Additional question was asked situational despite being done with Q&A At the beginning of interview, the hiring manager provided info of work schedule and training session and explaining dress code upon start", "Interview Questions": "Tell me about your qualification on the job Why do you want work in JMH AND CASE MANAGER TELL me about your weakness or friends would describe you How do you handle pressure streas Where do you see yourself in 5yrs"}, {"date": "15 Nov 2022", "title": "Director of Annual Giving Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at John Muir Health", "Interview Descriptions": "The process started with a recruiter and I thought it was going great. After the final interview, I think I was just a number or a checkbox to them. End stages felt inauthentic and like the hiring team was not paying attention.", "Interview Questions": "Situational question about annual giving and acquiring donors."}, {"date": "28 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at John Muir Health (San Francisco, CA) in Jun 2022", "Interview Descriptions": "Zoom interview with two RN hiring managers who work on in the dept. They requested an interview 3 days after I applied online. The interview was relaxed, but I have been an RN for about 4 years so I was not too nervous.", "Interview Questions": "Why do you want to work in this field of nursing?\nAre you comfortable with floating to different departments? "}, {"date": "17 Jun 2022", "title": "Rehabilitation Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Pleasant Hill, CA) in May 2022", "Interview Descriptions": "Started with a tour, short interview with the interviewer who was a current therapist there and then I was directed to follow an aide to see what their duties were.\r\n\r\nI say the interview experience was negative because the interviewer did not talk about the job position at all. I was asked general questions listed below and then they left. For information about the job itself, I had to ask the aide I was told to follow. Speaking with the workers there was a positive experience. The aides showed me what they do in their day and what I would be doing. They also gave me a lot of insight on the work culture of the place, how productive they are expected to be and how busy it can get. \r\n\r\nWhen the aide guided back to the interviewer, they were in their office on browsing on their phone. After the fact, the interviewer just gave me her card and said I could send her references and went back to her office without saying anything else. Even after sending her multiple references, I did not get a response back from her. I did get an automated rejection letter weeks later however.", "Interview Questions": "The questions asked were mainly general ones. (EX: Describe yourself, Tell me about yourself, Tell me about a time you... Why should we hire you? What makes you stand out from others? etc.)"}, {"date": "29 Jan 2022", "title": "RN New Grad Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at John Muir Health (Concord, CA) in Jan 2022", "Interview Descriptions": "Panel interview  with multiple managers, professional development specialists, educators.  No other interviewees, just yourself. They gave a 30 minute time window. Rapid fire questioning. They gave time at the end to ask questions. No second interviews, like some other competitive residencies have you do a unit level interview as well, John Muir did not. Offer given next day", "Interview Questions": "Describe how you dealt with a dissatisfied customer/patient?"}, {"date": "28 Jan 2022", "title": "Staff Nurse I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health in Jan 2022", "Interview Descriptions": "The interviewers were very personable and made the process feel more like a conversational than a rigid question and answer session. They allowed time for the interviewee to ask questions. There was only one interviewee and about 6 interviewers.", "Interview Questions": "\"What led you to want to become a nurse\"\r\n\"Tell me about a time your patient quickly decompensated and you what actions did you take?\"\r\n\"Tell me about a dispute you had with a patient/family member/coworker and how did you resolve it?\"\r\n\"How many patients were you assigned by the end of your senior preceptorship?\""}, {"date": "30 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "2 phone interview: 1 with managers and 1 with a recruiter. Manager interview came first. Standard tell me about a time questions, straightforward, didn’t have situational questions. Similar questions at both interviews. Heard back within a week with offer.", "Interview Questions": "Tell me about a time you demonstrated teamwork "}, {"date": "2 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at John Muir Health in Nov 2021", "Interview Descriptions": "Had a Zoom interview with Nurse Manager and HR Nurse Recruiter one time. Very friendly and professional people. Had behavioral questions that showed my ability to work with other people, how I would handle mishaps in the workplace,  and also had clinical scenario questions to see my prioritizations during routine and emergency situations.", "Interview Questions": "Why do you want to work at JMH? Tell us a time where you or a coworker make a mistake. Given different clinical scenarios, which patient do you see first and why. "}], [{"date": "23 Nov 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Pleasant Hill, CA) in Nov 2021", "Interview Descriptions": "A telephone follow up after application from director of rehab, followed up with an in person interview. After interview asked for at least 2 supervisor references, references submit a survey  and if checkup of references cleared then HR follows up with an offer .", "Interview Questions": "What are three strengths and weakness?\nTell me about a difficult pt encounter "}, {"date": "29 Oct 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "The interview process was very easy. \nSome of the questions they asked me were.\nTell me about yourself?\nWhat would you do in certain situation and what is the reason behind it?", "Interview Questions": "N/A"}, {"date": "9 Oct 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "It was quick and easy. I haven’t thought it was an interview.  Pleasant experience. The manager who interviewed me was so nice and friendly. I just don’t have any idea when it comes to their salary.", "Interview Questions": "Tell me about your experience. It’s pretty direct."}, {"date": "3 Oct 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "Applied online. Received a call after two weeks from HR for an interview. Offered the position a week after the interview. The whole process was easy and HR was very easy to talk to and helpful.", "Interview Questions": "Tell me about your medical assistant experience. "}, {"date": "13 Sept 2021", "title": "Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "It took them 6 months to call because of changing financial position. Once they called, the job was offered in less than two weeks. There were two interviews total. It was fairly simple.", "Interview Questions": "How many years experience do you have?"}, {"date": "19 Feb 2021", "title": "Registered Nurse (BSN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health", "Interview Descriptions": "Got an initial phone call from an HR rep to schedule an interview. Due to COVID, the interview was scheduled via zoom. Interview was in front of a panel of 4 people - one HR rep, department manager, department director, and another nurse. The interview was about 30-40 mins long and was mainly behavioral type questions with some scenarios. Heard back from the hospital about a week after the interview.", "Interview Questions": "Tell me about your experience at your current hospital. What type of training did you get, what kind of cases do you do?\n"}, {"date": "11 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Fresno, CA) in Mar 2021", "Interview Descriptions": "the interview is online via a zoom meeting, around 30 minutes or so, one to one interview process with unit manager; easygoing, show experience, discuss specific unit and overall hospital, formal yet comfortable", "Interview Questions": "- tell me about yourself\n- why did you choose nursing?\n- why do you want to work at this hospital/ what have you heard about us?\n- why do you want to work on this unit/ what have you heard about us?\n- what is your 5 year plan?\n- tell us about your individual nursing experience"}, {"date": "18 Apr 2021", "title": "Director Information Security Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at John Muir Health in Mar 2021", "Interview Descriptions": "Applied online in early March 2021, received a screening email from internal recruiter 17 days later. Submitted response, and received rejection email eight days later. \n\nNote this is for the role “Director-Information Security - IT Security CISO”. Wait, you have the Chief Information Security Officer (CISO) at a director level? And can not be bothered to have a conversation, rather just have a pre-canned question/response via email? \n\nNote that John Muir Health was advertising for a CISO in fall of 2013, with previous CISOs since that time being at the VP level. With this sort of approach to finding a new leader of their Information Security program, and the demotion of the role, it brings the question as to why does John Muir Health not appreciate the business value of their Information Security business risk management program?", "Interview Questions": " Please provide your salary expectation."}, {"date": "26 Jan 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Concord, CA) in Jan 2021", "Interview Descriptions": "Manager was very pleasant to talk to! Made me feel like I was having a conversation instead of a strict question/answer type of conversation. Probably one of the most comfortable interviews I've had!", "Interview Questions": "Tell me more about your experience with your current employer"}, {"date": "2 Mar 2022", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health (Pleasant Hill, CA) in Jan 2021", "Interview Descriptions": "There were three managers during them entire interview but one walked out in the middle of it after agreeing to hire me, but then I was called later and I was told I was not given the job.", "Interview Questions": "They talked too much about my hobbies as a singer"}], [{"date": "16 Dec 2020", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "I applied before completing my externship however this was a requirement. I then kept in contact and I was referred to another hiring manager after I had completed my externship elsewhere. I had a Zoom interview and got my official offer about a week later.", "Interview Questions": "Where is an infants pulse taken?"}, {"date": "1 Dec 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at John Muir Health (Concord, CA) in Nov 2020", "Interview Descriptions": "They call you and ask you about yourself and then ask 4 medical assistant questions. They ask about your previous experience and to tell them about a difficult time and how you resolved it.", "Interview Questions": "What is the normal 02 and when do you notify a doctor"}, {"date": "2 Sept 2020", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health", "Interview Descriptions": "I was called for a panel interview  after 3 weeks. There were 4-5 interviewers. Each one asked questions.  Interview  was not that hard. They mostly asked me behavioral questions. \r\nThey asked me one clinical question.\r\nInterview process was very pleasant.", "Interview Questions": "Behavioral questions. Eg: Tell me about a time when you..."}, {"date": "17 Sept 2020", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health in Aug 2020", "Interview Descriptions": "Applied online and got my first interview 3 months later. 3 interviews before offer, first was zoom, then 2 telephone. The whole process took about 4 months before I   was offered the position", "Interview Questions": "What makes you qualified for this position?"}, {"date": "10 Mar 2020", "title": "Medical Scribe Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health", "Interview Descriptions": "There were three parts to the interview. First there was a brief telephone interview, and then we were asked for a face to face interview. There, they asked basic interview questions and then they tested your ability to type reporting accurately. The last interview was with the director of the department.", "Interview Questions": "How will being a scribe help with your future goals? "}, {"date": "25 Aug 2022", "title": "Float Pool RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at John Muir Health in Mar 2020", "Interview Descriptions": "Interview was during early parts of Covid so it was all virtual. I did a phone interview with the Manager and then scheduled for a tour of the hospital. The whole process took about 3 weeks.", "Interview Questions": "Describe a time you went above and beyond for a patient."}, {"date": "20 Jul 2022", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health (San Jose, CA) in Jan 2020", "Interview Descriptions": "It was a quick interview, learning about your background and previous experience, they also ask questions about how you would solve certain scenarios. Also a math question. Also a problem solving question. Also ask about your availability", "Interview Questions": "Describe a time where you handled a difficult situation"}, {"date": "13 Dec 2020", "title": "Clinical Nurse Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at John Muir Health (Walnut Creek, CA) in Jan 2020", "Interview Descriptions": "They saw my resume on Linked In and called me to see if I would be interested in looking at their hospital for a position.  I had no intention of leaving but the interview process was really great and i got to see who I would be working with as well as meet the members of my groupp and the department leaders that I would be working for.  It was really a great experience.", "Interview Questions": "They asked me to describe a difficult time I had with an individual and how I addressed it. "}, {"date": "19 Sept 2020", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Sept 2019", "Interview Descriptions": "This role was a new one based on something they have already at Kaiser, but that was not disclosed prior to interview.  As such it was difficult to be prepared for the interview questions, and honestly if this was disclosed I would likely not have applied.", "Interview Questions": " Standard interview questions at the beginning but then questions regarding creating a whole program role out from nothing with no support or guidance were asked.  It was quite strange"}, {"date": "30 Jul 2019", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at John Muir Health (Concord, CA) in Jul 2019", "Interview Descriptions": "Entire process took about 5 months from application to start date. Online application, phone screening and interview, in-person interview, and HR interview. The process was long but I received the job offer in the HR interview.", "Interview Questions": "What would you look for during a safety check?"}], [{"date": "6 Sept 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Jun 2019", "Interview Descriptions": "Well designed, timely, and professional interview process with timelines established during the each stage of the interview. Also, included a good mix of leadership, stakeholders, and relevant questions. Overall the interview process was positive.", "Interview Questions": "Tell me which products and services would you scale to other physician practices"}, {"date": "10 Oct 2022", "title": "Summer High School Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health in May 2019", "Interview Descriptions": "Basic behavioral questions and telling them about yourself. Try not to give basic answers. Firstly a phone call then a panel interview with some nurses too. Be confident and be yourself.", "Interview Questions": "Tell us about a time you encountered a challenge and overcame it."}, {"date": "3 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Walnut Creek, CA) in Nov 2018", "Interview Descriptions": "It was very nice interview. They wanted to get to know me first. Asked some scenario questions. Then I met with HR for an interview. HR ultimately makes the decision if you will get hired", "Interview Questions": "Why do you want to be a nurse here "}, {"date": "26 Oct 2018", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health", "Interview Descriptions": "Unit manager by phone then face to face. Scheduled for HR over the phone. And did the checkster. Discussed benefits and possible salary offer. I’m still waiting for the offer hopefully they will.", "Interview Questions": "Experience and casual interview "}, {"date": "9 Oct 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Oct 2018", "Interview Descriptions": "I applied on the John Muir website. I was contacted the next day she went over the available position and scheduled a interview. The interview consisted of 2 people interviewing me one went over my past work history and skills and the other one asked a number of clinical questions then I had to take a 10 question test about administering medications. A few days later I was contacted by a different lady who scheduled me with a second interview with HR. I was also sent a email that requires 2 of my previous managers to complete a survey about me. The second interview consisted of about 10 “explain a time...” questions. I was then offered the job. After that I was required to submit to a background check, complete a physical, blood work and a drug test. Then I was scheduled for orientation.", "Interview Questions": "What injection is given at a 45 degree angle and what types of medication do you give using this method?"}, {"date": "1 Nov 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Walnut, CA) in Aug 2018", "Interview Descriptions": "First step was a phone interview with Director. The second step was to interview in person with the Director and then followed with a group interview with various members of department. The final step was to meet with HR and interview with them", "Interview Questions": "What do you know about John Muir Health?"}, {"date": "3 Jul 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at John Muir Health in May 2018", "Interview Descriptions": "I got a call a week after I applied on line. I went on a panel interview on a Monday. Everyone was positive and nice. I received an offer that Friday.", "Interview Questions": "Tell me about yourself."}, {"date": "25 Apr 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health (Concord, CA) in Mar 2018", "Interview Descriptions": "Applied online and was contacted for two one-on-one interviews. One with HR recruiter who was very friendly and had a list of pre-set questions. The second interview was with the unit manager which was more causal and conversational.", "Interview Questions": "What is one thing you don't like about nursing? "}, {"date": "17 Oct 2019", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Walnut Creek, CA) in Jan 2018", "Interview Descriptions": "short easy fun quick simple easy, not to hard. asked about personality and scenarios. Shared my flexibility and passion to work for a great trauma hospital. Shared my willingness and capability to strengthen my skills", "Interview Questions": "tell us about yourself"}, {"date": "3 May 2019", "title": "Benefits Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Walnut Creek, CA) in Sept 2017", "Interview Descriptions": "Panel interview; heads of various divisions. This was for the John Muir Physician Network. There was a round robin of questions. People were very nice, but the meeting was somewhat disorganized. Waited about 40 minutes while a conference room was found, then the person who greeted me had to round up the various people that were to be on the panel. Cooled my heels quite a lot. Interview was quite unstructured with everyone sort of asking questions that were germane  to there own specialty. Was disappointed that it was so disjointed.", "Interview Questions": "What are the FMLA rules"}], [{"date": "5 May 2018", "title": "Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Aug 2017", "Interview Descriptions": "Online application, phone screening interview, in person interview.\r\nThey did not seem to know any information from my phone screening interview. The person I spoke to was in charge of outreach not hiring. Was in depth but not too bad if you have medical or science background.", "Interview Questions": "What makes you more qualified for this position than another candidate?\r\nSummarize a movie in 5 minutes. "}, {"date": "6 Nov 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Walnut Creek, CA) in Mar 2017", "Interview Descriptions": "It was great and painless and the manager and the department director were very kind. They made the interview process very easy. They were smiling and in an obvious good mood, which is always a plus.", "Interview Questions": "Excel, work, finance skills"}, {"date": "29 Aug 2017", "title": "Physical Therapy Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at John Muir Health (San Francisco, CA) in Jan 2017", "Interview Descriptions": "More of a conversational interview asking about my background and my qualifications, a short chat about the process of hiring and on-boarding process. Another therapist was brought in and we discussed topics of similar interest. A tour was given that showed the facilities.", "Interview Questions": "there were no specific interview questions pertaining clinical situations"}, {"date": "10 Dec 2016", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 days. I interviewed at John Muir Health (New York, NY)", "Interview Descriptions": "After applying online to a posted position and submitting my resume and cover letter, I was contacted by the OT supervisor to schedule a panel interview with other occupational therapists to discuss the position, my specific skills and reasoning to want to work here.", "Interview Questions": "Why would you want to work for us?"}, {"date": "21 Dec 2016", "title": "Patient Call Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at John Muir Health (Walnut Creek, CA) in Dec 2016", "Interview Descriptions": "It was a basic structured interview. The site manager Melissa was very nice and professional. We talked about my background in the field as well as basic interview questions. We began the interview discussing one position and once she saw my experience shifted to discussing the patient call rep and referral coordinator positions. I am just waiting to hear back to hear if I got one of the positions.", "Interview Questions": "Why did you choose this field?"}, {"date": "4 Oct 2016", "title": "Rehabilitation Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at John Muir Health (Danville, CA)", "Interview Descriptions": "I was interviewed by the director of rehab and the supervisor of the clinic, asked me questions about mulit-tasking and provided scenarios, I was asked why I wanted the job and what I could offer the company. The panel was able to describe the specific requirements of the job and I was also given the opportunity to ask questions about the company, their individual background and why they chose to work for John Muir Health.", "Interview Questions": "Patient/customer satisfaction: If you have a patient in front of you and 2-3 lines on the phone are ringing, how do you handle the situation and who do you assist first?"}, {"date": "9 Sept 2016", "title": "Administrative Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health (Walnut Creek, CA)", "Interview Descriptions": "After completing my online application, I was contacted by a professional and friendly HR employee to set up an initial phone interview.  The phone interview, conducted by an HR Business Partner, lasted for about 45-minutes - we spoke about my knowledge base and the details of the position; this interview was refreshing in that I knew I was speaking with a professional - I felt we covered a lot of ground.   The next step involved 2 in-person interviews, with the hiring manager and another  HR Business Partner.  Welcoming and professional interviews, it was as though we had worked with each other before, a genuine sharing of best HR practices as well as common business interests.  After this, I was invited to an extensive panel interview with 5 HR professionals.  Following the panel interview, I was asked to meet with the Sr. VP of HR and the HR Manager of Employee Relations, at the corporate Administrative offices.  The interview process took 4-weeks.  An offer of employment was made, contingent upon a satisfactory, full background check and physical.  \r\n\r\nTo be completely transparent to those who apply to JMH, the interview process was absolutely, without a doubt, the most comprehensive, yet friendly and professional process I have been through - in any organization.  Every individual exemplified compassion, a love for their employer's mission and the work they do... and, I always felt that I was being invited into a warm and caring family, each step along the way.  Though the interviews were extensive and challenging, I was always treated with courtesy and the utmost respect.", "Interview Questions": "A lot of knowledge-based questions, to determine my HR experience."}, {"date": "10 May 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Aug 2016", "Interview Descriptions": "I was interviewed by the director, two managers and a couple of volunteers who were a part of the board of directors (which I thought was strange to have volunteers do an interview) but the director at this time always wanted to do things her way and not the way of the hospital policy and procedure", "Interview Questions": "why are you interested in this job?"}, {"date": "5 Jul 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at John Muir Health", "Interview Descriptions": "The first interview was with the staffing pool manager and administrative manager. It consisted of 10 clinical and 10 math (measuring/dosage) questions. I got a call back the next day to meet with the HR manager & a back ground check to be completed online prior to the interview.", "Interview Questions": "What would your previous manager say about you?"}, {"date": "6 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Jul 2016", "Interview Descriptions": "Received a phone call from the Nurse Recruiter around 2 weeks after I had submitted an application online, and scheduled a phone interview with the Nurse Recruiter to go over what type of position/experience I was looking for, and what the position she had entailed (full-time/part-time, hours). Was then scheduled for an in-person interview with the Nurse Recruiter and then both the unit Director and Charge RN. Since I was coming from out of state, they wanted to maximize my time in the area.", "Interview Questions": "Tell me about your most difficult patient and how you handled the situation."}], [{"date": "11 Mar 2020", "title": "Medical Scribe Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health (Concord, CA) in Jul 2016", "Interview Descriptions": "First was a standard face to face interview with scribes, tested how many words per minute you could type, and then was called in a week later to have an interview with the director of the department.", "Interview Questions": "How can being a medical scribe help you with your future goal? "}, {"date": "24 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 months. I interviewed at John Muir Health", "Interview Descriptions": "Applied for the position online. Long process due to many people being on vacation or leave. There was a nurse recruiter interview and interview with department manager and one of the unit's charge nurses. Each was about 3 months a part. Nurse recruiter interview was simple, basic questions and reviewed resume and previous experience. Interview with manager had situational and clinical questions.", "Interview Questions": "Why do you want to work for John Muir?"}, {"date": "3 Jun 2016", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at John Muir Health (Concord, CA)", "Interview Descriptions": "Two interviewers spent close to 45 minutes with me, asking and answering questions.  They were interested in my past clinical training, my background as an EAP equine specialist, my work with adolescents, and my willingness to be available on a flexible schedule.", "Interview Questions": "Have you worked on an inpatient unit before?"}, {"date": "4 May 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "It took over a month from applying to hearing back from the company, but afterwards, the process seemed to go by quickly. There were just a lot of steps to go through before your first day of employment.", "Interview Questions": "Why do you want to work for John Muir?"}, {"date": "19 Apr 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at John Muir Health in Mar 2016", "Interview Descriptions": "The initial interview was with a nurse recruiter. The interview had the normal situational interview questions as a nurse with patient interaction, coworker interaction and nurse to co-worker interaction. The next interview was set up with the unit manager and supervisor. They were very accommodating due to being out of town, and my panel interview was scheduled the same day.", "Interview Questions": "Tell me a time when a patient was difficult?"}, {"date": "12 Jan 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Jan 2016", "Interview Descriptions": "2 part interview process, first part is having critical thinking questions to ask as well as a quick dosage math test and clinical questions. 2nd part is interviewing with another recruiter to see to move forward with hiring. Also you undergo background check once called in for a 2nd interview.", "Interview Questions": "Tell me about a time you had to handle a difficult patient?"}, {"date": "24 Dec 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at John Muir Health (Walnut Creek, CA) in Oct 2015", "Interview Descriptions": "Phone interview (about 30 minutes); followed by a meet and greet after job offer. I was offered a couple of options on different units based on my experience and was able to choose the unit freely which was great. Got to tour the units and meet some of the staff members and spent plenty of time with one of the managers.", "Interview Questions": "The usual, in depth type of experience, clinical questions, customer service related questions."}, {"date": "21 May 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at John Muir Health (Walnut Creek, CA)", "Interview Descriptions": "First interview was over the phone, second was in person with a couple of managers, started about 2 weeks later.  Smooth process.  Completed a background check.  Had to get flu shots in order to work in the hospital building.", "Interview Questions": "What is your experience with Hospital Project Management (and similar)  Fairly easy questions if you have had experience in the job - not trying to trip you up on the interview.  Tell us about an experience that you had to mitigate a project risk.  Tell us about the project tools you have experience with.  Tell us about the project you did on your last job."}, {"date": "30 Apr 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Apr 2015", "Interview Descriptions": "HR interview panel of 4. 2nd interview panel of 3 including Dr. Looking for the assistant. HR asked all of the administrative questions. Provider asked all of the clinical questions. Questions were just coming at me one after another, not much time to think. Interview lasted about 20 minutes. Left feeling very confident!", "Interview Questions": "If we contact your present supervisor, what would they say about you?"}, {"date": "18 Oct 2016", "title": "Contract Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at John Muir Health (Walnut, CA) in Jan 2015", "Interview Descriptions": "Started with a 1-on-1 with PMO Director then on to several interviews with key leaders who I then interviewed with one separate days of the week and then and then and then and then", "Interview Questions": "As a PM would you \"own\" the project?"}], [{"date": "9 Feb 2018", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at John Muir Health (Walnut Creek, CA) in Oct 2014", "Interview Descriptions": "Delayed process from time of submitting application.  HR postponed interview two times.  Seemed unorganized.  Phone call afterwards was vague and unclear on details of being hired and the start date.  Orientation was disorganized on where and when I was suppose to be during the week.", "Interview Questions": "How did I see the role of urgent care in the future of medical care?"}, {"date": "4 Feb 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health (Concord, CA) in May 2014", "Interview Descriptions": "First I took a 20 question test re: medical terms and instruments. If you miss more than seven they have you review your answers and retake the test. Next I did a panel interview with the Float pool manager and clinical operations personnel. The third interview was with HR. It took about a week to hear back on getting the job offer.", "Interview Questions": "Are you able to work weekends, nights and flexible shifts?"}, {"date": "21 Feb 2014", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at John Muir Health (Walnut Creek, CA) in Jan 2014", "Interview Descriptions": "I was excited to be called back for a second interview with the hiring manager.  The second interview included a skills test & a meeting with other staff members.  I thought it went well & when I left she indicated they were just looking for the right fit & would get back to us within a week or two.  I sent thank you notes and a follow-up note, but was never contacted again.  I assume they hired another candidate, but I think it is unprofessional and disrespectful that they did not, at least send a \"thanks, but no thanks\" note.", "Interview Questions": "Nothing really unusual.  Behavioral question: how would you handle a situation where you were busy with closing the books and someone had an urgent ad hoc request?  There was also a basic accounting test."}, {"date": "12 Sept 2013", "title": "E R Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at John Muir Health (Walnut Creek, CA) in Aug 2013", "Interview Descriptions": "A great interview and was treated very professional", "Interview Questions": "What is my feeling of the up and coming Obama care?"}, {"date": "10 Sept 2012", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at John Muir Health", "Interview Descriptions": "Apply online. A recruiter will contact you and ask generalized questions about yourself and experience. Then if selected, you will meet with three members of the department for three 30 minute interviews. You may also meet with the VP of finance and the VP of revenue and the VP of analytics.   If they move forward with you, you will speak to a hiring manager. finally you will be offered the job roughly two weeks after the previous interview.  Entire process can take up to 2 months so be patient", "Interview Questions": "Describing ways to implement cost reducing activities in the healthcare industry in general, in addition to the comapny"}, {"date": "11 Jul 2012", "title": "Medical Assistant for Physician's Office Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at John Muir Health (Walnut Creek, CA) in Jun 2012", "Interview Descriptions": "I didn't quite make it to the interview section as I failed the skills test. The test that I took (there are two separate tests that you could take) consisted of questions regarding needle size, EKG lead placement, some medical definitions, and a few questions on certain diseases. (The EKG questions got me...I have not done one in years! Yikes). You are allowed to get 4 wrong out of 20 in order to pass. You take the test in the waiting room and if you fail you can re try right then and there or reschedule the test. If you retake it there you are excused and cannot re apply for 6 months.", "Interview Questions": "Where are EKG leads placed (not the exact question, but pretty close)?"}, {"date": "29 Sept 2010", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at John Muir Health in Aug 2009", "Interview Descriptions": "There is an initial interview with HR, if this is passed, then the next level is with the manager. The job offer comes from the HR department. Expect a two week minimum process.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "2 Jun 2009", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at John Muir Health in Jun 2007", "Interview Descriptions": "I basically walked in with my qualifications, spoke to HR and she sent me to the hiring management on my floor.  I was immediately offered the job and I accepted the position the same day.  I started work within 3 weeks. But, the interviewer must bear in mind that I went through this process 4 years ago.  The market for nurses is much different now.", "Interview Questions": "What are your plans for your future if you are hired in this position, are you anticipating changing departments quickly?"}]]