[[{"date": "7 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV)", "Interview Descriptions": "Multiple questions on patient care. Tell me about yourself. Why did you become a nurse. Why do you want to work at UMC. It took about two months after the interview to begin the process.", "Interview Questions": "What is your care plan for a patient who has multiple ulcers."}, {"date": "3 Jul 2021", "title": "Registered Nurse Urgent Care Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Medical Center (Las Vegas) in Mar 2021", "Interview Descriptions": "Interviewing manager called me without warning and asked if I could do a phone interview right then and there over the phone. I said it was okay because I really wanted the job and I was thinking since she called with no warning it would be more of an informal/conversation-type interview but I was completely wrong- she proceeded to ask me a whole list of \"what are your strengths and weaknesses\" and ask for tons of examples just off the cuff. The interviewer seemed annoyed when I couldn't come up with FIVE weaknesses right off the bat. I was super annoyed when I got off the phone and didn't even want the job after. They never called and I never received any follow  up.", "Interview Questions": "What are 5 strengths and 5 weaknesses? "}, {"date": "6 Dec 2020", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University Medical Center (Las Vegas)", "Interview Descriptions": "Usually two interviewers. Expect clinical questions, accompanied with arterial blood gas interpretations. The questions seem similar to any interview. If I remember correctly it was the Director of respiratory and a manager in the interview.", "Interview Questions": "What equipment are you the best with? "}, {"date": "14 May 2020", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV) in Mar 2020", "Interview Descriptions": "I applied online and received permission to schedule an interview 3 weeks later. The interview was very straightforward with two managers relevant to the unit who asked questions from a packet. They stated HR would be making the decision and didn't have exact dates on hiring as that was HR's responsibility. It has been two months and I have not heard either way.", "Interview Questions": "Describe what you would do for a patient exhibiting symptoms of a stroke?"}, {"date": "15 Mar 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV) in Jul 2019", "Interview Descriptions": "Made an appointment over email, went to the interview and the head of the volunteer team did not show up, left before the interview time. I had to do a phone interview instead", "Interview Questions": "I was not asked any questions"}, {"date": "9 May 2017", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV)", "Interview Descriptions": "You are interviewed by Director, Supervisor, Lead Technologist. The director and supervisor ask generic interview questions and were friendly. They did not have me scan for the interview. They gave me a tour of the facility after the interview.", "Interview Questions": "Describe how to do a Venous ultrasound of the legs to someone that does not know ultrasound?"}, {"date": "21 Aug 2017", "title": "Readiology Tech Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University Medical Center (Las Vegas) in Dec 2016", "Interview Descriptions": "Lengthy process. Manager already has her candidates selected for open positions, only going through formal process of interviews because of HR policy. Unfair to interviewees. This manager is a strong person to work for. If you don't get a job here, it is a blessing in disguise.", "Interview Questions": "Tell me your experience in working with Dr. Smith in the OR?"}], [{"date": "8 Aug 2016", "title": "Clinical Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV) in Aug 2016", "Interview Descriptions": "Applied on line. I was called to set up an interview 2 days after the positions posting closing date. Was interviewed by 2 women, both were kind and easy to talk to.\nInterview lasted about 15 minutes. They have 2 pages of standard questions they ask each applicant. At the end of the interview I was given a tour of the lab.", "Interview Questions": "What tubes go to which department"}, {"date": "22 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University Medical Center (Las Vegas) (Henderson, NV) in Jan 2016", "Interview Descriptions": "Easy. 10 min interview,  the girl was super cute.  Interns get free food. Would do again.  After the interview they called about a week later. On boarding take a while tho", "Interview Questions": "Why umc\nCan you use excell"}, {"date": "25 Jan 2017", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV) in Jan 2016", "Interview Descriptions": "The interview process was time consuming, stressful, though straight to the point. The interviewer asked as many questions as possible in order to get to know me and my attitude. Be prepared to be under pressure, but withstand it.", "Interview Questions": "Why did you choose UMC?"}, {"date": "1 Dec 2015", "title": "Clinical Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV) in Jun 2015", "Interview Descriptions": "Applied online. Then received a phone call to schedule an interview. Interview went smooth, and I was offered the job after a few other people were interviewed. Just know your basic laboratory knowledge. HR was smooth, and you go through a basic orientation process. Nothing to difficult at all. They also hire all types of people so as long as you're personable and have the right experience it shouldn't be difficult to get hired on.", "Interview Questions": "What are some of the different departments in the lab?"}, {"date": "20 Aug 2014", "title": "RN ICU New Grad Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University Medical Center (Las Vegas)", "Interview Descriptions": "I applied and got a call back 2 months later to set up and interview. The interview was with a panel of 5 ICU nurse managers. The interview was no more than 15 minutes. They were interviewing numerous people for a few positions.", "Interview Questions": "Who was the most difficult patient you've taken care of?"}, {"date": "1 Jul 2013", "title": "Data Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University Medical Center (Las Vegas) in Apr 2013", "Interview Descriptions": "HR is the entity that screens all aplicants. If your resume does not match the job description in every way, your application will not make it to the hiring manager of the department you are trying gain employment in.", "Interview Questions": "Once you make it passed the HR screen, it is very basic questions."}, {"date": "7 Feb 2010", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University Medical Center (Las Vegas) (Las Vegas, NV) in Jun 2009", "Interview Descriptions": "I was a current employee of the hospital, applying for a different position. There were 6 on the panel. Two I knew very well, 2 moderately well, and 2 slightly. I had previously Interviewed for a different position,with 3 of the panel. I did not get that position, but was later told how well I did in the interview, and to please interview again for other positions. (blessing in disguise when I didn't get that job) I think outside applicants have an edge with many of the positions posted but some of our salaries are just too low for some to consider. (I am at the maxed out level for pay and only get COLA. Newer employees have less benefits compensation, therefore less costly to the hospital. If you look online at the salary listings one sight has posted for county employees, the numbers are deceiving. Many nurse salaries on that site are $90,000-100,000, but these nurses work lots of overtime. It is the same for many other county employees listed there) \r\nThe typical questions were asked, why do you want this job, what can you bring to the position, how would you handle xxx situation…Maybe I knew what answers were expected.\r\nThe work culture is somewhat tense because of the financial situation, but generally a good, fair, friendly work environment. Of course there are exceptions, but I really believe it is the best hospital in Las Vegas for work environment, support of staff, consistency, acceptance and tolerance.", "Interview Questions": "How do you handle the situation of being asked to work with someone you do not like (or does not like you) or do not get along with?"}]]