[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Highly relevant public health org + decent place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Oct 2019", "job_title": "Anonymous Employee in Geneva", "duration": "N/A", "pros": "-Amazingly nice and smart colleagues- one of the best team that I have ever worked for where my colleagues became good friends. I had a genius, humble, hardworking, and problem solver supervisor in SMT who have our backs and with whom we can have honest conversations (he can give lessons in leadership). I resigned from Unitaid as I want to work in the field\r\n\r\n-Under the management,  Unitaid has been put on the map in global health. Previously, Unitaid was only known as a procurement agency. Now, Unitaid has a place at the table on high level panels such as AMR where it's leading the committee on innovation. Unitaid is invited to major global health events where it can influence public health policymaking. \r\n\r\n \r\n-The SMT has worked hard to put procedures in place that was previously non-existent.  The strategy is cutting edge, with one of the most results-based programming I have seen practiced, qui peut froisser la suceptibilite de certains  grantees as Unitaid continuously challenge them for results. RESULTS should continue to remain at the forefront of the strategy and implementation.\r\n\r\n- The diversity of the projects we get to work on which makes the work super interesting", "cons": "In my more than a decade long career, I have worked for several international development agencies and every one of them has their own problem, which is steeped in the politics of international aid. Unitaid is not the worst that I have seen."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Needs fresh management approaches", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Feb 2021", "job_title": "Officer in Geneva", "duration": "N/A", "pros": "Interesting projects, smart committed staff, good pay and flexibilité, friendly and open-minded new Executive Director.", "cons": "Unitaid needs fresh management approaches and new experienced managers. The new ED tries to bring positive changes to the organizational culture but there is a visible resistance to change by many other members of the senior and middle management team, the legacy of the previous ED who had brought and promoted his buddies for most of the senior level jobs. Opaque recruitment and promotion practices still continue, career opportunities continue to be available only for a closed circle of people. It is difficult to believe that cultural change will be possible without further changes in the upper échelons."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Non-inclusive and diversity resistant", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2021", "job_title": "Program Manager in Geneva", "duration": "N/A", "pros": "Interesting impactful projects. UN benefits and salary. Good global health image.", "cons": "This is not the most diverse organization. Hard to grow or even get a job for people from developing countries, most staff is caucasian. French managers hire French and American managers just stick with the core anglosphere employees. Favoritism is a huge problem and distance working has aggravated the problems related to transparency. \r\nAfter spending years on meaningful projects, sadly, now I am looking for jobs at other organizations as I feel undervalued."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Opaque selection process", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Oct 2020", "job_title": "Anonymous Employee in Geneva", "duration": "N/A", "pros": "Great mandate, interesting variety of grants. Good remuneration package, UN benefits.", "cons": "Requirements for some key managerial positions are difficult to meet: same nationality as the hiring manager, being his friend, coming from the same organization, better if already funded by Unitaid. For those candidates meeting these requirements don't worry too much about the written test, you can skip it, as confirmed by the recent manager recruitment process, it is not so important, there is always a way ... they can even wait more than 1 year for the \"right\" friendly candidate."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Great mandate, but poor leadership and toxic culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 May 2019", "job_title": "Anonymous Employee in Geneva", "duration": "N/A", "pros": "Great reason of existence, innovative projects, the organization has an very interesting and important position in the public health landscape, some very resourceful and intelligent colleagues.", "cons": "The organization shines externally but rotten from inside. Toxic culture due to lack of leadership. Lots of favoritism and nepotism, no meritocracy. Problems are concealed from the Board. Senior management egos are huge, they care of only their careers.   Staff demoralized, many people on medical leave because of burn-out."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "I love the cause, i gave my heart, i feel drained", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Dec 2015", "job_title": "Technical Officer in Geneva", "duration": "N/A", "pros": "The raison d'etre is noble, the people i work with can be inspiring, i have learnt a lot about myself and others.", "cons": "The egos are huge, the competition fears, you are on your own, management is opaque, inconsistent, and promotion non existent for most."}], [], []]