[[{"date": "11 Mar 2022", "title": "Identity Access Management Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Adena Health System in Mar 2022", "Interview Descriptions": "Received a phone call from them and wanted to have the interview right away. Asked if I had time to discuss the job and the Company. The caller was not polished and seemed very inexperienced. \r\nAfter a few minutes they wanted to setup another call with her supervisor and would get in touch with me the following week.\r\nAfter a week went by, I called and left a message still showing interest. Didn't get a call back and then received an email 5 days later saying the job has been filled.\r\n\r\nTalk about a red flag!", "Interview Questions": "Tell me about yourself and why you are interested in this position."}, {"date": "9 Apr 2021", "title": "Patient Access Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Adena Health System (Chillicothe, OH) in Feb 2021", "Interview Descriptions": "interviewed for outpatient registration. there were 3 young girls interviewing me. seemed more like a social hour than a registration department. during the interview, the one girl was very unprofessional. another only wrote the words I said and never looked at ,e. overall unplesant wish they were more professional.", "Interview Questions": "why do you want to work here"}, {"date": "23 Sept 2019", "title": "Medical Laboratory Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Adena Health System (Chillicothe, OH)", "Interview Descriptions": "I applied online and was called for an interview about two months later. The interview was with a panel of six people and they were not prepared for the interview. I had to wait while they rounded everyone up and set up the room.  They all had a sheet of paper with the same questions and they went around the room and each person asked me a question from the paper. They didn't come across as very nice and as a result I felt uncomfortable during the interview and it didn't seem like it would be a good place to work.  They seemed unorganized and didn't even know what shift they would want me to work or even if I would be full-time or part-time. Overall, they were unfriendly and unorganized.", "Interview Questions": "Tell us about yourself"}, {"date": "20 Aug 2019", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adena Health System", "Interview Descriptions": "Group interview with entire dietetic team using standard interview questions. Friendly staff, made you feel at ease. Interview ended with a few case studies, nothing too difficult (no TF/TPN calculations).", "Interview Questions": "What makes you a good fit for this role?"}, {"date": "22 Mar 2019", "title": "Staff Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Adena Health System", "Interview Descriptions": "I was contacted about an interview about 3 weeks after submitting the application. I was not told there were going to be 3 interviewers until I arrived. I was told it would be an \"informal\" Q&A type interview. 2 of the interviewers were not very responsive to my answers and the other looked very bored and slouched for most of the interview. Felt more like an interrogation. Was told I would get a response in 2-3 weeks but never heard back.", "Interview Questions": "How would you address an employee who was doing something wrong or was not following through with their duties?"}, {"date": "15 Apr 2019", "title": "Follow Up Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adena Health System (Chillicothe, OH) in Dec 2018", "Interview Descriptions": "Generally this was a straight forward interview.  Questions were all behavior based and then asked to describe a situation that matched the question.  There were 3 people in my interview and all of them were very pleasant, you can tell they would have been fun to work with.  I was offered a position, but declined as I was starting a medical coding course online through AAPC and didn't feel it was the right choice at the time.", "Interview Questions": "Behavioral based questions. "}, {"date": "29 Nov 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Adena Health System (Chillicothe, OH)", "Interview Descriptions": "Excellent experience interviewing at Adena. The team-based approach is as important to the interviewer as it is the team conducting the interview. The culture of the organization is transparent throughout every level.", "Interview Questions": "Behavioral based questions "}, {"date": "2 Nov 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adena Health System (Chillicothe, OH)", "Interview Descriptions": "Application was completed online. I was proactive and networked. The interview was a panel interview, with the managers of each unit present. Each asked a question in turn. They were positive and helped to put me at ease. I prepared well for the interview, having previously bombed one with another company. This time I memorized a grouping of eight characteristics/qualities which made me stand out as a candidate, instead of saying \"uh...\"\r\nAt the close of the interview, three of the unit department managers offered me full-time. Two were nights, which made the choice of unit easy for me.", "Interview Questions": "What type of patient would you find is the most difficult for you to care for, and why?"}, {"date": "2 Dec 2019", "title": "CNP Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Adena Health System (Chillicothe, OH) in Feb 2015", "Interview Descriptions": "everyone was very organized and professional.  I felt very comfortable.  They reviewed my resume before the interview, so they asked a lot of questions about my history which I appreciated", "Interview Questions": "Strengths, weaknesses"}, {"date": "10 Mar 2014", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Adena Health System", "Interview Descriptions": "The easiest way to get into this small town hospital is to know someone. If you have a current employee recommend you, its basically a guaranteed hire. After applying online, it took about 30 days before anyone even contacted me. Then after the initial phone call (not a phone interview, just to set up a time), it was 3 weeks before an interview, and then another 2 weeks before we got any responses.", "Interview Questions": "They like to ask example questions. Name a time when you had to deal with difficult staff members, how did you handle it? What's the worst mistake you ever made at work, how did you fix it? What is the one thing you find most frustrating about your job? Why should we hire you over someone else?"}], [{"date": "30 Jul 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Adena Health System in Nov 2010", "Interview Descriptions": "I was hired at an RN job fair many years ago. I was hired on the spot. I was interviewed by the then manager, who was fired for I'm sure what was some minor infringement before I got through orientation.", "Interview Questions": "How do you handle difficult situations?"}]]