[[{"date": "17 Aug 2022", "title": "Independent Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New School", "Interview Descriptions": "The interview process was short and straightforward. They work with a really well-run talent placement agency (at least for contract hires). I appreciated that they seemed as interested in whether I thought they were a good fit for me.", "Interview Questions": "What is your previous experience? "}, {"date": "2 May 2022", "title": "Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New School", "Interview Descriptions": "Long process but very informative.  Interviewed with various departments and stakeholders.  The process was interesting but long. Everyone I met was passionate about their work. Overall seems like a decent place to work.", "Interview Questions": "How do you work with different  personalities? "}, {"date": "20 Apr 2022", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at New School", "Interview Descriptions": "The interview process was conducted well in that it was organized and included many people. However, they refused to address salary upfront. I went through hours of interviews, only to get an offer way below my current salary. Wasted a lot of time.", "Interview Questions": "Why do you want to work for the New School specifically?"}, {"date": "19 May 2022", "title": "Welcome Center Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New School (New York, NY) in Apr 2022", "Interview Descriptions": "The first interview was about an hour via zoom. I know that sounds daunting but everyone was very kind with well thought out questions and even when I felt like I wasn't giving my most well spoken answer, I never felt judged or misunderstood. They were happy to reword questions if necessary and generally very kind. The second interview was also via Zoom and they asked me to make a 10 minute presentation on a topic of my choosing. I liked this strategy because it was different from a regular interview and while it required some additional work it wasn't super time consuming, nor did I feel like I was giving them ideas they could then use later without crediting me.", "Interview Questions": "Why do you want to work at New School/what drew you to this intstituiton?"}, {"date": "3 Mar 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New School", "Interview Descriptions": "A fluid interview that was to the point, and informative.  The interview was a bit too short though and seemed a tad rushed. Overall, a pleasant experience. Communication was good.", "Interview Questions": "Why do you think you would be a good fit for this position?"}, {"date": "17 Apr 2023", "title": "contact tracer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY) in Mar 2022", "Interview Descriptions": "They ask questions heavily related to being a contact tracer and about covid-19 but they are nice and caring. I actually love working for this employer and would continue working here if could.", "Interview Questions": "Questions related to quarantine and isolation as it relates to covid-19 and questions about privacy."}, {"date": "23 Jan 2023", "title": "Design Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at New School (New York, NY) in Nov 2021", "Interview Descriptions": "An email is sent to students with open positions. You send your resume and portfolio and an interview is scheduled. The interview lasted around 30 minutes. After a week I got an offer.", "Interview Questions": "Why do you want the job?"}, {"date": "6 Aug 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at New School", "Interview Descriptions": "Applied for the job through New school hiring website, and didn't hear anything for 5 months. I was then contacted for a first round interview, a few weeks later a second interview and then was notified I received the position over the phone. The whole process was a little over 6 months long.", "Interview Questions": "Questions pertaining to my past work and thoughts about specific language that is used in the program."}, {"date": "9 Mar 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at New School (New York, NY) in Aug 2021", "Interview Descriptions": "Incredibly welcoming process. The New School is pretty quick about getting moving with the hiring process, so you can expect quick responses and communication throughout the process. Overall, a great interview and hiring process", "Interview Questions": "What are your technical abilities?"}, {"date": "25 May 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at New School (New York, NY)", "Interview Descriptions": "My interviewer was very nice. They asked me several questions about my work experience and how I would respond to specific scenarios. Towards the end of the interview, I was asked which summer classes I would prefer assisting.", "Interview Questions": "Can you recall an instance where you had to handle a difficult situation with kids in a previous job experience?"}], [{"date": "20 Jul 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at New School (New York, NY) in Apr 2021", "Interview Descriptions": "Quite smooth, super respectful, and brief to-the-point methods. Gives enough time to think and respond while leaving enough space at the end to take questions and comments. Supervisor pays attention to different experience/s in the past.", "Interview Questions": "Why did you decide to apply? What can you bring to the table?"}, {"date": "4 Sept 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New School in Mar 2021", "Interview Descriptions": "They seemed to be in a rush to hire. They quickly scheduled a panel interview where other folks in leadership in other departments asked questions over Zoom. Only one of them seemed excited to be interviewing.", "Interview Questions": "Q: How would you hold your supervisees accountable?"}, {"date": "9 Feb 2022", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New School (New York, NY) in Feb 2021", "Interview Descriptions": "submit my resume and then the one interviewed I had to do was by a group of professionals from the team, which takes about 30 minutes, and after the interview I received an offer", "Interview Questions": "Explain one project you did that was relevant to the job requirement"}, {"date": "18 Dec 2020", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY)", "Interview Descriptions": "The initial interview rounds were straightforward — met with hiring manager, then came back a 2nd time to meet with a cross-functional team member, as well as another direct supervisor.  I completed a very in-depth marketing exercise for them the following week. Then my references were checked.\n\nI was offered the role via a phone call. \n\nI replied with a straightforward negotiation of my salary (roughly $5k+ above what was offered) as well as an ask about doing remote work a few times a week — if appropriate. Nothing out of the ordinary.\n\nI didn't hear back for 2 days.\n\nWhen I did get a phone call back, the hiring manager rescinded my offer without a word of explanation other than \"It's no longer a good fit for us right now.\"\n\nI was shocked and disappointed about how the whole situation was handled. I do believe that The New School does good work with progressive issues and ideas — but it needs to take a good look at its hiring process, at least within Marketing & Communications.", "Interview Questions": "N/A"}, {"date": "6 Oct 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New School", "Interview Descriptions": "The interview process was professional and collaborative. We discussed the courses, the students, my experience as a researcher, and an educator. The experience was casual and lengthy. We discussed various methodologies of education. We also discussed various texts.", "Interview Questions": "What is your experience working with undergraduates?"}, {"date": "16 Jan 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New School", "Interview Descriptions": "Tedious rounds during the interview process - but great opportunity to learn more about Res Life and to develop better interview skills. There will probably be a panel interview as the first round, then you move onto a day of simulations and group activities with other candidates, and finally a third round with the head of the department.", "Interview Questions": "What are some ways you would manage conflict between two residents? "}, {"date": "26 Sept 2020", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at New School (New York, NY) in Dec 2019", "Interview Descriptions": "You are invited to a leadership workshop where you are put into groups and have to work together to do various team building activities such as solving different scenarios for orientation week together. Then you are interviewed separately with two interviewers and asked about your life and what skills you could bring into the job.", "Interview Questions": "What is something that the New School could do differently?"}, {"date": "8 Oct 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New School", "Interview Descriptions": "I applied through the university career website  and someone got back to me in the next week. They sent me an email and google invitation to initiate an in-person interview. We had the interview in a conference room and it wasn't stressful.", "Interview Questions": "What job experience do you have? Esp clerical"}, {"date": "13 Sept 2019", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY)", "Interview Descriptions": "Standard process. I applied online, about 2-3 weeks later, I had a phone interview. Before the in-person interview,  I did a marketing assignment. During the in person interview, I met with other team members as well as the hiring manager. Prior to the interview, the manager sent me detailed information about the interview process, along with time estimates, which I found very helpful. About 2 weeks later, she followed up and told me that I didn't get the job. However, her message was very thoughtful and left me with a good impression of The New School. The follow up email was appreciated, especially since many employers don't do this anymore.", "Interview Questions": "None - pretty standard questions."}, {"date": "24 Aug 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New School", "Interview Descriptions": "on campus hiring. I found about the open posion in a job fair. I submitted the application on line, then there was one in person interview, and I got an offer a week after.", "Interview Questions": "prior relevant experience "}], [{"date": "21 Aug 2019", "title": "Film Assistant Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New School", "Interview Descriptions": "Kind and brief, managers are nice. Understanding of role as student and willingness to cooperate with school schedule. Fast interview and willing to teach about skills. Interested in proactive behavior in the work environment.", "Interview Questions": "What major was I studying"}, {"date": "16 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New School", "Interview Descriptions": "Pretty straight forward, open minded and took about an hour. Only one interview before offer. Asked about past experience and what would you like to do in the position, they look for self motivated people that can bring something different to the table.", "Interview Questions": "Skills"}, {"date": "20 Jul 2019", "title": "Lab Aide Learning Services Operation Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New School", "Interview Descriptions": "Sent in all information and got an email within a couple of days. The interviewer asked a handful of questions about relevant experience and proceeded to share information about the position. Overall, it was a very laid back, \"let's get to know each other\" interview.", "Interview Questions": "What would you do if a student submitted a print late and came by to ask you to rush the job? Keep in mind there is a 7-day turnaround for the job."}, {"date": "5 Sept 2019", "title": "Graduate Teaching Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New School (New York, NY) in Jul 2019", "Interview Descriptions": "The interview process was first determined over email as they reached out and then set up a confirmation time over the phone. On the day, the receptionist was nice because I already had a ID card to get in and didn't need to be put on a list. My interviewer took me back to their office through a corridor of identical ones and went over my resume. They asked about my background and why I'd be a good fit then they reminded me of the job duties. It was routine and cordial but the entire process from start to finish took so long that I eventually found another paying job as I was applying to in the meantime.", "Interview Questions": "Do you have any conflicting time commitments or responsibilities? "}, {"date": "13 Aug 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New School (New York, NY) in Jul 2019", "Interview Descriptions": "I applied online and was contacted via email to set up a preliminary phone interview. I was unaware that the phone interview would be with a panel of 5 people, including the head of the department, and only found out during the interview. Despite the number of people on the other line, I was simply asked a few generic questions and not given any feedback nor did I hear any sort of reaction so it was a very odd experience. The questions were not tailored to me at all and my resume was never referenced. I found it really disrespectful, actually.", "Interview Questions": "Tell us about a time when you were met with a challenge and how you handled it. "}, {"date": "29 Apr 2019", "title": "Student Success Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New School (New York, NY) in Apr 2019", "Interview Descriptions": "The interview process consisted of a phone interview with three individuals asking questions about my current position, my work experience, why I was looking to change from my current role, what interested me about the position and the institution, etc. After, I was invited to campus for an in-person interview that consisted of three people once again (one of them the same as the phone interview). The questions here were a bit more specific and concentrated on the job itself, various elements that were unique to the school and it's students, and how I connected to the position based off of my previous professional work. After about 40 minutes with the panel, I then met with the director for the department for a 20 minute conversation about the position, what qualities should be expected of a candidate, and what management and the team was like.", "Interview Questions": "What attracted you to the position on initial review?"}, {"date": "19 Jul 2022", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at New School (New York, NY) in Aug 2018", "Interview Descriptions": "Because CAs are residents, we came down to meet the Area Coordinator in the RA Office in our dorm and had a very short interview about experiences and scheduling. Very easy and casual, just be calm and collected", "Interview Questions": "What is your schedule like?\r\nHypothetical Questions about Customer Service "}, {"date": "25 Apr 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY) in Apr 2018", "Interview Descriptions": "Submitted online, a week later they set up a 30 minute phone interview with 4 people. The team was friendly and the questions were the typical interview question--but with a twist. The twist is what made them hard to answer. For example instead of asking \"what are your strengths and weaknesses they ask \"what would your friends say is the best thing about you and what drives them crazy about you?\"", "Interview Questions": "If you could describe your work and leadership style in the form of an animal, what animal would you be?"}, {"date": "13 Jan 2018", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at New School", "Interview Descriptions": "It was a very fast process, excellent environment. I had an overall positive experience. I recommend if you are a current student for work hours while studying intensely.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "14 Jul 2022", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at New School (New York, NY) in Jan 2018", "Interview Descriptions": "I found the interviewers informative but also placing a lot of emphasis on managing my expectations (downward) about salaries, support, and quality of life. There was not a lot of information made available about the overall culture of the institution. Everyone was somewhat opaque.", "Interview Questions": "How did I see my research contributing to existing research by current faculty?"}], [{"date": "28 Oct 2021", "title": "Part-time Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at New School (New York, NY) in Nov 2017", "Interview Descriptions": "A contact inside Newschool forwarded my resume to course directors.  I met with the program co-directors for the first interview. I met with the Director of Part-Time Instructors for a 2nd interview.", "Interview Questions": "Describe your past teaching experience?\r\nTell us about your professional work and how it relates to the program?\r\nDescribe how your work relates to the course? "}, {"date": "15 Sept 2017", "title": "Operations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY) in Sept 2017", "Interview Descriptions": "received a call right away to set up an interview.  met with 3 different individuals.  all were extremely friendly.  very casual atmosphere.  very direct and transparent about the position.", "Interview Questions": "proficiency in excel on a scale from 1 to 10"}, {"date": "5 Oct 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at New School (New York, NY) in Aug 2017", "Interview Descriptions": "The interview was straight forward. Asked about availability and experience.  It was a student position so there wasn't a lot of pressure. She asked me about how many hours I could work throughout the week and if I could come in early some days when she needed me.", "Interview Questions": "Can you describe a situation where you had to be responsible for a task?"}, {"date": "18 May 2017", "title": "Senior Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY) in May 2017", "Interview Descriptions": "Phone screening about 2-3 weeks after I applied. Followed by an in person interview/ tour of the facilities a week later. And then it took about another week for them to complete the reference checks.", "Interview Questions": " What is the appeal of this job for you?"}, {"date": "22 Sept 2018", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 weeks. I interviewed at New School (New York, NY) in Apr 2017", "Interview Descriptions": "Rounds of interview from Resume and Cover letter then in person then group interview then final round of selection. There were a lot of steps but definitely help in getting the people who are only in it for free perks out of the process so that we have less people leave after getting the position and seeing the difficulty that comes with it all. Overall pretty comprehensive.", "Interview Questions": "What does social justice mean to you?"}, {"date": "10 Jan 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at New School", "Interview Descriptions": "Depends per department and per professor. You will apply online and the department will decide in faculty meetings. This means that knowing your professors is critical from an early part of the year. They should also be aware of your skills and interests. You also choose the specific professor you want to work with.", "Interview Questions": "No Questions, I knew the professor beforehand and had spoken to him about the job"}, {"date": "5 Jan 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New School (New York, NY)", "Interview Descriptions": "Cordial, direct, process oriented. With a panel. There were three interviews in total with three different panels. The process was long and there was a great deal of time between each interview.", "Interview Questions": "Trial questions regarding departmental situations and situations. "}, {"date": "26 Jun 2017", "title": "Operations Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY) in Dec 2016", "Interview Descriptions": "It was fairly easy.  I applied in Sept 2016 then heard back in Dec 2016.  I worked there as a Temp in the same Dept.  I was actually surprised that the called me for an interview. I felt terrible that I had to decline due to the salary.  it is a really nice department and great staff.", "Interview Questions": "You once worked here as a Temp.  How do you feel about being in a supervisor position where some of the staff know you as a Temp?"}, {"date": "2 Mar 2017", "title": "Student Lab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New School (New York, NY) in Oct 2016", "Interview Descriptions": "I used the student jobs site to find the listing, then sent an email and my resumé. I was contacted about a week later and asked to come for an interview in one of the University buildings downtown, with the man who would later be my manager. He was nice and did not make me nervous.", "Interview Questions": "What sort of experience did I have working with Mac/PC programs?"}, {"date": "1 Sept 2017", "title": "CNC Machinist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New School (New York, NY) in Aug 2016", "Interview Descriptions": "the inerview process was simple, you just fill our a google sheet and they will contact you and sit down with you either for a one on one or two on one", "Interview Questions": "how would you handle a person stressed out during finals"}], [{"date": "6 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at New School (New York, NY) in Aug 2016", "Interview Descriptions": "Short interview with the lead chair of the research group. Mainly focused on my previous work experience + relevance to the job. Interview process was similar to that of admissions interview as a graduate student of The New School. Kind and friendly professors helped this process!", "Interview Questions": "Describe how your previous work experience makes you a suitable candidate?"}, {"date": "15 May 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at New School (New York, NY) in May 2016", "Interview Descriptions": "I was contacted by the chair of the department over the summer. He discussed the department at length and his ideas for the future of the department, the direction he wanted to take it in, and what he was looking for in new instructors. We discussed my classroom experiences at length, challenges and strengths, and general issues in academia/classroom settings. It was a great interview. He offered me the job on the spot.", "Interview Questions": "Name a time you struggled in the classroom and had to re-see yourself and your teaching in order to reach your students. "}, {"date": "2 May 2017", "title": "Senior Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at New School (New York, NY) in May 2016", "Interview Descriptions": "Applied online, got a call the same week to setup the in-person interview for the following. Second interview took place the week after that and an offer was made a few days later.", "Interview Questions": "Experience with software relevant for administrative duties, including the Office Suite, some webservices, social media,  etc."}, {"date": "13 Apr 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New School (New York, NY) in Apr 2016", "Interview Descriptions": "I had an initial one-on-one informal interview with my prospective boss. They asked about points on my resume and then gave me lots of information about the role. I then had two follow up one-on-one interviews with academics, which were also quite informal. All interviews lasted in the range of 30-45 minutes.", "Interview Questions": "Describe a typical week in your old job."}, {"date": "25 Jun 2016", "title": "Director of Orientation and Transition Programs Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New School (New York, NY) in Jan 2016", "Interview Descriptions": "Phone interview/screening and in person interview. The interview panel seemed unprepared and jaded about working at the school yet happy to work with students. The position is new so there wasn't much information that they could provide about the role (e.g., who the position reports to, budget, salary, whether you'll be managing a team or not.  Red flag that they weren't interested in my candidacy or were just a mess adjusting to many \"new developments\" at the school. Witnessed one of the interviewers coaching one of the candidates (who was wearing jeans...) as he left the interview right before I came in. Unprofessional moment, to say the least.", "Interview Questions": " How would you handle a difficult employee?   "}, {"date": "4 May 2017", "title": "Teacher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at New School (New York, NY) in Jan 2016", "Interview Descriptions": "I sent a cover letter and resume directly to the department I wished to work for, and they called me in for an interview. When I arrived, I was given a brief tour of the department, then we went to a conference room where we discussed the challenges and successes of my experiences at specific schools I'd worked for in the past. Then I was given a surprise task: they gave me a real student's work to read over and evaluate. I was given 5 minutes to read and take notes on how I would direct and work with the student in the remaining 25 minutes. I didn't actually have to work with the student, just explain in detail how I would approach working with the student. Overall a great experience.", "Interview Questions": "How would you meet the challenge of helping an ESL student improve her ability to share her thoughts both orally and in writing?"}, {"date": "10 Feb 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at New School (New York, NY) in Dec 2015", "Interview Descriptions": "Met with two managers and the person who is leaving the position. They told me what the job would entail. They harped on how challenging the position is and asked me a lot of hypothetical questions.", "Interview Questions": "Why do you want to work at the New School?"}, {"date": "30 Aug 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New School (New York, NY) in Dec 2015", "Interview Descriptions": "I was interviewed by both the director and then the members of the team I would be managing. Pretty standard, I was contacted by phone and came in the following week. They were flexible about scheduling.", "Interview Questions": "Why do you want to work at the new school?"}, {"date": "9 Nov 2015", "title": "Office Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New School (New York, NY) in Oct 2015", "Interview Descriptions": "2-3 weeks after initially submitting my application online, I received an email from one of the Assistant Directors to come in for an interview. I meet with the Executive Director and two of the Assistant Directors in a nice conference room. The three of them switched back forth asking me 7-10 pre-written questions. The interview lasted about 30 minutes. At the end they informed me that they had a few more people to bring in and since HR can take a while to do their part I should hear back from them within 2-3 weeks or so. Unfortunately, after emailing several times to follow up, I did not receive a response back. After checking the status of my application I noticed that the status of the position had been changed to \"Position Filled\". Although I had a positive experience, I was a little disappointed in the way I found out that it was filled.", "Interview Questions": "This office can get very busy. How would you manage a long line of students and a busy phone line?"}, {"date": "10 May 2018", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New School (New York, NY) in Aug 2015", "Interview Descriptions": "Very casual! Showed up to the office and sat down in the lobby with the employer. We discussed my cover letter briefly, and interviewer asked when I would be available for training after that.", "Interview Questions": "How comfortable are you with using hardware?"}], [{"date": "12 Jan 2015", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at New School", "Interview Descriptions": "Interview started late due to no one scheduling a room/office to meet. Interview lasted ten minutes and one team member abruptly walked out during the interview. Half of group did not ask questions. Director did most of the talking and questioning.", "Interview Questions": "Very basic questions. No surprises, no challenges."}, {"date": "26 Mar 2015", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at New School in Jan 2015", "Interview Descriptions": "Two ladies ask every question based on looking my resume. They were looking for some communication specialists for promoting the alumni relationship. So they ask me about my social media skills. They were very nice to talk to but I was super nerves and behaved terribly.It is not about the professional skill or whether you can fit in our team. It is my psychological problem and I just need more practices I guess.", "Interview Questions": "Tell me about your social media skills"}, {"date": "28 Dec 2014", "title": "Senior Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New School (New York, NY) in Dec 2014", "Interview Descriptions": "I was contacted by phone and asked to come in for an interview. I met with the director we talked a while, then she said next step will be group interview.", "Interview Questions": "Questions were standard, nothing difficult."}, {"date": "25 Sept 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at New School (New York, NY) in Sept 2014", "Interview Descriptions": "Met with hiring manager first and I was then asked back to meet with a search team representing leadership and potential colleagues. The process was very clear and relatively quick.", "Interview Questions": "Why are you applying to this position? Why do you want to work at this school? Tell us about your experience and how it relates to this position.  Tell us how you would deal with challenges in this position."}, {"date": "6 Apr 2014", "title": "Curricular Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at New School", "Interview Descriptions": "Two interviews with large panels of people, none of whom took much initiative. Most people seemed unprepared for the interview and confused.", "Interview Questions": "They hadn't prepared specific questions, so they asked generic ones. Come prepared with what you want to get across. You may need to take control of the conversation."}, {"date": "10 Aug 2015", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New School (New York, NY) in Apr 2014", "Interview Descriptions": "Panel of three or four people from management asking questions.  Not more than an hour long.  Applied online but didn't hear back for a few months.  Had first interview with panel of people, and then a second interview with two individuals from higher management.  was offered position and started two or three weeks later.", "Interview Questions": "What is the hardest decision you've ever had to make and why?"}, {"date": "5 Jun 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New School (New York, NY) in Mar 2014", "Interview Descriptions": "I was contacted by someone from HR who did a phone screening. A few weeks later I was contacted by someone to set up an interview.  This interview was with three people and the conversation was friendly and thoughtful. Another two weeks and I was contacted that I'd been put forward to round 2, this interview was again friendly whilst still being formal and informative for both myself and the interview panel. They stated they had hoped to make a decision by the end of the following week, two weeks later I was told that it was going to be a few more weeks and then a month after that I reached out again and was told that they had decided to continue on with another candidate.", "Interview Questions": "Tell us about a time when you dropped the ball?"}, {"date": "21 Jan 2014", "title": "Program Administrator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at New School", "Interview Descriptions": "1. Standard behavioral questions.\r\n2. What can you bring to the position.", "Interview Questions": "1. If you were a superhero what type of powers would you have?"}, {"date": "21 Apr 2014", "title": "Senior Academic Adviser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at New School (New York, NY) in Jan 2014", "Interview Descriptions": "I had a telephone interview first for over 45 minutes which was informative and discursive.  The interviewer picked up on some aspects of my resume' that others had never noticed. Then I was called for an hour's in-person interview and tour of the facility a few weeks later.", "Interview Questions": "The difficulty was that during the personal meeting I was asked to submit my questions, which the interviewer answered fully and directly. I expected to answer some questions in return but wasn't asked any."}, {"date": "28 Nov 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at New School (New York, NY) in Aug 2013", "Interview Descriptions": "very easy, got the job immediately it was for federal work study so that's like $3k a semester or something like that it is the easiest interview ever you just have to qualify for work study and get placed with something that you think suits you", "Interview Questions": "are you a student"}], [{"date": "19 Feb 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at New School (New York, NY)", "Interview Descriptions": "Depending on the program, it can be excellent.", "Interview Questions": "No difficult questions."}, {"date": "20 Nov 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at New School in Feb 2013", "Interview Descriptions": "Very simple process.  I talked with the chair on the phone for 20 minutes after my CV was passed on to her.  She at this time was very nice and we had a fine conversation.  She tasked me with drawing up a few possible course descriptions, so if you're interviewing here, it would be a good idea to have this on hand.  I was hired on the spot, and was given two semesters' worth of teaching.", "Interview Questions": "There really weren't any.  Perhaps if they weren't so in need of instructors, they would have asked me more challenging questions.  I would advise just to have your pedagogical methodology in order, be able to outline your strengths and research interests, and it would also help to mention the value of assessment and social justice.  They're very big on those ideas."}, {"date": "20 Jul 2015", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New School (New York, NY) in Jan 2013", "Interview Descriptions": "Casual and brief, there was nothing out of the ordinary. I had an excellent resume so that made it very easy. Again, it depends on the people. People make your job happy.", "Interview Questions": "Q: What experience do you have with marketing?\r\nQ: Do you have proficiency in basic computer programs (Excel, Google Apps, etc)"}, {"date": "20 Aug 2014", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at New School (New York, NY) in Feb 2012", "Interview Descriptions": "Responded with interview notice after 2 days. Interview was 15 minutes and the interviewer seemed to be more distracted and focused on what they wanted for lunch. She was asking questions off of a sheet and just didn't seem too interested in general.", "Interview Questions": "What contributions do I bring that could make the working environment difficult at times"}, {"date": "7 Apr 2013", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at New School (New York, NY) in Apr 2011", "Interview Descriptions": "Phone interview for 60 mins.  Be ready to impress them with your skills, research experiences, previous funding, collaborators, and what you can contribute there.", "Interview Questions": "was all expected..."}, {"date": "20 Jun 2012", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at New School (New York, NY) in Jan 2011", "Interview Descriptions": "The New School likes to hire from within.  I was already working for the University and the interview was mostly a formality, although they did interview other applicants.  They didn't seem to take the interview too seriously (which was indicative of senior managements attitude toward the position).", "Interview Questions": "Standard interview questions, mostly based on technical abilities (comfortable with Microsoft Office, management skills, etc.).  No questions pertaining to growth or visions."}, {"date": "7 Dec 2010", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New School (New York, NY) in Oct 2010", "Interview Descriptions": "I applied online for a position one to two days after it was posted. About 1.5  weeks later, a person in the recruiters office called me to schedule an appointment with my recruiter for the following week. The phone interview was pretty straight forward as far as standard questions go. They told me about the positions + benefits and then answered any questions I had about the position. They then told me that my answers would be reviewed and that if they were considering me that I would get a call within the next week to set up an in-person interview (they also mentioned that if I didn't hear back I could call the recruiter back about my status- if there was a delay or if was not going on to the next round).\r\n\r\nI got a call within the time frame they asked for and they scheduled an in person appointment with me for the following week. I met with a group within that department and again they asked pretty standard interview questions. Very nice group and they got back to me when promised. I didn't get the job but overall I feel that The New School is a very professional place and I still very much hope to work there in the future.", "Interview Questions": "Why do you want this position?"}, {"date": "16 Jun 2010", "title": "Academic Communications Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New School (New York, NY) in May 2010", "Interview Descriptions": "I was contacted by phone by a lovely deptment assistant.  They wanted to begin the phone interview process as soon as possible and I scheduled a chat for the next morning.  I was called promptly and went through a fairly standard 15 minute phone interview.  I should have spent more time reviewing basic question/answer scenarios.  No curve balls here.", "Interview Questions": "Describe how you would deal with many people asking you for deliverables at the same time."}, {"date": "3 Jan 2011", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New School (New York, NY) in Apr 2010", "Interview Descriptions": "I had two interviews-- both were panel. The initial interview didn't seem well-organized; they had only a few questions for me and I would have been out in 15 minutes if I hadn't turned the interview around by asking questions and starting a dialogue between all of us. I received a call back the next day and interviewed again the next week. I was asked to prepare a 5 minute presentation on any subject. The second interview was more formal and included higher ups in the administration. I think it was down to two of us, but I didn't get the offer. The people at the school were very nice and professional, but the group interview feels impersonal. I'd suggest preparing a few questions in advance because they didn't have very many prepared either time.", "Interview Questions": "Give me your five minute pitch about the school and imagine you're talking to a disinterested 17 year old."}, {"date": "25 Jun 2013", "title": "P/T Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at New School (New York, NY) in Aug 2009", "Interview Descriptions": "interview/resume/portfolio", "Interview Questions": "N/A"}], [{"date": "15 May 2013", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at New School (New York, NY) in Jan 2009", "Interview Descriptions": "I was excited to interview here, and really disappointed by the experience. \r\nMy initial contact (search chair, department lead) seemed professional and friendly enough setting up the interview, and on site. Unfortunately, would-be colleagues were non-existent on campus. \r\nMost telling: I was put up at a fleabag of a hotel, and wasn't reimbursed for my considerable travel expenses. \r\nAbsolutely no post-interview follow-up. \r\nSad experience, because the potential of the institution and position was made to sound so promising.", "Interview Questions": "How do you expect to live here on the salary range I've just described?"}]]