[[{"date": "3 Jun 2023", "title": "Visitor Services Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Conservation Experience in May 2023", "Interview Descriptions": "I received an email to set up a time for a phone interview. The phone interview consisted of going over the role, how ACE works with the federal agency, my relevant experiences and interest, interview questions, and then any questions I had. Afterwards, the agency would contact me and I would hear back from ACE once they go through the vetting process.", "Interview Questions": "What do you look for in a supervisor?"}, {"date": "24 Jan 2023", "title": "Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Conservation Experience", "Interview Descriptions": "Easy, quick interview; honestly more of a conversation. It was over the phone with one interviewer. Just general softball questions gauging physical abilities and ability to work with others.. Heard back the next day with an offer.", "Interview Questions": "Give an example of how you supported a friend or coworker when they were having a difficult time. what does professionalism mean to you? Also questions involving diversity, leadership, physical abilities, prior work experience/ education"}, {"date": "1 Jun 2022", "title": "Conservation Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Conservation Experience in May 2022", "Interview Descriptions": "It was a chill interview, where I got a good feel for what the job and the people would be like. They asked me a few interview questions about myself and prior jobs, and also logistics.", "Interview Questions": "Whats a challenge you had to face in the past, and how did you overcome it"}, {"date": "29 Jan 2021", "title": "Crew Member Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Conservation Experience", "Interview Descriptions": "Was contacted approximately two weeks after submitting my application. The interviewer asked questions about my interest in conservation, my familiarity with the organization, and what, specifically, I could contribute to the organization.", "Interview Questions": "What are you most looking forward to about this position? "}, {"date": "29 May 2021", "title": "Corps Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Conservation Experience (Hurricane, UT) in Oct 2020", "Interview Descriptions": "Show your enthusiasm and they'll be interested. Communication at my branch of the company (and the company in general) is pretty notoriously lacking but it's an easy enough interview if you can get through the sporadic communications.", "Interview Questions": "gauging interest, asking about experience, nothing too philosophical "}, {"date": "8 Oct 2020", "title": "Trail Inventory Crew Member Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at American Conservation Experience (Salt Lake City, UT) in Aug 2020", "Interview Descriptions": "I emailed following up on the job application and was told I was not in the running for the job.   A week or two later I was contacted for an interview but was not told there would be a panel interviewing me.  It caught me by surprise, but it went well.  I got no email back saying I did not get the job.", "Interview Questions": "When have you seen diversity in the workplace and how did you deal with it?"}, {"date": "30 Jan 2019", "title": "Wildlife Biologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Conservation Experience", "Interview Descriptions": "Was very easy.   Only lasted about 10 minutes. The recruiter called me  and  only ask a few questions about prior experience at jobs I had before. It was so short I was nervous I messed up, but nope!", "Interview Questions": "Why do you want this job?"}, {"date": "13 Dec 2018", "title": "Crew Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Conservation Experience", "Interview Descriptions": "They will hire literally anyone for the general corpsmember position. It is funded by Americorps and you get a living stipend and an Education Award at the end of completed service.", "Interview Questions": "What does professionalism mean to you?"}, {"date": "29 Nov 2018", "title": "BLM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Conservation Experience", "Interview Descriptions": "1st interview over the phone with someone from ACE. 2nd phone interview with someone from BLM. Both were general hiring questions related to resume and application. It was an overall comfortable experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Nov 2018", "title": "Corps Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Conservation Experience", "Interview Descriptions": "Interview process was conducted over the phone and was very lenient. The only questions designed to assess skill level were directed at ability to work well in groups and to assess leadership potential for Crew Leader and Assistant Crew Leader promotions.", "Interview Questions": "Have you ever been faced with a challenge while working in a group? What did you do?"}], [{"date": "10 Sept 2017", "title": "Administrative Support Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at American Conservation Experience", "Interview Descriptions": "I applied online on August 11th for a position through ACE, but placed at the Bureau of Land Management in the Phoenix office. Two phone calls were received on August 22nd, one from ACE and one from BLM, requesting phone interviews. The phone interview with ACE was pleasant  at 30 minutes long and involved basic questions regarding availability, expectations of the position, and some questions regarding my resume. My information was apparently entered in the system and I was advised to perform the BLM phone interview when able.\r\n\r\nI received an email from the BLM, with the incorrect position in the subject line, scheduling a phone interview without my input 1.5 hours after the email was sent to me and I was too late as I read the email hours later. A voicemail was left by me and I did not receive contact until two weeks later when a system-created email was sent notifying me the position was filled.\r\n\r\nThe process with ACE was straight forward and polite. Bureau of Land Management was surprisingly unprofessional in their lack of contact and disrespect of time management.", "Interview Questions": "How are you with hiking?"}]]