[[{"date": "2 Sept 2022", "title": "English Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midlands Technical College (Richland, SC) in Jun 2021", "Interview Descriptions": "Members of faculty from department. Set of questions asked of all applicants. The comments are written by each member. Absolutely no training given to them. They write ridiculous remarks. You can request the applications and notes for those interviewed by filing a FOIA request. Pretty enlightening reading and you can see how you stack up against other applicants. It's SC law they have to give the info to you. They usually have a person selected and are jumping thru the hiring hoops and wasting the time of people who think it's a real job opportunity.", "Interview Questions": "You do a teaching demo on a topic they assign; they ask how you handle student problems (red flag bc you'll have a ton of them with the demographics); your technology use; an example of a teaching method that is effective."}, {"date": "17 Sept 2019", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midlands Technical College", "Interview Descriptions": "I was called for interview about 2 weeks after applying via online. There were set days that they had interviews scheduled. There were three members on the panel that asked questions.", "Interview Questions": "Panel took turns asking questions "}, {"date": "29 Apr 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Midlands Technical College in Mar 2019", "Interview Descriptions": "Easy and painless. The interview was not the hard part, just finding time to talk to everyone and keeping up with emails was the hard part. It really has not been that bad at all.", "Interview Questions": "Basic interview questions"}, {"date": "8 Feb 2018", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midlands Technical College in Jan 2018", "Interview Descriptions": "Short but was very professional prior to the interview. Kept me informed and updated. There was a good bit of people on the interview (6) and they all asked just one question and call was over.", "Interview Questions": "What do I like about the College? Why them basically."}, {"date": "16 Mar 2021", "title": "Financial Aid Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midlands Technical College in Dec 2017", "Interview Descriptions": "The interview process is rather simple, it is a panel Interview. They introduce themselves and then you get to introduce yourself.  The panel rotates in asking questions.  Everyone is sitting at a large conference table with you.", "Interview Questions": "How to do handle stressful situations"}, {"date": "30 Mar 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midlands Technical College (Columbia, SC)", "Interview Descriptions": "The process is straightforward and the dean is super nice. Really care about their faculty and passionate about this college. I like the way they are so reasonable and so caring.", "Interview Questions": "Tell us about your your background. "}, {"date": "3 Dec 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Midlands Technical College (Columbia, SC)", "Interview Descriptions": "Ask me about my past work experience. Ask me what I knew about Midlands Technical College and how did I find out about the job. Also, asked about how my skills would translate into the job", "Interview Questions": "Tell me about your greatest achievement"}, {"date": "9 Jul 2015", "title": "Enrollment Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Midlands Technical College in Jul 2015", "Interview Descriptions": "Walking into Midlands Tech was a great experience. Everyone was so friendly. I had one interviewer, and she was very easy to talk to. She provided detailed information about the position, and gave me a chance to ask questions. The interview went well, and hope I get a call back.", "Interview Questions": "Strength and weaknesses...."}, {"date": "11 Jun 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Midlands Technical College (Columbia, SC) in Feb 2015", "Interview Descriptions": "Be prepared for a interview panel most of the jobs that you apply for here have a panel that is at least 3-5 people asking you questions. Most jobs are given to internal applicants I would say a good 70% of them so if you don't know someone already working there, the chances of you being hired are slim.", "Interview Questions": "Where do you see yourself in five years."}, {"date": "19 Apr 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midlands Technical College (West Columbia, SC) in Dec 2014", "Interview Descriptions": "I was called in to meet the department chair.  She is very nice, superficially.  Asked mostly about my family and a little about my education.  No detailed information to see how vast my knowledge was in the field that I claimed to have an advanced degree in.  Made me curious if anyone was screened to see if they knew what they were doing.  Basically hired on the spot.  It seemed they were just filling a need with whomever walked through the door.", "Interview Questions": "How many kids do you have?"}], [{"date": "16 Aug 2015", "title": "Bookstore Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Midlands Technical College (Columbia, SC) in Nov 2012", "Interview Descriptions": "They were looking hard working and team work player.The supervisor was wanted somebody who always to be on time at  work and assist costumers needs. Bookstore clerk can do multiple task at his/her job side loading or unloading, receiving and shipping.", "Interview Questions": "Do you have any experience in receiving and shipment or Cashier?\r\nCan you do multiple task?"}]]