[[{"date": "6 Jul 2023", "title": "Diversity and Inclusion Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CIPD (London, England)", "Interview Descriptions": "Assumptions were made about me following the psychometric testing. Being hugely self aware means I know my issues; what the testing doesn't reveal is how I manage and mitigate my short comings. This could be revealed if asked.", "Interview Questions": "This was at pre interview assessment."}, {"date": "10 Jan 2023", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CIPD (Wimbledon, England) in Jan 2023", "Interview Descriptions": "It was insightful, engaging and stress free. A loving team and wonderful work environment. It has a great work life balance. They lead by example when it comes to HR.", "Interview Questions": "Role play Situational interview questions Group activity"}, {"date": "11 Oct 2022", "title": "HR-Admin Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CIPD in Sept 2022", "Interview Descriptions": "3 stage interview\r\n\r\nPhone\r\nTest (Psychology + maths!?)\r\n1:1\r\nI had a phone interview with test, after that I never heard from them again. I even sent a follow-up - no response. The human decency require to at least finish what you started. If you started the interview process, it would be great to send a response. If someone is sending a follow-up, is so hard to give a one sentence with some feedback? \r\n\r\nAlso, what is the point of giving such a high level maths test, or any maths test for the HR position?\r\n\r\nExtremely dehumanizing process and company - avoid at all cost!", "Interview Questions": "The train is going with x speed, what time it will get to the station"}, {"date": "20 Jan 2023", "title": "Business Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at CIPD (London, England) in Jun 2022", "Interview Descriptions": "Three interviews only to never hear back from anyone. Was passed from pillar post about who would like to interview me next. Was given all the chat about what a great fit I’d be. Process dragged on for months. Completely unprofessional and a very backwards organisation.", "Interview Questions": "What is your work experience to date?"}, {"date": "23 Jan 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at CIPD (London, England) in Jun 2022", "Interview Descriptions": "Psychometric tests, couple of interviews with various people around the business and a task to complete as part of the final interview. I was asked a range of question about my experience and what I would do in certain scenarios.", "Interview Questions": "Describe a time when I've needed to provide challenging feedback."}, {"date": "18 Jan 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 5 weeks. I interviewed at CIPD (London, England)", "Interview Descriptions": "2 stage interview. Promised feedback after both stages but never received anything. Also promised a phone call regarding other potential role but never called. Incredibly slow and un-coordinated. Old-fashioned interview style with questions that are not relevant in present work world. Also, they were suprised when I was not able to tell bad things about my current workplace. Very odd experience, would not apply again.", "Interview Questions": "how do you like to be managed?"}, {"date": "12 Jul 2021", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CIPD", "Interview Descriptions": "It was easy, 2 stages. Phone interview, then in person. Standard questions. Make sure to revise the job spec and know why you want to work at CIPD. I wouldn't worry about it as long as you have revised and you have experience", "Interview Questions": "Tell me about yourself "}, {"date": "8 Jun 2022", "title": "Communications Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CIPD (London, England) in Mar 2021", "Interview Descriptions": "All interviews conducted virtually. Involved an initial conversation with their recruitment team, followed by a two stage process with the hiring team. Competency based interview with a task related to the role included.", "Interview Questions": "How would you respond to a comms crisis? "}, {"date": "18 Jan 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at CIPD in Feb 2018", "Interview Descriptions": "Competency based and work based test. Questions to test previous experience and relevant skills, based on person specification. . Work-based test to mark and assess a student's work and give feedback.", "Interview Questions": "How would you give feedback to a student who had failed an assignment?"}], [{"date": "17 Feb 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at CIPD (London, England) in Jan 2017", "Interview Descriptions": "The process felt consistent and fair with a chance to meet wider members of the team. The assessment process was also clear and allowed a chance to demonstrate the skills required to complete the role in it's entirety.", "Interview Questions": "Describe your leadership styles?"}, {"date": "22 May 2015", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CIPD", "Interview Descriptions": "The application was via LinkedIn where I submitted my cv and cover letter. This was then followed by a phone interview and then being invited for a face to to face interview which also included a test on copy writing for email and ad.", "Interview Questions": "Why do you want to work for CIPD"}, {"date": "9 Aug 2016", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at CIPD (Wimbledon, England) in Feb 2015", "Interview Descriptions": "The process was conducted through a mixture of different mediums, depending on the stage. I kicked off with a half hour phone interview with a friendly marketing consultant who (I think) just wanted to ascertain I had the knowledge / experience indicated on my CV. He also took some time out to tell me more about the CIPD; the project I'd be working on if successful, the progress they'd made and where the role I applied for would fit into the overall strategy. \r\n\r\nI then had a couple of face-to face interviews with people from two different teams as the role worked with both. The interviews were relaxed and friendly, so I felt at ease and able to give the best answers I could. I also wrote a report which responded to a hypothetical scenario, saying what I would do and why. Overall it was a good mixture, and although there were a lot of stafes (four altogether), it meant that when I was offered the role, I felt really comfortable that I'd be a good fit.", "Interview Questions": "I really can't remember specific questions! I think they asked me what the three key skills were that made me good for the role, and then asked me to talk around those skills. "}, {"date": "26 Apr 2016", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CIPD (London, England) in May 2014", "Interview Descriptions": "Met with HR rep to go through some standard questions and and then with Director for 1:1 interview covering more specific knowledge.  Was personable and reasonable but felt that I was being judged on what i was doing NOW (few staff managed) rather than my track record (of managing large teams over a long period of time.", "Interview Questions": "Given your age, what do you know about social media?"}]]