[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "13 Jul 2022", "job_title": "Chief Operating Officer in Gaithersburg, MD", "duration": "N/A", "pros": "I have been with NBCOT for nine years and watched our people grow and thrive both personally and professionally. The commitment to work-life balance is extraordinary. An authentic 35-hour work week matched with more than 30 PTO days a year, for every employee, including the office closure the last week of December every year. We have a hybrid work arrangement where most staff work in the office two days a week and from home three days. \n\nThe best part of NBCOT is our staff. We support each other and laughter is a common sound. I look forward to being with the team.\n\nNBCOT is an innovative company that leads the field for certification with new products and services launching every year. We have invested heavily to be a leader in digital products, services and tools. We are very committed to Justice, Equity, Diversity and Inclusion as evidenced in our development of tools for the public and a strong internal program.\n\nNBCOT is a unicorn, not a billion-dollar startup, but a company committed to excellence built on a strong foundation of amazing professional staff. I am very proud to be a part of this amazing group of people.", "cons": "None that come to mind."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent Team Members and Work Life Balance Options", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Nov 2021", "job_title": "Program Manager in Gaithersburg, MD", "duration": "N/A", "pros": "intelligent, knowledgeable, friendly and dedicated staff members, team atmosphere, work life balance that is REAL, engaging work and mission.", "cons": "Cannot think of any. I have had an excellent experience"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Job that enhance my skills and offers opportunity to demonstrate leadership.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Aug 2014", "job_title": "Assistant Director in Gaithersburg, MD", "duration": "N/A", "pros": "Excellent support and guidance from senior staff. I am supplied with enough resources to effectively perform my job. Senior staffs demonstrate forward thinking and leadership. Colleagues are supportive and talented.", "cons": "I am unable to think of any cons as I am satisfied with what I do here."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Meaningful Work - Committed to Work-Life Balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Jan 2014", "job_title": "EVP in Gaithersburg, MD", "duration": "N/A", "pros": "We offer a ridiculous commitment to work-life balance in exchange for employing the very best people.  Benefits include 27 personal days plus 11 holidays each year.  A real 9 to 5 workday (no bonus points for staying late!). A very generous 401K program, strong professional development program and a collaborative work atmosphere.  Finally, \"good\" is not good enough for our work--we achieve excellence, every day!", "cons": "You have to make the cut to get hired - it's not a place for people who just want a paycheck.  We are committed to making a difference."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A progressive company dedicated to making a difference.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Aug 2014", "job_title": "Director in Gaithersburg, MD", "duration": "N/A", "pros": "NBCOT is focused on their mission, bringing meaning to the work done there. The company is clearly a leader in certification, continually raising the bar in technology, customer service and business intelligence. It is a challenging and inspiring place to work. The employees are professional, skilled at what they do, and dedicated to quality. The leadership has created a company culture that is sincerely supportive of work/life balance, and the benefits are fantastic.", "cons": "The organization is relatively small, leaving limited opportunity for upward mobility, although they do look to promote from within when possible."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "no direction from the management", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Sept 2017", "job_title": "Network Administrator in Gaithersburg, MD", "duration": "N/A", "pros": "most of the people are great to work with, small infrastructure to manage will have hands-on experience on everything.", "cons": "company is too small for a IT person to grow and learn new technology, and management has no direction and super slow in decision making and can't make their mind on one thing."}], []]