[[{"date": "29 Feb 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Salzburg Global Seminar in Dec 2019", "Interview Descriptions": "There were a number of steps before the interview. Like submitting the application, doing a test, going through an interview, reaching out to the references, and being offered a position. The interviewers were friendly and professional as well. Making reference to my cover letter and experience.", "Interview Questions": "What do you know about Salzburg Global Seminar"}, {"date": "24 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Salzburg Global Seminar", "Interview Descriptions": "The interview process was fairly simple but thorough.  I very much enjoyed getting to know the staff and the process gave me a good understanding of the position.", "Interview Questions": "What are you strengths?"}, {"date": "26 Dec 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salzburg Global Seminar in Feb 2014", "Interview Descriptions": "I saw the posting on Idealist.org, applied online and was contacted within a few days by email. I was called in for a in-person interview with three employees, including a director. The interview was really straight forward, basic interview questions and other more specific questions pertaining to the organization's objectives and activities. The interviewers were helpful throughout the meeting.", "Interview Questions": "If your direct supervisor and a senior executive/CEO give you two conflicting assignments, how would you proceed?"}]]