[[{"date": "16 Jun 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Institute of Technology (Singapore)", "Interview Descriptions": "Entrance interview consist of 6 different mini interviews + 1 essay writing. Interviewers are professional. Quick process spent 3 hours for the interview. Interviews include case scenarios and essay can be from current issue topics", "Interview Questions": "Tell me why do you pick healthcare professions over other degree courses?"}, {"date": "21 Jun 2023", "title": "Research Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Institute of Technology in Jun 2023", "Interview Descriptions": "The interview lasted around 30 mins. Each interviewer asked about 2-3 questions. It was very casual, more like a chat to get to know you more. More information about the role was provided during the interview.", "Interview Questions": "Where do you see yourself in 3-5 years? What do you hope to achieve with us?"}, {"date": "23 Jun 2023", "title": "Software Engineer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Institute of Technology in May 2023", "Interview Descriptions": "Interviewer asked me to introduce myself and talk about projects I had done that were relevant to the role. After that, the job scope was brought into discussion. The interview was done through Zoom, relatively chill and quick.", "Interview Questions": "Introduce yourself. Talk about relevant projects."}, {"date": "11 Jan 2023", "title": "ASE Trainee Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Singapore Institute of Technology", "Interview Descriptions": "2 Questions with an aerospace related question other than that it was just a simple introduction to the course and getting to know you better. Tell you about the work life there", "Interview Questions": "Basic Aerospace knowledge related question"}, {"date": "4 Aug 2022", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Singapore Institute of Technology", "Interview Descriptions": "They got back to me 3 days after i sent an application.\n\nInterview panel consisted of 3 professors and the director of the lab. Was 45 minutes long. They take turn to ask questions. Usually each professor is an expert in the area they wish to test you on. And they mostly ask technical questions based on the stuff you’ve listed in your resume, and potentially the project you’re interviewing for", "Interview Questions": "Tell me about yourself, something that is not in your resume"}, {"date": "19 Jun 2021", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Institute of Technology", "Interview Descriptions": "The interviewers were familiar with the company and showed interest in the interview. I felt i was welcomed when i went for the interview. The interviewers was very friendly and made the whole interview very meaningful as I have learnt a lot from them.", "Interview Questions": "What can you contribute to this position?"}, {"date": "11 Apr 2021", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Singapore Institute of Technology", "Interview Descriptions": "It was conducted via Zoom instead of the traditional face to face interview amid the pandemic and was attended by three interviewers. The interviewers were friendly and the whole process took around 50 minutes.", "Interview Questions": "Please tell me about yourself"}, {"date": "20 Feb 2021", "title": "Executive Staff Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Singapore Institute of Technology", "Interview Descriptions": "It was a Zoom interview with a panel of HR and the hiring manager. They were very friendly and casual, and made theh interview very comfortable. They also interact well with each other and seems like culture is good.", "Interview Questions": "Share with us about yourself. "}, {"date": "13 Aug 2021", "title": "Energy Efficiency Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Singapore Institute of Technology (Singapore) in Sept 2020", "Interview Descriptions": "The interviewer is very friendly and explains the company well. Also questions were just based on whether you are willing to learn and pick up new skills. Overall, a smooth process.", "Interview Questions": "Could you explain more about your final your project?"}, {"date": "29 Jun 2020", "title": "Professional Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Singapore Institute of Technology (Singapore)", "Interview Descriptions": "2 round in total but the whole process is over 3 mths\r\n1st round is interviewed by the future team leaders, 45min\r\n2nd round is by professional officer director and cluster director, 45min", "Interview Questions": "your plan for the next 5 years\r\nworking experience\r\nhow do you plan to work"}], [{"date": "21 Mar 2020", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Institute of Technology", "Interview Descriptions": "It is long ago and I do not remember. The details are now scant given that it is not very recent. I have little if anything meaningful to share. I do not wish to write a review for which I honestly have little recollection of, hence I think this field should be optional.", "Interview Questions": "Why do you want to join us?"}, {"date": "20 Mar 2023", "title": "Professional Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Singapore Institute of Technology in Sept 2019", "Interview Descriptions": "first round, meet the senior professional officers who will potentially be your reporting officer or colleagues. second round, meet the director of the professional officer division and one or two professors from your area.", "Interview Questions": "what is your expectation for the next five years? please describe your industry experiences."}, {"date": "7 Aug 2019", "title": "Temp Administrative Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Singapore Institute of Technology (Singapore) in Jul 2019", "Interview Descriptions": "I was asked to go for the interview quite last minute and during the interview one of the interviewer seem amused by something all the time. Felt she’s really rude and insincere as even if she finds me unsuitable she should have the courtesy to act professional during an interview as I’ve take out time to dress up and attend the interview on time. The HR promised to get back to me in a week even if I’m not hired but I emailed and called them twice after 5working days and waited for another 3 working days and no answer. Not even professional courtesy to say I’m not hired. I strongly not recommend to even attend their interview as I believe it is s fake interview to just test out the job market or they are hiring someone that’s recommended by their colleagues or an Ex student. Felt they wasted my time and it’s very unprofessional not to even reply to a candidate to inform them they are not successful as they take precious time out to attend the interview.", "Interview Questions": "What is your last 3 work experiences?"}, {"date": "3 Aug 2020", "title": "Professional Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Singapore Institute of Technology (Singapore) in Feb 2019", "Interview Descriptions": "4 people interviewed, 1 of them was the HR(dint ask any question). Overall interview was smooth and the interview was quick.", "Interview Questions": "Most questions are about in detail of my skills on my resume ."}, {"date": "25 Jan 2019", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Singapore Institute of Technology in Dec 2018", "Interview Descriptions": "Quick and responsive to candidates interview processes. Usually employers will not get back to you after rejecting you for one role, but they do, and they really do assess you for other positions", "Interview Questions": "What are your career aspirations"}, {"date": "7 Aug 2017", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Singapore Institute of Technology", "Interview Descriptions": "Interview was done in such an abrupt manner which lacked professionalism.  It felt as though I was taking up the panel of interviewers' time and they were just bored/unkeen. I guess there were either too many applicants for the job or they had already found the candidate they wanted and just wanted to get on with it and quickly end the interview.\r\n\r\nFurthermore they did not bother sending any  rejection letter.", "Interview Questions": "reason for leaving past employment"}, {"date": "15 Oct 2019", "title": "Professional Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Singapore Institute of Technology (Singapore) in Jun 2017", "Interview Descriptions": "HR checking documents;\r\nwait for the panel;\r\npanel ask both technique and non-technique questions;\r\nthe whole interview is 0.5 hours;\r\nleave and wait for the phone call from HR talking about salary;\r\nargue with HR about salary;\r\nsalary request is approved.", "Interview Questions": "what is your expectation in SIT"}, {"date": "8 Jan 2017", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Singapore Institute of Technology (Singapore) in Jul 2016", "Interview Descriptions": "Half an hour interview through a referral. Tough questions which aim at my weaknesses. Polite interviewers though. My experience may not be enough for the position. I did not do well so no offer", "Interview Questions": "How would you contribute to the school?"}, {"date": "1 Mar 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Singapore Institute of Technology in Feb 2016", "Interview Descriptions": "Senior manager seemed like she had not read my resume prior to the interview. Her attitude was cold and blunt throughout the interview. \n\nThe job posting online stated Admin Assistant with duties: student outreach duties, campus tours and administrative duties. However the manager said that actually the main job is to conduct campus tours for new students throughout the year. She proceeded to ask me to say what do I think in my current job is relevant to this job position. When I explained my current and past job experiences which were mostly administrative and stated that I was very willing to learn with my limited experience in touring and student outreach , she shot me down with 'what made you apply this in the first place and why are you even here?' \n\nShe was very unpleasant throughout the interview and seemed ready to leave. One of the most unpleasant experiences I've had.", "Interview Questions": "What do you think in your current job is relevant to this position?"}, {"date": "2 Aug 2015", "title": "Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Singapore Institute of Technology (Singapore) in Jul 2015", "Interview Descriptions": "Was a nice open process with the few directors of the department. Young panel of interviewers which made it easier to communicate with them. All very friendly and I thought the interview went quite well on my end but they remained silent and took extremely long to get back. After a month I found they advertised for someone more experience which I think isnt very professional as an organization.", "Interview Questions": "How do you think your experiences from the last job help you excel in your role"}]]