[[{"date": "6 Jun 2023", "title": "Product Designer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at HCF (Australia) (Sydney) in Jan 2023", "Interview Descriptions": "Two interviews and a \"short\" test. Both interviews were conducted by two people who did not understand the job at all, which was obvious from the questions and the feedback. They didn't understand the common 'jargon' they associate with the type of role, so when their inexperience became obvious, I didn't use it as much as I could have. However, they seemed to think this indicated a lack of experience, despite that obviously not being the case based on my resume, answers, and test response (which they said was \"the very best of the bunch\"). The test itself was overly long and complicated, and was alost completely irrelevant to what they were supposedly looking for with the role.\r\n\r\nOther red flags: * The role had only been in existence for 13 months, and this was the fourth time they were hiring for the role. * I did not apply for the role, but interviewed after being approached by 3 separate HCF HR reps about this role, on the same day, via LI. I thought they were 3 separate Product Designer roles as they were described by each person so differently: junior, mid, and senior level, paying anywhere between $80k and $160k pa. * The job description was overloaded, nonsensical, contradictory, and full of nothing but job-specific jargon used incorrectly. * The job was advertised as remote, but was stated to be hybrid, with no details about what that actually meant. Everyone else on the team was interstate. * They couldn't tell me what I would actually be working on, or what type of professionals I'd be working on the same team as. * They couldn't tell me what they were actually looking for, but it wasn't really a Product Designer, but a combination of about 4 different roles.", "Interview Questions": "The questions were all overly-long and complicated, and it was never clear as to what they actually wanted from your answer. Q: Describe a project that was difficult, and explain why it was difficult. (They were looking for details around stakeholder management experience, apparently.)"}, {"date": "10 Feb 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HCF (Australia) (Melbourne) in Feb 2021", "Interview Descriptions": "In the online video interview, I had included the hiring manager and a branch manager, and they took turns asking me questions. It was super thorough \"what if\" questions and I felt like I was being grilled for over 60 minutes.", "Interview Questions": "What if you work in a company you cannot agree with its company culture?"}, {"date": "2 Feb 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HCF (Australia) (Sydney) in Jan 2021", "Interview Descriptions": "Online interview process easy and quick to use I didn’t have any problems with the process at all very efficiently done and quick to respond to any questions or queries .", "Interview Questions": "Work experience and why you left your last job"}, {"date": "22 Sept 2020", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HCF (Australia) (Burwood, New South Wales) in Sept 2020", "Interview Descriptions": "Two weeks get the offer and rejected me because failed in background check without any reason. Don’t waste time on it I reject my another job because they offer me the full time position.", "Interview Questions": "Some basic behavior questions but they ask a lot"}, {"date": "4 Nov 2019", "title": "Email Marketing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at HCF (Australia) (Sydney) in Jul 2019", "Interview Descriptions": "I was shown this contract role by a recruiter who set up the interview. The 1 and only interview I had included the hiring manager and the HR lady, and they took turns asking me questions. It was very very thorough and I felt like I was being grilled for 60 minutes. They said the recruiter would get back to me with the outcome but they never did.", "Interview Questions": "What qualities are you looking for in a manager?"}, {"date": "7 Apr 2019", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HCF (Australia) (Sydney) in Mar 2019", "Interview Descriptions": "Long process. Video interview n if you clear that then face to face interview process which involved group activity and role play.\r\nTook about 3 hrs in the office. N a few good weeks until the final results", "Interview Questions": "Why HCF? \r\nSTAR based questions like take us through a time when you received constructive feedback \r\nDid you ever go above and beyond for a customer. Tell us how?"}, {"date": "24 Nov 2019", "title": "Senior Project Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at HCF (Australia) (Sydney) in Feb 2019", "Interview Descriptions": "Very poor. Poor preparation from HCF HR staff led to a confusing and below par interview experience. I was contacted by the HR department who seemed a little unprepared about why they were contacting me, which seemed strange. The questions they asked me on the phone were unplanned and delivered without compassion or confidence. In short, this was a very poor introduction to the company.", "Interview Questions": "Very basic questions, all read from a pre-determined sheet. No innovation, just a box ticking approach to interview questions."}, {"date": "31 Jan 2019", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at HCF (Australia) (Sydney) in Jan 2019", "Interview Descriptions": "It was one hour of getting to know me, about the role, behavioural questions and an exercise. Unfortunately the position base location was not as advertised so I went through an interview to be rejected. It took 1.5 weeks to know in total and there was a survey to fill out about the experience.", "Interview Questions": "What was one situation where you had to go above and beyond?"}, {"date": "18 Nov 2021", "title": "Customer Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HCF (Australia) (Sydney) in Dec 2018", "Interview Descriptions": "After applying through Seek, I received an invite to a video interview which asked multiple questions and then allowed space for you to record your answer (you couldn’t re-record so best to be as prepared as possible). Once this was submitted I received a face to face interview in head office with HR and the regional manager. It was very straightforward, asked scenario based questions around sales, service etc. HR were wonderful and professional to deal with throughout the whole process from start to finish.", "Interview Questions": "Talk me through what interests you about a role with HCF"}, {"date": "18 Apr 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCF (Australia) (Sydney)", "Interview Descriptions": "Felt as though interview itself could've been handled better.. it was a 1 hour interview of solely them just asking me question after question. No breaks/ ice breakers or any other conversation. Also noted very repetitive questions..", "Interview Questions": "How do you prioritise daily tasks?"}], [{"date": "24 Oct 2017", "title": "TA Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at HCF (Australia) in Sept 2016", "Interview Descriptions": "The process was fantastic, the timeframe between the first and second interview was quick. The hiring managers were transparent and welcoming. It was a structured interview but became quite conversational towards the end. Overall a good experience.", "Interview Questions": "What do you know about HCF?"}, {"date": "8 Nov 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at HCF (Australia) (Sydney) in Feb 2016", "Interview Descriptions": "first interview was with a recruiter then with PMO manager. whole process went very quick as they needed someone to start very soon. it was an easy straightforward process which took around two weeks from the first interview till I got the offer", "Interview Questions": "How I managed project in the past, what are my qualifications "}, {"date": "13 Dec 2016", "title": "Customer Service Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at HCF (Australia) (Sydney) in Apr 2012", "Interview Descriptions": "Through a recruitment company initially. Met with the manager and his assistant sat and had a nice long chat for about an hour before they thanked me. Good behaviour based questions with realistic answers to my questions about the role and company. Good time frames for response. They were obviously eager to hire as I received an offer the next day. \r\n\r\nOverall, not as structured as I know some companies are with their recruitment process and I was surprised that such a large company was nimble enough to make an offer so quickly. Normal bureaucracy is clearly reserved for once you are an existing employee.", "Interview Questions": "Behaviour based"}]]