[[{"date": "23 Aug 2022", "title": "Exams Invigilator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at British Council", "Interview Descriptions": "It's a very easy interview, they ask you a few questions over the phone then you attend a video call interview on zoom if you passed it you get accepted", "Interview Questions": "Introduction of yourself and work experience"}, {"date": "7 Mar 2022", "title": "Exam Invigilator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "Phone interview was easy . Asking about academic education.How I knew about the job.I was a bit worry but it passed well.I have online interview .I will be an exciting experience .I hope so", "Interview Questions": "Tell us about your experience as a teacher"}, {"date": "21 Feb 2022", "title": "Exam Invigilator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Council (Cairo, Cairo Governorate) in Feb 2022", "Interview Descriptions": "It was an easy interview. Just several questions about how to deal with the situation or to tell them about a situation you had before like how do you manage your time and how to deal with angry customer", "Interview Questions": "How to deal with one doesn't like you?"}, {"date": "22 Jan 2022", "title": "Exams Services Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "Usually it starts with filling the application form, it is important that the applicant fill the information correctly and update sufficient information in the personal statement. \r\nafter initial screening is completed, it is set forward for an interview", "Interview Questions": "First question is usually about the past experience, professional development that are relevant to the job, so make this very well prepared"}, {"date": "17 Sept 2021", "title": "Exams Invigilator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "20 mins  interview of personal normal questions like experience and availability with 3 HRs and entered with 2 other  candidates at the office which lies in Agouza,Cairo,Egypt .\nThe interview went smoothly and I was free to enquire or ask about anything.", "Interview Questions": "1-Having customer service experience ?\n2- How many available days are you ?\n"}, {"date": "11 Apr 2021", "title": "Contact Centre Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council in Apr 2021", "Interview Descriptions": "Via video conference, the video conference app is Microsoft Teams.  A panel of three,  Contact Centre Manager, Contact Centre Supervisor, and an HR Recruiter.  Competency-based interview, the duration is 45 minutes.", "Interview Questions": "How would you deliver negative or bad news?"}, {"date": "22 Apr 2021", "title": "Invigilator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Council (Cairo, Cairo Governorate) in Apr 2021", "Interview Descriptions": "Easy. Application then an online interview due to COVID. I got word about 2 weeks late that I got accepted. They ask general questions. About your past education and they set case scenarios and ask you what you would do. I dont think that there is a right and wrong answer.", "Interview Questions": "Check up above I added some details "}, {"date": "24 Mar 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "Online interview  with managers ,  ff sdfsfsd fededw efefwv ffrm efgrf safdacf dfsdgsg fgsgsf sgds gg sdg gs sg sgsd g gdg sgs gss gsgsg sgsdg sggsgdds gssgsfggfg sgsgf gsgssg", "Interview Questions": " how to work under stress \n"}, {"date": "24 Sept 2019", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (Cairo, Cairo Governorate) in Feb 2019", "Interview Descriptions": "It was smooth, Great, Charming, Wonderful in a great way that will reflect your whole way of seeing the whole  perspective as it was  very smooth  how ever this thing is not a very great thing but in a different way it was a great thing", "Interview Questions": "Introduce yourself"}, {"date": "14 Nov 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Council in Oct 2018", "Interview Descriptions": "The process took three weeks after filling their electronic application, I have been contacted by their HR representative, who has promised to assist me with any difficulties; yet, she did not even reply my email asking for a certain assistant.\r\n\r\nAs arriving at the British Council, I had to wait till the team of three interviews arrives. The program manager and assistant introduced themselves, except for the HR representative who remained unfriendly.\r\n\r\nThe interview estimated time was between 30 t0 45 minutes, moreover, the feedback took 7 business days with an email with the \"promise\" to giving me a fell feedback, still no reply as a form of the continuous unethical response of the HR.", "Interview Questions": "Please introduce yourself?\r\n"}], [{"date": "14 Nov 2018", "title": "Programs Manager - Arts Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Council (Cairo, Cairo Governorate) in Oct 2018", "Interview Descriptions": "Several steps to the process including a 3 hour English test and a one hour interview with a panel composed of 3 executives. They ask you questions related to your experience.", "Interview Questions": "Why are you interested in the job and the British Council?"}, {"date": "29 Oct 2017", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council", "Interview Descriptions": "Description of the interview process: online application then an english exam (writing and reading,Grammar )then after approx one week they called me for an interview (technical interview) before i got hired", "Interview Questions": "questions like identify your self, technical questions related to the post, your greatest achievements, prior experience, and why British council etc.."}, {"date": "17 Jun 2017", "title": "Invigilator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Council (Cairo, Cairo Governorate) in Apr 2017", "Interview Descriptions": "A simple phone interview ended with an invitation to a face to face interview. It was a group of four candidates and two interviewers. Same questions for each candidate about team work, customer service, skills and experiences.the duration was about 45 minutes. They were nice and friendly.", "Interview Questions": "How would you deal with an angry customer or children ? "}, {"date": "10 Nov 2018", "title": "Higher Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Council (Cairo, Cairo Governorate) in Aug 2016", "Interview Descriptions": "I applied online. The process took 3 weeks, they sent me an email inviting me to the interview in a week time. they as well, asked me to prepare a presentation about a new exams they are having in egypt. I interviewed at British Council.", "Interview Questions": "I had a face-to-face interview with 3 interviewers, the academic head, the assistant head and the HR. After my presentation they asked questions about experience, skills, BC behaviours, problems in class and how to solve it, etc. I received a response 10 days later by email."}, {"date": "6 Mar 2016", "title": "Branch Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at British Council (Cairo, Cairo Governorate) in Feb 2016", "Interview Descriptions": "Applied online, about 2 weeks later my application was shortlisted. I was asked to attend an Aptis test to qualify for an interview. There was a panel of 3 managers interviewing me and were reading from a pre-scripted questions. it was too straightforward and only needed to memorise different examples from own experience.", "Interview Questions": "It was primarily asking for giving examples of different scenarios from my work experience."}, {"date": "8 Feb 2016", "title": "Estate and Administrative Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (Cairo, Cairo Governorate) in Dec 2015", "Interview Descriptions": "In the interview you will likely be asked questions about your teamwork skills, your interpersonal relations, your management style or your ability to work in a diverse environment. Review the job posting again and try to anticipate other likely areas of questioning, and prepare honest and concise answers that highlight relevant aspects of your work history and life experience. Remember that there may be questions you did not anticipate: when this happens, breathe and take a moment to think through your experiences to find the best answers.", "Interview Questions": "When can you start working with us?"}, {"date": "1 Jul 2019", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council (Cairo, Cairo Governorate) in Feb 2015", "Interview Descriptions": "the interview was a panel of 3 people. the interview was 7 questions; 2 technical questions, 2 introductory questions and some behavioural questions for 45 minutes. the hiring process is good.", "Interview Questions": "introduce yourself"}, {"date": "9 Nov 2015", "title": "YLA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (Cairo, Cairo Governorate) in Sept 2014", "Interview Descriptions": "It was nice and easy. They were basically testing my English speaking and my experience with children. It was fast, took no more than 15 mins and we were done.", "Interview Questions": "Do you have previous experience in working with children?"}]]