[[{"date": "1 May 2023", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Santa Rosa Junior College (Santa Rosa, CA)", "Interview Descriptions": "Interview consisted of a sample lesson and round of questions from interview panel. The questions were given 15 minutes prior to interview. The sample lesson assignment was given about a week (maybe less?) prior to in person interview.", "Interview Questions": "Asked about teaching methods, lesson content, and diversity in students. (Diversity question felt very broad.)"}, {"date": "25 Oct 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Rosa Junior College", "Interview Descriptions": "Received interview a month after submitting application, it was clear at the interview that they had already pre-selected a candidate and I was a filler, not actually being considered. Two people (out of five) on the panel were very nice. It was a waste of time to put in preparation when I was not genuinely considered.", "Interview Questions": "N/A"}, {"date": "31 May 2022", "title": "Bookstore Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in Sept 2019", "Interview Descriptions": "Friendly and collaborative, no complaints or issues whatsoever with the team performing the interview, the subsequent interactions, etc. Flexible on timings and availability, and generally helped make the process much easier than I've experienced elsewhere.", "Interview Questions": "Whether you have any prior experience at the register/stocking/etc."}, {"date": "9 Oct 2022", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in Apr 2018", "Interview Descriptions": "Initial interview with department members including questions about discipline expertise, student report, and administrative experience. If selected second interview with administrators including questions about institutional fit. All interviewees are asked the same questions by the same faculty members in the same order. For some departments a teaching demonstration is included in the first interview.", "Interview Questions": "Describe your experience working with diverse student populations. What obstacles did you encounter? What strategies have you developed to meet the needs of a diverse student population?"}, {"date": "12 May 2022", "title": "Network Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in Mar 2018", "Interview Descriptions": "Great questions, relaxed interview with good people. I felt welcome and didn't feel pressured to answer questions quickly. Seemed like they were looking for someone who would be able to jump in quickly.", "Interview Questions": "How would you check a users computer for their current IP address and how would you renew it if it were a DHCP address."}, {"date": "27 Oct 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Rosa Junior College (San Francisco, CA) in Jan 2016", "Interview Descriptions": "Got a call from Manager about job and it was explained in detail I was offered the job a few days later.  Very simple interview. Interviewed by 5 people before being hired.", "Interview Questions": "Tell us about yourself"}, {"date": "31 Dec 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in Dec 2015", "Interview Descriptions": "Applicants first submit applications on the government jobs.com web site before October 30 of each year.  In early December, you then get a call to see if you are still interested in interviewing.  Each interview lasts one hour.  You arrive 15 minutes early to review a list of 10 questions that are given to every applicant.  The interview itself consists of 45 minutes to answer the questions and a 10 minute teaching demonstration.  You are on the clock.", "Interview Questions": "What skills do you bring that qualify you to teach in this field?"}, {"date": "22 Apr 2015", "title": "Director of Distance Learning Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Santa Rosa Junior College (Madison, WI) in Apr 2015", "Interview Descriptions": "Interview with committee by Skype after a written exercise and time to review questions. Gave presentation and then answered scripted questions. They had not done a Skype interview before, but in spite of this dealt with technical difficulties well and seemed natural. Questions were clear, and there was a time keeper on the panel who gave a one minute warning as well as had an alarm that marked the 5 minute ending.\r\nThis is a job interview process that has not concluded yet. I am waiting to hear from them this week. The next step would be to fly to California and meet administration.", "Interview Questions": "How would I ensure accessible learning for all students online?"}, {"date": "15 Oct 2016", "title": "Administrative Assistant- Health Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in Feb 2015", "Interview Descriptions": "I checked in about 5 minutes prior to my interview and was shown to a conference room and given a list of questions they would be asking in the interview. I was able to take notes and consider the questions prior to being asked them in the actual interview. A bit later, one of the interviewers came to get me and we went to another conference room where five people were present that would be conducting the interview. They asked me the questions on the list, along with a few more that were prompted by my answers, and then asked if I had any questions from them. Everyone was kind and made me feel comfortable.", "Interview Questions": "Tell us about a difficult situation you have encountered in a customer service setting and how did you handle it?"}, {"date": "15 Apr 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Santa Rosa Junior College (Santa Rosa, CA)", "Interview Descriptions": "Submitted detailed application and college transcripts.  After a month or two a panel interview was set up and a standard list of questions that were the same for everybody was given.  There was very little or no conversation it was just question and answers.  Then we were asked to give a 5 minute lecture /lesson to demonstrate our teaching abilities.", "Interview Questions": "The questions were not as difficult as the format which is very formal and rigid.  I served on an interview panel and it is very nerve wracking for the interviewers too as we have to follow the strict rules laid down by the college."}], [{"date": "10 Sept 2015", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in May 2013", "Interview Descriptions": "I interviewed with a hiring committee.  They had 10 questions they give you 10 minutes before the interview.  They asked about my prior experience. I had to give a teaching demo at the end.  The interview was timed and lasted about an hour.  I met with the dean and other instructors in the department.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 May 2012", "title": "MANAGER, CAMPUS DATA/TELECOMMUNICATIONS Information Technology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Santa Rosa Junior College (Santa Rosa, CA) in Mar 2012", "Interview Descriptions": "From an initial pool of nine applicants, five were selected for a group/panel interview, that included a 10 minute presentation and 50 minutes of q&a. A separate 30 minute writing exercise was given that same day. The next round, for which two were selected, was an interview with the hiring manager. The final interview was with the college president. The college is a \"union shop\", so anyone managing hourly employees in that environment needs to be prepared for that.", "Interview Questions": "Describe your experience with Enterprise-level CISCO network systems."}]]