[[{"date": "11 May 2023", "title": "Head of Resourcing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Royal British Legion (London, England) in Apr 2023", "Interview Descriptions": "The recruitment process involved an initial interview over Teams, followed by a psychometric test, a face-to-face interview, and a final interview that required me to give a presentation and meet with other directors. The interviewers were all very professional and genuinely interested in learning about me and my background. The interviews themselves were engaging and thoughtful. After the final round, I received feedback from the Director of Organisational Development and Culture, who was very kind and helpful. Although I was disappointed not to have received a job offer, I can say that I had the best possible experience with this interview process.", "Interview Questions": "Competency-based questions during the interview process were very well-handled. They made me feel comfortable and at ease throughout."}, {"date": "28 Sept 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal British Legion", "Interview Descriptions": "2 person interview. Quite easy going and friendly.  Made me feel comfortable. Took about an hour. Mostly talked about how my previous experience linked to the vacancy. Spoke about the Department and the people I'd be working with.", "Interview Questions": "Link the main job requirements to your career experience."}, {"date": "31 Jul 2022", "title": "Head of Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Royal British Legion", "Interview Descriptions": "There were three interviews, slowly reducing the number of applicants. The final interview required each candidate to do a powerpoint presentation on a given topic to a board of senior people within the RBL, who then asked questions.", "Interview Questions": "What is your experience working with veterans?"}, {"date": "2 Sept 2022", "title": "Membership Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Royal British Legion in Jun 2022", "Interview Descriptions": "Online interview with the department head and a current trainer of membership.\r\nHad to deliver a presentation with a discussion afterwards, then answered different types of questions.\r\nRelatively informal, felt relaxed and positive.", "Interview Questions": "The interview was back in June and I have forgotten the questions. \r\nNothing difficult."}, {"date": "22 Apr 2022", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Royal British Legion (London, England) in Mar 2022", "Interview Descriptions": "The process after application was not clear from the offset, I was sent details asking me to select a time I would like to attend the interview, however there was no confirmation where this was being held, if online or f2f.  I had to request confirmation that the interview was virtual which when I received the response was still not clear .... talk about making hard work of the process.\r\n\r\nThe virtual interview was ok a standard competency based role, however I am not sure they really knew what they wanted the role to be as it was new to the organisation.\r\n\r\nFollowing the interview, nothing !! not even a thank you for your time you have been unsuccessful - so thankfully I didn't get to work for RBL", "Interview Questions": "N/A"}, {"date": "10 Jan 2022", "title": "IT Service Desk Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Royal British Legion", "Interview Descriptions": "good review as it was a good internview\r\nlots of value based questions asked and what I could bring to the company and so on\r\nrelaly neice manager and team seem really friendsly and young too", "Interview Questions": "really good and technical in depth "}, {"date": "8 Apr 2019", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Royal British Legion", "Interview Descriptions": "Fairly standard interview with most common interview questions asked . most of them were competency based questions. giving examples at of past experience matches with the job description of current role", "Interview Questions": "Tell us about when you challenged budget holder"}], [{"date": "2 Aug 2018", "title": "Head of Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal British Legion (London, England)", "Interview Descriptions": "It was a smooth and friendly interview process involving a brief presentation and an panel interview with several stakeholders. The instructions beforehand were delivered promptly and efficiently and I was notified fairly quickly afterwards about the outcome of the interview.", "Interview Questions": "Did I understand the organisation and its beneficiaries? "}, {"date": "17 Feb 2020", "title": "Administrative Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Royal British Legion (Weston-super-Mare, England) in Aug 2018", "Interview Descriptions": "Was notified of interview within a week of applying, Very formal, was asked questions in direct connection with job role, was asked if I had any questions. Heard back about a week and a half after the interview,", "Interview Questions": "Do you have any experience with key programming systems such as SALTO"}, {"date": "9 May 2018", "title": "Living Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal British Legion", "Interview Descriptions": "I did not receive an email from their ATS inviting me to interview. This lead to a 4pm phone call the day before the interview asking me whether I could attend. I had to quickly arrange time off from my current job to be able to attend the interview.\r\n\r\nSince interviewing I've had no feedback. In my opinion, it's pretty rude to not even send a decline email to someone who spent the time and effort to visit your office in person for an interview.", "Interview Questions": "What do you know about what RBL do?"}, {"date": "20 Mar 2018", "title": "PMO Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal British Legion (London, England)", "Interview Descriptions": "Initial communication was due to be via an HR portal which failed before interview was booked. The HR member of staff who took over was polite and effective. Interview was part scenario, part presentation and part competency questions. No feedback was given post interview; the decision was provided via form email from a do-not-reply address.", "Interview Questions": "What do you know about what RBL does?"}, {"date": "12 Feb 2018", "title": "Great Pilgrimage 90 Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Royal British Legion (London, England) in Feb 2018", "Interview Descriptions": "Applied online, got an invite to interview the following day. Went to the interview, panel of 2. I was told a little about the job. Was asked a bunch of questions and once that was done I was taken to a room to do a writing task. Email received next working day, didn't get the job.", "Interview Questions": "What do you know about us"}, {"date": "17 Feb 2018", "title": "Assistant Outsourced Breaks Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal British Legion (Southport, England) in Dec 2017", "Interview Descriptions": "I submitted an application and CV and was soon after invited to interview. The interviewers were a panel of two: one the line line manager (K) for the role, the other her manager (G) who is normally based in London. \n“G” opened the interview by saying that no matter the outcome I had still produced a very high standard application which led me to understand the job was already spoken for.", "Interview Questions": "I was asked what I knew of the RBL and the role. I was asked to provide examples of my organisational skills and team working. \n\nIt was difficult to know what they were looking for as the questions followed on from the opening line. \n\nAt the end G had to be reminded by K to ask whether I had any questions. \n\nThe feedback I had was that I came down to the last two, am very experienced, hold RBL values highly and am well organised, however the job was offered to someone who is organised."}, {"date": "18 Sept 2017", "title": "Business Analyst - Intranet Replacement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Royal British Legion (London, England) in Sept 2017", "Interview Descriptions": "Application process\r\nRequest to submit my CV but recruitment consultant. Was warned the client were very picky\r\n\r\nInterview was scheduled at 11 o'clock. I arrived 15 minutes early and sat in reception and the interview started at 11:20. They were 20 minutes late with no apology whatsoever.\r\n\r\n\r\nFirst and final stage  with  (CIO) and  (Internals Communications and Engagement Manager). Was told by the interviewers interview would last 30 minutes.\r\n\r\nCommunications manager explained interview structure (preplanned questions) and then asked if I had any questions to be begin. Explained that I would prefer to run through questions as the interview proceeds so the interview is more of a 2 way conversation and they happily agreed with that.\r\n\r\nWas asked to name the companies I had delivered intranets, as my cv documented this heavily (all of my contract roles had involved intranet replacements) but I listed the names and they seemed satisfied. \r\n\r\nAnswered questions, gave examples where allowed,\r\n\r\nThe CIO made a strange comment towards the end of the interview on how they are looking for interims rather than contractors, that I was more of an interim that takes pride in their delivery. I took that as a compliment but I interviewed for the role as a contractor.\r\n\r\n \r\nFeedback from the agency, the loveliest recruitment consultant who said he was at the end of his tether with the client was they (the client) didn't believe I would be able to deliver/cope.  The recruitment consultant said he was shocked at their feedback as from my experience I had evidence of having delivered the same project over and over again, the agencies thoughts was that this feedback was generic.\r\n\r\nI considered this feedback to be Slanderous as my experience to-date at all of my contracts comes with references of having delivered. Taking into consideration their view on \"constructive feedback\" and their current reviews on Glassdoor I would go so far as to say this company may not be best environment to work in. I received an offer of employment on the same day I received this feedback, it pays more and is in the Private sector which is a place where I think I will stay.", "Interview Questions": "List the name of the companies that you have launched Intranets with, just give me the company names."}, {"date": "14 Jun 2018", "title": "Senior Digital Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Royal British Legion (London, England) in Jul 2017", "Interview Descriptions": "60 minute interview followed by a knowledge test. The face-to-face interview went very well, and the chemistry was good, the interviewers (2 of them) were very structured and followed a form to carry the interview through (literally by the book type approach). I was sent to a separate office to complete a skills & knowledge test that took about 15-20 minutes. \r\nThe outcome was negative and the only feedback was that I failed the test. No details, no information, therefore no chance to develop myself better. The least a potential employer can do for a candidate is provide relevant feedback for further development.", "Interview Questions": "What achievement are you most proud of?"}, {"date": "11 Oct 2018", "title": "Finance Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Royal British Legion (London, England) in Sept 2016", "Interview Descriptions": "One interview for a contractor with my future line manager and her line manager. Took about 1 hour. Nothing too complex, just about the role of the finance business partner and what they should be doing.", "Interview Questions": "What I thought was the role of a finance business partner."}, {"date": "13 Apr 2017", "title": "Human Resources Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Royal British Legion in Mar 2016", "Interview Descriptions": "A one stage interview, the process took one week, I was contacted by a recruitment agency. Questions about administration and your experience. The atmosphere was easy going and friendly. I enjoyed the interview, and so did the interviewer. I felt relaxed and the questions were at a comfortable level.", "Interview Questions": "Where I had worked before, what are your strenghts and weaknesses"}], [{"date": "11 Oct 2016", "title": "Advice and Information Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal British Legion (Birmingham, England) in Mar 2015", "Interview Descriptions": "The interview is split into two parts. The first part is a situational test, where you identify the support required for an ex soldier. It is broken into separate tasks.\r\n\r\nThe second part is a one hour competency based interview with an Area Manager and Team Leader. They use the STAR technique.", "Interview Questions": "Describe a situation when you had to... all questions are based on the competencies framework."}, {"date": "28 Sept 2017", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Royal British Legion (London, England) in May 2014", "Interview Descriptions": "Face to face interview with three panel members only one of whom seemed to have technical knowledge.  Initial questions featured mainly around my background and where I grew up making me feel awkward and colour conscious but the interviews seemed unaware of this. technical questions on the other hand were reasonably straight forward.", "Interview Questions": "Details of work history and technical knowledge. Hardware used."}, {"date": "26 Mar 2014", "title": "Testing Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Royal British Legion (London, England) in Nov 2013", "Interview Descriptions": "2 stage. HR and dept head.", "Interview Questions": "None. Interviewer barely had a grasp of the subject"}, {"date": "1 May 2015", "title": "Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Royal British Legion in Oct 2013", "Interview Descriptions": "Female manager taking the interview seemed a complete numpty and didn't seem to have any prepared questions and seemed to be totally non technical. Whole process took less than thirty minutes.", "Interview Questions": "Where I had worked before"}]]