[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Mar 2021", "job_title": "Data Specialist in Saint Louis, MO", "duration": "N/A", "pros": "12 Hour shifts, good pay, good experience", "cons": "Rude nurses, bad management, work Holidays"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "AICU", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Mar 2023", "job_title": "Data Specialist in Saint Louis, MO", "duration": "N/A", "pros": "Great learning opportunities, benefits, and a some what flexible schedule", "cons": "Can’t think of any besides some issues with management while I was there"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Salary not as expected", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Mar 2021", "job_title": "Clinical Strategist in Saint Louis, MO", "duration": "N/A", "pros": "friendly staff and HR was helpful", "cons": "low salary-minimal opportunities for advacement"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Yes", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Dec 2020", "job_title": "Registered Nurse, Critical Care in Houston, TX", "duration": "N/A", "pros": "The job is very manageable with good compensation", "cons": "There are no cons worth mentioning"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "I would double think twice before signing up", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Jan 2016", "job_title": "Critical Care RN in Saint Louis, MO", "duration": "N/A", "pros": "The easiest \"nursing\" job there is. The office and surroundings are clean, new and better than any nurses station or pod  out there.  To have an honest 60 min lunch break , I thought I had gone to heaven.", "cons": "For the education and certifications they require the pay is no where near what it should be. The work environment is unbelievably hostile, NOT from management ,that is another issue, but from the hoard of unpleasant , unhappy and a few just down right mean women,  who truly perpetuate the notion of nursing eating their young, particularly the herd on the night staff.  The \" high tech\" equipment is in such a state  of haphazard assembly, disrepair and shoddily maintained at best its a wonder it worked at all. There is NO  standardization, NO accountablity,  NO communication, There was a cloud of artificially created tension, trauma and drama for no reason what so ever, I could go on,,,,,,"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Apply elsewhere", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2020", "job_title": "Telemetry Tech in Saint Louis, MO", "duration": "N/A", "pros": "Pay and self schedule, that’s it!", "cons": "Literally EVERYTHING! Horrible place to work."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Horrible company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Apr 2019", "job_title": "Nurse in Saint Louis, MO", "duration": "N/A", "pros": "Pay and benefit. 3 day work schedule", "cons": "Everything else, this company has so many issues that it would take way to long to explain. This company doesnnot follow their own policies. They are rude and  talk to you in condensing ways. The company appears to have favoritism to certain people and clearly shows it without regard. The company allows you to do your schedule but gives you what they want and will change your schedule withoit notifiying you. This company opened a new deparment for telemetry, I’ve seen people almost loss their job or position with forever changing policies to meet their agenda. The company hires family and friends and allows them to get away with just about anything. If a mistake is made, they are confrontrational and unprofessional. Management is allof and disrespectful to most of its employees. There is a lot of inappropriate language. Low morall conversations that occurs. The work load is extremely large with little to no teamwork. But the pay is good."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "not happy", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Mar 2016", "job_title": "Staff Nurse in Saint Louis, MO", "duration": "N/A", "pros": "Nice building.  One hour paid lunch", "cons": "Horrible and hostile work environment, cheap chairs, favoritism, poor salary, Mercy cliques, lazy charge nurses, and nurse turnover is the worst ever (losing at least 25 nurses over 6 months). HR and management do not seem to care.  This company cannot keep its staff and there is no opportunity for advancement."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Medical Staff Office", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 May 2019", "job_title": "Credentialing Specialist in Saint Louis, MO", "duration": "N/A", "pros": "Departmental focus on accuracy, consistency and meeting company needs. New management has brought in a wealth of knowledge which teamed with new MSO members has  helped bring the department up to speed, implement new software and incorporate educational workshops. Located in the City Place buildings so there is access to a cafe,  free gym access and invites to building events like BBQ lunch and Flu Vaccinations.", "cons": "No cons even worth commenting on."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "A Case Study In Tone-Deaf Leadership and Business Failure", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Feb 2016", "job_title": "Tele-ICU RN in Saint Louis, MO", "duration": "N/A", "pros": "One hour paid lunch, shift report takes just a couple minutes, can do the minimum and get away with it... relatively a non-physical job.", "cons": "Clinicians are treated like expenses and a mere inconvenience. Self-scheduling is anything but that. Chronic understaffing. Cronyism. Threatening ultimatums from management. Company touts critical care expertise but caters to client staff who are inefficient clinically and abuse our services by asking for things that aren't steeped in evidence-based practice. Providers encouraged to cater to these wishes in order to make clients happy rather than improving patient care. Orientation process states a patient ratio of 45 patients per nurse. 99% of the time, you wind up with 60+ patients, which not only complicates your workflow but prevents us from doing the service we've been hired to do. RNs are tasked with obtaining a CCRN or \"willing to obtain\" a CCRN certification within 4 months of hire. However, if you don't pass the exam, you will be given a deadline to pass or be placed on unpaid leave... and if you're less than a year into the job, you'll be responsible for hundreds of dollars in licensing fees. Promotions are given to those who excel in brownnosing rather than those who offer realistic solutions. Highly technical position with perpetual IT problems that impair the ability to do the job."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Convinced to never get sick again", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Oct 2017", "job_title": "Anonymous Employee in Saint Louis, MO", "duration": "N/A", "pros": "Really cool field, with some amazing implementations, and there have been some cool and talented people who have worked there.  The things they could accomplish with their technology are astounding.  Sadly, management, and a now sick corporate culture has convinced most of the good employees to leave, and they have given up on providing patients with care, for chasing dollar signs, and/or selling the company.", "cons": "This list is far too long to fill out properly in a timely manner.   Where to start?\r\n-Tone deaf management.  Upper management has been replaced, and cronyism-ed so badly, that no one can tell management what is wrong, or the most efficient way to do something.  When someone in upper management has an idea, that is the policy you will take, especially to the detriment to... everyone and everything.  \r\n-understaffed, and overworked clinical staff.  The company has grown double within the last couple years, in terms of bedsides monitored, but have not grown the number of doctors per bedside sufficiently enough to make it worth-while.  \r\n-Nursing staff has terrible turn-over, due to poor management.  Nursing management is often overbearing, aggressive, and out-of-touch with how everything actually works.  \r\n-Doctors, though over provisioned for hospital beds, are also treated like mini-gods.  Some Doctors expected to be catered to for everything, including forcing -other doctors- to move stations, so that particular doctor could sit at his 'favorite' station.  (Not inconsequential since it takes about 20 minutes to log in and get set up).\r\n-Clinical Support Staff (Effectively IT helpdesk) is mostly useless.  there are 1 or 2 technicians who seem to want to help, but most of them take zero initiative to fix or follow through a issue, they just act as a phone receptionist for IT problems.  They'll 'make a ticket', and escalate it to someone higher up in IT.  Not a great solution when you're working with high risk patients all day.\r\n-Customer Account Management is a massive debacle, as none of the client account managers wants to actually manage their accounts, barely acting like anything more than a nodding head, agreeing to almost anything a client wants, even if it's not feasible.  \r\n-There are individuals in upper management brought in by nepotism who can 'do no wrong'.  Former Employees who have spoken out against them have been ostracized or completely ignored until they left the company.\r\n-IT is a shambles in general.  They've lost IT leadership 7 times, and they have, more than once, hired leadership with little to no actual IT experience, but apparently don't listen to what their reportees tell them.  Projects that should be vetted better end up in production on the operations center floor, and flounder because upper management forced them through, even though they were warned it was far from a usable product.  \r\n-Upper management has wasted money on pet projects that were doomed to failure, and were told were going to fail from day one, with every warning sign imaginable, but still spent 6 figure dollar sums and committed to multi-year service contracts, which collapsed within six months.\r\n-An HR department that was regularly antagonistic towards employees in favor of shielding upper management, leaving employees with little recourse on how to actually address problems.  \r\n-a top level manager who, in the middle of a company wide corporate call, told everyone 'we're doing well right now, but the economy hasn't quite picked up yet, and you're all lucky to have this job, and that there are plenty of people out there who would love to have a job here (or as most people took it: 'you're easily replaced').  \r\n-Pay well below the average rate for many positions inside the company, often times paying a well trained, experienced, loyal employee poorly, until they leave to make far better money with less work, and/or a better title, and then the company hires a replacement at 10-25% more than the previous employee SHOULD have been making, but with the new person having a quarter of the experience and skills necessary to do the job.\r\n-Several times, when someone would leave the company, they would just take that person's responsibilities, an instead of hiring a replacement, dumping the responsibilities on one or more other, already overworked, people.   While leaving other departments who are overstaffed and under worked completely untouched.\r\n-promoted one 'individual' to a crucial position over a department (with title change a jump up from their previous position) that is hugely important to the function of the company, when they had zero experience inside that field, and no skills that could even translate over to work in it.  crashed the entire department to a complete stand still, and was so mis-managed that I hear they are -still- trying to recover from it, even though they've fired that person and brought in someone with actual experience in that role.  The person they promoted wasn't even fired, they left for medical leave, and then quit afterwards.  They were never reprimanded for their massive failures, even when one of those failures almost shut the entire company down from a legal standpoint.  \r\n-Much of the management in the company takes credit for the ideas or work that regular employees do, but then throw those same employees under the bus if something goes awry.\r\n-For a company that relies on IT as a backbone of it's services, it drastically understaffs it's IT group, often only having one person per role, with no good backups, leaving outstanding issues sitting if someone goes on vacation.  (This happens elsewhere in the company, but IT seems to be the worst offender of this).\r\n-Top level Manager who actively worked to push out a well regarded director (who was hired under the previous Mangement), and then worked to ruin that previous directors job prospects outside of Advanced ICU Care.  \r\n-Most of upper management is from either California, or NY.  There is a real sense of superiority coming from the people in those locations over any of the other locations."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poor Management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Nov 2018", "job_title": "Anonymous Employee in Saint Louis, MO", "duration": "N/A", "pros": "Competitive pay, benefits are good, small enough company to know everyone.", "cons": "Management inexperienced, inconsistent, and has employee \"favorites\""}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Stay Clear", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jul 2016", "job_title": "Data Specialist in Creve Coeur, MO", "duration": "N/A", "pros": "Decent pay, nice building, and one hour breaks", "cons": "Extra mean coworkers, freezing temps in the monitoring center, management only cares about flawed work flow, working with minimal staff, and unrealistic expectations"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "RN", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Mar 2016", "job_title": "Registered Nurse in Saint Louis, MO", "duration": "N/A", "pros": "Technology driven, not physically stressful but mentally challenging.  Room for growth.  Fast paced.  Several locations to choose from across the country.", "cons": "No patient contact but much less physically demanding.  I am still using my ICU expertise daily."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Overwhelming place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Feb 2016", "job_title": "CCRN in Saint Louis, MO", "duration": "N/A", "pros": "Salary is decent\r\n1 hour paid lunch breaks\r\nSome of the providers are great to work with", "cons": "Ridiculous nurse to patient/provider to patient  ratios\r\nExpectations too high with no way of being successful\r\nMorale of staff is terrible\r\nNew workflows implemented often without proper training"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "The Worst!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Feb 2018", "job_title": "Anonymous Employee in Saint Louis, MO", "duration": "N/A", "pros": "The benefits are better than most.", "cons": "Management is awful! People are hired without experience to run departments they know nothing about. If they do have experience they are lacking drastically in personable and communication skills. You’ll be talked about behind your back by management and HR will do nothing. They may have one of the worst HR departments in any company I’ve worked for. Overall save yourself and keep looking. The paycheck you’ll get from this place won’t be worth it."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Different Kind of Place", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Oct 2015", "job_title": "Anonymous Employee in Saint Louis, MO", "duration": "N/A", "pros": "Fast pace, heavy workload, heavy technology environment", "cons": "Too heavy of a workload."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Credentialing Specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jan 2019", "job_title": "Credentialing Specialist in Saint Louis, MO", "duration": "N/A", "pros": "Professional department focused on teamwork to complete tasks and resolve issues. Focused on personal/team development, management appreciates input and takes the time to pass on applicable skills and information. Good benefits, paid time off, consistent schedule, professional/positive work environment.", "cons": "No complaints, absolutely love working here"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Absolutely awful", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Apr 2018", "job_title": "Support in Saint Louis, MO", "duration": "N/A", "pros": "I Was given the opportunity to collect a paycheck while looking for another job. I suggest employment elsewhere instead of dragging yourself to this place.", "cons": "Awful management . Awful HR. Miscommunications across the board. They also give out your social security numbers to phishing scams ."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Apr 2018", "job_title": "RSVP in Oklahoma City, OK", "duration": "N/A", "pros": "easy job for pretending to work while I continue searching for another job.", "cons": "senior leadership relaxes with minimal sales results which is acceptable."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Clinical Support", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Sept 2017", "job_title": "Clinical Support Specialist in Saint Louis, MO", "duration": "N/A", "pros": "High Pay, 12 hour shifts, 3 day weekend every other weekend, high shift differential", "cons": "No means for advancement, high stress situations, 24/7 office"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great job and great company!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Aug 2019", "job_title": "Telemetry Technician in Houston, TX", "duration": "N/A", "pros": "Salary, co-workers, and casual environment!", "cons": "I do not have any cons so far."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Hostile work environment", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Aug 2015", "job_title": "Anonymous Employee in Saint Louis, MO", "duration": "N/A", "pros": "Rapidly expanding and growing company", "cons": "Company only worries about hiring upper management and not the actual workers who have to do the work."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2019", "job_title": "Mso in Saint Louis, MO", "duration": "N/A", "pros": "Great people to work with, growing company", "cons": "No opportunity to work remotely at this time"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Houston", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Dec 2019", "job_title": "Telemetry Tech in Houston, TX", "duration": "N/A", "pros": "Pay, benefits, environment, coworkers, schedule", "cons": "discount benefits, location, workload, average pay"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Wonderful Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Aug 2020", "job_title": "Non- Clinical Position in Saint Louis, MO", "duration": "N/A", "pros": "Benefits, work/life balance, upward mobility, leadership, communication", "cons": "No cons at the moment"}]]