[[{"date": "19 May 2023", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "one interview with supervisor for about one hour, pretty smooth process. also talked with a phd student that I will be working with. was given a week to make my dicision.", "Interview Questions": "my past projects and my research plans"}, {"date": "6 Apr 2023", "title": "Teacher Assistance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "no interview, you can apply directly to the teacher. The teacher will also email past students when there are positions available. You can contact your teacher when there is the position available.", "Interview Questions": "How's your record in the past courses."}, {"date": "5 Oct 2022", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "It was one interview with two supervisors. The process took around 40 minutes. After the interview I asked the results two weeks after and they told me that they were still in the process. Then I heard nothing from it. In the end, I found the position filled without noticing me that they have made this decision.", "Interview Questions": "Why you apply this position."}, {"date": "29 Jul 2021", "title": "Phd Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "The interview was short, effective and not stressful at all. \nThe interview had two parts. The follow-ups though were hard and stressful. But my motivation and follow-ups finally worked and I got an offer for two positions which I could chose from.", "Interview Questions": "Why do you think you can perform well in this position. "}, {"date": "4 Jul 2021", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Apr 2021", "Interview Descriptions": "Long (80 min.) interview with some tough but fair questions, both regarding personality and field-specific knowledge. Enough time for my own questions. Overall more relaxed atmosphere once the tough questions were done.", "Interview Questions": "What would you do if you are stuck with your research?"}, {"date": "13 Mar 2021", "title": "MSC Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "Cover letter: give an overiew of you personality and present all  the required documentation rearding your previous university studies and english proficiency. Focus also on your academic interestes and the reasons why you are applying.", "Interview Questions": "There was no interview for the admission"}, {"date": "26 Feb 2021", "title": "PhD Student Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Feb 2021", "Interview Descriptions": "The interview process is an absolute sham.\nThe interviewer rejected me because I had lacking communication skills. And gave me the example of forgetting to say hi. The professors are super spoiled and racist and seek every opportunity to reject you if you are not European.", "Interview Questions": "Questions about algorithms, machine learning, etc."}, {"date": "13 Oct 2020", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "Short and friendly the focus was on finding a good personal fit and discussing my background. The interview was more about them selling the job than me selling myself.", "Interview Questions": "Why do you want to be an ambassador for KTH? "}, {"date": "29 Nov 2020", "title": "Phd Student In Sustainable Power Systems With Smart Converters Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Oct 2020", "Interview Descriptions": "Not professional at all. Supervisor was wearing pijamas during the interview process. Very biased interview. I felt the supervisor was interviewing just to follow the protocol, as she had probably chosen a candidate beforehand. I was told my age was an issue (I am 30 years old with 5 years experience on the field, which is ridiculous)", "Interview Questions": "Q1: Tell me about yourself\r\nQ2: What would you like to do after Phd?"}, {"date": "9 Jul 2020", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "The first interview was held online. The project was explained and I was asked about my previous experience and skills. The tone was very welcoming and reassuring. An in person interview was conducted a few weeks later.", "Interview Questions": "Why do you want this position"}], [{"date": "13 Aug 2020", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Jun 2020", "Interview Descriptions": "Professional, fast and clear procedure.\nThey were very fast to respond my email after the interview. Although I did not get the offer, they gave me constructive feedback. Questions were mostly related to personality and had nothing to do with my knowledge in the area.", "Interview Questions": "Have you had any conflict with a former colleague? What was it about and how did you handle that. "}, {"date": "1 Feb 2020", "title": "PhD Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "I was brought to KTH for the interview. KTH paid for the flights as well as the hotel I stayed for two days. The interview was pleasant, I talked with a lot of people and had to chance to learn about the working environment.", "Interview Questions": "To present my work"}, {"date": "15 Jan 2021", "title": "Thesis Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at KTH Royal Institute of Technology in Jan 2020", "Interview Descriptions": "I did three interviews. the first interview was about my general question regarding my background history and education background. The second interview was with professor that was technical questions and how to solve problems.", "Interview Questions": "what is the strongest and weak side of you ?"}, {"date": "23 Jun 2023", "title": "Masters Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Nov 2019", "Interview Descriptions": "questions about interests, reasons for wanting to work here. Split over two different sessions, both on zoom and also one introduction to campus. Took a bit over 2 weeks to complete the whole process", "Interview Questions": "Blach Scholes equation, Machine learning models"}, {"date": "23 Oct 2019", "title": "PhD Candidate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Sept 2019", "Interview Descriptions": "I had the one-hour-long skype interview with the supervisor of the thesis. The time slot for the interview was firstly confirmed with me. I had a pleasant experience during the interview.", "Interview Questions": "About the previous research. Basic knowledge regarding the thesis you have applied for."}, {"date": "22 Jul 2019", "title": "Research Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "Working on my master's thesis with the professor made the interview process easy. The interview process involved discussions about the novelty and applications of my master's thesis work. The interviewer also asked about relevant projects I had worked on in the past.", "Interview Questions": "Explain your master's thesis?"}, {"date": "23 Jul 2019", "title": "PhD Student Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Jun 2019", "Interview Descriptions": "I was contacted by email well over 1 month after the deadline and asked to do a Skype interview in the same week. I was told in advance an HR representative would be present in the interview, but then I was told that \"she was sick\" and it was just the Professor and a current student of his.\r\n\r\nI was told I was the first of 5 to be interviewed and that they would make a decision of who to invite for in-person interview in a 2 weeks time.\r\n\r\nI waited 3 weeks and nothing happened. I emailed the Professor twice one week apart and my emails got completely ignored. \r\nI called the Professor 5 weeks after the interview and he told me he had been on vacation for the past two weeks and that he had already selected other candidates and I was, effectively, rejected.\r\n\r\nBy far the worst (and longest) experience I have ever had applying for a job. Never have I ever been treated with more disregard and  less consideration than here.", "Interview Questions": "Practical lab experience\r\nKnowledge of microbial based processes \r\nDo you know Metabolic Flux Analysis?\r\nHow you deal with stress\r\nDo you like working in a team\r\nWhat is your ideal supervisor"}, {"date": "3 Sept 2018", "title": "Ph D Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm)", "Interview Descriptions": "The interview was performed with skype and it was composed of two step interview.\nFirst of interview was about gernaral question such as why you want to purse your Ph.D etc.\nSecond of intewview was to review research papaer published in international journal. Those papers was sent to my email from supervisor before proceeding the second interview.", "Interview Questions": "why you purse your PhD programme?"}, {"date": "7 Sept 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm)", "Interview Descriptions": "The employer explained about the department and the future plans for the department.\r\nThen had a look over my resume and started to ask question from that. He also gave me a chance to ask question regarding the department as well as my duties and responsibilities.", "Interview Questions": "What was the most challenging project that you faced in your previous job and how did you handle it?"}, {"date": "10 Apr 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "It varies from group to group, but KTH sends out calls for PhD students for specific research topics. I emailed the professor in question, and was contacted again for a Skype interview.", "Interview Questions": "They asked simple things, about me as an individual. Personal questions to gauge if I was the right fit in the group. Also was asked a few simple technical questions on a sample of written work/report I sent as part of the application process."}], [{"date": "9 Mar 2017", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm)", "Interview Descriptions": "Based on your letter of motivation and CV candidates are short listed. Generally a skype call with one or many members of the group is done before someone is called in for a personal interview. During the personal interview one has to present a scientific paper and discuss limitations, new ideas to extend the study. The presentation is given to a larger audience. The personal interview follows after the presentation.", "Interview Questions": "Why a PhD? Why KTH?"}, {"date": "9 Sept 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Mar 2017", "Interview Descriptions": "Application (letter and CV)\r\nInterview and intro on campus \r\nInterview questions: about my master thesis and lab experience. Questions about expectations. There was supposed to be a lab test, dilution factors  etc but never happened", "Interview Questions": "If I have experience working with cell culture "}, {"date": "25 Apr 2019", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Mar 2017", "Interview Descriptions": "Sent CV (online application) plus a cover letter.  I was contacted by email and schedule an interview over skype. After that, I was selected for the position. Quite straightforward indeed.", "Interview Questions": "Normal questions, such as why KTH, why this position, where do you see in five years, what do you think about the ongoing projects in the group, etc."}, {"date": "30 May 2018", "title": "Post Doctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at KTH Royal Institute of Technology in May 2016", "Interview Descriptions": "The interview is done remotely and face to face is possible. The candidate for interview is usually selected through large number of applicant who have seen the vacancy in the Eu related website. The vacancy must be available at least for 10 days.", "Interview Questions": "The questions cover technical question related to the job."}, {"date": "27 Aug 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Oct 2014", "Interview Descriptions": "-The initial interview is mostly from the CV. \r\n I explained the previous project and industry experience.\r\n- Some question from skills, strength and weakness.\r\n-General enquiry about gender equality and multicultural place", "Interview Questions": "-Tell me about yourself\r\n- about the Master thesis\r\n-Strength and weakness"}, {"date": "1 Jul 2014", "title": "Master Thesis Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at KTH Royal Institute of Technology", "Interview Descriptions": "Contacted the posting professor via exjobb kth website. However the professor did not think my background (electronics) matched that topic about robots (automation). He made a recommendation about another topic and arranged for an interview. \r\nThe process went through the contents of the topic. Was asked about my understanding and experiences  of related concepts specifically. Went through academic background and related courses.", "Interview Questions": "Nothing much difficult. Though slightly unexpected was that my transcripts were looked into carefully. Was asked about why the scores were high/low and continued with details in the courses. "}, {"date": "8 Aug 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Feb 2014", "Interview Descriptions": "Interview very technical, few background question and they asked to solve some tasks. The interviewer was very friendly and made sure I was feeling comfortable.  The process lasts few hours with questions about my background both technical and personal.", "Interview Questions": "Describe yourself with one work"}, {"date": "30 Nov 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at KTH Royal Institute of Technology in Nov 2013", "Interview Descriptions": "There was an initial technical round where I was given a week to answer a list of questions which had to be broken down to simpler questions and needed a lot of reading of literature and analysis to form an independent opinion and thereafter an HR type interview to know more about me as a person.", "Interview Questions": "I had to explain my grades in detail, especially the ones that were the lowest. Apparently they were also related to my future work. "}, {"date": "3 Apr 2016", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Nov 2012", "Interview Descriptions": "I met with my (to be) supervisor and we have a hour long interview about the position. It was very informal and cordial. I spoke about my background and why I was qualified for the position. KTH hires PhD on a \"position\" basis, which basically means whenever a a professor receives funding to hire a PhD. Keep looking at the website for a positions to pop up!", "Interview Questions": "Tell me about yourself?\r\nDescribe your experience?"}, {"date": "20 Apr 2010", "title": "PhD-position Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at KTH Royal Institute of Technology (Stockholm, Stockholm) in Mar 2008", "Interview Descriptions": "- Short phone interview with assistant professor: on why KTH, why research etc etc \r\n-1:1 interview with professor in question focused on academic track record and future ideas. No biggy. \r\nWas offered o participate in a group meeting the same day, and was asked to present a summary of the findings of my M.Sc thesis (5-10 min). People were really relaxed (did not expect anything else), listened and asked follow up questions, more to be nice than to test skills. Aside from detailed tech-questions from faculty on specific details, it was an easy interview and a great experience.", "Interview Questions": "What motivates you?"}]]