[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Perfect around little boy and husbands job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Jan 2023", "job_title": "Lunchtime Assistant in Maresfield, England", "duration": "N/A", "pros": "Perfect hours, terms fit perfectly with little boys term times. Extra hours available. Very accommodating with personal issues/Illness and appointments. Everyone is very approachable. Everyone always there for the yp. Yp come first.", "cons": "Location. So large you will never know everyone. Most things with a yp is very scary. Due to the fact nurses train for years to do the things we do with the yp. So if not fully confident can be quite overwhelming. Told it’s completely up to me when I feel comfortable/competent to do things yet I turn up to a shift and told I’m being assessed today. It unnerves me."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Worst place I have ever worked", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Apr 2023", "job_title": "Deputy Manager in Chailey, England", "duration": "N/A", "pros": "The young people are lovely and it’s so rewarding and humbling to be able to help them and watch them achieve goals and enjoy themselves !", "cons": "Too much to learn in a short space of time , nobody has time to help to show you where to find paperwork / navigate your way around the IT system etc ! Long standing staff members will criticise and ridicule you and gossip with others and make you feel worthless ! Never suffered with such bad anxiety in my life whilst working there , management are too busy or dis interested to do anything about the issues that go on !"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Nice workplace but some change is needed", "rating": "3.0", "reviewer_affiliation": "Current Contractor, more than 1 year", "job_date": "8 Jan 2023", "job_title": "Support Worker in Uckfield, England", "duration": "N/A", "pros": "I really enjoy working at chailey. I love the community feel and the work we do is very valuable.", "cons": "The things I find about chailey heritage that could do with reviewing is the fact the dispite working mothers make up a good portion of the workforce there isn't much in place to support them. The hours are not childcare/school friendly and many women I know unfortunately have had to change jobs or cut drastically down on hours becouse of this. I could write endlessly about this subject but I really think chailey could benefit from and retain/recruit so much from putting in place something for working mothers/parents. Also the lack of organised activities for special holidays for young people especially for those who cannot go home. Lastly I'd like to mention the environment for newcomers, it can be though to settle it at the start, there is definitely a lack of initial showing around, I think newcomers would benefit from having one designated person to explain everything rather than just following different people around each shift. It doesn't work, I experienced a rocky settle it at the start of my time there and have spoken to many newcomers who felt the same. A little bit lost and having to fend for yourself when it comes to learning everything."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "A rewarding job with amazing YP.", "rating": "4.0", "reviewer_affiliation": "Current Contractor, more than 1 year", "job_date": "6 Jan 2023", "job_title": "Support Worker in Balcombe, England", "duration": "N/A", "pros": "A homely environment working on the bungalows You are able to develop a variety of clinical skills through training. Being able to be a key worker gives you more responsibility in your role and makes you feel more part of the team.", "cons": "Quite a judgmental workplace. I feel like there is a lot of talking about people behind their backs and judgment. Not enough communication between day support workers and night support workers e.g about YP’s routines. It can be quite cliquey on my bungalow, which isn’t fair on other support workers as it seems that those cliques have more of an insight into what’s going on. Lastly, the working hours are quite antisocial. But I understand this and don’t really mind."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Work place", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jan 2023", "job_title": "Support Worker in Chailey, England", "duration": "N/A", "pros": "Amazing place for YP. Facilities are great. Flexible work and lots of departments to work in. Plenty of work opportunities. Good training.", "cons": "Staffing levels are often poor. Stressful job. Low income especially for the skills set needed, not recognised as doing nursing skills. Often missing out on feedback/observations and scheduled meetings because of staff levels. Communication and meetings need to have importance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jan 2023", "job_title": "Head of Technology in Haywards Heath, England", "duration": "N/A", "pros": "Making a difference for the young people we support and their families. Supportive staff team. Great supporters in our community and across our sector.", "cons": "Challenging times due to difficulties to fill vacancies, increase cost of living and just generally how people are feeling about life at the moment. This inevitably filters through into all areas of life and work and affect us all."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Fantastic Place to Work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Jan 2023", "job_title": "Administration in Lewes, England", "duration": "N/A", "pros": "Very friendly staff, supportive managers, flexible hours, good pay structures.", "cons": "The only con is the location, you need to be a car driver as the public transport isn't as regularly run (bus)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Feedback", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jan 2023", "job_title": "Health Support Worker in Chailey, England", "duration": "N/A", "pros": "I like the work atmosphere in chailey and good administration team and every body have helping mind.", "cons": "I don't have any dislike from chailey Heritage Foundation"}], [], [], []]