[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Loved my job", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2023", "job_title": "Research Coordinator in Monrovia, CA", "duration": "N/A", "pros": "I loved all of my coworkers and the organization", "cons": "I didn't have any cons."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "University of Florida Location. Overall, great job satisfaction", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Feb 2021", "job_title": "Data Management Analyst II in Gainesville, FL", "duration": "N/A", "pros": "You can feel good about your work. The clinical trials are grant-funded and seem to be independent of for-profit pharmaceutical company goals. Great science and research. Great work-life balance. The PIs at least listen to the DMAs for research direction though they maintain final say (as they should).", "cons": "The work can get redundant pretty fast."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Don't work here", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 May 2019", "job_title": "Research Coordinator in Monrovia, CA", "duration": "N/A", "pros": "-Health Benefits are great\r\n-Experience with different tasks", "cons": "There are a lot of cons here and way more than there are pros....for some people, there is a ton of work and a lot of stress while others have no work and just sit around all day who are in the same position. This is a non-profit company and the pay is very low. Do not expect to move up in this company unless senior management likes you regardless of your qualifications. There are even people in management who do not have a college degree. HR cannot be trusted and nothing said with them will stay confidential. They also do not handle situations well either.\r\n\r\nThis company used to be great to work for, but has quickly gone downhill. There is a huge disconnect between management and the employees and lack of communication. There is A LOT of turnover here and there is no appreciation for the extra work that is put in. \r\n\r\nSave yourself the headache  and go somewhere else that will appreciate you and pay you more."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Overall this is great company with supportive senior management and diligent hard working people", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Feb 2016", "job_title": "Anonymous Employee in Monrovia, CA", "duration": "N/A", "pros": "It's been a pleasure to be part of such an amazing organization, below are some of the pros that I can attest to: \r\nFriendly working environment and culture\r\nGreat co-workers with highest levels of professionalism and passionate for what they do\r\nThe Chair/Vice Chair/COO are highly motivated, which brings lot of positive energy in the company\r\nYou get recognized and appreciated for a job well done\r\nVery flexible work hours \r\nCompetitive salaries paired with great benefits", "cons": "No cons that I can think of!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Anonymous", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Dec 2015", "job_title": "Anonymous Employee in Monrovia, CA", "duration": "N/A", "pros": "Great benefits, wonderful Group Chair and fantastic supervisor. Work for a non-profit that truly makes a change in the world!", "cons": "A portion of leadership is extremely unprofessional and moody, causing multiple departures recently. Playing favorites is common. Not much room for promotion."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Terrible place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Oct 2019", "job_title": "Anonymous Employee in Monrovia, CA", "duration": "N/A", "pros": "You will learn a lot about Oncology and gain experience for your resume. The PTO and health benefits are comparable to those of the private sector.", "cons": "This company has the worst work environment I’ve ever experienced. Management does not care about their employees wellbeing at all, and treats employees as easily replaceable, although they also can’t ever find enough employees to work here. You will be expected to keep up with an excessive workload because of the continual turnover, and management will not help or support you in any way. There is quite literally no room for advancement in this company. They would rather leave management positions empty for almost 2 years rather than internally hire any of their current employees. All managers are externally hired because there is no trust in or mentoring of the current employees. The work environment can only be described as constant chaos, because some employees are given a huge workload while other employees just sit around gossiping and bad mouthing others all day. Don’t expect your coworkers to support you either, in fact, expect them to throw you under the bus at any moment because of the every man for himself attitude that the company encourages. If you enjoy working in an extremely toxic environment, being treated like you don’t matter at all despite your frantic efforts to keep up with the unsustainable workload, and being degraded by your coworkers, HR, your supervisors, and upper management, then this is the place for you. If you expect a professional work environment free of childish coworkers gossiping and causing drama; to be trained and supported by any of your managers, or to leave work for the day feeling anything other exhausted, frustrated and beaten down, then definitely don’t work here. This company has been the worst place I’ve ever worked, which is sad considering that the point of the organization is to help children with cancer, but that goal is clearly second to stroking the manager’s egos. Working here will mostly just take a toll on your mental health and self-esteem until you find another job, like the majority of the hardworking employees here do. Don’t waste your time, health or humanity working for a company that makes it very clear that they couldn’t care less about you as a human being."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "The Toxic Work Environment Starts from the Top", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Nov 2019", "job_title": "Anonymous Employee in Monrovia, CA", "duration": "N/A", "pros": "Decent pay, and a worthwhile mission working at the forefront of medicine. Competitive retirement and health benefits.", "cons": "COG is run by the COO and she is the worst person to have in a leadership position of anyone I have ever met, bar none.  Within weeks of starting in a managerial position, she will rope you in and try to talk badly about every person in the organization. She brags about how people think she is a sociopath. She will go from friend to enemy within a few seconds. She vocally advocates for her directors to manager through fear, and has given direction that we should not be friendly to reports or they will not \"respect\" us. She requires complete control of staff, and turns the directors under her manager into dictators that are terrified to disappoint her. She has specific vendettas and as structural changes occurred that put more personnel under her purview, she purposefully purged those who had work there for years but were on her bad side. I have never been in such a toxic work environment in my whole life. \r\n\r\nA large reason why this is such an insular, toxic place is because the federal funding structure perpetuates systems that are complex and take years to learn. Additionally, at COG we work with the brightest minds in medicine, i.e. with academic, medical leaders in pediatric oncology. This is a highly specialized, high-stress branch of medicine. This means that the doctors we work with have extreme personalities, including the medical director. This also means that despite the fact that not one of them works on site or has any background in human resources, their moods and directions dictate the work we do. It takes a special kind of emotional distance to constantly treat sick and dying children, and this can translate into (at least at COG), a lack of emotional caring for the staff. Emotional abuse at the hands of a select few of these doctors, had become commonplace.  \r\n\r\nI have worked with plenty of brilliant, eccentric doctors in my career, but the fact that there is no HR oversight, no one defending the staff, is why some doctors may trample over those in their line of fire. Not to mention, for some God-forsaken reason, the medical director (which changes periodically) picks the COO, so that they might \"reign\" together during his/her term. Though there is an HR department, it is in name only, as they are outsourced and located 400 miles away from the organization’s headquarters. I find it legally very strange that the Children’s Oncology Group is never the actual employer, and instead contracts out that responsibility. Perhaps, it is to shield the leadership from liability. At one point we had an administrator who both worked under the COO and as a the \"HR liaison\" to the contracted HR firm. As you can imagine, no one told her anything. Everyone was terrified she would run right to the COO who would make it her personal mission to destroy you.\r\n\r\nThis experience was the most traumatic one I have ever had in a workplace, and one of the most traumatizing experiences of my life. I would not recommend working there to my worst enemy."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good stepping stone", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Feb 2015", "job_title": "Scientific Writer/Protocol Coordinator in Monrovia, CA", "duration": "N/A", "pros": "Work-life balance is great; pretty much a 9-5 place. Good-benefits.", "cons": "Limited room for advancement due to being a small company.  Since the company is dependent on grant funding, the salary range is limited."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company with amazing people and values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2019", "job_title": "Research Coordinator in Monrovia, CA", "duration": "N/A", "pros": "I have had a very positive experience at Children's Oncology Group. The directors and employees are all passionate about their work and also very humble. I've attained so many different skills that will be useful for my long-term career goals.", "cons": "I don't have any cons for this company."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Poor Management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 May 2019", "job_title": "Research Coordinator in Monrovia, CA", "duration": "N/A", "pros": "- Good benefits\r\n- Some people really want to help", "cons": "- too much politics\r\n- Senior management plays favorites"}], []]