[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A positive and welcoming place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Jun 2019", "job_title": "Office Coordinator in London, England", "duration": "N/A", "pros": "The cause is at the core\nThe collaboration is consistent \nThe compassion is humbling\nAn inspirational and realistic leader at the helm", "cons": "Consistency and breaking down boundaries between departments is a work in progress but is a primary focus led by the senior management team"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 4, "review_title": "Best to avoid", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 May 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great Cause and passionate staff", "cons": "Lacking in Strategy and structure"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "I love my job!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Mar 2019", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "The people - staff, volunteers and supporters are all passionate and committed to the cause, and have a huge amount of skills and expertise.\r\nThe culture - whilst there is always room for improvement, at this organisation you can see a genuine effort to create and develop a great culture. Senior leadership are approachable, including our wonderful CEO, and we all get together as a whole organisation from time to time which helps us continue to feel united in our mission.\r\nThe mission - It feels great to work for a charity whose mission could genuinely be achieved in our lifetime. It makes me feel inspired to get up and do my job every day.\r\nThe job - I love my job and my team! Because the organisation has lacked in structure and strategy in the past, I now feel that I am really part of helping to build this and the opportunity to feed into and influence more than in organisations that are already fully developed. I also feel that this gives me more autonomy and flexibility in my own role.", "cons": "We have a lot of work to do to implement our new strategy - I am excited about this but it can feel overwhelming at times.\r\n\r\nLack of internal training and development structure - this is part of our new strategy and so I look forward to this improving in the near future."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Really sweet bunch of people, was very sad to leave", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Dec 2015", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "I had a brilliant time with LLR and found the first review of it on here a big shocker. My first day there, I had a little box of goodies and a lunch date with a 'buddy' as part of the system they have for new starters. The CEO is a lovely lady and her passion for the organisation and the cause is front and centre at all times (I saw her cry on several occasions due to harrowing patient stories and this was not only adorable but showed just how invested she is in beating blood cancer). I have nothing but respect for LLR (now Bloodwise) and it is hands down one of the best places I've ever worked.", "cons": "I had to leave as I was struggling on my low salary - London is pretty brutal when you're in a sole income household. Third sector jobs pay poorly anyway (Daily Heil please take note!) so it would be nice if there was an office outside London - maybe Stevenage or somewhere - so the lower salaries can stretch a bit. Staff turnover was a bit high but that's something that goes with the territory in the third sector - especially when the bulk of staff are in their 20's and have the wanderlust that goes with that. The building gets super hot in Summer but everyone is affected equally so we all just got on with it - regular free ice lollies from the SMT helped a lot :)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "On the up", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jun 2018", "job_title": "Deputy Director in London, England", "duration": "N/A", "pros": "Bloodwise has gone through a difficult period over the last few years.\r\n\r\nBut with a new chief executive and other senior people joining, there is a sense of energy and ambition around the place, and things feel like they're moving at a quick speed that gives the culture the kind of feel you might associate with a start-up.\r\n\r\nPeople are being urged to take ownership of their work area and to think big and bold in imagining how we might make a bigger difference for people with blood cancer (and new ideas are very much encouraged). This, together with the fact that there are lots of areas where there is room for improvement, means it's exactly the right kind of place for people who want to make their mark in their career.\r\n\r\nAlso, the people we support and the fundraisers who enable us to do our work are truly, truly inspiring, and the chance to make a difference on their behalf is all the motivation you need to want to do the best job you possibly can.", "cons": "The speed of change is not always easy, and the processes and culture are very much a work in progress rather than the finished article.\r\n\r\nWhile this sense of a work in progress is exciting for me, it wouldn't be for everyone, and if people would rather join an organisation that feels in a settled state then this isn't the charity for them."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible Company, Sky-High Staff Turnover Bloodwise (Formerly Leukaemia and Lymphoma Research)", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jan 2017", "job_title": " in London, England", "duration": "N/A", "pros": "The pro would be the Leukaemia and Lymphoma Research is a reasonable familiar brand - however they have now shed that name. Remember this company is no longer Leukemia and Lymphoma Research and is exactly like a brand new 'start up' charity that nobody has heard of. \r\n\r\nBefore leaving I spoke to several of the Charity recruitment agencies (the only people in the world who seemed to know this company) and they said they know how terrible things are at Bloodwise and keep wondering why their candidates are not liking the company and roles are impossible to fill.", "cons": "Rickety old building, they don't turn the heating on for more than an hour a day. The office space is extremely dirty and cluttered. I have never seen so many staff resign so quickly. Needless to say people quit faster than they can fill the spaces so most roles are vacant (at least 60%). I agree that the leadership are bullying, self-absorbed, egotistical and condescending. It is a company with under 100 staff and has around 10-12 resignations each month. The staff that stay there are low-skilled and in-experienced they are unable to keep even staff with basic talent. There are less than 7 people in the organisation who have more than 1 year of service. Really Shocking, needless to say I only took the job as a filler until I found something better, however if you are looking for a long term role this is not a good career move."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Inspiring cause and great team to work with", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Nov 2017", "job_title": "Program Director in London, England", "duration": "N/A", "pros": "Amazing charity, fantastic cause and a brilliant team of staff, ambassadors and supporters. I worked at Bloodwise for nearly 2 and half years and really loved it. It is inspirational in its impact and its drive to do more and do better. Staff are listened to and supported to do well in their roles and to develop. They have a great L&D programme and are keen to offer opportunities of promotion where possible. I learnt loads there, made some great friends and will stay in touch and will continue to support them.", "cons": "It had previously neglected to invest in some of its infrastructure and as such, like many charities, suffer from that and a lack of consistent processes. But there is a massive programe underway to address all of this -which was just starting as I left and was involving all staff which was really positive."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "An organisation which is back on track again", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Mar 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "It's an organisation which is an authority in it's sector and well-regarded by the researchers and patient community alike. Sure, it has had it's problems (haven't they all in recent years?) but there are some really good people in place and it is on its way back again. The current CEO (acting) is well-regarded and the directors have a clear sense of direction and vision for the future.", "cons": "It's been hard to get things done, with some of the negative attitudes of some of the staff  but many of those have moved on and the organisation has some good people on board."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "A great place to work for a fantastic cause", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jul 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "It's a fantastic cause.  The charity has achieved a huge amount since it was founded thanks to the help of patients, their families and other supporters.  There are many highly skilled, creative and positive staff with a range of skills and backgrounds.  You can easily get to know people in other teams and find out about what others are working on.  It's a social place where new people are quickly welcomed in.", "cons": "There's no doubt the charity has been through some difficult times in recent years, and there are certainly some projects and ways of working that could have been handled better.  Though this isn't a situation unique to Bloodwise, I understand that some staff had a tough time in the last few years.  However, the charity is in a different place now, and with new permanent hires joining shortly in crucial senior roles, I think this up turn for the charity will continue.\r\n\r\nI have to say that one of the major cons for me in recent years was negative staff.  Over recent years, things haven't always run smoothly and I understand that that's not fun for some of the staff involved.  But some staff seemed to complain about literally everything, making it their business to bring down the morale of everyone round them.  Looking at some of the previous reviews, there are things being said that are highly personal, grossly unfair, and in some cases, laughably wrong and inaccurate.  I think one says \"they only turn on the heating for an hour a day\", and \"only 10 people have  been here longer than a year\" - both of these are so far from the truth it shows the lengths some were prepared to go to to find things to  complain about.  I only reference it here as I think the reviews these former staff have left on this site skew the perception of what it's like to work at Bloodwise, and it's important to provide an accurate picture rather than the hugely unfair negative ones previously left.  Fortunately, the staff today are much more positive!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Happiest I've been at work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2019", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "A great sense of community\r\nEasy to feel connected to the cause even if you're not working directly in research or with our beneficiaries\r\nFun work environment and culture club! \r\nExec team that leads by example - I truly believe the CEO believes in the cause, is passionate about beating blood cancer and is determined to make Bloodwise an amazing place to work\r\nVisible trustees", "cons": "Some remote work as we're a national charity so there can be technical difficulties and it can be difficult to get to know people based at other offices."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Organisation going places", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Friendly and passionate team who are making a real difference to people with blood cancer. The plans for the next year are really exciting. Lots of opportunity to try new things and loads of social/wellbeing stuff around work too - massage, Schwartz rounds, football, lunch club, cake decorating. Best induction I’ve seen anywhere.", "cons": "some of the systems and infrastructure are a bit clunky but work is underway to fix them. London office a bit tired. tiny minority who found change difficult and can be negative which can be frustrating"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "10/10 would work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Mar 2019", "job_title": "Anonymous Employee in Edinburgh, Scotland", "duration": "N/A", "pros": "Bloodwise has provided me with many opportunities for professional and personal development.  I have already learned so much despite only working here for just under 6 months.  The organisation is full of bright people with lots of great ideas and our CEO Gemma Peters seems genuinely interested in listening to and implementing these suggestions.", "cons": "As a national charity some of the team are based in London and some in Edinburgh so sometimes internal communication isn't as good as it could be."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Disappointing experience", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Aug 2020", "job_title": "Manager in London, England", "duration": "N/A", "pros": "The staff are wonderful, hardworking, ambitious and love the cause. It has the feel of a small charity with the ambition of a larger one.", "cons": "Staff turnover was high and there was clear correlation with poor senior leadership in some directorates, largely due to the lack of leadership ability, poor people management and minimal strategic oversight or direction. It was a very frustrating environment to work in, particularly given the talent of colleagues that was often going to waste."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "An organisation with no strategic direction. Stay away!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jun 2017", "job_title": " in London, England", "duration": "N/A", "pros": "Excellent cause with a passionate supporter base", "cons": "I very much regret taking the job at Bloodwise. It became quickly clear that the organisation had no strategic direction and the senior management team were too afraid to challenge a CEO with a questionable approach to leading an organisation. This CEO has since left so I would hope that the organisation has improved. However, the mass exodus of staff would suggest otherwise. I really think the charity commission need to look carefully at how this charity operates and, more importantly, spends the donations given in goodwill by a passionate supporter base."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Company has major issues and everyone who works here hates it", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jan 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Childcare voucher scheme once you have worked here a while.", "cons": "There are major issues with almost everything. I tried to give as many stars as possible, but I just wanted to be honest in case someone was considering this as an option you are likely to be disappointed. As you can tell from past reviews it has been bad for well over a year now and I cannot see anything changing in the distant future."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bullying leadership and terrible organisation", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Mar 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Nice people below senior managers.", "cons": "This charity is a massive NO-NO for anyone who wants to have a pleasurable work experience and/or build their professional career in the not-profit sector. They've recently gone through a period of change and have dealt with a common economic crisis in the worst manner of all possible. Instead of offering or making redundancies, they just opted for ignoring their employees (especially in the Marketing & Fundraising teams) and exclude them from any existing or new projects. As a result, people started to feel frustrated, and most of them looked for new opportunities and quit as soon as they could. In just about six months I saw at least 30 of my colleagues quitting (some of them feeling quite depressed and anxious), whilst the senior management did nothing to sort it out. There was in fact a huge and worrying lack of communication and transparency that, as far as I'm aware, was never improved. \r\n\r\nSadly I also have to agree with the rest of the reviews regarding the senior management team being condescending and bullying, therefore consenting any bullying practices from other members of the team as it happened in my case. No matter how many times I reported being disrespected, undermined and generally bullied by one of my colleagues, no one there did anything to protect me against this awful situation and I had to quit as a result. \r\n\r\nI've never seen such bad organisation and direction in the same place. Senior managers lack basic communication and management skills, which are essential in any other organisation. Some of them also lack basic knowledge skills, which can lead to terrible decisions being made as a result. Once I was in a meeting in which a Senior Manager in the Marketing team said that the organisation did not need to have a presence on social media - completely underestimating the work of several teams and the power of about 100k social media followers.  \r\n\r\nIn addition, salaries are much lower than average salaries in the third sector; there aren't any career or development opportunities and they've only started to offer basic benefits like flexitime."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "A fantastic cause, fantastic supporters and the future is bright", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Aug 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Incredible supporters - more committed than I have seen an any other charity\r\nGood, talented people, and inspiring leadership\r\nShared learnings from what's been before", "cons": "Lack of internal proccesses - but that is changing"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "The worst charity I've ever worked with", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Dec 2017", "job_title": "Freelancer in London, England", "duration": "N/A", "pros": "I don't think there are any", "cons": "they just don't have a clue what they are doing - especially brand/design which seem to change the brand guidelines every other day. They lack a good designer and team leader."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Now Blood Cancer UK", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Aug 2020", "job_title": "Patient Advocate in London, England", "duration": "N/A", "pros": "Important cause, patient in the centre of mission,", "cons": "financial issues due to pandemic"}]]