[[{"date": "18 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Pretty quick call back after applying for job. Easy but lengthy interview process - interviewed total of 3 times. Human Resources was efficient and made things simple. Overall a good hiring experience.", "Interview Questions": "Past work experience, conflict resolution."}, {"date": "13 Dec 2022", "title": "Consumer Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Pretty simple and straightforward. Screening with HR and then interview with Supervisor. After that received call from HR recruiter. Was actually surprised at how quickly it went from 1st interview to offer considering I had HR screening the day before Thanksgiving.", "Interview Questions": "Tell me what you did in your last position."}, {"date": "8 Jul 2022", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Went through 3 rounds of interviews with a great team. I was asked in the first interview my salary expectations, and I shared my current salary as well as what I want salary wise. Hiring manager says they can work with that. Fast forward to getting an offer, I’m offered $8/hr less than what I currently make. I ask to negotiate, and they declined. It’s unfortunate that such a great team works for a company that doesn’t pay a living wage. No person in Tampa Bay can live off of less than $50k annually.", "Interview Questions": "What are your salary expectations?"}, {"date": "24 Jun 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Tampa", "Interview Descriptions": "It was great very nice loved the lady interviewed with she was very polite and pleasant very genuine with me asked me a lot of questions. I had a interview in person with the manager and then with the doctor and then another with the HR recruiter", "Interview Questions": "Where did I work previously "}, {"date": "14 Apr 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AdventHealth Tampa (Tampa, FL) in Mar 2022", "Interview Descriptions": "First I got a 15 minutes phone interview with the job description and job requirements as well, them, I was scheduled for a second virtual interview with the hiring manager. On my second interview, no questions were asked, the manager gave me information about the uniforms, benefits, the work schedule, and the step on the hiring process. Everything went very smooth.", "Interview Questions": "Why do want to change job?"}, {"date": "8 Mar 2022", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AdventHealth Tampa (Tampa, FL) in Feb 2022", "Interview Descriptions": "The interview process was very easy first the recruiter give you a pre screen call. And then set you up with a team interview with manager. The teams interview is very easy going with. Few what if question And if you was in this situation. The manager I interviewed with was VERY nice make the interview process very comfortable. Once the teams interview was completed. I received a call maybe 2day later with an offer 🎉🙌🏽.  All information (emails) is send in a timely manner to get background and health screening done.", "Interview Questions": "Tell me about a time when a patient /caregiver was upset?"}, {"date": "2 Feb 2022", "title": "RN Per Diem Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AdventHealth Tampa", "Interview Descriptions": "I had a phone call with the recruiter then with the department manager on Teams with a video camera. The manager was great, although she did not have her video on.", "Interview Questions": "They asked about a something that changes the perception of the patient. "}, {"date": "29 Nov 2021", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Nov 2021", "Interview Descriptions": "I went to a job interview here in Tampa. Spoke with several women concerning the job responsibilities I will have and did I think I could handle them.Also spoke about salary and benefits.", "Interview Questions": "About the shift  would like to work."}, {"date": "13 Jun 2021", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Communicate courteously when interacting with internal or external customers.\r\n\r\n  • Demonstrates proper and courteous telephone etiquette.\r\n\r\n  • Show respect for co-workers and develop positive working relationships with other departments.\r\n\r\n  • Carries out technical controls to help nursing with rounding off hours using the AIDET technique.\r\n\r\n  • Demonstrates culturally competent caring in daily practice.\r\n\r\n  • Reflects ICBEST practices as representative of Florida Hospital Tampa.\r\n\r\n  • Demonstrates standards and values ​​of organizational commitment.\r\n\r\n  • Communicates in a timely manner with the appropriate RN as needed.\r\n\r\n  • Help with paperwork during and after computer downtime.\r\n\r\n  • Help with patient whiteboard updates.\r\n\r\n  • Greet new patients and families in a timely and courteous manner upon arrival.\r\n\r\n  PEOPLE:\r\n\r\n  • Adheres to organizational standards for professional dress and appearance.\r\n\r\n  • Demonstrates collaboration and teamwork to assist with patient flow.\r\n\r\n  FINANCE:\r\n\r\n  • Considers factors related to safety, effectiveness, cost, and practical impact in nursing service delivery and when ordering supplies and complies with decisions made for staffing adjustments (ie, floating).\r\n\r\n  RESULTS:\r\n\r\n  • The technical nurse supports the delivery of patient care in accordance with standards of care that emphasize basic hygiene, comfort, and activities of daily living under the direction of the RN to promote the achievement of identified patient outcomes. .  Reports changes in condition, potential problems, or concerns involving the patient or family to the nurse in a timely manner (i.e., vital signs, check-in / check-out).\r\n\r\n  • Helps maintain the integrity of the patient's skin by:\r\n\r\n  o Rotate and reposition the patient according to policy.\r\n\r\n  o Notify the nurse if skin breakage is observed.\r\n\r\n  • Performs accucheks and hemocults according to hospital procedures and documentation.\r\n\r\n  • Accurately and timely documents all patient care procedures and tasks.\r\n\r\n  • Remove peripheral IV catheters, dispose of them in accordance with the hospital's biohazard waste policy, observe the site, and notify the nurse of the condition.  Documents in electronic medical record (EMR).\r\n\r\n  • Empty Foley, JP and hemovacs bags.  Document care and entry / exit in the (EMR).\r\n\r\n  • Collection of samples as assigned by RN and following hospital policy for patient identification.\r\n\r\n  • Take vital signs, weigh accurately, and accurately measure in / out and documents.\r\n\r\n  • Transports patients with the necessary equipment to destinations within the scheduled times, observing the correct techniques.\r\n\r\n  • Helps position, lift, and walk patients, using proper body mechanics and safety precautions.\r\n\r\n  • Respond to call lights in a timely manner.\r\n\r\n  • Distribute supplies of linens.\r\n\r\n  • Supports the nutritional needs of the patient by:\r\n\r\n  o Help with meal preparation.\r\n\r\n  o Feed patients within identified restrictions.\r\n\r\n  o Document the percentage of food intake, including supplements.\r\n\r\n  o Notify and document the communication to the nurse if the patient does not have the p.o.  adequate.  intake for meals or snacks, or if the patient does not follow fluid restrictions in a timely manner.\r\n\r\n  • Perform proper hand washing techniques before, during, and after patient care at all times.\r\n\r\n  • Demonstrates safety in the care of patients with restrictions:\r\n\r\n  o Ensures restrictions are properly applied in accordance with FHT policy / procedure.\r\n\r\n  o Report any changes in the patient's behavior to the nurse.\r\n\r\n  • Demonstrates responsibility for patient safety related to falls.\r\n\r\n  • Participate in frequent technical checks to decrease the patient's need to use the call light system and increase patient safety.\r\n\r\n  • Place bed alarms on patients at risk of falls.\r\n\r\n  • Recognizes that all patients are at risk for falls in the hospital setting:\r\n\r\n  o Responds immediately to alarms from the patient's bed.\r\n\r\n  o Respond to ringing bells in a timely manner.\r\n\r\n  o Is proactive in meeting all patient needs.\r\n\r\n  • Adheres to specifications on isolation marking for patients.  Acts as a preceptor for new unit staff members as assigned.  Ensures safe and effective handover communications between caregivers.", "Interview Questions": "How do you describe your self"}, {"date": "6 Jul 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Tampa in Jun 2021", "Interview Descriptions": "The Interview process begins with setting up your initial interview with the Recruiter. This takes no more than a week, based on what date you select your interview for. Upon that, if you are chosen to continue with the process, it'll be another couple of days for the next interview with the hiring managers. You should then receive a decision within a day or two.", "Interview Questions": "Provide an example of when you used Evidence-Based Practice in your clinical Rotation"}], [{"date": "7 Apr 2021", "title": "Graduate RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Apr 2021", "Interview Descriptions": "I applied and heard back from the recruiter the next day to schedule a phone interview. Before getting off the phone, I was scheduled for my final interview with a nursing manager.", "Interview Questions": "On a daily basis, which one of our standards (Love Me, Keep Me Safe, Own It, Make It Easy) do you live out?"}, {"date": "3 Jan 2022", "title": "New Grad RN Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa in Apr 2021", "Interview Descriptions": "Overall good, interviewer was understanding, timely and asked reasonable questions.  We had to reschedule the interview at first because of a few reasons. However the starting pay  rate was too low", "Interview Questions": "What would you do if a patient comes in complaining of chest pain "}, {"date": "5 Mar 2021", "title": "Imaging Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Phone interview with the recruiter discussing background information. Then a team’s interview with the manager which was really easy. We interviewed for about 30 minutes and I was hired on the spot", "Interview Questions": "Why do you want to work for our company? "}, {"date": "18 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Tampa", "Interview Descriptions": "Quick and easy. Pleasant staff! HR recruiters were fantastic. As well as the managers in the department I was hired in. I was hired from outside of the state and the process was seamless. I had a fantastic hiring process.", "Interview Questions": "Tell me a bit about yourself."}, {"date": "4 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AdventHealth Tampa", "Interview Descriptions": "The interview was not very long but it was informative and the person doing the enter viewing was a very  organized person and the whole process took about 10 minute and they knew what they was looking for", "Interview Questions": "Can you do this job?"}, {"date": "8 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa", "Interview Descriptions": "The interview process was not bad.  Was fist screened by the recruiter. Scheduled for an interview.  Two people interviewed with asked me about 2-3 questions lasted about 15 min.", "Interview Questions": "They asked for me to tell me something about myself. Just describe what you have done in your previous and current place of employment."}, {"date": "7 Aug 2020", "title": "Health Unit Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Jul 2020", "Interview Descriptions": "Pleasant interview process, asked about relevant work experience and educational background. Two step interview process with an initial phone screening then a zoom interview which was about 45 minutes long.", "Interview Questions": "Q. What is your work experience?"}, {"date": "5 Aug 2020", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Jun 2020", "Interview Descriptions": "The interview process was friendly and casual. We had a telephone  interview due to the pandemic. It was more of a conversation rather than an interview. She explained about the duties and requirements for the position and let me ask questions to see if it would be a good fit.", "Interview Questions": "Wanted to know if I was punctual and would come on time to every shift in which I was scheduled."}, {"date": "14 Oct 2020", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Mar 2020", "Interview Descriptions": "it was good fast , told I will make good hours { which i did } got hired on the spot . Ask how i would handle upset people . if i know certain diets , and if i can work in a fast pace setting .", "Interview Questions": "how do you handle stress ?"}, {"date": "26 Mar 2020", "title": "Entry Level Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AdventHealth Tampa (Tampa, FL) in Feb 2020", "Interview Descriptions": "I had a conversation with a recruiter. This was followed by a video interview and then an in-person interview with a panel. A couple of weeks later I got a form email stating that I did not get the job.", "Interview Questions": "Tell me about yourself"}], [{"date": "20 Feb 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Feb 2020", "Interview Descriptions": "Panel interview with managers and staff members of the department. All interviewers asked relevant questions pertaining to the position.  For example, how would you handle a conflict among team members etc.", "Interview Questions": "Tell me about your management style "}, {"date": "19 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Dec 2019", "Interview Descriptions": "Panel interview. Starts with a video of hospital mission. Basic interview questions such as \r\n-why did you want to become a nurse\r\n-list some strengths & weaknesses\r\n-where do you see yourself in 5 years", "Interview Questions": "Why did you want to become a nurse"}, {"date": "7 Apr 2019", "title": "Nurse Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Phone interview then in person interview. Apply online and keep checking HR status or you may never hear back. Easy online application, must wait a few days to hear back. People are very kind and if you have any questions call HR", "Interview Questions": "Why do you want to work here?"}, {"date": "3 Jun 2019", "title": "Talent Sourcer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Apr 2019", "Interview Descriptions": "Smooth and easy. A Talent Acquisition Specialist got in touch me after reviewing my application. Then my information and application was passed to a hiring manager. From there, I did an in-person interview some of the department team.", "Interview Questions": "How do you identify with their mission at AdventHealth?"}, {"date": "7 Mar 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Got a phone call asking to come in for an interview\r\nAsked me a couple questions about actions to take in certain situations \r\nGot the job after 5min of talking w/ manager", "Interview Questions": "Give a situation that didn't go as planned and how you resolved the issue"}, {"date": "31 Mar 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Jan 2019", "Interview Descriptions": "All of the applicants were brought into a room that was split down the middle. Managers were on the other side and people were called over one by one for their interview. It was very impersonal and came across as nothing more than mass hiring. Gave me the feel that there was a high turnover rate - which turned out to be true", "Interview Questions": "Describe a time that you thought about quitting nursing and how you made it through."}, {"date": "17 Feb 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Orlando, FL) in Jan 2019", "Interview Descriptions": "they asked standard questions that were pre determined they interview had 2 interviewers who took turns asking questions it was pretty straight forward and clear, they also gave me an opportunity to ask questions i had", "Interview Questions": "tell me about a time you had a conflict with coworker and how you resolved it "}, {"date": "13 Jun 2018", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at AdventHealth Tampa (Tampa, FL) in Mar 2018", "Interview Descriptions": "First with manager then with director. The interview process was very easy and fair. I would surely recommend to anyone who is looking fir a great place to work. Company has very honest and nice employees. I truly loved FHT", "Interview Questions": "Why u want to work here"}, {"date": "11 Jan 2018", "title": "Managed Care Collector Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at AdventHealth Tampa (Tampa, FL) in Jan 2018", "Interview Descriptions": "First you take a 100 question test then if selected you come in for and interview with 3 management staff then if you receive an offer you are subjected to an invasive and excessive 3rd party online reference check which requires you to provide 5 references with 2 being managers. This system will not allow corporate emails and they will not pick up the phone to actually speak to any of your references. If your references do receive the email they have to do   a 15-20 min survey. No manager has time for this nonsense!", "Interview Questions": "regular interview banter"}], [{"date": "30 May 2017", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at AdventHealth Tampa", "Interview Descriptions": "There wasn't one. ..  I was scheduled for a phone interview, the interviewer called on time to say he needed to postpone the interview until a little later that day.  He did have one question though which was to know if I had experience with a Shared Services Department.  I said I did but in a different capacity.  The conversation lasted about 3 minutes and he said he had to go and would call me back at the newly scheduled interview time.  I never received a call back.  I followed up shortly after the scheduled time to see if perhaps he was delayed.  Not only was there no follow up call there was no email explaining why I was NOT able to complete my phone interview.  How unprofessional and utterly discouraging especially from someone in HR!  Next...", "Interview Questions": "Have you had experience working with a Shared Services Department?"}, {"date": "22 Jan 2018", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in May 2017", "Interview Descriptions": "I applied online. Recruiter emailed within about 2-3 weeks informing me to submit a video interview. Upon submission of the video interview I was requested to submit 5 professional references. Shortly after I went to in person interview about a week later", "Interview Questions": "What type of experience do I have working as a CNA?"}, {"date": "31 May 2017", "title": "New Nurse Graduate Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at AdventHealth Tampa (Lutz, FL) in May 2017", "Interview Descriptions": "Application is online through Taleo, Then If you pass the initial computer screening you get an invite for a virtual interview. HR will then contact you for an in person interview. I was called back for a hiring event, there you sit through a presentation, do a clinicals test which includes basic fundamentals questions in addition you must prioritize 3 patient cases. Then you are called for a panel style interview and meet two hiring managers. \r\n\r\nI was called back within 4 business days, with an offer. The total time it took counting when I first submitted my application to my offer was 1 month and a week.", "Interview Questions": "Why did you want to become a nurse"}, {"date": "6 Jul 2017", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Apr 2017", "Interview Descriptions": "Very quick, pre-recorded video interview. Very generic questions that you recorded of yourself over video chat. I would have preferred a phone call or in person interview to be able to form a connection.", "Interview Questions": "How did you solve a recent workplace conflict?"}, {"date": "7 Mar 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Feb 2017", "Interview Descriptions": "It was done through an app and felt impersonal. I would have much rather met with the recruiter in person, so that he get a better idea of my personality and work ethic, instead of 30 second answers.", "Interview Questions": "What qualifies you for this position?"}, {"date": "18 Mar 2017", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Feb 2017", "Interview Descriptions": "The interview took 30 minutes and they basically want to know if you're ok with taking money from people while they're in the hospital. They explained the postion and what it entail and how to get the job done well.", "Interview Questions": "Are you ok with collecting money? "}, {"date": "27 Nov 2016", "title": "Pharmacist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Tampa (Tampa, FL) in Nov 2016", "Interview Descriptions": "Received a call from a recruiter then got an interview set up Met with the hiring manager Interview took about  minutes Accepted the offer. I will start i a month. Very exited!", "Interview Questions": "How many years of experience"}, {"date": "8 Apr 2017", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Nov 2016", "Interview Descriptions": "it was normal just like talking to some you have a sense of feeling that you know but you dont,it was also like being hme talking to my mom because she was really nice to me", "Interview Questions": "why do you wanna work?"}, {"date": "3 Sept 2016", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at AdventHealth Tampa", "Interview Descriptions": "Sat in a room with APC coordinator and Outpatient Coding Supervisor as they asked me questions about my experience. I also had to take a coding test. The test was on anatomy and outpatient coding guidelines.", "Interview Questions": "How did college prepare you for this position?"}, {"date": "17 Sept 2016", "title": "Territory Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Aug 2016", "Interview Descriptions": "Over the phone said they would call and did not. I waited 2 weeks followed up with a call and then a week later they sent me an email saying they chose a different candidate.", "Interview Questions": "How much experience I had"}], [{"date": "23 Jun 2016", "title": "New Graduate RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at AdventHealth Tampa", "Interview Descriptions": "Sent in online application. Got contacted for phone interview. few days later was contacted for hiring event. we toured the hospital then interviewed and did an assessment. interview was very short.", "Interview Questions": "what does compassion mean to you?"}, {"date": "8 Jun 2016", "title": "Graduate Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at AdventHealth Tampa (Tampa, FL)", "Interview Descriptions": "Before the actual interview they give you a test. So study emergency items like EKG, fluids ect. The interview questions were simple. The staff were pretty laid back.  I never got a call back though. I guess I tanked the test.  Just know your stuff and be confident.", "Interview Questions": "What us your definition of a team"}, {"date": "26 Apr 2016", "title": "Entry-level HIMS Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at AdventHealth Tampa", "Interview Descriptions": "I submitted the application and after a couple of weeks, it was listed as Under Review. A recruiter contacted me for a screening call that consisted of approximately 10-15 \"tell me about a time when you...\" questions. After another week or so, I was asked to submit a list of five professional references with e-mail addresses. Each reference was asked to complete a lengthy survey. I was also required to complete a 100-question skills assessment on basic math, reading comprehension, typing, and computer use. When that was complete, I was contacted by the recruiter again to schedule a telephone interview with the hiring manager (as I was still living out of state at the time). In the interim, the hiring manager called and gave me a little more information about the position. Then, the interview time came and went with no call. The interview was rescheduled, through the recruiter, and again, I did not receive a call. A different recruiter contacted me asking to schedule an interview for the same position. I clarified that they were looking to reschedule the previous interview, and after checking with the hiring manager, the recruiter affirmed that it was indeed a reschedule. The call was scheduled for the third time, and once again, I never received a call. Approximately a week later, I received an automated e-mail indicating I had not been selected for the position. Everyone I interacted with, via telephone and e-mail, was very polite, but there seemed to be little to no communication between the recruiter(s) and the hiring manager.", "Interview Questions": "Tell me about a time you went above and beyond what was expected of you."}, {"date": "7 Aug 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Tampa, FL) in Apr 2016", "Interview Descriptions": "It was pretty informal. Questions were pertinent to job description.  The interviewer was easy going and fair. Asked questions about my current role in my department. Also asked questions related to my tasks and why I wanted to leave my current position.", "Interview Questions": "What was a hard decision you had to make and how did you respond ? "}, {"date": "5 May 2020", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AdventHealth Tampa (Land O' Lakes, FL) in Mar 2016", "Interview Descriptions": "Great follow up from recruiter, checked in with me and made me feel they were on my side. The team I interviewed with was also very welcoming and provided a lot of feedback to ensure I was making the right decision as well as them.", "Interview Questions": "there were many behavioral/situational questions"}, {"date": "9 Sept 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AdventHealth Tampa (Tampa, FL) in Sept 2015", "Interview Descriptions": "Very easy going, hardly any questions asked, very informative, friendly people and staff. offered employment on the spot with sign on bonus. Easy to ask questions and be truthful and upfront", "Interview Questions": "What was your experience?"}, {"date": "21 Sept 2014", "title": "RN Pepin Heart Hospital Tampa Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took a year or more. I interviewed at AdventHealth Tampa (Tampa, FL) in Sept 2014", "Interview Descriptions": "I had been applying to work at the big hospital Florida Hospital Tampa on Fletcher Ave for over a year.  I had over three years experience on a very busy cardiac floor at another hospital.  I recently/finally got a call from the nurse recruiter who scheduled a face to face interview.  When I asked why I had never heard anything previously she said they had not had any previous positions available which I found unbelievable.  Once I finally got contacted the process went pretty swiftly.", "Interview Questions": "I met with HR first then walked over to the hospital with the nurse recruiter.  She was pleasant enough.  Not sure why she waited so long on calling though??  Now that I am working in the department I realize I could have started a long time ago??  She one recruiter dropped me off to the hospital.  They brought me into a large conference room with 3 women staring me down and one gentleman at the head who ensured I felt comfortable.  Not sure if it was an aggressive woman thing or good cop and bad cops or what but the women were not very inviting.  One of them was a director of something, two were education nurses.  The dude was some sort of retention/happy RN sort of role.  He asked the hardest questions but somehow they were the easiest to answer.  The others made me feel like I was being judged or stupid.  The others asked about a time I had a difficult patient, a time I had a bad physician, a time I had a difficult cosworkers.  When I answered they just scribbled notes and if they did look up, just seemed like they were staring me down.  He was nice and helped me answer the questions by just asking more questions.  My mouth was so dry because I was so nervous and it was so hot out.  He got me some water which was so nice.  I had another upcoming interview at Tampa General.  was caught offguard by offer!!  I thought they might have dragged process on another year!!  If dude had not been there I would have not immediately accepted the offer they made me and gone to see about other job interview later in that week then decided.  Glad I got interview and accepted position.  Dude has been by to see me already and how I am fitting in and if I need anything.  He brings treats to all of the nurses here!!  Thinking about getting my masters which they wil l help pya for."}, {"date": "16 Mar 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at AdventHealth Tampa in Jul 2013", "Interview Descriptions": "There were two interviews. Response time was very quick. The manager lied about floor expectations during the interview. The initial interview included a brief questionnaire to fill out. This would be used to assess your critical thinking skills.  This was a very typical interview process for a new graduate nurse. Nothing to expect or to be nervous about. They seem to hire most qualified applicants.", "Interview Questions": "Why did you choose this hospital?"}, {"date": "14 Oct 2015", "title": "Critical Care Nurse - BSN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Jun 2013", "Interview Descriptions": "Submitted application online, was contacted by two weeks.  Panel interview with Manager, Educator, Team Lead and Human resources.  They built up the organization so much I was excited however found out otherwise when I started working there...", "Interview Questions": "Explain a difficult patient you had to work with and how did you handle them?"}, {"date": "20 Apr 2015", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AdventHealth Tampa (Tampa, FL) in Dec 2012", "Interview Descriptions": "It is very straight forward. You are called on the phone, they ask you very straight forward if you want to interview. HR funnells apps, the supervisor in the department selects a few applicants that they like, then you come in and meet face to face with HR. They are very nice and polite. No mind game questions. Then, the supervisor will interview you and they will be very straight forward. Easy.", "Interview Questions": "They asked you questions about their specific lab to see if you are experienced. But, every lab is pretty different so I dunno."}], [{"date": "23 Jun 2014", "title": "Leadership Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at AdventHealth Tampa (Tampa, FL) in Apr 2012", "Interview Descriptions": "Initial communication was through employees that I had worked with in the past.  Very warm culture and interested in developing the personnel.  New purchase so had a lot of long term employees in leadership that did not have training as leaders", "Interview Questions": "How have you supported the mission in the past."}]]