[[{"date": "19 Jun 2022", "title": "Behavior Intervenionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Easterseals Northern California (Pleasanton, CA)", "Interview Descriptions": "I applied to Easter Seals Northern California on their website, uploaded my resume, and also filled out all fields inquiring about my work experience and education. A representative emailed me with the interview dates and times available, and all the necessary paperwork that I needed. They were pretty serious and corporate.", "Interview Questions": "They asked about my philosophy of working with children and my experience working with children of special needs."}, {"date": "29 Jan 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Easterseals Northern California (San Diego, CA)", "Interview Descriptions": "Phone interview and one on one interview with a clinical supervisor. What are strengths and weakness. How to deal with a difficult parent as well as plan for a specific client.", "Interview Questions": "Provide vignettes and possible goals for participant "}, {"date": "13 Nov 2018", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Easterseals Northern California", "Interview Descriptions": "Fairly easy. One in person formal interview. One home visit with a case manager. In person was easy if you have experience in this field. Have to answer situational questions. Home visit was fun and easy, if you have experience.", "Interview Questions": "Why do you think you’re the best candidate?"}, {"date": "19 Nov 2018", "title": "Behavior Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Easterseals Northern California in Nov 2018", "Interview Descriptions": "Two Steps, a pre-screening interview, and a follow-up interview\r\nPre-screening was done by an HR recruiter and was approximately 30 minutes followed up by a second interview conducted by 2 case managers.", "Interview Questions": "What would be the most difficult thing about this job?"}, {"date": "31 Dec 2018", "title": "Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Easterseals Northern California (Fairfield, CA) in Aug 2018", "Interview Descriptions": "Applied online and got a phone call a few days later from a recruiter who works for ESBA. She asked some general questions and made sure  I was able to do the (two then) now three week training. Then at the end, she wanted to set up an in person interview at the location I would be at. The interview overall was average and they were really nice.", "Interview Questions": "Have you worked with children with disabilities?"}, {"date": "9 Jul 2018", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Easterseals Northern California", "Interview Descriptions": "I applied online and received a call from the recruiter within a few days. After that, I was called for an on-site interview at the Walnut Creek office. After the on-site interview, the recruiter stayed in contact with me about the process. The recruiter was great to work with throughout the entire process.", "Interview Questions": "How do you deal with change?"}, {"date": "22 Aug 2018", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Easterseals Northern California (Walnut Creek, CA) in Apr 2018", "Interview Descriptions": "Simple. Applied via online, was contacted by email for phone interview screening. Moved to the formal interview which was a panel interview. I was not expecting a panel, but it was fine. The team was nice, asked about specific work experience that was not listed on the criteria for the job. Growing company, Im not sure they knew exactly what they were looking for at the time of the interview.", "Interview Questions": "Asked about Company Culture, Values & if I had done my homework on the company. Asked about my prior job experience."}, {"date": "11 Jan 2019", "title": "Program Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Easterseals Northern California (San Jose, CA) in Dec 2017", "Interview Descriptions": "Applied online, received a call from Shane, this followed with a phone screening, during the screening he mentioned I would receive an email for the interview and had my in person interview", "Interview Questions": "Name the 4 functions of behavior"}, {"date": "8 Sept 2017", "title": "Behavior Interventionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Easterseals Northern California", "Interview Descriptions": "Pretty fast process! Applied online through the Easter Seals website, received a phone interview with a recruiter a few days after. Phone interview lasted about 30 minutes. I did well on the phone interview and was offered an in-person interview during the phone interview. Interviewed in-person with the senior clinical manager at the San Jose main office.", "Interview Questions": "Why do you want to work in this ABA field?\r\nExperience regarding working with kids\r\nExplain your understanding of ABA"}, {"date": "16 Jun 2017", "title": "Behavior Interventionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Easterseals Northern California (Hayward, CA) in Jun 2017", "Interview Descriptions": "I applied online for the Behavior Interventionist position at ESBA( Hayward Office ). The process was quick. I got a reply for phone screen interview in 2 days. I did well with the phone screen interview, so they scheduled me for in person interview within a week.", "Interview Questions": "How would you play with a typical 5 year old kid?"}], [{"date": "10 Feb 2017", "title": "Program Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Easterseals Northern California", "Interview Descriptions": "There was an initial phone screen with the recruiter.  Then, they brought me in for an on-site interview.  The interview was a panel of three hiring managers.  It began with a description of the position and panel introductions.  Then, there was a 15 minute “assessment” in which you provided written answers to scenario questions related to data analysis skills.  Once the 15 minutes passed, the panel members came back into the room and asked that you discuss your responses.  The last part of the interview consisted of the panel members asking a series of standard interview questions.  The total on-site interview lasted one hour.  I was disappointed in the interview process and how I was treated.  I have a degree that they were looking for according to the job description since it was listed as a desired qualification.  However, the panel members didn't know what my degree was, and when I explained it, they were under the impression I was going through a major career change since they still didn't think my degree matched the position.  I didn't get an offer, but they did suggest I apply for another position, a Case Manager position, as they thought I would be a good fit.  I have no background matching a case manager, nor do I personally believe I am qualified for that role.  It was disappointing they had a degree in the qualifications but didn't know what it meant and then referred me to an unrelated position.", "Interview Questions": "Why do you want to work at a non-profit organization?"}, {"date": "22 Jun 2015", "title": "Behavioral Interventionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Easterseals Northern California (Pleasant Hill, CA) in Jun 2015", "Interview Descriptions": "I had two interviews, a phone interview and an in-person interview at a hiring event. Both interviews took about an hour. Both interviews covered the same things, with more detail in the in-person stage. I was primarily asked about my experience with children who were both neuro-typical and on the spectrum. In this position, personal experience counts for a lot, you do not need to have professional experience, but it doesn't hurt!", "Interview Questions": "How would you play with a 5-year-old child on the autism spectrum?"}, {"date": "30 Jun 2015", "title": "Behavior Interventionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Easterseals Northern California (San Jose, CA) in Jun 2015", "Interview Descriptions": "I was contacted by a recruiter for a phone interview. They asked a few questions about my resume. I was then scheduled to meet with the hiring manager for a face to face interview. It was fairly straight forward. I was offered a position 2 days later and start next month.", "Interview Questions": "Are you familiar with ABA?"}, {"date": "12 Jul 2016", "title": "Behavior Interventionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Easterseals Northern California (Pleasant Hill, CA) in Apr 2015", "Interview Descriptions": "Asked about weakness, strengths, past experiences, what you know about Autism and ABA. The recruiter will send out an e-mail to prepare you for it. First, you will sit in a conference room and they provided snacks, drinks and will be called one by one with different managers. The interview took about an hour and was offered on the spot. Make sure to negotiate if you have experience, my friend did that and called her the next day and accepted it.", "Interview Questions": "What do you know about ABA"}]]