[[{"date": "31 May 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rider University", "Interview Descriptions": "Applied on Handshake. Interviewed once with department head/direct supervisor. The interview was in-person and one was on Zoom. Interview consisted of mainly behavioral questions and some technical questions about the position.", "Interview Questions": "Why are you interested in this position?"}, {"date": "18 May 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rider University", "Interview Descriptions": "The interview was quick and they asked the usual behavioral questions. Following that, they asked questions that were specific to the job position as well as described basic office culture and company expectations.", "Interview Questions": "Why is the mental health of college students important to you?"}, {"date": "16 Apr 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rider University in Apr 2022", "Interview Descriptions": "Fairly easy interview process, I thought the interviewer could have been a bit more professional with some of the questions and overall experience. The salary seems to vary across departments but same title - after the interview I would not want to work here.", "Interview Questions": "Overall experience, why this position, why are you looking to leave "}, {"date": "31 May 2022", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rider University in Jan 2022", "Interview Descriptions": "Overall the interview process was quick and easy. On the whole, folks were communicative. A few follow ups needed but nothing too crazy. One point of contact who sent emails and follow ups. Would interview with them again.", "Interview Questions": "N/A"}, {"date": "11 Jul 2022", "title": "Account Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rider University (New Brunswick, NJ) in Jan 2022", "Interview Descriptions": "Very easy to sort out. Liked the way they did it. Very nice people and very thought out questions.  Liked the campus too. Met with multiple people on first day.", "Interview Questions": "What is your greatest accomplishment. "}, {"date": "19 Nov 2021", "title": "Registrar Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rider University (Lawrenceville, NJ)", "Interview Descriptions": "Interviewed with 3 individuals.  Many questions about data entry skills, clerical abilities.  Interviewers were pleasant and willing to answer all my questions.  Job was described as heavy data entry. Position would   interact with multiple departments on campus.", "Interview Questions": "Describe your experience with data entry and course management software."}, {"date": "20 Aug 2021", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rider University", "Interview Descriptions": "I had a great experience with Rider. From the day of the interview until the very last day, my colleagues, my supervisor and the staff were extremely helpful and very easy to work with.", "Interview Questions": "I was asked to describe the main challenges I encountered as a teacher.  \n"}, {"date": "28 Feb 2021", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Rider University", "Interview Descriptions": "30 minute Phone screen then a 2 hour long zoom interview with all of your potential coworkers and coworkers in a department you’d closely work with. All together about 20 people \r\ninterviewed you. I was not offered a position but even if I was, I would have turned it down. The zoom interview was way to long for a entry level position. They asked really odd questions that didn’t give them a better understanding of my work ethic or skills. One girl I believe was even trying to hide her laugh from my response. I do not believe all of these people should have a opinion on whether you’re a good fit for the position and should be kept to higher leveled staff. This interview turned me off from rider as a whole and I would not be applying to any other positions in the future.", "Interview Questions": "3 adjectives to describe Rider and then 3 words to describe rider to a student and their family. "}, {"date": "18 Jun 2019", "title": "Administrative Assistant, School of Business Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rider University (Lawrenceville, NJ) in May 2019", "Interview Descriptions": "It was well organized, with the right questions and answers exchanged.  The team clearly spelled out their expectations for the person in the position.  It was upbeat, and I got a sense that whoever got hired would be supported and empowered by a good team.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Dec 2017", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rider University", "Interview Descriptions": "My interviewer was super friendly. It felt like a conversation during our time spent. She gave me feedback on my resume and cover letter and let me know quickly whether or not I had a chance at the job.", "Interview Questions": "The interview wasn't hard at all. Just be honest "}], [{"date": "4 Dec 2017", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rider University", "Interview Descriptions": "They check to make sure you had the appropriate grade from the class and talk a little about the position and what you might have to do. They ask a few questions and then you show them your learning activity they asked you to prepare.", "Interview Questions": "How would you explain a difficult concept to a student that's just not getting it? "}, {"date": "19 Aug 2017", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rider University (Lawrenceville, NJ) in Jul 2017", "Interview Descriptions": "For my interview it was very brief. They only asked me three questions. Most of the interview was them telling me what my potential benefits might be and salary before moving on to the questions. The interview only lasted about 20 minutes, which I thought was unusual.", "Interview Questions": "What don't you like about your previous job?"}, {"date": "7 Nov 2016", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rider University (Lawrenceville, NJ)", "Interview Descriptions": "It was simple, quick, and easy. I did an application,  spoke with the manager, filled out my paperwork the next day and was able to start quickly. The background check came back quickly and I passed the drug test. So I'm assuming that made the process go more quickly.", "Interview Questions": "How much experience did I have in the job I was applying for."}, {"date": "13 Jun 2016", "title": "Senior Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 8 months. I interviewed at Rider University", "Interview Descriptions": "Very slow.  Heard from them +6 months after applying for position.  Had 2 phone interviews.  Later was interviewed by 12 people in one day (2 interview sessions with 6 people on a panel).  Too many people from across varies areas of the university were involved in the hiring process.  After being hired, several different people who participated in the interview process told me things about the other candidates, as well as things about my own interview which were inappropriate (e.g., who wanted to hire me, who didn't, etc.).  Clearly those doing the interviews were not trained on what you can and cannot discuss about candidates before, during or after interviews.  It was rather unsettling.", "Interview Questions": "N/A"}, {"date": "22 Feb 2016", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Rider University (Lawrenceville, NJ) in Dec 2015", "Interview Descriptions": "Brief to the point, informative. They understood I was nervous and were sure to keep me calm. Allowed time for me to ask questions. Seemed like they were really interested in me not just how I could help the company, but where it is I wanted to go. The employers seemed to be very kind. Seems like a place I can develop in and grow in my career.", "Interview Questions": "Where did I see myself in five years. "}, {"date": "29 May 2015", "title": "Graduate Residence Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rider University", "Interview Descriptions": "The hiring process took a while. I had to complete a phone interview with a few people and then I was invited to campus for the in person interview. I was sent to two different locations on campus and was interviewed by 4-6 current RDs on campus that lasted about 45 minutes. We took a tour of both the Lawrenceville and Princeton campus.", "Interview Questions": "What is my supervisory style?"}, {"date": "17 Dec 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rider University", "Interview Descriptions": "Began with a short phone interview with four faculty members. Contacted about one week later for an on campus visit. I was asked to complete a teaching demo as well as a research presentation.", "Interview Questions": "Very basic questions. Nothing surprising. Faculty showed little interest in my research or future directions for research. Big red flag."}, {"date": "26 Aug 2017", "title": "Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rider University in Dec 2014", "Interview Descriptions": "I had the in-person interview about a month after a phone interview. The in-person interview was a 1 full day interview from early morning through dinner. I gave a research seminar and met with many faculty and administrators.", "Interview Questions": "How could you incorporate students into your research plan."}, {"date": "11 Mar 2017", "title": "Spanish Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Rider University (Lawrenceville, NJ) in Aug 2013", "Interview Descriptions": "Simple in person interview- They asked simple background questions, about my teaching experiencer, knowledge of the Spanish language and culture, etc. Interview was short, but very comprehensive- I was hired through an ad in my local Newspaper", "Interview Questions": "How well I  think that I can teach students Spanish grammar"}, {"date": "20 Nov 2016", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Rider University (Lawrenceville, NJ) in Dec 2012", "Interview Descriptions": "The interview process was quick simple and easy. The manager at that time had me do a short application in person then reviewed it with me and the interview went from there. after finding out I had gotten the job I started some of the paperwork that same day and came back a day or 2 later to finish the rest and started immediately. They were very quick at getting me ready and started.", "Interview Questions": "Did I have experience in the job I applied for, how much, and what made me qualified for the job."}], [{"date": "10 Aug 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Rider University (Lawrenceville, NJ) in May 2011", "Interview Descriptions": "The interview process was easy. An employee referred me to the position. I send my cover letter and resume to the coordinator. And than I had a very short phone interview with the coordinator. Coordinator invited me to a 1 on 1 interview. It took like 45 minutes to 1 hour. I have been offered to job and I accepted it.", "Interview Questions": "My experience"}]]