[[{"date": "26 May 2023", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Community College of Baltimore County (Baltimore, MD) in Apr 2023", "Interview Descriptions": "Applied in February 2023. First interview in the last week of April 2023 with four people on the search committee (Microsoft Teams). Second interview with Assistant Directors (Microsoft Teams) on second week of May. Background check third week of May. Heads up, CCBC moves slower than King Syrup. Just hang in there and be patient.", "Interview Questions": "Tell me about your philosophy on academic advisement?"}, {"date": "3 Jan 2023", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community College of Baltimore County", "Interview Descriptions": "Questions about teaching philosophy, classroom management etc Next a 10min presentation of actual teaching of a given subject (emailed ahead of time) in front of interviewers acting as students. A quiz ...", "Interview Questions": "Why do you want to work for our institution?"}, {"date": "27 Oct 2020", "title": "I Hope to Work Here One Day! Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Community College of Baltimore County (Catonsville, MD) in Sept 2020", "Interview Descriptions": "It was long, but that is due to covid. I applied July 22 and didn’t hear their decision until late October.  It was a pleasant process and the people are very helpful and nice, besides it being long. The job market is difficult nowadays. There was originally a Microsoft skills test in which I did pass. The interview was virtually due for covid. I was a finalist.", "Interview Questions": "There were probably 6 questions that were relevant to the position. \r\n\r\nOne was: What do you think sets you apart?"}, {"date": "24 Jun 2020", "title": "Enrollment Specialist I - Part Time Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Community College of Baltimore County (Catonsville, MD) in Dec 2019", "Interview Descriptions": "I met with two people: my prospective boss from Enrollment Services, and a person from HR. Their questions were pre-typed, so all candidates answer the same questions. I got to meet them in the actual Enrollment Services office on the Catonsville campus, & I was given a tour on the way out. I was disappointed to not get the job, but I feel like the hiring process was fair, & I would highly recommend pursuing a job at CCBC to anybody who is looking.", "Interview Questions": "N/A"}, {"date": "21 Apr 2020", "title": "Customer Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Community College of Baltimore County (Baltimore, MD) in Sept 2019", "Interview Descriptions": "Went Really Great,was asked some regular interview questions and also so personal questions on how I would handle certain situations with customers.In general the interview went well and the interviewers had great personalities and the atmosphere was very relaxing.", "Interview Questions": "What are the key attributes of a customer care representative "}, {"date": "17 Jun 2019", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Community College of Baltimore County", "Interview Descriptions": "I sat down with two women the lead of the front desk and the  Assistant Director, Academic Advisement. I was given a paper with 8 questions. These questions are okay but they don't allow you to know the person that you are interviewing and seemed outdated. I was told I would know by the end of the week which I wasn't contacted.", "Interview Questions": "What do you know about the position?"}, {"date": "22 Nov 2018", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Community College of Baltimore County", "Interview Descriptions": "It was a one on one interview in which my transcript was reviewed, qualifications were asked, and availability was reviewed   I entered the office dressed professionally and met with the coordinator", "Interview Questions": "What makes you qualified to be a tutor "}, {"date": "20 Jan 2020", "title": "Database Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Community College of Baltimore County (Catonsville, MD) in Jun 2018", "Interview Descriptions": "The people are not expert in databases and the interview will be internet based questions and it will be a two round. First round will be with set of programmers and developers no DBA  was there to interview me, and they will test you with few SQL  code to write and the second round will be with application director and that too internet questions.", "Interview Questions": "Patching, cloning, DR, RMAN Backups"}, {"date": "25 Nov 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Community College of Baltimore County (Essex, MD) in Oct 2015", "Interview Descriptions": "The interview comprised of my immediate boss, HR, and the Dean of the school. The mood was lighthearted. My immediate boss described my role. Each member there looked through my resume. They asked some questions and allowed me to ask a number. It wasn't too bad.", "Interview Questions": "What do you think CCBC can do for you?"}, {"date": "20 Jul 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community College of Baltimore County (Essex, MD) in Aug 2015", "Interview Descriptions": "The process was very lengthy. It was intimidating because there was a panel of 7 people asking questions were easy to answer, but the second portion was difficult because the instructions were vague. They are very bad at corresponding after the interview, so you are left in limbo wondering if you will get a second interview or if you are out of the selection pool.", "Interview Questions": "The questions were relevant to the position and your goals if you were to get the position."}], [{"date": "23 May 2015", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Community College of Baltimore County (Essex, MD) in Apr 2015", "Interview Descriptions": "Had to take 5 tests in typing, word, outlook, excel, powerpoint which lasted about 3.5 hours to 4 hours; very tiring and you really could not move from your chair till you were done.  Had two interviews six months later after tests in April of 2015; one was at Essex and Dundalk. Was hoping to work with students; however both jobs I interviewed for were back in corners and the placed seemed very dull and  slow; the interviews were done during down times at the college so perhaps that was why.  Was not impressed with the overall environment; and one job I did not get the other job still waiting to hear back. This college has funding from grants, the state and county so it takes a lot of time to get an interview and/or selected.", "Interview Questions": "What would you do in a conflict, weaknesses, strengths, example of bad customer service experience and how you handled it? Why did you pick this place to work? What can bring that others can't?"}, {"date": "25 Apr 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Community College of Baltimore County (Bel Air, MD) in Aug 2014", "Interview Descriptions": "Resume and previous work experience. My previous work experience spoke for itself. I had a well establish business, as well as teaching in the interior design profession at other colleges for a number of years. I was approached about being hired as an adjunct faculty member.", "Interview Questions": "Would I be willing to teach two or three classes a semester?"}, {"date": "2 Apr 2014", "title": "Testing Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community College of Baltimore County", "Interview Descriptions": "Was notified by email that I will have an interview at the campus the position was being held at. The interview was a relaxed feeling and asked he normal why do you want to work here questions. Then I was informed by telephone I would have a 2nd interview at a different campus to meet with a different set of people. During this interview, the questions were much tougher, they used words I never heard of and just tried to make it difficult.", "Interview Questions": "The questions weren't difficult is was the extensive vocabulary the interviewer used. It was too many words being used to ask a simple question."}, {"date": "28 Mar 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community College of Baltimore County", "Interview Descriptions": "I was interviewed over the phone, then came in for a brief in-person interview. I was given the contract and course materials on the spot.", "Interview Questions": "None. The questions were straight forward and what I expected."}, {"date": "13 Feb 2016", "title": "GED Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Community College of Baltimore County (Hunt Valley, MD) in Feb 2014", "Interview Descriptions": "I meet with the Pearson Vue Director for CCBC in Hunt Valley. I was asked to apply online via the College Website. Then I was required to take the Pearson VUE training and test for this position. After I passed, I was able to begin employment within the week.", "Interview Questions": "If I was comfortable taking the training test."}, {"date": "26 Mar 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Community College of Baltimore County (Catonsville, MD) in Dec 2012", "Interview Descriptions": "I was informed about the position through a friend, who found a listing for the job through my school's online job opportunity resource. I suppose that there is some sort interest in a particular brand of potentials for these jobs.", "Interview Questions": "Nothing was overly \"difficult.\" One that individuals should be prepared for: \"Tell me about a time when you faced a challenge while leading a group. How did you handle it?\""}, {"date": "15 Nov 2012", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Community College of Baltimore County (Catonsville, MD) in Jul 2012", "Interview Descriptions": "The interview was set up via e-mail. I met the director of the department and two of her staff. The interview was a series of 8 questions that I had to answer in front of them all. I was very nervous;however, I felt the interview went well.", "Interview Questions": "I needed more training in Microsoft Word/Excel and stated I was to attend a certification program to upgrade my computer skills. The eight questions were handed to me in paper format and were difficult questions to answer. Some of the questions were to be answered in example format and were in 3 part question format. Many examples needed to be given. I offered what my particular skill set was and how it could benefit the college. I used my resume to help answer some of the eight questions and this helped me to elaborate and give more specific answers to their questions."}, {"date": "11 Dec 2014", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Community College of Baltimore County (Catonsville, MD) in May 2012", "Interview Descriptions": "I graduated from the college in 2012 and obtained the opportunity to interview with the HR department through the career development center. The interview process did not involve any behavioral questions but clearly focused on the educational experiences that I had. It was very important that you meet the minimum qualifications for the position. That is the requirements section that makes all the difference to them as an organization. Any certifications and other education went a long way to securing the position. Who you know in the organization is critical the recruiters and internal career center determine who gets sent to the hiring managers. I was lucky enough to meet directly with the hiring manager who was new and was unaware of the political atmosphere.", "Interview Questions": "Getting past the requirements for education. Even though it was from their institution, "}, {"date": "2 Nov 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Community College of Baltimore County (Dundalk, MD) in Aug 2011", "Interview Descriptions": "I only had one interview in which the director was extremely kind, motivated and excited to hire me.  She made me feel that I would be a highly valuable contributor to her program.", "Interview Questions": "How would you manage an extremely disruptive student, who had committed numerous offenses during a particular class period?"}, {"date": "16 Oct 2013", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Community College of Baltimore County (Baltimore, MD) in Jun 2009", "Interview Descriptions": "series of questions on teaching philosophy and how I would handle various classroom situations.  I had to grade and comment on a set of student assignments.", "Interview Questions": "Why do you want to teach at a community college?"}], [{"date": "18 Aug 2011", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Community College of Baltimore County (Baltimore, MD) in Apr 2009", "Interview Descriptions": "I knew the director of the department. I came in and interviewed with the director for about an hour. Received a call 2 days later informing me that I got the job.", "Interview Questions": "Give an example where you overcame adversity to get a job done."}]]