[[{"date": "30 Mar 2023", "title": "Client Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Volunteer Behavioral Health Care System (Chattanooga, TN) in Feb 2023", "Interview Descriptions": "L1st interview in person with the director, 2nd interview was virtual with another staff member. Questions were asked in Both interviews. A description of yhe job and the duties were discussed along with benefits.", "Interview Questions": "Ehat was My job experience"}, {"date": "1 Aug 2022", "title": "Child Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Volunteer Behavioral Health Care System", "Interview Descriptions": "Easy and laid back interview. They asked me fairly standard questions (strengths and weaknesses, goals, etc). Everyone was friendly and encouraging. I left having a strong impression that I had the position.", "Interview Questions": "N/A"}, {"date": "16 Jun 2022", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Volunteer Behavioral Health Care System (Nashville, TN) in Feb 2022", "Interview Descriptions": "The Hiring process was long but simple. Background information took over a month to come back. Onboarding was easy and system was user friendly. The supervisors were friendly and communicated the job role well.", "Interview Questions": "Why do you want to work here? "}, {"date": "8 Jul 2018", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Volunteer Behavioral Health Care System (Chattanooga, TN) in Jun 2018", "Interview Descriptions": "Panel interview with questions about your schedule and what would make you a good fit for their team. The atmosphere was very relaxed and I felt comfortable in the room.", "Interview Questions": "What makes you feel you are able to do this job"}, {"date": "6 Sept 2020", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Volunteer Behavioral Health Care System in Jan 2016", "Interview Descriptions": "The interview process is very relaxing and the position is explained thoroughly. You are able to ask questions without feeling intimidated and receive answers that you are needing. A great experience for those who aren’t the best at interviewing.", "Interview Questions": "What can you bring to the position?"}], []]