[[{"date": "25 May 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Alcoholics Anonymous", "Interview Descriptions": "The process was very slow. Everyone was very nice and available. It started with the hr and continued with the heads. It was focused on my expectations, soft skills and cultural fit. No technical skills were assessed.", "Interview Questions": "The questions were only soft skills related"}, {"date": "14 Mar 2023", "title": "Head of Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Alcoholics Anonymous in Jan 2022", "Interview Descriptions": "Simple questions, very structured process. It was pretty easy. In the end I had a chance to ask questions. The initial screening process began with a brief phone call from the HR representative. They asked about my experience, career aspirations, and what attracted me to the company. The representative was knowledgeable, professional, and polite. The call was followed by an email with an invitation to a video conference interview with the hiring manager.", "Interview Questions": "What is your motivation for applying?"}, {"date": "9 May 2023", "title": "Auxiliar Administrativo Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Alcoholics Anonymous (Madrid) in Jan 2022", "Interview Descriptions": "No me dieron muchos detalles. Fue una entrevista muy rapida y no me cogieron. No me dijeron el sueldo que recibiría pero parecia ser una buena opcion para empezar en el sector social. No tengo claro cual es el proceso de seleccion.", "Interview Questions": "Cuanto deseas ganar al mes?"}, {"date": "1 Dec 2020", "title": "Tester Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Alcoholics Anonymous", "Interview Descriptions": "the interview process was easy and good and they asked easy question for the profile. For next round they went to details of project and more technical questions and they kept me waiting for long time", "Interview Questions": "Tell me about yourself, explain the project in detail"}, {"date": "16 Nov 2020", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alcoholics Anonymous in Aug 2020", "Interview Descriptions": "It was a good process, they keep in mind everything while selection of their candidate. The process is very smooth going one with good interviewers. One should be prepared before appearing for the interview.", "Interview Questions": "Normal question "}, {"date": "5 Feb 2023", "title": "Referee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alcoholics Anonymous (Milwaukee, WI) in Apr 2020", "Interview Descriptions": "Simple and not over the top with unnecessary verbiage. Talk about family history and local upbringing. Discussed the origins of the company and future growth. Mostly of the discussion was educational in nature.", "Interview Questions": "Why do you want this?"}, {"date": "29 Apr 2017", "title": "Assistant Director of Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alcoholics Anonymous (New York, NY) in Mar 2017", "Interview Descriptions": "Very straight forward with no trick questions. One thing I appreciated, and I realize  not everyone may, was that during my visit I met with four different people for approximately one hour each.  Doing the math, that's four plus hours of interviewing. I found it practical and, quite honestly, exciting.", "Interview Questions": "What is your management style?"}, {"date": "3 Jul 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Alcoholics Anonymous (New York, NY)", "Interview Descriptions": "I was interviewed and tested for almost 3 hours and I was not offered the position. Why waste so much of someone's time if you have no intention of hiring them?", "Interview Questions": "How would you handle a situation where a coworker was was rude or insulting to you in front of other coworkers?"}], []]