[[{"date": "14 Mar 2023", "title": "MRI Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Community Healthcare System in Mar 2023", "Interview Descriptions": "The HR department was very accommodating working around my current schedule to interview. The questions were direct and applicable to the position which I appreciated. It also included the manager in the same interview who was abke to answer many of the questions i had.", "Interview Questions": "What do you like best about your current job"}, {"date": "16 Jan 2023", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Healthcare System", "Interview Descriptions": "It was easy. Also this is pre-Covid. So this was a in office position. This also was a muti interview. I had more than one person interview me. It was the normal questions and easy to answer. They talk about the company and the duties.", "Interview Questions": "Why you feel that this position is right for you?"}, {"date": "9 Nov 2022", "title": "Epic Support Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Community Healthcare System", "Interview Descriptions": "The interview process was initially normal. However, when I sat down for the interview the manager I spoke to seemed unorganized in her speech pattern and confused. The process left me feeling too uncomfortable to accept the position I interviewed for.", "Interview Questions": "The interviewer Christina Holzendorf asked me questions I found to be stange and not related to the job I was interviewing for."}, {"date": "18 Jun 2021", "title": "RN Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Healthcare System", "Interview Descriptions": "Standard questions and great detail on job descriptions. Hiring manager and HR were very welcoming and made sure I was well-informed on the job. I felt open to give well thought out answers to their questions.", "Interview Questions": "What field of nursing do you want to go in?"}, {"date": "20 May 2021", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Healthcare System (East Chicago, IN)", "Interview Descriptions": "The initial  interview was with HR and one with Unit Manager. It was overall average and everyone was polite and accommodating. I was given a tour of the unit and an overview of the expectations.", "Interview Questions": "Mainly related to Nursing skills and desired hours. "}, {"date": "13 Jan 2021", "title": "General Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Healthcare System", "Interview Descriptions": "Straightforward, interviewed by HR and Manager of department . Standard questions pertaining to position. Informal meeting in HR office nothing difficult. Interview lasted maybe 30 minutes, received call back a week later.", "Interview Questions": "How do you resolve conflicts."}, {"date": "19 Aug 2019", "title": "Insurance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Community Healthcare System", "Interview Descriptions": "Received an interview invite via email. In person interview followed then waited a week to here back. Hiring process was very timely and always felt in contact with the employer.", "Interview Questions": "Are you familiar with Microsoft office?"}, {"date": "12 Feb 2016", "title": "Unit Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Community Healthcare System", "Interview Descriptions": "Applied online, received a call to meet w/administration and department heads.  Had an interview with 5 people.  Fielded their questions, although none specific to the unit applied for.  Offered \"Plan of Action\", but didn't get to verbalize it in it's entirety.  Felt that the decision was already made before the completion of the interview. Only a few of them asked questions and no questions were asked of my abilities, experience, and/or management style.", "Interview Questions": "Was never asked management questions.  Just asked why I felt I was the best person for the job."}, {"date": "11 Mar 2015", "title": "Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Community Healthcare System (Munster, IN)", "Interview Descriptions": "Interviewed by HR and Office Manager. I was asked about previous employment and skills gained. Asked a few questions about how I might handle some customer service situations. Took typing test, as the position required data entry.", "Interview Questions": "Interview lasted 15-20 minutes. Explained skills and past employment. Few behavioral questions."}, {"date": "30 Jul 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Community Healthcare System (Munster, IN) in Jan 2015", "Interview Descriptions": "I got called in for a face to face interview with the HR specialist and the supervisor I would be working for. The interview process was a lot about me as a person and my work ethic and morals. They asked about experience as well but mainly how I work with others and what I would do in certain situations. Typical interview questions.", "Interview Questions": "Tell me an instance  where one of your co-workers and you got into a disagreement and how did you handle it? "}], [{"date": "15 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Community Healthcare System", "Interview Descriptions": "I came in as a nurse fellow. Didn't need to interview too much really after I had performed well already working in the dept.", "Interview Questions": "When switching depts. I have been asked about what quality improvements or projects I had been apart of."}, {"date": "29 May 2013", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Community Healthcare System", "Interview Descriptions": "I meet with recruiter first. Afterwards I met with the hiring manager. The questions were nothing unexpected. A few days later a second interview was set up with the hiring manager's manager. The second round was tougher but I still had a good feeling when I left.  The recruiter called back with an offer several days later.", "Interview Questions": "How do I think I can quickly adapt and learn healthcare nuances?"}, {"date": "30 Dec 2017", "title": "Dietary Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Community Healthcare System (Hobart, IN) in Feb 2013", "Interview Descriptions": "They ask you basic questions. They like to ask \"situational\" questions. They review your qualifications. It's a pretty easy interview with the manager and human resource representative both there. The HR rep asks most of the questions. They explain benefits, raises, etc.", "Interview Questions": "Tell us a time when you went above and beyond to ensure customer satisfaction. "}, {"date": "14 Oct 2012", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Community Healthcare System (Munster, IN) in Nov 2011", "Interview Descriptions": "Encouraged to go for this position by someone who already worked with Epic for CHS.  I had to give a short 15 minute presentation to demonstrate my teaching style.  I was asked about my experience with Epic and what interested me to move to this department.", "Interview Questions": "How do you handle a question from an end user that you do not know the answer to?"}]]