[[{"date": "1 May 2023", "title": "Technologist Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Mar 2023", "Interview Descriptions": "Phone screening asked about salary expectations, preferred shift, what do you look for in a job, etc. Then you do a recorded interview with 5 questions about past work experience. If they like your answers, you get an interview with people from the lab.", "Interview Questions": "Describe your duties at your previous job. What management style do you prefer? What do you know about the company? How would your coworkers describe you?"}, {"date": "3 May 2023", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Orange, CA) in Mar 2023", "Interview Descriptions": "Interviewer had generic questions.. asked about job background, reasons why you want the job, why you would be a good fit for the company and times you’ve had to deal with complicated situations. Generally quick interview", "Interview Questions": "Why you are considering the job position Your work history Pay expectation Asked about times I’ve been placed in difficult situations and how I handled it Willing to drive and speak to homeless population Description of job title etc"}, {"date": "14 Jan 2023", "title": "Agile Scrum Master Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Pretty seamless. A member of the team reached out to me to talk through the interview steps before getting an email for a virtual screening interview. A little weird talking to a computer but overall good. I wasn't selected for the next step but I enjoyed the communication all through the process.", "Interview Questions": "Basic screening questions introducing yourself, experience and managing teams"}, {"date": "19 Aug 2022", "title": "Program Manager (Automation) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jul 2022", "Interview Descriptions": "30 minute zoom to see if potential candidate.  Then 1 hour interview on sight.  After this, they will do another series of interviews, didn't get to the next round.   The showed their process and gave a general tour of the facility.  ", "Interview Questions": "Describe a situation and explain the process how you solved it?  "}, {"date": "21 Apr 2022", "title": "ITCS Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Three rounds of interviews with each interview consisting of different folks from various teams.  The first two interviews consisted of standard interview questions.  The last interview the questions were sent to us so that we could provide a more robust and carefully thought out answer.", "Interview Questions": "Name a time where there was a conflict with another associate or client and how was this matter resolved?"}, {"date": "19 Apr 2022", "title": "Clinical Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Application automatically triggers a HireVue video interview. Mostly standard behavioral interview-type questions. Question shows on screen, you have a minute to think about it, and then you talk to the screen. You never see a human being, it's a soul-less process, ugh.", "Interview Questions": "Why do you want to work at ARUP? Tell us about a time you dealt with a difficult coworker."}, {"date": "19 Apr 2022", "title": "Clinical Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Application automatically triggers a HireVue video interview. Mostly standard behavioral interview-type questions. Question shows on screen, you have a minute to think about it, and then you talk to the screen. You never see a human being, it's a soul-less process, ugh.", "Interview Questions": "Why do you want to work at ARUP? Tell us about a time you dealt with a difficult coworker."}, {"date": "12 Oct 2021", "title": "Med Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "There were two techs.  The interview was 30 minutes of really lame questions.  They were condescending, and I was very uncomfortable.  It was a remote interview so that didn’t help. I felt like they didn’t get to know me at all.", "Interview Questions": "Tell us a time when you did not follow standard operating procedure. "}, {"date": "18 May 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Long process, I had 3 interviews over a two week span but it was a great experience. Very approachable interviewers, common interview questions, and it was easy to be myself", "Interview Questions": "Situational interview questions- \"what if..\" situations"}, {"date": "10 Jun 2021", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Associated Regional and University Pathologists in May 2021", "Interview Descriptions": "Rushed interview process (all segments within one week) and disorganized/chaotic hiring process.  Last minute phone screening and demand for references on the Friday afternoon prior to Memorial Day weekend. I wouldn't recommend the pressured process which we can assume is congruent with the culture", "Interview Questions": "Conflict in the workplace and how you dealt with it."}], [{"date": "12 Dec 2020", "title": "Medical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT)", "Interview Descriptions": "Slightly disappointing process, took a long time and very impersonal.   After being contacted with a generic email, I could respond through a third party online system to answer questions on video...you read the questions and then talk through an answer for about 4 minutes each.  This is convenient for both you and the company, but hard to gauge compared to a conversation/interview.\n\nThen in the next step I had a couple of days to submit a writing test on medical content.  After I sent the document back and had a test received response, it took two weeks until I heard back again to move on to the next stage.  By this point I had already accepted another position.\n\nSo after many weeks and submitting a test that takes a few hours, I never even talked to a person at the company or was informed the specifics of the role, etc.  I understand that this would have been the next stage of the interview process, but this is already after a lot of time investment from the applicants.", "Interview Questions": "What is your experience working with a technical writing team?"}, {"date": "21 Jan 2020", "title": "Lab Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Phone interview was fine, I was asked basic questions. Then I did another video interview but never heard back from them. They took about 2 months to fill their positions.", "Interview Questions": "How did you find this job? Tell me about yourself, etc. "}, {"date": "29 Nov 2019", "title": "Client Services Agent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Nov 2019", "Interview Descriptions": "I applied for the part-time at home client services agent position on a Sunday and received a follow up email from the talent acquisition team promptly the next day with a request for a phone interview.  I quickly found out that in order to work from home you first need to work on-site for 8 months; 9 weeks of training and 6 months of observation and testing. The member of the hiring team I spoke with was very straight-forward and friendly and encouraged me to apply once I was ready to commit to working on-site for at least 8 months.", "Interview Questions": "What interested you in this position?"}, {"date": "3 Mar 2022", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Associated Regional and University Pathologists in Aug 2019", "Interview Descriptions": "Initial interview was done over the phone, and then an in-person interview was conducted with the manager of the team. Both the phone interview and the in-person interview had a friendly environment, and questions were readily answered.", "Interview Questions": "What made you interested in this position?"}, {"date": "6 Jun 2019", "title": "Technologist Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in May 2019", "Interview Descriptions": "Took about an hour, went well. Following the interview, went on a tour of the facility.  I was interviewed in a group setting that included 3 individuals. Asked basic questions and covered what the job was about and what it entailed.", "Interview Questions": "What role do you usually take in a team environment?"}, {"date": "4 Mar 2019", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "It is a PhD level interview.  First there was one phone interview. Then wait for a few weeks, they host one Skype group interview. There was no presentation needed. Basically like academia style questions.", "Interview Questions": "Why do you apply this position"}, {"date": "14 Jun 2019", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jan 2019", "Interview Descriptions": "Applied online through internal job board (was already an employee in a different department).  Onsite interview with supervisor, division manager, and a current IT Analyst was scheduled about 2 weeks after applying.  Interview was fairly simple with most questions based around who you are as an employee and what you would bring to the table in that department.  There were maybe 2 technical questions related to IT and were easy to answer if you have any previous experience with IT.  Overall, the interview was very upbeat and positive and everyone seemed to be happy to be there.", "Interview Questions": "Given the following algorithm, create a flowchart depicting the logic and provide the answer of the output."}, {"date": "27 Nov 2018", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Associated Regional and University Pathologists (New York, NY)", "Interview Descriptions": "I was scheduled for a phone interview, and honestly the whole process was very disappointing.  I really wanted to work for this company, but during my entire phone interview it seemed like the interviewer was talking to someone else. For instance when they asked how I knew about ARUP I mentioned that I discovered the company when looking for internships for pathology, and she said \"so your uncle works here?\" ...no. I never mentioned that. When asked what kind of environment I like to work in I said I prefer fast paced environments that keep me busy, and she said \"so, easy paced?\" No! I told her with my interest In pathology and my certificate in phlebotomy I really want to work in a healthcare field and get my foot in the door and she agreed and started to mention that job security is important, and I never once said anything about job security.  \nMy phone interview started late, and ended late, so I didnt get to ask any of my prepared questions either.", "Interview Questions": "what things are important to you"}, {"date": "21 Aug 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "There was a typing test taken with HR, they have recruiters that will call and do a basic over the phone interview. Most of the recruiters do the interviews as well. It is a bit more of a lengthy process, they do call references.", "Interview Questions": "Scenario based questions"}, {"date": "17 May 2018", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "There are three steps for interview process. the first one is Phone interview for twenty minutes. She was very friendly and kind, She asked me about why am I interested in ARUP Laboratories and so on... \r\nPhone interview was really difficult to me. Those quesions was different than I expected. Have in person interview with supervisor\r\nIt was not a difficult. t", "Interview Questions": "Some questions about ARUP laboratories"}], [{"date": "14 Jul 2022", "title": "Advance Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Mar 2018", "Interview Descriptions": "Very thorough. They asked a lot of great questions and were up front about everything. They explained what the job would entail and who I would be working with. They had me do a typing test to make sure that I could type at least 60 wpm as well.", "Interview Questions": "My experience with Microsoft office"}, {"date": "8 Mar 2018", "title": "Software QA Analyst II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Feb 2018", "Interview Descriptions": "I applied this company through recruiter in the beginning of February, then recruiter called me and invited to the interview with them (recruiters) by f2f. One of their requirements was a candidate should have located only in Salt Lake. I pass my interview with recruiter, but could be make it by phone like another recruiters do. After couple days recruiter called and invited me for the interview with a company by f2f. They were grateful and asked me a lot of questions like around 20 like about my experience, stress management with some examples, about qa process and some stupid questions like what will my action if I get a very hot steak on lunch. Those guys were kind of strength and unspeakable, I mean didn't support our conversation, just asked and no more. Recruiter didn't called me during a week after until I texted him a message. I haven't been selected because they feedback like that interview was kind of hard for me and seemed like word's war however I felt myself good and even didn't stress.\r\nAll interview process took 1 month. I spent the time for preparing and after got \"interview seemed like word's war\". But they even did not asked me to test any issues or devises. Hm... Seems like a company has unprofessional team and didn't prepared for the interview.", "Interview Questions": "1. About my experience.\r\n\r\n2. Stress management (asked like 3 times during the interview) with some examples. What will I do if I do not agree with my supervisor and others managers.\r\n\r\n3. About qa process like what will I do if I have not time for the testing.\r\n\r\n4. Stupid questions like what will my action if I get a very hot steak on lunch."}, {"date": "31 Dec 2017", "title": "Processing Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT)", "Interview Descriptions": "Interview was typical for a very large corporation. It was short and to the point. You were taken through the company on a tour with a large group of people. After the tour your interview was scheduled if you were still interested. You could tell that the company had a fairly high turnover rate.", "Interview Questions": "If you could deal with processing samples such as urine or blood on a minute to minute basis."}, {"date": "2 Nov 2018", "title": "Specimen Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jan 2018", "Interview Descriptions": "Simple phone call interview that will lead if you are chosen to in person interview and quick easy few simple PC tests.  When you pass all of those you will get an offer of employment and have to do a background check, drug test.  Pretty standard things that any job does.", "Interview Questions": "Previous work experience.  How you heard about the job you are applying for."}, {"date": "1 Jul 2019", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Associated Regional and University Pathologists in Dec 2017", "Interview Descriptions": "First there is a recorded interview that you submit online with very generic questions. If HR likes it they will send it to managers who will set up an in person interview", "Interview Questions": "They asked a lot of generic question as well as experience with the department"}, {"date": "30 Jul 2017", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "The entire interview was them asking whether I had engineer level knowledge of each required item.\n\nThey had no concern of competing technologies that function just the same with a different interface.\n\nRather than finishing the interview they stopped, and guided me out so they could go to lunch", "Interview Questions": "have you ever dealt with ad pertaining to the fsmo roles."}, {"date": "17 Aug 2017", "title": "Client Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jul 2017", "Interview Descriptions": "I interviewed for several entry level positions.  There was two or three people who did the interviewing .   Someone from HR calls you to set up a time and place they follow up the phone call with an email that includes a map to where your interview will take place.  There was no reason for me not to get a job offer they were all entry level jobs.  All I can think of is this company doesn't hire anyone who is over 55 yrs old . I have 20+ years of customer service with a strong work ethic.", "Interview Questions": " Questions were describe a difficult challenge you have had with your co-worker and how did you handle it. Or what is your motto.  Describe what you do on a daily basis. "}, {"date": "24 Jul 2017", "title": "Team Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists in Jun 2017", "Interview Descriptions": "After interacting with people from this company, I can truthfully say I would never want to work there. I told HR to please never contact me again.\r\n\r\nI applied online. Completed a phone screen, completed a digital video interview, and later interviewed onsite.\r\n\r\nThe process seems normal here but this company's execution is awful. HR no-showed on our first scheduled phone call. Also, using video tools such as HireVue isn't a good way to interview candidates because it's a one-way conversation and doesn't give the candidate an opportunity to ask questions. \r\n\r\nLastly, the hiring committee wasn't really filled with people with actually hiring authority except for one person but were people on the same team. Sounds like a good idea except those people have no experience recruiting or hiring talent. Most just sat there with a deer in the headlights look on their face adding no value to the conversation or process. I don't think the people involved knew what they were doing.\r\nAfterwards, I was informed it would be weeks until I would hear back.\r\n\r\n They brag about wanting to raise the level of innovation at the company but none of their questions were technology related. And no skill assessments were about how well someone could bring innovation to the company. Also, if they want talented people then they should treat candidates better and make the process more congruent with what they say they want. This is just another incongruent company who says one thing and does another.", "Interview Questions": "How have you handled difficult feedback?"}, {"date": "16 Jun 2017", "title": "Team Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jun 2017", "Interview Descriptions": "HireVue (recorded interview): the platform allows 3 days for a response before invalidating.  There are 3 or 4 practice questions, to allow the interviewee to become familiar with the technology.  After beginning a real question, one cannot start over or stop the 3 minute clock.", "Interview Questions": "What is the toughest feedback you've received from a boss, and how did you handle it?"}, {"date": "24 May 2017", "title": "Technologist I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in May 2017", "Interview Descriptions": "Interview was performed by technologist supervisors, and lasted about 30 minutes. The questions were straightforward and basic. Some of them were centered on previous experiences in the lab. However, there was also a balance of questions about problem-solving skills, experience working in a team, and communication abilities.", "Interview Questions": "Describe one experience where you had to troubleshoot a problem in the lab."}], [{"date": "9 Oct 2016", "title": "Customer Service Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "Had to do video interview first from home. Was odd but not hard. In person was low stress, asked basic questions about customer service experience. Took tour and was offered position next day.", "Interview Questions": "Customer Service experience"}, {"date": "8 Oct 2016", "title": "Salesforce Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Associated Regional and University Pathologists in Jul 2016", "Interview Descriptions": "The actual job expectations did not match what was listed in the posting, and neither did the interview questions. I felt the interview went great people seemed friendly. The HR manager let me know weeks after they were still considering my candidacy and that was the final word I heard from them.", "Interview Questions": "Describe a project you carried out with Salesforce that went well."}, {"date": "4 May 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Apr 2016", "Interview Descriptions": "I was first contacted by a recruiting agency that setup the interview. I met in person at their offices and went through a standard interview. After that they had me do a technical interview. It wasn't so bad, and if you know your programming logic it should be just fine. They let me do psuedocode for my answers so I didn't have to hand write code.", "Interview Questions": "FizzBuzz"}, {"date": "16 Jul 2016", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Associated Regional and University Pathologists (Midtown Post Office, GA) in Mar 2016", "Interview Descriptions": "Shake there hand introduce yourself show then your resume tell us same thing about the job you are apply for.Tell use about your jobs on your resume what makes you a good candidate.", "Interview Questions": "Then would ask about yourself or tell same thing about your self"}, {"date": "23 Aug 2015", "title": "Medical Technologist/Technologist II Or Technologist Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jul 2015", "Interview Descriptions": "I submitted my application online early July and got on onsite interview about two weeks later asking to come out for an onsite interview. It was a very friendly environment. I was interviewed by two supervisors for the lab that alternated asking me questions about my lab experience and how I handle various situations.", "Interview Questions": "Describe a time you disagreed with a coworker, and how did you handle it?"}, {"date": "6 Jun 2017", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in May 2015", "Interview Descriptions": "They ask you basic questions. Questions vary because this company consists of different labs. They will also ask how you work under pressure since it's a very stressful job.it would take about two weeks to hear back from the interview and the hiring process takes about a month.", "Interview Questions": "What drives you to do what you do?"}, {"date": "5 Mar 2015", "title": "Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "The process took weeks between submitting my application and receiving a call. After an initial phone interview things happened quickly. I interviewed with multiple supervisors in one interview and received multiple offers only a few days after the interview.", "Interview Questions": "General interview questions: describe a time you faced adversity and how did you overcome it...blah blah blah"}, {"date": "27 May 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Mar 2015", "Interview Descriptions": "They gave me time to tell about myself, and then they read off many standard interview questions which I felt helped me tell more about my personal experiences.  The odd thing about the interview was that I was on one end of a conference room while the two interviewers were half way across the room.", "Interview Questions": "Describe a situation where your project struggled?"}, {"date": "25 Feb 2015", "title": "IT Business Systems Analyst II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Feb 2015", "Interview Descriptions": "Approximately one week after submitting my application online, I was invited to participate in a digital interview. The digital interview took about 30 minutes to complete and mostly involved questions about relevant work experience, basic qualifications, industry background, etc. \r\n\r\nThree days after the digital interview, I was contacted by a corporate recruiter about scheduling an on-site interview with the hiring manager.\r\n\r\nThe on-site interview was conducted by the hiring manager and senior BA on the project. Overall, the interview was more difficult than I've experienced at other companies. Lots of questions that asked me to describe specific past experience, e.g:\r\n\r\n- Describe a project where you made an improvement.\r\n- Describe a scenario where you had a disagreement or difference of opinion with a developer.\r\n- Describe a project that pushed your analytical skills to the limits\r\n- Describe a scenario where you had to choose between a strategic or tactical approach.\r\n\r\nThese were accompanied by a handful of technical questions aimed to determine how well I could communicate with an implementation team.\r\n\r\nA few days later, I was invited to participate in a second on-site interview. This time with the project manager. The second interview followed the same course as the first--again, lots of experience-based questions and anecdotal answers.\r\n\r\nI received of offer of employment about two weeks after the second on-site interview. During that time, I was frequently in touch with the corporate recruiter who was very forthcoming about the hiring process and my application status. At no time was I ever in the dark about my candidacy. \r\n\r\nI declined the position in favor of a more competitive offer, but overall, my interview experience at ARUP was very positive.", "Interview Questions": "Describe a project that pushed your analytical skills to the limits"}, {"date": "6 Feb 2018", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jan 2015", "Interview Descriptions": "First they give an electronic interview where they ask questions and give you thirty seconds to come up with a response. If they like you,  they will give you a personal interview.", "Interview Questions": "Have you ever had a difficult coworker."}], [{"date": "15 May 2018", "title": "Laboratory Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Aug 2014", "Interview Descriptions": "Professional.  They get a lot of practice due to the high employee turnover.\r\nI  was interviewed in-person by  a panel of employees.  It was relaxed and comfortable.", "Interview Questions": "How did you handle conflict in your last job?"}, {"date": "2 Apr 2014", "title": "Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Mar 2014", "Interview Descriptions": "They use this HireVue process.  You're talking to a computer.  This is a strong indication as to what you can expect from this company.", "Interview Questions": "Questions are very detailed on minute topics.  It is hard to say what was most difficult.  Lot of bozos behind the glass."}, {"date": "9 Oct 2013", "title": "ASM Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Sept 2013", "Interview Descriptions": "I completed the video interview at the ARUP human resources department. In hindsight I would have liked more control over the environmental backdrop and lighting. I found the HireVue format interesting and appreciated having a practice video questions option. I was called back for an in person interview. The group interview included the department supervisor and the Automated Specimen Management trainer.", "Interview Questions": "The trainer asked whether I had a problem with repetitive processes."}, {"date": "21 May 2014", "title": "Software QA Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Aug 2013", "Interview Descriptions": "Applied online, received an email in 2, 3 days that Resume was shortlisted and had to give a video interview (offline) which lasted for about 30 minutes. General questions were asked. \r\n\r\n1. Received a call from the HRD and was given a date and time to attend the interview\r\n2. Supervisor walked down and received me at the reception. Interview was conducted by the Director and the Supervisor. Both were very friendly and listened well. \r\n3. Only relevant questions specific to the position were asked. \r\n4. Questions about experience, stress management, timeline adherence, assets were also asked. \r\n5. Details about the contractual tie-up for hiring were discussed\r\n6. Got a call from the HRD the same day that I was selected and was asked to come back and meet the HRs for pay negotiations. \r\n7. Details of the hiring payroll consultancy were shared and was asked to finish formalities there - like background verification and drug test\r\n8. Process took 2 weeks.", "Interview Questions": "About handling critical scenarios as a team player with a troublesome team mate. \r\n\r\nQ : What would you do if one of your team mates is too nosy and picky of what you do and keep making suggestions? He is your senior and is experienced in what you do. How would you handle it?"}, {"date": "20 May 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists in Aug 2013", "Interview Descriptions": "I applied online, had a phone interview where they went over my resume and asked questions, then had an in person interview where they asked questions about specific experiences and how you handled them.  I got the offer a couple days later and had to wait for 3 weeks for my start date due to background checks.", "Interview Questions": "Tell me about a time that you ran into a problem at work, or Tell me about a time when you had a conflict with a co-worker"}, {"date": "31 May 2017", "title": "Pricing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jul 2013", "Interview Descriptions": "I applied for this job online through the company's website.   I was called by a department admin and told I was selected for an interview , but I had just accepted a job offer elsewhere and declined.  Several years later, I reapplied online and was eventually selected for an onsite interview where I met with the hiring manager and two other senior members of the team.", "Interview Questions": "What have you done to further your skills since the last time you applied to this position?"}, {"date": "12 Mar 2013", "title": "Writer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Associated Regional and University Pathologists", "Interview Descriptions": "I applied online and two months later got a phone interview.  A couple weeks later an in-person interview, and then I never heard from them again.  Still not sure if the position is filled or not.", "Interview Questions": "Nothing too difficult, mostly the people doing the interviews were grumpy."}, {"date": "7 Jun 2012", "title": "Research Scientist I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Apr 2012", "Interview Descriptions": "ARUP is huge, but I didn't have much trouble to find the correct entrance. I was about 30 min earlier. After registration at the front desk, I waited about 30-35 min, which wasn't fun. I was contacted by HR and scheduled for on-site two weeks later. It was one hour group interview, a R&D vice president, a medical director, a group manager, a group lead, and a postdoc fellow. There were mainly behavioral questions and general technical questions, like \"tell me about your experience with ...\"", "Interview Questions": "what do you think of \"Accurate\" and \"Sensitivity\""}, {"date": "14 Jul 2015", "title": "Lab Technician/Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jan 2012", "Interview Descriptions": "It was very pleasant and quite informal. It was set up rather quickly; once the hiring manager called, she wanted to set up the interview for early the next day. It was one-on-one with one of the managers, it a slightly awkwardly-small room,  and was followed by a tour of the testing area where I would be working and meeting other employees with similar jobs, or that coordinated with the position for which I was interviewing.", "Interview Questions": "They asked about my laboratory experience"}, {"date": "22 Jul 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jun 2011", "Interview Descriptions": "Very friendly process, but took quite a while to get a response after initially applying. Then I had a phone interview and a group panel interview following that. Human resources department was helpful and friendly throughout the entire process.", "Interview Questions": "What made you apply for this position?"}], [{"date": "12 Sept 2013", "title": "Technologist I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Nov 2010", "Interview Descriptions": "long, complicated, recruiters are always understaffed and seem unimformed", "Interview Questions": "it depends on the interviewing manager"}, {"date": "20 Feb 2014", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Jul 2010", "Interview Descriptions": "It was very relaxed.  They did a great job of bringing me out of the conversation and getting to know me.  It was just one interview and lasted maybe 30 minutes.  It was a great experience.", "Interview Questions": "How do you handle difficult situations?"}, {"date": "18 Nov 2013", "title": "Technician III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in Aug 2009", "Interview Descriptions": "The questions are pretty simple. They mostly want to know how you resolve conflict and if you would work well with others. My job consisted of working a lot with clients and a lot of other departments. There were two people doing the interview, the department supervisor and another employee. They told me they would get back to me within the week and they were prompt with that.", "Interview Questions": "They asked typical interview questions like greatest strength/weakness, how you would handle certain situations. The interview was not difficult."}, {"date": "5 Jul 2011", "title": "Document Control Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Associated Regional and University Pathologists (Salt Lake City, UT) in May 2009", "Interview Descriptions": "I already worked in the department that I was hired as the Document Control Specialist for, however I was still required to interview.  I actaully appreciated this since it was clear that equal opportunity was given to each applicant.  I was not simply given the position.  \r\nOn a negative note, I recall that those that interviewed me didn't seem to have a strong grasp on exactly what I would be doing.  Now that I am in the position, I feel that including another Document Control Specialist would have been incredibly beneficial for both myself and the hiring supervisor to get a better grasp on my ability to perform in the position.", "Interview Questions": "What are your weaknesses?"}, {"date": "15 Mar 2013", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Associated Regional and University Pathologists in Apr 2009", "Interview Descriptions": "phone interview, on-site interview with dept., second interview with team, and then offer.", "Interview Questions": "scenario questions on how I felt or reacted."}]]