[[{"date": "5 Jul 2022", "title": "Employee Relations Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shannon Medical Center", "Interview Descriptions": "Never received a response to my inquiry about the position. It seems as if the recruiters are not responsive to those reaching out about positions on LinkedIn or Indeed. I hope that they start more outreach or answering more questions to help applicants understand the roles that they’re interested in.", "Interview Questions": "Did not receive an interview"}, {"date": "11 Jan 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shannon Medical Center (San Angelo, TX) in Jan 2022", "Interview Descriptions": "You will face a panel of five workers in an interview room in the hospital, the panel I faced happened to be all women workers and one was visibly pregnant. The interview will be open ended questions not to exceed 20 questions of one hour.  They will not answer any questions one could have on job pay rate, compensation, incentives whilevemployed.\r\n Overall process was fluid. Biggest negative aspect I took exception to: during the end portion where I got to ask questions, I asked the panel what safety/pandemic policies have been developed to protect the workers and mitigate the spread of COVID-19. The response given was that all of the staff are required to wear masks while in the hospital, and social distancing plexi-shields are in in place as needed. While this policy \"sounds nice\", none of the panel of five women wore masks during the interview process at all. I wore a mask to the interview (in the hospital) and was guided by an elder woman worker wearing a mask to the interview room where I met with the other four mask-less women, the worker that entered the room with us removed her mask as she sat. I was surprised for a few moments that this panel would just openly defy this \"safety policy\" in place in the hospital. I'm definitely not sure which is worse, mask-less hospital staff choosing to say a rule that they don't value following, or the lack of courtesy or professionalism to that conveyed during the process.  I physically feel fine, but that interview process just seemed like an hour-long potential exposure session.  I could have just left before starting the interview, but fault me for rehearsing professionalism beforehand.", "Interview Questions": "What skills do you think makes you qualified for this position?\r\nWhat is your biggest strength?\r\nWhat would you consider your biggest weakness?"}, {"date": "7 Dec 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Shannon Medical Center", "Interview Descriptions": "Interview process was very organized and professional .  Interviewer spoke as if we were just having a conversation.  They were very kind and willing to answer any and all questions I had.", "Interview Questions": "what my experience level was"}, {"date": "30 Jun 2021", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Shannon Medical Center", "Interview Descriptions": "Took them awhile to call but when they finally did i got a in person interview set up and it went smoothly. after a couple days i got a offer which i declined due to getting a job somewhere else", "Interview Questions": "standard questions asked in a interview\n"}, {"date": "24 Apr 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shannon Medical Center in Jan 2021", "Interview Descriptions": "The interview process was really smooth. Everyone I met was friendly. They gave me a tour of the facility and I met all the people I’m going to work with. I felt comfortable enough to ask questions to see if the job was a good fit for me.", "Interview Questions": "What is your background ?"}, {"date": "29 Feb 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shannon Medical Center (San Angelo, TX) in Sept 2019", "Interview Descriptions": "You get called for the first interview, after the first interview, if they want you to continue to through the hiring process then they will call you for a second interview. After that they will let you know if you got the job or not and then they will give you the dates for orientation.", "Interview Questions": "How would I handle conflict?"}, {"date": "5 Jun 2019", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Shannon Medical Center (San Angelo, TX) in Apr 2019", "Interview Descriptions": "Applied on a Wednesday, received a phone call on that Friday to come in on Tuesday for an interview.  Received a call the same day of the interview for an offer.", "Interview Questions": "What are your future plans?"}, {"date": "27 Mar 2020", "title": "RN BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Shannon Medical Center (San Angelo, TX) in Apr 2019", "Interview Descriptions": "Ii applied online to get the job, I first applied for pediatrics and after 2 days was called by a medsurg nurse manager asking if I could come in for an interview. I said sure, and made it in as soon as I could as I was still finishing up school. I met him and answered questions on how soon I could work. I started work very shortly afterwards. They let me work as a graduate nurse until I could finish my Nclex testing. Afterwards I followed a preceptor for 4 months and then began to work on my own. Been there 10 months since hiring me and I have learned alot.\r\nLoved my manager, very down to earth and willing to help.", "Interview Questions": "When did you graduate,  how often are you willing to work, how do you handle conflict, When can you start."}, {"date": "18 Oct 2017", "title": "Medical Clerk III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Shannon Medical Center (San Angelo, TX) in Oct 2017", "Interview Descriptions": "The hiring process was very professional, yet laid back. The interviewers were extremely nice and explained everything that pertained to the job that I applied for! They were extremely helpful in answering any questions that I had during and even after the interview! I was told that it would possibly be a month or so to hear back about a second interview for the position, but heard back within 1 week or 1.5 weeks! The second interview was professional, yet laid back as well! The third individual that interviewed me, the overall supervisor, was just as nice as the two that had previously interviewed me!", "Interview Questions": "One thing that they asked me was where did I see myself in a couple of years; whether in the same department or a different one, or even with a different company."}, {"date": "12 Feb 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Shannon Medical Center (San Angelo, TX)", "Interview Descriptions": "I applied online and was called by the Unit Manager to schedule a time to meet up for an interview.  My interview was VERY lengthy - over an hour.  A few days later I got a call from HR saying I had an offer- told me the offered pay rate and asked if I accepted or declined.  Originally I declined so they went back, reevaluated and came back with a higher pay rate, which I accepted.", "Interview Questions": "Where I thought my career was heading in the future."}], [{"date": "18 Jan 2017", "title": "Reception Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Shannon Medical Center (San Angelo, TX) in Aug 2016", "Interview Descriptions": "The interview process was not much more than a few questions regarding ability to relate to patients. Once the interview took place, it was nearly a week before I heard back from H.R. and then it was another week or more before they had an orientation to go to.", "Interview Questions": "How do you feel you do when working in a customer service position?"}, {"date": "11 Mar 2017", "title": "Clinical Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Shannon Medical Center (San Angelo, TX) in May 2016", "Interview Descriptions": "First the director had a quick chart with me and introduced me to the team. I was interviewed by all pharmacists on duty on that day. This took about 2hrs to finish. But they were all super friendly. I thought the questions were fair.", "Interview Questions": "Why Shannon medical center?"}, {"date": "17 Mar 2017", "title": "Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Shannon Medical Center (Santa Barbara, CA) in Nov 2014", "Interview Descriptions": "Was an awesome interview she asked how many years I was experienced \r\nBackground check \r\nMade me feel confident and comfortable through the interview \r\nVery nice gave me the opportunity to be myself \r\nOver all interview was great", "Interview Questions": "What was my qualifications \r\nReferences how many years experience do I cook "}, {"date": "14 Dec 2015", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Shannon Medical Center (San Angelo, TX) in Oct 2014", "Interview Descriptions": "I turned in an application online and was contacted via the number I provided for them. After being contacted the lady who is in charge of setting up interviews with the departments asked a time that was good for me and she mediated between myself and the department I was interviewing with.  I arrived on the day of the interview and met with the woman who had been mediating the process, she gave a quick tour of the hospital and delivered me to the department where I was interviewing.", "Interview Questions": "Past experience in patient care, reason for interest in the job, how I felt about dealing with death since that is always a possibility in patient care, etc."}, {"date": "18 Dec 2013", "title": "Med Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Shannon Medical Center (San Angelo, TX) in Nov 2013", "Interview Descriptions": "people are great what an experience!", "Interview Questions": "who sent you?  who are you working for? "}]]