[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Doing the best to care for the disadvantaged and making them feel like 'people'", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Dec 2019", "job_title": "Psychosocial Counsellor in Cape Town", "duration": "N/A", "pros": "Working in the first pilot research project in SA that offers heroin addicts to recieve Methadone to reduce their using as well as a Drop in Centre that offers groups, counselling and practical support,  I love working with complex, vulnerable clients and homelessness.  I feel hope when we are able to change a clients life in little ways including trying to get them shelter, ID, support with court cases and the fact that they are able to receive free counselling which is so much needed for these disadvantaged clients.", "cons": "As I am the only counsellor I may see a large amount of clients a day asking for help with different issues as well as counselling which can be extremely emotionally difficult as there is so much trauma in the past and in the present.  There is also hardly any support for clients in need of a holistic approach however that is not possible and that is difficult because they so desperately need Maslow's hierarchy of needs and they do not even have the basics which is food, shelter etc.  Coming from the UK it has really opened my eyes about how much poverty there is here and the government has not done anything to fund new resources and are actually fining people for rough sleeping.  They wonder why there is so much crime in the country because people need to survive and have to resort to crime in order to survive. I find it very challenging as you know these clients have the capabilities to further their lives however can't because there is no further support than our drop in centre which only reaches a tiny portion of the population."}]]