[[{"date": "7 Apr 2023", "title": "PHARMACISTS Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Corona Regional Medical Center (Corona, CA)", "Interview Descriptions": "The interview process is not hard but never wast your time working for this company. Do not apply there. There are better hospitals that don’t treat you like a number", "Interview Questions": "Typical standard question. Not hard. I wish I never applied there"}, {"date": "6 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Corona Regional Medical Center", "Interview Descriptions": "Great. Professional. Nice. Kind. Nice location.      \nGreat opportunity. \nWonderful. Good. Wonderful. Nice opportunity. Good commute. Reasonable. Questions are good. Nice location. Accessible. Staff are nice. Calm. Professional handling of interview. Nice outcome.", "Interview Questions": "I already forgot the exact questions. "}, {"date": "17 Mar 2022", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Corona Regional Medical Center", "Interview Descriptions": "I Sat down with the ER director and was asked about my experience and what I hope to accomplish with Corona Regional. It's a one on one interview in a small room and it typically takes about 30 minutes", "Interview Questions": "Describe a time you were faced with a difficult situation. What did you do and what was the outcome "}, {"date": "14 Jan 2022", "title": "Housekeeping Attendant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Corona Regional Medical Center", "Interview Descriptions": "The interview process was short, simple and easy-going and they made me feel extremely comfortable. They didn't ask difficult questions and offered training. They let me choose which schedule suited me best.", "Interview Questions": "Asked about my resume, places I've worked before."}, {"date": "6 Apr 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Corona Regional Medical Center", "Interview Descriptions": "It was really easy, asked about you and why you chose the hospital. The interviewer made it super comfortable. The interview probably took about 10-15 mins. Make sure you arrive early because you have to check in at the front desk and then walk all the way around the hospital towards the back where they were having the interview", "Interview Questions": "Tell us about yourself and why you chose this hospital"}, {"date": "6 Nov 2020", "title": "RN Med/Surg Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Corona Regional Medical Center (Corona, CA) in Nov 2020", "Interview Descriptions": "Asked about availability and skill level. Stressed on how long am committed to sticking with the job. They are looking for nurses to stay with the unit for at least three years.", "Interview Questions": "How long will you be staying. Ask about skill level and if can preform Central line care and if can insert NG tube on a patient."}, {"date": "7 Oct 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Corona Regional Medical Center (Corona, CA) in Sept 2020", "Interview Descriptions": "Once application is approved and you pass the pre-employment assessment test, the HR recruiter will contact you if selected for first round interviews. This process involves simultaneously interviewing about 6-7 applicants at the Conference Center. Nurse director and charge nurse for each unit interview each applicant in a speed dating format. CRMC is not a hospital that just hires anyone. The interview process is rigorous, but the nurse directors, charge nurses, nurse educators are all wonderful individuals. After the first round of interviews are complete, the HR recruiter will contact you if you are selected for the second round interviews with the CNO.", "Interview Questions": "Why nursing? Describe a challenging situation you had with a coworker/patient/colleague and how you handled it? (There were about 20-24 questions total)"}, {"date": "31 Aug 2019", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Corona Regional Medical Center (Corona, CA) in Aug 2019", "Interview Descriptions": "First had to take an assessment test. Then was called for an interview the days they said they were going to call people. During the interview the managers made me feel very comfortable when they saw that I was nervous to be there. They treated you like a friend not like they are superior. Managers said they didn't want to hire off anything but personality, they were looking for people with good personality to work for their company. Once interview was over waited 5 days for a call with HR saying I've been selected to move onlo the 2nd part of the interview which was an interview with the CNO via video call. CNO was very sweet and wanted to get to know you personally and your personality. After that a couple hours later I was offered the position.", "Interview Questions": "Strengths and weaknesses. "}, {"date": "15 Feb 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Corona Regional Medical Center (Corona, CA) in May 2019", "Interview Descriptions": "After submitting an application, the interviewer asked pretty general questions such as, the reason for wanting to volunteer at the hospital, what qualities we could bring to the team, etc. The interviewer was straightforward but also lenient.", "Interview Questions": "What made you want to volunteer at this hospital?"}, {"date": "15 Mar 2019", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Corona Regional Medical Center (Corona, CA) in Dec 2018", "Interview Descriptions": "The interview was 1 your long,  the director was rude and slammed her hand on the desk multiple times. I almost walked out when she assumed the reason I wanted to leave my current job was because I must be on some form of disciplinary action.  At one point I did not understand the question and told her so, and she just rolled her eyes and skipped the question.", "Interview Questions": "How many med errors have you done?"}], [{"date": "7 Sept 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Corona Regional Medical Center (Corona, CA) in Sept 2018", "Interview Descriptions": "Received email saying I was being considered for a position. Had to do 2 essay questions and an online personality test. Then was called for an interview. The interview process took 2 hours. Was first interviewed by a panel of different nurse managers, then a nurse educator and then HR.", "Interview Questions": "What is your weakness?"}, {"date": "13 Oct 2017", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Corona Regional Medical Center (Corona, CA) in Sept 2017", "Interview Descriptions": "I had to take a lengthy personality quiz online. After that, I was contacted with a human resources worker explaining if I did OK on the personality quiz, a manager would contact me. I was contacted by the manager to set up the interview. A few days later I was offered a position.", "Interview Questions": "Why do you want to work at Corona Regional Medical Center?"}, {"date": "6 Aug 2017", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Corona Regional Medical Center (Corona, CA)", "Interview Descriptions": "Quick and easy process. Panel interview, asked questions regarding work experience, knowledge with insurances, medicare plans, and then they provided with insurance cards which I then had to identify what was the IPA, PCP.", "Interview Questions": "What is the difference between HMO's and PPO's?\r\nWhat are Medicare Risk Plans?"}, {"date": "7 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Corona Regional Medical Center (Corona, CA) in Jan 2016", "Interview Descriptions": "Brief....one person interview. I thought I was just having a casual conversation then was suddenly offered a position. If you have a pulse and a nursing license, you're hired. This is dependent on the department and in fairness, the director who interviewed me has since left! I would still prepare for a panel interview.", "Interview Questions": "\"Tell me about yourself.\""}, {"date": "9 Mar 2015", "title": "Volunteer/Bereavement Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Corona Regional Medical Center", "Interview Descriptions": "Received email to do job assessment.  Finished assessment and received a phone call to discuss coming in for the interview. Interview was one on one with Director and only took 30mins. I was first asked to tell my job experiences while she took notes and then she ask me questions.", "Interview Questions": "Have you ever had a conflict with a coworker or boss? How did you deal with it and was it resolved?"}]]