[[{"date": "6 Jul 2023", "title": "Asst Director of creative video Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Absolutely terrible clunky black-and-white process for hiring. No responses to emails nothing personalized about this at all. Auto responses are sent with no actual contact. I would not recommend it.", "Interview Questions": "Tell us a little bit about yourself."}, {"date": "27 Jun 2023", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Zoom interview with a committee for about 30 minutes. Interview questions were sent out 10 minutes before the interview. Didn't end up getting the position but heard back about it relatively soon, about two weeks after the intitial interview.", "Interview Questions": "What is your philosophy when it comes to recruitment?"}, {"date": "11 Apr 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "The interview process can vary depending on the organization, the position, and the level of the job. However, here is a general description of the typical interview process: Application: The first step in the interview process is usually submitting an application, which may include a resume, cover letter, and other supporting documents. Screening: After receiving the applications, the organization will typically screen the candidates to determine which ones meet the basic qualifications for the job. This may involve a review of the application materials, as well as a brief phone or video interview. First Interview: The first in-person interview is usually conducted by the hiring manager or a member of the HR team. This interview may be conducted in-person or via video call, and will generally focus on the candidate's skills, experience, and qualifications.", "Interview Questions": "What motivated you to pursue a PhD in this field? What previous research or coursework do you have that has prepared you for this program? Can you discuss a research project you have completed in the past? What was your role in the project and what were the results? What specific research questions do you hope to explore during your PhD? How do you plan to approach these research questions? What methodologies or techniques do you plan to use? Have you identified potential collaborators or mentors within the department or the field at large? What do you hope to achieve after completing your PhD? How do you manage your time and prioritize tasks when working on a research project? Can you discuss a challenge you faced during a research project and how you overcame it? How do you handle working in a team environment? Can you provide an example of a successful team project you have been a part of?"}, {"date": "2 Apr 2023", "title": "Summer Scholars Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Eugene, OR) in Mar 2023", "Interview Descriptions": "The first interview is in-house, and then they send your materials to other programs to be interviewed for specific positions. I interviewed three times in total. The interviews are fairly informal.", "Interview Questions": "Describe a time when you had to work in a stressful situation."}, {"date": "5 Jan 2023", "title": "Office Specialist 2 Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in Jan 2023", "Interview Descriptions": "Comfortable atmosphere. Group of three and the questions were related to the job. Thoroughly explained the expectations and showed me around the office and areas of work. Explained the next steps .", "Interview Questions": "What do you think it would take to achieve great Customer Service?"}, {"date": "26 Jul 2022", "title": "VPR VIP Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "The interview process was mediocre at best. I was asked several behavioral questions, which are formulaic and easy to fib about. I never felt welcome during the interview process either.", "Interview Questions": "What are some things that frustrate you?"}, {"date": "16 Feb 2023", "title": "UHDS Student Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oregon State University in Jul 2022", "Interview Descriptions": "The interview was pretty casual and the interviewer was a very down-to-earth person, the conversation was dynamic with open-ended questions. Although you might feel like the question are overengineered for the position.", "Interview Questions": "What is good customer service to you?"}, {"date": "17 Jun 2022", "title": "Dir Data Accreditation and Assessment Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Oregon State University in May 2022", "Interview Descriptions": "Had a 30-minute Zoom interview in early May. Questions were repetitive. Told I should hear in three weeks about a second interview. Requested an update three weeks later and was told I would hear the following week. Requested an update 6 weeks after initial interview and two days later was told was not selected for the position. This seems indicative of a bureaucratic dinosaur.", "Interview Questions": "All questions were about data and repetitive so that it was like answering the same question over and over."}, {"date": "11 Apr 2022", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "30 minute virtual interview with two student employees and one pro staff member. I received the interview questions beforehand, so I could better prepare for the interview. Everyone was friendly and easy to talk to.", "Interview Questions": "Please share an experience(s) you’ve had working with people from different backgrounds than your own and what actions you took to create a more inclusive environment.\r\n"}, {"date": "1 Mar 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Got a video ZOOM interview with four questions.  The interview last 30-45 mins. 30 mins for the questions and answers, another 10 to 15 mins for asking questions. Five committee members asked questions, Each one asked one questions.", "Interview Questions": "Tell me about yourself?  \r\nTalk about your research?"}], [{"date": "4 Apr 2022", "title": "Student Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Portland, OR) in Mar 2022", "Interview Descriptions": "This was my first ever interview. I met with two people on the team and they made the environment comfortable, open, and conversational. They asked standard interview questions and wanted to see how I approached challenges. If you are given a job offer, make sure you deliver all the information in person in Corvallis and ask if there's a deadline for submitting all the information.", "Interview Questions": "How did you manage a difficult problem?"}, {"date": "22 Feb 2022", "title": "Service Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "It was comfortable and enjoyable. I was able to understand a lot of the work involved in this position thanks to the interviewers clear explanation and their expectations. The group interview was nerve-wrecking but fairly easy to navigate once understood.", "Interview Questions": "How do you priorities customer and work?"}, {"date": "31 Dec 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "It went smooth, really personable and able to have a connecting conversation. Made it really welcoming and relaxed. I was a huge fan growing up and able to express my gratitude was great.", "Interview Questions": "What experience can you tell us that would help you in this position?"}, {"date": "21 Dec 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "The interview process for grad school was good and the interview process was not very long. The result of the interview was also published very quickly. Overall, the experience was very good.", "Interview Questions": "Future plan, research experiences, education history, career goal."}, {"date": "1 Sept 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Interviews were a phone interview first, then a face-to-face with the hiring manager, and then a group interview with the department.  It required preparation and in-depth knowledge of the position and thoughtful questions helped to engage the interviewees.", "Interview Questions": "How would you bring your experience into the position in a positive way?"}, {"date": "16 Aug 2021", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Oregon State University", "Interview Descriptions": "Interview process was in person which consisted of various questions just like any interview would. Now I'm just making this longer so I can see the company review I want", "Interview Questions": "What is one of your strengths"}, {"date": "18 Jul 2021", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Interviewed with the Supervisor, Senior Researcher and the Project Manager over Skype. The interview was about an hour long. It was pretty standard, each person had a chance to ask questions and in the end, you can also ask any questions. Not sure why this 30 word minimum.", "Interview Questions": "Q: Describe your experience relating to the current job description?"}, {"date": "29 Jul 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Corvallis, OR) in Jul 2021", "Interview Descriptions": "Straightforward and well run, though perhaps a bit stiff. This may be due to a strong desire to maintain equity for all interview candidates. This did contribute to a difficulty in gaining a sense of how the interview might be going.", "Interview Questions": "What does a commitment to diversity and inclusion means to you?"}, {"date": "25 Jun 2021", "title": "Undergraduate Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University", "Interview Descriptions": "Short video call with GTA where several questions were asked. Lasted approximately 30 minutes. Questions covered soft skills mostly. Other than that some background and interest related questions were asked.", "Interview Questions": "How would you address a problem with lecture material?"}, {"date": "20 Jun 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Oregon State University", "Interview Descriptions": "Very good! Had interview with hiring manager who was respectful and had relevant questions. Overall had my voice heard and got to ask my questions and they were answered. The room was clean.", "Interview Questions": "N/A"}], [{"date": "24 May 2021", "title": "Fiscal Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "The process was explained well and straight forward. The interviewers questions stayed on track, on topic, and work focused. I would recommend the OSU interview process to others. My experiences was 2 parts, one over the phone and the other in person.", "Interview Questions": "What are some of the relevant task you have completed that qualifies you for this position. "}, {"date": "24 May 2021", "title": "Veterinarian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "There were five people who asked random questions in order to entrap the person interviewing, I was on the wait list one year and finally passed the interview process the following year", "Interview Questions": "how many hounds in a fox hunt"}, {"date": "22 May 2021", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "One interview with a search committee of about 5 people. The interview took about 30 minutes. Would recommend dressing business formal. The interview consisted of about 8 questions and was fairly easy.", "Interview Questions": "What does diversity mean to you?"}, {"date": "14 Apr 2021", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "I have had two interviews for two different jobs at OSU. Both included a panel of ~5 people who took turns asking questions. They were friendly and asked pretty typical interview questions.", "Interview Questions": "They always ask a question about diversity "}, {"date": "14 Apr 2021", "title": "Student Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University", "Interview Descriptions": "Met with a professor and asked me basic questions like tell me about yourself. What kind of resources will I be providing. Nothing out of the ordinary. Just be confident and let them know that you have knowledge and experience to offer to your mentee.", "Interview Questions": "Tell me about your experience at OSU."}, {"date": "31 Mar 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Being in a graduate teaching assistant here has no interview but the faculty will see your performance based on the outcome from classes. You just need to do well on class and be prepare for the work that you will be received.", "Interview Questions": "No interview needed for this job."}, {"date": "14 Feb 2023", "title": "ULA Computer Science Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR) in Apr 2021", "Interview Descriptions": "Complete the class with at least a B, apply online with a cover letter and a resume answering a few basic requirement questions. A recommendation from a former TA is heavily important.", "Interview Questions": "Experience teaching complex and abstract subjects"}, {"date": "20 Jan 2022", "title": "Student Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University in Apr 2021", "Interview Descriptions": "Was professional and created good dialogue between all parties. There was the main interviewer, and a previous employee to help answer any of my questions, and talk about the job from both points of view.", "Interview Questions": "Do you have any international experience with OSU?"}, {"date": "3 Mar 2021", "title": "Academic Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University", "Interview Descriptions": "You submit an application, and if you're chosen as a finalist, you go through an interview with the director and coach leader. The interview mainly allows them to see if you understand what they do as coaches, whether you care about helping students, and whether you are a good fit for the role.", "Interview Questions": "Here is a student scenario. How would you help them as a coach?"}, {"date": "28 Feb 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "The interview was with two people by Skype as I lived out of state at the time. It was a pleasant experience and lasted less than an hour. Questions were normal interview questions and not too hard.", "Interview Questions": "What's one blog you read?"}], [{"date": "8 May 2022", "title": "Ambassador Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Oregon State University (Oregon City, OR) in Mar 2021", "Interview Descriptions": "It was pretty straightforward. She sent questions before the interview to have the possibility to prepare. There were 3 people who did the interview. Everyone asked the question in a row. It was easy. At was online", "Interview Questions": "Your strengths/weaknesses.\r\npast Experience in job/academic"}, {"date": "11 Feb 2021", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "The interview process was very structured and organized. I was interviewed by a search committee of 4 people. The interview lasted about 30 minutes. The entire application and interview process took about a month from start to finish.", "Interview Questions": "What does diversity mean to you?"}, {"date": "26 Jan 2021", "title": "Student Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Based on academic performance. Easy and not professional, more personable. Focused on intentions and motivations within the job, and how it would benefit you in your future career. Simple. Easy.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 Jan 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "There was no interview process, besides speaking with my academic advisor. Perhaps it works differently depending on what department you are in. i am not sure and trying to hit the 30 word minimum", "Interview Questions": "there were no interview questions"}, {"date": "19 Nov 2020", "title": "Marketing Memorial Union Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "The interview was laid back and they got back to me very quickly after. There were 3 employees present during the interview, all asked different questions. Overall good process- It's nice not having to wait a long time for an answer.", "Interview Questions": "What was one time you failed and how did you recover?"}, {"date": "30 Oct 2021", "title": "Communications Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Oregon State University in Nov 2020", "Interview Descriptions": "There was an initial zoom call with a large panel, then a project and then a second round interview with a large panel over Zoom. I think before COVID, you would have don the second round in person.", "Interview Questions": "How would you engage college students thinking of applying?"}, {"date": "20 Oct 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "The process consists of only one face-to-face interview, a manager asked my expected graduating date, customer service experience (if any) and preferred working hours. The interview only lasted about 15 minutes because the dining center was a bit busy.", "Interview Questions": "What is your expected graduation date. "}, {"date": "21 Sept 2020", "title": "Analyst Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Relatively easy. Due to a union bargaining agreement they asked the candidate to NOT submit a resume or cover letter. Educational background and employment history were filled out on the application form. The process lasted more than a month, consisting of a coding challenge and two interviews, both of which were a mix of technical and behavioral questions.", "Interview Questions": "Design an online quiz based on a JSON file you'd have to get from an online source."}, {"date": "17 Sept 2020", "title": "IT Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Process was easy and straightforward, not a lot out of the ordinary, overall very relaxed environment. People that I interviewed with were friendly and great to work with once I started, very understanding of class schedules and other university commitments.", "Interview Questions": "What experience with computers do you have?"}, {"date": "3 Aug 2020", "title": "Caterer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Oregon State University", "Interview Descriptions": "Incredibly easy, asked very few questions and just had a conversation. The employment was virtually assured based on our interactions. Altogether a very positive experience that is incredibly easy. would recommend", "Interview Questions": "Ask about very simple questions dealing with prior experience among other things. Altogether,"}], [{"date": "30 Jun 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Corvallis, OR) in Jun 2020", "Interview Descriptions": "I received an email to schedule the interview.  They sent me the questions the evening before the interview day.  The interview was done by Zoom.  I was interviewed by a hiring committee for the first 30 minutes, then I talked with the school head for another 30 minutes.", "Interview Questions": "Describe what you would consider your biggest professional accomplishment and then your biggest professional failure."}, {"date": "20 Mar 2020", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Very long, all day interview with several different people. Typical student affairs type thing, but I think it's too much. They did go out to dinner, which was good. We went to block 15, so if you get nervous about picking food, might be worth looking over the menu in advance.", "Interview Questions": "Diversity questions"}, {"date": "17 Feb 2023", "title": "Tour Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Oregon State University in Feb 2020", "Interview Descriptions": "The first interview was set up as a group staged interview with five rotations. A week later, had one individual interview. Once hired had a quarter system unpaid training & a paid week-long fall training.", "Interview Questions": "How has has your experience contributed to the desire to serve as the face of OSU?"}, {"date": "14 Mar 2021", "title": "Student SOC Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR) in Jan 2020", "Interview Descriptions": "Submitted Resume and cover letter. Scheduled an interview session where basic topics were discussed to get an idea of your level of experience. Mostly basic networking questions such has common ports and TCP vs UDP.", "Interview Questions": "List some of the most common ports and what they are assigned for."}, {"date": "9 Dec 2021", "title": "IM Official Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University (Corvallis, OR) in Jan 2020", "Interview Descriptions": "Easy and short. They ask simple behavioral questions and like any other interview, follow the STAR method when putting together your responses. Previous teamwork and sport experience is a plus since it is a sport based position.", "Interview Questions": "What was one time you worked as a team successfully?"}, {"date": "12 Jun 2023", "title": "Climbing Wall Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR) in Oct 2019", "Interview Descriptions": "The interview process was easy and personal. Employment tries to see if you are personable and can engage in conflict management skills. They asked typical questions regarding certain case scenarios.", "Interview Questions": "Questions about conflict management skills."}, {"date": "9 Sept 2021", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR) in Sept 2019", "Interview Descriptions": "Straight forward interview over Zoom with two interviewers, including the manager and a current student working in the position I was interviewing for. Overall a good, relaxes interview that lasted about half an hour.", "Interview Questions": "Asked various software development related questions."}, {"date": "22 Nov 2022", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Sept 2019", "Interview Descriptions": "Very easy and centered around leadership questions. There were also questions about social justice. For this interview, I had to show my knowledge of social justice. Overall it is a very straightforward interview. By studying basic interview questions, you will be able to nail the interview.", "Interview Questions": "Explaining how to have a good time management."}, {"date": "22 Jul 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Panel interview, typical interview questions; where do you see yourself in 5 years, difficult tasks you've had to perform. Typical wait time for response was around 2 weeks, interviewers were very easy to work with", "Interview Questions": "Name a time you dealt with a difficult person at work, how did you remedy the situation?"}, {"date": "7 Jun 2019", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "There is no interview to get in Oregon State University, but there is a sort-of interview when you would like to join a research group, which is just an appointment to talk with the advisor you are interested and very relaxed chatting", "Interview Questions": "Tell me a little bit about your research background"}], [{"date": "16 May 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Oregon State University", "Interview Descriptions": "No interview.  I knew the person looking for a researcher and he asked if I wanted the job, but I realise that this is not typical. I have nothing else to add.", "Interview Questions": "N/A"}, {"date": "28 Jul 2019", "title": "CEL Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR) in May 2019", "Interview Descriptions": "Interview was conducted by GTAs, Questions were given for preparation. The questions mostly examined how community engaged the candidate is and tested certain basic skills like time management. However the interviewers seemed rushing and did not allow enough time to answer to their questions.", "Interview Questions": "What is the most challenging thing for students of diverse backgrounds at OSU"}, {"date": "19 Aug 2021", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Oregon State University (Bend, OR) in May 2019", "Interview Descriptions": "The interview process was by committee, with interviews with the committee and key stakeholders. It was rigorous but not overwhelming.  First I met with each individual on the committee, then there was a group interview with the committee. There were three rounds of interviews, and the final interview was with the hiring manager.", "Interview Questions": "What are three words that you would use to describe yourself?"}, {"date": "18 Jun 2019", "title": "Fiscal Coordinator I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Oregon State University (Corvallis, OR) in Apr 2019", "Interview Descriptions": "This is specific to OSU GO.\r\n\r\nIn-person panel interview with a group of 4 search committee members. Neutral interview experience. One of the members seemed very uninterested in what I had to say. Went in again for a one-on-one interview with the director. Was rescheduled last minute. \r\n\r\nOverall, I took 2 days of my life to interview with this place, and they didn't have the courtesy to update me on the interview process. After the one-on-one interview, I was informed I'd hear back in a week or two. It's been almost 2 months since the first interview and I've not heard a thing from them, even after emailing the search committee chair. \r\n\r\nI just find it very disrespectful and unprofessional.", "Interview Questions": "Given 3 immediate deadlines, how would you prioritize them?"}, {"date": "24 Mar 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "quick interview with another student, it was very easy and asked questions regarding to scheduling to get you shifts around your class time. there was only about 2 questions asked.", "Interview Questions": "Why do you want to work at the dining hall?"}, {"date": "11 Feb 2019", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "The interview for the job has changed through time. But the current one is really fun. You just play a game with a few other interviewees. It doesn't matter if you pass the game, most people don't.", "Interview Questions": "The game tests your ability to work with other people:"}, {"date": "14 Jul 2021", "title": "Digital Marketing Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Oregon State University (Corvallis, OR) in Feb 2019", "Interview Descriptions": "Was very short. Had to present myself to about three people in total. They mostly asked me question and I answered. Wasn't much time for me to explain why I should get the job.", "Interview Questions": "What is your prior experiece"}, {"date": "1 Jan 2019", "title": "Student Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Very relaxed, quick and efficient. They make you go through food service  training and you have to also get your food handlers card which doesn’t take long at all. They hired me pretty quickly.", "Interview Questions": "What did you do when you had differences with someone else? "}, {"date": "30 Dec 2018", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Oregon State University", "Interview Descriptions": "Applied online and had a initial phone interview. Came in person and heard back within a week. They encouraged me to keep applying and got back to me in a timely manner. I’ve interviewed at multiple places and by far OSU has been the most professional and efficient.", "Interview Questions": "How do you handle diversity in the work place?"}, {"date": "30 May 2022", "title": "Indoor Climbing Gym Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Oregon State University (Corvallis, OR) in Oct 2018", "Interview Descriptions": "Very easy. Many of the Dixon Recreation center positions simply interview to see if you are a good fit. This was my experience when interviewing for the climbing center at the Dixon Recreation Center.", "Interview Questions": "Describe a time when you had to handle conflict. "}], [{"date": "21 May 2021", "title": "Web Content Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University (Corvallis, OR) in Sept 2018", "Interview Descriptions": "The interviewer was casual but well-prepared, the interview consisted of web content management-related questions discussed in an office setting. The questions were not trivial but overall the process was not stressful.", "Interview Questions": "What content management systems are you familiar with?"}, {"date": "11 Sept 2020", "title": "Student Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR) in Sept 2018", "Interview Descriptions": "You have only one interview and its with the manager. They will go over your resume and cover letter and ask you questions from those. Very straight forward interview process. I heard back within a week.", "Interview Questions": "Standard behavioral questions tailored to your experiences."}, {"date": "19 Jun 2018", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in May 2018", "Interview Descriptions": "The application process was lenghly - all done on-line answering some additional supplementatl questions to be considred. I was contacted to set up an intial video screening which was to last 20 minutes over web-ex.   Each went around and asked a behavorial or situational question that would be specific to the job.  A few days later I was notified I made it to the second round. This consisted of a 50 minute interview with the search committe, a presentation,  followed by QA and then some smaller 1-1 interviews slots with the Director and other staff members - total time 4 hours.  The presetnation was a lot of work to prepare for - the topic was given a few days ahead of time.  The presentation was in front of the search comittee plus other key stakeholders - 15 - 20 people.   While the process is a lot of work they are a top notch organization to interview for. Very respectrful, and in my case I felt super at ease through it all. They were very nice group of people and an organization I would have been happy to work for - very professional, a bit laid back and very kind.  They did a great job of saying these are our next steps so you new exactly how long things would take and what their process was that went into making a final decision.   While I did not get this position I did receive a lot of positive feedback and would welcome an opportunity to interview there again.", "Interview Questions": "Whitch parts of a product launch had I contributed to and which parts did I lead? "}, {"date": "23 Mar 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "There is no in-person interview. I only submitted the documents needed for application. However, the application contains two part, which is a little inconvenient. One is for graduate school and the other one is for CBEE department.", "Interview Questions": "N/A"}, {"date": "11 Mar 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "The hiring process was several months and began with an online interview. The in-person interview was a full day, and included a presentation that I made to community members and meeting with the interview team and many different people throughout the day. Compared to other institutions, I found the interview process to be more thorough.", "Interview Questions": "How do you approach teamwork? What behaviors do you adopt to encourage a collaborative work environment?"}, {"date": "17 Feb 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Mar 2018", "Interview Descriptions": "I firstly met with my advisor and talked about potential funding opportunities. My advisor agreed to fund me as a partime GRA and GTA throughout two school years. The overall conversation is smooth. I think finding a good advisor is critical to obtain a GRA position at OSU.", "Interview Questions": "What type of research you are interested ?"}, {"date": "11 Aug 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in Jan 2018", "Interview Descriptions": "Extremely long process - 7 interviews altogether. I was the runner up candidate to an internal hire. Interview involved creating a detailed presentation and travel. Ultimately felt like it was disrespectful to my time and that if they need 7 interviews to figure it out, they're doing something wrong.", "Interview Questions": "How would you improve marketing for our program?"}, {"date": "28 Jun 2021", "title": "Videographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in Jan 2018", "Interview Descriptions": "Short interview had to bring a personal reel. Was interviewed for around 20 minutes. It was students and professionals looking at my work. They asked what I wanted from the job too.", "Interview Questions": "How long to produce work."}, {"date": "31 Oct 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR) in Oct 2017", "Interview Descriptions": "it begins with a webex interview and followed by a half-day interview which was scheduled three weeks later, meet with three panels and the big boss. the final round is about 4 hours, meeting department heads, business managers", "Interview Questions": "diversity/how do you feel your previous experiences are relating to this position"}, {"date": "18 Mar 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in Aug 2017", "Interview Descriptions": "It was pretty chill, I talked to a professor that I'd taken a class with and I'd done well in it so she told me I should apply. So I sent in my application so it would be official and then I had a short interview with the professor who was teaching it that term. I feel like it was more of a formality than anything.", "Interview Questions": "\"Tell us about your experience with MatLab\""}], [{"date": "26 Mar 2018", "title": "Accountant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Corvallis, OR) in Jul 2017", "Interview Descriptions": "Submitted my application online, and was contacted within 1-3 weeks after the job date closed. I was interviewed through a phone call, then a week later by a search committee that consisted of 4-5 people (essentially your future coworkers). It would have been in-person, but I did it through Skype because I was living in a different state at the time. After the interview, I got a phone call the next week saying I was offered the position. Went through background check and referrals.", "Interview Questions": "N/A"}, {"date": "4 Aug 2017", "title": "Chemistry Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oregon State University (Corvallis, OR) in Jul 2017", "Interview Descriptions": "There was a committee of five people including one of the longstanding PhD's in the OSU Department of Chemistry, the person that manages the teaching labs, the HR person, and two younger scientists. After introductions I was given a sheet with about six or seven questions. The questions were asked in a round robin style by the committee members.", "Interview Questions": "They asked why I thought I was a good fit for the job."}, {"date": "24 May 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oregon State University (Bend, OR) in Jan 2017", "Interview Descriptions": "Very simple, super casual. They just wanted to get a feel for how I like to work, what I'm studying, and what I'm interested in. It was obvious the the point of creating this position for student workers was to give students more professional experience and opportunities.", "Interview Questions": "What types of projects would you like to do for the library that could possibly add to your resume and relates to what you're studying?"}, {"date": "21 Oct 2019", "title": "IS Technical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in Jan 2017", "Interview Descriptions": "Ask to do a challenge in a team environment. Have to work in a team environment which requires communication to complete some sort of task usually a game to diffuse a bomb.", "Interview Questions": "Past work experiences. General questions"}, {"date": "12 Nov 2016", "title": "Student Computer Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Oregon State University", "Interview Descriptions": "Only one question on technical skill, the rest on customer service skills and experiences.  Large emphasis on \"we will train the right person for the job if they don't have the necessary skill\" over getting people with skill.  Questions were also more of \"what would you do in this situation\" type over questions about experience and skills.", "Interview Questions": "Given this technical problem, how would you solve it."}, {"date": "25 Mar 2017", "title": "Post Doctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Oregon State University (Corvallis, OR) in Sept 2016", "Interview Descriptions": "Very casual. Met future employer casually through OSU department, then met with future employer over coffee/beer several times to discuss common interests, goals for collaboration, work philosophies and expectations, and employment plan (full- vs. part-time).", "Interview Questions": "Start date; research interests; project ideas; funding opportunities"}, {"date": "20 Feb 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR) in Aug 2016", "Interview Descriptions": "Contacted by the PI directly after submitting the application. Phone interview then offered the position. The phone interview took about an hour and questions includes both personality and work experience.", "Interview Questions": "Where do you see yourself in two years?"}, {"date": "28 Jun 2016", "title": "Student Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Simple, and straight forward interview. Mine was over WebEx and not in person, although the follow up interview for hiring is in person. The questions are simple and straight forward, they know you don't have much experience and that you're looking just for a little pay to help with school.", "Interview Questions": "Tell us about your most difficult customer experience"}, {"date": "25 Sept 2019", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in May 2016", "Interview Descriptions": "Questions were asked off of a sheet that had to deal with diversity, cultural competence project management and event planning. The interview was held by the Associate Director of the Black Cultural Center and the two leadership liaisons.", "Interview Questions": "What is one thing you would like to gain from this employment experience?"}, {"date": "2 Jun 2016", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR) in Apr 2016", "Interview Descriptions": "At first there was a group interview which was fun and then a one-on-one interview. The interviewers were very nice and great to talk to. When I arrived, they gave me some water to drink which I thought was really nice of them. They wanted me to succeed.", "Interview Questions": "How did you go above and beyond the customer's expectations?"}], [{"date": "2 May 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Oregon State University (Corvallis, OR) in Dec 2015", "Interview Descriptions": "I performed beyond the remainder of the class I was in, in addition to taking a strong interest in the final project which must have gotten me noticed. There wasn't much beyond this, the professor for the class offered me the position for the following quarter and I accepted.", "Interview Questions": "Effectively the entire upper division/grad class was the interview."}, {"date": "27 Jan 2016", "title": "Engineering Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Eugene, OR) in Oct 2015", "Interview Descriptions": "Applied online, got phone interview. It took about half hour. There are about ten questions. Some are difficult. Some easy. for example Describe how you would handle a situation if you were required to finish multiple tasks by the end of the day, and there was no conceivable way that you could finish them.", "Interview Questions": "Describe how you would handle a situation if you were required to finish multiple tasks by the end of the day, and there was no conceivable way that you could finish them."}, {"date": "23 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in Sept 2015", "Interview Descriptions": "Informal. We meet in the quad and had an easy discussion about the project at hand, its timeline, and the people involved. We also discussed how my academic area of interest related to the project.", "Interview Questions": "What type of research experience do you have?"}, {"date": "22 Jul 2015", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Applied online and received an in-person interview by a panel of 4 people. Round robin of questions.and a light atmosphere. The people were very kind and inviting. I enjoyed the experience.", "Interview Questions": "Describe a time you had to creatively solve a problem?"}, {"date": "30 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Jun 2015", "Interview Descriptions": "Group internship with several other candidates were asked a series of questions from different department heads.word word word word word word word word word. More words about the interview. DOes this even get looked at? Who even knows.", "Interview Questions": "What do you do when someone isn't pulling their weight?"}, {"date": "7 Jan 2016", "title": "Resident Hall Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Oregon State University (Corvallis, OR) in Jun 2015", "Interview Descriptions": "I stopped by the Beth Ray center to speak with the dorm coordinator. I left my email and thry got back to me the next day. We set up a face to face interview and it was easy.", "Interview Questions": "If a student looks to be under the influence, what would you do?"}, {"date": "17 Aug 2015", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in Apr 2015", "Interview Descriptions": "Fairly lengthy technical interview for a student job.  Started with an email reply from boss with some easy take home questions and a mini programming quiz, fairly easy - takes about an hour or two.  If you do well enough in the quiz and questions, you'll be moved up to a panel interview.  There you'll be asked more technical questions.", "Interview Questions": "Describe what you could offer as a potential developer"}, {"date": "15 Apr 2015", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Corvallis, OR) in Mar 2015", "Interview Descriptions": "osu does panel/group interviews so you will be in a conference room with 3 to 6 people who would be your managers, peers/coworkers, or customers(from another department), then background/criminal check, fingerprint check, a long process.\r\n\r\ndifficulty depends on which questions, interviewed for several accounting positions - some felt easy and comfortable but others felt tense and sweaty! Some I didn't get and others I am still waiting to hear back...", "Interview Questions": "standard/normal questions as well as behavioral questions, be prepared with examples of how you handled situations in previous jobs, ex. mistake you make in previous job, if you were helping a customer and your phone rang, what would you do?, what do you do to meet multiple deadlines if you don't have the information or knowledge to complete them in time? what did you like/dislike about your previous job and/or manager's style..."}, {"date": "13 Jun 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR) in Mar 2015", "Interview Descriptions": "Very thorough, well done.  It was a group panel composed of the department leads and managers.  They asked position appropriate questions, and they were very non partial and open.  I felt they heard, understood, and respected what I was saying.", "Interview Questions": "How do you deal with conflict?"}, {"date": "15 May 2015", "title": "Coordinator of Study Abroad Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Oregon State University (Denver, CO) in Feb 2015", "Interview Descriptions": "I had a 3 part, 2.5 hour interview. I met in the office I'd be working in with 2 other employees and a student employee. They asked specific questions about my experience and why I was applying. The second part was with the direct supervisor. She spent a lot of the time explaining what the job entailed and allowing me to ask questions of her. The third part was with the dean, and it seemed like his portion was more just so that he could meet the applicants.", "Interview Questions": "Why are you specifically applying for this temporary, reduced-hours position?"}], [{"date": "28 Mar 2016", "title": "EH&S Pro I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Oregon State University (Corvallis, OR) in Jan 2015", "Interview Descriptions": "The hiring process was 2 Skype interviews.  There was a panel of people that would go around and ask a series of questions.  Questions were technical and nontechnical questions.  The third and final interview was in person.  They did not help with any travel expenses to fly out to Oregon or help pay for a hotel.  The interviews were the same format of the Skype interviews but with a different panel of people.", "Interview Questions": "Provide a scenario where you had to work with people from different backgrounds than yourself?"}, {"date": "21 Jul 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Oregon State University (Corvallis, OR) in Jan 2015", "Interview Descriptions": "I was referred by a friend to this position. I sent the manager an email expressing interest. I was called in for an interview. We went over my resume and she asked me questions about my science background and what courses I completed.", "Interview Questions": "Why do you want to work as a TA?"}, {"date": "11 Nov 2014", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oregon State University", "Interview Descriptions": "Applied online, was contacted and scheduled for an interview shortly after application close date. Only about 20 min interview, basic questions. Panel was very friendly and made it more discussion based. Really wanted to get to know me as a person and understand my personality. Position is for students, so they weren't worried about formal experience, but rather leadership experience in organizations.", "Interview Questions": "How do you plan to make your events diverse and welcoming to all students and community members"}, {"date": "3 Nov 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "the process was very easy. I just had couple meetings with my supervisor, some normal questions related to the job and then he asked a little bit about my experience and he was mostly checking my interest on the job to see if really like the position or just I needed it. and after a few days  they offered the position to me.", "Interview Questions": "questions were fairly easy and normal"}, {"date": "3 Mar 2015", "title": "Sexual Violence Prevention Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Corvallis, OR) in Sept 2014", "Interview Descriptions": "first I had a phone interview with the entire hiring committee. Then about two weeks later I went down to Corvallis for an in person interview. I was asked to prepare a presentation.  They put me up in a hotel for the night before. \r\nThe day before my interview the chair of the hiring committee called to confirm a time to pick me up in the morning. At that time, I was first notified that the interview would last all day. I had thought it would only be for the morning, as one of the HR people had asked if I had the morning free. I was very nervous at that point as i had only planned on a half-day interview. \r\nThe interview day was broken up into smaller interviews and \"getting to know people\" time. It was nice overall, the people were pretty great. After my presentation, there were some strange/off putting questions that were tough to answer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 May 2014", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University", "Interview Descriptions": "I applied online and was contacted by telephone a week after application deadline. I met with a group of 5 interviewers at the same time. I was told all interviewees would be asked the same questions. Each person asked me a question, mostly related to previous experiences related to position or what would I do in XX situation. About 10 questions in total. It was very formal and not a terribly friendly atmosphere. After this I was asked to participate in a mock advising session. The whole process took around 3-4 hours. Took about 4 weeks to be informed that I was no longer under consideration.", "Interview Questions": "N/A"}, {"date": "3 May 2014", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Oregon State University", "Interview Descriptions": "A phone interview and then an in person interview with the program director.", "Interview Questions": "What is your greatest weakness?"}, {"date": "19 Oct 2015", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR) in May 2014", "Interview Descriptions": "Very difficult. Asked several questions that didn't relate to the job. What type of cereal you would be, what type of animal, etc. The manager is very friendly and it is overall a great work environment to be a part of. The only challenge was the difficult interview questions that are unrelated to the job.", "Interview Questions": "What type of animal would you be and why?\r\nGive an example of a time you faced adversity at work."}, {"date": "7 Mar 2016", "title": "ISOSU Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Apr 2014", "Interview Descriptions": "The questions they asked were very straight forward. The odd thing was that there were 6 interviewers interviewing me. The position I applied for was very basic office work at school so I didn't think I would have 6 interviewers. It was a little intimidating.", "Interview Questions": "How do you cope with uncooperative coworkers?"}, {"date": "13 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in Mar 2014", "Interview Descriptions": "Nothing much they will go through your background and academic record and accordingly assign you the course you are most fit for, off-course with your permission. Just go on meet people, professors and administration head and let them know that you are interested in the job. Also let them know why you think you are qualified for the job.", "Interview Questions": "Mostly experience counts, no formal interview. Sometimes professors teaching the course may ask you conceptual question."}], [{"date": "11 Feb 2014", "title": "Phd Assistantship Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Oregon State University", "Interview Descriptions": "Talked with my current advisor on the phone and discussed possible thesis proposal themes. I asked about field logistics and he seemed impressed about the foresight.", "Interview Questions": "It was a pretty low-keyed interview, so there weren't really any unexpected questions or what not. The only question that was hard to answer was if I intended to stay in academia or not, of which I was not sure at the time."}, {"date": "13 Jan 2014", "title": "Human Resource Consultant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Oregon State University", "Interview Descriptions": "Put in a complete application paying attention to special instructions to applicants and ensure you comply.", "Interview Questions": "Any behavioral question will be a challenging one."}, {"date": "23 Dec 2015", "title": "Program Adviser Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Oregon State University (Remote, OR) in Oct 2013", "Interview Descriptions": "I interviewed remotely and the prices was lengthy. Nearly 3 months from first contact until I had the offer letter. Online phone screen, telephone interview, Skype interview with two people, WebEx interview with panel, HR screen.", "Interview Questions": "Relevant questions about past experience and strategies to apply previously acquired skills to proposed with challenges in this role."}, {"date": "24 Dec 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Oregon State University in Sept 2013", "Interview Descriptions": "Was asked questions off a sheet. It was based more on my personality than anything. I had to have a basic understanding of excel and word, but those were the only things not really relating to personality.", "Interview Questions": "What are your strengths?"}, {"date": "7 Aug 2013", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "The interview process was good. I met with many faculty members, who were interesting and engaging. It was rather typical of an academic interview - giving a talk, meeting with faculty and students, etc.", "Interview Questions": "N/A"}, {"date": "1 Sept 2015", "title": "Seed Germinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Oregon State University in Aug 2013", "Interview Descriptions": "Interview was very easy. Consisted of being toured around the germination lab and meeting coworkers. Since the job is tedious and monotonous, they mostly rely on hiring student workers, as they're okay with the long work hours and minimum wage. I was hired on the spot.", "Interview Questions": "Do you mind sitting in one spot for more than 3 hours at a time?"}, {"date": "30 May 2013", "title": "ECE Freshmen Mentor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "There was a very informal interview and a test.", "Interview Questions": "There was a test that you had to take on CS and ECE.  The test was pretty basic, and it was not too difficult."}, {"date": "30 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oregon State University (Corvallis, OR) in Apr 2013", "Interview Descriptions": "Ask you about your experience and transcript. If you I have, they will ask you about your paper.  Get prepared before you see a professor and ask for a position, such as a brief introduction and show your ability of a fast learner.", "Interview Questions": "Nothing has been asked"}, {"date": "21 Apr 2015", "title": "Faculty Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Oregon State University in Mar 2013", "Interview Descriptions": "short personal interview before group interview with research team. Very informal and questions based on experience and skills. No crazy schemes. Also very dependent on which department you're interviewing for.", "Interview Questions": "Explain how you'll overcome areas where you have no experience? "}, {"date": "31 Aug 2015", "title": "Bi21x Staff Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Oregon State University (Corvallis, OR) in Mar 2013", "Interview Descriptions": "Very relaxed and friendly. Two student supervisors sat in and asked their own questions. Everyone was very relaxed and there was no intense interview process or a panel. I just sat through one relaxed interview and got hired within 2 days after all other students were interviewed.", "Interview Questions": "How do you start a cell culture?"}], [{"date": "8 Jan 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oregon State University (Corvallis, OR)", "Interview Descriptions": "Standard interview process. A telephone interview followed by a on-site. You meet every PI in the department. Just general questions mainly about your research experience.", "Interview Questions": "No."}, {"date": "28 Nov 2015", "title": "Finance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oregon State University (Corvallis, OR) in Sept 2012", "Interview Descriptions": "They interview by committee. They have a list of questions that they ask every interviewee. The hiring manager may or may not be on the committee. After the hiring committee evaluates all the interviewees, they bring back the top two or three candidates for further interviews with the specific managers in the department the person would be working at.", "Interview Questions": "What does diversity mean to you?"}, {"date": "23 Apr 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Oregon State University (Corvallis, OR) in Sept 2012", "Interview Descriptions": "It was pretty straightforward, they wanted to make sure I could do the coursework so I had to do like 5 sample problems.", "Interview Questions": "There wasn't a random, unexpected question. They asked if I felt comfortable helping others in the class and that's it. "}, {"date": "23 Jan 2016", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Oregon State University (Corvallis, OR) in Apr 2012", "Interview Descriptions": "I met with the researcher who posted an ad for a Lab Tech, we had a short interview and then she hired me on the spot. Overall the process was seamless and we both liked each other right away and knew it would be a good fit.", "Interview Questions": "Are you willing to travel for this position?"}, {"date": "29 Oct 2016", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in Mar 2012", "Interview Descriptions": "Phone interview with Professor, then Video interview with Professor,  Face to Face interview, make plan of study program. Apply for funding. Write proposal, and submit proposal.\r\n\r\nPhone interview with Professor, then Video interview with Professor,  Face to Face interview, make plan of study program. Apply for funding. Write proposal, and submit proposal.", "Interview Questions": "N/A"}, {"date": "21 Mar 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Oregon State University (Portland, OR) in Mar 2012", "Interview Descriptions": "You first need to audit a minimum amount of classroom and range classes and fill out a review form. You will then move to an oral telephone interview. If you pass all of that you will be scheduled for RANGE training. During the multiday training class you will be evaluated every few hours and if you are not meeting minimum requirements will be asked to leave. You will have to work with an experienced instructor while you are learning the curriculum.", "Interview Questions": "How much experience to you have teaching adults."}, {"date": "12 Nov 2015", "title": "Assistant Professor, Computer Science Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in Nov 2011", "Interview Descriptions": "There was a phone interview, and then there was an in-person interview. They had me do the usual research presentation. There was a meeting with the administration. Then they talked about it for a while and eventually I heard back.", "Interview Questions": "What would you do to promote diversity?"}, {"date": "29 Oct 2012", "title": "Linux Systems Administrator, College of Science Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Oregon State University (Corvallis, OR) in Oct 2011", "Interview Descriptions": "After an initial phone interview by the director, I was interviewed in a round-robin fashion by the director and three of the team members: the Windows admin, the desktop support manage, and the purchasing representative. I was asked questions by each person in turn from a list of questions prepared by the director, to give the impression that each person was asking questions of their own. All control over the process was handled by the director, from the questions asked to the order they were asked and by whom. Some rather inappropriate comments were made by the director about my previous employer during the interview process (as to why he doesn't like to hire people from there).", "Interview Questions": "For a Linux administration position, I was asked a surprising number of Windows questions. While I personally have a fair bit of Windows experience, most Linux admins would not fare well."}, {"date": "28 Aug 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Oregon State University (Corvallis, OR) in Sept 2011", "Interview Descriptions": "I knew someone who refereed me to the position. Easier when you make friends with a current worker. I got a call, had a very informal interview and was hired on the spot", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Jul 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Oregon State University (Corvallis, OR) in May 2011", "Interview Descriptions": "You fill out a basic application and then you are invited to participate in a class Spring term.  During this time you are interviewed by current RAs and RDs.  Most of those who make it thru the class become RAs. This whole process was long... taking at least 90 days. If you know you want to be an RA, I suggest preparing the year before by making connections with current \"good\" RAs, RDs, and joining student council.  This will fast track your way in because people already know you and what you're like.  You don't have to be a \"ra ra, I LOVE OSU\" type person but you also cannot be someone who never shows up or has a lot of conduct issues.  They are basically looking for responsible people who will help guide new students and be an active part of the community.", "Interview Questions": "Why do you want to be an RA?"}], [{"date": "25 May 2012", "title": "Career Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in May 2011", "Interview Descriptions": "Learned information through Beaver JobNet then emailed resume, cover letter and references to a staff employee. About a week later I received a phone call asking me in for an interview which was scheduled for the following week. The interview was a behavioral interview and was performed by professional staff members. Overall the process was simple and fairly relaxed. Another couple days and I received a phone call offering me the position.", "Interview Questions": "Tell me about yourself."}, {"date": "17 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Oregon State University (Corvallis, OR) in Apr 2011", "Interview Descriptions": "I contacted the professor I was interested in working for.  Fortunately they were looking to take on a student.  We corresponded via email and then I came to Corvallis to interview.  The interview was primarily over dinner.  At the end of the process, I was offered a job (part teaching assistant and part research assistant).", "Interview Questions": "What is your research experience?  Why are you changing fields?  Why are you interested in the field you're going into?  What do you hope to do in the future?"}, {"date": "3 Aug 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Oregon State University (Corvallis, OR) in Apr 2011", "Interview Descriptions": "Behavioral interview. You are presented with potential scenarios you may face as an RA and asked how you would address them. You are asked how you feel about activities that aren't allowed in the Residence Halls. They want to make sure you are tactful, socially sensitive, and naturally not so far off from \"politically correct\" that the strain from having to be so nearly at all times will cause you to burn out.", "Interview Questions": "What would you do a resident complained about their roommate smelling really bad?"}, {"date": "15 Oct 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Oregon State University in Jun 2010", "Interview Descriptions": "The hiring is mainly through reference letter from your previous professor or talk to the faculties hiring in person through publication and conferences. Former GPA or test score is not important.", "Interview Questions": "recommendation letters"}, {"date": "19 Dec 2014", "title": "KidSpirit Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oregon State University in May 2010", "Interview Descriptions": "There's a fairly lengthy application for the CC position. They want to know about your interests so they can match you with the programs offered. There's a formal interview where you're asked about how you would respond to situations and if they like how you respond they'll invite you to a class where you lead an activity with a group of campers. They want people who are outgoing, responsible, and fun.", "Interview Questions": "There's a curveball question in the formal interview where they ask you how you'd sell a camp sweatshirt to a parent. Be ready for that."}, {"date": "30 Mar 2010", "title": "Detailer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Jun 2009", "Interview Descriptions": "There wasn't much to the interview, very informal. It appeared that they decided on the candidates just based on the resume, because the interview was more of a tour of the company and I could tell that they already have hired me. I also worked at an on campus dining center, and there was no interview.", "Interview Questions": "When are you available to work?"}, {"date": "20 Jan 2011", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Apr 2009", "Interview Descriptions": "It was short.  Not much of an iterview process", "Interview Questions": "What areas of research are you interested in?"}, {"date": "25 Jan 2011", "title": "Office Assistanat Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Oregon State University (Corvallis, OR) in Feb 2009", "Interview Descriptions": "Interviewed with a panel of four people from the particular off looking for an assistant, was largely concerned over ability to be flexible and be able to work with a large multi-cultural community. Thought the interview went really well, but never got a call or an email back in any form.", "Interview Questions": "Name your experiences in dealing with a multi-cultural community"}, {"date": "10 Feb 2010", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Oregon State University (Corvallis, OR) in Aug 2008", "Interview Descriptions": "There is a detailed application online with supplemental questions; they also request a resume and cover letter.  We met for breakfast at 7:30 and went from there to the first group interview with the hiring committee.  After that there was a second group interview with staff of the office.  Then I had lunch with a few people from the office.  After lunch I provided a presentation to several faculty and staff members.  Lastly, I met with the director, one-on-one.", "Interview Questions": "Tell us about your experience working with students from diverse backround?"}]]