[[{"date": "11 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Salem Health", "Interview Descriptions": "Director already had made up her mind before she interviewed, would have been respectful to not waste my time for an interview when she clearly wasn't interested in talking to me.", "Interview Questions": "How do you handle excessive employee turnover?"}, {"date": "21 Apr 2023", "title": "Human Resource Generalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Mar 2023", "Interview Descriptions": "I didn't make it passed the first round. However, there is a phone screening and then it would be followed by a meeting with the hiring manager. Phone screening --> Interview w/ hiring manager ---> Start date", "Interview Questions": "1) Background / Past work experience 2) An example of where you worked as a team 3) Why do you want to work for this company? 4) Long term career goals"}, {"date": "27 Mar 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Salem Health", "Interview Descriptions": "Director  had already made up their mind before meeting with me.  Wasted my time coming in.  Didn't respect applicant enough to give me a chance to actually interview and show my strengths and what I could offer.", "Interview Questions": "My  goals to improve the staff moral."}, {"date": "19 Jan 2022", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salem Health", "Interview Descriptions": "Professional, questions were detailed and behavioral based, interview panels stayed within time, members explained everything, very thorough. Definitely well prepared. Interviewed by various team members, management, as well as customers.", "Interview Questions": "I was asked about my experience and education."}, {"date": "12 Nov 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Salem Health", "Interview Descriptions": "Phone screening and virtual interview. Interview lasted about 30 minutes and was probably 7 or so questions. After the interview you have to supply references through a portal and they give a decision after that.", "Interview Questions": "Tell me about a time you cared for a difficult patient."}, {"date": "16 Mar 2021", "title": "ED RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health", "Interview Descriptions": "The interview was Over video chat with a panel of 4 other nurses/managers. Very friendly and good experience. Was contacted a few days after via phone with an offer by one of the ED schedulers.", "Interview Questions": "What would you guess is going on with a patient who just had surgery and is now short of breath. "}, {"date": "26 Mar 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Feb 2021", "Interview Descriptions": "Submitted application online including a video with 5-10 questions. Was called in for an in-person interview that felt extremely difficult for a new grad position. It was clinical-type questions about how to care for patients and what to expect, as well as prioritizing 4 patients. It was with 2 people in person with about 5 hiring managers on zoom in the room. I felt okay about my interview but not amazing. It was not a welcoming environment like I have felt in other interviews. I also was never contacted after the interview. I emailed and no one ever replied to me. I am fine with being denied, however was disappointed to be completely ghosted during the process.", "Interview Questions": "Clinical type questions- what to expect w/ this pt (orders & interventions) & prioritizing patient care"}, {"date": "17 Mar 2023", "title": "Care Management Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health in Feb 2021", "Interview Descriptions": "Straight forward, asked some general information regarding history, then posed some situational questions. Discussed previous relevant experience. As we wrapped things up, I talked about what I had planned for the next several years as far as professional goals.", "Interview Questions": "Describe a difficult situation that you've hard to navigate at work- explain how you handled it and why"}, {"date": "12 Sept 2020", "title": "Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Salem Health", "Interview Descriptions": "All skills and behavioral questions with a leadership and peer panel. Some questions didn’t seem relevant and some that I expected were not asked. Do your research and find someone that works in the department you want to work in and ask them questions about Salem Health’s culture; go in with that knowledge and then ask the interview panel about the culture. Assess and use your common sense.", "Interview Questions": "Tell us a time when you met with an adverse work situation involving another department"}, {"date": "20 Sept 2019", "title": "Junior Systems Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Salem Health", "Interview Descriptions": "Met with the whole SysAdmin team. Had a very positive interview experience. Great questions, great conversations. Unfortunately, I was not given an offer but the gained a great interview experience.", "Interview Questions": "Provide an example where you used creative problem-solving."}], [{"date": "25 Mar 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Jul 2019", "Interview Descriptions": "Interviewed in front of a panel of employees on the CVCU unit. I was required to answer priority patient questions and tell them my availability. That is all I can remember.", "Interview Questions": "Which patient would you go and see first? "}, {"date": "26 Dec 2020", "title": "Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Feb 2019", "Interview Descriptions": "The interview process went well. They were kind and extremely receptive. Proscribe uses an video platform for interviews first and then talks on the phone with you regarding it and asks follow up questions.", "Interview Questions": "The interview questions were simple such as “tell me why you want to be a scribe” "}, {"date": "6 Oct 2018", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Salem Health", "Interview Descriptions": "I applied online and received a call for an interview 3 weeks later. The interview took place in a room with 3 people that I assumed to be hiring managers since I don't recall them telling me their job titles. It could be because it was toward the evening time therefore I could tell they were tired and wanted to get it over with. They tried their best to be polite and asked a lot of behavioral questions. There were 4 clinical nursing scenarios that you needed to basically think of what the patient might have and what nursing action will you perform, most of which were cardiac related questions. It was pretty difficult for me... it was like one of those really hard NCLEX questions that takes you a while to think figure it out since there was a lot of information. But it was on paper so you could refer back to the details if needed. I honestly was really surprised that they asked this since I was a new grad and applied for their residency program, but it could also be that I was not prepared to answer it and therefore kinda butchered the interview. They were really nice about it though.", "Interview Questions": "Tell me about a time you had a patient's family member who was really upset at your care for the patient? What did you do to resolve the problem?"}, {"date": "26 Dec 2019", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Salem Health in Sept 2018", "Interview Descriptions": "It was an easy  interview.  The supervisor and other two EVS workers joined to interview me. If I recall, It was just like I am talking to them in a everyday conversation. It is probably because of the type of job. It is a no brainer job. Three days after the interview, I got called in and offer a job and accepted it.", "Interview Questions": "What is dependable means to you?"}, {"date": "18 Oct 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Salem Health in May 2018", "Interview Descriptions": "It was through video among a panel of hiring managers. They each asked me questions regarding myself and then some behavioral and critical thinking. It was kind of difficult because you had to prioritize and were put on the spot wanting to answer quickly.", "Interview Questions": "Why do you want to work at salem"}, {"date": "3 Feb 2018", "title": "CNA PACU Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Salem Health (Salem, OR) in Jan 2018", "Interview Descriptions": "There was the Manager and 2 other co-workers. The interview I felt went well, I spent an hour on the unit to learn what they do. The manager told me I came highly recommended.", "Interview Questions": "describer a time when you had a conflict with an employee and how did you solve it"}, {"date": "27 Dec 2017", "title": "Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Salem Health in Nov 2017", "Interview Descriptions": "Very impressive process.  The primary recruiter was awesome.  The panels for interviews from morning to lunchtime were relevant to the role and members were polished and their questions very pointed.  Met CHRO who was awesome as well.", "Interview Questions": "Typical interview questions about managing relationships, workload, accountability, backing up critical skills, overtime excesses, and specific behavioral questions to verify experience and fit"}, {"date": "27 Oct 2017", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Oct 2017", "Interview Descriptions": "I had a call from HR about when am I available for a \"phone interview\". The next day I had a FaceTime interview with two nurses. There was no formal description of how the interview is gonna be like, they just introduced themselves and started asking questions, taking turns. It felt intimidating when they started asking NCLEX questions and if I already have my license. Overall, it just made me question myself if this hospital would be a great environment for a foreign nurse like me, having the first interview as a verbal nursing exam is quite traumatic.", "Interview Questions": "Case study questions, prioritization, and rationalization."}, {"date": "5 Nov 2017", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Oct 2017", "Interview Descriptions": "Was a fairly regular interview. Two people did the intereviewing. Both were engaged and definitely listening & watching body language. Know the mission & vision statement of the Hospital before you go. It's very important.", "Interview Questions": "What is the mission and vision of the Hospital? "}], [{"date": "9 Jun 2016", "title": "IS Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Salem Health (Salem, OR) in Apr 2016", "Interview Descriptions": "Multiple weeks passed before being contacted about an interview. 1) 30 minute phone interview with a panel of individuals. Multiple weeks to get back with a response. 2) In person panel interview with four people. Conducted in a VERY small room at a round table. One hour was provided. Tour of department after interview. Received an email indicating I was not selected.", "Interview Questions": "Had to do with providing exceptional customer service: definition, process, steps, example"}, {"date": "27 Oct 2015", "title": "Care Management Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salem Health (Salem, OR) in Sept 2015", "Interview Descriptions": "I applied online and had an interview a little over one week later. The interview was conducted by about six people associated with the Care Management program. The interviewers were very friendly and made the stress of such a large panel of interviewers less intense. It was difficult for me to tell if they were friendly because they thought I was a good applicant, or were being patronizing.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 Mar 2015", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Salem Health", "Interview Descriptions": "They ask all cookie cutter STARS question. It all was like tell me a time when this happen, when you fail or when you lost reputation or when you did something wrong. There was also a peer interview at the end.  The interview process was really slow. Phone then 3 weeks later in person", "Interview Questions": "why salem hospital"}, {"date": "23 Feb 2015", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Salem Health (Salem, OR) in Feb 2015", "Interview Descriptions": "Was a phone interview. They called a few days after the application was submitted online. Person from HR asked if it was a good time to talk, then asked like 4 different interview type questions about the position. The entire call lasted maybe 5 minutes. Very quick and to the point. Was more awkward than an in-person interview but I understand the point of phone call screening.", "Interview Questions": "Why do you want to work here"}, {"date": "20 Jul 2018", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Salem Health in Aug 2014", "Interview Descriptions": "Very long process.  It took almost six weeks.  Everyone was helpful throughout the process. Background check, color test, vaccination review, phone interview, phone screen, two panel interviews. Once I had a verbal offer, there were still two more weeks in the process.", "Interview Questions": "Behavioral based and cultural fit.  Integrity/ethics were also asked quite often."}, {"date": "13 May 2014", "title": "Accounting Clerk II-Accounts Payable Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Salem Health in May 2014", "Interview Descriptions": "Phone interview with accounting supervisor. She was very nice. I had previous experience working in accounts payable but at a company that had a large accounts payable dept. Salem Health has a two-person accounts payable department with 1,200 invoices a month coming through. Part of the job involves scanning invoices into the system yourself for payment. I didn't have this experience as my company had imaging clerks that took care of this for a/p. The lack of that imaging experience combined with the amount of invoices and what seemed to me to be insufficient staffing for the department, doomed this opportunity for me.\r\n\r\nI wasn't surprised at all when I received a rejection email shortly after the phone interview.", "Interview Questions": "Do you have previous experience scanning invoices into an a/p system yourself for payment?"}, {"date": "26 Apr 2014", "title": "IT Staff Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Salem Health (Salem, OR)", "Interview Descriptions": "Initially received email invitation to interview and it took a couple of weeks to go through phone screens and schedule an onsite interview.  When I got onsite and started the interview it turned out to be very different from how the job was initially described. The staff questions and job expectations were different from the description by the hiring manager during phone screens.  Classic bait and switch interview process.There seems to be a disconnect between management and staff where management is out of touch with day to day activities.", "Interview Questions": "The most unexpected question from the staff was, \"Were you given a description of this job?\"  I repeated the description as it was described to me and they looked confused and acted like it was my shortcoming.  That was the end of the interview.   From my albeit limited exposure to the organization it seems like a highly politicized environment where popularity counts more than ability.  Even if it went well and I were offered a job I would turn it down because I value skills over politics. As a 20 year IT veteran I can spot dysfunction when I see it."}, {"date": "4 Jan 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR)", "Interview Descriptions": "I think interview questions are focused on attitude/behavior and skill. Management wants to see how well you would work as a team member, how you would react to different situations and if you are self motivated. There is also a big emphasis on patient satisfaction.", "Interview Questions": "Why do you want to work for us?"}, {"date": "31 Jul 2015", "title": "New Grad RN Residency CVCU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salem Health (Salem, OR) in Oct 2013", "Interview Descriptions": "Two part interview process, first with HR and then various Unit staff. Various behavioral and clinical questions were asked by each panel member.  Interview was just myself and panel.  Entire interview 45 minutes.  Staff were polite courteous and non threatening.  As a new grad it was", "Interview Questions": "Describe a Conflict with manager and how you resolved it, recall a time when you went above and beyond, There were about 5 scenario based clinical questions related to Cardiovascular diagnosis"}, {"date": "5 Feb 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Salem Health (Salem, OR) in Aug 2013", "Interview Descriptions": "Human Resources called me about 6 weeks after I applied to offer me an interview for the Neuro Trauma Care Unit.  Five days later, I interviewed, however, it was for the Intensive Care Unit instead of Neuro Trauma.  The interview was pretty standard.", "Interview Questions": "What makes you a good candidate for the position?"}], [{"date": "3 May 2014", "title": "Paramedic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Salem Health (Goodyear, AZ) in Aug 2013", "Interview Descriptions": "Phone interview which was nice because I was currently living out of state.  I thought I had no chance but sure enough they did hire me and now I'm living in Arizona.", "Interview Questions": "All the questions were routine.  There wasn't any difficult questions.  They more just wanted to get to know me and know my experiences."}, {"date": "8 Jul 2013", "title": "Hiring Process Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Salem Health", "Interview Descriptions": "They use the Gallop survey to make decisions to interview or not. If someone does not pass the gallup exam they will not interview them. This gets rid of a lot of candidates. Galllup also states they should not use thier tool to make hiring decisions. Once got to the organization went through group interviews. It was very unorganized and some even asked quesitons that were out of bounds. It was odd that people did not take the interview process seriously.", "Interview Questions": "Usual questions, Describe a time when you lead a team. Describe a time you put ther needs of the organization ahead of yours."}, {"date": "4 May 2012", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Salem Health (Salem, OR) in Aug 2010", "Interview Descriptions": "The whole hiring process takes a very long time for any position. \r\nI first had a half hour conference phone interview with 3 people. They were not prepared. In fact, as I was on the phone, they told me they were looking up the questions they were to use. \r\nAfter a couple of weeks, I was notified that I was selected for a second interview. \r\nI interviewed first with the management team and later that day I interviewed with supervisors (6 of them). It was not very organized. \r\nI was not too impressed with the how friendly some people were. I would walk by staff and no one tried to say or even smile.", "Interview Questions": "Tell me about a time when you encountered a problem in the workplace with a coworker and how did you handle it. "}, {"date": "27 Feb 2014", "title": "CNA Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Salem Health (Salem, OR) in Jun 2010", "Interview Descriptions": "Email confirmation for resume received, two person interview. Emailed back that I didn't get the job.", "Interview Questions": "A conflict that you had with prior manager, how was it resolved."}]]