[[{"date": "30 Jun 2023", "title": "Corporate Finance Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University Health System (Singapore)", "Interview Descriptions": "Standard interview process that covers the background of the candidates, reason for leaving the current role, willing to relocate to the work place, what’s greatest strength and weakness, what’s the most challenging task throughout your career", "Interview Questions": "There was an aptitude test after the verbal interview with the recruiters"}, {"date": "14 Jun 2023", "title": "Assistance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Health System (Singapore)", "Interview Descriptions": "The interviewers are professional and will indepth questions with technical knowledge. Please get prepared before the interview and understand the company background before interview. Basically they will try to understand what character you are and also your capacity.", "Interview Questions": "What is your reason of leaving?"}, {"date": "30 May 2023", "title": "Assistant Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Health System (Southern Islands)", "Interview Descriptions": "Very nice and friendly Human Resource Personnel and as well as the head of department, who was very kind and out-front in providing the necessary information. Interview was smooth and not delayed, additionally the human resource personnel was helpful in providing detailed information to get to the location.", "Interview Questions": "What are your Strengths and Weaknesses?"}, {"date": "15 May 2023", "title": "Assistant Manager Procurement Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "- Panel interview includes hiring team (3 pax) + 1 HR - I've attended many interviews for corporate roles in the private sector but I was stunned and appalled beyond words with the behavior of the hiring team. - Hiring team is more interested to look at their handphones while I shared my achievements. - Nit pick about the typo i made in the application form - While it was my turn to speak one of them look like he is physically there but mentally not there., maybe cos he looks antique and should have retired long ago. - another hiring manager put up his arms at the back of his head and dozed off - The only one seems genuinely interested in the interview process is the HR manager. - One of the worst and most unprofessional interviews I have attended. - It was possibly good to see so many red flags during the interview by how they conducted themselves unprofessionally.", "Interview Questions": "- Tell me about urself - other standard questions and scenario setting"}, {"date": "6 Apr 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "The interview process for an Executive Assistant position at National University Health System (NUHS) may vary depending on the specific department or hiring manager conducting the interviews. However, a typical interview process for an Executive Assistant position at NUHS may include the following steps: Application Submission: The first step is to submit an application, typically through NUHS's official job portal or career website. The application may include a resume, cover letter, and any other required documents or qualifications. Initial Screening: After the application submission, NUHS may conduct an initial screening to shortlist candidates based on their qualifications and experience. This may involve reviewing resumes and cover letters to assess candidates' suitability for the role. Interview Invitation: Shortlisted candidates may be invited for an interview, which can be conducted in person, via phone, or through video conferencing. The interview invitation may include details such as the date, time, and location (if in-person) of the interview, as well as any additional instructions or requirements. Interview(s): The actual interview process may consist of one or multiple rounds of interviews. The interviews may be conducted by one or more interviewers, which may include the hiring manager, members of the department, and/or other relevant stakeholders. The interviews may assess a candidate's qualifications, skills, experience, fit with the organizational culture, and ability to perform the duties of an Executive Assistant. Skills/Assessment Tests: Depending on the requirements of the role, NUHS may also conduct skills or assessment tests as part of the interview process. These tests may assess a candidate's proficiency in areas such as computer skills, communication skills, problem-solving skills, and other relevant competencies. Reference Checks: NUHS may conduct reference checks to verify a candidate's employment history, qualifications, and character. This may involve contacting the candidate's listed references or other relevant contacts to gather feedback on the candidate's performance and suitability for the role. Final Offer: After the interview and reference check process, NUHS may extend a final job offer to the successful candidate. The offer may include details such as the salary, benefits, start date, and any other terms and conditions of employment.", "Interview Questions": "N/A"}, {"date": "13 Mar 2023", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "Interviewers gave scenarios specific to the role and asked how I would deal with them. Asked me some questions about the research topic. Generally quite intimidating with their tone of voice and body language, only got more friendly when the interview ended. Reminded me of strict and intimidating teachers in school. Made me wonder if the work environment was the same. Most difficult interview I've ever had.", "Interview Questions": "What are your strengths and weaknesses? Why are you interested in this job? How would you deal with so and so situation? Which is the correct answer for this procedure?"}, {"date": "18 Jul 2022", "title": "MIS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "I was asked relevant and specific questions. I was able to answer most of them. Was also given time to ask my questions if any.  Overall, satisfied with the process", "Interview Questions": "Do you know what medical informatics is"}, {"date": "23 May 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "Experiences and self info.\r\nAbout myself and my experiences. Given situation  and ability to work in stated scenarios. Working timelines and pre-training. Potential for growth. Experiences explanation on previous jobs and how do you face a difficult situation.", "Interview Questions": "About myself\r\nExperiences\r\nWorking situarion\r\nCredentials"}, {"date": "11 May 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "Just one round of zoom meeting asking if I can accept all the different kinds of work that are expected of the job and what are the job scopes like.", "Interview Questions": "If I am ok with the different kinds of job they do\r\nHR asking standard questions like have you met difficult team player and how do you resolve it"}, {"date": "30 May 2022", "title": "Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at National University Health System (Singapore) in May 2022", "Interview Descriptions": "Poor shortlisting leading to time wastage from both sides if the requirement is for the candidate to have experience from the same industry. The info is only conveyed during the interview, after the candidate is made to sit through a test, fill up the application form and provide supporting documents. \n\nThe interview lasted less than 15 min.", "Interview Questions": "Introduce yourself"}], [{"date": "13 Apr 2022", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University Health System (Singapore) in Jan 2022", "Interview Descriptions": "Applied through NUHS portal and was notified that I was selected for an online interview roughly about ten days later. \r\n\r\nA terrible experience with a seemingly disinterested interviewer (only two person with another being from HR).  Interviewer only asked me one typical question to share more about myself before she proceeded to ask if I have any questions for her. \r\n\r\nAsked her about the upcoming projects for the role and she asked HR what role did I applied for. Asked her about the team culture and she replied that if I read the core values of NUHS, the culture will be same as what was written there. Guess that pretty much tells you my takeaway from the interview.\r\n\r\nPlus point was that the HR staff did conclude the application process by dropping me an email around two weeks post-interview to inform me that I was not selected.", "Interview Questions": "Tell me more about yourself."}, {"date": "14 Mar 2022", "title": "Finance/Accounting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University Health System (Singapore) in Jan 2022", "Interview Descriptions": "Zoom Interview.  Interviewers were late by 15 minutes without any apology given.  Was happy they did not offer as if they showed no respect for the candidate's time, I wonder how they treat employees or staff.\r\n\r\nInterviewers were from NUHS Corporate Finance and Human Resource", "Interview Questions": "1. Tell me more about yourself\r\n2. Why do you want to join NUHS xxx department\r\n3. Why do you want to leave your current role"}, {"date": "1 Jan 2022", "title": "PSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 6 days. I interviewed at National University Health System (Bedok New Town, ) in Sept 2021", "Interview Descriptions": "agent loads of emailing to agent to get an interview with nuhs hr whom forgot to pass me my uniform sheet, very funny that fella. interview with hr and then two other center in-charge", "Interview Questions": "how do u handle stress\nwat would  be the most challenging to work here\nwhy u want to work in a hospital"}, {"date": "1 Sept 2021", "title": "Engineering Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at National University Health System", "Interview Descriptions": "HR called for interview within the week. Was told that there will be more than one interviewer and from different hospitals. However, few of them aren't able to make it for the interview. The online interview took about 30mins. Their reaction to non-experienced individual can be seen, and it seems like they need someone who had hands-on work before even though they stated \"OJT is provided\".", "Interview Questions": "1) Tell me about your current job\n2) What did you do for FYP?\n3) Scenerio based questions\n"}, {"date": "8 Feb 2022", "title": "Medical Informatics Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at National University Health System in Jul 2021", "Interview Descriptions": "It was a zoom interview with two team leaders and a HR person. The questions are direct and relatively easy to answer. They did not expect interviewee to have prior knowledge.", "Interview Questions": "Why do I want this job?"}, {"date": "3 Feb 2021", "title": "Senior Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National University Health System", "Interview Descriptions": "2 rounds of interview; 1 with the manager and another with the Senior Management\r\nThe 1st round will be with the line manger of the department. If that is cleared, candidate will then proceed to the next round with the Senior Management.", "Interview Questions": "1. Describe yourself\r\n2. How would you react given a situation\r\n3. What is your biggest achievement"}, {"date": "22 Jan 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at National University Health System", "Interview Descriptions": "Interview through Zoom, it was more of them explaining the job scope than actual interview. Said will get back within a week, but did not get any offers from them.", "Interview Questions": "Tell me more about yourself ?"}, {"date": "28 Jan 2021", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National University Health System (Singapore) in Jan 2021", "Interview Descriptions": "There were 2 interviewers from opt dept. One didn't speak at all and the other person was sarcastic the whole time. She said this job includes work that wasn't listed in the job scope and this is a \" everything must do \" job.  I don't think such remarks are necessary during a job interview as it tells me more about the person I will be working with. Thanks for the heads up that this job isn't what it seems like it has been posted online.", "Interview Questions": "Tell me about yourself and your experiences"}, {"date": "13 Apr 2021", "title": "Executive Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National University Health System (Singapore) in Jan 2021", "Interview Descriptions": "Applied at Sep 2020, got an email to conduct a test after few weeks which took 2 hours. Only receive respond at Jan 2021 for a ZOOM interview. The HR personnel changed the interview time 2 times in a day, which is really inconvenient. The interviewers were late like 10 minutes, for the ZOOM interview. The interview was ok.", "Interview Questions": "Why do you choose NUHS?"}, {"date": "18 Dec 2020", "title": "Temp Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at National University Health System (Singapore)", "Interview Descriptions": "the interviewers i had were friendly and approachable. there was an average waiting time before i got to meet the interviewers. i had 2 friendly interviewers, one male and one female.  the interview ended quickly in about 15 minutes, half was spent on describing job scope and half spent on actual interview.", "Interview Questions": "can i handle stress well"}], [{"date": "7 Dec 2020", "title": "Temp Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at National University Health System", "Interview Descriptions": "interview was held via zoom and went very smooth, interviewers were engaging and friendly, asked questions related to the job and helped to clarify any questions. comfortable during the interview.", "Interview Questions": "self introduction "}, {"date": "28 Oct 2020", "title": "Assistant Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National University Health System in Sept 2020", "Interview Descriptions": "Friendly interviewers.\r\nVery straight to the point.\r\nInterviewers took time to read through course of study and working experience. \r\nAsked to intro myself and what I know abt the role. \r\nTook abt 15-20mins I think.", "Interview Questions": "Self intro"}, {"date": "29 Jul 2020", "title": "Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at National University Health System", "Interview Descriptions": "Received a call 2 months after online application. Went through 2 rounds of interviews. Each interview has 3 people, from HR and other relevant departments. 1st interview lasted about 1 hour, 2nd interview with the managers lasted about 30 mins. All interviewers are very pleasant and nice. Got an offer call next day after 2nd interview.", "Interview Questions": "Why did you want to join healthcare?"}, {"date": "11 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at National University Health System in Jul 2020", "Interview Descriptions": "They asked about my experiences and what I know technically. Thats about it. im not just trying to fill the 30 word count. anyway i accepted the offer, and it was an internship with school", "Interview Questions": "he asked about my experience with some of the technologies they used"}, {"date": "14 Jan 2021", "title": "Pre-registration Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at National University Health System in Mar 2020", "Interview Descriptions": "Job application was quickly processed and interview opportunity offered within a week. Interview was conducted on zoom. Was also casual, fun and relaxed. Was offered the position 15 mins after the interview.", "Interview Questions": "Mainly asks about CV, strengths and weaknesses, how would you react in certain scenarios"}, {"date": "3 Feb 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at National University Health System (Singapore) in Feb 2019", "Interview Descriptions": "The interview process was short but the interviewer was quite nice. She asked quite a few questions regarding how my background can help with the job position. Afterwards, there’s an assistant brought me to visit around the company and addressed some questions that I had.", "Interview Questions": "How you can help with the tasks "}, {"date": "13 Feb 2023", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at National University Health System (Singapore) in Feb 2019", "Interview Descriptions": "Applied for short term contract position to man their call centre. Interview was short and smooth, mainly related to your personality and attitude, which makes sense since it’s a customer service role. Very responsive hiring team.", "Interview Questions": "Previous experience with customer service"}, {"date": "4 Sept 2018", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National University Health System (Singapore) in Aug 2018", "Interview Descriptions": "Applied the job online and received a call from HR about a week later. Had two rounds of interviews within one week. Interviewers are very professional and approachable. The interviews had definitely let me know about the organisation better. I could feel the passion in the interviewers which made me very keen to participate the interview. Gotten the offer within 3 days after the second interview.", "Interview Questions": "Why do you choose to work in the healthcare industry? "}, {"date": "26 Jun 2018", "title": "Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at National University Health System", "Interview Descriptions": "I had two rounds of interview with the director and deputy director of the team. In between, I was asked to submit an essay. I was offered the position on the spot after the second round of interview.", "Interview Questions": "Would you prefer to work on your own or as a team? Why?"}, {"date": "28 Nov 2017", "title": "Corporate Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at National University Health System (Singapore) in Nov 2017", "Interview Descriptions": "RecruitFirst had headhunted me and submitted my application for the job. NUHS contacted me 3 weeks later for a job interview.  However, I felt there was a mismatch of expectations, mainly because the job scope described to me by RecruitFirst differed quite a bit from what the organisation was actually looking for.\r\n\r\nNonetheless, I appreciate that the panel of interviewers (3 pax) remained friendly and professional at all times.", "Interview Questions": "1. Why are you interested in the healthcare industry?\r\n2. Is there a reason why you applied for NUHS instead of NHG or Singhealth?\r\n3. What do you  hope to achieve in the next 5 years?\r\n4. What am I looking for in a job?\r\n5. What is your greatest weakness?"}], [{"date": "26 Sept 2015", "title": "Senior Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at National University Health System (Singapore) in Nov 2014", "Interview Descriptions": "The interview process is straight forward. 2 rounds of interview depending on the department. One with Human Resource department one with Head of the Head of The department.\r\nQuestions were mostly asked around my work experience and fitment.\r\nHow do you think you fit here considering your background?\r\nHave you worked in the hospital environment earlier?\r\nSkills related questions as well.", "Interview Questions": "Explain about your past work experience"}]]