[[{"date": "9 Aug 2022", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Redlands", "Interview Descriptions": "Overall it was an okay interview process. Very lengthy and not much down time provided. However, that is expected with higher education interviews, especially more senior positions.  Not bad process.", "Interview Questions": "Why the university of Redlands? "}, {"date": "7 Jul 2022", "title": "Athletic Trainer, Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Redlands", "Interview Descriptions": "Casual, in the athletic training facility with the head athletic trainer. You get to see how the training room works. There were a lot of candidates to chose from they only hire a few each year", "Interview Questions": "Do you feel comfortable around bodily fluids such as blood and throw up?"}, {"date": "3 Jun 2021", "title": "Assistant Controller Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Redlands", "Interview Descriptions": "The interview process in the end was okay, but it took forever for them to call me after I had applied. I ended up taking another opportunity in the meantime.", "Interview Questions": "Why did I want the job. "}, {"date": "23 Nov 2020", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Redlands (Redlands, CA)", "Interview Descriptions": "Super easy just show you are capable and you can get any job on campus. There are so many jobs, no matter what you will be sure to find one that fits your specific skill set. I personally really liked sports so I worked in event services.", "Interview Questions": "What is your  past work experience?"}, {"date": "17 Dec 2020", "title": "Security Systems Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Redlands (San Francisco, CA) in Nov 2020", "Interview Descriptions": "First round of interview was mix question related to technical or HR . THere were three commitee members who tokk my interview. It was an easy interview.  IT contains simple question related to job position", "Interview Questions": "what protocol does DNS use"}, {"date": "7 Aug 2020", "title": "CRLA Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Redlands (Redlands, CA) in Sept 2019", "Interview Descriptions": "After completing CRLA certification, tutors are offered the opportunity to interview for two Co-facilitator positions. In these interviews, it is typical to receive questions about your ability to present, lecture, lead thought provoking discussion, persevere academically, your personal triumphs, and topics involving the specific requirements of the position. You are then paired with another applicant to present a typical CRLA PowerPoint presentation (provided) to assess your presentation skills.  The key is to be genuine in your academic and philosophical passion for tutoring, maintain interest and enthusiasm regardless of topic, and be personable.  CRLA is often referred to as “tutor support group”. If you can empathize in a relatable way, you can really shine in this position.", "Interview Questions": "How do you feel your could improve our current CRLA program?"}, {"date": "23 Jul 2019", "title": "Department Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Redlands (Redlands, CA) in Jul 2019", "Interview Descriptions": "Applied at the beginning of June.  I was called for interview after several weeks.  I would definitely review standard interview questions before going in for a panel interview.", "Interview Questions": "If you need to speak with a member from the board of directors, how do you communicate with them?"}, {"date": "6 Apr 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Redlands", "Interview Descriptions": "The interview process was laid back. It's been more than 4 years since my interview so I can't really remember all the questions. I'm sorry I can't provide more information on this.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "23 Aug 2017", "title": "Bulldog Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Redlands", "Interview Descriptions": "Very comfortable and laid-back. There were no curve balls - the whole experience was very straight forward. The interview was in-person and I was notified the same day of the outcome.", "Interview Questions": "Why do you want to work as a Bulldog Caller?"}, {"date": "13 Sept 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Redlands (Redlands, CA) in Dec 2016", "Interview Descriptions": "Email introduction, follow-up phone conversation, culminating with in-person on-sight (on Redlands Campus) interviews with Directors of the School of Business, the Banta Center for Ethics, and the Center for Spatial Studies.", "Interview Questions": "What education or work experience do you feel could make you a value-added member of this team, and how do you foresee yourself performing in this role as a Graduate Research Assistant?"}], [{"date": "20 Mar 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Redlands (Redlands, CA) in Nov 2015", "Interview Descriptions": "I was recommended to be a subject tutor.  I went to the coordinators office and answered a few questions. Grapes apple pear avocado tree grass car fire tire dog cat bird ball throw fetch walrus", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "30 Jun 2014", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Redlands", "Interview Descriptions": "Job posting was up on the several job searching site. I was to send an application via e-mail. After submitting an application, the person contacted through e-mail and phone saying that they would like to have an interview. I had an interview via Adobe Connect. With an adobe connect, I had about an hour interview.", "Interview Questions": "What have you done for online learning initiative? What is the characteristic of online learning that adapted pedagogy?"}, {"date": "10 Mar 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Redlands (Redlands, CA) in Jun 2013", "Interview Descriptions": "Submitted application online. About a week later received phone call to schedule an interview which was approximately 1 week later.  There were 3 or 4 people involved in the interview process and they asked very basic questions. \"why do you want to work here\" \"name a time where you made a mistake at work\" \"what are your Microsoft excel skills.\"  The interview was about 30 minutes long, relatively short and to the point.", "Interview Questions": "\"What are your skills using Microsoft excel?\""}, {"date": "22 May 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at University of Redlands (Redlands, CA) in Sept 2011", "Interview Descriptions": "It was basically pretty simple interview for a student job.", "Interview Questions": "What are your past leadership experiences? "}, {"date": "10 Aug 2015", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Redlands (Redlands, CA) in Jan 2011", "Interview Descriptions": "It was a standard interview of phone screening followed by an in-person interview. It was not hard but you may want to review the standard interview questions and make sure you have good answers for those questions. You want to be yourself but you also do not want to take a long time thinking of an answer for each question.", "Interview Questions": "Standard interview questions were asked (i.e. - Why do you want to work here? What are your best skills? Describe a time when...)."}]]