[[{"date": "22 Sept 2022", "title": "Student Nurse Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Froedtert South (Kenosha, WI)", "Interview Descriptions": "I had interviews with two coordinators in the lobby. The interview went great but I received an email with not get selected. I think there are two steps interviews for the student nurse internship. ", "Interview Questions": "What do you see yourself in the next five years?\nWeakness and strength?\nWorking schedule conflict "}, {"date": "3 Aug 2022", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Froedtert South", "Interview Descriptions": "I was recruited off of LinkedIn. From there the VP of staffing had a 30 minute phone interview with me before choosing to forward my application to the physicians associated with the positions I was interested in. Now I am in the process of setting up a video interview with some of the staff. They ask for 5 references (minimum of two current supervisors and one co-worker or instructor that are listed on your application ).", "Interview Questions": "Tell me about yourself.\nWhat is an ideal work environment for you?\nWhere do you see yourself in 5 years?"}, {"date": "14 Jul 2021", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Froedtert South (Kenosha, WI) in Mar 2021", "Interview Descriptions": "Interview takes a while  \r\nInterviewed by a few people \r\nInterviewers made the process Very comfortable and friendly  very professional and great environment the process takes a while because there are Steps you must follow if picked", "Interview Questions": "Why do you want to work here ? "}, {"date": "12 Mar 2021", "title": "BSN RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Froedtert South (Kenosha, WI) in Mar 2021", "Interview Descriptions": "First was a pre-recorded video interview, followed by an in-person interview with nursing management, and a final phone with Human resources. This moved quickly. I applied then received an e-mail to complete a video interview. I, then, got a text message to schedule an in-person interview. By the end of the day, I was offered a final phone interview.", "Interview Questions": "A time where I went above and beyond for a patient?"}, {"date": "2 Jul 2019", "title": "Nurse Extern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Froedtert South (Kenosha, WI) in Jul 2018", "Interview Descriptions": "The interview was an open interview format. The actual interview process consisted of about 5-10 minute interview with job-related questions and expectations for future employment. Prior to the interview, there were hospital recruiters and personnel on site to answer further questions and assist potential employers on application process.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 Oct 2017", "title": "Courier Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Froedtert South (Kenosha, WI) in Jul 2017", "Interview Descriptions": "1st round - Included HR, hiring manager and group team lead. 2nd round - a discussion session with peer roles. A very informal and comfortable session. Third round - was called for availability for a COO interview and provided the requested information. The next reply to me was that my application was not accepted (as if no interviews occurred). A very disappointing end to what I perceived as an excellent opportunity.", "Interview Questions": "Why do you feel you’re the best candidate?"}, {"date": "3 Apr 2021", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Froedtert South (Kenosha, WI) in Jan 2017", "Interview Descriptions": "Long but fair process. \na week after application I was contacted by a hiring manager,  2 days later HR interview, and a week after an interview with VP .. a day after the last interview I was contacted by HR with an offer...", "Interview Questions": "do you consider yourself an introvert or an extrovert? "}, {"date": "17 Apr 2015", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 months. I interviewed at Froedtert South (Kenosha, WI) in Apr 2014", "Interview Descriptions": "I was involved in a phone interview with the therapy manager and clinical specialist.  the phone interview was brief and to the point.  The questions the panel asked were as followed:\r\n* introspective questions about me and my clinical experience and how they would match the current job opportunity.\r\n* clinically driven questions\r\n* daily job duties\r\n* explanation of job qualifications/essential job duties\r\n* explanation of job expectations (productivity standards)\r\n* explanation of benefits \r\n* geographic locations of job sites (two campuses)", "Interview Questions": "challenging job situations and how they were handled\r\nhow well  I work under pressure"}], [{"date": "12 Apr 2016", "title": "Administrative Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Froedtert South (Kenosha, WI) in Mar 2013", "Interview Descriptions": "The process began with an online application.  I then received a phone screen and was later brought in to meet with several members of the team over the course of three separate interviews.  It seems like a lengthy process but the employer does a good job in vetting out candidates to make sure the right fit gets the job.  The online status updates are a big help.", "Interview Questions": "How do you handle a difficult employee?"}]]