[[{"date": "13 Mar 2023", "title": "Registered Behavior Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AbleLight", "Interview Descriptions": "Keep you waiting on phone, quick questions and then schedule interview. Postponed several times. Not challenging questions. Overall mediocre experience. Neither positive or negative. Want to get through it quickly and seem distracted.", "Interview Questions": "What is your greatest strength?"}, {"date": "16 Jun 2021", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at AbleLight", "Interview Descriptions": "I was interviewed by multiple staff then leadership. They were interested in me as a person. They were clear about job responsibilities, training, benefits, and pay. I felt I prepared once I started my job.", "Interview Questions": "What tough situations I had experienced in the past in a similar role."}, {"date": "24 Feb 2022", "title": "Business Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AbleLight (Napa, CA) in Aug 2020", "Interview Descriptions": "It was straightforward and professional. Questions were all relevant to the position. It was a panel interview with the COO, CFO, Regional Director and HR Manager. People were all friendly and as engaged as possible considering the virtual format on Zoom.", "Interview Questions": "How will you manage multiple complex  projects to ensure timely completion?"}, {"date": "9 May 2019", "title": "Internal Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AbleLight (Brookfield, WI) in Apr 2019", "Interview Descriptions": "Very responsive. The whole team was respectful and kind. The process was more conversational than a formal interview. The team appropriately looks to the candidate to talk through history and experience and present any questions. Their mission of helping developmentally and intellectually disabled individuals is contagious.", "Interview Questions": "Why do you want to work for Bethesda?"}, {"date": "9 Aug 2017", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AbleLight (New York, NY) in Jul 2017", "Interview Descriptions": "I was contacted by the Indeed Recruiter that they were using to help screen initial candidates. That was about a 30 min conversation she really liked my background sense I worked for a similar agency and she told me she would send my information over to the Regional HR person that covers the Illinois area. Fast forward to a week later , I reached out to her to see if she had heard anything and she followed up right away stating she was waiting to hear back from them as they had been in and out the office. Two days later she let me know that he was putting a schedule so we could interview over the phone the next week. I did the interview about three weeks and have not heard back which he told me I would hear by the next week if moving forward. I just took this as not moving forward since no response was received. It's not a role I was absolutely in love with as the commute was at least and hour and they were on the low end of the salary even for being non-profit. When I spoke with the Indeed Recruiter she told me the cap was about 55k and when I spoke with the Regional HR he said the salary was 48-52k. Still not ideal salary range for a HR Business Partner Role.", "Interview Questions": "Nothing out of the ordinary but wanted to know how you collaborate with Managers on employee relations issues such as performance and discipline."}, {"date": "13 Apr 2017", "title": "Lead Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at AbleLight (Sycamore, IL)", "Interview Descriptions": "Internal I filled out an application.I expressed my interest in the position. Waited to be contacted for an interview. I have a good relationship with my boss so I did feel uncomfortable", "Interview Questions": "How would you proforma as a lead"}, {"date": "4 Nov 2017", "title": "DSP Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at AbleLight (Cortland, IL) in Jan 2017", "Interview Descriptions": "if you show up and need a job, they are likely to take you. they will have a group interview where you meet with people that you would be working with", "Interview Questions": "what kind of hours "}, {"date": "6 Mar 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at AbleLight in Oct 2016", "Interview Descriptions": "The phone interview was very professional and thorough.  However, the face to face lacked substance because the manager was in a hurry due to other commitments.  On return for what I thought was a second interview turned out just to meet some of the individuals and staff.", "Interview Questions": "How have you ever advocated for another individual "}, {"date": "17 Jul 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AbleLight in Jul 2015", "Interview Descriptions": "Applied online, called within the week for an interview. The initial interview was over the phone & she asked some situational questions. She then gave me my time & place of interview. I went in for a interview but it was less of an interview & more of just going over what the job is & taking a TABE test to assess my reading abilities.", "Interview Questions": "Have you worked with individuals with disabilities before"}, {"date": "5 Jun 2017", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at AbleLight (Portland, OR) in Jun 2015", "Interview Descriptions": "First I had a phone interview which took about 30-45 minutes. Then I was brought in for a panel interview but was not told it was with 8 people.", "Interview Questions": "How many job requisitions have I worked on at one time?"}], [{"date": "6 Jul 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AbleLight (Fort Wayne, IN) in May 2014", "Interview Descriptions": "I was recommended the job by 2 friends who worked there.  Filled out the online application, and I think a few weeks later, I received a call from a program manager. We did some preliminary questions such as: If I am still interested, and what shifts I am comfortable with, and if I did get hired, there was a mandatory 1 week training before working at the group homes. They usually are once a month, so I had to wait after I finished my Spring semester of college to do it in May.  The manager was lenient and understanding, so he waited until my semester and we did a formal interview.  It was one on one, and he asked different questions and it only took about 30 minutes. And then he talked about the houses and shifts available. He even drove me to the group home I could be potentially be working at to meet the individuals. Afterward, he formally offered the position, and I accepted.", "Interview Questions": "The individuals are religious and most go to Church on Sundays. Are you comfortable going to church that may be from a different denomination?"}, {"date": "18 Jul 2016", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at AbleLight (Fort Wayne, IN) in Mar 2014", "Interview Descriptions": "The process was fast, easy and the director was as pleasant as can be! All the information about the job was explained and expectaions were clear.The whole process was only a day and the screening was very thorough. Training was a few days and made sure I was adequately prepared in medical knowledge I would need to be successful in this field.", "Interview Questions": "What would you do in case of a seziure?"}, {"date": "16 Mar 2014", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at AbleLight (Houston, TX) in Dec 2013", "Interview Descriptions": "Phone Interview and face to face interview", "Interview Questions": "What can you offer to our company?"}, {"date": "9 Apr 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AbleLight (Watertown, WI) in Aug 2013", "Interview Descriptions": "Very informative and friendly. Got to meet the clients I would be working with and get a read idea of what the work would be like. Watched a video about the job. Manager was very friendly and interview was only 15 minutes.", "Interview Questions": "Have you ever witnessed a person with a disability being spoken to inappropriately?"}, {"date": "29 Sept 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AbleLight (Victoria, MN) in Jul 2013", "Interview Descriptions": "Extensive online application, followed by a phone interview, in person interview, and the best part was interviewing with a person supported that receives services at the facility. A facility tour was given after speaking with several of the management team members.", "Interview Questions": "Describe a challenging experience you were able to overcome in a previous job?"}, {"date": "30 Jun 2015", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AbleLight (Fort Wayne, IN) in May 2013", "Interview Descriptions": "Got a one on one interview and than had to wait about a week to do the second. The second interview I went to a house where the individuals live to meet them. After that I was offered the job. Routine paperwork and than drug tests, background checks and what not. They put you through training and it is very easy and positive.", "Interview Questions": "What are your strengths?"}, {"date": "14 Jul 2017", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AbleLight (Portland, OR) in May 2013", "Interview Descriptions": "I was interviewed by a Program Manager and the interview process was efficient and professional. However HR was slow to respond back even though they were interested in hiring me, so I had to follow up with them to move things forward.", "Interview Questions": "How do you respond to criticism? "}, {"date": "19 Feb 2014", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AbleLight (Aurora, IL) in Mar 2013", "Interview Descriptions": "Candidates can expect 2-3 interviews before being hired.  Before working in a group home, employees go through an authoritative, multi-week training process covering all on the job duties as well as an On The Job Training workbook to be completed once in the home and signed off on by fellow employees so as to insure competency.", "Interview Questions": "During the initial phone interview candidates are asked how they would best implement Christ's message in their work due to this being a faith-based organization."}, {"date": "12 Sept 2016", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at AbleLight (Cleveland, OH) in Mar 2012", "Interview Descriptions": "The interview process was ok they told you what you needed to do for the job either you was go take it or not.They ask if you had any training for the position that I was being interviewed for. they made me feel comfprtable", "Interview Questions": "what are your greatest strengths"}, {"date": "1 Apr 2015", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AbleLight in May 2011", "Interview Descriptions": "Met with three people that just wanted to know if I could work evenings and weekends. They read a paper and then told me I was hired if I passed the background and drug test", "Interview Questions": "If someone missed their mother cooking what would you do?"}], [{"date": "6 May 2012", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at AbleLight (Portland, OR) in Apr 2011", "Interview Descriptions": "Employee referral, online application process, contacted by recruiter for a phone interview.  Then contacted to set up a one on one interview.  This interview had to be rescheduled a couple of times by Bethesda's management.  Then a panel interview consisting of persons who would be working with me and under my management.  A final interview with the area director who was filling in and covering for the fact that there was no current supervisor for the position I was interviewing for.  Finally there was a background check, fingerprints, drug test and a TB test.", "Interview Questions": "Describe a time when you've had to work with a difficult coworker."}]]