[[{"date": "3 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health", "Interview Descriptions": "Applied online and contacted by HR first within a few days. HR was able to coordinate interviews on a couple different units to occur on the same day. Whole process took a couple weeks.", "Interview Questions": "Why would you like to work here?"}, {"date": "6 Jun 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Renown Health (Reno, NV) in Jan 2023", "Interview Descriptions": "Easy, I liked how fast and easy the interview process was and they were nice and welcoming, it felt just right. I recommend this job to anyone and everyone, and they do not hesitate to help you with any questions or concerns you may have!", "Interview Questions": "Why would you fit perfect in this role?"}, {"date": "27 Nov 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Renown Health", "Interview Descriptions": "Great! Thorough and precise. It was fluent and easy to get through the questions with confidence. The multiple people throughout the panel made it interactive and fun which allowed for a great experience", "Interview Questions": "Dealing with conflict, how to and what happened?"}, {"date": "13 Sept 2022", "title": "Certified Clinical Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Renown Health (New York, NY) in Sept 2022", "Interview Descriptions": "Pretty standard phone screening. Asking previous experience, situations in which you helped an angry customer, what salary you expect, and what hours you're looking for. We all know that bus schedules have been a nightmare for working parents this year and cost of living is unaffordable, so getting kids to school safely is a priority. They were not willing to consider these real life circumstances that affect our community. There are other clinics which are much more reasonable, considerate, and human.", "Interview Questions": "What was an instance in which you helped an angry customer"}, {"date": "13 May 2022", "title": "Training Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Renown Health (Reno, NV)", "Interview Descriptions": "Initial was a pretty standard pre-screen with a recruiter. She reached out to me via email and asked to schedule a phone screen, but it took three additional email correspondances from me to get her to respond and schedule the actual phone screen. During the phone screen she informed me that the position was vacant because of lay-offs.  I appreciated her candor, but that made me concerned for the future potential of the position, especially with Renown in the news lately. Never the less we set up a virtual interview for the next week. \n\nThe interview was scheduled by email and took place via microsoft teams. The interview itself was - for lack of a better word - tribunal style. The entire training department was on the call 6-8 people. They rotated through asking me questions. They were also 30 minutes late to the interview, whether this was due to miscommunication or technical difficulties I am not sure. I am sure this was the exception not the rule - but taken with how difficult it was to get an interview to begin with by having to reach out multiple times to the recruiter - it definitely felt like I was never seriously considered for this position. \n\nAfter it became clear that they were not interested in me for the position (a few weeks after i interviewed and had not heard back, and they re-posted the position) I reached out to the recruiter and asked for feedback from my interview for future similiar interviews. They responded with \"Just not a good fit\" which is less than helpful. All in all not a great experience.", "Interview Questions": "Describe a time you had to develop training from start to finish. What was your process."}, {"date": "24 Dec 2021", "title": "Rehabilitation Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at Renown Health (Reno, NV) in Dec 2021", "Interview Descriptions": "It was a rather long panel interview. Lots of ethical and situational questions to gauge your experience working in an inpatient setting. Interviewers were nice, but it took more effort than usual interviews since they took turns asking questions back to back. Interview was done via video call and took approximately half an hour.", "Interview Questions": "Tell me about yourself. Why do you want this position? Name 3 strengths/weaknesses. What if a patient asked you for water? What would you do if a patient asked you for information regarding their treatment? Name a time when you had to use teamwork and creativity to reach a goal. How do you manage your time? Are you an introvert or extrovert and why?"}, {"date": "31 Dec 2021", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Renown Health in Dec 2021", "Interview Descriptions": "First, there is a video interview where your asked to answer a set of questions. Then you're contacted by a recruiter to have virtual interview with team about the position.", "Interview Questions": "Why do you want to work for Renown?"}, {"date": "27 Oct 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Renown Health (Reno, NV) in Nov 2021", "Interview Descriptions": "Met with the department director and nurse educators for various ER locations, and asked about 6 questions in total. Mostly behavioral interview questions, the interview took about thirty minutes and there was a real emphasis on ensuring that the interviewee was committed to staying in Reno and at Renown long term.", "Interview Questions": "Tell me about yourself and your professional experience."}, {"date": "5 Mar 2021", "title": "Patient Safety Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health in Mar 2021", "Interview Descriptions": "Renown will send you an email with an invitation for an initial interview. You will have 5 days to complete it but you must accept the invitation early into the 5 days.  Initial interview is pre-recorded. Followed up by a phone call from a recruiter. Second interview is live but still virtual.", "Interview Questions": "Why are you interested in working for renown?"}, {"date": "22 Feb 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Renown Health", "Interview Descriptions": "For the interview process, I met the manager on skype. They asked general questions about myself and about how I would handle the expectations of the position. Everyone was very nice", "Interview Questions": "Tell me more about you future goals?"}], [{"date": "16 Jun 2021", "title": "Doctoral Level Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Renown Health (Reno, NV) in Feb 2021", "Interview Descriptions": "Applied online. Emailed to follow up on application and got a response after a few weeks. Had a 30 min virtual video screen with recruiter. Was sent a link for a personality test. Then a 30 min virtual interview with department managers. Final step was ~4hr on-site interview with team and upper management. \r\n\r\nHR took a while to get back to me after each step and I had to follow up multiple times about the status of my application. They seemed disorganized. Almost all the interviews were very informal, and some interviewers on-site were so informal to the point of making inappropriate comments. \r\n\r\nHR made it seem like I was going to get an offer after the site visit and asked for references. They said I would hear by end of week. Heard nothing and I followed up the next week to be told I wasn't getting an offer. At the time I was bummed but now after accepting a position elsewhere it seems like I dodged a bullet.", "Interview Questions": "What populations would you want to work with if hired?"}, {"date": "2 Jan 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health", "Interview Descriptions": "The interview process was fairly easy but be prepared for it to take a while. I applied for the apprenticeship program and since applying to the job offer, it took about two months. After doing a video interview where you had to talk about certain subjects, then came the actual video interview with the supervisors. My only con of this process was actually speaking to the supervisors. They were awkward and just made me feel an uncomfortable vibe. After that it took about two weeks for the offer.", "Interview Questions": "What are your greatest weaknesses, What are your strengths, What is your 5 year plan."}, {"date": "4 Dec 2020", "title": "New Graduate RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Renown Health", "Interview Descriptions": "A Recruiter emailed me to set up a phone call, next day we talked and then she set up a time for me to interview with some units hiring new graduates.", "Interview Questions": "Tell me about yourself, tell me about your education, why Renown? "}, {"date": "30 Nov 2020", "title": "Inventory Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Renown Health", "Interview Descriptions": "Very basic questions. If you show that you are very interested and determined, then that gets you in. They like to hear \"initiative\" and \"organization\". I got a call for an interview and it was a panel interview. They were very nice but had expected questions", "Interview Questions": "What are your strengths and weaknesses?\nWhat do you do now that is similar to the job expectations?\nWhy do you want to work for Renown?"}, {"date": "10 Nov 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renown Health (Reno, NV) in Oct 2020", "Interview Descriptions": "Positive & inquisitive. Questions were heavily culture based with some light/moderate clinical questions.   It was clear that the recruiter read my application, resume and cover letter - she was highly professional and very friendly. The interview was comfortable and made it easy to be myself.", "Interview Questions": "Tell me why you chose to relocate to Reno "}, {"date": "12 Nov 2020", "title": "Staff Cytotechnologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Oct 2020", "Interview Descriptions": "Got asked for the traditional interview questions and as we go further we talked more about cytology. Such as GYN or NON-GYN volumes, quality control, CT - MD relationship, etc.", "Interview Questions": "How do you organize your work?\n\nWhat kind of priority do you set for the cytology works?\n\n"}, {"date": "22 Nov 2022", "title": "Trauma Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renown Health in Sept 2020", "Interview Descriptions": "Video interview which was recorded and then a video interview. I received a phone call a few days later with an offer from the department head. I negotiated with the recruiter for my salary.", "Interview Questions": "What is your experience in this field?"}, {"date": "19 Sept 2022", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Renown Health (Reno, NV) in Sept 2020", "Interview Descriptions": "Quick, easy, painless.  Tell the recruiters what kind of work you want to do and they'll find an area somewhere within Renown that fits what you're looking for.  Healthcare is growing, this is a great time to get a part of it.\nThey need the help and they'll guide you through the interview process before you interview.  Their recruiters are amazing.  ", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "15 Aug 2020", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Renown Health", "Interview Descriptions": "You are contacted first by a recruiter and screened for qualifications. I was invited to interview for the position.  Right now with COVID interviews are held virtually. Depending on the department you will interview right away or be sent a link to record yourself answering a series of questions. I did both for different departments.", "Interview Questions": "Describe a time you had differing opinions from a coworker. How did you handle it and what was the outcome?"}, {"date": "30 Jul 2020", "title": "Scheduler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health in Jul 2020", "Interview Descriptions": "Submit a Video interview and it was followed up with a phone call and a few questions.  Second interview scheduled. Spoke to a recruiter on the second call.  Panel interview scheduled two weeks later.", "Interview Questions": "Basic questions, experience with patients"}], [{"date": "31 Oct 2020", "title": "HIM Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Mar 2020", "Interview Descriptions": "Not very detailed in some of the questions that were asked.. I am just trying to get access to read more information about other companies. This is sort of ridiculous.", "Interview Questions": "If you were able to handle multiple situations which could be difficult."}, {"date": "20 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in Feb 2020", "Interview Descriptions": "The interview process went well.  There were a few scenario questions.  There were about 4 people in the interview.  There was a phone interview prior to the in person interview.  The phone interview was more of a screening process to ensure I had the minimum requirements.", "Interview Questions": "What are your 5-year goals?"}, {"date": "9 Mar 2020", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Renown Health in Feb 2020", "Interview Descriptions": "I got my externship there. So the interview process was mock interviews. Then you interview with any of the department leads that have opportunity. Then once hired you go though physicals and get vaccinated.", "Interview Questions": "What made me go into the field?"}, {"date": "22 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health", "Interview Descriptions": "I applied online. After 2 weeks I received a call from a recruiter. The recruiter asked me questions about myself, education and nursing experience. Then I was given a schedule for a panel interview. Four nurse unit manager interviewed me and questions were fine. Then the day after panel interview, I received a job offer.", "Interview Questions": "Why renown? Describe yourself? Describe how you handled a difficult situation in your nursing practice."}, {"date": "15 Dec 2019", "title": "Postpartum Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renown Health (Reno, NV) in Oct 2019", "Interview Descriptions": "A requiter e-mailed me to set up a time to talk, once our phone call started--a few days later--it was about 30 minutes of her getting to know me to pass info on to departments. A week or so later a nurse manager called me to set up an interview for the postpartum department. After I went in for my interview I did not hear back from anyone for over a week, never a good sign, so I reached out to the requiter. She said she would speak to the manager and let me know. A few days later I got an email that I did not get the job. I wish the nurse manager could have called me so I could have received feedback on my interview. Was it my skills, my personality, or something else that made them chose a different nurse? I will never know.", "Interview Questions": "Describe a time when you went above and beyond for a patient."}, {"date": "20 Dec 2019", "title": "Contact Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in Sept 2019", "Interview Descriptions": "Interview included multiple supervisors which was a bit intimidating, but once they explained why it made sense.  Although, I did enjoy speaking with all of them.  The girl that reach out to me about the interview was very nice and she let me know what to expect before I even arrived.  She also responded to after interview questions that I didn't think of at the time.", "Interview Questions": "I don't remember the questions specifically, but I do like that they were specific to the position I was applying for, instead of general questions that all employers ask.  "}, {"date": "21 Apr 2020", "title": "Armed Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renown Health (Reno, NV) in Aug 2019", "Interview Descriptions": "It was a panel interview that had many different titles so that the questions came from different perspectives to hire the right staff.  It was tough because it opened your eyes on how some people see security or the job it self.", "Interview Questions": "How I think i would respond if i had to take someones life to protect another. "}, {"date": "29 Jul 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renown Health (Reno, NV)", "Interview Descriptions": "A few days after applying on the Renown website, I received an email from an HR recruiter to set up a phone screening.  During the phone screen she asked basic questions such as \"Tell me about yourself\" and \"Why do you want to work at Renown\".  She was very personable, easy to talk to.  After about 15 minutes, she scheduled a panel interview for the following week.  The panel interview had 3 managers of the department I was applying for.  I was very nervous but upon arrival I was put at ease by the easy-going personalities in the room.  Probably one of the most easiest and friendliest interviews I've ever had.", "Interview Questions": "Can you describe a time when you had to work with a difficult co-worker, how did you handle it, and what was the outcome?"}, {"date": "6 Mar 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health", "Interview Descriptions": "There is usually 3 people from 3 different departments. They take turns asking you question about how you would handle certain scenarios. They also ask what are your career goals.", "Interview Questions": "How do you resolve conflicts with coworkers?"}, {"date": "25 Jan 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Renown Health (Reno, NV)", "Interview Descriptions": "There were many scenario based questions. They test your ability to think critically and they want to make a genuine effort to get to know your style. Your personality is reviewed in depth so they can see if you will be a match to the job.", "Interview Questions": "Name one time you worked with a difficult employee and what do you do to overcome that challenge?"}], [{"date": "14 Nov 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health", "Interview Descriptions": "Short, 15 minutes with a panel of managers and nurses. Asked 4 questions, had printed out my resume and had it in front of the. Wrote notes while I talked.", "Interview Questions": "Q: When was a time you were in customer service?"}, {"date": "30 Oct 2018", "title": "Training Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Renown Health", "Interview Descriptions": "Met with the recruiter over coffee. Was set up with an interview via email and was interviewed by a panel of 4 leaders with varying roles from Nursing to Organizational Development.", "Interview Questions": "What would your previous supervisor say about you?"}, {"date": "8 Mar 2018", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Mar 2018", "Interview Descriptions": "The interview was excellent, very professional all the interview, they asked about myName, work and occupation , schedule, chimicals and they asked about  if you work to clean blood , pumping urine flu, bacterium.", "Interview Questions": "Chemicals"}, {"date": "31 Oct 2017", "title": "Environmental Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Renown Health", "Interview Descriptions": "Just writing the review for Job Seekers because feel the need to share a phone call experience about a recruiter at Renown Health.  The unpleasant conversation raises many concerns about mistreatment of employees, overworked long hours, and cheap pay.  \r\n\r\nBeware of cheap pay, mistreatment, and verbal abuse.  The Epic Environmental Engineer position has been posted for over 7+ months.  Qualified candidate spoke with recruiter, on the phone and there was aggression, berating, and combative arguments.  Red flag,  the job has been open for a long time and can suspect the issue is with the  organization and not the candidate?\r\n\r\nFirst time ever hearing a recruiter threatening and demanding a candidate force a verbal statement swearing to God to work cheap pay as permanent status employee and committing at least 3, 5, 10+ years at Renown Health.  Wouldn't a hospital want happy employees that are well paid to willingly continue to work for the hospital on their own free will?  Nobody can predict the future, health or longevity of life therefore cannot make that slave statement.  No one is at fault for unforeseen events like being sick, or having an emergency.  Is it fair for the recruiter to yell at a candidate because the recruiter predicts the candidate will quit?  Does the organization have a history of employees being hired and quitting shortly afterwards leading to high turn-over rates?  Do FTE permanent employees at this organization agree to slave labor contracts, working numerous years at 50-70 hours a week, cheap salary with unpaid overtime?\r\n\r\nAlso disturbing to hear a recruiter call a candidate names like being a liar, desperate, irresponsible and never wanting to grow up for working as a consultant in past employment history.  Why would someone  lie about being open to considering a permanent role with the organization?  How does applying for a job that was open for many months ago give the recruiter permission to call the candidate desperate? Since when did earning a living as a consultant become irresponsible?  Does it matter if a person obtained work experience doing environment strategy as a consultant versus working as FTE doing the same environment strategy?  Point is the candidate has relevant work experience, knowledge, and skills to qualify for the job.  Shouldn't job skills matter more than past income and job status as a consultant?\r\n\r\nWhy is the recruiter focused on talking about money and being jealous of the larger consultant pay?  Candidate is offering to discuss project timelines, expectations, and goals.  Yet those ideas are rudely ignored.  Candidate is willing to consider working, taking a pay cut to work and help the organization.  The recruiter at Renown Health quoted a salary number which is about 60-70% less than the market rate of what a consultant makes.  Candidate offered to help, willing to work on a solution with the organization because truly likes the job, has done it before, and helping the hospital benefits the local community.  The recruiter denied the candidate a chance to explain how to contribute and work together.\r\n\r\nRenown Health doesn’t want any help or to fill this Epic Environmental Engineer position.  Don't apply for jobs here, they can't afford to pay new hire employees fairly or competitively in the job market, and there is no care or compassion towards people.", "Interview Questions": "No questions were asked.   Many baseless assumptions and insults were made by the recruiter."}, {"date": "30 Nov 2017", "title": "Organizational Development Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Renown Health (Reno, NV) in Nov 2017", "Interview Descriptions": "I applied online. I was contacted by a recruiter who walked me through the process. The call was pretty short with most of it being time for me to ask questions. The recruiter quickly set up another phone interview with the manager for the position.  Before that I had to take a McQuaig word association test.  What I assumed would be an actual interview with the hiring manager was really another quick phone screen. Third interview was with panel over skype, had some technical issues (my end) so it ended up being over the phone.  The panel included the team (without the manager) and the recruiter. \r\n\r\nMy final interview was not great, based on the first two being super quick and just mostly an opportunity for me to ask questions I wasn't expecting much and didn't fully prepare so that was my bad. The only frustration with the process is that I felt the recruiter had been really great at communicating the process and next steps until I was apparently no longer under consideration. It was just kind of a bummer because regardless of the outcome I felt like I was having a good experience with a process until the end.", "Interview Questions": "What do you know about Renown?\r\nTalk us through a training you put together?\r\nWhat are the elements for an effective training?"}, {"date": "16 Nov 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renown Health (Reno, NV) in Nov 2017", "Interview Descriptions": "Was contacted by email to set up a phone interview. Phone interview was about 20 minutes. Was then set up for a panel interview which lasted about 30 minutes. Was contacted in a week and was hired.", "Interview Questions": "Name 3 commonly prescribed medications."}, {"date": "23 Oct 2017", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Renown Health", "Interview Descriptions": "Was offered a job and moved from out of state. When I arrived they rescinded the offer. They said it was due to a positive drug Screen but that was impossible. Was not given option to retest.", "Interview Questions": "Do you know HCC coding?"}, {"date": "1 Aug 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health", "Interview Descriptions": "The I nterview process was very simple. I was called in for an interview at the location I'd be working at. It was a panel interview, but not intimidating. I was contacted a week later with an offer.", "Interview Questions": "Name a flaw you have?"}, {"date": "15 May 2017", "title": "Management Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Renown Health", "Interview Descriptions": "I have interviewed twice at Renown and in both experiences I was shocked at how unprofessional and rude the HR employees were. I was offered a position but declined because of the environment HR presented.", "Interview Questions": "Questions were very generic interview questions"}, {"date": "6 Dec 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in Apr 2017", "Interview Descriptions": "Phone interview then panel interview. Initially applied for a different position then over the phone discussed a going for a different position. Was not given much information on the new position. The interview seemed a little political and not in the field I had initially applied for at all.  Never received a response after the panel interview.", "Interview Questions": "How do you handle conflict?"}], [{"date": "18 Sept 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Apr 2017", "Interview Descriptions": "Most is over the phone and when you have your interview in person they make you wait 1 hour after your interview time to interview  you. It is a group of 4-8 people interviewing you for so many different floors at once", "Interview Questions": "What is your long term goal"}, {"date": "17 Jan 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at Renown Health in Feb 2017", "Interview Descriptions": "It was ok . The interviwer was great. Asked a lot of questions  it was kind of intense but would have it any other way. It was an awesome experience", "Interview Questions": "N/A"}, {"date": "20 Dec 2016", "title": "Critical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Renown Health", "Interview Descriptions": "Fist I met with a recruiter 1:1. They asked questions like How do you work in a team? What's the most important thing to keep in mind when working with others who you might not get along with? Etc. .The Management of the unit I applied for was there, supervisor, and CCT. It was on the unit, they asked 10 pre-written questions. They were very basic/scripted. Essentially wanted to know what a persons moral character is.", "Interview Questions": "What three words describe you?"}, {"date": "29 Jan 2017", "title": "Anonymous Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Dec 2016", "Interview Descriptions": "Applied online. A week later, received a response from recruiter via email to schedule a phone interview. After two phone interviews (one with my recruiter and one with the department), was invited for an onsite interview.", "Interview Questions": "Why Renown?"}, {"date": "24 Jul 2019", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Aug 2016", "Interview Descriptions": "Panel review with direct supervisor and colleagues. Pretty straightforward, with standard interview questions. Questions included personal, cultural, technical, and background information. \r\n\r\nThis was my first panel interview. I was not told it would be a panel. It was awkward at first, but I hit a roll when I started answering the person who asked the question directly, and made it more conversational than question/answer.", "Interview Questions": "How do you decide what to do when there are competing priorities?"}, {"date": "7 Dec 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Renown Health (Reno, NV) in Jul 2016", "Interview Descriptions": "2 hour long interviews with direct peers and key leadership throughout organization.  Interview required a presentation based on a previously shared scenario that was followed by key questions about the scale and scope of the program being presented.  The interview focused on two domains, technological skill pertaining to program management and development, and communication skills for interactions with key stakeholders from across the organization.", "Interview Questions": "What motivates you to do your best work each and every day?"}, {"date": "12 Oct 2016", "title": "Senior Data Architect Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Renown Health (Reno, NV) in Jun 2016", "Interview Descriptions": "I got a phone call from a recruiter and was told about he position. I then set up an appointment for the interview for the next week. The interview consisted of myself and about 8-10 Renown employees. No technical problem solving questions were asked. I asked some high level questions about their current infrastructure and techniques but received very broad/general answers. I don't think anyone had a traditional computer science background. Also it seems like people in the health industry(including here) love to mention the \"cloud\" and \"data <insert water source here>\", like data lake, data pond and thanks to Renown I now know that data glaciers exist!", "Interview Questions": "Do I think moving to the cloud is worth it?"}, {"date": "1 Mar 2018", "title": "Service Excellence Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Jun 2016", "Interview Descriptions": "very professional with 8 people interviewing. Was already working as a cna when applied for this position.  When it became available, I applied as soon as I found out about it.", "Interview Questions": "Why I wanted to be in this position"}, {"date": "6 Apr 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in Mar 2016", "Interview Descriptions": "Very easy and quick. HR Staff are also very pleasant. I was treated very well and assisted in getting the information I needed for the interviews as well as the new hire process.", "Interview Questions": "What my future goals are."}, {"date": "6 Mar 2018", "title": "Compliance Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in Feb 2016", "Interview Descriptions": "the interview process consisted of a panel interview where each member of the panel asks you a few questions as it pertains to the role in which you are applying and how you may support their role in the organization. Always come prepared to answer situational questions.", "Interview Questions": "How would you change the way the organization runs currently? "}], [{"date": "24 May 2016", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Renown Health in Jan 2016", "Interview Descriptions": "Did a phone interview with HR, then Supv, then manager. Brought in for a face to face interview with Manager, then another one with a panel for the team. Once interviewed with the team, then waited about 2 weeks before I received an offer. Interview with the team was awkward, as it seemed more of a gossip club.", "Interview Questions": "Tell us about the worst boss you ahd."}, {"date": "5 Oct 2015", "title": "H I M Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Renown Health (Reno, NV)", "Interview Descriptions": "First phone call was from HR recruiter who gave basics of job, including salary (without me asking, which is nice that they were so up-front right away). Recruiter then arranged interview time with department supervisors. I had applied online for one job in the department, but was told by the recruiter that there were others open in the same department that I might be interested in, as well. This was good to know as one of the jobs had not even been posted yet.", "Interview Questions": "I was asked to elaborate on duties of past jobs, what I liked and disliked about each. Asked how I prefer to work (in a group or separately, etc.), asked how I transitioned from one job to another in a previous company. The interviewers (3) were very well prepared for me, had all actually read my resume and had a copy with them with notes/highlights about what they wanted me to elaborate on. We sat in a separate room with no distractions. All three were very pleasant and did not try to rush through the interview."}, {"date": "7 Aug 2015", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Renown Health (Reno, NV) in Aug 2015", "Interview Descriptions": "It was fairly easy. However, they were super rude and unprofessional. They seemed very unorganized and it didn't appeal to me to work for them. The interview was over within 15 minutes. The front receptionist was equally as rude and liked to talk to her phone while it was ringing as if she was very mad at people for calling her.", "Interview Questions": "What overwhelms you, how would you fit in with this job, what do you currently do"}, {"date": "13 Nov 2015", "title": "Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Renown Health (Reno, NV) in Aug 2015", "Interview Descriptions": "I walked into the interview with 3 people present. After all the pleasantries were out of the way, they started with questions. All of them asked several questions. The interview was finished in 10 minutes. It felt very rushed. Even though I did read the job description, it would have been nice for them to give me an introduction to their company and go over the key goals for the position. I asked questions afterwards but they didn't really have straight answers. I felt that they didn't want to really do the interview or that they had their minds made up before I walked in. I don't think i'll be applying in the future to this company.", "Interview Questions": "Would you describe a few situations in which your work was criticized? "}, {"date": "6 Jul 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Renown Health (Reno, NV) in Jun 2015", "Interview Descriptions": "Unorganized, panel style.  HR business partner was late and then excused herself early.\r\nInstitution uses McQuaig survey process, but lacks ability to understand data reported.  Behavioral questions should have been derived from the survey, however, most questions were randomly asked and commonly consisted of previous employment examples of work and projects.  Few people had stopped by interview asked a few questions then left, which made it difficult to know who was running the interview and who was only there as a support person.", "Interview Questions": "Have you had to work with difficult to get along with coworkers and what types of things have you tried to get along?"}, {"date": "9 Jul 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in May 2015", "Interview Descriptions": "They had a recruiter call who asked several on the spot questions. She then made it sound like I had the position.  Unfortunately they ran me around in circles and then send they were going in a different direction.", "Interview Questions": "Why do you want to work at Renown?"}, {"date": "5 Jun 2015", "title": "Patient Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Renown Health (Reno, NV) in Nov 2014", "Interview Descriptions": "Interviewed by three people about my resolve problem solving e.c. Kinda felt put on the spot because three people were there interviewing me but it ended well. At the end i made sure to thank everyone for there time and everything. They may be a little late to call you but don't be late yourself be prompt and dress well even though it is an entry level job.", "Interview Questions": "How have you dealt with an unhappy customer"}, {"date": "5 Apr 2017", "title": "Physical Therapist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Renown Health (Reno, NV) in Oct 2014", "Interview Descriptions": "Contacted HR about openings, Hr recruiter walked me through the process, of background check, drug screen and presentation of my resume and credentials and notified me as soon as they had an offer.", "Interview Questions": "How do you handle stressful situations"}, {"date": "2 Aug 2014", "title": "Mid Level Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Renown Health (Reno, NV)", "Interview Descriptions": "I was referred by an employee. The interview process consisted of a panel interview consisting of eight job peers, followed by a 2 on 1 lunch at the facility cafe with managers. An offer was extended by phone later that afternoon.", "Interview Questions": "What do you see as the most difficult challenge facing medical center human resources today?"}, {"date": "15 Jun 2014", "title": "Clinical Engineer Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Renown Health (Reno, NV) in May 2014", "Interview Descriptions": "Initial contact was made to my college instructor by Renown so the job could be posted to the jobs website hosted by the college. My first contact was by phone followed by an e-mail. A couple of weeks later I was contacted to be flown out to Reno for an interview. \r\nThe department manager gave me a tour of the hospital and then we sat down with the manager of OR and the engineering manager for an hour long interview.", "Interview Questions": "How do you handle it when people are yelling at you? Do you get frustrated?"}], [{"date": "15 Sept 2015", "title": "Nutritional Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Renown Health (Reno, NV) in Dec 2013", "Interview Descriptions": "Recruiter reaches out to you\r\nInterview with Department Heads \r\nVery disappointed with the job description as they informed me that I would basically have no room for career growth. This job was close to something I wanted to pursue with my degree, but I decided to go a different route.", "Interview Questions": "Name a time when you dealt with diversity?"}, {"date": "6 Oct 2015", "title": "Supervisor of Nursing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Renown Health (Reno, NV) in Oct 2013", "Interview Descriptions": "They usually interview with multiple people/group panel, you should have a human resource person there with you as well. There were various managers and supervisors from different areas of the department there...maybe about 10 of them. It was rather intimidating. Do NOT be late to your interview...tardiness by even one minute will reflect poorly here.  Give yourself enough time to park and walk through the campus as it is very large and parking can sometimes be difficult. \r\n\r\nIt was rather distracting when one of the interviewers continued to look up at the clock every other minute.  She seemed totally disinterested in what I was saying and I could tell she didn't even  bother to review or look at my resume ahead of time. Many of the questions she asked were answered in the resume, but I answered them anyway. Even some of her colleagues answered her questions for me in unison because they had obviously looked at my resume - she started to look very incompetent.  That should have been a clue I should have taken into consideration before I took the job.", "Interview Questions": "How many people have you supervised?  How many years have you worked as a supervisor?"}, {"date": "23 Oct 2017", "title": "Clinical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Renown Health (Reno, NV) in Oct 2013", "Interview Descriptions": "Panel interview from the entire group.  The director, manager from all area came in to talk but didn't make it sound like an interview.  It was more of a luncheon.", "Interview Questions": "Why should we hire you?  Why do you think you will fit in our group?  "}, {"date": "23 Oct 2017", "title": "Documnt Contol Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Renown Health (Reno, NV) in Sept 2013", "Interview Descriptions": "One interview with several employees including team members I would be working with and one supervisor. The interview was held in a small office and the overall setting was relaxing.", "Interview Questions": "Questions included: What are you strengths? weaknesses? Have you ever been in a difficult situation in the past and how did you handle it? Where do you see yourself in 5 years?"}, {"date": "15 Feb 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Renown Health (Reno, NV) in Jun 2013", "Interview Descriptions": "Tried for years to get in. Applied for many positions. Finally one day the recruiter answerd my call. He said he had never seen my application. He asked a few questions. What experience do you have?, Why Renown?, Basic questions like that. He said come in for a sit down interview with me. At the interview he was super nice, made me feel at ease. Questions were basic, standard questions. He kept in touch with me every week with potential positions that I qualified for untill I finally got a call for a second interview with a department. Supervisor, manager and ,CNA were there. Very nice ladies, friendly, and questions were standard. Got the job a week later.", "Interview Questions": "What made you chose renown? What do you do when working with a co-worker you dislike? How do you handle a situation you can't solve? "}, {"date": "23 Oct 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Renown Health (Reno, NV) in May 2013", "Interview Descriptions": "Not great. This was the most negative aspect of anything I have experienced with Renown. I was practically shut out of Renown due to the Online Profile Tool you have to go through prior to meeting anyone on the phone or otherwise. The HR department was totally inaccessible during the online application process.  \r\nI applied for every entry level position I was qualified  or overqualified for and other positions I felt legitimately qualified for. Maybe 10 or more applications later I only managed to breakthrough the HR wall by getting referred finally by a manager who knew of me.\r\n\r\nIn one applications process for a position for Project Manager, a job I had done for 27 years in another industry, I had a very nice phone interview but when I got to the  face to face interview is was awful. I prepped and dressed and got there early only to be seen by two interviewers one of who was slumped in her chair wearing an old sweater and  saying through her body language \"we've already hired someone but HR is making us interview you. How soon can we get this over with\" It was a bummer. \r\n\r\nI don't know what to say, but I hope this is not others' experience.  Sorry HR.", "Interview Questions": "N/A"}, {"date": "8 Aug 2013", "title": "Respiratory Care Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Renown Health (Reno, NV) in Feb 2013", "Interview Descriptions": "Initial interview can be conducted via telephone to accommodate out of towners. Initial was with a HR Rep who was very personable, easy to talk to,  responsive, punctual, and helpful.\r\nCompany paid for travel costs for second interview which was conducted by a panel of several department managers in an intimate conference room. They all had great energy and smiles, making the process alot less nerve racking than I had expected this type of interview to be. In less than two weeks HR called with a job offer, scheduled orientation date and accompanying medical clearances. Relocation costs were not paid like interview travel costs were.  Initial orientation is conducted with a large group of new employees from all departments and lasts two 8 hour days. This was followed by a month long period of shadowing current employees within your department.  Everyone was awesome all throughout the entire process.  Probation period is 90 days and ends with an evaluation to provide you valuable objective and subjective feedback regarding how you are doing.", "Interview Questions": "Asked to describe a ventilator mode which was manufacturer specific."}, {"date": "30 May 2013", "title": "HR-Benefits Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Renown Health (Reno, NV) in Dec 2012", "Interview Descriptions": "I had a phone interview with a recruiter, then a phone interview with hiring manager, a personality assessment test and then there was a panel interview with six people. The first two interviews brushed on qualifications and the panel was mostly behavioral questions. An offer came shortly after the panel interview.", "Interview Questions": "What don't you know? "}, {"date": "2 Oct 2012", "title": "Customer Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Renown Health (Reno, NV) in Sept 2012", "Interview Descriptions": "I got a call Monday the 24th for a phone interview. Basic questions such as why would you like to work for renown? are you a people person? Describe a customer service experience? and so on. I did great and was then scheduled for an interview for Friday the 28th. Unfortunately I was 5 min late but I was able to smooth things out throughout the interview. I sat down with three woman. All very nice. They explained the position and asked me to tell them about myself. I kept it short and sweet. Then each lady asked different questions. Im currently employed so they asked why i wanna leave my position. Do I get along with my coworkers. How would I describe myself. Overall, interview went great. I was offered the position Oct 1st and gladly accepted. I was then sent an offer email, position disc, and new hire paperwork link. I go for my drug test and physical on the 23rd. (must be scheduled 2 weeks before orientation). I start Nov 5th. I start later due to the notice I had to give at my current job.", "Interview Questions": "none. They were all fairly simple."}, {"date": "2 Jun 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Renown Health (Reno, NV) in Mar 2012", "Interview Descriptions": "it was a great interview. I have not complains. They were professional and prepared. welcoming, great people.\r\nEnjoy the opportunity to meet with them and discuss how my experiences can contribute to your organization and the nursing services.  \r\nEnclosed a copy of my resume with cover letter elaborating on my clinical experiences, educational backgrounds, certifications and organizational memberships", "Interview Questions": "Opportunity to grow.  nursing leadder, support further education. education reimbursement?d"}], [{"date": "26 Dec 2012", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Renown Health (Reno, NV) in Aug 2011", "Interview Descriptions": "Initial contact with recruiter, asked to take an on line behavioral assessment, invited for in person interview, then interview with hiring manager, then a panel interview and then a meet and greet.  A long and somewhat cumbersome process.", "Interview Questions": "Pretty typical behavioral questions, tell me about a coworker that may have had a difficult or different personality - how did you handle it?"}, {"date": "2 Oct 2015", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Renown Health (Annapolis, MD) in Jan 2011", "Interview Descriptions": "Two interviews. Easy questions as they didn't know much about social work. They asked about my professional experiences. They also asked about how I work with a diverse population. They also asked about how I feel around blood.", "Interview Questions": "Why was I a social worker"}]]