[[{"date": "23 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Brookwood Medical Center (Birmingham, AL)", "Interview Descriptions": "Interview was quick and straight to the point. One of the easiest I’ve been on. It was for a psychiatric position so it was primarily managing behaviors and dealing with difficult coworkers/doctors", "Interview Questions": "How would you handle a conflict with another co-worker"}, {"date": "15 Aug 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Brookwood Medical Center (Birmingham, AL) in Nov 2017", "Interview Descriptions": "2 manager will interview you.  and 4 RNs in the units will interview later , HR will call within 2  to 5 days and email the Offer. and will tell you the date of orientations.", "Interview Questions": "what is your career plan in the future? "}, {"date": "6 Apr 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brookwood Medical Center", "Interview Descriptions": "Long process. Had an interview with a math test in June and didn't hear back that I had the job until the end of August. The hiring process takes an extremely long time.  Good thing is, they are always looking for more technicians since it is a revolving door. A lot of the techs leave to higher paying jobs.", "Interview Questions": "What experience do you have?"}, {"date": "27 Jun 2016", "title": "X-ray Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Brookwood Medical Center (Birmingham, AL)", "Interview Descriptions": "The interviewer was nice enough but  he kept talking about inside company lingo I did not understand.  He ask me great questions regarding different seneros. Every answer I gave was immediately followed by negatively.  He did show me around & was very informative. The staff wasn't very friendly but the head tech showed me around.", "Interview Questions": "Why are you looking for another job?"}, {"date": "5 Nov 2015", "title": "Security Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Brookwood Medical Center (Birmingham, AL) in Sept 2015", "Interview Descriptions": "Short, sweet and to the point. The supervisor of the officers asked me a few questions as well as the C.E.O. I felt comfortable and they neither penalized me for answering a question a certain way as they were all either opinionated or give past occurances in specific working/ real life situations. They all were very welcoming and actually enjoyed the interview.", "Interview Questions": "You know you might end up having to cut your hair to work here don't you?"}, {"date": "21 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Brookwood Medical Center", "Interview Descriptions": "The interview was very laid back and easy-going. I had to interview with a team of nurses. There weren't too many questions and I received a call from HR within the week. The overall process took about three months. I was lucky to have had an inside referral. The old saying, \"It's not what you know, but who you know\" definitely applies.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "13 Apr 2017", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Brookwood Medical Center (Birmingham, AL) in Jul 2014", "Interview Descriptions": "Face to face with director, manager, and another mental health associate. Interview included experience questions, how to deal with potential violent escalations, and inappropriate situations with co-workers towards clients. Also how good are your documentation skills is a question they asked!", "Interview Questions": "Experience with difficult clients, & staff."}, {"date": "12 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Brookwood Medical Center (Birmingham, AL) in Jun 2014", "Interview Descriptions": "General interview questions. Opportunities for tours of the hospital or you desired location. Peer interviews are used here. Great opportunity to meet some of the people you may be working with. Nothing was unexpected.", "Interview Questions": "Why do you want to work herr"}, {"date": "24 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Brookwood Medical Center (Birmingham, AL) in Jan 2014", "Interview Descriptions": "New grad program was required for 30 days and then preceptor training was suppose to be provided for 30 days or more to teach me about the facility and nursing techniques.", "Interview Questions": "Stay on with teachings under a preceptor"}, {"date": "2 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Brookwood Medical Center (Birmingham, AL) in Jun 2013", "Interview Descriptions": "I first applied on line. Someone in HR called me back and got the ball rolling. I had a meeting with the director for a one on one interview. Came back for a second interview with others on staff. The whole process took several weeks. The second interview was really informative to me because I got to watch how the other employees were together, ask them questions and listen to them. I got to see if I would fit in with them and they also asked questions to see if I was a fit for them.", "Interview Questions": "How I would handle certain challenges during a shift. ."}], [{"date": "14 Aug 2016", "title": "MHA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Brookwood Medical Center (Birmingham, AL) in Jan 2012", "Interview Descriptions": "Go into a separate room and are asked several situational questions. The questions ranged from what would you do if someone were stealing, to how would you respond to a patient who was rowdy. Just give textbook answers.", "Interview Questions": "What would you do if you saw another employee taking drugs."}, {"date": "3 Oct 2015", "title": "Department Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Brookwood Medical Center (Birmingham, AL) in Jan 2011", "Interview Descriptions": "The panel interview involved 5-6 department leaders and previous manager. The previous  retiring manager decided and was allowed to stay on as part-time help. The panel asked a series of behavior questions. I asked questions about department structures and what I could do to support their teams. The invitation for department leaders' feedback was a winner. I interviewed on Monday. They made the offer on Friday.", "Interview Questions": "Tell me about a difficult decision you had to make for the department. How did you determine your decision?"}]]