[[{"date": "15 Jul 2022", "title": "Systems Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Benefis Health System (Great Falls, MT) in May 2022", "Interview Descriptions": "Round table interview with CIO, lead engineer and senior system administrator. Plenty of well thought out questions and good discussion. The interview did start late but was completed in roughly 30 minutes.", "Interview Questions": "Why are you looking to leave your current company?"}, {"date": "29 Jun 2023", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Benefis Health System (Great Falls, MT) in Jan 2022", "Interview Descriptions": "Well formed questions . Opportunity to benefit the community. Opportunity to meet with leader ship. Limited time with other practitioners. Seem like a collegial environment. Beautiful area. Out reach opportunities.", "Interview Questions": "What is your career path for the next three years ?"}, {"date": "7 Apr 2018", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Benefis Health System", "Interview Descriptions": "Emailed an interview date. Had interview. Wait for process. Second interview. Then you wait as others are being screened and evaluated. Second interview is a group/peer interview. Then you wait and see what happens.", "Interview Questions": "Why do you want to work here?"}, {"date": "26 Nov 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benefis Health System (Great Falls, MT) in Apr 2017", "Interview Descriptions": "Online they ask many questions it takes a while to fill out. There is a resume submission and essentially the same thing in a question and essay form. It was long distance so they called to say I had been accepted then there was a skype interview.", "Interview Questions": "What are your weaknesses"}, {"date": "8 Dec 2016", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Benefis Health System (Great Falls, MT)", "Interview Descriptions": "Came in and it was a group interview, very friendly staff. Made me feel like I wanted to work with the team. I was very nervous at first and they laughed with me (i'm a nervous laugher). I have never looked back!", "Interview Questions": "Do you knit or Crouchet?"}, {"date": "4 May 2017", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Benefis Health System (Great Falls, MT) in Feb 2015", "Interview Descriptions": "The interview process went really smoothly, very professional, and in a comfortable setting. The questions were knowledge based and not intimidating. The questions were also professional and made a person think through.", "Interview Questions": "Why don't you tell us about yourself, work related of course. "}, {"date": "6 Dec 2016", "title": "PTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Benefis Health System (Great Falls, MT) in Dec 2014", "Interview Descriptions": "Interview process was simple and straight-forward. Very comfortable, one-on-one interview style including ability to ask current employees questions. Two separate interviews did take place including a second supervising PT with follow-up questions.", "Interview Questions": "If I have ever been injured on the job."}, {"date": "9 May 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Benefis Health System (Great Falls, MT) in Sept 2014", "Interview Descriptions": "Normal interview questions for the position. No out of the ordinary questions were asked. I was interviewed by two employees two days after I submitted my application. The interview was about 45 minutes total.", "Interview Questions": "How do you handle stressful situation? "}, {"date": "9 Aug 2014", "title": "Staff Development Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benefis Health System", "Interview Descriptions": "Applied online. After a couple weeks I received a call from a recruiter and was asked some screening questions. Soon after was asked to an in-person interview. That was a panel interview and virtually the whole department attended. The questions were mostly behavioral interview questions which they asked in turn from a prepared script. I was then asked to give a 5 -- 10 minute presentation based upon a PPT and notes they provided. I was given 10 minutes to study the info and practice.", "Interview Questions": "I had not expected to give the presentation. I have since helped write some of the behavioral questions and they are looking for basic skills, integrity and cultural fit. "}, {"date": "4 Jan 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Benefis Health System (Great Falls, MT) in Sept 2013", "Interview Descriptions": "Interview was personal.  Then they had HR do another one which seemed like a joke even though I got the job in the end. First interview was with the director. Second was with an HR group. I felt like I had no chance after interviewing with the HR group.   The director was great and I  felt confident after speaking with him.   He was good to work for until he semi retired and they put a holster in charge as the manager instead. Everything went to pot after that.", "Interview Questions": "About my work experience. "}]]