[[{"date": "5 Apr 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southeast Missouri State University", "Interview Descriptions": "After you submit your resume, there is two rounds of interviews. 1st round is with a hall director and fellow RA. 2nd round is giving a presentation for all the hall directors.", "Interview Questions": "They ask questions based on programs you want to organize, your interpersonal skills, and your ability to but bias aside. "}, {"date": "22 Feb 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Southeast Missouri State University", "Interview Descriptions": "The interview takes quite a long time, has been went through interview committees at first. Then, met the person in charge/chairman. Questions were not hard, very common questions. Ask experiences, strengnth/weakness, educational background and so on.", "Interview Questions": "N/A"}, {"date": "29 Jan 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southeast Missouri State University", "Interview Descriptions": "Very simple, asked about my experience in marketing and what I have skills in. After I did this they asked standard questions (strengths, weaknesses) and then asked how to work in my school schedule. At the end I had to take a skills assessment that took me an hour.", "Interview Questions": "How does your class work relate to this job?"}, {"date": "12 May 2020", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Southeast Missouri State University (Cape Girardeau, MO) in Jan 2019", "Interview Descriptions": "One In-Person meeting.  Normal interview process.  One Week Period. Applied online, interviewed the next day, hired at the end of week.  Average difficulty interview, laid back, friendly.", "Interview Questions": "What steps would you take in promoting a campus program?"}, {"date": "26 Apr 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Southeast Missouri State University", "Interview Descriptions": "I received a phone call followed by a group panel interview. Interview was easy and straight. They have asked my about my previous work experience and what skills I could bring in to my current position.", "Interview Questions": "About previous work experience"}, {"date": "2 Feb 2017", "title": "Photo Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Southeast Missouri State University", "Interview Descriptions": "Professor made an announcement during class about a work study process, talked to my professor and then filed an application with student financial services. took a few days for that to go through then went through training and got keys to my job. the interview was fairly easy and mostly a judge of character.", "Interview Questions": "Hours to work"}, {"date": "13 Aug 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 12 months. I interviewed at Southeast Missouri State University (Cape Girardeau, MO) in Jan 2016", "Interview Descriptions": "It was basically me going to the supervisor once or twice every semester until I got a job. The standard hiring process for student workers with the added constraint of being an international student.", "Interview Questions": "How good is my English?"}, {"date": "18 Dec 2018", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Southeast Missouri State University in Dec 2015", "Interview Descriptions": "Overall cleaning of building and classrooms, entryways, bathrooms.  Empty trash in hallways, clean windows. Help maintain an overall view of campus and classrooms for all students and staff.  Simple interview process.", "Interview Questions": "Experience "}, {"date": "17 Aug 2015", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Southeast Missouri State University", "Interview Descriptions": "The interview process was rather easy. I came in and they greeted me and ask me to go into a room and basically asked me basic questions like what are my future plans and how can I benefit them with my skillsets.", "Interview Questions": "What are your future plans?"}, {"date": "16 Nov 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Southeast Missouri State University (Cape Girardeau, MO) in Sept 2014", "Interview Descriptions": "First the interview started as soon as you check-in. Then you have to stand in front of the room and introduce yourself to the group. Then we broke off into two smaller groups and answered a round of questions. Next round we had to give answers to different scenarios that could occur while on the job. The last round was about our knowledge of campus.", "Interview Questions": "If a student is not happy with their schedule, what would you do for them?"}], [{"date": "16 Mar 2017", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Southeast Missouri State University (Cape Girardeau, MO) in Aug 2014", "Interview Descriptions": "Completed application online and had to personally drop it off at the University, took MS Office competency test, granted interview. Interviews with with a group of people. Parking was a pain and was issued a ticket but University took care of it.", "Interview Questions": "Why do you want this job?  What is your experience with diversity? How do you handle stress?  Describe a time when you had a difficult person and how did you handle it?  What would you say if someone asked to to reveal confidential information?"}, {"date": "3 Jul 2015", "title": "Demo Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Southeast Missouri State University in Apr 2014", "Interview Descriptions": "We met at the Sam's club that CrossMark demos in.  It was a one on one interview and the manager made me feel welcomed and comfortable.  Mainly the interview process was show up, introduce myself and who I was, and paperwork.", "Interview Questions": "Who were my previous employers."}, {"date": "14 Nov 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at Southeast Missouri State University", "Interview Descriptions": "I was told during the interview that the computer lab would be upgraded, which was not the truth.", "Interview Questions": "My former employee offered me a pay raise after I took the position"}, {"date": "15 Mar 2015", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Southeast Missouri State University (Cape Girardeau, MO) in Oct 2013", "Interview Descriptions": "(1)Take an appitude test on typing, Excel, Word, Access, & Powerpoint. (2) Submit application to HR. (3) HR reviews all applications and submits revelant ones to department hiring.  (4) Hiring committee rates each applicant (5) HR calls applicant to set up interview (6) meet with hiring committee, Director, and Assistant Directors for interview (7) wait for phone call offering you the position or a letter stating you did not get the job.", "Interview Questions": "They mainly asked the standard interview questions in a round table style"}, {"date": "29 Jul 2013", "title": "Event Services Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Southeast Missouri State University", "Interview Descriptions": "I was initially called by an administrative assistant to schedule an interview. The interview itself lasted nearly two hours. I spoke and interviewed with my future supervisor, then her boss, then a search committee, and then a group of colleagues. Each group used similar questions from a list which was good because I got familiar with my answers. Everyone was very polite and friendly. At the end of the interview I was told I would be contacted within a week or two to be told whether I got the position or not. I was never contacted. I instead had to call human resources and ask them.", "Interview Questions": "How will you foster diversity in your job position?"}]]