[[{"date": "17 Sept 2022", "title": "Security Guard Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Joslin Diabetes Center", "Interview Descriptions": "The process was to me normal. There was no difficult questions and they were very professional. They made me feel comfortable during the process. I loved their approach. Just great.", "Interview Questions": "How soon can you start"}, {"date": "15 Mar 2022", "title": "ADC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Joslin Diabetes Center", "Interview Descriptions": "Easy! Everyone was very nice and supportive. Wasn’t just all focused about me but about them and the company as well which was nice. A quick process too it didn’t take long overall", "Interview Questions": "To show them Relevant experience "}, {"date": "20 Jan 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Joslin Diabetes Center (Boston, MA) in Jul 2021", "Interview Descriptions": "Preliminary call from HR, then interviews with PI and lab manager. Questions were about previous research experience and technical skills, no more than 20 minutes each. It was not too hard overall.", "Interview Questions": "Tell me about your research experience Longterm goals"}, {"date": "13 Dec 2022", "title": "Staff Accoiuntant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Joslin Diabetes Center in Jan 2019", "Interview Descriptions": "Managers were very honest and easy. told me what issue I will face. also, the offer was very quick I think it was on the same day as the interviews.", "Interview Questions": "I don't remember but it was like any normal interview questions."}, {"date": "17 Oct 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Joslin Diabetes Center (Boston, MA) in Aug 2018", "Interview Descriptions": "The usual brief phone screen went well but the questions were pretty superficial. Met for a F2F and again felt like I answered questions well and connected with the interviewer. They shared that there's an business issue that there's no organizational strategy so IT is highly reactive and technically focused. Thats why they are looking for a PM to work with stakeholders. Post interview was where the wheels fell off. I followed up with an email to the manager (she gave me her card), nothing. Tried Linkedin, again nothing. The recruiter called them and again nothing. My view is that lack of response or acknowledgement does not reflect well on an organization (as well as being plain rude).", "Interview Questions": "Approach to project management\r\nApproach on a troubled project\r\nHow to develop relationships with stakeholders to develop concencus/compromise "}, {"date": "21 Jun 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Joslin Diabetes Center (Boston, MA) in May 2018", "Interview Descriptions": "I applied online and was offered an interview at Boston 3 days later. However, I was rejected and that travel was on my own expenses (flight+hotel). I kept in touch with them in between my interview and their decision.", "Interview Questions": "Describe one of your shortcomings potentially impacting your future work here."}, {"date": "14 Jun 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Joslin Diabetes Center", "Interview Descriptions": "I applied on line. The process took nearly 3 weeks. In person interview with HR and supervisors.  First comes with basic personal questions, previous experiences, and following with future planning.", "Interview Questions": "what do you know about Joslin?"}, {"date": "16 Oct 2016", "title": "General Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Joslin Diabetes Center (New York, NY)", "Interview Descriptions": "I applied online through my university, had an in person interview at Joslin during the school year and the recruiter got back to me within a week offering me the intern position.", "Interview Questions": "Tell me what you know about Joslin."}, {"date": "23 May 2018", "title": "Patient Access Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Joslin Diabetes Center (Boston, MA) in Mar 2016", "Interview Descriptions": "Interviewed with 4/5 individuals on the same day. asked the same questions. Would have liked to meet with my direct report only. Other individuals I do not meet with regularly.", "Interview Questions": "On a scale 1-10, what would you rate your health insurance knowledge? "}, {"date": "10 Aug 2015", "title": "Senior Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Joslin Diabetes Center (Boston, MA)", "Interview Descriptions": "I applied online and had two phone screeners, one with HR and with the hiring manager. Next I completed two 1:1 interviews with the same people. By the next day the hiring manager had contacted my references and within a week we were negotiating the salary. The entire process was straightforward and very pleasant. The interview questions were not very challenging, negotiating my salary however was.", "Interview Questions": "Why are you moving to Boston?"}], [{"date": "15 Jul 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Joslin Diabetes Center (Boston, MA)", "Interview Descriptions": "Submitted an application through Indeed and received a call from Joslin HR about a week later. Went in for an interview with the two managers of the position a week later. Then was asked to come back for another interview with other members of the team. Finally, was asked for one final interview with the VP of Operations. The whole process took about 3 weeks.", "Interview Questions": "How do you handle stress?"}, {"date": "20 Jun 2015", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Joslin Diabetes Center (Boston, MA) in Apr 2015", "Interview Descriptions": "Met with the supervisor and lab manager at separate times. Getting a tour of the workplace. Basic one-on-one interview with lab members. The people I met made me feel at ease and were very attentive to what I had to say. They answered all the questions I was asking them. Great experience overall.", "Interview Questions": "What are your professional goals ?\r\nWhere do you find yourself in five years ?"}, {"date": "12 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Joslin Diabetes Center in Sept 2014", "Interview Descriptions": "Met with HR early on, very welcoming and straight-forward questions with detailed descriptions offered of benefits. PIs asked straight-forward questions, although one asked somewhat unrelated to job description at points which I considered inappropriate, given personal beliefs and health circumstances. Truly depends on experience level of staff doing interview and how patient they are in finding a candidate.", "Interview Questions": "How would your skill set and experience be beneficial to our lab goals and expectations?"}, {"date": "17 Mar 2015", "title": "Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Joslin Diabetes Center (Boston, MA) in Mar 2014", "Interview Descriptions": "Met with a supervisor and manager at separate times. Basic interview questions that you can find online to prepare yourself. Both people I met with made me feel comfortable and were attentive to what I had to say and answered all the questions I had for them.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "21 Aug 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Joslin Diabetes Center (Boston, MA) in Jul 2013", "Interview Descriptions": "The process was organized.  I had an initial meeting and then a follow-up meeting.  I was then able to meet with my future team so that they could ask questions and feel comfortable since this was a new position being created.  It was helpful to also receive a tour of the facility.", "Interview Questions": "They asked me about my experience in designing processes."}, {"date": "10 Jun 2016", "title": "Senior Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Joslin Diabetes Center (Boston, MA) in Jul 2012", "Interview Descriptions": "I contacted the PI directly via email and sent him my CV and references. I was asked a Skype interview as I was abroad at that time. The PI contacted me directly, he asked me about my experience and my past projects and various technical skills. He described his lab and lab members and the situation. \r\nAfter few days he sent me the job offer.", "Interview Questions": "technical bench expertise questions"}, {"date": "19 Aug 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Joslin Diabetes Center (Boston, MA) in Dec 2009", "Interview Descriptions": "In general, there is a full day interview with a 1 hour seminar about your past work. this is then followed by several 1 on 1 interview with current post-doc and the Principal Investigator.", "Interview Questions": "N/A"}]]