[[{"date": "21 Apr 2023", "title": "Real Estate Broker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Open Door (Houston, TX)", "Interview Descriptions": "2 interviews. First was about 30 minutes went well and was super confident. The 2nd was with two other Brokers from other states one seemed immediately uninterested and the other was distracted from their kids in his background video and kept asking me to hold on. The uninterested one asked \" If I understood the interview was for a Broker\"", "Interview Questions": "How do you hand conflict with agents? Name a time you had a problem and how you found a solution to the problem."}, {"date": "23 Mar 2022", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Open Door", "Interview Descriptions": "phone interview and then video interview.  mixed of formal and informal and not too tough questions. The process took longer as it was a mixture of interviews and training. The questions were mainly logistics and experience-based and skills-based and were ok for answering. The process of interviewing was not too formal and difficult.", "Interview Questions": "Based on experience, how did you provide services to assess the work of the clients\r\n"}, {"date": "1 Mar 2022", "title": "Head of Design & User Experience Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Open Door (Los Angeles, CA)", "Interview Descriptions": "Interview process was very thorough and transparent — I met with multiple groups that I would expect to work with, and each session was engaging and collaborative. I felt that I was given ample space to get to know the work culture and technical processes, and the questions and prompts I was given also allowed me to express my own technical and cultural principles.", "Interview Questions": "What is your working process?"}, {"date": "16 Dec 2022", "title": "General Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Open Door (Atlanta, GA) in Jan 2022", "Interview Descriptions": "Generally standard -- recruiter, comp range check-in, first and second round interviews with hiring manager, potential future team members, etc....but then ghosted, even after being told I would advance to the next round.", "Interview Questions": "Standard behavioral questions: tell me about a time you did x, y, z."}, {"date": "8 Mar 2022", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Open Door in Mar 2018", "Interview Descriptions": "Very informal, welcoming, and easy to participate. The interviewer made you fell comfortable and asked questions that pertained to the job as well as situational questions. The interview concluded after about 30 minutes.", "Interview Questions": "Rate how assertive I am on a scale of 1 to 10"}], []]