[[{"date": "6 Jan 2023", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at On Lok", "Interview Descriptions": "I submitted my application online. I heard back from a recruiter about a week later for a phone screen. Several days later I had an initial phone conversation with the director of that department. Conversation went okay, the position sounded interesting but I had a gut feeling I wasn't moving forward. I was told I would hear back from the recruiter regardless if I was selected to proceed or not. No one bothered to communicate with me, which I find quite unprofessional.", "Interview Questions": "Phone screening consisted of asking about my experience, skills, why I want to work at this position."}, {"date": "27 Oct 2022", "title": "In Home Caregiver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at On Lok (San Francisco, CA) in Aug 2022", "Interview Descriptions": "Very good experience. The administration officer is very fast to handle my application. Everyone is so nice in the interview. The interview question is about the practice of the job.", "Interview Questions": "How to serve the elderly with dementia"}, {"date": "16 May 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at On Lok (San Francisco, CA)", "Interview Descriptions": "Online application/submit resume. I then had initial phone interview. Was told I would hear back either way, but no one followed through or bothered letting me know either way. A bit frustrating", "Interview Questions": "What is your worst/best  feature"}, {"date": "21 May 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at On Lok (San Francisco, CA) in May 2020", "Interview Descriptions": "An external recruiter reached out to me, and was very unprofessional. I had to ask several times for more information about the company, she cold called me more than once after receiving my resume, she missed our first scheduled call without telling me and was late to our second scheduled call because she somehow had the wrong phone number.\r\n\r\nThe first few questions she asked me were illegal to ask applicants and when I pointed that out and offered a tip on how to get the answer needed without setting the company up to look like they were discriminating against anyone, she got very short with me, asked me a few more questions (that I had already answered in our extensive email communication) and I never heard from her again", "Interview Questions": "I was asked questions about salary, citizenship, where I am from, and where I live. I was also asked about how long I had been doing X which were questions that had been answered previously and are clearly answered on my resume"}, {"date": "11 Feb 2019", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at On Lok", "Interview Descriptions": "I applied online and heard back from the recruiter very quickly which was great. However, they listed this role as a full time career—and when I got on the phone with the recruiter she said this was an on-call position. The job listing was misleading.", "Interview Questions": "Are you comfortable with this being an on-call position?"}, {"date": "14 Nov 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at On Lok (San Francisco, CA) in Oct 2018", "Interview Descriptions": "Got a Phone interview with one of the nurse director. It was causal and more about getting to know you type of I terview. Lasted for 30 mintues, mostly focus on passion, focus of care you want to be in", "Interview Questions": "What is your strength? "}, {"date": "1 Aug 2018", "title": "Enrollment and Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at On Lok", "Interview Descriptions": "Phone interview, first face to face, second face to face then hired, phone interview was very easy. normal question about describing myself and some experience.  Most people I had interviewed with were very nice, and they like to answer my questions and they even let me know how the company work, to give me an overview of what kinda organization that On Lok is.", "Interview Questions": "What is your experience in help senior citizens?"}, {"date": "9 Oct 2018", "title": "Purchasing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at On Lok (San Francisco, CA) in Jan 2018", "Interview Descriptions": "Very smooth. Very old school. Full profile of interviews with supervisor, key staff and then division head. Started as a temp and converted rather quickly. The actual day of onboarding, everything was prepared and printed out, even the goodies (pens, a cup, the usual swag with the institutional logo...it was nicely done) and the HR person doing intake had everything in hand. Then, there was the orientation for new employees which, I have to say, was not old school. We were invited to share our personal reasons for being involved in this work, and were given the opportunity to really interact with each other and the staff. The CHRO was present (and very present) and what I expected to be one of those \"long meetings one endures\" surprised me and turned out to be a very enriching day. I learned a lot about the institution, my future co-workers and the way HR lays things out.", "Interview Questions": "Because I had started as a temp, I already knew the position, already knew I wanted it. So the first question from someone who had, by now, started to become a colleague was along the lines of \"What about your past experience will feed your success here?\" It was a great interview."}, {"date": "28 Oct 2016", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at On Lok", "Interview Descriptions": "1-2 phone interview and 1 onsite\r\nRecurer, manager, co-workers involved in the whole process\r\nSupport remote interview\r\nThe whole process last 2-3 weeks\r\nI didn't go into the hiring process because they could not support working visa", "Interview Questions": "experiences \r\nProfessional skills\r\nCareer goals"}, {"date": "14 Mar 2017", "title": "LVN Home Visits Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at On Lok (San Jose, CA) in Oct 2016", "Interview Descriptions": "Interviewed with program Manager and then  Lead RN.  Difficulty understanding some questions related to language differenc exchange with RN. Hindsight the answers given by them incomplete.  \r\nReceived tour of facility, brief overview of company", "Interview Questions": "Do you mind working some weekends?"}], [{"date": "30 Aug 2015", "title": "Geriatric Aide I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at On Lok (San Jose, CA) in Aug 2015", "Interview Descriptions": "Hiring manager contacts you first before deciding if you are fit for the job before handing you in to the Site manager for another phone interview. If they like you they will set you up for an in person interview. Then you call the hiring manager again to finish the hiring process. Both parties were very friendly and conducted the interviews efficiently. It was a semi-casual dress interview and the site manager will give you a tour of the center. They have a very thorough interview process and do a lot of checks before they offer you yhe position. They tell you the hourly wage and expected schedule for each week. You can go to school and work here at the same time. They are accomodating to schedule as long as you're up front about it.", "Interview Questions": "What experience do you have takin care of Seniors?"}, {"date": "3 May 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at On Lok", "Interview Descriptions": "Not too many interviews. the usual person to  person interview and background check. polite throughout interview process. good at keeping updated as process moved along. took me to lunch at end of process", "Interview Questions": "What is your experience"}]]