[[{"date": "1 Mar 2023", "title": "Medical Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centra Health", "Interview Descriptions": "very short, simple standard questions. probably lasted around 5 to 10 minutes. hired on the spot. starting takes forever though. the onboarding process was about four weeks from hire date.", "Interview Questions": "Why do you want to work her?"}, {"date": "18 Jan 2023", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Centra Health (Lynchburg, VA)", "Interview Descriptions": "The interview process was easy. Was asked the basic interviews. How did you hear about this position? Why would you be a good candidate? Heard back within a week after initial interview.", "Interview Questions": "Describe a time you had to deal with a difficulty co-worker."}, {"date": "24 Aug 2021", "title": "Executive Director Incomplete Board Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centra Health in Aug 2021", "Interview Descriptions": "It lasted about 30 mins. I interviewed with my supervisor and the employee I was replacing via zoom. They asked me where I see myself in the future and if I'm comfortable with the schedule. The only downside is that they do not pay well.", "Interview Questions": "Where do you see yourself in the next 5 years? "}, {"date": "4 Mar 2021", "title": "Physician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centra Health", "Interview Descriptions": "It was a series of e-mail and a general phone interview. The process never got terribly far. I am not sure how aligned they are as an organization because every step took a long time", "Interview Questions": "General interest questions about focus and change"}, {"date": "8 Oct 2020", "title": "Outreach Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Centra Health", "Interview Descriptions": "30 minute interview. fast. Person I spoke with was very nice. They asked many questions about my background. I enjoyed speaking with them. They explained the job clearly and precisely.", "Interview Questions": "Can I work full time or part time?"}, {"date": "10 Sept 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centra Health (Lynchburg, VA) in Sept 2020", "Interview Descriptions": "Applied online, waited approximately four days and got a phone call to have interview the next day. Great nurse manager, and fast application processing. Cannot wait to work here.", "Interview Questions": "What are your expectations "}, {"date": "17 Jun 2020", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Centra Health", "Interview Descriptions": "Easy and fast. They do not ask many questions. Very pleasant experience, you will be tested for drugs and tobacco. Which may be an issue for some people. Very positive enviornement.", "Interview Questions": "Tell me about yourself."}, {"date": "1 Oct 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centra Health (Lynchburg, VA) in Apr 2020", "Interview Descriptions": "The interviewer was very informative and thorough while explaining the details of the job duties.  Interviewer was polite and well understood.   Interviewer gave important information on a typical work day and how the nursing role supports in patient care.", "Interview Questions": "Tell me about yourself and your previous job experience"}, {"date": "28 Mar 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Centra Health (Lynchburg, VA)", "Interview Descriptions": "The company I was working for prior to Centra was purchased by Centra and my job was going to be done away with.  However, because of a need an office had management asked to interview me for that position if I was interested. It was a panel interview.", "Interview Questions": "Do you prefer to work alone or as part of a team?"}, {"date": "2 Nov 2018", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Centra Health (Danville, VA) in Oct 2018", "Interview Descriptions": "Group Interview Including Pathologist, Manager, Supervisor, and Building Manager. It was an extremely hard personality interview rather than one on my skills as a Medical Laboratory Scientist besides one question on my skills at multitasking. I felt completely unprepared for those kinds of questions.", "Interview Questions": "Name Five things that describe (characteristics) you as a person?"}], [{"date": "17 Oct 2018", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centra Health (Lynchburg, VA) in Sept 2018", "Interview Descriptions": "I was referred by a friend that the position would be opening up soon and to apply. Once I applied the friend reached out to the hiring manager to pull my application. I interviewed and two days later received a call from HR saying that they would like to extend an offer. I had a few papers to sign, an on boarding interview/drug and medical screening for hire, and then a one day orientation. From what I've heard, many jobs at Centra are essentially filled before they are even put on their web page with the exception of RN, CNA, and licensed practitioners (areas they are incredibly short staffed in). I feel like I was definitely hired because of who I knew, but I don' t know how much I would approve of their process if I was a random and non-connected applicant.", "Interview Questions": "How do you handle adversity in the workplace?"}, {"date": "18 Nov 2017", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Centra Health (Lynchburg, VA) in Oct 2017", "Interview Descriptions": "The interview consisted of a meeting with the managers Courtney and Julie in their office and answering a few questions and prioritizing care. The interview finished up with a math test dosage calc and safe doasages", "Interview Questions": "Where do you see yourself in five years? "}, {"date": "19 Jul 2017", "title": "Certified Occupational Therapy Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Centra Health (Warren, OH)", "Interview Descriptions": "The first interview was by phone with office manager.  Second interview was a phone conference call with the OT team and office manager. It was very relaxed interview,  more to see how I fit the team.", "Interview Questions": "When treating Home Health clients what was my biggest obstacle? "}, {"date": "30 Jul 2021", "title": "ER Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Centra Health (Lynchburg, VA) in May 2017", "Interview Descriptions": "I was brought into a conference room and interviewed with the Director of the Scribe Program, the Head Scribe, as well as the Head Training Scribe. They asked me some questions about my schooling, life goals, etc. Then I was given some brief instructions and examples of HPI's before going through a few mock patient interactions and writing up the HPI within a few minutes.", "Interview Questions": "Why do you want to be a Scribe?"}, {"date": "8 Feb 2017", "title": "Medical Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Centra Health (Lynchburg, VA) in Jan 2017", "Interview Descriptions": "Interview was laid back and easy. Heard back very quickly. Two interviews, first was with 2 people and second was a group of 5 interview. Very impressed with the company.", "Interview Questions": "What do you do if a customer is wasting your time?"}, {"date": "21 Dec 2016", "title": "Mental Health Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Centra Health (New York, NY) in Dec 2016", "Interview Descriptions": "I was made to feel very comfortable and given a really detailed run down of what expectations I would have to meet as an employee in the facility. The interviewer took the time to make sure I knew all about what I would be doing and what I need to expect, including talking to me about ways to make my commute easier (many employees carpool and I was invited to join if hired).", "Interview Questions": "Why are you interested in this position?"}, {"date": "10 Feb 2019", "title": "EMT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Centra Health (Lynchburg, VA) in Nov 2016", "Interview Descriptions": "Apply online, took about a month to hear back\r\nThen interview which was triage, medical, and trauma scenarios then an oral panel interview\r\nAbout a week later I got an offer, which I accepted and then got a physical, drug test, and fingerprinted.", "Interview Questions": "Why do you want to work for Centra Transport?"}, {"date": "5 Sept 2016", "title": "Community Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Centra Health", "Interview Descriptions": "I applied online. There was a pre-screen phone interview with HR. A week or so later there was an initial interview with the hiring manager. 2 days later there was an interview with the hiring manager and the director. Got a call with the job offer the next day.", "Interview Questions": "Asked about experience"}, {"date": "12 Aug 2019", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centra Health (Lynchburg, VA) in Jan 2016", "Interview Descriptions": "Phone interview and then was bought in for a face to face interview.  Typical interview with four different people, one of which was looking to fill a completely different position.", "Interview Questions": "Things I like to do outside of work."}, {"date": "2 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Centra Health", "Interview Descriptions": "Short, quick and very welcoming. Asked about background, my reason for wanting the job, what I had to offer and my abilities to cover the person while the individual was not there. Could I learn info needed quickly. Simple questions that most companies will ask. Friendly staff. The interview lasted about a half hour. I was told that those interviewing me would follow-up with the staffing agency.", "Interview Questions": "How familiar was I with Outlook 2013?"}], [{"date": "2 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Centra Health (Lynchburg, VA) in Mar 2015", "Interview Descriptions": "It was fairly extensive! I had 1 interview with the nurse recruiter, 2 panel interviews, and a shadowing on the unit I was applying for. It seemed like a pretty sought after position, so that could be why.  At first they said they didn't have any more positions available, then the unit manager called me about a week later and said that more positions had been approved so she offered me the job over the phone! \r\nThe panel asked quite a few questions. The shadowing was about 6 hours, but was fairly laid back.", "Interview Questions": "Describe a situation in which you didn't agree with a decision made by a manger or supervisor, and how did you react? "}, {"date": "22 Feb 2015", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centra Health (Lynchburg, VA)", "Interview Descriptions": "I had 2 on-site interviews with the Director, and on the second interview I spoke with 3 of the technicians who were working in the department. I also spoke with the CIO/VP for a few minutes during the second interview as he was influential in the founding of the department and enjoyed remaining involved.", "Interview Questions": "One interesting question was \"What was the last book you read\""}, {"date": "7 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Centra Health (Lynchburg, VA) in Aug 2014", "Interview Descriptions": "I applied for the Residency Program online. Weeks later I was contacted via email to see if I was still interested in employment. After replying they set me up for an interview. When I had my interview I was met by the nurse recruiter. In the interview the nurse manager for the unit was present and the nurse recruiter. Also there were two nurse managers there. It just so happens I was interviewing for two positions! This was not planned. Anyways I rocked the interview and accepted the offer.", "Interview Questions": "Tell us about yourself?\r\nName a time when you went out your way fir someone?\r\nWhy do you want to work for us? "}, {"date": "21 Apr 2016", "title": "Special Education Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Centra Health (Fredericksburg, VA) in Jul 2014", "Interview Descriptions": "The hiring process was very professional. I was called on the phone by the principal and she asked for a good time for a phone call interview. I was then called in to view the school. The principal then called me for a panel interview.", "Interview Questions": "How would you incorporate a variety of teaching techniques in the classroom?"}, {"date": "11 May 2014", "title": "Mental Health Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Centra Health (Roanoke, VA)", "Interview Descriptions": "The interview was very short and more of an informal conversation. The job interview was given to me strictly because I met someone in management and did not hinge what so ever on my education or qualifications. Was offered the job on the spot and told them that I would need time to think it over. Was called the next day and informed that my decision must be rendered.", "Interview Questions": "I was asked what I really wanted to do with my career or life."}, {"date": "11 Mar 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Centra Health (Lynchburg, VA) in Feb 2014", "Interview Descriptions": "Large panel with endless questions primarily interested in how 'cheap' they could get me. Not so much interested in what I could do for them since I overshot the mark on starting salary, so I took it anyway to wait for something better to come along.", "Interview Questions": "How would I treat a doctor if they demanded something out of the ordinary. They quizzed me on my general knowledge and past history. They seemed only interested in how much they could get me to work for."}, {"date": "19 Aug 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Centra Health (Lynchburg, VA) in Nov 2013", "Interview Descriptions": "Invited to one of the satellite buildings and had to find way through mazelike area.  Interviewer asked average, typical interview questions.  She was pleasant to deal with; however, she was distracted.  She was prepared for the interview.", "Interview Questions": "General interview questions; however, I was asked how to deal with individuals that wouldn't share information."}, {"date": "18 Aug 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Centra Health (Lynchburg, VA) in Nov 2013", "Interview Descriptions": "The interview was for half and hour and interviewer asked standar questions.  I was slight disconcerted because it seemed as if the interviewer wasn't really listening to my responses and she seembed a bit rushed.  However, I received an offer fairly quickly.", "Interview Questions": "Questions were standard"}, {"date": "12 Dec 2012", "title": "Aide Nutrition Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Centra Health (Farmville, VA) in Sept 2011", "Interview Descriptions": "Centra Southside posted the job online and I applied by submitting a resume.  I received a request the next day for an interview.  Two days later, I attended the interview.  The interviewer was the manager of the department and was very easy to talk to.  He asked about my job duties at similar facility where I had worked and explained what would be required if I was hired.", "Interview Questions": "There were no difficult or unexpected questions and the interviewer had a very casual and pleasant demeanor."}]]