[[{"date": "10 Oct 2022", "title": "Electrical Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Radio Astronomy Observatory (NRAO)", "Interview Descriptions": "phone interview with one company's recruiter then interview with 5 panel members. Both technical and managerial questions were asked. From the five members, one was the group leader, one was the electronic lab expert and two other were part of the electronic team. The last member was the same recruiter in the first stage.", "Interview Questions": "How do you deal with failure?"}, {"date": "2 Apr 2020", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at National Radio Astronomy Observatory (NRAO) (Charlottesville, VA) in Mar 2020", "Interview Descriptions": "25 minute phone interview with the a 5-7 person committee on the line alternating who's asking questions. Asked what I knew about the position/location/company/subject, etc. They explained what would be required, what the training process looks like, and tentative start information.", "Interview Questions": "What is interferometry, what do you know about the ALMA observatory, what are your interests with this company, etc. "}, {"date": "9 Dec 2020", "title": "News and Public Information Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at National Radio Astronomy Observatory (NRAO) (Charlottesville, VA) in Dec 2019", "Interview Descriptions": "Online application. Invited to write a sample press release for research paper. Phone/online interview.\r\nPosition was ultimately given to the person filling the position temporarily.\r\nHowever,  I was told my application was strong and was invited to apply to other similar positions. When the position opened up again after a year (due to COVID issues), they contacted me to re-apply.", "Interview Questions": "This was over a year ago, but questions were about management experience, news experience, how to find sources of research that might be press release related, etc."}, {"date": "18 May 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at National Radio Astronomy Observatory (NRAO) (Albuquerque, NM) in May 2019", "Interview Descriptions": "a lot of technical questions but easy going interview committee. a bit tough questions on technical radio interferometry part. it was very quick. 10 faculty were present in the interview .", "Interview Questions": "What is your background? What is the calibration process of VLA?"}, {"date": "7 Nov 2018", "title": "Entry Level Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at National Radio Astronomy Observatory (NRAO) (Charlottesville, VA) in Oct 2018", "Interview Descriptions": "1.  phone interview with the hiring team\r\n2.  invited onsite\r\n3.  travel, food , lodging reimbursed\r\n4.  very nice people\r\n5.  lunch with the hiring team\r\n6. tour of the workplace", "Interview Questions": "1.  previous work experience discussion\r\n2. a system design question"}, {"date": "16 Apr 2016", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at National Radio Astronomy Observatory (NRAO) (Charlottesville, VA) in Feb 2016", "Interview Descriptions": "I spent a huge amount of time preparing for interview questions related to data on their web site, public information, papers published,  and job description. It seems they rather radically changed these things and asked quite different discussion. Got the feeling that their public request for some one to manage and expand current state-of-art radio astronomy had changed to wanting someone to take them away from radio astronomy and into a commercial business.", "Interview Questions": "How do you perceive your job at NRAO."}, {"date": "1 Oct 2015", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at National Radio Astronomy Observatory (NRAO) in Sept 2015", "Interview Descriptions": "Glacially slow process, when things happened, it was fairly standard and rather conversational. Scheduling of in-person interview was screwed up by HR rep, who STILL hasn't processed travel reimbursement.\r\n\r\nI would recommend avoiding this quasi-governmental entity as an employer... Located on a university campus, but no university privileges; gets Federal funding, but no federal employee benefits. If I had been offered a position I would have declined it based on the staggering bureaucratic operational process. I also have my suspicions the salary would be so low as to make it difficult to actually live near the facility.", "Interview Questions": "Q:Have you worked with asset management systems?"}, {"date": "27 May 2015", "title": "Intermediate Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at National Radio Astronomy Observatory (NRAO) (Socorro, NM)", "Interview Descriptions": "I was contacted by HR to schedule a phone interview. An in-person interview was scheduled to meet with HR and then met and interviewed with the engineer who was hiring for the position and the division head at the time.", "Interview Questions": "How do you feel about relocating to Socorro, NM?"}, {"date": "13 May 2016", "title": "Prefer Not To Say Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Radio Astronomy Observatory (NRAO) (Charlottesville, VA) in Jan 2015", "Interview Descriptions": "The interview process was seamless. I was called to do a phone interview, then a week later an in-person interview where I meet with the team and senior management. They were very clear about the role and provided me with some expectations of the role that I still use to the is day.  There was communication with in 3 weeks of my application being submitted.", "Interview Questions": "Describe how your skills and qualifications would best fit this role? There were some technical questions about the job as well. The first questions really stuck out."}, {"date": "15 Jun 2015", "title": "Junior Associate Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at National Radio Astronomy Observatory (NRAO) (El Paso, TX) in Aug 2014", "Interview Descriptions": "quick, very responsive, mostly concerned about ability and availability to work. I was contacted via phone after 2 weeks of applying for the position, the interview itself consisted of getting to know my ability to perform certain tasks that would be required during the job.", "Interview Questions": "are you physically able to work in an environment that requires you to climb on to the 100ft tall antennas? "}], [{"date": "30 Jul 2017", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Radio Astronomy Observatory (NRAO) (Socorro, NM) in Jun 2013", "Interview Descriptions": "First a quick phone interview, followed by an on site interview, and a lunch with most of the interviewers after that. They pay for travel expenses. The in person interview was very relaxed, technical question were easy. NRAO  made an offer and I accepted. The hiring process itself was another matter, the whole deal took about 3 months. They had just starting using some new HR software, which gave them some trouble. They also disclosed to me that they had made an offer to someone else and that person took a long time to turn them down. As far as I learned, this person had some software qualifications as well as the scientific background they would prefer at NRAO, so I can understand that. I didn't have any background in astronomy or RF receiver technology, I'm a pure software person. The interview was in 2009, but the form doesn't let me pick that date...?", "Interview Questions": "Show you understand manipulating bits in a byte, AND, OR, XOR, etc."}, {"date": "17 Dec 2013", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at National Radio Astronomy Observatory (NRAO) in Jun 2012", "Interview Descriptions": "Awful, lack of coordination.", "Interview Questions": "N/A"}]]