[[{"date": "27 Dec 2019", "title": "Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL) in Dec 2019", "Interview Descriptions": "Contacted by recruiter over the phone. Interviewed with both current full time Exercise Physiologists in the Cardiac Rehab program, the director of rehab services, and administrative director of operations, all individually. Got a response within the same week.", "Interview Questions": "What are your goals for 10 years from now?"}, {"date": "18 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL) in Feb 2019", "Interview Descriptions": "I loved the structure of the interview process when I was here I met the director, administration, had a tour of the unit and a peer interview all back to back.", "Interview Questions": "Describe a time you used your chain of command to resolve a conflict. "}, {"date": "16 Oct 2018", "title": "Transporter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL) in Oct 2018", "Interview Descriptions": "Phone interview. Spoke with HR.  Told about the job and what it entails. Explained the hiring process and asked if I had any questions about it. Simple process with a quick turnaround.", "Interview Questions": "Why do you want to become a transporter?"}, {"date": "1 Feb 2021", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL) in Sept 2018", "Interview Descriptions": "It was nice and easy. They were very quick to the point and interviews us as a group. I enjoyed the time they took to show me around the facility and get oriented with the hospital. It was very easy interview that took less than 30 mins to complete", "Interview Questions": "Why do I want to work at this job"}, {"date": "30 Jan 2017", "title": "Clinical Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL)", "Interview Descriptions": "The interview process was laborious.  I had eight or nine, including the recruiter screenings, with that being said I had a pretty good idea an offer was coming by the time I was interviewing with upper management local and regional.", "Interview Questions": "All of the interview questions were standard."}, {"date": "24 Apr 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL) in Oct 2016", "Interview Descriptions": "Long process. Didn't give you much direction. Had to meet staff and asked you some questions about yourself and your experience. When you'd be able to start. About your schooling. How you handle difficult situations. etc.", "Interview Questions": "Work experience."}, {"date": "11 Apr 2016", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at HCA Florida Capital Hospital in Apr 2016", "Interview Descriptions": "Had a screening phone interview with a recruiter for a pharmacist position. Was told at the end of the phone screening my application would be forwarded to the hiring manager and I would be contacted again  if they wanted to continue with another interview. Within minutes after the phone call, my application was updated to not under consideration. If you are having a screening interview, I suggest checking your application status immediately afterwards, if they are not considering your candidacy they will not send a courtesy declined email.", "Interview Questions": "Questions were based on work experience on my resume."}, {"date": "15 Jul 2015", "title": "Registrar Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at HCA Florida Capital Hospital", "Interview Descriptions": "Was asked about myself,  education level, experience with handling money, qualifications,  etc. Was given a detailed description of what the job entailed. Smooth process, however the job requiref  5 day training from 9-5 that was not in the town l applied for, nowhere near it.", "Interview Questions": "Do you have customer service experience/ experience with handling money?"}, {"date": "20 Apr 2014", "title": "Pharmacy Technician Full Time Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL) in Apr 2014", "Interview Descriptions": "A few weeks after I applied I received a call from an HR representative. He did about a 30 minute phone interview asking about my experience in pharmacy and my certifications and my schedule. I had applied for an evening overnight position and this was very clear, he even asked if i could handle a FT overnight and still go to school. Two days pass and he calls back asking if i can meet with the interim director of pharmacy. I have only one day to choose but 3 time slots. I am directed in an email what time to arrive (15 minutes early) and where to go, this was considerate of them. \r\n So I arrive 15 minutes early and head to HR as directed. I wait about 5 minutes for the receptionist to finish her call and am told to have a seat. The Pharmacy Director comes and gets me. First we tour the Pharmacy and I know the equipment. They've got your standard pyixs medstation, an older model carousel and good size bulk dose machine. Their clean room looked decent, I've seen better/ I've worked with worse. Their stock set up seemed confusing and disorderly and was located in two separate places in the hospital (not just the pharmacy).  \r\n We finally went to the directors office across the hall and she had some questions. She seemed very nice. She was what i would expect of a practical Pharmacy Director. No flare. You could tell she actually works and is not just a face of the pharmacy. She also has some time under her belt as well as the education to back it all up. But she did not take notes on what I said. She only asked me 3 questions but for some reason seemed to do more talking then I. Whats your most stressful situation and how did you handle it? Have you ever implemented a new policy and why?  How do you handle mistakes? I had already discussed my compounding and chemo experience. \r\n Then came the big let down. She explained that the position I had originally applied for had been terminated by the company. And that the overnight position was being \"tried\" by another staff member. ( i respect that.) She said she had an 8-4 position to fill but i said it would not work with my school schedule. (I should have brought my school schedule with me in print.) 12$ p/h is not worth giving up school sorry. I asked if since she was utilizing another member of her staff for the overnight if she needed a part time or prn staff member, but never got a straight yes or no.  She showed me out and in doing so mentioned some employee stuff, But I never got a call.", "Interview Questions": "She asked me the names of the Pharmacist I worked with that went to her Alma mater, but did not know either of them, it was awkward and pointless. The mistakes question. Its a reoccurring one in the pharmacy world but its a two sided question your either a liar or a screw-up.  "}, {"date": "21 Jul 2013", "title": "Patient Acess Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HCA Florida Capital Hospital (Tallahassee, FL)", "Interview Descriptions": "It's an entry level job, the interview was basically standard and very generic questions like:\r\n\r\nExplain how you deal with difficult situations.\r\n\r\nTell me about yourself.", "Interview Questions": "There were no difficult questions. It was a very basic interview with standard questions."}]]