[[{"date": "12 Jun 2023", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Autism Society of NC (Raleigh, NC)", "Interview Descriptions": "Fairly easy going interview. They asked some behavioral questions. The big ones to be prepared for are related to previous training and conflict resolution. They ask about your ability to take part in team meetings.", "Interview Questions": "Have you ever worked with special needs clients?"}, {"date": "29 Mar 2022", "title": "RBT - Registered Behavior Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC", "Interview Descriptions": "It was a virtual interview. Very user-friendly and easy to navigate. I had no issue during the interview. The interviewer was very kind and created a very laid-back atmosphere. I was able to pick a time through a virtual calendar link.", "Interview Questions": "Tell me about your journey to this point"}, {"date": "3 Aug 2021", "title": "RBT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC", "Interview Descriptions": "My interview was completed via Zoom with a panel of interviewers. It was pleasant and I enjoyed learning about the company and it’s mission.  I would not say it was too difficult, but just know your “why” and it should go smoothly.", "Interview Questions": "Why are you interested in this position "}, {"date": "20 Apr 2022", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC (Greenville, NC) in May 2021", "Interview Descriptions": "Truly want to get to know you and your personality. Are interested in learning about your experience with children with autism. If you have no experience they really just want to know your willingness to learn about autism.", "Interview Questions": "Q: Do you have any experience with autism?"}, {"date": "11 Mar 2020", "title": "Registered Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Autism Society of NC (Raleigh, NC) in Aug 2019", "Interview Descriptions": "Very relaxed interview, come prepared to give examples of how you would handle situations. They are looking for people who have a passion for children and who are willing to learn ABA principles.", "Interview Questions": "How would you use this toy (mine was Mr.Potato Head) to interact with and teach a client something. "}, {"date": "1 Aug 2019", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC (Charlotte, NC) in Jun 2019", "Interview Descriptions": "It was a phone interview and it seemed to go well. Then the interviewer told me she would get back to me the following day. She got back to me two weeks later and told me that she wanted to bring me in for an in-person interview and to set up a time for that. I was super excited because I really wanted this job. Eight days later she emails me back saying she doesn't want me to come in right now or hire me right now but she may want to hire me in the future.  twenty-two days later I get an email from HR saying I didn't get the job because of education and experience but they will keep my resume on file for six months. It was a long process of waiting and poor communication. Lots of stringing me along.", "Interview Questions": "She asked me how I would handle certain scenarios with clients. "}, {"date": "30 May 2019", "title": "Habilitation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC", "Interview Descriptions": "The interviewer was thorough and honest. We set up the interview via phone. The interviewer listened carefully and did not rush me. She answered all of my questions thoroughly and really seemed to care about the company.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Jun 2019", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Autism Society of NC (Greensboro, NC) in Oct 2018", "Interview Descriptions": "The interview process was smooth and very informative. The interview knew what the organization needed and determined whether I was a good match for the position. The HR rep was very upfront and honest about what they needed.", "Interview Questions": "Tell us why you want to work here. "}, {"date": "14 Apr 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Autism Society of NC", "Interview Descriptions": "Met with the Executive Director and current administrative assistant.  They asked good questions and seemed to really enjoy their work.  They described the position in reasonable detail. It sounded like a great job.", "Interview Questions": "I did not encounter any difficult questions."}, {"date": "8 Nov 2017", "title": "Direct Support Staff Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC (Greensboro, NC) in Oct 2017", "Interview Descriptions": "Interviewing went extremely well. This job is all about purpose and though helping others can be extremely rewarding, pay is still necessary and $10 an hour wasn’t going to cut it.", "Interview Questions": "What would you do in this situation?"}], [{"date": "9 Jun 2016", "title": "Residential Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Autism Society of NC", "Interview Descriptions": "I applied for this position online! The administrative assistant got back with me within a few days. The actual interview didn't start until 30 minutes later than the originally scheduled time, which was frustrating to say the least. The interview itself was actually easy, just a few straightforward questions and some good explanations on what the company is all about.", "Interview Questions": "How would your former supervisor describe you?"}, {"date": "11 Aug 2015", "title": "Community Skills Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Autism Society of NC (Greenville, NC)", "Interview Descriptions": "I learned about the company some and the kind of instruction the clients need.  They talked about the areas of skills they are trying to teach their clients.\r\nThey gave me a description of the openings and talked about the best person to \"match\" me with based on the kinds of needs they have and my comfort with different things.\r\nThe interviewer was very friendly and so were the other people that I met in the office when I went in.", "Interview Questions": "A lot of \"what would you do if\" scenarios and about my general knowledge of autism, if I had any experience of what my understanding was"}, {"date": "17 Mar 2015", "title": "Communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Autism Society of NC (Raleigh, NC)", "Interview Descriptions": "Very laid back and informal. I prepared, but I felt like it was more of a conversation about me rather than my knowledge of the non-profit. There was no resume required, but I sent and brought a copy.", "Interview Questions": "How will this internship help with your career?"}, {"date": "1 May 2015", "title": "Hab Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Autism Society of NC (Greensboro, NC) in Mar 2015", "Interview Descriptions": "Phone interview, in person interview, filled out paperwork, and haven't heard from them since. I didn't understand why they didnt ask different questions then initial interview. I gave my history and experience, which qualified me for the job. Still waiting to hear back after paperwork. They only offer partime without any full time  positions in the future, but at least they were honest.", "Interview Questions": "What do you know about company and autism?"}, {"date": "15 Mar 2015", "title": "\"Community Skills Instructor\"/\"CAP Worker\"/\"habilitation Technician\" Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Autism Society of NC (Greenville, NC) in Mar 2015", "Interview Descriptions": "Organized, Met with parents, Staff assisted with the flow of the interview. Families meet the staff and figure out if the staff member should work with their loved one.", "Interview Questions": "What experience do you have with individuals with Autism?"}, {"date": "17 Dec 2014", "title": "\"Community Skills Instructor\"/\"CAP Worker\"/\"habilitation Technician\" Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Autism Society of NC (Raleigh, NC) in Sept 2014", "Interview Descriptions": "The interviewer was nice and laid back. I only had one interview with only one person. I can't remember her name, but she seemed young and was very friendly. Front desk staff was also very friendly and greeted me promptly upon entering.", "Interview Questions": "How would you handle a client that was having a tantrum and started harming him/herself."}, {"date": "24 Jul 2014", "title": "Community Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Autism Society of NC", "Interview Descriptions": "Internal and external posting will be available in the ASNC website and emails sent to current employees.  Opportunities of applying for the job will be available in other sources (i.e., news paper, online posting, etc)", "Interview Questions": "Can you talk about your experience as well as the knowledge about the organization"}, {"date": "23 Jun 2014", "title": "Residential Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Autism Society of NC (Elizabeth City, NC)", "Interview Descriptions": "The interview was good you are made to think it is the best job but it is not. They hire you then give you too many other titles that you are not paid for.", "Interview Questions": "N/A"}, {"date": "21 Mar 2017", "title": "Professional Ninja Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Autism Society of NC (Asheville, NC) in Jun 2014", "Interview Descriptions": "I applied, had an interview with a dedicated social worker, and was hired on at $14.85 an hour. She has since left the company, along with t2 CEOs and 4 other managers I was assigned after, and I took a \"voluntary\" paycut. Now they only offer new hires $8 an hour.  Judging from the last training class, one does not need any skills and abilities to fulfill expectations at ASNC.", "Interview Questions": "What are your interests in supporting individuals on the Autism Spectrum?"}, {"date": "12 Nov 2015", "title": "\"Community Skills Instructor\"/\"CAP Worker\"/\"habilitation Technician\" Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Autism Society of NC (Raleigh, NC) in Oct 2013", "Interview Descriptions": "It was fairly simple, it was one on one. They were very casual and welcoming. It was straight forward and they let me know right then that I got the job.", "Interview Questions": "Do yo have an open schedule?"}], [{"date": "14 Aug 2015", "title": "Community Service Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Autism Society of NC (Raleigh, NC) in Jul 2011", "Interview Descriptions": "Face to Face interview with hiring manager. Discussed my background, interests, and the job details. Fairly basic interview but with a focus on why I was passionate about the job.", "Interview Questions": "Experience in working with or knowledge of Autism"}, {"date": "28 May 2014", "title": "Community Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Autism Society of NC (Fayetteville, NC) in Feb 2011", "Interview Descriptions": "ASNC online application is the first step, phone call, and last 1:1 setting interview with regional director and other managers from the organization.  The applicant with have the opportunity to talk bout previous experiences as they answer questions during the interview.", "Interview Questions": "Tell me what do you know about ASNC"}, {"date": "30 Apr 2015", "title": "Csi Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Autism Society of NC (Fayetteville, NC) in Jan 2011", "Interview Descriptions": "Filled out application.  Interviewed with coordinator.  The process went every well.  The interviewer reviewed my resume asked questions pertaining to my experience and education.  Gave examples of job requirements.", "Interview Questions": "How long have you been in the field\r\nWhat do you know about autism "}]]