[[{"date": "23 Jul 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Cloud State University", "Interview Descriptions": "The process included an application and interview. I had graduated from the same program I applied for a job in so I knew almost all of the faculty and they knew my work ethic and skills already. It was a great school to work for! Very helpful tech department for when I had trouble with tech during lectures (often because of my own lack in skills not the tech itself haha!)", "Interview Questions": "They asked about my teaching philosophy "}, {"date": "25 Feb 2023", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at St. Cloud State University in Aug 2021", "Interview Descriptions": "During the interview, I have been asked a variety of questions related to my skills, work experience, educational background, and personal qualities. It is just the usual average hiring process.", "Interview Questions": "Tell us about yourself and your previous experiences"}, {"date": "31 Mar 2021", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Cloud State University", "Interview Descriptions": "It was very straightforward and excellent. Questions relating to the job and the campus were asked. Your career goals, what you expect from the position and what you can bring to the team are some things that were brought up in the interview. They ask if you have a preference to work in a certain residence hall but your position is randomly selected so I don't know why the bother asking even tbh.", "Interview Questions": "What can you bring into the team if selected? "}, {"date": "13 Mar 2021", "title": "Academic Advising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Cloud State University (Saint Cloud, MN) in Feb 2021", "Interview Descriptions": "Five questions for the first round of interviews. Mainly about diversity and inclusion, advising philosophy and how to improve the orientation process. The interview was a panel of five faculty and staff members.", "Interview Questions": "What is something you would do to improve the orientation process? "}, {"date": "15 Dec 2020", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Cloud State University in Dec 2019", "Interview Descriptions": "Simple and stress-free. This is not always the case with interviews which made it easier to get comfortable during the process and therefore my enjoyable. The conversation flowed and real questions were asked/answered. \r\n\r\nAll and all it was a great experience for interviews in the future.", "Interview Questions": "Why can you help us succeed?"}, {"date": "11 Jun 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Cloud State University (Saint Cloud, MN) in Mar 2019", "Interview Descriptions": "Initial phone interview.  Then day-long on campus interview.  Limited travel budget (pay up front and are reimbursed).  Quite far from major airport.  Interviews with Dean, search committee, and students.  Presentation with all campus invited.  Most of search committee did not attend much of the days activities due to \"conflicts\"?  Search chair seemed disorganized and last-minute.  Students indicated they had just been notified of interview the day before.  Dean was flippant and asked very vague and highly policy-oriented/administrative questions (really did not ask anything about me).", "Interview Questions": "The Dean asked how my research fit with the strategic plan, and cited a strategic plan that hadn't even been written or released to the school yet.  "}, {"date": "9 Jul 2019", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at St. Cloud State University (Saint Cloud, MN) in Jan 2019", "Interview Descriptions": "Awful. The current administration only wants to hire individuals of a racial minority and completely disregards competency. They will fail searches if no minorities apply regardless of competent candidates in the selection pool, and highest level administration is complicit in these discriminatory hiring practices.", "Interview Questions": "They asked mostly about race-related matters and 'social justice' initiatives. "}, {"date": "14 May 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Cloud State University", "Interview Descriptions": "Pretty quick on getting back after applying. Good interview and focused a lot on asking questions directly related to the position. Was contacted directly from the supervisor of the position.", "Interview Questions": "Name a time where you had a conflict with another person. How did you get it resolved? Can you provide an example?"}, {"date": "15 May 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Cloud State University in Apr 2017", "Interview Descriptions": "Applied online. Got back within a day from the office manager. Came in for the interview.  The interview had a good vibe. It was basically just having conversations about how to operate daily work, multi-tasks, and stuff.", "Interview Questions": "How do you handle students with diverse backgrounds? "}, {"date": "19 Nov 2015", "title": "Programing and Outreach Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at St. Cloud State University (Saint Cloud, MN)", "Interview Descriptions": "Sent in my resume via email. Was aked to come in for interview. Went in and sat with the three higher ups and a graduate assistant. Told them about my passion to work there and on the issues they dealt with and they loved to hear that. They were fairly relaxed but also professional. Told me it was a casual atmosphere so I wouldn't have to worry about buying a new wardrobe of professional clothing. Explained what they did and each took turn asking questions.", "Interview Questions": "Why do you want to work here?"}], [{"date": "5 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Cloud State University in Jun 2015", "Interview Descriptions": "I applied for the Graduate Assistantship online. I did not have to take any interview for the job position. However, the job position in itself is very competitive and requires you to be very proficient.", "Interview Questions": "Would you be willing to work with us?"}, {"date": "25 Oct 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 8 weeks. I interviewed at St. Cloud State University (New York, NY) in Mar 2015", "Interview Descriptions": "I applied and got an interview the following week. I interviews with the director of the program, supervisor and the person that had the position at the moment. Everybody was extremely friendly and were genuinely interested in getting to know me.", "Interview Questions": "They wanted me to share my work experience with them and was that applicable to this position."}, {"date": "29 Jan 2017", "title": "Building Manager of Atwood Memorial Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at St. Cloud State University (Saint Cloud, MN) in Jan 2015", "Interview Descriptions": "Online or in person application. First round is a panel interview with current Building Managers and the Assistant Director of Atwood Memorial Center, where they ask you about direct work tasks and activities, and how you would handle certain situations. Second round is an interview with both the Assistant Director and Director of Atwood Memorial Center, where they ask you more personality based questions and your knowledge of Atwood Memorial Center.", "Interview Questions": "What is your background with working with and/or for a diverse community?"}, {"date": "15 Apr 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Cloud State University (Saint Cloud, MN) in Aug 2014", "Interview Descriptions": "Interview was very casual. Mostly wanted to see if I knew what I was talking about and had any familiarity with the requirements. A lot of the marketing is Social Media and Events.", "Interview Questions": "Are you a self-starter? "}, {"date": "19 Sept 2018", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Cloud State University in May 2014", "Interview Descriptions": "They really just want to get to know you.  The full time staff was full of great people, and wanted nothing but the best for employees and the University.", "Interview Questions": "What are your strengths?"}, {"date": "20 Feb 2014", "title": "Data Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at St. Cloud State University", "Interview Descriptions": "An open job interview is an interview for employment where companies accept job applications during a ranges of times when all applicants who are interested in applying can attend. The company conducts on-the-spot interviews rather than scheduling individual interview appointments with candidates. If the company advertises open interviews, this will be the first step in the interview process.", "Interview Questions": "No unexpected questions, very general "}, {"date": "6 Oct 2017", "title": "AV Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at St. Cloud State University (Saint Cloud, MN) in Aug 2013", "Interview Descriptions": "Sit down interview, simple, want to get to know you previous work, how you interact with all types of folks. Working under stress. attention to words words words words words words words thirty words on hiring and interview process", "Interview Questions": "Do you have any experience?"}, {"date": "24 Feb 2016", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at St. Cloud State University (Minneapolis, MN) in Jan 2013", "Interview Descriptions": "Talk to the director for 30 mins, and got it the next day, it is a very short phone call, very easy and very good people. not know what to say, it is very easy, not a lot questions. very short ,very short", "Interview Questions": "Just basic statistical questions"}, {"date": "21 May 2013", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Cloud State University (Saint Cloud, MN) in Jan 2013", "Interview Descriptions": "I applied for the Job. Few days later, the supervisors called me to scheduled an interview, which I did. The interview was 30 minutes long. After, three days, I was offered the job.", "Interview Questions": "There was no difficult questions because I am familiar with the field."}, {"date": "24 Oct 2016", "title": "Adjunct Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at St. Cloud State University (Saint Cloud, MN) in Jan 2013", "Interview Descriptions": "The interview process was very simple and somewhat non existent. Shawn, the assistant director to the multicultural student services department on campus, selects high performing students to work in the center and encourage the academic focus that is expected within the center. In addition, Shawn asks that for classes having done well in, an individual tutors for that course.", "Interview Questions": "How will you hold your peers accountable? "}]]