[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A Nearly Fantastic Place to Work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jan 2017", "job_title": "Learning Assistant in Dudley, England", "duration": "N/A", "pros": "A truly unique place to work, a place which feels both a true museum with the real Edwardian/Victorian buildings set out with real objects from the collections but also a fun attraction for families to visit and seeing the enjoyment the public and schools have visiting the site and enjoying what it has to offer never gets old.\r\nAll the staff are very friendly and supportive, both in management and front of house. Management are very understanding when it comes to availability to work whatever your situation, and the front of house staff are incredibly knowledgeable are always willing to share their knowledge to help you out as well as do whatever they can to enhance the public and school groups experience at the museum. I thoroughly enjoy working with everyone at the museum and had very few problems with any members of staff.", "cons": "Communication between management and front of house could be better as front of house staff are not always told about certain changes and this can lead to confusion between staff. Also the right training is not always given to front house staff meaning that there can be a lot of confusion for staff when they just placed in a role which they are pretty much completely unknown to. \r\nLastly there is very little opportunities for staff to advance into more full time roles at the museum. As someone who is looking for a proper full time career in the heritage sector there have been few opportunities at the museum for me to try and advance my career so much so I am looking else where now to do so as though I am reluctant to leave the museum if I have to than I will have to."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Could have been the job of a lifetime", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Mar 2022", "job_title": "Anonymous Employee in Dudley, England", "duration": "N/A", "pros": "Unique environment with a range of different occupations.\r\n\r\nOutside of my own department, staff are absolutely wonderful.\r\n\r\nDecent salary, however I know fellow colleagues salary was not decent at all.\r\n\r\nGood holiday allowance.\r\n\r\nFree tickets, including ticket swap with other attractions.\r\n\r\nEncourage work life balance.", "cons": "Unfortunately I suffered with workplace bullying. There are avenues of support for this issue however I knew it would only have a negative effect. Resulting in my resignation.\r\n\r\nManagement & organisation.\r\n\r\nTurnover of staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not as much fun as you'd imagine.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Mar 2021", "job_title": "Behind the Scenes in Dudley, England", "duration": "N/A", "pros": "There are some great, hardworking people there, who really put their hearts and souls into everything they do\r\n\r\nInteresting working environment, every single day is different\r\n\r\n12 free tickets a year\r\n\r\nFun helping out with big events\r\n\r\nGreat seeing visitors having an amazing time, and knowing you helped to make that happen\r\n\r\nGreat fish and chips, and discount in the gift shop\r\n\r\nOccasional opportunities to learn new, unusual things. Not much career progression on the inside, but valuable skills to take away to new roles elsewhere.", "cons": "Terrible workplace bullying, and toxic working environment which seems to reach from the very bottom to almost the very top. \r\n\r\nHigh turnover in certain roles, which doesn't help working relationships or help productivity. They have an entire restructure once every two years on average. Not exactly a sign of a healthy or effective workplace. \r\n\r\nStaff are (unofficially) expected to pay for whatever it is they need to do their jobs. The dressed-up staff are expected to supply most of their costumes, for instance. If you do request whatever, it's so unlikely you're going to get it, you generally get online and order it at your own expense. \r\n\r\nHealth and Safety could do with serious improvement in many areas\r\n\r\nCertain amount of nepotism in some departments, and favouritism in others, especially when it comes to handing out shifts. Fixed term contracts were becoming standard when I left, and most FOH roles are zero-hours, so it can be difficult to make ends meet or plan ahead financially. \r\n\r\nIf you don't fully support the Supreme Leader, no matter how good you are at your job, they will get you out by whatever means. Some walk out, sometimes without another job to go to, others they cook up phoney redundancies for. Ironically this has resulted in them forcing out all their best staff, whilst the feckless, useless and lazy are still there drawing a salary.\r\n\r\nBig events sometimes means you're there till midnight, with an early start the next day. The pressure on all departments, front of house and behind the scenes, is crazy in the run up to events, and staffing often inadequate."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Perfect employment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 May 2020", "job_title": "CAR PARK ATTENDANT in Dudley, England", "duration": "N/A", "pros": "Great friendly staff, easy to get on with management, great to learn more no matter how much you think you already know, a fair wage, reasonable amount of work hours.", "cons": "Certain management need to learn how to treat employees correctly.\r\nLack of management to employee communication. CEO needs to get of his high horse and actually realise that he doesn't actually know everything and us staff can be of great use with knowledge of our employment roles."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "worth it", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Sept 2020", "job_title": "Christmas Customer Assistant in Tipton, England", "duration": "N/A", "pros": "it was good learning about the museum and helping people out", "cons": "you will ho long hours with no or little breaks"}], []]