[[{"date": "5 Jan 2023", "title": "Supply Chain Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "Recruiter interview was quick and easy. I had an interview with the hiring manager the next day. The next interview will be held via Zoom. I'm looking forward to it.", "Interview Questions": "What are your salary expectations?"}, {"date": "19 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "Zoom interview during Covid times, with manager, another nurse leader and the nurse educator. In my experience Zoom interactions tend to be less stressful. I did feel confident at the end of the interview and got an offer within days.", "Interview Questions": "What do you think will be your biggest challenge if offered the position?"}, {"date": "16 Dec 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL) in Oct 2022", "Interview Descriptions": "Interview was easy and comfortable. Employer was very kind and professional. The experience was overall one of the best interviews I have had to date. I had a really great first impression on the overall facility based on the unit I interviewed for.", "Interview Questions": "Tell me about your experience? What is a difficult situation you faced and how did you resolve it? What do you do when you have an altercation with a coworker?"}, {"date": "2 May 2022", "title": "Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "it was quick and I wasn't expecting them to be so quick they called me for an interview not even 2 weeks after applying. I was surprised the managers were really nice", "Interview Questions": "they asked for my work history"}, {"date": "3 Aug 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital in May 2022", "Interview Descriptions": "First was a phone screening with HR about my background and work experience. Then a 30 minute interview. Then HR called with more info about the position and an offer.", "Interview Questions": "Name one time you make a mistake"}, {"date": "3 Aug 2021", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "Online application, Zoom interview requested, offer if employment, accepted offer, online employee forms got background check, reference check, setting up appointment with employee health, direct deposit forms. The process was easy", "Interview Questions": "What is your favorite part of your last position?"}, {"date": "2 Jun 2021", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "Contacted by manager to schedule interview. Had a phone interview, then a zoom meeting with the team. Once position was offered met with HR rep to discuss start date, on boarding process and salary.", "Interview Questions": "Why I can bring to the team?"}, {"date": "21 Apr 2021", "title": "Social Worker PRN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital in Apr 2021", "Interview Descriptions": "Basic interview process but I immediately got the vibe from the director that she was not looking to hire me as she opened the conversation saying there were tons of applicants (for a position posted for months mind you) and that 1 of the 2 positions for this had been filled. It was a 4 part interview where I met with 2 LCSWS each time over TEAMS and they all asked me verbatim the same question. It took the entire day and not 10 minutes later I got a rejection email.", "Interview Questions": "Experience so far in your internships"}, {"date": "9 Feb 2021", "title": "Midlevel Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "Really fake process. They know in advance they do not want to hire you. They do waste your time and do not care about your credentials. They are  discriminating toward immigrants and older workers. Beware.", "Interview Questions": "many useless questions were asked that have nothing to do with your job performance "}, {"date": "27 Apr 2021", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg Beach, FL) in Feb 2021", "Interview Descriptions": "30 minute Zoom meeting where the first half is the interviewer asking questions and the second is the interviewee asking questions. The job description is given at the beginning with details about day to day job roles.", "Interview Questions": "What is a time in your life where you were proud of what you were doing?"}], [{"date": "21 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "Interview with manager and educators, asked about projects from my bachelors degree, interest in particular unit, strengths and weaknesses, etc.  Very personable and comfortable . The interview was only about 15 minutes", "Interview Questions": "Why do you want to work at All Children’s?"}, {"date": "17 Apr 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Johns Hopkins All Children’s Hospital", "Interview Descriptions": "I submitted an application and received an email to setup a phone interview less than 2 weeks later. Had a phone interview with Director. After asking explicitly if I would be notified if I made it to in-person interview or not I was assured that \"yes, absolutely\" I would be contacted one way or another within 2 weeks.  I was not contacted.", "Interview Questions": "Tell me about yourself. Describe your significant work achievements. Describe how you've worked with physicians to get their buy-in. Describe a challenging situation at work and how you dealt with it. "}, {"date": "30 Jun 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg Beach, FL) in Jun 2017", "Interview Descriptions": "I had an inside connection so they already knew of me. However, the interview went as regular interviews proceed. First I applied, received a phone interview than met in person. The questions on the phone were general (tell me about yourself, strength/weaknesses/etc). The questions in person were situational, and deeper in the general questions.", "Interview Questions": "Tell me about yourself \r\nStrengths/ Weaknesses"}, {"date": "30 Mar 2017", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL)", "Interview Descriptions": "It took 4 hours of interviews with 3 different managers, very lengthy and redundant questions. Give examples of how you handled difficult situations. How have you been a team player etc.", "Interview Questions": "How are you a team player? Give examples of how you handled a difficult situation or person. Etc etc etc etc"}, {"date": "4 Feb 2019", "title": "Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL) in Feb 2017", "Interview Descriptions": "The process can take quite a while, with a 4-month period between first submitting the online application and the start date.  There was an online quiz to take along with submitting the application.  I was contacted for my first interview over a month after submitting the application, and received my offer one month after that.", "Interview Questions": "Why are you looking to work here?"}, {"date": "30 Nov 2016", "title": "Newborn Hearing Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Johns Hopkins All Children’s Hospital (New York, NY)", "Interview Descriptions": "Met at hospital and asked questions about career choice, future ambitions, and told what the position required. Manager was really clear on the expectations including the need to be available. Awesome interview experience.", "Interview Questions": "Appropriate questions asked, mostly focused on availability to work per diem "}, {"date": "4 Nov 2016", "title": "Accountant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL) in Jun 2016", "Interview Descriptions": "I applied online. Then, HR contacted me to have a face to face interview. After that, it took two months to inform me I was not considered. The hiring process at this place is super slow, so keep applying to other place until there is an offer.", "Interview Questions": "Typical interview questions"}, {"date": "14 Nov 2016", "title": "Secretary III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL) in Jan 2016", "Interview Descriptions": "I applied online.They took a very long time to call me to set up a one on one interview. Then, the recruiter contacted me with an offer. Once you get the offer, the process was faster. Just have patience.", "Interview Questions": "General interview questions and about previous work experience."}, {"date": "28 Oct 2015", "title": "Child Life Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL) in Jul 2015", "Interview Descriptions": "The interview was setup by a secretary. I was interviewed by two people. One asked experience related questions and the other asked hypothetical, personality type questions. I was told they had 3 weeks of interviews to go through and then they would narrow down the candidates for a second round of interviews. The interview lasted about 30 minutes.", "Interview Questions": "What is one thing you don't want us to know?"}, {"date": "8 Sept 2012", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Johns Hopkins All Children’s Hospital (Saint Petersburg, FL)", "Interview Descriptions": "Initial Phone Interview with Hiring Manager of the MIS Department - \r\nGeneral Review of Qualifications Based on Resume' \r\n\r\nOnsite Panel Interview with Clinical and Non-Clinical Systems Analysts\r\nOnsite Panel Interview with Director and 4 Managers of the MIS Department\r\nInterview with Project Sponsor\r\n\r\nSubsequent callback to interview with HR - Then offer made about a week later where within 24 hours was required to come to All Children's for a Drug Test otherwise offer was null/void.\r\n\r\nIn addition, during your orientation, you are required to have a Turberculosis screening test (needle skin prick test-ACH provides this by their nursing staff free of charge, you line up and take it) and must have one subsequently every year thereafter during your annual review.", "Interview Questions": "Don't really remember Difficult or Unexpected Questions other than this type of position was more geared to finding the best existing software product on the market to implement into their environment vs. having an in-house software team build custom applications.  So definitely know the pitfalls and advantages of each and whether you can work in this type of environment."}], [{"date": "31 Mar 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Johns Hopkins All Children’s Hospital in Feb 2011", "Interview Descriptions": "Very personal, relaxed and simple, but I did not get the job offer at first. Eventually a month later I did get hired.  When I was hired they were very quick about getting me into classes and hoping me finish the long process", "Interview Questions": "Tell me about your qualifications"}, {"date": "21 Jul 2013", "title": "Office Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Johns Hopkins All Children’s Hospital (Saint Pete, FL) in May 2010", "Interview Descriptions": "Overall was good.", "Interview Questions": "N/A"}]]