[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst professional experience of my entire life. And I came from the Defence Sector. Avoid.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Feb 2018", "job_title": "GLOBAL COMMUNICATIONS DIRECTOR in London, England", "duration": "N/A", "pros": "The only conceivable reason to work here is a love of animals and a desire to do some good for them. Also, everyone runs for the door at 5pm, so I suppose work-life balance is possible. If you don't mind being severely mistreated from 9-5...", "cons": "Never - in my entire professional life, which has seen me lead global functions for major international organisations, SMEs, not-for-profits, and start-ups on two different continents - have I had a worse experience than the one I had at ADI. \r\n\r\nThe cons are too numerous to detail here. Senior leadership in this organisation micromanage every single aspect of the work that is done. Neither questions nor suggestions are welcomed, and leadership contradict themselves constantly, leaving the team in a constant state of confusion, frustration and/or fear. It is an unfriendly, hostile environment, and I have genuinely never experienced such a terribly run organisation, or been treated worse, by any employer in my life. What an absolute shame. \r\n\r\nI hung in for as long as I could, managing to open up a few new opportunities for them in my first few weeks, and to tick off several items on my \"priorities list\", despite being told that they were too busy to answer my questions, having my integrity questioned (incorrectly, rudely and with several members of staff in copy), and generally having doors slammed in my face at every single turn. And then - on the very day I announced a couple of fairly significant wins, including some major brand exposure and a new celebrity endorsement - I was let go. With no warning and no reason given, aside from \"not gelling\" (which was difficult to believe, considering the responses from my team and a few other key staff members when they learned I was let go). The person(s) who hired me didn't even pay me the courtesy of doing it themselves, but sent the office manager to do it for them. They hadn't set foot in the building for more than a week, so how they knew I was \"not gelling\" is beyond me. \r\n\r\nI will not comment on the issues of the other staff members in the building, as I fear repercussions for them, but suffice it to say the working environment is completely toxic and the staff are NOT happy. They stay because of the animals, *despite* the way they are treated.  What a terrible terrible thing to witness. I'm still in shock."}], []]