[[{"date": "31 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Barbara Ann Karmanos Cancer Institute", "Interview Descriptions": "There was a lot of explaining the position and how the factuality runs. No real questions about what you can bring to the team or usual interview type questions. The interviewer was very thorough.", "Interview Questions": "Tell me a little about yourself"}, {"date": "16 Mar 2021", "title": "Ambulatory Care Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Barbara Ann Karmanos Cancer Institute", "Interview Descriptions": "The interview process was easy. They ask you the basic interview questions. There was a heavy emphasis on teamwork and being a self-starter. They were kind, and the interview was laidback.", "Interview Questions": "Do you work better as a team or individually?"}, {"date": "30 May 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Barbara Ann Karmanos Cancer Institute", "Interview Descriptions": "I was a student in the office at the time and  Transitioning into a study coordinator role.  Interviewed by the physician, manager and executive director. The process was smooth and easy due to nature of the current role in the office", "Interview Questions": "N/A"}, {"date": "15 Oct 2018", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI)", "Interview Descriptions": "Got a call from a recruiter initially within a week of applying. Interviewed, then got a call back within a week of interviewing to offer 30% less in salary for a different position they have open.", "Interview Questions": "How do you handle conflict?\nWhat is your greatest achievement to date and why?"}, {"date": "2 Jan 2020", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Sept 2018", "Interview Descriptions": "Pretty easy and laid back. Some standard interview questions, but I found the process comfortable and natural. I had to interview on two separate days only because one of the individuals was out sick the day I was scheduled. I was able to negotiate.", "Interview Questions": "Best personal and professional achievement"}, {"date": "5 Dec 2019", "title": "Oncology Care Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Aug 2017", "Interview Descriptions": "You will have an interview with the floor manager and if he/she sees that your experience will be a benefit to the floor, you will most likely get the job.", "Interview Questions": "How did your previous job prepare you for this job?"}, {"date": "6 Nov 2021", "title": "Radiologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Jan 2017", "Interview Descriptions": "i was interviewed by a crazy lady who happens to be a breast radiologist at Karmanos....this was 10 years ago.....is this enough words for the min? I guesss not....I will keep talking for a few more minutes for this web site", "Interview Questions": "they asked me if i wanted to make money"}, {"date": "13 Nov 2016", "title": "Cancer Pathology Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI)", "Interview Descriptions": "The interview process was concise and thorough with questions that were geared towards pathology.  They seemed to really care about the candidates motives and made sure that the work was geared towards a greater good and not to be just another job.", "Interview Questions": "Why are you interested in Cancer Pathology"}, {"date": "25 Mar 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Nov 2016", "Interview Descriptions": "Phone screening, met with 2 managers for the role I actually wanted, then was asked to interview with 3 managers for another department that I didn't apply for, finally a 1 hour job shadow session and interview with director. They offer pennies for the amount of work they expect. When asked where you see yourself in 5 years, be sure to say \"staying in this position\"...I was told that I was deferred for my ambitious response.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "4 May 2016", "title": "Technologist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Apr 2016", "Interview Descriptions": "Short and never asked any real questions about my job experience. It was very awkward and silent most of the time. I interviewed with someone that is not a Mammography Technologist. It was not a normal interview process.", "Interview Questions": "How soon can you start?"}], [{"date": "21 Mar 2016", "title": "Patient Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Barbara Ann Karmanos Cancer Institute", "Interview Descriptions": "Volunteer position transporting and directing patients and families to the outpatient lab, infusion center, and clinic areas. Interview was over the phone and was relatively brief. This experience is highly recommended for anyone going into the healthcare field. After speaking on the phone, the next step was 2 day orientation that involved HIPPA training, thorough tour of the facilities, mock interactions, etc.", "Interview Questions": "Why do you want to volunteer for Karmanos?"}, {"date": "9 Apr 2016", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Feb 2016", "Interview Descriptions": "The managers were very nice and welcoming. Laid back and easy interview. More of a conversation between everyone. Basic questions about your background and some behavioral type of questions. Lasted about 1 hr.", "Interview Questions": "How do you cope with stress"}, {"date": "15 Sept 2014", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Aug 2014", "Interview Descriptions": "their recruiter called me within 10 days after online application. I was told to reschedule the interview  three times because the manager was unavailable. Interview went well but manager seemed to be rushing in the middle of the interview. Also, seemed uninterested.", "Interview Questions": "basic interview questions"}, {"date": "5 Aug 2015", "title": "Revenu Support Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in May 2014", "Interview Descriptions": "In person interview with management. They wanted to know about my past experience and how it would help me in this position. If I was looking for a position with growth opportunity and how long I plan on staying in this position if chose.", "Interview Questions": "Why are you seeking employment with our company?"}, {"date": "27 Jul 2015", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Barbara Ann Karmanos Cancer Institute (Detroit, MI) in Dec 2011", "Interview Descriptions": "Hiring process was not difficult, Interview questions were easy too. I was actually volunteering at the place so the director new me. It was basically internal hiring. Interviewd with the director than after about 2 months the HR person called and gave me an offer.", "Interview Questions": "Dont remember the interview questions exactly but all the questions were easy"}]]