[[{"date": "7 Jul 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Family Health Centers of San Diego (San Diego, CA)", "Interview Descriptions": "I had a panel interview on zoom with supervisors from the various locations. It was my first time have a zoom interview such as this, I had to go to the corporate office and do a \"typing\" test, which wasn't WPM but more of a test to make sure you were entering patient information in the correct areas. The interview wasn't bad, however I did take time to prepare by researching the company and going over basic questions that are asked in an interview so I had answers prepared.", "Interview Questions": "What has been your greatest achievements?"}, {"date": "15 May 2023", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Apr 2023", "Interview Descriptions": "I took a clinical skills test and was first interviewed by the Director of Nursing. Then I was interviewed by a panel of staff from different clinic locations. They described the open positions at each of their sites and what they are looking for.", "Interview Questions": "Q: Why are you interested in a position at family health centers? Q: How would your current supervisor rate your attendance? Q: What do you think your greatest area of improvement is? Q: How would your friends describe you?"}, {"date": "1 May 2023", "title": "Clinic Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Apr 2023", "Interview Descriptions": "Internal promotion, several steps involved and they were pretty smooth. Negotiations was a little confusing bc I was expecting HR to contact me about compensation. Negations was with the present and vp.", "Interview Questions": "Leadership experience and managing team with conflict?"}, {"date": "18 Dec 2022", "title": "Health Educator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Interview went well, I rated this as a negative experience because I did not receive a follow-up about when my second interview would be scheduled for and when I called to follow-up they stated \"I got the job\" then when I tried to negotiate my salary they ghosted me.", "Interview Questions": "Why did you apply for this position?"}, {"date": "13 Apr 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Interview was with research coordinator. Went smoothly and questions were very basic and standard . It was about 15-30 minutes long and very engaging. Found results out at the end", "Interview Questions": "1. Describe yourself\r\n2. What is your biggest strength and your biggest weakness"}, {"date": "13 Jan 2022", "title": "Social Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "the interview process was quick and pleasant. the interviewer was friendly and communicated well. the company got back with an offer fairly quickly. I was happy with the whole process.", "Interview Questions": "1) Tell me about yourself? "}, {"date": "5 Mar 2021", "title": "Dietary Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Phone interview with Recruiter which takes about twenty to thirty minutes and then in person interview by emailing you your availability. Then you would have to wait another couple weeks to get back to you and see if you got the job.", "Interview Questions": "Q: Why did you apply to our company?"}, {"date": "16 Feb 2021", "title": "Community Health Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "I was contacted for a phone interview regarding their Community Health Specialist position. During the interview, I was informed that the interviewer would be taking notes on my answers and discussing with the hiring managers, and that she would get back to me the following week. I waited over a week to send a follow-up (outside of a courtesy thank you email) and never received a response. A month or so later, I received an automated rejection email. My interest in the job dropped when I learned that the pay was prohibitively low, but I would have appreciated the communication that I had specifically been promised.", "Interview Questions": "Are you comfortable going out into the community and interacting with the homeless population?"}, {"date": "9 Feb 2021", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Zoom interview with 2 supervisors from the IT team. Room for growth as they were recently promoted to a manager role about a year ago. Good random question thrown in the middle of another to test skills under pressure.", "Interview Questions": "How does your experience qualify you for this job role?"}, {"date": "19 Jan 2021", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Straight forward, met with the finance team and everyone I'll be involved with.  They asked questions regarding my experience and work ethic. And at the same time gave me a chance to ask them any questions I had.", "Interview Questions": "Please tell me about your last project?"}], [{"date": "25 Sept 2020", "title": "Family Health Centers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Very straightforward, regular interview with three interviews before I heard their decision and was given an offer. everyone was friendly and good to talk to. I asked a number of questions too, seems like a good company that wants to help.", "Interview Questions": "experience, what is my current position, and about the job I would do"}, {"date": "21 Feb 2020", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Family Health Centers of San Diego (San Diego, CA)", "Interview Descriptions": "Panel interview with director, direct manager, and colleague. I completed two interviews for this position. Interview had all the basic questions with emphasis and working with various populations. Prepare with scenario based questions too.", "Interview Questions": "Bilingual and had to speak in Spanish to prove fluency."}, {"date": "25 Jun 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Family Health Centers of San Diego (San Diego, CA)", "Interview Descriptions": "I applied online on the company's website and received a phone interview from a recruiter the next day. Four days later, I had an in- person panel interview with multiple managers.", "Interview Questions": "Tell me about a time when you had to deal with a challenging manager or superior."}, {"date": "25 Jul 2019", "title": "Eligibility Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Jul 2018", "Interview Descriptions": "Interview process was pretty straight forward. I had one interview with supervisors, they were very receptive. HR recruiters were very nice and helpful, which made me very interested in the job. I was given a job offer within a week.", "Interview Questions": "What work experience do you possess?"}, {"date": "1 Dec 2017", "title": "Community Health Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Oct 2017", "Interview Descriptions": "Applied online, got a call a week later to schedule an interview which had to be rescheduled because they changed HR people and seem to have mixed many things up.  Interview itself went well met with two managers/directors that asked a lot about my experience with specific demographics and interpersonal skills.  Interview itself lasted about 45-50 minutes, they seemed engaged an interested. I ended not getting the position since I received zero follow up and no answers to emails I left.  I wish they would just give a simple no instead of leaving you in the dark, especially after I reached out for comment/feedback.", "Interview Questions": "How well are you with dealing with working with difficult patients?"}, {"date": "18 Jan 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Oct 2017", "Interview Descriptions": "I applied online, and I did a brief phone interview. Two weeks later, I was asked to come into a formal interview. The process was easy, and my interviewers were very nice. They asked basic questions, and were very friendly. They do care about community and serving the underserved.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "11 Aug 2016", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Jun 2016", "Interview Descriptions": "A phone interview followed by a 1 on 1 interview. The phone interview was a panel conference call.  I was taken to see one of the clinics at the in person interview. Overall, the questions were relaxed and let you tell them about yourself without the stress of question after question.", "Interview Questions": "How did you handle a difficult employee?"}, {"date": "16 Jun 2016", "title": "Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Jun 2016", "Interview Descriptions": "Applied online and had a recruiter call me to schedule a phone interview with the hiring manager after about 4 weeks. The phone call was scheduled a whole week later, then met in person a week after that. The phone call was pretty typical asking my previous pay and reasons for leaving. The onsite interview was only 30 minutes and they didn't ask very many questions so I think they just wanted to see me in person to see if I would fit in with the rest of the young recruiters. They have this position posted quite often and weren't able to give me good answers where the previous recruiters went or why.", "Interview Questions": "What kinds of ATS have you used?"}, {"date": "21 Apr 2016", "title": "Allied Health Provider Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Consisted of telephone screening by in house recruiter, then 1st round panel interview, followed by 2nd panel interview then telephone offer by HR department. Overall, 2-3 week process.\r\nInterview process was relatively straightforward with pre-set questions asked. No open ended questions asked. Met with all upper management regional persons. Various personality styles.", "Interview Questions": "Case study - application questions based on previous clinical experience."}, {"date": "18 May 2017", "title": "Charge Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Mar 2016", "Interview Descriptions": "Panel interview  if they like you then one of the hiring clinics will present with an offer and from there you have a 1 month training process. If you lack outpatient clinic skills they will guide you you.", "Interview Questions": "A lot of skill based questions with and they ask for past experiences "}], [{"date": "22 Feb 2016", "title": "Health Care Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "Submitted resume online. Received call for interview. Met with two department managers/supervisors for an interview. We went over my resume then I was asked a series of prepared questions. The two individuals took turns asking me questions. After we went through their list of questions, I was allowed to ask any questions I had about the job.", "Interview Questions": "I was asked about my previous experience and how it relates to current position,"}, {"date": "17 Jan 2017", "title": "Senior Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Dec 2015", "Interview Descriptions": "I was called after applying for an opportunity, the Talent Manager called me back & we had a nice conversation and I was invited in for an in person interview. Overall the interview itself was pretty mundane and both of the interviewers seemed bored and not engaging. About 10 mins into it, I realized myself I was not that interested in the opportunity. However, being a Recruiting and really valuing the candidate experience and I constantly work to improve it for my own candidates, I leave every interview with take aways. My take away....this place needs some help when it comes to interviews and the candidate experience. WOW. So it has now been a month since I interviewed, no follow up, no call back to let me know what is going on, what the status of my candidacy is, nothing......zero FOLLOW UP. Not even a dear john, thank you for interviewing email. NOTHING. The position has now been reposted. Good luck if you interview with this group, and I hope they find someone who can rise the candidate experience out of the basement.", "Interview Questions": "N/A"}, {"date": "7 Jul 2016", "title": "Ophthalmic Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Mar 2015", "Interview Descriptions": "Interview was very easy and professional.  Made me feel very comfortable and wasn't nervous at all.  Interview took about 30 minutes and was conducted by the Doctor and supervisor.  Showed me the department I would be working at and showed me the equipment we would be using.", "Interview Questions": "They asked me about different types of materials for lenses.  \r\n"}, {"date": "14 Apr 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Family Health Centers of San Diego in Feb 2015", "Interview Descriptions": "A group interview was conducted with five applicants (including myself) along with a director and manager.  The director mentioned the reasons why they are doing the group interview was it would be easier for the company to select those that would move on to a second interview.", "Interview Questions": "What is one word to describe you?"}, {"date": "29 Sept 2014", "title": "Human Resource Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Family Health Centers of San Diego", "Interview Descriptions": "It took about two weeks for the process to be done. One phone interview, very simple mainly about your resume. Then two in person interviews with the HR manager, Recruiter and possibly another HR member.A lot of behavioral questions. It took me about an hour per interview, it can get confusing because ou have three people asking you questions and you don't know who to look at.", "Interview Questions": "N/A"}, {"date": "1 Oct 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Sept 2014", "Interview Descriptions": "Submitted an online application/resume.  Got a call back from the HR recruiter a week later on Friday. Had an initial phone interview with the HR recruiter the following  Monday. Got an email back from the recruiter  to come in the following  Wednesday to complete a pre-employment assessments and to meet the hiring manager as well.  The assessment will access  your Microsoft Office (excel, word, outlook mail) , typing ( 3 minutes typing test) , spelling, grammar and punctuation skills. The assessment was  around 60 minutes. Each section had roughly 10-15 questions. You will receive a score after you got done with each section. \nI met with two hiring managers after I got done with the assessment.  The interview lasted around an hours. \nReceived an email back from the HR recruiter after nearly 3 weeks of waiting informing me that the hiring manager has decided to move forward with candidates whose skills and background experiences are more closely aligned with the position requirements. \n\n ", "Interview Questions": "Just the usual typical interview questions. Why do you want to work here? What do you know about the company? Ask you about your qualifications and experience. Pretty easy questions."}, {"date": "23 Jul 2014", "title": "Pharmacy Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Apr 2014", "Interview Descriptions": "It was a fairly easy interview. Mainly situational questions like \" Tell me about a time when you were in a problem where...\" I prepared in advance so it wasn't that challenging for me. There were 2 women interviewing me. My only problem was making eye contact with both of them throughout the whole interview. They scored your answers on a piece of paper as you were speaking. I thought I initially wasn't goin to get an offer because when I followed up after my interview; they said they were going to hire an internal candidate. Therefore, they were just waiting to interview her and hire her. As it turned out, she got an offer from another organization so I was the runner up. It was about a two month process. After getting the call that I got the job, the hiring process took only about two weeks.", "Interview Questions": "No difficult questions"}, {"date": "15 Nov 2015", "title": "Therapist, Marriage and Family Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Family Health Centers of San Diego (San Diego, CA) in Jan 2014", "Interview Descriptions": "I applied online on their website, went through a screening over the phone with someone working in Human Resources which was fairly short, then attended an in person interview and met with around two to three current employees at the organization phone", "Interview Questions": "Strengths and weaknesses"}, {"date": "14 Jan 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Family Health Centers of San Diego in Nov 2013", "Interview Descriptions": "The process took about 2 weeks. I was interviewed at Gateway which is their Administrative office by 4 other clinic directors at the same time. They were hiring for multiple clinics and so it was easier for them to interview multiple candidates that way. After the interview, I was contacted by the clinic director who wanted to hire me and asked if I was willing to accept the offer for that specific location. The interview questions where not hard, it was just intimidating to have so many people asking you questions at the same time and all paying attention to everything you say.", "Interview Questions": "Tell me about a time you had a disagreement with a co-worker, how did you handle it. Give me specific examples on how to diffuse a situation. "}, {"date": "16 Nov 2016", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Family Health Centers of San Diego (San Diego, CA) in May 2012", "Interview Descriptions": "I applied on line then I received a call from Human Resources for a phone interview, then they called me to continue with the paperwork hiring process, then I have a second interview with a panel of two people in English and in Spanish, then after a few days I was called to received the positive response that I was welcome to join the team of the company. I was sent to a complete very helpful training in regards of the mission and rules of the agency and since then I am happy doing the best in my job.", "Interview Questions": "How did you manage a patient in need of immediate mental health?"}]]