[[{"date": "3 Jul 2023", "title": "Audio Visual (AV) Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in May 2023", "Interview Descriptions": "I thought it was a very good, honest, truthful conversation. The interviewers were very reassuring that the conversation should be as relaxed as possible. Easy location to find. No discussion about salary though.", "Interview Questions": "Tell us what your colleagues would say about you. What separates you from the rest. Whats your background."}, {"date": "8 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Apr 2023", "Interview Descriptions": "The interview process was very straight forward. They gave 7 days notice for the interview and listed the panel. They were very slow to confirm afterwards if accepted or not.", "Interview Questions": "Why I applied for the position?"}, {"date": "4 May 2023", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Dec 2022", "Interview Descriptions": "Online interview with hiring manager, another manager and hr representative. Lasted roughly 45 minutes over a Microsoft teams call. Explained the role to me and then went into standard interview questions", "Interview Questions": "What experience I had that was relatable"}, {"date": "16 Sept 2021", "title": "Digital Marketing Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Aug 2021", "Interview Descriptions": "I had my online application answered and a request for a video interview that I recorded and sent to the company. \n\nIt took them around 3 weeks to get back to me scheduling an interview and after this interview with 3 people in the team (director, manager and another executive) it took more than a month to receive an answer even after I had sent a follow up email to the recruiter 1 week after the interview. I had NO RESPONSE AT ALL for more than a month, what is so disrespectful.\n\nI think the process was extremely long and the lack of return made me think is not an organized and respectful company to work for.", "Interview Questions": "A mix of hypothetical questions about different situations in marketing area and situational questions about planning, campaigns, reporting and so on.\n\nClearly not a structured interview and they take it to different directions depends on candidate's answers for the questions."}, {"date": "28 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Mar 2019", "Interview Descriptions": "I got a call from a HR rep who was very nice but didn't tell me an awful lot about the role. I had to go back to the website to find out exactly what the role was. It was very short, around 10-15 mins. Didn't ask many questions. They started asking me questions about the role before the gave an overview of the department. There was no mention of salary or working hours", "Interview Questions": "What did I know about the job"}, {"date": "11 Oct 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Dec 2018", "Interview Descriptions": "The interview conducted online with the potential supervisor, was conducted over Zoom to accommodate difficulties associated with travel. The communication was clear and the questions straight forward. The position was not expecting me to be an expert in the field it has some questions of exploratory nature.", "Interview Questions": "Questions were about my background and relevant experience."}, {"date": "7 Oct 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Jan 2018", "Interview Descriptions": "It was a tough and challenging interview but the questions I felt were fair and the outcomes was communicated to me very shortly after the interview took place.  The panel were well prepared and professional.", "Interview Questions": "What is the definition of success"}, {"date": "21 Oct 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Dec 2017", "Interview Descriptions": "formal interview with 2 sensior academic staff and 1 HR representative. Consisted of usual interview style questions plus a presentation of research experience and achievements to date.  interview lasted less than 30 min.", "Interview Questions": "Experience of project management"}, {"date": "28 Sept 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Royal College of Surgeons in Ireland", "Interview Descriptions": "It was one face to face interview with someone from HR and two supervisors involved in the project. It lasted about 40 minutes and I was contacted by phone the next day to say I had received the position", "Interview Questions": "How to deal with deadlines and pressure"}, {"date": "14 Apr 2019", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Apr 2017", "Interview Descriptions": "1. Call with recruiter\r\n2. On-site in person interview with 1 person from business and 1 from development team\r\n3. General discussion about past projects, experience, communication with clients etc.\r\n4. On-site technical interview 1st online in front of them mostly about logic in programming and fundamental staff, and after written test on the paper, with about 20-30 questions about various things from different programming languages, Resftull APIs, Network protocols and security questions, Server administration (Windows)..", "Interview Questions": "Nothing that I could remember specifically except mostly fundamental knowledge about whole vertical scope of software development lifecycle from scratch to continuous deployment and integration."}], [{"date": "6 May 2021", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Jan 2017", "Interview Descriptions": "Great, clear process, the HR team endured i had all the information necessary such as well i was being interview by etc  it was overall a smooth experience. I would say that the experience was average and areas for improvement include the digitization of some of the sub processes", "Interview Questions": "Teaching and research experience as a health professional"}, {"date": "17 Jan 2018", "title": "PhD Scholarship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal College of Surgeons in Ireland (Dublin, Dublin) in Jun 2013", "Interview Descriptions": "Emails were exchanged with program administrator, following which a phone call interview was scheduled. The phone call interview was conducted with a panel of 5 to 10 people which were introduced each time by the Head of Postgraduates School. The phone call lasted approximately 40 mins. Consecutive feedback was provided by program administrator via phone calls and emails and independent consulting of referees was carried out before securing the position.", "Interview Questions": "What would be your next step after completing your scholarship"}]]