[[{"date": "5 Feb 2023", "title": "Talent Acquistion Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Joseph Medical Center", "Interview Descriptions": "The interview process was simple. It consisted of a phone interview. After phone interview a panel onsite interview was then conducted. That was the full interview process for the position.", "Interview Questions": "What interested in applying for the position?"}, {"date": "29 Dec 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Joseph Medical Center (Phoenix, AZ) in Nov 2022", "Interview Descriptions": "30 min interview. Fair questions, mostly behavioral. Be confident to answer questions and be yourself. Its a panel interview composed of 3 people and they will one question after the other. I recommend to pause first and think, before you answer any questions so you give the best answer.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "23 Oct 2022", "title": "HR Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Joseph Medical Center", "Interview Descriptions": "One phone interview briefly discussing background and experience. One in-person interview. Both basic HR related questions and overall experience review. Friendly interviews with Human Resources team. Panel interview format for in-person interview.", "Interview Questions": "Tell me about your previous HR or related experience."}, {"date": "6 Apr 2022", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at St. Joseph Medical Center (Staten Island, NY) in Mar 2022", "Interview Descriptions": "The interview process was streamlined to include any and all HR forms including pre hire paperwork. But also include written essay style questions. The whole process took about an hour not including the pre interview email including 25 pages of forms to be completed.", "Interview Questions": "What do you feel your best asset is that you bring to the company?"}, {"date": "19 Mar 2021", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Joseph Medical Center", "Interview Descriptions": "Phone interview itself went well. More than half the interview was interviewer speaking about the company and role. Wish I had more time to ask my questions at the end since they were on the way to a meeting but otherwise pretty standard questions. \n\nBut the HR department is inefficient from the start. I never got an email confirming my interview. Did not bode well since I was in a different time zone and led to some confusion. Also did not receive any contact information afterwards for me to follow up with. Had to track them down but I never got a response or call in return.", "Interview Questions": "What do you do when you're not working?"}, {"date": "4 Apr 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Joseph Medical Center", "Interview Descriptions": "I completed the online application and received a callback approximately 2 weeks later.  Interviewed with the director, clinical coordinator and educator.  Very friendly atmosphere.  They asked about my experience and told me about the unit.", "Interview Questions": "Tell me about yourself. "}, {"date": "3 Feb 2018", "title": "HIM Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at St. Joseph Medical Center in Jan 2018", "Interview Descriptions": "Was called by department management and set up interview. Interviewed with two department managers and director. Lots of questions on how do I handle stress, difficult colleagues. The job is productivity driven and is all about the bottom line. Very outdated practices and seemed very autocratic. I applaud the director for trying to loosen the atmosphere.", "Interview Questions": "What is your definition of professionalism?"}, {"date": "3 Aug 2017", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Joseph Medical Center", "Interview Descriptions": "Very professional and timely. Front Desk staff directed me to HR, which was easy to find. Everyone along the way and that I spoke to was kind and pleasant. The interview was actually very intense and difficult but I felt like it was great. I learned a lot about the unit and what is expected of a nurse on the unit.", "Interview Questions": "How have your responded to a difficult situation with a patient in the past? What interventions did you do?"}, {"date": "6 Feb 2016", "title": "Utility Aide Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Joseph Medical Center (Atlanta, GA)", "Interview Descriptions": "The interview process was quick and easy. Found out the same day I got the job. I was just told to go take the drug test, and I was taken on a tour of the facility, we watched a few videos and that was it.", "Interview Questions": "What would I bring to the company?"}, {"date": "8 Sept 2015", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Joseph Medical Center (Houston, TX) in Aug 2015", "Interview Descriptions": "The interview process was short and sweet. However, the HR department is highly inefficient. I've tried contacting them several times with questions about the interview and still have not heard anything. Not even the fact that I didn't get the job.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "7 Apr 2014", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Joseph Medical Center", "Interview Descriptions": "Typical interview", "Interview Questions": "Typical "}, {"date": "13 Mar 2014", "title": "RN NICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at St. Joseph Medical Center in Dec 2013", "Interview Descriptions": "Phone interview, Skills test, math test, drug screen, PALS, NRP, RN license, 2 years experience in specific area. in person interview, Interview with 3 other nurses", "Interview Questions": "Can you as a level 2 NICU go to all the high risk births. You have NRP after all."}, {"date": "26 Aug 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Joseph Medical Center (Houston, TX) in May 2013", "Interview Descriptions": "Good process, all day peer interviews and c suite and physician interviews. Had phone interview first for about an HR, then had in person interview scheduled. Many directors showed up late or brought work with them and didn't really participate much. I pretty much ran the interview by asking questions I wanted answers to, worked out well in my favor, they didn't have a lot of time for questions after I finished interviewing them", "Interview Questions": "Why I should be chosen over the other applicants, what could I offer SJMC other applicants might not. why I wanted to work for SJMC"}, {"date": "1 Jul 2014", "title": "Manager/Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Joseph Medical Center (Kansas City, MO) in Oct 2010", "Interview Descriptions": "Very professional.  They are timely, happy to see you and have nothing to hide.  They explain the process and give you plenty of time to answer questions and complete the application and personality profile.", "Interview Questions": "Group interview"}]]