[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Rewarding work and passionate co-workers", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jun 2022", "job_title": "Program Facilitator in Montgomery Village, MD", "duration": "N/A", "pros": "Super fun work environment if you enjoy youth development work. \r\nThe staff is exceptionally smart, passionate, and loves their job.\r\nThe kids the programs serve are amazing talented youth and benefit from the mission of the organization.\r\nWeekly collaboration with colleagues outside of the school I was assigned to.", "cons": "Using paper files and outdated tracking systems (as of 2020 so this may not apply)\r\nNo real lunch break. This is more cultural and basically part of any public school culture where the staff is available at all times."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Poorly run organization with high turn-over", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Oct 2015", "job_title": "Anonymous Employee in Bethesda, MD", "duration": "N/A", "pros": "CollegeTracks' mission and work is admirable. The Access and Success staff are great resources, mentors, and advisors for students as they navigate the college search, admissions, and transition process.", "cons": "Staff are not highly valued and there are not opportunities for advancement. Only candidates with master's degrees are hired, but the salary and lack of benefits do not merit the type of talent CollegeTracks seeks to add to the team. Within a one year period 7 of the 12 staff members left the organization because of poor salary, negligible benefits, lack of professional growth opportunities, and frustrations with not being able to create change within the organization. A current employee is contemplating getting on welfare because the salary paid by CollegeTracks does not allow for her to provide for her family. Employment and hiring practices are borderline illegal, one staff member that left was not paid for vacation time accrued, which is illegal. All staff members are \"at will employees\" and CollegeTracks has fired staff in the past with no explanation. While the job can be rewarding the organization and leadership is demanding, challenging to work for, and seems to care little about the welfare of its staff. There are other ways to make a positive impact on society other than by working for this organization."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Incredible Organization!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Oct 2020", "job_title": "Volunteer in Rockville, MD", "duration": "N/A", "pros": "Great mission with caring, dedicated people.", "cons": "I can't think of any cons."}], [], []]