[[{"date": "19 Sept 2022", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA) in Aug 2022", "Interview Descriptions": "Recruiter contact through LinkedIn. Initial phone interview.  Take home test of building a landing page (PLP) in scratch from a UI in Figma. Given one week. I tried getting some details from the email address provided on the test -- no response. I was on my own.\n\nSo I treated it like a learning experience. I stuck to the details and graphics provided which included the mention of TailwindCSS in the UI. I didn't know it, but I learned it just for this test.  And I turned it in -- on time and waited. And waited. And waited. I was promised a review. None was forthcoming.\n\nAnd I would have probably be completely ghosted, if I had not mentioned that I felt the need to share my experience on Glassdoor. Only then did I get the apology and the explanation - the recruiter had been PTO and \"the responsive code was inadequate\" and we've decided to go in a new direction.\n\nBenefit Data Trust has little idea how to measure the skills of a developer and communicate well with applicants. Tech interviewees BEWARE!", "Interview Questions": "No technical questions in interview at all.  Just in the take home test."}, {"date": "31 Oct 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Benefits Data Trust", "Interview Descriptions": "Interview process started with a phone  screening with Human Resources/ recruiter followed by phone interview and two Zoom interviews. Interviews were conducted with manager and various team members. Writing sample and presentation requested. Entire interview process took about one month.", "Interview Questions": "What is your preferred work environment "}, {"date": "13 Jul 2021", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Benefits Data Trust", "Interview Descriptions": "Be yourself and be respectful. You aren't expected to have knowledge of benefits prior at all, just an interest in the position. If you get an interview, you'll most likely get the job.", "Interview Questions": "When was a time you went out of your way to help someone?"}, {"date": "13 Jun 2022", "title": "Healthcare Engagement Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Benefits Data Trust in Jun 2021", "Interview Descriptions": "Two group interviews with the immediate team as well as the big boss and one member outside of the core team. Virtual, one hour each. General behavioral questions. Plus one take-home task.", "Interview Questions": "Tell us about what kind of work environment helps you thrive"}, {"date": "18 Apr 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Benefits Data Trust in May 2021", "Interview Descriptions": "The process was very lengthy detailed, included group video interviews, plus a written exercise. \n\nI recall that the entire process took a relatively long time due to COVID, other complications. \n\ni would have liked it to have been expedited a bit.", "Interview Questions": "They asked me how would I would respond to a data breach. "}, {"date": "12 Jun 2021", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Benefits Data Trust (New York, NY) in Apr 2021", "Interview Descriptions": "I got contacted on linkedin by their Talent Acquisition Manager, asking to schedule a call. I replied, the call got scheduled and on the scheduled day and time, he simply ghosted me. I set time aside for the call and he didn't even had the decency to cancel or to even reschedule in time. Just ghosted me.", "Interview Questions": "There was none as the talent acquisition manager stood me up on the day of the interview "}, {"date": "6 May 2021", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Benefits Data Trust in Mar 2021", "Interview Descriptions": "2 rounds of interviews, after talking to HR/talent recruiter. It's going very fast - the appointment is made within 2 weeks, and it's 3-person panel interview.   Questions include tech, communication and", "Interview Questions": "How do you handle a difficult tech. decision when there's uncertainty?"}, {"date": "12 Apr 2021", "title": "UX Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Benefits Data Trust in Feb 2021", "Interview Descriptions": "I was contacted by the recruiter in late January for an initial screening. Two weeks later, I had a group interview with the Design Manager and some of the team. They didn't request any additional information for the interview, but I prepared a ppt portfolio review of my work, which I presented. After a few follow up questions on my projects, the team went around asking questions. I got a chance to ask some of the team. Overall, interview lasted an hour. I didn't ask about next steps and they were not relayed to me. After the interview, I sent thank you messages to everyone on the interview team. A week later, I sent a thank you to the recruiter as well as a question about next steps. No response. A month after that, I sent a message to the design manager and the recruiter asking about the status of my application. Nothing. I got ghosted. How do you recruit someone and not have the decency to give a final decision?? Totally unprofessional.", "Interview Questions": "How do you know when you've collected enough research?\nWhat is an app that you think has \"good\" design? Bad design? How would you improve the design?"}, {"date": "26 Sept 2021", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA) in Oct 2019", "Interview Descriptions": "There was one initial phone interview followed by an in person phone interview with the an HR rep. He went over the company mission statement and goals. The company policies then asked me about myself and why I wanted to work there, as well as how I would handle certain situations with clients.", "Interview Questions": "Why do want to work here?"}], [{"date": "14 Jun 2019", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Benefits Data Trust", "Interview Descriptions": "I was emailed to come in for a first round interview.  I met with the hiring coordinator and hiring manager.  I was asked several questions regarding my work and academic background.  I was offered the job on the spot", "Interview Questions": "what is your experience with call centers"}, {"date": "15 Dec 2017", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Benefits Data Trust", "Interview Descriptions": "First interview was over the phone and quick. Second was in person, which also involved shadowing an employee for the position you're applying for. Then you learn your determination a few days later.", "Interview Questions": "Name one time you were challenged and how did you overcome it?"}, {"date": "23 Aug 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Benefits Data Trust (Philadelphia, PA)", "Interview Descriptions": "I was asked to interview for an open position by an HR staff member after previously interviewing with the organization. During my interview the interviewers let me shadow a BOS call and forgot me for over an hour. I was told I would hear about the interview by the end of the week and it took multiple follow-ups and a few weeks to hear back.", "Interview Questions": "Why BDT?"}, {"date": "31 Mar 2017", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Benefits Data Trust (Philadelphia, PA)", "Interview Descriptions": "I had a telephone interview and was then asked to come in for an in person interview. The interview lasted about an hour. I got to sit with someone while they took calls to see what exactly I'd be doing.", "Interview Questions": "How are you best fit for this role?"}, {"date": "22 Nov 2017", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Benefits Data Trust (Phila, PA) in Mar 2017", "Interview Descriptions": "Applied online and got a phone screening from human resources later that week. Then, face to face at the office about a week after the phone call. The interview was very friendly and mainly conversational. They mainly talked about the job position and what tasks needed to be done day to day.", "Interview Questions": "Tell me about yourself"}, {"date": "10 Sept 2016", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA)", "Interview Descriptions": "The interview went very well, though I had applied for the job over a month before being invited for an interview. There was only one interview, and I was offered the position at the end of it. It felt more like a conversation than an interview, and a BOS was a part of the interview, so I was able to learn more about the position. After the conversation, I sat with a BOS and listened in on a call, which was pretty great. I got to see a little bit of what they do before accepting the job. The culture at BDT is amazing. Everyone seems valued, they play a game every Friday morning before calls begin, and there's room for advancement within the organization.", "Interview Questions": "What would you say is one of your strengths? Can you give an example of this coming up in a previous job?"}, {"date": "1 Feb 2016", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Benefits Data Trust (Philadelphia, PA) in Dec 2015", "Interview Descriptions": "I applied in October of 2015 and didn't hear back from them until December.  They were very kind on the phone and brought me in for a group interview.  I'm not sure if I remember them saying that it was a group interview, but it was.  The interview went very well and I started a week later.  Everyone I interacted with during the hiring process assisted in smoothing over the rough edges of a newly expanding nonprofit.", "Interview Questions": "Why Benefits Data Trust?"}], [{"date": "7 Oct 2015", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA) in Apr 2015", "Interview Descriptions": "You'd be sitting with the HR manager and one other employee from any department in a casual setting. Then they would take you into the call center and listen in on a call to see how entry level employees work. Then you come back to the HR office and wrap up. There is a background check and drug screen involved. They send you to a third party at an offsite location for a urine test, which doesn't take long.", "Interview Questions": "Do you have any volunteer/social service experience? Describe it."}, {"date": "11 Sept 2014", "title": "Benefits Outreach Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Benefits Data Trust", "Interview Descriptions": "The interview process was very pleasant. I met with the hiring manager and one of the team leaders. We discuss normal interview questions. I felt very comfortable and at times the interview drifted off to personal conversations. Which was cool and different.  I sat with one of the BOS and listened to a call. The person I was sitting with was on the call for over 30 minutes. I didnt get a chance to inquire about the role.", "Interview Questions": "What would you do in your first thirty days here?"}, {"date": "28 Apr 2014", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Benefits Data Trust (Philadelphia, PA)", "Interview Descriptions": "The entire interview process was very smooth. From the phone interview to the follow up group interview BDT does a great job of keeping you feel comfortable and allows you to take an honest look at what the company does and what their culture stands for.\r\n\r\nI initially found the posting through LinkedIn and then applied through their website. I got a quick response from their hiring manager, who proceeded to schedule a phone interview. The interview was kept very conversational which was refreshing. It was more about getting to know you as the whole person as opposed to just what is on your resume.\r\n\r\nWe followed up a phone interview with a group interview between myself, the hiring manager and a team leader. They introduced themselves and a little background on the company. The kept the in person interview conversational as well, going over my professional background and schooling. \r\n\r\nTo close it out, they allowed me to sit in with a BOS while they assist clients, which was very helpful because you were able to get a first hand experience about what the company had to offer to its employees.", "Interview Questions": "questioning was very standard. "}, {"date": "26 Apr 2014", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Benefits Data Trust (Phila, PA) in Mar 2014", "Interview Descriptions": "I applied through idealist.org and heard back with an interview offer within a week. I interviewed with two managers, and the whole process felt very relaxed. It was more like a long conversation about how my skill set would be beneficial to the position, and less like an interrogation with standard, boring interview questions. We talked a lot about my previous work experience and how the work I had previously done could transfer over to the work done at BDT. There weren't any questions where I felt like I had to give BS answers that I knew they wanted to hear. We even joked around and laughed a lot. Very smooth and comfortable. \r\n\r\nThen I got a chance to \"shadow\" a current employee to decide if the job was something I could see myself doing 40 hours a week. I got to ask him questions about what it's really like to work there, without feeling like he was going to report back to the managers. \r\n\r\nThen we wrapped things up back in the interview room and chit chatted a bit. The hiring manager said he would have an answer by a certain day the next week, and he called me on that day with a job offer.", "Interview Questions": "No difficult questions. It was more like a fluid conversation about my past work experiences. The questions were not standard interview style questions, but rather questions asking me to elaborate on specific things related to my skills used in previous jobs. Questions were asked based on what was on my resume."}, {"date": "28 Apr 2014", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Benefits Data Trust (Philadelphia, PA) in Mar 2014", "Interview Descriptions": "I saw the position advertised on idealist.org and within 2 days I heard back from the hiring manager. The hiring manager set up a time with me for a phone interview but then had to cancel the day of but gave enough notice and quickly rescheduled for another time. The phone interview which is more like a phone chat is basically to see why you are interested in working at Benefits Data Trust and most likely in my opinion to see if you can communicate over the phone with ease and with a friendly personality which is essential for the job. We arranged a time for a face to face interview. I arrived at their office and was greeted kindly by everyone. There were 2 interviewers, both the hiring manager and a supervisor. The hiring manager conducted the first half of the interview asking basic questions and really trying to get to know me and what I wanted to contribute to BDT. In the middle of the interview. I got a chance to go into the call center and listen to a few conversations. I think this really helped me towards my final decision of accepting the job interview because I really had no idea what to expect for a call center position. Also it gave me a chance to really see the environment of those who have the same position I was applying for which was pretty relaxed yet productive. The second half was conducted by the supervisor to confirm I was bilingual. At the end of the interview there was plenty of time for my questions and which they took the time to answer.  The hiring manager let me know specifically when he would get back to me, which he did with an offer.", "Interview Questions": "Overall there were no difficult questions. This interview is about bringing your personalty and goals to the table while sharing about your work history."}, {"date": "5 Feb 2014", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA)", "Interview Descriptions": "I had a phone interview that gave me a sense that I wanted to work with BDT in which I feel the most important thing I did was express my interest in growing professionally in a non-profit environment. Had an in person interview with two individuals who answered my technical questions very well. They also volunteered very actuate information about the positive work environment at BDT and some of the negative sides of a call center, which I appreciated as I had no previous call center experience. I also had the opportunity to sit in on a call and talk with a current BOS who was very nice. Show your engagement and excitement throughout the process as they are looking for passionate and skilled individuals.", "Interview Questions": "They didn't ask very many technical questions about my ability to work in a call center and seemed more interested in how BDT fit into my career plans. They also seemed genuinely interested in hearing about my the lessons I had learned during my year of service with AmeriCops."}, {"date": "13 Feb 2014", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA) in Nov 2013", "Interview Descriptions": "In comparison to other positions I applied to, the Benefits Data Trust interview process was very fluid and professional (but not intimidating). I felt as though the preliminary questions required to respond to along with the resume and cover letter gave me a great opportunity to explain who I was and where I was aiming to go. I received a call from BDT promptly and I spoke with the friendly HR manager for about 10 minutes and had a great, short conversation as to why I was interested in the position and to set up an interview. I hadn't realized it at the time but it was pretty much a phone interview! However, it didn't feel forced and the conversation was amicable. \r\nThe in-person interview was comfortable and I met with the HR manager and a team leader from the office. They both expressed how incredible the organization is and really displayed the energy in the mission of helping others. The interview lasted about 50 minutes. \r\nThey gave me the opportunity to sit with a Benefits Outreach Specialist and listen to a call. Unfortunately, no call came in while I sat with the BOS, but she was very nice and told me a little bit more about the job. I definitely noticed that the company culture was not uptight or serious. They allowed employees to wear whatever they wanted, like jeans and t-shirts and the atmosphere seemed light. Truthfully, I was a bit hesitant given that it is technically a call center (an environment I thought I'd never work in), but it really appeared that the employees were happy. Also, windows line the contact center so it's not like it was located in an enclosed dungeon or anything. \r\n\r\nOverall, I think the interview process was great and I was given a clear expectation as to when I would hear back. It took about 3 weeks for them to get back to me.", "Interview Questions": "How do you handle feedback from others?"}, {"date": "12 May 2013", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Benefits Data Trust in Dec 2012", "Interview Descriptions": "I applied through a job board. A few days later, I received a call from a manager, We did a quick interview during which the manager asked me about my background and why I wanted to work for Benefits Data Trust. After that, the manager scheduled an in-person interview for the next week. The interview  consists of you and one or two managers. It lasted for 30-40 minutes and the questions were pretty run of the mill (manager even read them right from a paper!). They basically want to see that your career goals match with the organization's mission and if you have special skills that would allow you to grow in other positions within the organization eventually.", "Interview Questions": "What do you think of when you think of a a non-profit organization's work culture?"}, {"date": "7 Mar 2011", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Benefits Data Trust (Philadelphia, PA) in Feb 2011", "Interview Descriptions": "I answered an ad on Craigslist and received a response quickly via telephone.  I spoke with a human resources manager and she described for me the company and what its senior-level employees do.  The initial conversation took over a half hour.  During the conversation, she did not really give me any indication as to what my position would entail. She glossed over it quickly, mentioning that I would be supporting all executive staff.  She was very easy to talk to, pleasant, and friendly.  She scheduled me for an in-person interview a few days later. She told me I needed to fill out the application and submit a writing sample over the weekend so it would be ready within 24 hours of the scheduled interview.  \r\n\r\nWhen I arrived for the interview, she met me at the door and put me into a conference room with one large table in it.  She admitted she did not read my application or writing sample, even though it was a requirement that I had it done immediately. She spoke with me one-on-one for less than five minutes, and then stopped me mid-sentence to tell me that four of the executives were going to come in and meet with me as well.  This wasn't a problem for me, but it would have been nice to know beforehand that I was going to be interviewed by five people at once.  I sat on one side of the conference room table, and the five of them sat on the other side.  \r\n\r\nThey asked general questions, such as what my experience entailed and what my goals are, and what my strengths are - typical interview questions.  Then one person asked me what my first day would be like at their company.  Being that I really did not have much information to go by, I said that I would familiarize myself with the company, employees, and general surroundings, and perhaps shadow someone for a bit or get trained - however they usually do it.  Turns out, I would not be trained in my position whatsoever.  Surprise!  \r\n\r\nI was in the interview for a little under two hours.  We were wrapping everything up and the HR manager slipped in that I would actually be the receptionist.  That was not the job I applied for, nor was that a job that I was looking to do, or had any experience in doing.  I am sure I looked a bit taken aback.  Then everyone cleared the room except for the HR manager, who then looked over my resume and application for the first time.  She saw my current salary figure and requirements, and said that the job is for $20,000 less than what I was looking for.  Again, this could have been avoided had she just read my application beforehand.\r\n\r\nI was not going to take the position had it been offered to me, but I did email and call to follow-up after the interview.  After a week of not hearing anything, I emailed the HR manager and she said they had not made a decision yet.  Two weeks after that, I did so again, and she wrote back quickly to say the position had been filled.  I understand they probably had many applicants, but I shouldn't have to chase them for a decision, even if it is a rejection.  \r\n\r\nOverall, I felt the company was quite sketchy, the executives seemed even sketchier, and the place was not run smoothly at all.  It was clear that something was going on behind the scenes that they were trying to hide. Good first impression via phone, but once I met everyone in person, I felt like I was walking into a mess.", "Interview Questions": "Describe to me your first day on the job at our company."}, {"date": "11 Mar 2011", "title": "Benefits Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Benefits Data Trust (Philadelphia, PA) in Sept 2010", "Interview Descriptions": "BDT advertises on Craigslist for the most part. It took me a few days to get a response. However, some people have been offered the spot right away. They usually have a lot of people leaving or being terminated every few months, and so they usually hire a group of people to fill in the spots. The interview is comprehensive and they just need you to speak well, and fulfill the job requirements. This is not so hard cause the job is a low-paying one. Answer the simple questions. Be able to give hypothetical examples of how you would deal with clients, how you would address an elderly person, or someone with a difficult personality, for example. Be very politically correct. BDT is obsesive about extreme and liberal political correctness. This is a non-profit position requiring you to sit on the phone and apply people to government programs, so knowing prescription assistance, Liheap, Food Stamps, and the rebate program helps. If you are from a non-profit feild, you should have an edge.", "Interview Questions": "How you would deal with the various clients, like elderly clients."}], [{"date": "8 Sept 2010", "title": "Benefits Outreach Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Benefits Data Trust (Philadelphia, PA) in Aug 2010", "Interview Descriptions": "While the people interviewing me seemed nice, it seems like all they wanted was a bunch of basic and choreographed responses. The only reason I didn't get this job is because I was honest. I was interviewed by two people at the same time and neither of them gave any of themselves to me. They read from a paper and asked those stupid \"situation\" questions, such as \"give us an example of a time when you went above and beyond at your current job.\" For me, questions like this are bogus and irrelevant. Anyone can make up and fake response and give the exact answers they want. Again, the people seemed nice, but not people who should be interviewing others. If all you are going to do is read from a paper and ask me meaningless questions that have nothing to do with the job, then you'll likely get similar responses from the people you are interviewing, which is to say, nothing. Good riddance.", "Interview Questions": "Give us an example of when you went above and beyond at your current job."}]]