[[{"date": "22 Aug 2022", "title": "Copley Library Access Services Student Assistant  Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of San Diego", "Interview Descriptions": "It was very well done , giving me a fair chance to “sell myself” , I’m order to get the position over other applicants. The questions asked show a lot about one’s character, which I think makes for an effective interview .", "Interview Questions": "They asked me how I would handle altercations and combative customers ."}, {"date": "27 May 2022", "title": "Advancement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Diego", "Interview Descriptions": "Interview was pretty standard, received email from department head and set up zoom. Normal questions like any other, seemed to go pretty well and she was talking about getting me in for the next round. Told her that sounded good and she said I’d hear back in a few days. A week goes by I heard nothing, emailed her to ask what is going on, she said she is busy and will get back to me soon. It’s been almost a month of silence. This university should be better than this.", "Interview Questions": "It was mostly standard “name a time when”"}, {"date": "16 May 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of San Diego", "Interview Descriptions": "Initial correspondence was over a month after submitting application, but the people I spoke with were friendly and knowledgeable as well as honest about what the position would entail. I had two interviews with employees from various departments; the first was virtual and the second was on campus.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "26 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of San Diego", "Interview Descriptions": "They know you're a student so they just want you to be yourself and honest with them! Usually you have to be personable because they're costumer service based jobs, so just make sure you can show them you're friendly", "Interview Questions": "How do you handle pressure? \r\nHow would you describe yourself in one word?"}, {"date": "26 Oct 2021", "title": "Help Desk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of San Diego (San Diego, CA)", "Interview Descriptions": "They seem lost. It is a very broken recruiting and interviewing process.\n\nThis job has been posted and reposted for many months, probably half a year at this point. To the point that they had to hire an outside recruiting company to bring in candidates. Red flag.\n\nNo structure to the interview. It was pretty unprofessional by typical higher education standards. Basically a simple 30 minute meet and greet. I guess it was a personality test which goes both ways if you know what I mean.\n\nEssentially no questions on the actual job or why you would be a good candidate. Why are we here again? Red flag two.\n\nSeemed like they were just going through the motions with no desire to actually discuss details of the job. Red flag three.\n\nI would say they are trying to hire internally but why waste everyone’s time? Not to mention why it is taking them so long to find someone.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "9 Sept 2021", "title": "Physics & Chemistry Laboratory Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of San Diego (San Diego, CA) in Aug 2021", "Interview Descriptions": "A 3 hour process that included Department Chairs interviews and Staff Panel Interview consisting of questions and answers.  Tour of classrooms and laboratory spaces. Questions consisted of professional questions along with personality questions.", "Interview Questions": "Q:  What would your previous employer tell us was your greatest strength?"}, {"date": "3 May 2021", "title": "Graduate Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Diego (San Diego, CA) in Feb 2021", "Interview Descriptions": "long, 3 hours, group interview over zoom.\n\ncombination of students/professors/faculty interviewing. \n\nbreak out sessions where they ask about your experience, your aspirations and goals \n\na time where you made a mistake, etc.", "Interview Questions": "a time where you made a mistake, etc. \nbreak out sessions where they ask about your experience, your aspirations and goals \n"}, {"date": "8 Feb 2019", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of San Diego", "Interview Descriptions": "Process begins with a group interview that entails a teamwork exercise as well as individually answering a \"hot topic\" tour question. If chosen to move forward, an individual interview is conducted with 2 - 4 interviewers.", "Interview Questions": "What could be improved about USD?"}, {"date": "15 Jun 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of San Diego", "Interview Descriptions": "The interview process is more of a getting to know you kind of vibe to it. But at the same time you should go prepared about the mission and vision of the particular department and how you can contribute to it.", "Interview Questions": "How can you create an impact on the society with this role. "}, {"date": "11 Jul 2017", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of San Diego (San Diego, CA) in May 2017", "Interview Descriptions": "Our interview was with two ladies that were in lateral positions to the one applied for.  It was over the phone and was scheduled the last 30 minutes.  The last 10 minutes were left for me to ask any questions to them about the position.  Very friendly individuals.", "Interview Questions": "Tell us about one of the projects that you have worked on and how the part you played made an impact on your office/team."}], [{"date": "13 Sept 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of San Diego (San Diego, CA) in Apr 2017", "Interview Descriptions": "I applied through the job board posting. The online portal requested detailed experience. I received a phone call about 2 weeks after I applied online to interview that next week. I came in for an hour long interview that was split into two parts. I walked out with contact information to follow up with for skills testing that I completed the next day. I was emailed later that week to call and schedule a second interview with someone who was out of the office when I came in before. The second interview was very quick and to the point. I met with my prospective boss again who informed me that I was a finalist pending reference checks. 2 of my 3 references were emailed the next week. I was contacted by HR after that with a tentative offer pending background and education checks to start in 2 weeks.", "Interview Questions": "I was asked for lots of examples that compared to the job position and for a difficult customer service experience. I am pretty sure I was asked something along the lines as to why I wanted the job"}, {"date": "22 Aug 2018", "title": "Rainbow Educator PR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of San Diego (San Diego, CA) in Feb 2017", "Interview Descriptions": "Met with two interviewers, both students and part of the rainbow educator program, who were kind and if anything not comfortable with being interviewers. The interview lasted about 20-30 minutes, where they asked questions from a set list. They did not give a lot of verbal or nonverbal feedback, but were attentive and gave me time to think and answer the questions in my own time. They walked me out and thanked me for my time. About a week after I was accepted.", "Interview Questions": "What made you want to join?"}, {"date": "16 Nov 2018", "title": "IT - Cluster Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at University of San Diego (San Diego, CA) in Jan 2017", "Interview Descriptions": "Bizarre interview process.  Just weird.  Applied online.  Hoped.  Moved on.  Six months later, got called out of the blue by an angry woman who thought a UCSD research person wouldn't work at a liberal arts school.  Gave up hope.  Said thanks.  Two months, got a surprise technical phone interview.  Answered some basic Linux questions.  Didn't hear anything for two weeks.  I called them this time.  They said something like, \"We are still in the process of interviewing our most qualified candidates such as yourself.\"  Never heard anything back.  I am convinced the IT department here is crazy.", "Interview Questions": "What is a zombie process?"}, {"date": "27 Oct 2016", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Diego (New York, NY)", "Interview Descriptions": "Not well organized, seemed like they were hiring at the last minute and trying to get a body into the role. Interviewing team didn't seem to be communicating with each other.", "Interview Questions": "Tell us about a difficult boss and how you dealt with the situation"}, {"date": "20 Sept 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of San Diego (San Diego, CA) in Aug 2016", "Interview Descriptions": "I submitted an application online to the USD portal and was called by the hiring manager within 24 hours asking for an interview. I went in for an interview 2 days later where I met with the staff and the hiring manager for the department. I was told I would get a call within the next few days telling me my status. I called the office twice with no response for a month after my interview.", "Interview Questions": "How well do you manage stress? What are your organizing techniques?"}, {"date": "19 Mar 2016", "title": "Conference Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of San Diego (San Diego, CA) in Mar 2016", "Interview Descriptions": "Group interview with skits about how you would respond to specific situations on the job and working together to hire a potential candidate. The individual interview was held by the schedule coordinator and two employees. Some questions were straightforward, others were odd.", "Interview Questions": "If you could be a type of candy, what would you be?"}, {"date": "18 Aug 2015", "title": "Conference Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of San Diego", "Interview Descriptions": "Starts with a group interview process. Former employees sit at the tables with you and talk to you. Very casual. Some group questions are asked that are made to see how you work as a team. Second interview is done by director and a couple of former employees. They ask some very basic questions, and it is very casual.", "Interview Questions": "How would you describe yourself?"}, {"date": "18 Mar 2015", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of San Diego (San Diego, CA)", "Interview Descriptions": "I applied online.  I was required to submit a work sample prior to the interview.  There was only 1 interview conducted with a panel of interviewers.  The panel included the hiring manager, another manager in the department, and a peer/someone who had performed some functions of the role in the past. Interview questions were pretty standard and leaned more to motivation/interest vs. prior experience.\r\n\r\nThe university in general has a big focus on relationship vs. process.  There is an emphasis on serving students in a personalized manner.", "Interview Questions": "Lots of scenario-based questions.  Looking to see if you demonstrate empathy, personalized service."}, {"date": "15 Nov 2015", "title": "Waiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of San Diego (San Diego, CA) in Jan 2015", "Interview Descriptions": "Was interested in working for La Gran Terraza as a waiter.  So i emailed the manager asking if there were any open positions, and he had me come in for an interview.  The interview was very easy, and the questions were just about work experience.  I have worked their now for 1 year and the overall experience has been ok.", "Interview Questions": "What is your experience as a waiter?"}, {"date": "27 Nov 2014", "title": "Data Processor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of San Diego in Nov 2014", "Interview Descriptions": "Phone interview consisting of redundant questions that had little to do with the position applied for. I did not get an offer to interview in person which is ok because the pay offered is insulting ($14 an hour and I have a bachelors degree!).", "Interview Questions": "How do you feel about teamwork?"}], [{"date": "2 Oct 2015", "title": "Telefunder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of San Diego (San Diego, CA) in Sept 2014", "Interview Descriptions": "One interview on phone, for obvious reasons, and a follow-up interview in person. It doesn't so much matter what you say as compared to how you say it. Be charismatic. If you can, reflect on what you like about USD beforehand.", "Interview Questions": "Describe the worst movie you ever saw.\r\n\r\nNow tell me why it's the best."}, {"date": "14 Jul 2015", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 months. I interviewed at University of San Diego (San Diego, CA) in Jul 2014", "Interview Descriptions": "Contacted the Athletic Director to set up an appointment to speak with him about a possible internship at USD.  Interview lasted around 15 minutes with the Athletic Director giving me the contact information of the Marketing Department", "Interview Questions": "Why was I interested in working at USD?\r\nWhy was I qualified for any type of position?\r\nGeneral background information.\r\nWhat my future goals are and where I want to be in 5 years."}, {"date": "29 Apr 2014", "title": "Computer Lab Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of San Diego (San Diego, CA) in Apr 2014", "Interview Descriptions": "Got a quick response via email after I filled out my online application. Very pleased with that, as it took less than 1 week to set up a phone interview. The phone interview went well, and I liked the enthusiasm I received from one male and one female--both leadership--from the IT department. They reached out less than another week later to confirm an in-person interview. Again, I was very pleased. I am familiar with the excess amount of time taken by a lot of educational facilities when it comes to hiring, and USD defied those beliefs.\r\n\r\nOn the day I arrived for my interview, I received amiable, kind, clear communication from every employee with whom I interacted, and was beginning to get excited about the prospect of working for USD. I thought the interaction went extremely well among the hiring managers and myself. Most everyone (students included of course), seemed youthful and hip in the department. I felt that I was a solid technical fit, as well as a great candidate for the culture. There were a few minor things with which I was under-experienced, but I felt positive about growing into the role, and quickly adopting any missing \"pluses\".\r\n\r\nAfter the interview, I was given a two-page copy of a written test, challenging me with some technical questions which were more overly basic. A couple of them required some memorization of where certain Windows directories are located, where to find network settings, and things of that nature. I utilized the full 20 minutes to fill out my exam. The next day, I sent a thank-you email regarding the positive experience I'd had. No response from that, but that is not uncommon.\r\n\r\nAbout 10 days went by after the interview, and I hadn't heard a thing. Feeling confident that USD had been on spring break for 7 of those days helped me remain patient. Another 5-6 days went by, and I decided to send a follow-up email just to say hello, and expressing hope that they'd found the right person for the job--and if not, to let me know, as I was still interested. It has now been two full weeks since I sent that email, and I have received no communication at all. I believe it to be proper, kind, and culturally sensitive to at least reply to an email like that, letting the candidate know that they've either moved on, or else-wise. \r\n\r\nWhereas every part of the initial interview went great, the non-responsiveness just blew me away, especially after receiving such initial kindness. I'm shocked that a hiring manager won't even take 5 minutes to reply to his or her candidates, just to say \"thank you\" or \"thanks, but no thanks\". I found this to be rather an ungraceful exit to an otherwise positive experience, and that just left me feeling a bit confused and discarded.", "Interview Questions": "Not necessarily difficult, but a bit unexpected: They asked for the exact location of the User's Outlook directory in Windows 7. Now I know where this is, and I go there routinely, but sometimes the things one does every day are difficult to conjure up. Not a bad question, but I'd recommend on brushing up on things like this via a little memorization."}, {"date": "10 Aug 2017", "title": "Graduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of San Diego in Mar 2014", "Interview Descriptions": "Over the phone and overall it went well was accepted within 1 week of this process and overall thorough questions were asked to truly understand my background ... it was fairly informal but overall felt like they were truly interested in what I had to offer the University", "Interview Questions": "What can you bring to the project?"}, {"date": "2 May 2016", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of San Diego (San Diego, CA) in Jan 2013", "Interview Descriptions": "Emailed resume after being recommended by an older student, proceeded to have a sit down 30 minute interview, went well, and received feedback that I got the job a week or less later", "Interview Questions": "Why might this job be beneficial for you?"}, {"date": "23 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of San Diego (San Diego, CA) in Dec 2012", "Interview Descriptions": "Very informal, just approach your professors for opportunities. Professors already know you pretty well (due to small class size) and they don't have to ask much. It depends on the professor, some are more accessible than others. If you express your enthusiasm to join one of their projects they can either take you on, or suggest another professor to work with. Pretty laid back environment.", "Interview Questions": "Why do you want to work here? How do you see this affecting your future? What paths will this potentially open for you?"}, {"date": "15 Feb 2014", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of San Diego (San Diego, CA) in Dec 2012", "Interview Descriptions": "I applied in November of 2012 and was hired a month later. The process was very quick but my position was recently created. I had to fill out an assessment. Then I was called in for a two hour interview with my immediate director and the Dean.", "Interview Questions": "I was asked about enrollment numbers that I achieved in my previous experience, systems that I worked with, and my retention percentages."}, {"date": "29 Jul 2014", "title": "Conference Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of San Diego in Apr 2012", "Interview Descriptions": "Job is not highly advertised on campus. Most people find out about it through friends or acquaintances who have worked there in the past. Application includes essay questions and 2 references required. Applicant signs up for interview times when they drop off their application (automatically interview if apply). One large group interview - required unless class conflict. Includes various mock scenarios regarding customer service. Personality test also given out and results analyzed. Next step is two rounds of individual interviews. One with student leadership team members, one with management.", "Interview Questions": "What would you do in xyz situation? Would you hire person A, B, or C (with descriptions about each person). Very subjective questions but the \"right\" answer is expected."}, {"date": "19 Apr 2015", "title": "Event Staffer At JCP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of San Diego (San Diego, CA) in Jan 2011", "Interview Descriptions": "Was Interviewed by Derek Hillstead, who went on to work at the Arizona Cardinals facility.  Derek was firm but fair and made sure that he hired employees who understood their role and were willing to meet the standards expected of them.", "Interview Questions": "When is a time that you overcame adversity?"}, {"date": "12 Feb 2011", "title": "IT Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of San Diego (San Diego, CA) in Oct 2010", "Interview Descriptions": "I applied online and then didn't hear anything for a few weeks.  I had a phone interview with the hiring manager over the phone and then I didn't hear anything for over a month.  After a follow up e-mail I was interviewed by one of the people that would be working for me.  He had some challenging questions. It seemed to end well, but I have heard nothing since then, even after follow up e-mails to the hiring manager.", "Interview Questions": "What development methodologies have you used?"}], [{"date": "4 Sept 2013", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of San Diego (San Diego, CA) in Aug 2010", "Interview Descriptions": "First called and set up an over the phone interview with the main supervisors. Then was called into a series of group interviews. One with the supervisors, one with the web development team and supervisors, and also with a group from the specific college I would be assigned to.", "Interview Questions": "They gave me a programming quiz, where I had to actually solve 3 different questions on a piece of paper with the lead programmer present."}]]