[[{"date": "21 Apr 2023", "title": "Food Server Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Joliet Junior College (Atlanta, GA)", "Interview Descriptions": "I applying via email. They responded and set up a meeting. At the meeting I learned they did not have any positions, so it ended and that’s all that happened to me.", "Interview Questions": "N/A"}, {"date": "24 Jan 2022", "title": "IT Contractor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Joliet Junior College (Joliet, IL)", "Interview Descriptions": "Interview process was overkill of a entry level job. They only give you one time slot and date for interview. Also, had to prepare a presentation and knowledge item. Interview was about an hour of  back to back structure behavioral questions and then a 15 minute presentation. I felt like I was being interviewed for VP position.  Would not recommend JJC.", "Interview Questions": "Multi-question Behavioral Questions.\r\nExplain a time you failed "}, {"date": "24 Jan 2022", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Joliet Junior College in Oct 2021", "Interview Descriptions": "Department chair was very friendly and personable. He did a great job explaining job responsibilities. Meeting was smooth and easy and I went over my qualifications and schedule. The on-boarding process was also very painless.", "Interview Questions": "N/A"}, {"date": "14 Apr 2022", "title": "Dean Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Joliet Junior College (Joliet, IL) in May 2021", "Interview Descriptions": "First round video interview in Microsoft Teams. Mix of administrators and faculty chairs. Great questions, very DEI-focused, which was appreciated. Friendly committee as well! Time to ask questions at the end, too.", "Interview Questions": "A scenario about what I would do if students complained about a faculty member."}, {"date": "21 Jul 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Joliet Junior College (Joliet, IL) in Mar 2018", "Interview Descriptions": "As the whole, the interview process various depending on what student worker role you are being hired for as well as the department you are trying to be hired in. For an example, if you work in the Shipping and Receiving Department the questions are geared more towards how well you work with a team, customer service skills, your current class schedule, and how well you are with paying close attention to detail.", "Interview Questions": "Why did you apply for this position, and why do you think you would be a good fit?"}, {"date": "10 Nov 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Joliet Junior College", "Interview Descriptions": "Had to take MS Office test, typing test, and writing sample. After that, had a phone interview with the search committee. Then, face to face interview with 6 people in the room. All behavioral questions and it was like a police interrogation.", "Interview Questions": "All of them are tough behavioral questions which do NOT prove the person can do the job. Nothing was asked about my skills, past employment, or what I can do."}, {"date": "8 Oct 2016", "title": "Receptionist/Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Joliet Junior College", "Interview Descriptions": "Interviewed for the position and it went very well. Very professionally held and I scored very high on testing. I was overqualified for the position though felt it would be a great fit. No call back, no email, nothing. Even though I was told I would hear back either way. Very unprofessional in the end.", "Interview Questions": "How would you handle a situation where a public dignitary came in and wanted to speak with someone who wasn't there?"}, {"date": "5 May 2015", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Joliet Junior College (Joliet, IL) in Apr 2015", "Interview Descriptions": "Was fairly relaxed, more of an informal conversation rather than back and forth Q&A. I also received a tour of the facility and met key people in the department. They were very good about answering all of the questions that I had about the job.", "Interview Questions": "What is my teaching style, have I worked with students from many diverse backgrounds?"}, {"date": "7 Aug 2015", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Joliet Junior College (Joliet, IL) in Sept 2014", "Interview Descriptions": "Interview was very lengthy and they ask somewhat hard questions that make you have to think. There were three interviewers and they each took turns asking questions, it seemed to take forever and made me very nervous with the Commander and Chief asking questions.", "Interview Questions": "What makes you better for this position than our other candidates?"}], [{"date": "6 Jun 2014", "title": "Adm Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Joliet Junior College in Jun 2014", "Interview Descriptions": "Just the same as any large company, a little bit of telephone tag but then had an individual interview, then a committee interview, all went well and I believe it  was very timely.", "Interview Questions": "Lots to do on job description, however, job is part time."}, {"date": "30 Apr 2014", "title": "English Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Joliet Junior College in Apr 2014", "Interview Descriptions": "Holy cow. Here was my day: 9:30- meet Dean. Then go wander around for two hours. 11:30- write a paper, take a grammar test. Go wander around for two hours. Meet someone else. 3:30- finally, interview time! I'm exhausted and the process is rigid. Everything feels uncomfortable. They only had six questions for me and expected me to fill up a whole hour answering them. 4:30- give a teaching presentation. Hiring board won't turn the camera filming my teaching presentation (for someone?) towards the overhead that I'm using, because the other candidates have used the white board.  So essentially they refused to film my teaching presentation. Meanwhile, hiring committee pretends to be students... by loudly interrupting me, working to get me off topic, making fun of me, texting and giggling, etc. It was terrible. If these are how their students behave, I wouldn't touch their classrooms with a ten foot pole.", "Interview Questions": "Their questions themselves weren't hard but were perhaps telling that their student population is rough: \"How would you extend your professional development?\" \"Describe a time you had a bad experience with a student, and what you did wrong, and what you'd do differently now. Describe a time you had a bad experience with a student, but did something right.\"  \"How would you promote diversity?\" \"What would you do if someone angrily went over your head and went to the Dean about your teaching practices?\""}, {"date": "23 Nov 2016", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Joliet Junior College (Joliet, IL) in Feb 2014", "Interview Descriptions": "It was very laid back and informal. I was interviewed by the coordinator for the academic skills center in his office. He asked a few standard interview questions and reviewed my transcripts to see what classes I was qualified to tutor. He also had previously asked for a letter of recommendation from a teacher at the school and this was also taken into account during the process.", "Interview Questions": "Q: Can you think of a time when you faced a difficult task and how you overcame it?"}, {"date": "24 Dec 2015", "title": "Psychology Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Joliet Junior College (Joliet, IL) in Jun 2011", "Interview Descriptions": "I walked into the Academic Skills Center at JJC and spoke with the woman in charge. I told her about my interest in tutoring and asked if they were hiring. She spoke with me for a while and then asked me to apply online and email her my cover letter. The process was very easy. After applying I basically got the formal offer, which I accepted.", "Interview Questions": "Where I worked previously"}]]