[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Apr 2023", "job_title": "Sales Associate in Stockbridge, MA", "duration": "N/A", "pros": "The entire center and customers are mostly happy and respectful being at the center", "cons": "You spend hours on your feet"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "I worked there in 2008", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Apr 2023", "job_title": "Shop Assistant in Stockbridge, MA", "duration": "N/A", "pros": "Shop discount, working with interesting people, access to Kripalu facilities and yoga classes", "cons": "low pay, there was a difficult manager there for part of my time, sort of a boring job"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Low Pay, Atmosphere of Fear", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Jan 2023", "job_title": "Programmer in Stockbridge, MA", "duration": "N/A", "pros": "great opportunity to learn more about yoga and health", "cons": "little investment in employee skill growth; firings at whim; culture of fear"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jul 2022", "job_title": "Front Desk Agent in Lenox, MA", "duration": "N/A", "pros": "Everything and everyone was pretty great.", "cons": "Not that many cons at all. If so very small"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Try Too Hard to Keep Up Appearances", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Nov 2021", "job_title": "Support Staff in Stockbridge, MA", "duration": "N/A", "pros": "The food, the free or discounted use of the facility, and grounds for whatever Kripalu offers. An interesting and diverse bunch of people working there. If interested in Yoga you are bound to get to know many teachers and enjoy yourself.", "cons": "Too much work for the pay. Schizoid management with high turnover rates, and a tendency to play along with the whole yoga spirituality thing while really just running the place like a corporate yoga hotel with all the usual cutthroat, backstabbing politics you'd expect elsewhere. Instead of embracing and dealing with problems, they brush them under the rub or just get rid of people they don't want to deal with. They can fire you at will."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "lovely place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jun 2021", "job_title": "Registered Nurse in Pismo Beach, CA", "duration": "N/A", "pros": "Great people and environment. some politics, but where is there not. Great clientele to work with. Great food and accessible yoga classes for staff and benefits to joining the workshops. This of course is all before they closed due to COVID in June 2020. I think in their reopening it will be even better!", "cons": "The politics could be rough at times, however I think that will get smoothed out in their reopening."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "na", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "26 May 2021", "job_title": "Audio Engineer in Hartford, CT", "duration": "N/A", "pros": "Very supportive environment and great job.", "cons": "No cons I can think of."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "good", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 May 2021", "job_title": "Registration Specialist in Stockbridge, MA", "duration": "N/A", "pros": "customer engagement and community decent salary", "cons": "Management was changing, short staffed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Overall nice place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Mar 2021", "job_title": "Junior Manager in Lenox, MA", "duration": "N/A", "pros": "Healthy workplace environment, good culture.", "cons": "Not the best wages, wish they were a bit higher"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Nice company poor pay only left to take care of kids", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Jan 2021", "job_title": "Bakery Team Member in Stockbridge, MA", "duration": "N/A", "pros": "Good company, friendly atmosphere, mostly transparent", "cons": "Pay was small and caused me to leave because pay wouldn’t cover cost of child care"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Kripalu has drastically changed over the last year", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Nov 2017", "job_title": "Kripalu Associate in Stockbridge, MA", "duration": "N/A", "pros": "The food, the grounds...\r\n5 programs sessions a year free\r\nLots of overtime pay\r\nThe emails you get from your superiors, dripping with platitudes and praise, telling you how \"grateful\" they are, and how much they value you, and your \"service\".", "cons": "CEO\r\nmass terminations\r\nturnover\r\n\r\nI have been here 5 years, and watched the place slowly go downhill (for employees, not so much for guests)\r\nIn the last year of 2017 things have gotten much worse. \r\n\r\nThe first thing the new CEO did was end all Christmas bonuses. She even sent us an email admitting it! Then she had her office remodeled for around 15K. \r\n\r\nThey bought $35,000 worth of dune buggy golf carts.\r\n2nd remodel of her office - $$\r\nRemoved the picture of Swami Kripalu and put up a \"donors plaque\". In other words Money is more important than Swami Kripalu's message!\r\n\r\nIn one year they  fired about 32  long time employees, one of which was very dear to me. They brought in new people, loyal to CEO.\r\n\r\nThey also changed the rule on more vacation from 5 years to six! perfect timing!!\r\n\r\nSo many employees have quit or been fired, that we are now forced to work with sub par coworkers,  just to fill out the schedule.\r\n\r\nKripalu needs a union, badly!\r\n\r\nWhenever you send a suggestion to upper management they either ignore you, or fail to take action.  \r\n\r\nNow they have bought a very expensive new computer system that will bring us more \"in line\" with Hotels and their \"best practices\"  It adds more work for the staff and changes all our duties. Kripalu is not a hotel!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Wonderful People", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Dec 2020", "job_title": "Adjunct Faculty in Stockbridge, MA", "duration": "N/A", "pros": "Great community of coworkers, great guests, wonderful amenities", "cons": "hard to make a living, not open"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Feb 2020", "job_title": "Programs in Stockbridge, MA", "duration": "N/A", "pros": "The hope one feels upon winning work in the wellness field, at an organization that is a beacon of acceptance and connected community.", "cons": "Yogic vales exploited. Hard work is not rewarded. “We don’t like authenticity” direct quote from a Dean speaking for her colleague, the Chair of the Culture Committee. Raises do not exist. People who do well here are largely supported by family in one way or another. These people leave rather quickly, having more freedom to quit once they see what it’s really like to work there.\r\n\r\nCliques exist, worse than High School. It’s a perpetual popularity contest and echo chamber. My director didn’t know his their/there/they’re rules and cared only for his own career, while crediting his position to his former CEO’s unsolicited mentoring. Technology is painfully stodgy. The cyclical nature of leadership wears out middle-rung employees who need their jobs and don’t rotate out every few months, but rarely get promoted. If someone quits, that just means you have more work because it’s an opportunity to recoup that salary without firing somebody. People are fired because leaders are bad at planning or training new staff well enough so tasks aren’t dropped with turnovers. \r\nYou’re out in the wilderness, but surrounded b affluent people."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Managerial", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Mar 2018", "job_title": "Management in Stockbridge, MA", "duration": "N/A", "pros": "The people I worked with were amazing, you are a team and are close knit, its truly a home away from home.  It's the people I worked with that I miss the mostThe aesthetics are beautiful and its enriching to see guests life experiences change while they are there", "cons": "I was there less than 1 year before I had to leave as a result of retaliation and aggressive behavior from the Senior leadership team and HR. When the new CEO arrived it was a short period of time before everything changed, even the energy in the building became uncomfortable. As a result of numerous layoffs I was forced to take on the work load of 2 other full-time positions (with no pay),  worked remotely on personal time including vacation days to keep up with the work. This is a common theme within the organization to fire key roles & have others pick up the work especially if your salary. And they are very unfair and show favoritism when salaries are considered"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Great place to visit but wouldn't want to work there.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Nov 2012", "job_title": "Various in Stockbridge, MA", "duration": "N/A", "pros": "The guests; people from all over the globe come here in search of bettering their lives and the lives of others. The presenters; a wide variety of teachers & programs - program benefits for employees (if your schedule allows) are free or half price. The food; local, organic huge selection of food. (buffet style).", "cons": "Employees are expected to have a 'give without receiving' attitude. They do not receive raises, even to cover the increase of cost of living each year. Often decisions are made for employees without their input. Overall disconnect between management and staff. Many 'slackers' in management without trustworthy HR leader to confide in to make healthy changes. Top-down imperial thinking - for a company that is supposed to be mission driven - this is disheartening. Little room to grow or move up in the company, unless you're friends with the right people, that will increase your chances."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrific \"Anti-Kripalu\" Leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Nov 2017", "job_title": "Administrative in Stockbridge, MA", "duration": "N/A", "pros": "Glorious Berkshires setting with a destroyed mission.", "cons": "There are many current and former employees who feel compelled to review Kripalu and its current situation. During the interview process, many people ask about the Glassdoor and Indeed reviews - they want to know how the last 16 months of reviews remain so horrific. The answer is simple: \"Nothing is being done to stop it.\" The mission, being so \"verbally\" thoughtful, draws people in to the preliminary conversations / interviews. But once you dive a bit deeper, asking why the reviews are so negatively consistent, listen closely to the answers. Senior leadership is answering in the way they have been instructed and in the way that is consistent with their contracts. Answers are scripted and not honest.\r\n\r\nIf you Google the senior members, you will become better informed.\r\n\r\nGovernance is asleep and will remain so until they are obliged to take action. A contract is hard to break and there are many senior contracts in this non-profit."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Shameful Workplace", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Nov 2017", "job_title": "Anonymous Employee in Stockbridge, MA", "duration": "N/A", "pros": "Organic food, hilltop setting, peaceful views", "cons": "Kripalu was by far the most badly managed place I have ever worked.  Leadership is only interested in the spotlight. Deep insecurities permeate conversations and limit any ability to strategize and focus. Members of the administration are pitted against each other and the most cruel treatment is allowed to go unpunished. As a result, the best people resign because they have many options elsewhere. Those who stand up are fired.\r\n\r\nGovenance has been asked to step in and will need to at some point. \r\n\r\nSupporters stand in disbelief at the turnover and question their continued association. Many wonder why the story isn't being covered by local and national press. Perhaps a light in the face of this climate will help."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Dynamic, Evolving Organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2018", "job_title": "Coordinator in Stockbridge, MA", "duration": "N/A", "pros": "Leadership - Kripalu continues to evolve and shift to meet the ever-changing needs of its many constituents: guests and employees alike. The leadership has communicated through town halls, emails, and staff events that it cares deeply about the staff and about creating a positive employee culture. They have already implemented fair pay adjustments to increase wages to meet current market rates and have opened up access to the senior executive team for employees to speak candidly about what is important to them. I recently sent a couple requests to have lunch with a couple VPs simply to get to know them better and was warmly received. There are always formal and informal gatherings to meet with staff at all levels. If there is something you want to know, there is no shortage of opportunities to engage with leadership about it. It feels good to be here at the beginning of a wave of positive change.  \r\n\r\nBenefits - as a Kripalu employee we have, hands down, the best lunches of any employees anywhere. Our employee discount on meal plans means that I get to eat wholesome, nourishing and delicious meals prepared daily without the stress of bringing lunch to work. We also get to take workshops and trainings to support our individual interests and growth either for free or at a discount. And I try to take advantage of the free yoga classes and amenities available for use before or after work. It is a retreat center after all!\r\n\r\nCommunity - the folks here are a special crew. Most are committed to their work and show up with kindness, self-awareness, and are eager to work together to ensure our work has the greatest positive impact. Getting to know familiar faces and saying hello in the hallways always improves my day. Many of my colleagues have become friends. We find special ways to celebrate birthdays, births, holidays, and even formed a knitting club(!).\r\n\r\nMeaningful work - best of all, the work we do here truly matters. We are helping to transform people's lives by teaching them tools to come home to themselves and establish a grounded presence that will help them navigate whatever life brings them. As a retreat center, we provide them space and time to reconnect with themselves and to help them improve their lives and the lives of those in their circles. It is work that makes me proud.", "cons": "Career advancement - It's clear that though the functional hierarchy at Kripalu makes for effective leadership, it doesn't offer the flexibility needed to grant deserved opportunities for advancement. From recent announcements I understand that this is in review and I strongly believe that this will change in the future.  I hope that it does--both for Kripalu and for the employees who have proven themselves as leaders."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Seriously Disappointed", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Dec 2019", "job_title": "Director of Content in Lenox, MA", "duration": "N/A", "pros": "There are many great and caring people at Kripalu. Many of the elders and the spirit of the place are so special. \r\n\r\nEmployment benefits are great, including health/dental, and discounts at Kripalu on food and services.", "cons": "Certain leaders do not at all embody what we are told Kripalu is, a place to grow and be supported in our journey. \r\n\r\n Depending on your manager, you may or may not actually be permitted to access the benefits (for example attending workshops) you are promised.\r\n\r\n If you are sick, injured or in pain, do not expect any understanding or help or assistance in doing your job. I had and expressed a disability, and no accommodations were made."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Could Be Better", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Dec 2015", "job_title": "Anonymous Employee in Stockbridge, MA", "duration": "N/A", "pros": "I immediately fell in love with the atmosphere, the supportive environment, and the wonderful people who work there. I remember saying I had never met so many genuinely nice people in one place before.", "cons": "I found there to be a glass ceiling here. Being in my 20's, I had applied for 2 different positions within the organization and was rejected for one, and ignored about the other one before I decided to take my job search outside the organization. It was disappointing. There was also a policy where raises did not happen on a regular basis, and one of my co-workers who actually did ask for a raise was made to feel guilty for being \"more interested in money than the mission.\""}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Unpleasant, unprofessional and overall difficult place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Oct 2013", "job_title": "Anonymous Employee in Stockbridge, MA", "duration": "N/A", "pros": "Possible opportunity to take programs for free. Great food.", "cons": "I had high hopes working at Kripalu given its mission of compassion and yoga.  What I experienced was a culture of people who are generally unhappy, and who are unable or unwilling to engage in conscious communication and compassionate behavior. A telling example was when a guest asked me why the staff seemed so unhappy when the organization offered such great programs. I did not listen to a friend who was chewed up and spit out by Kripalu even though she urged me not to take the job.  I urge you to think twice before considering a job at Kripalu.  After my awful experience, I no longer consider Kripalu my spiritual home. That is a greater loss for me than having to quit so I could take remove myself from the toxicity."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Professional Massage Therapist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Apr 2015", "job_title": "Licensed Massage Therapist in West Stockbridge, MA", "duration": "N/A", "pros": "Supportive.  Growth potentials.  Varied clientele.  Meals on site very healthy.  Benefits for full time great.  A lot of on site education.  Pay is good compared to all other work places.", "cons": "Stress palpable with reorganization of department and entire organization.  Should smooth out soon enough."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The best company I have ever worked for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Aug 2020", "job_title": "Director in Stockbridge, MA", "duration": "N/A", "pros": "I have worked for several organizations in my 27 year career and Kripalu is by far the most fair and caring organization I have ever worked for. The leadership really demonstrates the company values and helps to create a positive company culture especially over the past two years. I loved that everyday I was challenged to be creative and innovative. Kripalu cares about it's staff and I loved working for a company with a mission that is helping to change the world.", "cons": "I'm only sad that Kripalu had to take a pause during this time of the pandemic."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Kripalu is a Disgrace", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Mar 2018", "job_title": "Manager in Stockbridge, MA", "duration": "N/A", "pros": "Views are lovely, healthy food and classes are available to employees.", "cons": "CEO has created a hostile work enviroment and is a disgrace in the local and yoga community. Narcissistic leadership is a leadership style in which the leader is only interested in herself. This leader exhibits the characteristics of a narcissist: arrogance, dominance and hostility. SVP is complicent waiting for CEO to implode so she can step in. If you are reading this and interviewng don't let them fool you. Get the truth from the professionals who left WILLINGLY."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Meh!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jun 2016", "job_title": "Licensed Massage Therapist in West Stockbridge, MA", "duration": "N/A", "pros": "Worker bees are very supportive if one another.  Managment is primarliy supportive of their worker bees.", "cons": "Managment is too insulated, fostering their own echos, getting bogged down in the latests CEO's \"vison\".  No overall reaching and producing excellence.  Facilities drab and worn and way, way out dated.  Espouse to yogic lifestyle uet have gone totally corporate.  Not honest managment style and have had many lawsuits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wonderful place", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Aug 2016", "job_title": "Anonymous Employee in Stockbridge, MA", "duration": "N/A", "pros": "Mission-driven organization with lots of great people who really care about the people they serve. There isn't anyone working there who isn't committed and caring.", "cons": "Tension between \"old\" Kripalu and more focused business strategies can lead to positive change happening slowly or in ways that inevitably lead to some leaders feeling confused and/or alienated."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A beautiful place to work, and great people to work with.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Nov 2018", "job_title": "Faculty in Lenox, MA", "duration": "N/A", "pros": "The campus is beautiful. Food is fabulous. Faculty, staff, and guests are helpful and supportive.", "cons": "As soon as they bring back the men's whirlpool, there will be no cons."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run, don’t walk – this is not the place for you…we promise!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "16 May 2018", "job_title": "Administration in Stockbridge, MA", "duration": "N/A", "pros": "Views, nature, healthy food, worthy guests.", "cons": "To the person who wrote the review titled “Unknown” please\r\ncorrect your Overall Rating. You probably meant to put 1 star and not 5\r\nstars.\r\n\r\nWhile it is eye-opening to see the mission of Kripalu dismantled under\r\nthe “leadership” of the CEO – the true entertainment reveals itself\r\nwhile watching the utter scramble of our current Senior Leadership\r\nTeam. I know them well and work with them on a daily basis. They are\r\nbailing water from a leaking ship, never knowing where the axe is going\r\nto land next. Kripalu is a nightmare and I mean it when I say, run don’t\r\nwalk.\r\n\r\nIf you want to be bullied, if you want to be verbally abused, work here.\r\nIf you want to see your friends and colleagues harassed, work here. If\r\nyou want to see guests, faculty, and donors walking away in disgust\r\nthen this is the place for you!!! \r\n\r\nAccept a job here and you can’t say you weren’t warned. Let the Glassdoor reviews / ratings, and the CEO’s rating help you turn your back on this very depressing workplace. Kripalu is sinking and no one is more aware than those who work here. This CEO and her “team” abuse, intimidate and malign the staff and now they are turning on each other. In addition, we have an HR\r\ndepartment that has fallen down on the job. But on the positive side –\r\nwe, as a staff are united, we are angry, we are documenting and above\r\nall, we are talking!\r\n\r\nKripalu can place a positive review first in the Glassdoor line-up but\r\npeople read further. HR writes that they “welcome a deeper\r\nconversation.” Hmmm, how interesting – since confidential\r\nconversations are immediately taken to the CEO (Yes, we have proof).\r\nBetrayal is commonplace (Yes, we have proof). Invasion of privacy is\r\nrampant (Yes, we have proof). “A deeper conversation?” Perhaps\r\nKripalu should be much less obvious."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sad Place to Work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 May 2018", "job_title": "Administrative in Stockbridge, MA", "duration": "N/A", "pros": "-Employee Assistance Package with price cuts on different insurance\r\n-No smoking on grounds", "cons": "-Since it's a non-profit, I thought working here would allow me to be part of something bigger and make real positive change in the world. Apart from my own disappointing employment experience, I'm also disappointed in how much the org keeps moving away from mission-based programming and actions. \r\nOpportunities seem to go to the few favorites on staff, or external hires. Veteran staff who are good at their job aren't rewarded, mentored, or considered for advancement opportunities. I keep hoping that things will change, but they don't. I feel cheated and this has been the most dis-empowering work experience in over 20 years of full-time employment. Truly saddening as this is meant to be a place for empowerment. A beacon even. The saddest part is that I don't see the underserved or marginalized being supported as a focus, but I do see more catering to the wealthy. \r\nPaid time off is scant and tricky. This is not aligned with the ideals of wellness that are integral to the mission and vision of a wellness retreat center. This is not a progressive employer. There is a very limited maternity leave and surprisingly no childcare option. \r\n-No matching 401(K) \r\n-While responsibilities increase and expectations become more demanding, compensation remains the same.\r\n-Culture and values sound great in theory, but they're not part of the employee experience."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Kripalu is Falling Apart", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jan 2018", "job_title": "Administrative in Stockbridge, MA", "duration": "N/A", "pros": "Natural setting with beautiful grounds.", "cons": "There is such systemic sadness in this building throughout all levels of the administration. While interviewing I asked about the Glassdoor and Indeed reviews that were so negative - and have now only gotten worse. Being on the inside I will honestly say, what is being reported is absolutely true and unexaggerated. Senior Leadership makes the excuse that only people who are dissatisfied  go to Glassdoor to write their \"complaints.\" That was their answer!  Nothing about taking the reviews seriously or trying to make positive change. At this point, they are having a difficult time getting people to accept positions because the reviews are honest and compelling. No one wants to step into an organization with reviews like this. \r\n\r\nFrom my perspective,  Senior Leadership, as a body of decision-makers, are puppets who bully at the request of the CEO and EVP.  Many are not suitable hires themselves, so they too are worried that they will be next.  This is perhaps the most vulnerable mess at Kripalu.  They know the secrets of the CEO and they  understand how she operates. They also understand that the Trustees are weak and therefore, no one will step in to rally for Kripalu's well-being and fiscal safety.  With so many holes, it is no wonder that Kripalu is truly failing in every direction.  \r\n\r\nAs with all places that guide and teach - if you have a fractured administration, you then have fractured faculty and classrooms.  The  guests , faculty and presenters ask me constantly, \"What is happening?\" Many are disconnecting from Kripalu and going elsewhere.  I supposed it was only a matter of time. \r\n\r\nMy advice if you are considering a job here is to walk away. You might think you can avoid being hit, but you can't. This is a \"top down\" bleed. If the CEO and EVP remain in place it will only get worse, and we already see what has happened oh-so-quickly.  \r\n\r\nThe Heart of Kripalu no longer exists.  It is a dark and dreary place indeed."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Company That  Cares", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Apr 2020", "job_title": "Assistant Guest Services Manager in Pittsfield, MA", "duration": "N/A", "pros": "Benefit from classes, healthy diet, beautiful grounds. They genuinely care about their employees and were willing to invest in them during tough times. During this pandemic, they were supportive to management, helped to cover wages, plus they donated food and PPE.", "cons": "This is an older facility and looks dated in places."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Beautiful place but many issues", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Apr 2017", "job_title": "Marketing Department Employee in Stockbridge, MA", "duration": "N/A", "pros": "Beautiful campus with delicious food and access to amenities like yoga classes, sauna, gym, and workshops.", "cons": "Unprofessional and emotionally unsafe work environment. Lots of interpersonal conflict and verbal abuse not properly handled by the HR department. Created a very stressful and toxic office atmosphere. Low pay and very little room for professional growth in position."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Cooking lunch for a high volume of guest", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "3 Apr 2019", "job_title": "Sous Chef in Monterey, MA", "duration": "N/A", "pros": "Uplifting experience throughout lunchtime and is good to be recognized by guests", "cons": "Not enough help so the tear and wear of body is kicking in"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great mission , great people, some conflict", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jan 2019", "job_title": "Director in Stockbridge, MA", "duration": "N/A", "pros": "Mission, people, working at center and benefits, free yoga and programs", "cons": "communication between departments is difficult. Some people really try to work together and make things easier, while some seem okay making things difficult for other departments"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Not perfect, but getting better all the time", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Sept 2019", "job_title": "Manager in Stockbridge, MA", "duration": "N/A", "pros": "Friendly co-workers; work has meaning; leadership trying to make things better for guests and employees; nice setting and good food.", "cons": "Hard to make changes because there are a lot of \"cooks in the kitchen\"; retirement plan is the missing benefit for employees"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Lost its way", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Mar 2018", "job_title": "Anonymous Employee in Stockbridge, MA", "duration": "N/A", "pros": "Rich history and a great mission", "cons": "New leaders are not focused on the staff experience.  Employment terminations have been happening at an alarming rate, most Terminations are because they are \"going in a different direction\".  Its true, but its a poor direction.  Surprised the Board is not taking action."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Kriplau", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "1 Jul 2020", "job_title": "Anonymous Employee in Stockbridge, MA", "duration": "N/A", "pros": "Wonderful co-workers, yoga, good food, beautiful campus, advancement opportunities.", "cons": "Wages not align with experience, Upper management was overpaid while others were underpaid even if they had more experience and potential for advancement."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Communication is a challenge", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Mar 2019", "job_title": "Administrator in Stockbridge, MA", "duration": "N/A", "pros": "Beautiful campus\r\nGreat food\r\nNice community\r\nSome great managers", "cons": "Direct communication from leadership is lacking.\r\nCommunication between departments is broken."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Kripalu", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jul 2015", "job_title": "Junior Controller in New Milford, CT", "duration": "N/A", "pros": "Great working environment, professional. Well manage organization.", "cons": "None to provide because I was not there for a long period of time. None to provide."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Human Resource Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "23 Jun 2015", "job_title": "Human Resource Manager in Stockbridge, MA", "duration": "N/A", "pros": "The organization is interesting, progressive and transformational.", "cons": "Still growing and defining the culture."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "IT Dept is Cheap and inflexable to change", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jan 2016", "job_title": "IT Consultant in Pittsfield, MA", "duration": "N/A", "pros": "The lake front property is nice to look at.", "cons": "No IT plan, no spare parts or systems.\r\nPlays shoot the message even for the for the simples mistakes."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Kripalu", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Sept 2013", "job_title": "Baker, Cook, Veggie Prepper, Etc in Lenox, MA", "duration": "N/A", "pros": "Excellent environment. Healthy residents & area. Wonderful community", "cons": "Site no longer exists as a community..."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Kripalu needs a Union -  United Food and Commercial Workers union", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Nov 2019", "job_title": "Guest Service Associate in Lenox, MA", "duration": "N/A", "pros": "Many really genuine, kind people (non management)\r\nGood food beautiful grounds.", "cons": "Hypocritical management.  Poverty wages for most staff while CEO rakes in hundreds of thousands of dollars."}]]