[
    [
        {
            "date": "28 Apr 2022",
            "title": "Internship Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 2 weeks. I interviewed at CARITAS (Austin, TX) in Feb 2022",
            "Interview Descriptions": "After submitting application I was reached out to by the Volunteer Coordinator over email and he asked to schedule a Zoom meeting. After this meeting, I was moved on to a second interview with the specific department that the Volunteer Coordinator recommended me to.",
            "Interview Questions": "Why do you want to work with an underserved population?"
        },
        {
            "date": "8 Apr 2021",
            "title": "Internship Interview",
            "results": "Declined Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. I interviewed at CARITAS (Lebanon, TN)",
            "Interview Descriptions": "At first,  a filled application was needed. Then I was invited for conference interview via zoom which lasted around 30 minutes and asked me several questions about my degree my past experiences",
            "Interview Questions": "What is your weak point"
        },
        {
            "date": "10 Aug 2017",
            "title": "Foster Care Case Manager Interview",
            "results": "No Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. I interviewed at CARITAS (Belleville, IL)",
            "Interview Descriptions": "I'm currently still in the interview process for this position at Caritas Family Solutions.  I was interviewed by two supervisors in the foster care program who were both very friendly and welcoming to me.",
            "Interview Questions": "How I have managed stressful situations in my past work."
        },
        {
            "date": "17 Oct 2015",
            "title": "Praktikant Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 5 days. I interviewed at CARITAS (Frankfurt am Main) in Jul 2015",
            "Interview Descriptions": "Ich habe mich Beworben und wurde anschließend eingeladen. Ich habe mit der Chefin bzw der Vorsitzenden gesprochen und mein leben und meine erfahrungen erzählt. Anschließend wurde mir mitgeteilt das ich angenommen wurde und das ich mich nochmals per mail bzw sie sich per mail bei mir melden wird damit ich mit meinem praktikum anfangen kann.",
            "Interview Questions": "Was sind ihre Erfahrungen"
        },
        {
            "date": "13 Jan 2016",
            "title": "Resource Navigator Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied through an employee referral. I interviewed at CARITAS (Richmond, VA) in Sept 2014",
            "Interview Descriptions": "It was brief and straight to the point.  They ask the necessary questions pertaining to the job i applied for.  If you are able to explain and are competent in your work no matter what they ask you will be able to pass the interview with flying colors.",
            "Interview Questions": "Give me an example of a client in crisis and how did you handle it"
        }
    ]
]