[[{"date": "15 Jun 2023", "title": "Diamond Grader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (New York, NY)", "Interview Descriptions": "4 interviews. Apply your CV-- HR--MANEGER VEDIO interview--NYC face to face interview I did pretty good, but start working time not works for me. Very nice people there! Very patient!", "Interview Questions": "Why want to work with GIA?"}, {"date": "30 Mar 2023", "title": "Staff Gemologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gemological Institute of America (Hong Kong)", "Interview Descriptions": "Nice interview. Self intro and why chose to apply. Didn’t ask any technical questions. Felt like they wanted to know more about my personality instead of existing knowledge. Second interview was a virtual one with global manager.", "Interview Questions": "What’s your favourite gemstones. Why didn’t you apply for a government job."}, {"date": "20 Mar 2023", "title": "Staff Gemologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "The phone screening interview is relaxed and last from 20 to 30 minutes, the recruiter is nice and willing to explain the question if you do not understand some formal business terms.", "Interview Questions": "- what working environment makes you frustrated - how your former boss will describe you - why are you job searching right now"}, {"date": "13 Dec 2022", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "sent resume and portfolio, 2 phone screenings with recruiter, followed by an at home technical / design challenge, then in-person interview with hiring manager, finally an in-person technical CAD test, plus mock instructional power point presentation & 2nd in-person interview with three education personnel", "Interview Questions": "Why do you want to become an instructor? What is something new you recently learned? What does the future of our industry look like? Where do you want to be professionally in 5 years? 10 years? What has been your biggest challenge to date professionally? How do you deal to stress? Do you have presentation and public speaking experience? Describe your work flow. Give a specific example of how you overcame a recent interpersonal challenge at work. What is your secret power?"}, {"date": "10 Dec 2022", "title": "Student Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "the interview was on time, very professional, pleasant experience. they asked the right questions and answered everything i asked questions about. i ended up turning down the offer because of a last minute move that would be taking place in the next six months.", "Interview Questions": "what are challenges in workplace"}, {"date": "12 Oct 2022", "title": "Diamond Grader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Gemological Institute of America (Manado) in Oct 2022", "Interview Descriptions": "I first had to complete a video interview where I recorded myself answering basic interview questions. Then shortly after, I received a phone call to confirm my answers. The whole process was easy but the website they use to conduct the video recorded interview process didn't work very well.", "Interview Questions": "Will you be able to complete a 12 week training period with no days off"}, {"date": "17 Sept 2022", "title": "Client Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Gemological Institute of America (New York, NY)", "Interview Descriptions": "Be yourself. And have good professionalism and show you have good manner. Customers will be glad to come. Easy interview, have to have some customer work related experiences. It’s not important to have to work in big names before. ", "Interview Questions": "How do you deal with problem clients?"}, {"date": "12 Sept 2022", "title": "Diamond Grader Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (Carlsbad, CA) in Aug 2022", "Interview Descriptions": "Asked to do one sided recorded interview a few days after applying, basic questions and unlimited attempts. A few days later I received a call to set up a video interview with two individuals on the team. I was told they were going to go over the job and make sure it was a good fit. Not at all what I was expecting. They grilled me with questions about situations I have been in at past jobs and asked how I handled it, behavioral questions. Look maybe 45 minutes. A few days later I was asked to come in for a technical interview, pretty hard for someone who has no idea what diamond grading looks like. I was tested and told I would hear back in a week or so.. two weeks later I called and nobody got back to me. 3 weeks later I called, messaged everyone I could and again nobody got back to me. Coming up on the 4th week, I finally got an email that I was not selected. ", "Interview Questions": "Why do you want to work at the GIA? How did you hear about the opportunity? Describe why you past employment would make you a good fit for this position? Explain a situation in your past job that was hard and how you handled it? Explain a time when you had a disagreement or problem with a past employee and how you handled it? Describe a time when you had set goals for your sales, did you meet them and if not, why? If we asked you former boss to describe you in one word, what would it be?"}, {"date": "12 Jul 2022", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Gemological Institute of America (Johannesburg) in Jul 2022", "Interview Descriptions": "Phase 1 - Face to face interview \r\nAnswer behavioral questions on how I would handle situations given scenarios.\r\n\r\nPanel of 3 interviewers less than 10 questions each. \r\n\r\nWarm introduction, introduces themselves and their roles.\r\n\r\nLastly, Open an opportunity for you who is being interviewed to ask questions.", "Interview Questions": "How would your previous manager describe you in one word "}, {"date": "20 Jun 2022", "title": "Diamond Grader Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Gemological Institute of America (Carlsbad, CA) in May 2022", "Interview Descriptions": "A lot of work for low chance of hire without diamond grading passion/experience. Started off with a one sided interview where you can re-record yourself answering questions. I made it to the next stage where I was interviewed by two men. They asked a lot of negative leading questions about experiences I’ve faced rather than what I can bring to the table. It was hard to come off as positive.", "Interview Questions": "Do you have experience with a microscope?"}], [{"date": "10 Mar 2022", "title": "Education Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (Carlsbad, CA) in Feb 2022", "Interview Descriptions": "Phone screening then one in-person interview; didn't hear back from company for a month after my in-person interview. Sent two follow up emails to HR that were ignored. Sent a stock, no-reply email thanking me for my resume (no mention of interview) and informing me that the position had been filled.", "Interview Questions": "How might you go about solving the problem you just described?"}, {"date": "9 Mar 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Gemological Institute of America (New Delhi) in Feb 2022", "Interview Descriptions": "I am just seeeing the lastest questions ask in company to get updated for my final year job and i have getted experience . Its good way to time pass", "Interview Questions": "Where you from and how are you"}, {"date": "22 Dec 2021", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "Detailed Process. Step by Step interviews were conducted by many Department Heads. Once the final decision is made by the organization a call is received from HR to inform about the selection and further formalities to be done.", "Interview Questions": "Talk about yourself, your Experience, Describe Why would you like to work for this company."}, {"date": "2 Jan 2022", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Gemological Institute of America (Mumbai) in Dec 2021", "Interview Descriptions": "First round: Group discussion\r\nSecond Round: Interview\r\nThird Round: Technical Interview \r\n\r\nOverall experience was really nice, great Ambience \r\nvery helpful staff, the whole process didn’t take much time. GIA is providing an excellent platform for freshers who want to get into this industry.", "Interview Questions": "Why this Job?\r\nAre you familiar with the industry?\r\nWhat motivates you?\r\nWhy would we hire you?\r\nWhat attributes do you have which will benefit you here?\r\nEtc"}, {"date": "14 Oct 2021", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "One way online interview, sending videos of myself answering 10 questions. Unlimited time to think about each question and unlimited takes to rerecord my answer. Typical questions.  48 hours to complete the interview after I got an email from GIA. It's best to start answering them early.", "Interview Questions": "What is prompting your current job search? How did you hear about the Diamond Grader Opportunity and what do you know about GIA? Have you applied to GIA before? If yes, what position did you apply for?"}, {"date": "10 Sept 2021", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Gemological Institute of America in Sept 2021", "Interview Descriptions": "1. In-person interview (pretty basic, with 3 interviewers)\n2. personality test (?) they will give you two online tests to do - which is just testing your big 5 personality and which types of job suit you \n3. Technical test (they will teach you to use microscopes to examine the diamond and mark the details)", "Interview Questions": "Why did you apply for this position? \nWhat kind of jobs you also applied? "}, {"date": "3 Aug 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Gemological Institute of America in Aug 2021", "Interview Descriptions": "Was agreed to meet at a certain hour, when I arrived they gave me a  very long form that consisted of my personal details and previous experiences. Waited for 45 minutes until I just gave up and left. The person interviewing before me told me they were waiting 3 hours!!", "Interview Questions": "There was no interview a"}, {"date": "23 Aug 2021", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Gemological Institute of America (Bandra) in Aug 2021", "Interview Descriptions": "Interview was not taken even after 6 hours of waiting. No GD No PI. It is such a pathetic experience for an organization like this which appears decent but has bad people practices", "Interview Questions": "None. Interview was not even conducted for majority of people."}, {"date": "1 Aug 2021", "title": "Diamond Grader Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "First, there will be a phone interview by asking you your cv stuff, why you want to join GIA. Then they will invite you to GIA to have a f2f interview and a technical test. \nIn the f2f interview, there will be 3 interviewers, and only one interviewee, that's you. They ask a lot things regarding your cv. After that, 1.5 hr is needed for the technical test. Just follow what the \"teacher\" said is okay. Not difficult to do.", "Interview Questions": "What are you interested in in this post?"}, {"date": "19 Jun 2021", "title": "Diamond Grader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "1. Application Reviewed\n2. Video Introduction Interview Request\nget a link , and make a record for the video.\n3.Interactive Video Interview with a Lab Leader,\ntalk online with a lab leader,\n4.Technical Interview On-site with Lab Tour", "Interview Questions": "introduce yourself.\nwhat kind of manager you'd like to work with?\nHow do you want to work with your group?"}], [{"date": "6 Apr 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "The HR staff called and asked a few questions, like what are your current job duties , why do you leave current job, why you choose GIA and others. And we also went through the resume", "Interview Questions": "Why you leave current job"}, {"date": "21 Sept 2021", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Gemological Institute of America in Sept 2020", "Interview Descriptions": "Interview was for the diamond grading position 3 different people asking about different aspects of the job. Some technical questions and some personal. Overall a nice experience but expect some tricky questions during the interview.", "Interview Questions": "Have you ever made a mistake?"}, {"date": "9 Jul 2020", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "I was asked to come in for an interview with the hiring manager.  I was asked a series of questions about myself,  my work experience,  how the skills I've acquired over the years would make me a good fit for this company and some situational questions (i.e. describe a time when you were face with a problem. How did you solve it? ) After this I was tested on my technical skills to see how well I could use a microscope and follow directions.", "Interview Questions": "Tell me about yourself."}, {"date": "28 Jan 2019", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gemological Institute of America (Carlsbad, CA) in Jan 2019", "Interview Descriptions": "It takes 3 steps. 1st is video interview, 2 is in person interview, still waiting for the result from 2nd interview. Don't know what is the next step, but as introduced by the HR, we need 3 interview", "Interview Questions": "what is a challenge that you have overcome, what is kind of boss that you wanna work with...all typical questions"}, {"date": "21 Jul 2021", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gemological Institute of America (Carlsbad, CA) in Sept 2018", "Interview Descriptions": "It was first a video interview then an in-person interview and lastly had a technical interview. Very simple and straight forward. Asked normal interview questions you would expect. and the technical part was simple.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Jun 2018", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Gemological Institute of America", "Interview Descriptions": "I had two interviews. One by the HR manager and the other by current CIO.  Both interviews were very high-handed, self-serving and arrogant. \r\n\r\nHR manager 'Screening' interview was very detailed, brisk and terse 44-minute interview. It could have easily passed for an actual job interview.\r\n\r\nThe in-person was a panel interview, mainly run by the leader who was the CIO. Again very brisk, self-serving and arrogant. Questions were aggressive and rapid fire. Felt like a master-slave interrogation. There was no mutual sharing or exchange of ideas. The narrative of his plans kept shifting. He was pumping me for more information about PM methodologies, without having paid or hired me. (Currently there as no PMO at the company)\r\n\r\nHe seemed devoid of morale and knowledge of people management. \r\n\r\nThe interviewer also made some false statements about the job and company, that would fall into misrepresentations.\r\n\r\nThe company works hard to hide innards, seems to follow lifeless precision outside the lab and does not exhibit warmth in interactions.", "Interview Questions": "What brought you here? What are you looking for?"}, {"date": "6 Jun 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "It took almost 3 weeks from application. The first round is a phone interview with some basic hr questions and then they initiated you to the GIA building for a one-round in-person interview.", "Interview Questions": "Teamwork or individual job, which do you prefer?"}, {"date": "14 Feb 2022", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Gemological Institute of America in Jun 2018", "Interview Descriptions": "The process was lengthy, but this was over 9 years ago. I would like to think the interview process is much more concise with less interviews. I had to interview with the HR team 2 different times then a manager and finally the VP.  This would have been much better if it was one interview for a few hours. The questions were average and the team was very nice.", "Interview Questions": "What skills and attributes can you bring to the job? "}, {"date": "28 Jun 2018", "title": "Principal Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Gemological Institute of America (Carlsbad, CA) in May 2018", "Interview Descriptions": "I went through a very thorough and thoughtful interview process. It started with an HR phone screen which was then followed by a phone screen conducted by the hiring manager.  Next was an on-site group interview and then a final phone interview conducted by an upper executive staff member. The whole process was very professional and I was extremely impressed with the quality of the staff from HR all the way to the final executive.  I was very pleased to get a job offer and accepted with no reservations.", "Interview Questions": "Whiteboard exercise"}, {"date": "19 Apr 2018", "title": "Education Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Gemological Institute of America (London, England)", "Interview Descriptions": "Lots of situational questions asked. Make sure you've read the job description well! In tray activity was simple, with focus on prioritising work load. No right or wrong answer as such", "Interview Questions": "give an example of a time when something unexpected happened"}], [{"date": "2 Apr 2018", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gemological Institute of America", "Interview Descriptions": "The interview was a 3 part process. \r\n\r\nThe first was an online interview, where you just have to record yourself answering questions through an app.\r\n\r\nThe second is an in-person interview with supervisors. It's a pretty straightforward interview with regular interview questions. \r\n\r\nThe third is a technical interview. I can't disclose the process, but it's mostly just to make sure you can get a grasp of the job responsibilites.", "Interview Questions": "What got you interested in applying for this position?"}, {"date": "27 Feb 2018", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 days. I interviewed at Gemological Institute of America (Tel Aviv-Yafo)", "Interview Descriptions": "The interview process was very relaxed.  They asked me about the company, about my goals about the position. Watched 10 mins long video about the company before taking the interview. Good luck", "Interview Questions": "What do you know about the company"}, {"date": "13 Feb 2018", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America in Feb 2018", "Interview Descriptions": "The interview was easy, couple behavior questions and some about the job.\r\nYou’ll have unlimited time to think and try to record your answer that makes the process very pleasant and less nervous.", "Interview Questions": "What is the accomplishment you are proud of the most?"}, {"date": "23 Oct 2017", "title": "Diamond Grader Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gemological Institute of America (New York, NY) in Oct 2017", "Interview Descriptions": "very transparent, very direct mostly questions regarding how you behaved in work circumstances. They also asked me to clarify certain parts of my answer to better understand what I was saying. I liked that they did this.This made me feel that they were really listening.", "Interview Questions": "How did I handle a work situation that involved conflict "}, {"date": "16 Feb 2018", "title": "Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gemological Institute of America (Carlsbad, CA) in Oct 2017", "Interview Descriptions": "Very Detailed and In-depth. The team is very personable and professional. Started with a phone screen, then communications with various departments. All in all very well planned and insightful", "Interview Questions": "Not really a standard interview very dialog driven. "}, {"date": "1 Aug 2017", "title": "Compensation Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (Carlsbad, CA)", "Interview Descriptions": "Applied online, had a phone screening with the recruiter and then a phone interview with the hiring manager.   Followed up with the recruiter in regards to the phone interview, who provided no information as to where I was in the process.  Continued to follow up with the recruiter who stated that they did not have any new information.  Very unprofessional as to the lack of response from the hiring manager/recruiter.  However, after looking at the reviews of this company, it appears that I dodged a bullet!!", "Interview Questions": "What is one of your weaknesses?"}, {"date": "27 Jul 2017", "title": "Procurement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "Pre-screen interview was somewhat odd. I wasn't asked very many questions and had to wait two weeks to hear back. It was very brief and the questions were broad and difficult to answer. The time spent was mostly focused on questions I had for her. I didn't feel as if I was asked any questions about my experience or how I could be a good fit.", "Interview Questions": "What is your experience with cost containment?"}, {"date": "13 Nov 2017", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Gemological Institute of America (Mumbai) in Jul 2017", "Interview Descriptions": "1. Fill candidate information form\r\n2. Interview by panel: Panel consists of Manager and Dept Head\r\n3. Verbal discussion interview  about 30 mins duration\r\n4. Selection confirmation on phone and email if selected", "Interview Questions": "1. Describe profile and work experience so far\r\n2. What is the reason for job change\r\n3. Are you willing to work in shift timings"}, {"date": "28 Jun 2017", "title": "Preliminary Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (New York, NY) in Jun 2017", "Interview Descriptions": "I applied online. Shortly after, I received an invitation for a online video interview. The questions were very straight forward and you were given unlimited tries to record your response. Soon after I submitted this, I received a call to schedule an in-person interview. The in-person interview was done with two interviewers and they asked behavior questions and questions that asked me to reflect on how I handled previous situations. At the end, I was scheduled for a technical assessment interview. A few day later, I went in and learned a bit about diamond grading and then did an assessment using the microscope.  I was offered the position less than a week after. In all, the process was very fast.", "Interview Questions": "What qualities do you look for in a boss?"}, {"date": "14 Jul 2021", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (Carlsbad, CA) in Apr 2017", "Interview Descriptions": "1-phone interview (a few regular questions)\n2-recorded video (you should answer to a few questions and record them and send them back to them)\n3-tecnical interview (working with Microscope and basic  diamond grading)", "Interview Questions": "background and educations, skills, flexibility, positive and negative points in previous job\n"}], [{"date": "24 Aug 2019", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (Carlsbad, CA) in Apr 2017", "Interview Descriptions": "Video interview asking very basic interview questions ranging from what were my best qualities to what were my worst (gag) to what did I know about about gem stones. Also, what career path was I interested in pursuing at G I a.", "Interview Questions": "Have you ever worked here before."}, {"date": "8 Mar 2017", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gemological Institute of America (New York, NY)", "Interview Descriptions": "i received a call 3 days after i applied online, got an interview onsite with three managers, too many behavioral question, each one has a question sheet with like 20 question each.\r\nAlthough i graduated from GIA as a diamond grader, i never got the job.", "Interview Questions": "SWOT analysis question, tell me about your previous job, how would you react to a certain situation etc."}, {"date": "21 Feb 2017", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (Tel Aviv-Yafo) in Oct 2016", "Interview Descriptions": "First personal interview with HR and manager that went just fine, the interviewers were nice and pleasant and straightforward, then technical interview where I needed to  grade a diamond that was a bit tiring but also went fine, and then a polygraph which was bad experience, very long and intrusive and unnecessary questions, really didn't enjoy it and I failed it even though I was honest, just nervous.", "Interview Questions": "Why did you leave your previous job?"}, {"date": "1 Jul 2016", "title": "Watch Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Gemological Institute of America (Jersey City, NJ) in May 2016", "Interview Descriptions": "I spoke to 3 different people.  During the actual interview, they are all texting on their phones the whole time which turned me off from the start.  They didn't really ask me any questions either. Overall, it was a weird interview for me...", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "29 Nov 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Gemological Institute of America (New York, NY) in Apr 2016", "Interview Descriptions": "The interview was very easy going and smooth. I was asked general questions about my previous experiences in this field and some general stuff about my education and skills in this field.", "Interview Questions": "Tell me about yourself?\r\nDo you have experience in the job you are applying to?\r\nHow do you get along with people?"}, {"date": "28 Dec 2015", "title": "IT Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Gemological Institute of America (San Diego, CA) in Oct 2015", "Interview Descriptions": "Phone screening interview with a manager who I've heard is no longer there. Very long pauses as the manager transcribed responses. Very standard, stilted questions. Very little follow up to my answers. The interviewer was polite and respectful. I received no response to my thank you note. It was then over 2 months before I got a system generated letter telling me I didn't get the job.", "Interview Questions": "Describe a successful project."}, {"date": "21 Oct 2016", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gemological Institute of America (New York, NY) in Aug 2015", "Interview Descriptions": "There was a video interview in which there were prewritten questions and you merely record yourself answering the questions and have an unlimited number of edits. There was later a group interview which really played more of a role as an informational seeing that everyone was moved on to the next round of interviews. The second to last interview was with 2 senior members of the lab and then finally a technical interview. These were all on different days.", "Interview Questions": "Why do you want to work for GIA"}, {"date": "22 Jul 2015", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (New York, NY) in Jun 2015", "Interview Descriptions": "I applied online through GIA's website and got an internet interview immediately. One week later I got an email for onsite interview. The first interview is more like a meeting than an interview because basically all the candidates were just sitting in the conference room and listening to HR to introduce GIA and the diamond grader position. The real in person interview happened in the week after that and I did went there because HR said they don't sponsorship H1B visa for that position.", "Interview Questions": "Behavior questions. Tell me about a previous job or task that required you to be detailed and accurate in your work. What are your long term goal and short term goals?"}, {"date": "4 Jun 2015", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Gemological Institute of America (Carlsbad, CA)", "Interview Descriptions": "I would suggest people to not apply to GIA for any position as it is not worthwhile. It was a waste of my time, energy and money. \r\n\r\nThis was an interview scheduled for 1pm. I waited for about 30 minutes until somebody from HR finally came. The first part of the interview was an overview of what GIA is and does, the second part was the one on one interview where none of the questions related to the job position or company. Majority of the questions were behavioral questions which made me feel like I was in a psychologist's office. The last part of the interview was a technical test where you have to grade a diamond . The interview lasted for 4 hours.\r\n\r\nI was told that I would know in 2 weeks whether or not I got the job. I contacted them after 2 weeks, no reply. Contacted them again after a month and they said that they will tell me after interviewing a few more applicants. After a few more follow up emails with no response from GIA, they finally replied stating that they have filled up all the grader positions. \r\n\r\n Overall, my experience with GIA was terrible. The management is a complete mess. They say it is a non-profit organization, but it is not.", "Interview Questions": "A lot of behavioral questions. "}, {"date": "5 May 2015", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "I applied to around 20 positions over the last 4 years. The first time i got called in immediately for a group interview, then for an in person with the technical director. Upon meeting Her, she seemed cold but I figured it was her poker face and did not think anything of it when I was rejected. I had an interview a second time a year later for the customer service dept, and then this past week for Diamond Grader, and again with the technical director and the lab head, who was fairly pleasant. The technical director seemed less cold this time, but it felt forced. The interview went well despite some of the questions seeming a bit too loaded, or so I  thought. When I checked my application status online a few days later, they changed it to \"no longer under consideration\" when i emailed my HR contact, she stated that they went forward with a more qualified candidated. Considering the ridiculous turn around that they have,  I think it is fairly obvious that they are not picking the right candidates, and I stated many times that this was my career choice. Some of my colleagues think that my ethnicity played a part in their decisions, but that is a matter that I am not willing to get into without proof. Now I will find another company to take my skill to.", "Interview Questions": "Can you name a time that you had a conflict with a coworker and how did you resolve it?"}], [{"date": "14 Nov 2019", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gemological Institute of America (Mumbai) in May 2015", "Interview Descriptions": "Phone interview followed by HR interview and then a Technical interview. Offer was made a week after technical interview. Then had 6 month long paid training which everyone had to successfully complete with required quality of grading.", "Interview Questions": "Why are you leaving your current company?"}, {"date": "31 Jan 2016", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gemological Institute of America (Carlsbad, CA) in Apr 2015", "Interview Descriptions": "first, video interview which record your response to the questions they submitted before. you can record your response again and again until you're satisfied with it then submit it. they even give you some guidelines and tips how to do it. \r\nsecond, personal interview which you go to the location to have an interview with HR then lab manager.\r\nthird, technical interview which you go to the location again to show how well you can adjust to the lab environments and equipments.\r\nthen you wait...", "Interview Questions": "what do you know about our company?"}, {"date": "9 Aug 2016", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Gemological Institute of America (Carlsbad, CA) in Apr 2015", "Interview Descriptions": "began with a video interview. the video interview gives you the chance to answer the questions multiple times until you are satisfied.  The second interview is on site. The interview begins with a presentation of the job, then I met with two different individuals separately.  The third interview you are asked to grade a diamond.", "Interview Questions": "How well are you at taking criticism "}, {"date": "19 Jan 2016", "title": "Preliminary Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gemological Institute of America (New York, NY) in Mar 2015", "Interview Descriptions": "First an online application was completed followed by a video interview. Upon completion, an in-person interview follows where you and two members of management exchange sit in a room and interview.", "Interview Questions": "Do you mind repetitive, production style work?"}, {"date": "12 Apr 2016", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Gemological Institute of America in Mar 2015", "Interview Descriptions": "One phone Interview if you catch their attention, you will be called for one on one interview. It usually takes about 2 weeks or more once again if you really catch their attentions over the phone. It might be even quicker!", "Interview Questions": "Are you familliar with Lenel System (it's a video viewer softwar to monitor camera and alarms)"}, {"date": "8 Feb 2015", "title": "Diamond Grader/Career Services Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "I actually interviewed for two positions with GIA.  I didn't get either of them but the process was so fair and impartial it was a great experience. I would recommend that you practice behavioral interviews questions over and over again. Make sure you can explain why you left one company to move to another. Many behavioral interview questions can ask the same question but in a different way make sure your answers are consistent.  The technical interview for the Diamond Grader position will be perfect for a biologist who is familiar working with a microscope. It's a laboratory position within a production environment so if you have experience performing repetitive tasks you should emphasis that during the interview. The campus in Carlsbad is beautiful and there is an opportunity to travel to other global locations as well. The educational training provided my the company is a great benefit to its employees.", "Interview Questions": "What management style do you prefer and why?\r\nDescribe a time when you used your communication skills to deal with a difficult co-worker?"}, {"date": "9 Feb 2015", "title": "Career Services Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Gemological Institute of America in Feb 2015", "Interview Descriptions": "Applied online and had phone appointment set via email about 1 week later.\nThe recruiter called an hour and half late and was by far one of the rudest recruiters I've dealt with.  She seemed distracted, was shuffling papers and at one point was talking to someone else.\nShe was not able to answer any questions about the position and stated \"she's just the recruiter.\"", "Interview Questions": "why GIA?"}, {"date": "13 Sept 2014", "title": "GIA Diamond Grader Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America", "Interview Descriptions": "Applied online. Took three weeks to receive an email for an phone interview. Group interview and test using microscope. Went through background check and drug test followed. Overall, very professional positive experiences.", "Interview Questions": "N/A"}, {"date": "24 Nov 2015", "title": "Diamond Grader - Preliminary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Gemological Institute of America (New York, NY) in Jul 2014", "Interview Descriptions": "I had a phone interview and then we scheduled an in person interview which consist of two interviewers, a walk through of the lab (really high tech building)  and then a skill assessment after can not give details (swore to secrecy sorry).", "Interview Questions": "Basic interview question: Tell us about yourself, Why are you interested in this position, What do you know about this company, What salary are you drawing?"}, {"date": "3 Jan 2016", "title": "Lab Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Gemological Institute of America (New York, NY) in Jul 2014", "Interview Descriptions": "Gorgeous new facilities. Give yourself an extra 15 minutes to arrive because getting through security can take some time as a guest. I interviewed for 2 different positions. The first interview was as a photographer; while it was a laid back meeting, the interviewer did not come across as a true professional and didn't even look at my portfolio. It was obvious I wasn't getting the position. 2nd interview (same day) to work in the labs with those staff was a much more standard experience with businesslike attitudes and concise, clear discussion. You must sign an agreement that you do not sell and are not a manufacturer of goods containing gems, etc in order to work for the company.", "Interview Questions": "Why are you interested, what experience, do you understand the pay is low (entry level). Standard questions."}], [{"date": "5 Jun 2017", "title": "Staff Gemologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gemological Institute of America (New York, NY) in Apr 2014", "Interview Descriptions": "Personality questions and some skill test on the interview, followed by a panel interview with the department management team. Generally very straight forward questions and not stressful at all during the process.", "Interview Questions": "How do expect yourself to work in a team environment?"}, {"date": "19 Oct 2013", "title": "Lab Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Gemological Institute of America (Carlsbad, CA)", "Interview Descriptions": "At the time managers were friendly, and the process was easy.", "Interview Questions": "Nothing really, about the same as any other interview."}, {"date": "31 Jul 2013", "title": "Laborotary Technician Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Gemological Institute of America (New York, NY)", "Interview Descriptions": "The position is located at NYI was contacted through email by a hr manger one month latter after summitting my resume online. We schedule a time to do the an onsite interview. No presentation needed.The interview was given by 4 people of the technology group together, the questions are almost followed my resume items,  the people are really nice. the whole process take only 1 and half hours. Due to security reasons, I didn't get a tour around the company", "Interview Questions": "What's your plan for next 5years?"}, {"date": "2 May 2013", "title": "Diamond Grader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Gemological Institute of America", "Interview Descriptions": "Personal Interview nd Technical round", "Interview Questions": "regarding Lean process"}, {"date": "18 Jun 2013", "title": "''Entry Level'' Diamond Grading Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Gemological Institute of America (New York, NY) in Apr 2013", "Interview Descriptions": "there were 3 interviews. a group session to fill out the applications and details about the job and company, and then a second one with the Director and Lab Coordinator. third interview was a technical diamond grading test.  after a 1.5 month process it did not seem it was entry level ''no experience necessary'' position after all.", "Interview Questions": "what are your strengths and weakness.. what has been a repetitive situation in any daily basis or in a work field that may have been challenging or difficult to deal with and what has been done to improve it or prevent it. "}, {"date": "24 May 2012", "title": "Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Gemological Institute of America in Apr 2012", "Interview Descriptions": "Very relaxed but highly professional.", "Interview Questions": "There were no unexpected interview questions"}, {"date": "31 Mar 2016", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Gemological Institute of America (New York, NY) in Feb 2012", "Interview Descriptions": "A friend referred me to this job. The HR manager interviewed me. Then I got an offer in a couple of weeks. The whole interview process is easy. The position I applied was an entry level position.", "Interview Questions": "Most questions were behavior questions."}, {"date": "27 Nov 2013", "title": "Lab Worker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Gemological Institute of America (Carlsbad, CA) in Sept 2011", "Interview Descriptions": "the interview was long and diferents step ,first by phone ,latter in person and then drug test and background check but the most important thing i get the job", "Interview Questions": "it was very random question very teqnical and complicated but the person who interview me help me to understand the question"}, {"date": "1 Jun 2013", "title": "Diamond Grader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gemological Institute of America (New York, NY) in Apr 2011", "Interview Descriptions": "There were 2 interviews. a group session to fill out the applicationa nd find out about the company, and then a second one with the Director of Operations and a rep from HQ in Carsblad.", "Interview Questions": "Where did i see my self in 5 years with the company."}, {"date": "30 Sept 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Gemological Institute of America (Mumbai) in Jan 2011", "Interview Descriptions": "One HR round, then HOD round then MD round, Worst round is to please MD, then strict background verification, along with police clearance. HR will give you details policy report which you have to acknowledge. Every document submitted will be checked thoroughly.", "Interview Questions": "Tell me something about yourself?"}]]