[[{"date": "12 Nov 2022", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HealthPoint (Washington)", "Interview Descriptions": "Multiple interviews with various staff, including medical director, clinical manager, NP, MDs, support staff. They are very friendly. It seems like a supportive environment. The pay scale was under whelming.", "Interview Questions": "What is your greatest weakness?"}, {"date": "13 Nov 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at HealthPoint (Washington)", "Interview Descriptions": "Very comprehensive process. From manager to panel to director. 3 rounds in all. very professional. 3-5 panelists in all. Take home assessment and presentation for final round. 30-60 min each round.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "19 Sept 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HealthPoint (Washington) (Des Moines, WA) in Sept 2021", "Interview Descriptions": "Virtual Interview with 3 people \r\nThey asked about my experience in the field.\r\nThey asked a couple of behavioral questions. \r\nThey were very unprofessional and rude. I was having a hard time explaining my answer and they were kind of looking at each other and trying not laugh while waiting for me to finish my sentence.", "Interview Questions": "Weakness?\r\nWhere do you see yourself in 5 years?"}, {"date": "24 Sept 2021", "title": "Front Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HealthPoint (Washington) (Renton, WA) in Aug 2021", "Interview Descriptions": "straight forward, no medical experience required. customer service experience is preferred and foreign language preferred. Phone screen and then virtual interview with panel from the clinic you are applying to", "Interview Questions": "When did you do more than what was required?"}, {"date": "15 Jul 2021", "title": "Healthcare Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at HealthPoint (Washington)", "Interview Descriptions": "Process of several interviews: phone screen, in person interview, another phone call, another in person interview. Everyone I spoke to was friendly but communication died off towards the end of the process (was pretty much ghosted)", "Interview Questions": "Describe a project where after completion you felt like you could have done more."}, {"date": "25 Jun 2020", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at HealthPoint (Washington)", "Interview Descriptions": "The interview involved a pre-set list of questions delivered by the CMO and Business Director. Multiple personal and behavioral-type interview questions as well as clinical questions. Lasted approximately 1 hr and allowed for plenty of questions", "Interview Questions": "What policy or procedure did you disagree with and what did you do about it?"}, {"date": "3 Jun 2019", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HealthPoint (Washington) (Renton, WA) in May 2019", "Interview Descriptions": "There where three people there interviewing me altogether. I had a phone interview before I had an in-person interview. I then was called back for a typing exam, to see how well I would work as a data entry specialist.", "Interview Questions": "Why do you want to work for HealthPoint? "}, {"date": "19 Jan 2019", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at HealthPoint (Washington) (Renton, WA)", "Interview Descriptions": "I was contacted within the week of submitting my application by e-mail. Scheduled a phone interview the following week. Then an in person interview. Present was the supervisor and two leads. They pretty much just asked questions off a sheet. I got the impression they werent formally trained in the selection process. It seemed more about if you were likable and knowledgeable. Had a second interview with another supervisor followed by a data entry and MS software 2010 skills test.", "Interview Questions": "What have you done to keep up your skills?"}, {"date": "22 Aug 2020", "title": "Nurse Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at HealthPoint (Washington) (Tukwila, WA) in Nov 2018", "Interview Descriptions": "Start with pre screening phone call. Panel interview consisted of people from different department in the clinic. I got a tour of the clinic. At the end I got a phone call for the offer. It was fairly efficient.", "Interview Questions": "Are you prepared to triage anyone who walks in the door?"}, {"date": "8 Mar 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HealthPoint (Washington) (Seattle, WA) in Jan 2017", "Interview Descriptions": "It was very easy basic questions they were very interested in the experience that I have had in the past with previous employers and how that can play in this current roll", "Interview Questions": "experience  and previous jobs "}], [{"date": "8 Apr 2018", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HealthPoint (Washington) (Renton, WA) in Dec 2015", "Interview Descriptions": "The first time I was  supposed to be interviewed the manager canceled at the last minute.. when I came in for the second time to do my interview they didn’t know who I was and I had to re-provide my resume.....", "Interview Questions": "N/A"}, {"date": "19 Jan 2013", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HealthPoint (Washington)", "Interview Descriptions": "HR person called first and did a brief phone interview asking why I want to leave my current position, how much am I looking to make, what are my skill sets, etc. A week later I was called back for an interview with the dept supervisor and two other staff people from the dept. Basic questions were asked.", "Interview Questions": "Do you know what a FQHC is?"}, {"date": "11 Oct 2015", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at HealthPoint (Washington) (Renton, WA) in May 2012", "Interview Descriptions": "All day interview with many different individuals at varying levels. Part of the day spent at headquarters and then at the specific site I would be working at. Even lunch with my potential team including MAs, nurses and front office. A lot of repetition in questions but everyone was really nice. Exhausting day though, being on best behavior for that long. Beautiful offices and facilities.", "Interview Questions": "Tell us about a time that you had a difficult patient.How did you deal with them?"}, {"date": "1 Jul 2015", "title": "IS Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at HealthPoint (Washington) (Renton, WA) in Mar 2012", "Interview Descriptions": "Simple, I went in for a testing took the test and was called back the same day to set up and interview. Interview was done 1 week later with 4 other members of the department asking me questions in turn. Fairly simple and laid back interview.", "Interview Questions": "What is the craziest thing that have every happened to you."}]]