[[{"date": "4 Jul 2023", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "The interview process was well organized. I felt that it was thorough and also provided detailed information about the job. All of the questions were relevant and appropriately asked in a conversational, relaxed manner.", "Interview Questions": "Why do you want to become an adjunct instructor?"}, {"date": "1 Jun 2023", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "Great interview process where they wanted to get to know you more on a personal level with you could feel. Was also a group interview with other students my age", "Interview Questions": "What a typical Sunday is for you"}, {"date": "31 May 2023", "title": "Recreational Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2023", "Interview Descriptions": "Questions about my work style within a group setting and 3 biggest weaknesses. Additionally they asked what I do well and if I knew anyone in the position I was interviewing for.", "Interview Questions": "Tell me about yourself and 3 biggest strengths and weaknesses"}, {"date": "16 Feb 2023", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Grand Canyon University", "Interview Descriptions": "I was referred by an old coworker of mine who currently works there. I have more than enough experience and was put through over 2 hours of interviews (3 interviews total) over the course of about a month. I received an email a week after my third interview saying they were moving forward with other candidates.", "Interview Questions": "What makes you stay motivated?"}, {"date": "9 Nov 2022", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "It went well- everyone was welcoming and had a great experience. Interview was average and asked typical questions that you would expect. I walked away feeling like I have the autonomy to make decisions", "Interview Questions": "Describe your teaching methods for online adult learners"}, {"date": "6 Oct 2022", "title": "Cashier Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "loved the interview process here at GCU I had a great expereicne & every one was friendly & cooperatie. One thing I liked was that they were interested in what I had to say which was good very good good", "Interview Questions": "what was one thing they asked you"}, {"date": "27 Jun 2022", "title": "Account Executive/UDC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "HR brief phone interview basic questions, mostly trying to weed out if you can travel to Phoenix for a week and you understand there is NO negotiating salary. Manager phone interview, set up for zoom Business plan interview with 3-5 Managers.", "Interview Questions": "Tedious! Too much for the salary they offer! Required to create a 30-6-90 day business plan and powerpoint to submit and present to 3-5 Regional Managers. "}, {"date": "8 Jun 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "The interview process focused on customer service experience and university program knowledge. Interviewer inquired about computer experience (microsoft office, database systems, etc.) and telephone experience. Depending on role, being bilingual is helpful.", "Interview Questions": "Describe your experience in customer service."}, {"date": "8 Feb 2023", "title": "University Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2022", "Interview Descriptions": "Zoom interview with hiring manager. Was extremely welcoming and asked questions pertaining to past work experiences. Was transparent about the job itself and what it entails. Let me know what to expect.", "Interview Questions": "A specific circumstance where you had to relationship building and how did it help you succeed"}, {"date": "6 May 2022", "title": "Technical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "It was very easy going and I felt very comfortable talking to the interviewer the entire duration of the interview. The interview felt as a process that was tailored to what I was looking to pursue individually.", "Interview Questions": "How will this opportunity further develop your skills?"}], [{"date": "20 Apr 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "1-2days phone and 1-2 weeks for on-site interview \r\nNot a difficult but more likely easy questions\r\nPretty organized process ..\r\nDetails and points of hiring process are adequately provided …. \r\nOnce you are selected for interview, GCU informs details as you need", "Interview Questions": "General Things about all contend from resume "}, {"date": "15 Jun 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2022", "Interview Descriptions": "the process was very easy and fast. I brought my resume and they asked me what i study why and why i want the job. the manger was very nice and friendly", "Interview Questions": "what are you studying why you want the job"}, {"date": "29 Mar 2023", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2022", "Interview Descriptions": "Very easy, basic interview. The only technical question that was asked was, \"What operating systems do you have experience with\". I don't know if I even consider that a technical question to be honest.", "Interview Questions": "What operating systems do you have experience with?"}, {"date": "24 Aug 2021", "title": "Site Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "Fair, organized, moved along in a timely fashion.  Everything was handled remotely.  Questions were on knowledge and experience. Excellent communication regarding next steps.  Excellent training for onboarding. Overall, positive experience.", "Interview Questions": "Long time ago--questions were generally regarding knowledge of pedagogy."}, {"date": "13 Sept 2022", "title": "Curriculum Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Aug 2021", "Interview Descriptions": "The process was quick and fairly easy. First I had an Interview screener with HR  Panel interview with department teams. That was the most stressful. \nProject sample to submit to Hr for panel to review ", "Interview Questions": "How do manage multiple projects at once? "}], [{"date": "29 Jun 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "The actual interview was very quick like speed dating. There was not enough time to answer or ask questions. Also, the interview process was super slow and time consuming.  Had a lot of waiting time.", "Interview Questions": "What are your qualifications for this position?"}, {"date": "22 Jul 2021", "title": "Adjunct Instructor of History Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Jul 2021", "Interview Descriptions": "I am an Alumni and I cant even get a job here. I would suggest to other applicants to look elsewhere. There is no such thing as an interview process with this particular college.", "Interview Questions": "Asked if I had experience "}, {"date": "3 Jul 2021", "title": "Admissions Counselor (Ground) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2021", "Interview Descriptions": "There were three interviews. The first was a GCU recruiter phone screening, which lasted about 20 minutes. Next, there were two live Zoom interviews with the hiring manager, which took about 45 minutes each.", "Interview Questions": "Why are you interested in this position??\n"}, {"date": "9 Aug 2021", "title": "Technology Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2021", "Interview Descriptions": "Mainly job specific functional experience questions were asked instead of acknowledging skills set that can be applied to a job. Interviewer was very professional and knowledgeable. Heard back about 10-14 days after interview that another candidate was selected.", "Interview Questions": "Have I worked in construction?"}, {"date": "28 Jun 2021", "title": "Account Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University in Jun 2021", "Interview Descriptions": "The first round was very basic questions.  The first 15 minutes was the recruiter asking yes and no questions.  The second round the managers got into more in depth questions.", "Interview Questions": "Do you have any driving violations?"}, {"date": "12 Oct 2022", "title": "Veterans Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University in Jun 2021", "Interview Descriptions": "The interview process was quick, efficient, and professional. The interviewer was informative and answered my questions thoroughly. They were prompt in their responses from establishing a time and date for the interview, and called within 2 minutes of the established time, and kept to the anticipated 1 hour timeframe. They followed up within a few days for a second interview for the final round.", "Interview Questions": "Previous experience, comfortability with networking, travel expectations, technology skills/abilities, strengths/weaknesses, etc. All very standard interview questions."}, {"date": "29 Mar 2021", "title": "Admissions Counselor - Online Campus Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2021", "Interview Descriptions": "The three hiring managers were extremely unprofessional. I took into consideration that the interview was over Zoom, so it would be a little more complicated to read body language, etc. All three managers were dressed very casual and two of them were wearing caps. One of the hiring managers looked like she got back from the gym. I assumed it was a very laid back environment based on how they were dressed. \n\nThe first question I was asked was to tell them about myself. In all interview practices and previous interviews I was always told to not get personal and talk about my previous experience on how it is relevant to the job I am applying for. One of the managers was annoyed, slammed his pen on the desk, and cut me off and in a rude tone asked what I liked to do for fun. \n\nAs the interview went on one of the other managers turned off his camera to go answer the front door. Basically it was one hiring manager answering all of my questions and he doubted my skills and said \"We are trying to convince older people to come spend $50k-$70k here and walk away with a single piece of paper in 4-5 years.\" I was also taught not to challenge the interviewer(s). His camera was also facing the side of his face, so when he spoke he wasn't looking at me. The interview was rushed and they showed no interest from the beginning. \n\nWhen I asked questions and I asked about the culture of the GCU and their depts. I was applying for, the manager that was rude proceeded to tell me about his management style saying he was blunt, etc. Which was also a red flag for me.\n\nThey made me want to quit and I did not even have the job yet. \n\nCommunication was lacking after the interview. It has been two weeks and there has been no email about my receiving or not receiving the job. It's of course safe to assume I did not get it, which makes it easier on my end to save me from sending a rejection email. \n\nI spoke with a few of my other HR relatives and friends and it is safe to say that the hiring managers at GCU for that Admissions Counselor Dept. Is extremely unprofessional and they need to do some training with their HR people.", "Interview Questions": "Hi, Tell me about yourself?"}], [{"date": "7 Jan 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Houston, TX) in Jan 2021", "Interview Descriptions": "Communication and hiring process was excellent. Interview was over the phone and faculty was very nice and supportive.  The issue is the immense amount of work expected for very little pay. I have taught for another university for a number of years for 3x the pay and much less work required.  I am unsure how they get anyone to work here for these demands.", "Interview Questions": "How will you integrate your religion into your classroom?"}, {"date": "21 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University in Jan 2021", "Interview Descriptions": "Short, only lasted 15 min. Did not ask as many questions as I was expecting to get.  Half the interview was me asking questions. I was expecting a lot more from this interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Dec 2020", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "Call from the interviewer - voice only - that was mostly one-way. The interviewer asked simple questions to determine experience. There was no room for negotiation in their insane expectations for participation (read: handholding students through their school).", "Interview Questions": "Do you have experience with Zoom"}, {"date": "14 Jan 2021", "title": "Account Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Virginia Beach, VA) in Dec 2020", "Interview Descriptions": "Recruiter was professional and the process was great.  interview last about 30 minutes.  Hopefully I hear back in a couple days for the next process.  Sounds like a wonderful opportunity.", "Interview Questions": "Describe why would be a great fit for the role? "}, {"date": "8 Feb 2021", "title": "Adjunct Faculty Member Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Dec 2020", "Interview Descriptions": "Introduction, orientation discussion, LoudCloud, Pay Scale, Expectations for deliverables, customer care, management, case and relationship management, etc.  The interviewer was kind, and repeated the low pay scale was non-negotiable several times.", "Interview Questions": "Why do you want to teach for Grand Canyon?\r\nExperience related to job description"}, {"date": "9 May 2022", "title": "Campus Safety Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Nov 2020", "Interview Descriptions": "Interview was very easy. They ask basic questions and are really just trying to make sure you’re a good person. I had mine during the pandemic so it was via zoom, I believe they are doing face to face now.", "Interview Questions": "What drew you to join this team?"}, {"date": "16 Dec 2020", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Nov 2020", "Interview Descriptions": "They did one phone screen with me and then never followed up when they asked for times to meet. It felt very disjointed how they did the interview process.  I was fairly disappointed with them being that they are an educational institution I expected better from them.", "Interview Questions": "Very standard - what are you looking for ? What is your experience..."}, {"date": "15 Oct 2020", "title": "Ace Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "GREAT interview process that was clear and direct with what they were looking for. Questions were just like any other interview questions, strengths, weaknesses, why they should hire you, etc.", "Interview Questions": "What are your weaknesses and strengths"}, {"date": "26 Sept 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "Received an email to interview and had a topic I had to present in front of the college.  I was given one week to complete the topic. After the presentation I was told they would call me and they followed up the next day with an offer.", "Interview Questions": "No questions were asked. More of the college informing me of how the pay and system works. "}, {"date": "1 Sept 2020", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "The interview was a great experience. The interviewer was personable and I think I will work great with my coworkers. I am excited to hopefully start there in a couple of weeks.", "Interview Questions": "How would you describe yourself "}], [{"date": "11 Aug 2020", "title": "RNC-OB Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "Attempted to schedule multiple times,  repeatedly canceled appointments with short notice.  Never scheduled with same person.  Very unorganized.  Not specific on expectations of process and lack of consistency.  Unable to obtain any follow up information.  Very disappointed.", "Interview Questions": "Prior salary,  availability and soonest start date"}, {"date": "5 Oct 2020", "title": "Mortgage Loan Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Oct 2019", "Interview Descriptions": "Relaxed, straight to the point. The hiring manager was really nice and forward with the daily tasks of the job. I heard back a week after the interview. Filled out a piece of paper during the interview with answers", "Interview Questions": "How will you do this tedious position?"}, {"date": "24 Mar 2021", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Grand Canyon University (Phoenix, AZ) in Aug 2019", "Interview Descriptions": "It was easy. The interviewer seeks to know more about you and what you have to offer to the company. Make sure you are able to answer questions about your skillsets with different scenarios.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "30 Dec 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in May 2019", "Interview Descriptions": "It was pretty easy going it felt like I was in a luncheon and there was not any stress in the meeting room. It was more of a conversation rather than an interrogation.", "Interview Questions": "Why are you the prime applicant for this position?"}], [{"date": "7 Jan 2023", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2019", "Interview Descriptions": "It was simple and easy! My interviewer was cordial and very efficient. I felt at ease and had all of my questions answered to put me at ease. I am glad I had the person I had.", "Interview Questions": "How do you support student learning to hellp students be better?"}, {"date": "7 Feb 2019", "title": "Process Engineer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Grand Canyon University (Phoneton, OH) in Nov 2018", "Interview Descriptions": "Phone Call obsolete An official face-to-face meeting of monarchs or other important figures.\r\n2. Any face-to-face meeting, especially of an official nature.\r\n3. A conversation in person (or, by extension, over the telephone, Internet etc.) between a journalist and someone whose opinion or statements he or she wishes to record for publication, broadcast etc. The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates, and making a hire.", "Interview Questions": "Tell me about your self "}, {"date": "8 Jun 2018", "title": "University Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Grand Canyon University", "Interview Descriptions": "Grand Canyon University typically performs a phone interview as well as an in person interview. GCU uses the behavioral interview process. More specifically the STAR method. STAR stands for Situation, Task, Action, and Result. Examples of this method are easily found online.", "Interview Questions": "Grand Canyon University uses the behavioral interview process. More specifically the STAR method. STAR stands for Situation, Task, Action, and Result. Examples of this method are easily found online."}], [{"date": "14 Feb 2018", "title": "University Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University", "Interview Descriptions": "Applied online. Received an email to complete a phone interview with an HR rep. Did an in person interview with same HR Rep. Then did a final in person interview with panel of managers", "Interview Questions": "STAR- Tell me a time where you did not keep your promise to a customer. "}, {"date": "11 Feb 2018", "title": "Qualifying Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "It started with a phone interview and then moved onto a panel interview. Once the panel interview was completed, it was about a week before I was offered the job via phone with a job offer via email.", "Interview Questions": "What is your military experience?  "}, {"date": "21 Feb 2018", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (San Jose, CA) in Feb 2018", "Interview Descriptions": "I had a phone interview that went really well.  Then had to do a writing sample.  Had 24 hours to do this, just answer sample emails.  Then I was called to set up a time to meet with the Program Manager.  Was told it was casual and to meet at a coffee shop.  I thought I did really well and had a good connection.  Boy, was I wrong! The next day all I got was a generalized \"no reply\" message from their HR Department saying that basically liked someone else and that was the end of that.", "Interview Questions": "How do you stay organized? "}, {"date": "18 Aug 2022", "title": "Online Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Dallas, TX) in Jan 2018", "Interview Descriptions": "The interview process was definitely less intense than what I have experienced at other universities.   It was a simple phone interview with one person, as opposed to a zoom interview with 5 or 6 faculty members.", "Interview Questions": "N/A"}, {"date": "25 Nov 2017", "title": "Public Safety Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Canyon University", "Interview Descriptions": "During the interview, they asked questions in a very professional manner and gave time for you to also ask questions in return. If you did not understand something they went out of their way to explain it in a different way. Also was light-hearted and told stories of past events.", "Interview Questions": "Why do you wanna work for us?"}], [{"date": "7 Oct 2017", "title": "Dissertation Chair Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Grand Canyon University", "Interview Descriptions": "A lot of questions about Christian values, very little. They are in dire need of PhD adjuncts, as turnover rate is very high; most quit very quickly. Hiring process is a joke. You have 3 weeks of unpaid online training, that is more about GCU covering their assets, than really training new hires. Horrible experience from beginning to end.", "Interview Questions": "No difficult questions. They really need bodies to fill open courses."}, {"date": "22 Aug 2017", "title": "Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "The position posted was labeled as a professor \"online,\" so I assumed, like most positions this was a remote application. Within the day I applied, I received an email requesting times for an initial phone screening. The individual called me the next day and went over basic interview questions, like \"when are you available to start' and \"explain a time you had to work with a student during a personal issue.\" In addition, I was told the salary starts at 50-55 a year, which is rather low for a position requiring a PhD or EdD, and the position is in a cubicle setting in the administration office of GCU. The position has specific hours you need to work, such as 11-7 or 12-8pm, and on Fridays it is 8-5pm. There is no flexibility in the schedule, and the position may allow for one day of working remote after a year. The interview led to follow up requests from faculty and department chairs requiring transcripts", "Interview Questions": "Explain a time when you had to show excellent customer service."}, {"date": "22 Aug 2017", "title": "Instructional Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "The recruiter just described what the job position was all about and told me that she would get back to me with the further interview process. The recruiter also explained the university dress code and what was expected of me in this position.", "Interview Questions": "Would I be willing to go ahead with the process?"}, {"date": "21 Aug 2017", "title": "Account Executive-Online Division Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Albany, NY) in Aug 2017", "Interview Descriptions": "Applied online via Indeed Job link, heard back via email within a few days requesting a time for a phone screening.  Interview was 30 min long with an HR person.  VERY basic interview with questioning focused on my resume, pay with corresponding companies and highlights of my sales accomplishments.  Nothing creative with the questions here.  HR person spent a significant amount of time explaining that training would be in AZ starting on 9-5-17 and continuing for 2 weeks.   Then back to AZ for 4 days in mid-October.  Asked if I had any conflicts with these dates or the travel.  HR explained pay structure which is NOT negotiable.  Interesting, I've never had the experience in an interview where they tell you the pay and to pretty much take it or leave it.  The position was advertised at $65k and that was the \"Level 1\" pay.  Quota metrics were based on how many new students you get to enroll with the online program, 28 for Level 1.   In a year you are eligible for level 2, 40 students @$70k, year 2 Level 3, 50 students @ $75k.  In the subsequent year you have the option of going to level 4, 60 students @$90k.  \r\nAlso discussed was free tuition and some other benefits.  Kind of a weird situation/place.  I have been out of full time work for over 2 years but doing consulting on the side, so I said yes to everything question related to my availability.  \r\nI was asked how many years experience in Higher Education I had, I said more than 25 yrs.  In hindsight I would guess my age scared them off, I was not asked to continue to the next stage.  Odd since my background in HE sales and as a training coach fit nicely into the job responsibilities which included walking prospective students through financial aid and admissions applications.  Sounds like a lot of hand holding.", "Interview Questions": "If hired will you continue with your consulting business?"}, {"date": "19 Aug 2017", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Grand Canyon University (Sacramento, CA) in Aug 2017", "Interview Descriptions": "I was originally referred by the position by a GCU employee.  HR Talent Acquisition  reached out within a week asking to set up a phone interview. The interview was pretty basic - see questions below - then she asked me to fill out a writing sample. This consisted of three scenario based prompts you might encounter as a counselor. Once I sent that back  a secondary interview was set up with the regional manager.", "Interview Questions": "How does your previous experience connect to this position? "}, {"date": "1 Aug 2017", "title": "Account Executive Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University in Aug 2017", "Interview Descriptions": "Filled out an online application for the position within a week I received an email requesting a phone interview to be scheduled for the next day. The interview was easy with most of the questions asking you to describe your positions listed on the resume.  The recruiter also asked what was the pay for each position.  In the end, I didn't move on to the next stage of the interview process, which was weird because I do the exact same thing at my current job. The school would have been new to the area and it would have made sense for them to move forward with the person from the major competitor in the area who did the duties they were asking for.  I received a standard rejection letter with no explanation.", "Interview Questions": "How much was your pay at\" X\" position?"}, {"date": "17 Jul 2017", "title": "University Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "I had to complete a Q&A, phone interview and two face to face interviews. First face to face interview was with the HR Rep and the second interview was with Three Supervisors", "Interview Questions": "Have you ever worked in a call center environment?"}, {"date": "4 Jan 2018", "title": "Online Division Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Jul 2017", "Interview Descriptions": "It was a three step process. An email was sent to me to answer a few questions, after that I did an over the phone interview. The last part was an in-person interview.", "Interview Questions": "Describe a situation when you had a difficult customer and how you handled it. "}, {"date": "19 Aug 2017", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2017", "Interview Descriptions": "They contacted me after a week of submitting my application.  I did a phone interview, it was more detailed than I thought it would be although I thought it went well.", "Interview Questions": "What are your strengths?"}, {"date": "8 Sept 2017", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Grand Canyon University (Phoenix, AZ) in May 2017", "Interview Descriptions": "Work as an adjunct if you expect to get an interview.  I got the adjunct job by applying to online job postings.  Phone call with HR.  In person with the department leader.  You need a Masters degree in your area in order to be considered for work as an instructor.  The adjunct experience answers most of the questions your boss will have about you as a potential full time employee.  Your students will share their experiences with your boss.   They want intelligent, dynamic, clear and relevant classroom experiences.  Speak English well.  Know your subject of expertise.  Grade fairly and treat students with respect.  If a student is failing, follow the \"Early Alert\" process and document missing work, poor quality or absences and there will be no surprise angry complaints about your performance as an instructor.", "Interview Questions": "Give an example of an effective use of technology in the classroom"}], [{"date": "3 Feb 2017", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University in Feb 2017", "Interview Descriptions": "I had an odd experience applying here, overall. I usually send in a \"dummy\" resume first, something very similar to my job experience but with a spoofed identity to see what they do or don't respond to. It was very nearly immediately rejected - something like a few hours passed before I got a \"no thanks\" email. \r\n\r\nI looked for things the employer might be biased against to edit out. I dropped my first two jobs, which were in a more manual labor/service environment based on previous experience helping friends doctor their resumes for Grand Canyon and other similar \"Sales, but we call it something different\" jobs. Bingo! Grand Canyon is biased against people who had labor jobs, Lord knows why, but pretending I never broke a sweat while making money snagged a phone interview right away with identical practical experience. \r\n\r\nThis is where it gets pretty weird: I got the regular screening email. It's \"can you work this shift, is this pay acceptable, can you commute to our location\" stuff. It's designed for very basic answers, and it's pretty much binary. Either you are willing to take the job as it is, or you aren't. I filled out the form in a very basic, unobjectional way. \r\n\r\nOne day later they sent me a rejection letter. It was in fact the identical form rejection letter they sent my first \"dummy\" resume. Something turned them off, I guess? It would be useful to know what for future interviews, so I sent a letter asking what red flag had popped up and disqualified me. I was very politely told to screw off. \r\n\r\nI've been rejected at first application before, plenty of times. I've been rejected less times at the interview stage. I've never had a screening call cancelled for no apparent reason before, though. Just overall very weird.\r\n\r\nAnyway, tips! I have a few friends who have interviewed here before, so here goes:\r\n\r\nThey absolutely prefer you to either have a degree or be working on one. I had a friend get to the interview stage who had to explain his medically necessary year-long hiatus from his degree program, and that was enough to get a \"We would rather have someone who is *actively* pursuing a degree, but thanks.\" rejection. \r\n\r\nGrand Canyon hates people who had jobs they view dumb people to hold. If you want an office job, may moses bless you if you were a police officer or a carpet cleaner at some point. The base assumption made is that those people couldn't have done those jobs and still be capable typists or salespeople. Again, don't ask me why, because it's not my culture, but just edit those references out.\r\n\r\nOne friend who lived a few miles away was rejected for wanting to commute on a bike. He explained after being told that they needed \"reliable transportation\"(he lived a mile away and had a $1000 bike) that he also had a car, but preferred to bike for exercise when possible. It apparently soured the interview. He related that it had a very \"bikes are for poor people\" feel.\r\n\r\nTL:DR; Grand Canyon set up and then reneged on a phone interview for reasons they refused to explain and were terse and unhelpful when asked why. Grand Canyon hirers for \"desk jobs\" will, based on the experience of me and a handful of friends, reject anyone who lists any kind of manual labor or service industry experience. One bicyclist friend was rejected for what appeared to be \"bikes are for poor people\" bias. Gaps in college education, even if well explained, will net you a rejection - pretend you are current and hope they don't check. Basically don't be poor, and don't have been poor at any time.", "Interview Questions": "\"Can you make this commute?\" \"Is the listed salary sufficient?\" \"Can you work this shift?\""}, {"date": "12 Jan 2017", "title": "Student Services Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Dec 2016", "Interview Descriptions": "Phone Interview with HR, then in-person interview with same HR Rep and then a panel interview with three hiring managers for the department.  The phone interview with HR has you go over your resume almost line by line.  They want a clear understanding of what your role was in each position and what you did.  Once you get the HR in-person interview, that was situational questions.  If you pass that you are immediately asked to schedule the panel interview which will be more situational questions.  If not, the HR rep will just say thank you, and that they will be reaching back out to you shortly.", "Interview Questions": "Situational and behavioral questions.  Asked things like \"describe a time when...\""}, {"date": "18 Mar 2017", "title": "Site Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Pittsburgh, PA) in Dec 2016", "Interview Descriptions": "A hiring manager called me and described the position.  I was asked given the position needs whether I felt confident I could do the work.  Following, I submitted several pieces of documentation (i.e. teaching certification, clearances, transcripts, etc.).  When all was approved, I had online faculty training.  It was mostly open forum discussion questions online.  You must get a passing score to proceed.  Later, I was given a selection of school sites to choose to supervise.  You are able to decline assignments for any reason.  Currently, I have 3 students. The workload is equivalent to the pay.  I receive $550 for observing a student teacher four times a semester.    I can choose when I visit.  Following, I submit my evaluation of the student through an online management system.", "Interview Questions": "Do you think you can give constructive feedback to teacher candidates?"}, {"date": "15 Nov 2016", "title": "Junior Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Grand Canyon University", "Interview Descriptions": "Received an email to confirm an interview, interviewed about a week later. After the interview I was informed that I will be notified in about two weeks. After three weeks I was offered the job", "Interview Questions": "How do you use your strengths to overcome your weaknesses?"}, {"date": "27 Feb 2017", "title": "Lopes Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Oct 2016", "Interview Descriptions": "October 2016, applied online and got called in for an interview the next week. Interview went pretty good. Lots of behavioral questions like \"Tell us about a time when you had to deal with a conflict within your team.\" It took around 15 mins tops. They called me a few days later with an official offer.", "Interview Questions": "Tell us about a time when you had to deal with a conflict within your team."}, {"date": "22 Jun 2016", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "I had a phone interview with the department chair a couple of weeks after applying to the position. We went over questions that described the position in detail and the program's curriculum.  Interview questions focused on my past experience and why I would be a good fit for the program. The interviewer was nice and allowed me to ask questions throughout the interview rather than waiting until the end.", "Interview Questions": "What is your ideal work environment?"}, {"date": "16 Jun 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Grand Canyon University", "Interview Descriptions": "Applied for job and spoke with recruiter.  This was not a difficult process (moderate recruiting process) takes about 2 months including a course to understand university, background check, must wait for all employer feedback before you can move to the next level.  Must pass the course before you can to teach at University", "Interview Questions": "Why do you want to teach for Grand Canyon"}, {"date": "11 Oct 2017", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2016", "Interview Descriptions": "Interview process was straight forward. Sit down with 2-4 team leads that are hiring for their teams. Place is a glorified call center when you get down to it.", "Interview Questions": "A lot of \"What would you do in ___ situation\" type questions. "}, {"date": "25 May 2016", "title": "Regional Director of Operations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "Hope that the little window you might have open is the one this time. But, no matter your fit for the position, the Vice President has already chosen his candidate prior to the interview process so describing the interview doesn't really matter. The last two opportunities really didn't even have interviews, a new person was just placed in the job.", "Interview Questions": "Tell me about what you can contribute or add to the culture of this team."}], [{"date": "12 Apr 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ) in Apr 2016", "Interview Descriptions": "Applied online, received email back with screening questions and phone interview time, replied to screening questions and scheduled phone interview with HR. Had phone interview, then 1:1 interview with same woman from the phone interview. She then told me I had to come back for a panel interview with the managers. I scheduled and attended the panel interview. Did not receive offer after 3rd interview. The whole process took about 2 weeks", "Interview Questions": "\"As a business we over promise things that we are not able to follow through on. Tell us a time that you did this\"\r\n\"Tell us a time a customer didn't know what they wanted\"\r\n\"Tell us about a time you gained the trust of a customer\""}, {"date": "21 Jul 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in Apr 2016", "Interview Descriptions": "It was a pretty simple process. They called for a phone screening and then scheduled an in-person interview. The in-person interview was about 45 minutes to an hour of STAAR questions.", "Interview Questions": "Give us a time that you had to help someone over the phone."}, {"date": "13 Apr 2017", "title": "University Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Apr 2016", "Interview Descriptions": "This was a very generic interview. Everyone was very nice and they all did a wonderful job of building up Grand Canyon University. It started as a phone call, then an in person with the recruiter, then with the managers and then a call to confirm the offer.", "Interview Questions": "All generic questions, \"tell us about a time that you faced rejection and how you over came it?\" They really just want to see how you think and that you are able to hold a conversation. "}, {"date": "20 Jul 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University in Apr 2016", "Interview Descriptions": "I applied online and had a phone interview within a week. The following week, I met the Department Head and had an informal interview which lasted about 1.5 hours. IT wasn't like an interview at all. The HoD and I discussed about my past lecturing/tutoring experiences and how similar they were to my prospective classes at GCU. The interview went very well and at the end of the discussion, we finalized on the classes that I would teach.", "Interview Questions": "Informal discussion about past experiences in lecturing/tutoring "}, {"date": "13 Nov 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Apr 2016", "Interview Descriptions": "I applied online to their website.  The university recruiter calls you first.  If you can meet the schedule of the classes, they setup an in-person with the department chair.  The University has a large pool of adjuncts.  It's not enough money to make a full-time job.  Once in the adjunct pool the assignments are given according to scheduling needs.", "Interview Questions": "Experience. What you know about the content.  Need a Masters degree."}, {"date": "1 Mar 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "Had a one-on-one interview with a manager and he made the recommendation for my employment.  Received the offer call from Human Resources and started training a week after interview.", "Interview Questions": "How do I relate to students and getting them motivated to start school"}, {"date": "13 Apr 2016", "title": "Online Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in Mar 2016", "Interview Descriptions": "Applied online.  Phone interview first.  Then in-person interview with H.R.  Then in-person interview with 2 managers in the online division.  I accepted the offer, but was the offer was descended due to background check.  Very disappointing, because was very honest about DUI on application, but I didn't write down the place I was convicted.", "Interview Questions": "Tell me about a time when you had difficulty with a manager or team member and how you handled it.\r\n\r\nAll questions were the STAR method...\r\n\r\nBackground check extensive including credit check."}, {"date": "20 Jul 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2016", "Interview Descriptions": "The interview process was pretty straightforward. I applied via Glassdoor and got an interview request email from the supervisor from Grand Canyon University the next week. I was interviewed by the Administrative coordinator and then I was also interviewed by the dean of College of Doctoral Studies for around 30 min at Grand Canyon University.", "Interview Questions": "What skills you have that will benefit this position?"}, {"date": "26 Feb 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Feb 2016", "Interview Descriptions": "I was contacted by a recruiter on Indeed about the position.  I responded and she sent me the link to the online application and told me to send her an email when I completed it. I was emailed the next day by someone in HR to do a phone interview.  Before concluding the phone interview she invited me for an in person interview the following week.  After my interview with the HR manager I had another interview with 2 team managers.", "Interview Questions": "Tell me about a time you had a difficult customer and how did you handle it? \r\nTell me about a time you had to learn a complex system. \r\nTell me about a time you had a to deal with a customer who wasn't sure what they wanted."}], [{"date": "27 Jan 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "I had a brief phone call followed by a 4 on 1 formal interview later that week. I met with a few different managers from different teams. I assume there were multiple positions available.", "Interview Questions": "They asked basic interview questions (strength& weakness)"}, {"date": "16 Jan 2016", "title": "Regional Business Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Grand Canyon University (Albuquerque, NM) in Jan 2016", "Interview Descriptions": "First did a phone interview with the HR manager in charge of talent recruitment-nation wide. After passing her, i made it to the final interview with 2 levels up in management. HOWEVER, i was asked to present an entire territory management plan, 3 pages worth of leads, and also do a powerpoint presentation and present via Google Hangouts. I spent no less than 40 hours in 2 weeks researching and putting together all of the information for the interview. Was told no one had made it that far in the hiring process in 6 months. I was excited and put so much effort and work. Then, was told, sorry we had a lot of highly qualified individuals, but thanks for the massive amount of research done, and thanks for putting it in a wonderful presentation and good luck! Luckily i had another offer and was able to take the other job, that i had NOT put as much effort into.", "Interview Questions": "typical what do you know about us? why should we pick you? concentrated on me putting together tons of research for the second interview."}, {"date": "23 Apr 2017", "title": "Faculty Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2016", "Interview Descriptions": "Managers were very nice and encouraging. They asked questions about my experience with multi-tasking and with difficult customers. Multiple members of the team were in on the interview which was a little intimidating, but it also allowed for me to get a feel for the culture of the team.", "Interview Questions": "Tell me about a time when you faced difficulty and how did you overcome it?"}, {"date": "7 Mar 2017", "title": "University Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Grand Canyon University (Tempe, AZ) in Dec 2015", "Interview Descriptions": "Submitted application and received a call back from someone in HR. Advised me to come in for an interview. Was expecting to meet with someone 1x1 but was met with a panel of 3 different managers.", "Interview Questions": "Describe an uncomfortable situation, and how did you handle it?"}, {"date": "23 Sept 2016", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Dec 2015", "Interview Descriptions": "Phone interview with HR, then onsite interview with a faculty member and associate or assistant dean where we discussed my teaching experience and philosophies. They explained the job expectations, class size, etc. Seemed like an okay place to work, but the pay was ridiculously low. I would have been losing money to go work for them.", "Interview Questions": "They asked about my teaching experience"}, {"date": "1 Dec 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Nov 2015", "Interview Descriptions": "Very efficient process.  Appointment was within 48 hours of application.  Human Resources was very responsive with respect to hiring process.  Despite it being the holidays, the personnel was easy to work with, up front with respect to requests for follow-up.  The interview did not have any questions that I would consider to be Gotch-ya questions or designed to trip me up.  Just straightforward questions.", "Interview Questions": "Asked about teaching experiences, graduate courses."}, {"date": "29 Dec 2015", "title": "Student In Master's Degree Public Health Administration Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Kansas City, MO) in Nov 2015", "Interview Descriptions": "friendly. I am an online student. I started out with a Grade A. Only to fail the course. I think it was unfair that I did not get the support expected. The instructor was told, that I was falling behind and his response, while positive did not help me with the tutorials, I needed.", "Interview Questions": "N/A"}, {"date": "4 Nov 2016", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Oct 2015", "Interview Descriptions": "2 phone interviews, 2 face-to-face interviews\r\nThe phone interviews were very easy, it was the last face to face interview that was a little more intimidating. Taking the time to research GCU was well worth it, this company is looking for people who are excited about being part of a big GCU family.", "Interview Questions": "How do you plan on managing your day? (This position is the liaison between students and Financial Aid  -  Constantly working with various departments to things accomplished  - Expert on a wide variety of rules, regulations with Finances and Academics)"}, {"date": "7 Nov 2015", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University in Oct 2015", "Interview Descriptions": "Interview with a person from human resources asking a lot of situational questions. Got called back in for another interview with hiring managers. They asked the same kind of questions. Got an email three days later that I did not get chosen for the position but that they would like me to interview for a different division, same position. I agreed and had another interview with a different set of hiring managers. Interview was the same as previous two interviews - behavioral/situational questions only. At the end of the interview the managers asked each other what dates they were even hiring for and had to ask me. \r\n\r\nAfter 4 days of not hearing back about my interview I inquired. Another 4 days later I finally got an email back that I was not chosen for the position.", "Interview Questions": "Tell me about a time when you......."}, {"date": "16 Mar 2017", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Oct 2015", "Interview Descriptions": "Very to the point and easy.  Nothing too tough or out of the ordinary.  I ended up getting a job offer 2 hours after I interviewed.  The final interview consisted of myself and 2 managers. though apparently there can sometimes be up to 4.", "Interview Questions": "How do you prepare for a busy day of work?  What steps do you take specifically, and how well do you adjust to your plan changing on the fly?  Answer both working as an individual and on a team."}], [{"date": "11 Nov 2015", "title": "Admissions Representative - Online Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University in Sept 2015", "Interview Descriptions": "Submitted my resume online and within one day received an email requesting a phone interview.  The HR Rep called at exactly the appointed time and began a series of questions, lasting almost 30 minutes.  The questions weren't difficult, but I certainly would have answered differently had I had the opportunity to think about them.  At the conclusion, I was told my info would be forwarded to a hiring manager.  I was told I would hear from them within three days.  When I didn't, I called the HR Rep back and left a message.  Days later, I received an email from another HR employee advising me that another candidate had been offered the job.", "Interview Questions": "Describe a time when you exceeded a customer's expectations."}, {"date": "22 Aug 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "The process took about a week. I was emailed for a phone interview, then asked to come in for a interview. I received an offer the next day. The questions were behavioral based questions.", "Interview Questions": "Behavioral based question"}, {"date": "15 Dec 2015", "title": "IT Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ) in Sept 2015", "Interview Descriptions": "Emailed a few times got an interview. Received a test of Information technology questions ranging from basic to advanced. Then the interviewers examine your test before your interview. After a short period they call you in for the interview. They ask you many questions about why you want the job. They cover any experience you may have had and how you work with a team. They were very professional but relaxed and very friendly.", "Interview Questions": "What made you interview for Help Desk. "}, {"date": "17 Jul 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Tempe, AZ) in Sept 2015", "Interview Descriptions": "Started with a phone interview with the recruiter. Came to campus for an interview with the hr recruiter then met with managers after. You were asked a variety of situational questions. They wanted the answers in star format. Interviewed by two people.", "Interview Questions": "What was situation you had to overcome and was what the result? How did it happen."}, {"date": "17 Aug 2015", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Grand Canyon University (Peoria, AZ)", "Interview Descriptions": "All I can say is joke! I came into this process with awesome qualifications. I went through all the 3 interviews, which included a phone interview, met with the talent agent, and sat in front of 4 managers. I felt I answered each question with precision, but it ended up being a waste of time. This university is looking for robotic minds, who will simply be happy sitting behind a desk, and not taking on people with character.", "Interview Questions": "general S.T.A.R...."}, {"date": "17 Aug 2015", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Aug 2015", "Interview Descriptions": "Process was fairly inane. They responded to my resume, and asked me to respond to their email to set a time for a phone interview.  They called as scheduled.  The interviewer was polite and friendly.  She was thorough in her description and responsibilities of the position and asked several times if I was still interested after she finished her notes. They spent a great deal of time going over my resume, position by position", "Interview Questions": "Could you handle making 80-100 outbound calls a day to prospective on-line students and still maintain effective communications via email, inbound calls, etc..."}, {"date": "22 Jul 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Grand Canyon University (Tempe, AZ)", "Interview Descriptions": "I received an email to set up a time for a phone interview.  After the phone interview, the next step  was an in office interview.  I first met with the talent specialist who set up the phone interview and she asked me several questions about why I wanted to work for them, etc.  After that I was taken to a conference room and had another interview that was conducted by two managers.  The managers had great personalities which helped to calm some of the nervousness most of us experience with an interview.  They asked me about my work history on my resume.  They also asked several S.T.A.R. Method questions.", "Interview Questions": "S.T.A.R. Method questions"}, {"date": "10 Jul 2015", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "Basic questioning, very casual and welcoming environment. I was asked to bring copies of my resume and dress up in appropriate clothing. Some interviews are held in groups, others are one-on-one, it just depends on how many applicants they have and dates of how busy they are.", "Interview Questions": "What interest you to become a tutor?"}, {"date": "20 Aug 2015", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grand Canyon University (Tempe, AZ) in Jul 2015", "Interview Descriptions": "The interview process took five days. I had a phone interview with the recruiter and was scheduled for an in-person interview the following day. Three days later I received an email regarding their decision.", "Interview Questions": "Phone Interview Questions:\r\n- How did you hear about this position?\r\n- Why do you want this job?\r\n- What makes you a great fit for this job?\r\n- What would your co-workers say about you? \r\n\r\nIn-Person Interview: STAR Method Questions:\r\n- Tell us about a time when you provided exceptional customer service.\r\n- Tell us about a time when you had to deal with a conflict within your team.\r\n- Tell me about a time when you have had to deal with an angry customer."}], [{"date": "10 Jun 2015", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "Phone interview which was really standard. \"tell us about your last employment experience? Why do you want to leave? What were your responsibilities?\".  Scheduled face to face the following day asking behavioral questions in front of a panel using the STAR method.  Told I would hear back the following week but it actually took two", "Interview Questions": "Tell me about a time where you missed a deadline."}, {"date": "29 Jun 2015", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2015", "Interview Descriptions": "The recruiter was very friendly. She took me to a room to meet the two military managers that were going to interview us but they were late. It was awkward and after a while the recruiter had to go find them.. twice.. before they came to meet us for our scheduled appointment. When we walked in they seemed quite friendly at first. One of the interviewers was very nice and more open but she kept looking to the other one for what to ask and how to react to my answers. The other one that was in there asked questions did not smile one time and she stared straight ahead at me, almost without blinking. She almost looked angry. It was clearly uncomfortable to myself and to the other manager in the room. At one point she asked me to review my resume and I went over the first job and looked up to see if she had questions or wanted me to continue. She smacked her copy of the resume and said \"I said to go over your entire resume!\".  The way she said it was rude and it was as if she was talking to someone that was way beneath her. It was more of an interrogation interview from her. If she wasn't staring, she was writing, with very big writing. Not one time was there a level of comfort in the room and it was obvious that she intimidated the other manager in the room as well. It was one of the worst interviews I have had. She is a manager only interviewing, not an officer interrogating a criminal, yet that is what it felt like. There is no way she is going to really know a potential employee if interviewees are facing interviewers such as that. When GCU is doing interviews, they need to find someone that is better suited to doing that and actually getting a potential employee to really share what they have to offer instead of trying to \"show them who's boss\".\r\nThank you.", "Interview Questions": "STAR Method questions"}, {"date": "21 Aug 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Grand Canyon University (Tempe, AZ) in May 2015", "Interview Descriptions": "One on One with a team manager - was asked a series of questions to include experience, the pros and cons of the job. How comfortable was I working in a cube environment.", "Interview Questions": "Describe a time when you had to overcome an objection of someone who needed school but couldn't afford it?"}, {"date": "21 May 2015", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (New York, NY) in Apr 2015", "Interview Descriptions": "2 phone interviews then live interview. more concerned on looks than skills. wasted time waiting to get opportunity. takes a month to complete interview phases then get an email you dont fit", "Interview Questions": "will you dedicate your time since not a typical 40hr work wk"}, {"date": "22 Mar 2017", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Apr 2015", "Interview Descriptions": "First you are called by HR for a phone interview to be qualified for a face-to-face interview. Then you go in for a face-to-face interview with HR, and they further qualify you to see if you meet manager's basic expectations. Lastly, you are called back in for a final interview with the manager panel to discuss history and further evaluation.", "Interview Questions": "What was a major customer service problem you've dealt with, and how did you handle/resolve it?"}, {"date": "3 May 2016", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Grand Canyon University in Apr 2015", "Interview Descriptions": "Extremely warm and casual process. We discussed my interests and what motivates me. The do pull up your resume so be sure you can elaborate. Other than that it was a lot of fun and they are very flexible on time when they can call.", "Interview Questions": "Why do you want this job title?"}, {"date": "1 Mar 2015", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "I had 3 in person interviews in one week and had to take time off work to do so.   The interview questions were pretty standard.  All three HR personnel I met with said different things about the duties of the position and the advancement opportunities...BIG red flag.  I understand not being the best candidate for the role but I felt like they wasted my time and then didn't have the courtesy to personally tell me or email me that they were going with another candidate...I just got an automated email that wasn't even tailored to even having an interview.  Overall, I think the HR staff needs to get on the same page.  The last person I interviewed with flat out told me there was no advancement opportunities.  It was the right decision for them to not offer me the position as I would've declined anyway based on the conflicting information during the interview process.  They also need to be a little more conscientious and respectful of a person's time.", "Interview Questions": "Tell me about a time....a lot of behavioral type questions."}, {"date": "23 Jul 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2015", "Interview Descriptions": "Two interviews. Used the STAR interview technique on the phone and then had an in person interview with three other people. Lasted about an hour and got the job the next day. Easy and peaceful process", "Interview Questions": "Describe a time when you.."}, {"date": "7 Jan 2018", "title": "Doctoral Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Feb 2015", "Interview Descriptions": "Very standard.  You are interviewed by two team managers. The managers are not trained on how to interview they pretty much just talk to you and go with their gut.", "Interview Questions": "Why do you want to work for GCU?  Name a time you exhibited excellent customer service?\r\nStandard questions."}, {"date": "9 Mar 2016", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Grand Canyon University (Tempe, AZ) in Feb 2015", "Interview Descriptions": "I submitted two online applications for the same position with different posting dates.  I never got a reply or heard from anyone besides an auto-mated email after initially completing each app.  It took a referral to get an email to set up a phone screening.  Even after my referral submitted my info, it took a week or two to get an email.  However, I later found out that they were starting training for new hires about 10 days out from when they contacted me.  Not nearly enough time to give two weeks to current employer and process seemed quite rushed considering I had submitted two applications anywhere from two to four weeks in prior.", "Interview Questions": "Why are you leaving current position? What would your friends say your strengths are? What are you strengths?  Tell us about a time you provided excellent customer service."}], [{"date": "20 Jan 2015", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "Interviewers were unprepared.  Didn't know how to interview me and took 5 mins during the beginning of the interview to go over the process.  Although I was told there was multiple positions that were available, what they do not tell you is that you are ONLY interviewing for one slot per the supervisors that were assigned to interview you.  So if they do not like you for their slot, you are not hired.", "Interview Questions": "What was the most complex situation you have had to deal with in your last position."}, {"date": "23 Dec 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University", "Interview Descriptions": "The online application was pretty straightforward.  The interview process seemed superficial.  I spoke with a recruiter who asked a series of canned questions.  Having apparently given the appropriate, politically correct answers, I was informed my file would be forwarded for review by someone in the specific college.  I never spoke with that person.  My file was reviewed and I was approved to continue the process.\r\n\r\nNext I was informed that I would be required to complete 8 hours of asynchronous training within a specified one week period AND 3 weeks of online orientation - without pay.\r\n\r\nThe online orientation required me to be present and engaged online at least 4 of 7 days each week.  To complete the necessary tasks this took 1-2 hours per day.\r\n\r\nDuring the last week I received a call that I would be \"penciled in\" to teach a particular course.  This is the course I was 'hired' to teach.", "Interview Questions": "There were no unexpected questions.  The interview was very basic and seemed to be verifying information in my CV."}, {"date": "25 Apr 2017", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2015", "Interview Descriptions": "Long Process - Applied online and then interview with Manager of team you would join and then you need to wait until an opening happens on that team.  You may be hired right away or as long as two or three months depending on budget.", "Interview Questions": "Meet with Managers of your team "}, {"date": "4 Jan 2017", "title": "C-Store Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2015", "Interview Descriptions": "Presented my school and pep band schedule and discussed the things I needed to do before I start working as well as where too receive my uniform for my first day of work.", "Interview Questions": "Will you be able to work even though you have a busy schedule?"}, {"date": "16 Aug 2015", "title": "SSA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Oct 2014", "Interview Descriptions": "long interview process. first, there was a phone interview with the HR generalist. This was followed by an in person practice interview with the hiring manager right before the actual in person panel interview. This one featured the position manager, department head, regional director and department senior vice president.", "Interview Questions": "what's you biggest strength?"}, {"date": "9 Oct 2014", "title": "University Development Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University in Oct 2014", "Interview Descriptions": "Within a few days of completing an application, an HR Representative emailed me requesting me to reply with the best time to contact to conduct a phone screening. I replied immediately with a specific time period on any day of the week. I waited for a confirmation email with a scheduled date and time and never received it until after I followed up the next day. Let me reiterate that I requested a specific time period on any day of the week and the confirmed time I received back was not at all during the the time period I requested but I replied stating that it would be best if we keep the time I requested. \r\n\r\nThe day of  and 10 minutes before the scheduled time of the phone screen comes and I received a voicemail (since it was not the schedule time- I wasn't able to answer the phone) stating that the interview need to be rescheduled for 3 hours later.. Ok, 3 hours later actually works better for me... well 3 hrs and 30 minutes later, I finally got the call. Interview lasted about 20 minutes with a series of average behavioral based questions basically inquiring about previous sales experiences and territory management. Interview went well  and I was told that my application would be forwarded to hiring manager and I can expect to receive a call in 1-5 business days. I made sure (since I have been through interview processes it seems a thousand times and know promises are always made with no results) that I repeated and confirmed what I was just told about receiving a call for the second interview within 1-5 business days... 4 days passed and on the 5th day, I heard nothing. So before the 5th day ended I called the HR rep and asked if I should still be expecting a call from the hiring manager. As I introduced myself she said she remembered me and said \"yea, you are the one the hiring manager is waiting to hear from. \"We are just waiting on your answer since you said you weren't sure about the training schedule.\"  <<That in itself let me know where this was going.... \"Um, no, thats not me.. I'm such and such, the one who you changed the interview time to 3 hours later last week. We haven't spoken since the phone screen, and I still haven't heard from the hiring manager,\" I replied.  She says, \"Oh ok, He still hasn't contacted you at all?!? Oh, ok let me email him and see what is going on, let me put you on a brief hold. HOLD. \"Ok, he said he has found the candidate he is looking for. You are encouraged to apply if other positions interest you.\" I politely said,\"ok thank you.\" In the back of my mind, I'm wondering why it seems so unprofessional to not send a rejection email to the candidate who took the time to start a process with you. Everything happens for a reason, would I really want to work for a company that is unorganized and unprofessional?", "Interview Questions": "Although salary is predetermined and outlined in the job posting and at the beginning of the phone screen, I was still asked about my salary for each one of my previous positions. "}, {"date": "7 Aug 2014", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grand Canyon University", "Interview Descriptions": "Had one phone interview and then one panel interview. I was notified during the phone interview that I had been approved for an in-person panel interview. They scheduled it for the next day. I completed the interview the following day, and the morning after that I received a phone call with an offer. There was no drug test, but there was a background check.", "Interview Questions": "They asked for a lot of specific on the job situations and scenarios. It was easy. They like to see that you're able to multitask, work under pressure, complete quality and accurate work, and still be a positive representation of the university to students and leads. "}, {"date": "2 Sept 2014", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University (Tempe, AZ) in Aug 2014", "Interview Descriptions": "The recruiter seemed confused as originally she was considering me for a different position.  She asked me to email her with 3 dates and times I would be available for an interview.  She didn't get back to me for a couple of days and then it was only to tell me that that position had been filled and would I be interested in the enrollment counselor position.  I said yes, and once again she asked me for 3 dates and times I would be available for an interview.  We scheduled a time for the following Monday.\r\n\r\nLater that day, she said she would prefer to have me do an in-person interview rather than a phone screen and asked me again to set an interview time.  I reminded her of the time we had already set and we decided to use that time.  I showed up on Monday and she asked me questions that were basically a phone-screen interview rather than a formal interview.  She mentioned that I would be hearing from them the next day to schedule an interview with the hiring manager.\r\n\r\nShe also mentioned salary very early in the conversation.  She wanted to know my salary history and was concerned that I might not be happy with the salary they were offering, which was not negotiable.\r\n\r\nI never did hear back to schedule the next interview, and follow up messages have not been returned.", "Interview Questions": "No difficult questions whatsoever."}, {"date": "6 Jan 2017", "title": "Technical Support Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Grand Canyon University (Phoenix, AZ) in Aug 2014", "Interview Descriptions": "It was in the conference room with many chairs and one-on-one with one of the supervisors. They don't give a lot of feedback from answering the interview questions so you can't really tell how they are reacting to the interview. They want to see personality since it is a job where there is a lot of communication and interacting with customers.", "Interview Questions": "Name three browsers?"}, {"date": "29 Jun 2014", "title": "University Development Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Grand Canyon University", "Interview Descriptions": "Three part interview phone interview with recruiter, in person interview, and the offer acceptance. Be ready to review current, or previous sales background. Three part interview phone interview with recruiter, in person interview, and the offer acceptance. Be ready to review current, or previous sales background.", "Interview Questions": "N/A"}], [{"date": "1 Oct 2014", "title": "University Development Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University in May 2014", "Interview Descriptions": "Totally unprofessional in person interview!  Expected to be interviewed at 7:30pm at night almost 2 hours away from my home.  Then actual interview was near a bar in a hotel and didn't actually begin until 8:30pm!!!  I spent hours creating a powerpoint presentation and when I got to interview, she didn't even have me present it!", "Interview Questions": "They are going to ask you lots of sales oriented questions - not student affairs related."}, {"date": "31 Mar 2014", "title": "Student Service Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grand Canyon University (Tempe, AZ)", "Interview Descriptions": "After submitting my application, I was contacted approximately 30 days later. After a phone interview, I was rushed into an interview that went well. After the interview, the interviewing hiring manager contacted my internal referral and asked about me and I was told they had a nice conversation. I've been in many interviews and so I know good ones and bad ones and this was a good one. Sent follow-up thank you notes as well.  Was told I would hear back within a week, but I never heard back. After two weeks I contacted the HR coordinator I had been working with by phone and email. After multiple attempts to make contact I never heard back and never received a rejection notice.  My voice mails and emails were flat out ignored. I had also contacted the hiring manager to follow-up after about a month and I never received any communication back from her either.  While I have a feeling I slipped between the cracks, I've never been through an interview process where I never heard back. I've never had ignored communication either. It was extremely disappointing because I have lots of experience and was excited about working for them. It was extremely unprofessional and frustrating because they told me I needed to interview within two days of contacting me, which forced me to change travel plans.  Hindsight being what it is, I don't understand the rush. I can't help but hold GCU in much lower regards because they did not show any respect for me or my time.", "Interview Questions": "Very average situation questions. "}, {"date": "3 Oct 2014", "title": "Talent Acquisition Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2014", "Interview Descriptions": "Formal and direct.  The decision makers were available and all of the questions I had were answered.  I prepared well before the interview to ask questions to help me make the decision if this was the right opportunity for me at the time.  Questions were standard behavioral and the interviewers appreciated that I was able to quantify the results I've achieved with my previous employers.", "Interview Questions": "N/A"}, {"date": "22 Feb 2014", "title": "Refused to Say Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Canyon University", "Interview Descriptions": "Behavioral interview", "Interview Questions": "There weren't any questions that I considered to be difficult."}, {"date": "23 Nov 2016", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grand Canyon University (Tempe, AZ) in Feb 2014", "Interview Descriptions": "horrible. a panel of waannabes. Muslims and other  people with Education as far as High School asking irrelevant questions based on realistic scenarios from previous experiences at home and at other jobs.", "Interview Questions": "what where you doing at your previous job, state what you do all day since you wake up.\r\nwhat hobbies you have. Can you spell the word  \" idiosyncrasy\""}, {"date": "15 Jan 2014", "title": "Online Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "After completing an online application and submitting a CV, I was contacted by HR which requested further information including references and transcripts. After this, I was put into a training course, where I had to demonstrate my ability to communicate, provide substantive feedback, etc. This course was structured like an online course, and progress through this course was evaluated.", "Interview Questions": "No questions"}, {"date": "1 Jan 2014", "title": "Reference Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "Was called and offered a phone interview which was pretty standard and heavily focused on how to motivate non-traditional learners and giving online assistance.  Invited for an in-person interview that consisted of giving a ten minute presentation on how to search geared towards college students, complete with PowerPoint and handouts.  Completed this task first thing followed by a very informal but informative interview with two supervisors then a tour of the campus.  While I sent thank you notes for both the phone and in person interviews, I never received any correspondence at all about the outcome of the interview and promptly took another offer.", "Interview Questions": "All questions were standard, and what you would find online for any librarian position.  Not heavy on the academics.  Did get a question about the teacher who most influenced you and why. The most difficult part was doing the mock presentation for a staff that looked bored and a little tired of participating."}, {"date": "18 Sept 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2014", "Interview Descriptions": "If someone had accurately explained to me what GCU planned to pay me, I would never have accepted the job. After 3 interviews, if chosen for the position, you'll be contacted to submit new hire paperwork, authorize a background check and you will need to present your I9 documents to Career Services with original, unexpired form(s) of identification.", "Interview Questions": "How will you keep your students engaged."}, {"date": "3 Oct 2016", "title": "Video Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2014", "Interview Descriptions": "contacted via phone from HR.Got to talk to the people supervising my position and got an offer letter after they looked at my portfolio. was given enough time to go out to Phoenix from the east coast. very friendly people and were able to reply to my questions in regards to salary and housing.", "Interview Questions": "why would you want to work in higher ed?"}, {"date": "3 Sept 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2014", "Interview Descriptions": "Be on time to your interview. If you are late it is very likely you will not get hired. You will set up for a time that works for you in ResLife. Then you will go to the building where they tell you and the RA's will tell you what to do. Do not be afraid to ask questions. I would show up to the building 10 minutes early.", "Interview Questions": "How are you going to balance your busy school schedule while maintaining the role as a resident assistant?"}], [{"date": "20 Nov 2015", "title": "Quality Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University (Tempe, AZ) in Jan 2014", "Interview Descriptions": "First got a phone call. Asked basic questions. They give you an overview of the job. They want to make sure you understand the job and what is all about.", "Interview Questions": "Give me an example of customer service"}, {"date": "17 Jul 2015", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in Dec 2013", "Interview Descriptions": "Brief phone interview with hiring manager to ensure proper fit. Afterwards, a formal in-person interview is scheduled. Interview consisted of two dept managers and hr manager. Start off one by one shooting off questions in a rehearsed manner. They all seemed very interested in prior similar experience and education. Next, comes the common interview questions. Finally, candidate is grilled on how many sales goals they have previously accomplished. GCU's call volume \"quota\" one needs to reach an hour (min. of 40 outbound calls) is thoroughly explained. I felt strongly about this company at first since they are a very reputable and respected Christian institution. Also, the starting pay can't be beat ($40K), especially for someone w/o a degree. The last 15 minutes of interview discouraged me a great deal!  I rather not be employed as a parrot reciting a script in a stressful,high paced and sales based call center disguised as an university.", "Interview Questions": "Will you be willing to spend your entire shift on the phone? What were some of your sale goals and numbers reached from your previous employer? "}, {"date": "6 Jun 2014", "title": "University Development Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Nov 2013", "Interview Descriptions": "There was an email for interview with HR for screening. The HR interviewer was 30 minutes late for the telephone interview. Then it moved on to a phone interview with the hiring manager. The final interview was face to face in Phoenix with the executive director and the hiring manager. This involved a presentation of a proposed business plan for territory management and interview questions. This lasted about 60 minutes.", "Interview Questions": "How would you approach contact generation in a difficult territory where potential clients have never even heard of your company's existence?"}, {"date": "31 Aug 2015", "title": "Technical Support Representative Level I V Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Grand Canyon University (Phoenix, AZ) in Nov 2013", "Interview Descriptions": "The interview was a fairly simple process. 3 managers asked me different questions about the job, and my current position and skills. They were relaxed and easy going the entire time. When they could tell that I was nervous, they made sure to tell me it was okay, and to take my time while answering the questions.", "Interview Questions": "What qualities do you think makes a leader in the workplace?"}, {"date": "22 Jun 2015", "title": "University Development Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Newark, NJ) in Nov 2013", "Interview Descriptions": "You need to go in with a plan on how to develop your territory or how you are going to get your leads. You will be asked to make a presentation on the given major you will be recruiting for ie College of Education or nursing. Then you will be asked on how you developed your own market based on what job you came from.", "Interview Questions": "How will you develop your territory?"}, {"date": "27 Oct 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University in Oct 2013", "Interview Descriptions": "Applied online and received a call three to four weeks later from HR to set up initial phone screen for the next evening. Had phone screen with HR and very conversational. Mostly answering situational questions that covered job duties and customer service challenges and resulting outcomes. A week later HR called back to set up call with regional director. On call with regional director, very conversational and informative about job expectations and situational experience discussed again. HR then called within a week on a Friday to set up final interview for Monday and to share final interview format. Premise is to develop a 4 page 90 day business plan and a 7 slide powerpoint to present to potential student. Produced presentation within three day timeframe and presented to regional director over the phone. After call, HR called and offered me the position.", "Interview Questions": "Presentation and Powerpoint format was unexpected request."}, {"date": "10 Jul 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ) in Oct 2013", "Interview Descriptions": "Typical interviewing process was used, they inquired about your past experience and knowledge, and they explained the requirements needed for the position I was applying for. Went over position details, such as programs used, discussed company growth.", "Interview Questions": "Inquired about past experience and knowledge, again typical HR interview questions were asked."}, {"date": "29 Aug 2014", "title": "Digital Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Grand Canyon University in Oct 2013", "Interview Descriptions": "The interview process was fairly quick, however HR dropped the ball many times. I only interviewed with my direct supervisor and the team, but many coworkers interviewed with upper-level departmental management. HR got my information wrong and it took an extended period of time to do my background check, which was a little frustrating. They also did not give me specific information about my first day. I had to find my manager on LinkedIn and ask for information on where to go and at what time.", "Interview Questions": "The questions were fairly straight-forward, nothing out of the ordinary."}, {"date": "28 Sept 2013", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Grand Canyon University (Phoenix, AZ)", "Interview Descriptions": "First interview over the phone with HR. Second interview the next day on campus with my soon-to-be direct manager. Third interview that same week on campus with one if the Assistant VPs.", "Interview Questions": "N/A"}, {"date": "4 Jun 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Sept 2013", "Interview Descriptions": "Applied online , received email to set up phone interview.. all via phone completed by a recruiting agency.  Required to complete an online course without pay prior to hire", "Interview Questions": "How would you handle a student that has questions about religion?\r\n"}], [{"date": "2 Jan 2017", "title": "University Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Phoenix, AZ) in Sept 2013", "Interview Descriptions": "Interviewed by 2 University Counselor Managers then called back if they like you.  They will ask you questions and also judge you on your instincts to close the sell or enrollment. Looking for motivated approachable people that are open to coaching.", "Interview Questions": "How were you evaluated on your performance at your last job?"}, {"date": "21 Aug 2013", "title": "Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Grand Canyon University (Las Vegas, NV)", "Interview Descriptions": "2 phone interviews about 5 months after I applied.  They then scheduled a face to face in a hotel room with 3! people.  One middle aged man, one very young hip sales person type, and one very foreign Eastern European man who was very sick or something since he was snorting the entire interview.  \r\n\r\nInterview started normally, then the young sales hipster asked me if I like sports.  Yes.  What sport is your favorite?  Football.  Do you play fantasy football?  Yes.  Well, pretend like us 3 have never heard about fantasy football at all.....Sell us on it.  SIGH.  Yup, that was the first question.  Once my answer was done, the very European West Coast manager asked me in VERY broken English  \"Why do they call it Football when you don't use foot?\"  That was, no kidding, the ONLY thing he said to me the entire interview.  \r\n\r\nThey then asked how I would sell the \"Christian\" aspects of this school to non-Christians.  How I would talk to family members.  Do I believe more in being a servant or customer service. How I would get past the objections from high school administrators trying to stop me from being a solicitor on their campus.  \r\n\r\nThis IS a sales position.  Hipster stammered horribly when I asked him what the quota \"number\" was for students I needed to enroll.  \"Well, um, well, we, uh, take, uh information from the region and see what the team should be able to obtain then we, um, take that information and uh, well, come up with your goal.  I also asked how often you have a start?  Middle aged man stammered a bit on that too.  \"Our most important time is August.  But we have a start here, there, all the time.  And you have to be prepared to ride a bus with students into Phoenix and set them up in their dorms and hold their hands.\"  Uh...ok.  \r\n\r\nI asked how many people they were hiring. 1!  ONE!  Three men, put up in a hotel, to hire one person, for a sales position with a SUPER HIGH turnover rate?  Ok then.", "Interview Questions": "The fantasy football sales pitch was wacky and the servant or customer service was one of those trick, no right answer type questions."}, {"date": "12 May 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Grand Canyon University (Tempe, AZ) in Aug 2013", "Interview Descriptions": "Easy interview. Enjoyed the process. Really casual and laid back lots of scenario based questions. Hard to find the entrance of the building. Great atmosphere. Interviewed by two managers, and they had pre prepared questions ready to ask.Easy interview. Enjoyed the process. Really casual and laid back lots of scenario based questions. Hard to find the entrance of the building. Great atmosphere. Interviewed by two managers, and they had pre prepared questions ready to ask.", "Interview Questions": "Asked a lot of situational questions."}, {"date": "13 Nov 2015", "title": "University Development Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Jersey City, NJ) in Aug 2013", "Interview Descriptions": "Multiple phone interviews, before a face to face interview. be prepared to present a territory plan, as well as 1, 3, and 6 month goal plans. First a phone screen, then a phone interview and then a face to face with the region's manager. Manager wants to hear specific ideas of how you will meet Admission's goals, as well as how you will manage and develop your territory.", "Interview Questions": "How would you reach out to possible partnerships in your territory?"}, {"date": "17 Jul 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Grand Canyon University", "Interview Descriptions": "The hiring and interview process were fairly straightforward. The phone screening/interview was thorough, and left you with a good idea of whether you were a fit with the company. The two managers interviewing onsite were the typical contrasting pair, with one being \"service\" oriented and one being \"sales\" oriented. They gave a good picture of what the company was like.", "Interview Questions": "They ask about gaps in employment, and look for unique things in your work experience that may help or hurt your future there."}, {"date": "6 Oct 2017", "title": "Tier I Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Jul 2013", "Interview Descriptions": "Before school started, I was able to navigate the school website to find an on campus job to start the application process. Once I was down there for orientation, I had the opportunity for the initial interview and was pretty much hired on the spot.", "Interview Questions": "Q: What can you bring to the table by working for GCU?"}, {"date": "18 Sept 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in Jul 2013", "Interview Descriptions": "Easy interview process.  Phone interview, followed by an in person interview.  Was offered the job same day as the interview.", "Interview Questions": "Tell me about a time when you had a complaint from a student.  How did you handle it.  "}, {"date": "14 Mar 2014", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2013", "Interview Descriptions": "they use the new \"style\" of \"tell me a time when you...\" so be prepared to give specific examples of your past accomplishments and failures", "Interview Questions": "nothing too difficult- they just need to be VERY specific answers (names, where you were working, what happened, what was the outcome)"}, {"date": "7 Apr 2013", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Canyon University in Mar 2013", "Interview Descriptions": "I was called for a preliminary interview and I had to call back several times in order to get back in touch with the person who called me. When I did, she asked me a few questions which I will indicate in the questions column and then told me that I would have an in-person interview but they had to decide if I would fly to Phoenix or if they would come and interview me in my location. I waited a few days, hadn't heard anything and called back. She made a point to say that she \"can't remember all the people she talks to in a day\" and that \"it was out of her hands\". It was very unprofessional and rude. She said the hiring department had my resume and that I should reapply to be considered.", "Interview Questions": "I was asked why I want to work for GCU, why I felt like I would be a great Admissions Representative, and the usual. "}, {"date": "3 Oct 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Grand Canyon University (Tempe, AZ) in Feb 2013", "Interview Descriptions": "Phone interview first. Then one formal interview with two enrollment managers. I was referred by a friend for the job. Best way to get an interview. I had to apply online even though I was a referral. Resume was forwarded to direct/team manager. HR representative called for a phone screen. Contacted via e-mail initially.", "Interview Questions": "Name a time when you were faced with multi-tasks with deadlines and how you approached these. What was the result?"}], [{"date": "18 Sept 2014", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Grand Canyon University in Feb 2013", "Interview Descriptions": "Submitted application on a Monday night after business hours, and received a phone call the following morning by about 7:30am AZ time. Ended up doing an on-the-spot phone interview, and HR recruiter wanted to bring me in for an in-person interview that Friday. I was flying in from a different state, so it was rather expensive but I was looking at trying to get a job in AZ to join my husband who had already relcoated. Spent the first half an hour with the HR recruiter who asked me typical questions like tell me about yourself, why are you interested in working for GCU, what do you do when you don't have all the information you need, etc. The second half hour was spent with 2 hiring managers. They asked typical behavioral questions. I was still in the car after leaving the interview when they called me with the job offer.", "Interview Questions": "Nothing was too difficult or unexpected - they were all behavioral questions so they wanted specific examples of situations where you went above and beyond, when you had to work with a difficult person, etc. "}, {"date": "3 Dec 2012", "title": "Full Time Online Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Grand Canyon University (Tempe, AZ) in Nov 2012", "Interview Descriptions": "I applied several months before hearing from them. A recruiter called on a Monday and said with my permission my app would be passed on to a hiring manager. The hiring manager then called me within 2 hours. There was one interview with this same person. He was very casual. It was pleasant. They called me within 2 days for a tentative offer. The salary offer was significantly MORE than I requested. I accepted.", "Interview Questions": "No difficult/unexpected questions"}, {"date": "17 Apr 2015", "title": "University Development Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Nov 2012", "Interview Descriptions": "I had an initial phone interview. I was told the local manager would call me at a certain time. the call came late. I was then told there would be a face to face interview and to have a presentation prepared to explain my territory management plan. The interviewer must have not been told about this because he never asked to see it. In fact he repeatedly told me he did not know where my territory would be.", "Interview Questions": "I was asked to explain my sales background and my contacts in education."}, {"date": "15 May 2013", "title": "CRM/XRM Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Aug 2012", "Interview Descriptions": "First a phone interview then an in person interview with a skills test.", "Interview Questions": "The most diffiult part of the interview was the skills test as it was the most unpredictable."}, {"date": "6 Jun 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ) in Aug 2012", "Interview Descriptions": "it was a very standard interview that gave me an opportunity to showcase my assets to the company. I was able to let the employer know that I was the right fit for the team.", "Interview Questions": "N/A"}, {"date": "27 Oct 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jul 2012", "Interview Descriptions": "Phone interview was fairly standard, looking for background and experience.  Face to face interview was more relaxed looking to see if candidates can hold a conversation and build a rapport", "Interview Questions": "Why is education important? "}, {"date": "19 Sept 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2012", "Interview Descriptions": "I applied on a Monday and had a phone interview the next Monday. I had a informal interview on the campus. Basic questions tell me about your goals, have you ever been in a sales position, tell me a time, etc", "Interview Questions": "Tell me a time when you had a irate customer on the phone and how did you handle it?"}, {"date": "25 Oct 2016", "title": "Financial Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (New York, NY) in May 2012", "Interview Descriptions": "One one  interview one with hiring manager. Asked questions about background and desires to grow within the company. One one  interview one with hiring manager. Asked questions about background and desires to grow within the company.", "Interview Questions": "Describe a challenging situation "}, {"date": "9 Aug 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Canyon University (Tempe, AZ) in Apr 2012", "Interview Descriptions": "Received a phone call within 24 hours. Standard questions and very direct with examples needed.", "Interview Questions": "How did you overcome your biggest challenge."}, {"date": "21 Sept 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Grand Canyon University in Apr 2012", "Interview Descriptions": "Initial phone interview then meet face to face with a panel of managers", "Interview Questions": "Was there ever a time when you felt overwhelmed by the expectations of enrolling a potential student?"}], [{"date": "12 Mar 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Grand Canyon University (Tempe, AZ) in Apr 2012", "Interview Descriptions": "The process started with a phone interview which was actually pretty lightweight. I was then called into the live interview and asked about my background and given a couple of behavioral interview questions. The interviewers liked the fact that I had closed them on the opportunity and asked them for the job.", "Interview Questions": "Explain a time when you had to resolve a difficult customer. "}, {"date": "17 May 2012", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2012", "Interview Descriptions": "The HR representative conducted the initial interview she seemed very pleasant but unsure of herself. It was very brief and only lasted about 10 minutes. The next round was to interview with the Director, he was an older man who kept interrupting me. The next gal that walked in for the interview was wearing a short skirt and had her chest exposed then two weeks later I found out she got the job, silly me for dressing professionally.", "Interview Questions": "N/A"}, {"date": "16 Jan 2013", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Grand Canyon University (Tempe, AZ) in Feb 2012", "Interview Descriptions": "The interviewers us a \"form\" and tag team you.   The ones I had are both gone. The new managers will spend very little time helping you.  Expect to learn most of the job on your own. If they tell you this is a sales job, THEY ARE LYING", "Interview Questions": "Ask them if this is a sales job?   "}, {"date": "6 Jun 2012", "title": "Art Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2012", "Interview Descriptions": "met with a teacher who walked me over to the Chair. submitted my CV and portfolio for review and that was it!", "Interview Questions": "none, I had to do all the Q & A"}, {"date": "17 Dec 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Canyon University (Tempe, AZ) in Oct 2011", "Interview Descriptions": "Pre-screening with a Human Resources Recruiter, interview set up with hiring manager.  Usually interviewed by hiring manager and a second manager.", "Interview Questions": "Describe a time when you tried to satisfy a customer and it didn't work."}, {"date": "13 Aug 2015", "title": "Regional Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Grand Canyon University (Phoenix, AZ) in Jul 2011", "Interview Descriptions": "Flight to Phoenix and mock presentation, any experience and comfort level you have with public speaking will be useful as well as in depth knowledge of the education industry and public school district contacts.  Be knowledgeable about the career paths and endorsements that teachers are interested in.", "Interview Questions": "Work experience and sales background"}, {"date": "12 Sept 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2011", "Interview Descriptions": "Very professional. Included mini-teach, feedback from other faculty. Final interview with the Dean. All went smooth. Everyone was very professional, cordial, and genuine. It was a good match from the beginning.", "Interview Questions": "Do you have a passion for teaching?"}, {"date": "7 Jul 2014", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in Jun 2011", "Interview Descriptions": "Submit application online, took 8 weeks to begin the screening process, received phone call to complete a screening interview, scheduled interview with manager and director, interview consisted on behavior based questions, received follow up phone call the next day with a job offer.\r\n\r\nOrientation was 3 weeks long and included training on all systems, departments, and role playing.", "Interview Questions": "Describe a time when you had to make a decision or recommendation that could've put your organization at risk."}, {"date": "4 Jul 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in May 2011", "Interview Descriptions": "After submitting my application online directly through GCU's career website I was setup with a Phone interview with HR. After the phone interview I had a face to face panel interview with 2 managers. I was informed by the manager that walked me out of the building after the interview that I had the job and would hear back from us soon. 24 hrs later I had the official job offer.", "Interview Questions": "They were your common questions. I would recommend having questions for them, at the end they will ask if you have any questions. By having questions about the position or company it shows them you have a true interest in the company and have done some research. "}, {"date": "20 Apr 2015", "title": "Level I Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Grand Canyon University (Phoenix, AZ) in May 2011", "Interview Descriptions": "Interview took no more than 5 minutes, as a student they will help you get a job on campus.\r\nThey had a career fair on campus for students to come explore the options they have to help with their career options.", "Interview Questions": "Rate you experience with Microsoft office"}], [{"date": "12 Sept 2011", "title": "Academic Counselor/Enrollment Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in Feb 2011", "Interview Descriptions": "I applied for two different positions online. I first had a phone interview for the EC position and was asked to come in for a 1:1 in-person interview. It was the standard interview questions like strengths/weaknesses and describing situations in previous positions that would help at this job. I didn't hear back from them and tried emailing a couple times but didn't get a response. Then, I got another call asking to set up another phone interview for the other position I interviewed for. After completing almost the same interview in person for the other position I received two emails saying that I didn't get either position.", "Interview Questions": "Describe a time when you experienced a loss and how you dealt with it."}, {"date": "6 Aug 2013", "title": "Student Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Jan 2011", "Interview Descriptions": "Application is submitted through HR website, and they call you to set up an interview. I had a panel of four managers. They called me a few days later to offer the position and sent me an email with details. The interview was pretty generic, and they seem to like my answers about church involvement and community service.", "Interview Questions": "They may ask you to explain a scenario where you had a moral dilemma."}, {"date": "30 Jun 2010", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2010", "Interview Descriptions": "Online application. Filled out an emailed questionnaire with questions like \"Why are your skills a good fit for this job based on the job description?\".  Phone Interview.  One on one interview.", "Interview Questions": "Role playing - you are a personal trainer and your client (interviewer) wants to quit the gym because they are too busy.  Convince the client/interviewer to not quit."}, {"date": "12 May 2012", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Tempe, AZ) in May 2010", "Interview Descriptions": "The process is straight forward you have  a phone interview, then go in for a 1:1", "Interview Questions": "What are your weaknesses/strenghts and why do you think you would be a good fit for the company?"}, {"date": "1 Mar 2010", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2010", "Interview Descriptions": "It was your standard phone interview. Nothing special.", "Interview Questions": "Why did you choose this job?"}, {"date": "18 May 2011", "title": "Student Life Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Jul 2009", "Interview Descriptions": "I was called for a phone interview and then invited to fly in for a face-to-face.  When I arrived I met with multiple people thorughout the school & was offered the job at the end of the day.", "Interview Questions": "If we were to highlight your resume on the megatrons what would they say about you?"}, {"date": "22 Nov 2011", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grand Canyon University (Phoenix, AZ) in Jun 2009", "Interview Descriptions": "The complete interview process was extended over a 2 week period of time.  The first was an email received by the HR Department which I had to summarize 10 questions then phone and then panel interview.  After that process I was turned down for the position.", "Interview Questions": "Describe your weakness"}, {"date": "14 Nov 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in May 2009", "Interview Descriptions": "Was interviewed by HR over the telephone first; then met with some arrogant young man, then had an interview with department head.", "Interview Questions": "Can't remember any of the questions, but they were pretty standard."}, {"date": "4 Apr 2013", "title": "Employee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in May 2009", "Interview Descriptions": "Submitted application and received a call from HR. Then conducted a phone interview that lasted about 30 min. About a week later got a call to schedule interview. Face to face interview was basic questions. The next day I was offered the job.", "Interview Questions": "They did not really ask any questions out of the ordinary."}, {"date": "13 Sept 2012", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand Canyon University (Phoenix, AZ) in Mar 2008", "Interview Descriptions": "Interview process went well. Needed to take a test after having 3 weeks of training. The training did not prepare me for the test. We were told we could take the test a second time if we did not pass (earn an 80% or higher). I got a 79% on the test, and the trainer looked at me like I should have been ashamed of myself. Immediately, he handed me the same test to re-take. I had no additional study time, which surprised me.", "Interview Questions": "How many referrals can you bring in with you?"}]]