[[{"date": "24 Jun 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at British Council (London, England) in Apr 2023", "Interview Descriptions": "Asked questions related to CV and Core skill highlighted in the role profile. Panel was interested in real time examples from your professional experience. Focus is on your contribution rather than team achievements. STAR approach preferred. Keep your answers concise as much as possible during the interview", "Interview Questions": "Why are you interested in this role ? Your motivation for applying? Challenges in the role?"}, {"date": "23 Jan 2023", "title": "Emerging Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "The interview process was friendly, however interview questions focused mostly on experience in research and training closely related to language testing. 2 interviewers participated, they welcomed my questions for them", "Interview Questions": "What's your experience related to conducting training in language assessment to various stakeholders?"}, {"date": "2 Aug 2022", "title": "Engagement Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "Robust and challenging. Very unique and unlike others which is fair enough given the type of organisation so I respected it and found it very challenging. 2 person panel in person interview.", "Interview Questions": "Describe why you should get the job"}, {"date": "26 Mar 2022", "title": "Senior Data Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "Applied online then got contacted by HR to arrange  la one hour interview on Teams. Interview was standard but then hears absolutely nothing further. To invite someone to interview and then not even have the courtesy of informing then of the outcome is really poor and says a lot about the company. Because of this it was a very negative experience.", "Interview Questions": "Provide an example of leading a project"}, {"date": "10 Jan 2022", "title": "Gender and Inclusion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "This was very standard, panel of 3, gender balanced, first a bit about CV and why interested in this job, and then on to competency based questions around the behaviours and core skills.", "Interview Questions": "Tell us about a time when you had prioritise against multiple deadlines. "}, {"date": "22 Aug 2022", "title": "Country Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Council (London, England) in Jan 2022", "Interview Descriptions": "firstly asked about why I was suitabile for role, what skills and experience i bring, my motivation for applying , then four different competency based questions on core skills and job specific skills", "Interview Questions": "Talk us through your application, and highlight why you are suitable for the role "}, {"date": "21 Sept 2021", "title": "Teaching Center Academic Calendar Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "A standard competency based interview with questions requiring answers using the STAR or CAR methods. The interview panel consists of 3 senior managers. The interviewers are generally friendly and helpful.", "Interview Questions": "How do you deal with internal customers? (or something like that)"}, {"date": "26 Mar 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "Very structured approach which focused on the behavioural competencies of the British Council framework. After an application CV, the interview was quite long and structured. They responded very soon and did not negotiate on salary.", "Interview Questions": "Tell us about you and your background"}, {"date": "25 Jun 2021", "title": "English Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at British Council (London, England) in Mar 2021", "Interview Descriptions": "The interview was a pre-recorded video interview.  It lasts between 15-20 minutes. \r\nThe interview assesses how you: demonstrate why you're ideal for the job\r\nand how you use your communication skills in 'real-time'.", "Interview Questions": "Standard Interview questions: why teach English?  Do you have experience living abroad? Explain how you handled a difficult situation. Why you chose that specific country."}, {"date": "22 Feb 2021", "title": "English Language Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "I didn’t not have an interview for this job. Instead I had to complete an in depth application form and obtain statements from referees. The referees then sent off the application to British Council. The process took months before finding out which region and then even later which town.", "Interview Questions": "They didn’t interview me but on application form it asked Why this job?"}], [{"date": "9 Sept 2021", "title": "Logistics Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at British Council (London, England) in Feb 2021", "Interview Descriptions": "Few competency questions where you have to give examples on how to deal with issues and how to develop problem solving skills. Other questions about the British Council behaviour and how you connect with others and report to senior managers", "Interview Questions": "N/A"}, {"date": "24 Feb 2021", "title": "Senior Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (London, England) in Feb 2021", "Interview Descriptions": "The interview was conducted online over Microsoft Teams, with three other people. Everyone was friendly and helped me with answering the interview questions when I was stuck with some of the questions.", "Interview Questions": "Can you describe a time when you had to collaborate with many people to achieve the same goal?"}, {"date": "16 Feb 2021", "title": "Digital Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at British Council in Jan 2021", "Interview Descriptions": "Personal statement as part as the application process. Interview was with a panel of two and lasted about 60 minute.  Whilst it was described as competency based it was more laid back format with more general project management questions associated with the role.", "Interview Questions": "General project manager interview questions, e.g. What personal qualities does an ideal project manager have?"}, {"date": "17 Sept 2020", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "Usual competency based questions. Assessed using SMART. Prepare some examples in advance.  Had two interviews. Takes a while from them to get back to you/ decide. I assume there internal processes so dont be put off if it takes a while.", "Interview Questions": "Tell us about a time you have improved a process. "}, {"date": "12 Aug 2020", "title": "Digital Content Editor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "Phone and Skype interview with hiring manager and two other colleagues and asked several questions about my experience and interests and what I would bring to the role and how the priorities of the company are changing and what I would do differently if I were in their position or leading on a new campaign", "Interview Questions": "Previous experience "}, {"date": "10 Apr 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Council (London, England) in Apr 2020", "Interview Descriptions": "It is a great opportunity to seek employment  here. It will good to interview prospective candidates. The applicants are vast. All applications will be processed locally\nThen, British Council  England United  Kingdom.  Applications accepted on first come first served basis.", "Interview Questions": "seeking job"}, {"date": "3 Jul 2020", "title": "English Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council in Mar 2020", "Interview Descriptions": "This interview was done online, a question just came up on the screen and then I had a minute to answer each one. I think it lasted about 15 minutes. Most of the questions were quite predictable and similar to the online application, with just one unexpected question which was what would I do in the event of a tsunami on my placement.", "Interview Questions": "Are they any topics you would avoid talking about in the classroom?"}, {"date": "18 Feb 2020", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at British Council", "Interview Descriptions": "Applied through university with the help of the Languages Department \r\n\r\nThey are in need of language students, with experience up to A level and beyond \r\n\r\nAlso need to be able to commit to the 7 month programme, with the option to extend beyond", "Interview Questions": "What experience do you have teaching ? \r\nWhat is your level of [Language] proficiency? "}, {"date": "27 Jun 2020", "title": "Language Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at British Council in Feb 2020", "Interview Descriptions": "Written application incl. motivational statement and relevant experience which was fairly straight-forward and then self-recorded video interview with prompted questions.  For the interview, you have around 1 minute to prepare your answer for a provided question before it automatically switches to recording your response. It feels a little impersonal if you're not used to video interviews, but it was a good experience in general and for future interviews .", "Interview Questions": "What topics would you avoid teaching students in your chosen country? "}, {"date": "25 Jan 2020", "title": "IELTS Examiner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at British Council (London, England) in Dec 2019", "Interview Descriptions": "It's a standardised vetting process for IELTS examiners. It's mainly to talk about the candidate's past teaching experience, particularly their understanding of the test format and procedures. The interview was recorded as per standard IELTS procedures, and it's strictly confidential. Data protection and safeguarding is the most important of the interview.", "Interview Questions": "Why is child protection important? "}], [{"date": "19 Nov 2019", "title": "Customer Service Adviser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Council (Manchester, England) in Oct 2019", "Interview Descriptions": "First applied and took about 3 weeks to hear I had got an interview. Panel interview with 3 people. Competency based questions beginning with walking them through your CV.  Was told I would hear ASAP however then had to contact them 3 times within 3 weeks to hear any outcome. Kept getting shifted to other departments until I eventually received an email from HR advising I have not got the role. Asked for feedback as they offered but still yet to hear", "Interview Questions": "Give an example of a time when you have had to deal with a difficult colleague or customer "}, {"date": "10 Oct 2019", "title": "Risk and Compliance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Council (London, England) in Sept 2019", "Interview Descriptions": "The application process is through their website. Afterwards you are contacted if you details are accepted.\nFinally you have the interview hich includes technical and behavioural questions . Overall the interviewees are friendly.", "Interview Questions": "questions based on behaviours in Bc"}, {"date": "29 Aug 2019", "title": "English Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "I waited around a month after filling out the online form and was offered a Skype interview. The interview took around 35 minutes. The interview was divided into different parts asking about my past experience, class situations, and situations outside of a classroom.", "Interview Questions": "How would you adapt your lesson for learners of different levels?"}, {"date": "5 Mar 2019", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council (London, England) in Mar 2019", "Interview Descriptions": "The interviewer was very nice and happy to answer any of my questions. Interview questions focused on why I want to intern in China and in my chosen industries as well as questions about my CV.", "Interview Questions": "1. Why do you want to intern in China? 2. What made you interested in the green technology sector? "}, {"date": "15 Oct 2018", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at British Council in Oct 2018", "Interview Descriptions": "I applied early September and received an invite a month later. I was given just over a week to prep for the interview. I was also given a choice between phone or face to face interview, I chose face to face for obvious reasons. I was sent the BC behaviours document and as many people advised on here, I pretty much learnt it all. \n\nWith regards to the interview itself, the questions were pre-set. I had a panel of 3 who took turns to ask me questions. In total I had 6 questions and was given the opportunity at the end to add anything and to ask questions about the role. \n\nThe interview lasted 30 mins.", "Interview Questions": "What do you think you’ll find most challenging about this role"}, {"date": "18 Nov 2019", "title": "Teaching Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (London, England) in May 2018", "Interview Descriptions": "On the phone, 2, sometimes 3, interviewers. No face to face, it was an overseas job, so always on the phone, even skype is voice only, so be prepared for a telephone interview", "Interview Questions": "The opening was why the role and how my experience would fit with the job"}, {"date": "9 Apr 2018", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at British Council (London, England) in Apr 2018", "Interview Descriptions": "Video assessment following a successful online application. Not face to face, automated recording from Launchpad. Given 90 seconds -240 seconds each to answer 5 questions.  We’re given 1.5 minutes to answer each question. Not long enough in my opinion", "Interview Questions": "(Last question) Is there anything else you want to say about your application or further answer any previous questions "}, {"date": "1 Aug 2018", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at British Council (London, England) in Feb 2018", "Interview Descriptions": "2 face to face interviews and a third remote/video interview, worst interview experience I have had. Unprofessional HR recruiter and general lack of communication in a process that took 5 months and at the end they didn't end up hiring anyone for the role and said they'll delay recruitment for the role until later on this year. Had to constantly chase the internal recruiter for updates. \r\nWould never apply for a role here again, too much time and effort was invested for a company that had no intention of actually hiring.", "Interview Questions": "Standard Competency Interview Questions"}, {"date": "9 May 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at British Council in Feb 2018", "Interview Descriptions": "It was fairly straightforward process. I had to answer questions and have a video call. The interviewer was friendly and made the the call relaxed. I explained my previous experience and how it had related to teaching  children for the first time.", "Interview Questions": "Why are interested in the role?"}, {"date": "29 Oct 2017", "title": "Event Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (London, England)", "Interview Descriptions": "2 stages, 45 mins each interview stage. Basic questions related to your experience in the field,  why you want to work for the organisation and what types of events you have run in the past. They value team work, experience in running diverse range of events and love for the public sector and the work they do.", "Interview Questions": "STAR related questions during the second interview (situation - task - action taken - result)"}], [{"date": "28 Sept 2021", "title": "Examiner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at British Council (London, England) in Jul 2017", "Interview Descriptions": "- Resume has to have CELTA certification without it wont be considered\n- Need to have UK bank account with out it, your resume would not be considered. \n- Interview\n- Aptis training test", "Interview Questions": "Related to language testing and marking of speaking and writing "}, {"date": "14 Sept 2021", "title": "Director - Programmes Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council (London, England) in May 2017", "Interview Descriptions": "Structured and tied closely to the sections of the role profile. \r\nFollowing submission then I was contacted by HR and a time agreed. \r\nInterview was on line with future line manager, existing post holder and HR.", "Interview Questions": "Always start with an open question on describing your cv (relating experience to the job you’re going for) and also why you want the job/ feel you’re a good fit. \r\nThen looks to questions against each essential criteria over 30-45 mins. "}, {"date": "8 Jun 2017", "title": "English Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Council (Bristol, England) in Apr 2017", "Interview Descriptions": "Requires an initial form to be completed with general information, language proficiency and detailed essay type answers on how you would teach UK culture, work in a team, have shown leadership, are adaptable and have the motivation to do the job.\r\n\r\nThe interview that followed was an automated video interview that gives you a question and then either 30 seconds or a minute and a half to prepare a reply depending on the complexity. The answer period was roughly two minutes for each question if I remember correctly. The questions were a mix of general interview questions that you would expect, as well as some rather obscure questions. However, it was still a rather easy interview, just practice speaking to your webcam a bit before if you haven't done a video interview.", "Interview Questions": "why would you be a good teacher?"}, {"date": "17 Mar 2017", "title": "English Language Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council in Mar 2017", "Interview Descriptions": "Video interview sent via email. I was asked 5 questions and was given 90 seconds to prepare after I had seen the question before it started filming. For one question I had 270 seconds to prepare. I can only remember 3 of the questions. I havent yet had a response back from the BC.", "Interview Questions": "Q: Why do you want to work for the British Council?"}, {"date": "8 Mar 2017", "title": "Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at British Council", "Interview Descriptions": "There was no interview to take, just a motivation statement that you had to fill out on the form when applying and a place to explain what teaching experience you have. Make sure to be truthful on the form as to where you want to live etc. There is a high chance that you will not get your first choice, but you will probably get your second. The trickiest thing is actually to get the DBS form completed in time as this took much longer than you would think to be processed.", "Interview Questions": "What teaching experience do you have?"}, {"date": "20 Mar 2017", "title": "IELTS Invigilator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at British Council (Manchester, England) in Mar 2017", "Interview Descriptions": "My phone interview was scheduled for 10.50am, and they did not call until 11.30. No apology was given for keeping me waiting. All questions asked were regarding sales experience and absolutely nothing to do with my interest in the role or my teaching experience, this threw me off a little as all the preparation I had done previously was regarding my desire for this role. The interviewer themselves were unclear and very quiet, resulting in me having to ask them to repeat themselves around 2-3 times each question- obviously not a good start. I felt that the interviewer was just reading a few standard simple sales questions and was not interested in my application at all.", "Interview Questions": "Name one time you had to deal with a difficult customer?"}, {"date": "7 Feb 2017", "title": "Business Analyst (Contract) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Council (London, England)", "Interview Descriptions": "Single, one hour interview with project sponsor (present in the room) and a Business Analyst (on telephone) from another project. Was asked about previous experience, both in general as a business analyst and specific to the project. Keen to lay out the duration of the project and that this was a purely contract role as opposed to a path to a permanent job in future.", "Interview Questions": "Why do you choose to work on a contract basis?"}, {"date": "22 Oct 2016", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (London, England) in Jul 2016", "Interview Descriptions": "I was interviewed by two people. One was a senior project manager, the other the former holder of the vacant position. During the interview, it turned out the position has become vacant because the incumbent had been promoted.", "Interview Questions": "The questions were standard: why i want to the job? what is my relevant experience?, etc. At the beginning, the senior project manager remarked that I was overqualified for the position and asked me if I wish to continue the interview"}, {"date": "10 Jul 2016", "title": "Communications Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Council (Manchester, England) in Jun 2016", "Interview Descriptions": "Brief assessment with interview (about 45 minutes). Very formal process, the recruiters came from the HQ in London. It wasn't unpleasant and I received positive feedback at the end. Unfortunately for me someone had more experience and got the job. Regardless, just try and stay cool. As long as you try and research the kinds of answers to give beforehand you will be alright.\r\n\r\nAlso note the skills and behaviour questions aren't exactly the same as what you are being asked. They are similar but you would have to adjust your answers accordingly.", "Interview Questions": "A lot about the topic of my career history and and the department and how I would do internal comms etc"}, {"date": "22 May 2017", "title": "Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (London, England) in May 2016", "Interview Descriptions": "It was laid out in a form of an assessment center. \r\nBritish Council representative had emailed out a few days prior some scenarios, and asked to prepare a preliminary lesson plan. \r\nThe group task was to prepare a culturally engaging lesson plan. \r\nThe scenarios that were emailed varied a lot and helped a lot with the individual interview section, which was conducted by 2 employees.", "Interview Questions": "If you were in a position in which you were not able to contact British Council staff during a state emergency, what would you do?"}], [{"date": "13 May 2016", "title": "Schools Exams Operations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at British Council in Apr 2016", "Interview Descriptions": "Applied online and was contacted within a month for a brief 30 minute telephone interview. Then 2 weeks after that was invited to complete the IELTS. 3 weeks after offered an interview. I had suggested a Skype but this was not taken up and had to travel to Nigeria. They covered my accommodation. When I had arrived was told that they had been trying to get hold of me (but was now in Nigeria as opposed to the UK so my mobile wouldn't have worked) they had explained that something had come up and they could interview within the next 2 hours. \nInterview took about 1hr 30. Had to do a 10 minutes presentation based on 60 day proposal and answered many questions about it then answered mainly behavioural type questions. Interview was in April and still awaiting a response though was told I would here back within 2 weeks which was now 3 weeks ago.", "Interview Questions": "How would you feel if a process for a key area of work you do was not put in place"}, {"date": "20 Mar 2017", "title": "English Language Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (Liverpool, England) in Mar 2016", "Interview Descriptions": "First stage was online application with multiple questions. Then an online video interview with 5 questions. You only have a week from being given link to do the interview . You had 90 seconds to prepare for each question and 90 seconds to answer. Only allowed one chance to answer questions and cannot rerecord.", "Interview Questions": "Why do you want to be an English Language Assistant?"}, {"date": "29 May 2018", "title": "Exams Systems Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (London, England) in Feb 2016", "Interview Descriptions": "I was interviewed by three people (potential Manager, someone currently in the role and a member of HR). The online application was a little bit tedious because it didn't allow you to upload your CV and then pre-populate that way. The system was very good at showing you at which stage your application was at once submitted, which I thought was useful.", "Interview Questions": "How do you deal with multiple urgent things at a time. "}, {"date": "16 Jan 2016", "title": "Arts Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council", "Interview Descriptions": "One hour interview, with many extra questions. Two people in the selection panel. Very detailed interview questions. They asked how I solve problems such as conflicts between members during teamwork.", "Interview Questions": "How do you know about the position"}, {"date": "3 Apr 2019", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (Manchester, England) in Jan 2016", "Interview Descriptions": "Its competency based.  Detailed definitions of all competencies are made available with job adverts and should be referred to throughout application and interview process. Each competency is defined at various levels with positive and negative indicators. Standard stuff for UK public / not-for-profit sectors but might be a surprise for those with a different background.", "Interview Questions": "Motivation for applying for the role and highlight your most relevant career moments "}, {"date": "1 Feb 2016", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Council (Belfast, Northern Ireland) in Dec 2015", "Interview Descriptions": "Thirty-minute interview consisting of 5 questions based on the job description. Interview involved scenario based questions as well as knowledge of the organisation. The process involved applying through their website. After a selection of interview dates was presented, the date and time was selected. There was a quick feedback and time receiving information the next day.", "Interview Questions": "What is your motivation for this job?"}, {"date": "6 Feb 2018", "title": "Project Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at British Council (London, England) in Aug 2015", "Interview Descriptions": "They mostly do one round interviews, sometimes a second round.  They use competency based interviewing, meaning they are only interested in you describing things you have done, decisions you have made and how this demonstrates that you have a particular competency.", "Interview Questions": "Tell us about a time you have managed a strategic partnership (internal or external).  How did you influence that partner to benefit your company or project?"}, {"date": "3 Oct 2015", "title": "SIEM Exhibitions Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council (Manchester, England) in Aug 2015", "Interview Descriptions": "The most appalling and unprofessional interview I have every attended.  The hiring managers were rude and abrupt, as they had already promised the job to one of the BC sheep. Their body language was stiff and fake, at the end of the interview they both refused to shake my hand, until I had put mine out to shake. The manager promised to call me regarding the outcome. However the panel did not contact me. I had to wait a further 2.5 weeks, to get a generic email from HR in London, who don't know what day is.", "Interview Questions": "What experience do you have working with students?"}, {"date": "22 Feb 2017", "title": "Content Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at British Council (London, England) in Jul 2015", "Interview Descriptions": "Having applied online I was invited for interview. I was asked to bring a piece of work with me that I had written, to be discussed during the interview. As this was for a content writer role I assumed they would read this piece of work, in place of an editorial test. They did not. I was surprised that there was no editorial or practical element to the interview process whatsoever. \r\n\r\nIn the interview they glanced at the work and just asked me a couple of questions about it. \r\nAll their questions seemed to be a box ticking exercise, they weren't looking for a candidate who was actually a good content writer but one who was able to shoehorn whatever experience they had done into answers to their formulaic management-speak questions. When I was told by email that I hadn't got the job, I asked for feedback, and was sent an unnecessarily harsh email by the interviewer explaining how much worse I was than the successful candidate and how I didn't seem to know anything about the company, which was completely untrue. They seemed to have mistaken my nervousness for lack of research. Certainly a learning experience.\r\n\r\nI am astounded that for an editorial / content role, they didn't want to test how well the candidates could write. In my opinion this is the main thing they should have been interested in for this role.", "Interview Questions": "Tell us about a time when you had to deal with a difficult client and what you did to overcome this."}, {"date": "12 Jun 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Council", "Interview Descriptions": "One stage interview, straight forward with line manager and country director, references checked, contracting was difficult, spent a lot of time on meeting various people between offer and starting the job, which is not ideal", "Interview Questions": "typical behavioural"}], [{"date": "6 Jul 2015", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at British Council (London, England) in May 2015", "Interview Descriptions": "Standard UK Civil Services process and capability based interview, done over skype at the panels suggestion. Panel had problems operating the tech (microphone not plugged in, laptop running out of charge) and several of the questions asked could only have been fully answered by an internal candidate very familiar with the internal operations of the team the role was with.", "Interview Questions": "What is the biggest problem the team has and how would you fix this."}, {"date": "13 Sept 2015", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at British Council (London, England) in Feb 2015", "Interview Descriptions": "Very good, they ask clear questions and are open to the answers you give. Like with any other job, your answers need to be role specific, however if you do this then you are not contradicted or left to feel like you gave the wrong answer. They ask about certain principals and \"behaviours\". You need to give examples of how you have acted according to those behaviours in the past.", "Interview Questions": "What ideas did I have in order to engage with a student audience and market the program"}, {"date": "26 Feb 2016", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Council (London, England) in Feb 2015", "Interview Descriptions": "Online application.  Interviewed with a panel of three people.  Asked basic questions job specific.  Five in total.  Panel asked direct open questions specific to job description.  Easy to go through.  Less then half hour.", "Interview Questions": "Basic five questions"}, {"date": "11 Oct 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at British Council (London, England) in Feb 2015", "Interview Descriptions": "Telephone interview followed by F2F, both with a panel of 3 people.  Competency based interview requiring examples of experience to provide evidence. General questions about project management - nothing surprising.", "Interview Questions": "Fairly standard questions around project management experience"}, {"date": "25 Oct 2014", "title": "Role Within Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at British Council (London, England) in Oct 2014", "Interview Descriptions": "Very quick and easy to get to interview. Competency based question based on the job spec, which were straight forward to prepare for and questions about my CV. Unfortunately still haven't had any feedback 3wks later and they are re-advertising the role through other agencies. Not a great experience.", "Interview Questions": "Tell us about a time when you had to influence and work closely with someone."}, {"date": "9 Aug 2014", "title": "Project Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Council", "Interview Descriptions": "Very slow process to claim travel. The interview process seemed a waste of time, where it seemed they had already selected a person, but were going through the motions. One of the interviewer completely in there own world.", "Interview Questions": "Standard PM questions no suprises"}, {"date": "26 Jan 2014", "title": "Exams Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at British Council", "Interview Descriptions": "Applied after finding vacancy on line. Had a response within a few days and was called to interview the next week. The interview itself was around 45 minutes long. As the position was based in Paris, questions were asked in both English and French which was a little daunting at first.", "Interview Questions": "No unexpected questions - all questions were based around the competencies that were in the original application."}, {"date": "23 Aug 2016", "title": "English Language Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at British Council (Manchester, England) in Oct 2013", "Interview Descriptions": "Online application. They asked several questions online about my motivations for the role. The application took no more than half a day to complete and the questions were very basic.", "Interview Questions": "Why do you want to be an English Teaching Assistant?"}, {"date": "31 Oct 2013", "title": "Senior Project Manager Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Council (London, England) in Sept 2013", "Interview Descriptions": "Short 45min interview", "Interview Questions": "Nothing difficult standard PM questions"}, {"date": "13 Sept 2017", "title": "Customer Experience Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Council (London, England) in May 2013", "Interview Descriptions": "The phone interview was Well conducted, well structured. I had to make a Brief presentation of my work experience, answer questions and offer examples linked with behaviours relevant for the job. For The face to face interview i had to prepare a presentation using information and data offered in advance by the employer", "Interview Questions": "The most important achievement "}], [{"date": "20 Aug 2012", "title": "Graduate Scheme Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at British Council (London, England)", "Interview Descriptions": "Still in the interview process, this has been LONG and in different places during the summer, having to fly all over the UK sometimes at only a day's notice. Once there, however, the interviews have been a really good experience, a chance to work in groups and do something dynamic, rather than sitting there answering competency questions all day (though there was a lot of that too!)", "Interview Questions": "What is likely to be the biggest challenge that the British Council faces in the next three years and why? How should that challenge be overcome. "}, {"date": "2 Feb 2016", "title": "Senior Teacher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Council (London, England) in Jun 2012", "Interview Descriptions": "Questions regarding teaching and management skills. Also, specific situations and examples are required. There are usually 2 or 3 interviews and occasionally 1 or 2 sitting in to learn the interview process. It's not a painful process but it sometimes feels like you are simply jumping through their hoops.", "Interview Questions": "Can you tell us about a time when you had to deal with an issue a line-managee was having?"}, {"date": "10 Jun 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at British Council (London, England) in Apr 2012", "Interview Descriptions": "Transparent, upfront. They give you the opportunity to expand on your CV and really tell them how you would do well. They don't want to trip you up, they want you to do well too. Interviewers are friendly.", "Interview Questions": "Name a social media campaign you thought was good"}]]