[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Very toxic working environment, would not recommend", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jan 2023", "job_title": "Project Manager in Vienna", "duration": "N/A", "pros": "Some of the pros of working at Seefar: • Opportunities to grow in your career • Opportunities to travel to different countries where your projects are • You can learn lots of new things in your job and also by doing courses • Salaries are good compared to NGOs and humanitarian organisations", "cons": "These are the most important cons of working at Seefar: • Toxic productivity: You constantly expected to work productively at Seefar, and if not your contract could be terminated at any point. They many times let people who were considered unproductive go to induce fear that other staff will be next. They make them an example. This creates a very negative feeling among the team. • No work-life balance: the workplace culture is that you have no other commitments in your personal life so that you can work 12 hour work days. You are given double the amount of work than other organisations. If you have any child care, health care or personal commitments that get in the way of your work, you need to make up missed work later. • Very unsympathetic management: What I noticed during my time at the job was sympathetic people are pushed away of the organisation because they clash with the dominant management style which is cold, calculated. Many people who were more sympathetic were made to feel very bad until quitting or were let go without any reason for it • There is lots of gossip and no transparency: Management makes decisions that they do not explain properly to the staff and workers. This creates a situation where people are always gossiping and discussing what they think is happening. Many people are also scared for their future as you can get fired anytime, so they can become resentful and contribute to the gossip. • Benefits are not real: unlimited leave benefits cannot be taken if there is too much work. Other benefits like professional development increased stress when we had to complete courses when we also had to complete work at the same time. The high salaries are compensated by lots of unpaid overtime that you will never get compensated"}], [], [], []]