[[{"date": "N/A", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cheyenne Regional Medical Center in Mar 2022", "Interview Descriptions": "The interview process was very smooth and seamless. I first had a phone interview and then a virtual interview where I got to meet multiple members of the team. The whole process went fairly quick, I would say within 1.5-2 weeks I had an offer", "Interview Questions": "What I was looking for in a new position, what I was currently doing, what I liked/disliked about what I was currently doing, etc."}, {"date": "8 Oct 2022", "title": "Hospital Staff Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Cheyenne Regional Medical Center", "Interview Descriptions": "It was like interviewing with clowns. Very unprofessional interview. They had absolutely no idea how to interview properly, and they were extremely rude and unkind. Not what I was expecting in a hospital.", "Interview Questions": "Basic questions were asked. Just mostly personality stuff."}, {"date": "2 Dec 2019", "title": "Radiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cheyenne Regional Medical Center", "Interview Descriptions": "Was very professional was in front of 5+ people. Applying on the company’s website included the usual post interview questions such as employment history. Then a 120 or so questions for the personality test.", "Interview Questions": "Strengths and weaknesses "}, {"date": "15 Mar 2018", "title": "Contracted Organization Valet Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cheyenne Regional Medical Center (Cheyenne, WY) in Feb 2018", "Interview Descriptions": "3 week process for crappy but easy $10 ph job. Drug test, background check - then- surprise- 2nd drug test on first day of work-observed urine. They have you do your required immunizations b4 your surprise 2nd OBSERVED drug test so now I must pay for medical services I didn't want because I had to refuse the job for that darn drug test. Hate this hospital for 40 years as a Cheyenne resident and now as an x prospective employee. F these incompetent people. Jerked around through entire process only to end up footing a bill for BS.", "Interview Questions": "Can you drive a manual"}, {"date": "24 Apr 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cheyenne Regional Medical Center (Cheyenne, WY) in May 2016", "Interview Descriptions": "It was pretty standard and the questions were not very difficult.  They mostly want to know if you fit the culture more than anything.  Showed up and there was a room with about 6 people who interviewed me at once.", "Interview Questions": "What are good reasons for missing work?"}, {"date": "30 Nov 2015", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cheyenne Regional Medical Center", "Interview Descriptions": "Applied online and was contacted by HR to submit five references. ALL references had to reply to requested information email to move my application along. I had an interview with the managers of several units and then an interview on the floor.", "Interview Questions": "Basic behaviour questions. They want to make sure you play nice with others."}, {"date": "6 Jan 2016", "title": "Human Resource Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cheyenne Regional Medical Center (Cheyenne, WY) in May 2013", "Interview Descriptions": "The company used an online assessment at the time of the application and used behavior based questions during the process.  Interviewed with manager and some members of the team - positive experience!", "Interview Questions": "Tell me about a time that you dealt with a conflict with a coworker, what was the issue and how did you handle it?  Is there anything you would have done differently after reflection?"}, {"date": "27 Jan 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Cheyenne Regional Medical Center (Cheyenne, WY)", "Interview Descriptions": "The interview process is much different now than when I first gained employment. Now, there are interview teams who are trained in the interview process. They are more educated on the onboarding process and the importance of representing the organization as a desirable place to work. Now, the questions are mostly behavior based. Interviewer is encouraged to probe deeper when the answer is too superficial. There are multiple layers of the interview. There is a mandatory skill survey that helps assist the interviewers in gaining perspective about the perspective employee's talents and areas to improve.", "Interview Questions": "Tell us about the last time you broke the rules."}, {"date": "31 Jan 2013", "title": "RN Clinical Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cheyenne Regional Medical Center (Cheyenne, WY) in Aug 2012", "Interview Descriptions": "Lots of flowery talk about how they want good people, the Studor group, values, how they were changing things, group interviews, desperate for people, obviously, offer ok wages, but despite all the promises made by this nice group of people, complete horror show after you get hired, hit the ground running, no floor orientation, super short staffed.  Couldn't \"feel\" the smiley faces from the nice people who interviewed me and were so enthusiastic to hire me.", "Interview Questions": "None, they spent all this money buying a personality test that you have to take so they can ask you meaningless questions based on results."}, {"date": "11 Jun 2016", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cheyenne Regional Medical Center (Cheyenne, WY) in Jan 2012", "Interview Descriptions": "I had a phone call interview first & was then asked to come meet with leadership of the department for a formal interview.  My references were checked between the phone interview and the formal interview.   I met with the department leaders for the formal interview at the location of the prospective job.", "Interview Questions": "Good things about past jobs. Struggles with past job leadership & how I handled it. Struggles with past co-workers & how I handled them. What I expected this job to consist of. What is a good reason for missing work."}]]