[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Working at the IB", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Apr 2014", "job_title": "Governance Support Coordinator in Geneva", "duration": "N/A", "pros": "The IB is a great place to work. The atmosphere is wonderful, as co-workers are very friendly and motivated. This is made possible by the relationship between the Board, management and staff - working towards a common goal. The whole organisation is structured around the IB Mission of aiming \"to create a better world through education\". And considering the responsibility that the organisation has towards its stakeholders, the organisation allows for innovation and its proactive in terms of \"what to deliver\"; \"who to deliver to\", and \"how to deliver\". This calls for careful planning with the input from all. What I personally like about the IB is its mission and especially its commitment to Social Responsibility with the aim of improving the quality of life of the IB staff, all stakeholders and society at large: what better way to improve the well-being of mankind than through education - encouraging \"students across the world to become active, compassionate and lifelong learners who understand that other people, with their differences, can also be right.\"", "cons": "Since the global centers are spread out in five cities, it does not allow for a lot of face to face interaction. However, the set-up of the organisation makes up for this."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Good place to get some extra cash as an IB teacher", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jul 2021", "job_title": "IB Examiner in Geneva", "duration": "N/A", "pros": "Extra cash, at a decent to good pay rate", "cons": "you have to be very careful with your submissions, since your mistakes can take you out of the session (you would still get paid for the work you had done so far)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Teacher", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Sept 2018", "job_title": "Anonymous Employee in Geneva", "duration": "N/A", "pros": "international minded, good exposure to inter-cultural team", "cons": "not competitive in terms of salary"}]]