[[{"date": "29 Aug 2022", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rex Healthcare", "Interview Descriptions": "Very informal and friendly. Asked the regular questions and gave time for me to ask questions too. Felt very comfortable and welcomed the minute I walked in. Everyone was friendly.", "Interview Questions": "Name a time you worked with a difficult co-worker and how did you overcome it?"}, {"date": "25 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rex Healthcare", "Interview Descriptions": "Basic interview questions. Most questions started with “Tell me about a time... what did you do in that situation.”  They basically want to get an idea of your thought process and an idea of how you handle difficult situations.", "Interview Questions": "Tell me about a time that you seen someone doing something unsafe."}, {"date": "12 Jan 2022", "title": "RN Critical Care Float Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Rex Healthcare (Raleigh, NC) in Feb 2018", "Interview Descriptions": "Very easy interview. Willing to work with schedule. Plenty of hours available. Would work here again if lived in the area. Pay was competitive for the area. Management average. Provided training.", "Interview Questions": "How many hours are you available? Would you work in PACU as well?"}, {"date": "14 Nov 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rex Healthcare", "Interview Descriptions": "I applied to Rex online and a couple of weeks later received a phone call to schedule an interview for the following week. I was interviewed by the team leader, who is a very nice and friendly RN. She was very easy going which made answering her questions very easy. This is my first and only CNA job, after passing my certification tests and deciding not to work as a CNA until months before my certification expired. The interview was not very long, due to there being many other interviews going on in the same room. In the end, I was offered the position a couple days later and accepted.", "Interview Questions": "Why did you decide to work as a nursing assistant?"}, {"date": "19 Dec 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rex Healthcare (Morrisville, NC) in Nov 2017", "Interview Descriptions": "After a brief (30 minute) phone screen they may invite you to participate in face-to-face panel  interviews. The panel interviews may consist of 1-3 people each and last about 60 minutes.  During the panel interviews, they use the STAR Interview Response Technique.", "Interview Questions": "Tell me about a time you had to complete a task under a tight deadline. Describe the situation, and explain how you handled it."}, {"date": "15 Oct 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rex Healthcare", "Interview Descriptions": "Easy to set up and easy to find the hospital. The interview its self went well. Got a tour of the unit as well as enough time to answer all questions. The interview was very helpful in providing enough info to make a decision", "Interview Questions": "What made you choose nursing"}, {"date": "3 Feb 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rex Healthcare", "Interview Descriptions": "Phone interview with hiring manager, then hiring manager in-person interview and then a final interview with the department lead. Took quite a long time from start of process to offer, like 3 months total. Not sure if this is the usual or just because of holidays or other considerations.", "Interview Questions": "Is there anything that was disappointing about your last job?"}, {"date": "18 Jan 2018", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rex Healthcare (Raleigh, NC) in Feb 2017", "Interview Descriptions": "Filled out an online application which included an essay and my school transcript, manager called and contacted me to set up an interview. The interview consisted of almost entirely behavioral interview questions.  After the interview, I was offered a job by HR approx two weeks later", "Interview Questions": "Tell me one time where you resolved conflict with a coworker"}, {"date": "15 Aug 2016", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rex Healthcare", "Interview Descriptions": "Good interview, hiring and on-boarding process.  They do a great job of keeping candidates informed of where they are in the interview process.  Staff are thorough and very courteous.", "Interview Questions": "Use behavioral based interview questions.  Looking for caring, compassionate and customer focused employees."}, {"date": "29 Aug 2016", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rex Healthcare (Raleigh, NC) in May 2016", "Interview Descriptions": "It was pretty simple. Not as long as I had expected but very in depth for sure. They asked me questions individually and then also had someone who works in my current job description as a observer. I had a chance to ask questions as well.", "Interview Questions": "They asked me why I thought that I should have this job"}], [{"date": "20 Mar 2016", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rex Healthcare (Raleigh, NC) in Mar 2016", "Interview Descriptions": "Lengthy process, check website for updated status, when status changes to \"manager reviewing\" that's a good sign.  The system moves very slow, so be patient.  From application to offer took over 3 months.  They do a very thorough background check (\"back to the beginning of time,\" so be honest from the beginning)", "Interview Questions": "Why you for this position?"}, {"date": "15 May 2015", "title": "Moa Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rex Healthcare", "Interview Descriptions": "The interview took place in the hospital and was a one on one interview.  It was pretty general asking scenario type questions.  The person who I spoke with was very knowledgeable about the position, benefits, and answered all questions I had.  They were very personable.", "Interview Questions": "Tell me about a time when you went above and beyond for a patient. Be specific."}, {"date": "9 Aug 2016", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Rex Healthcare in Apr 2015", "Interview Descriptions": "Interview was very personable with unit manager only. There wasn't an long winded questionnaire nor some personality fit agenda involved. Questions were straight-forward and relevant to the job. The interview was relaxed but straightforward. Management replied with an offer within a reasonable amount of time. Orientation was the longest part of hiring process.", "Interview Questions": "Do you enjoy what you do? How do view the dynamic between nursing assistants and nurses?"}, {"date": "22 Mar 2014", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rex Healthcare (Raleigh, NC)", "Interview Descriptions": "usually 2 interviews", "Interview Questions": "what is your weakness"}, {"date": "22 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rex Healthcare (Raleigh, NC) in Jan 2014", "Interview Descriptions": "same questions as usual about past experience, called came in for interview spoke with 2 people took a drug test, left went home, got a call next day with an offer.", "Interview Questions": "what was a time when you had a conflict"}, {"date": "10 Oct 2013", "title": "Allied Health Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rex Healthcare", "Interview Descriptions": "Web application\r\nCalled for interview\r\nInterviewed with team\r\nIf offered job, will get offer from HR by phone\r\nBased on experience, salary negotiation is not likely (see below)", "Interview Questions": "None difficult, but disappointed with interview process."}, {"date": "5 Dec 2014", "title": "Pt Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rex Healthcare (Raleigh, NC) in Oct 2013", "Interview Descriptions": "Interview was easy peasy. No hard questions, just questions like- what did you do at your last job and what can you bring to our dept? Tell me abt a time you went above and beyond for a pt? What skillset do you bring? Are you comfortable with asking pts for money?", "Interview Questions": "None of the questions were extremely difficult. "}, {"date": "8 May 2013", "title": "EVS Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rex Healthcare in Feb 2013", "Interview Descriptions": "Easy interview, very basic questions. The all team seems boring", "Interview Questions": "What would you do if you see a co-worker doing unethical thing?"}, {"date": "2 Sept 2011", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rex Healthcare (Raleigh, NC) in Aug 2011", "Interview Descriptions": "The interview process consisted of two in person interviews and an offer came very quickly.  Everyone was polite and respectful, and I appreciated how open and honest they were throughout the process.", "Interview Questions": "What is your work style?"}, {"date": "4 Oct 2015", "title": "Billing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rex Healthcare (Research Triangle Park, NC) in Jul 2011", "Interview Descriptions": "Received a call to sit down for a formal interview.  I met with three managers from different departments at one time.  I think the interview took about 30 minutes.  They introduced me to a lot of people in several departments.  \r\nAbout 3 weeks later received a call from HR stating the position is mine if I like.  When I accepted the first things before starting were to go to a Rex orientation and make sure all vaccines required are up to date (which they provide to you free of charge).", "Interview Questions": "Do not recall many.  \r\nQ- Where do you see yourself in five years"}], [{"date": "28 Oct 2010", "title": "Interviewed to BE the Intern of the Corporate Finance Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Rex Healthcare (Raleigh, NC) in May 2010", "Interview Descriptions": "First I got a connect through a friend in the company.  I meet the team leader in person before the interview process.  I then had a phone interview that went well.  Typical questions were asked about behavior and stuff like that.  Then I went in for a one on one interview and a week later I went in for a group interview.  For the group interview they gave me a couple of scenarios before hand so i was prepared.", "Interview Questions": "Asked about resume"}, {"date": "28 Jun 2010", "title": "Web Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rex Healthcare (Raleigh, NC) in Mar 2010", "Interview Descriptions": "1st  interview was  phone, then 1:1 with hiring mgr. Then \"panel.\" -people from various part of the dept. -- each with their own view of position. So the job duties were different than previously told. Although I did not get the offer, the HM send a nice hand-written note.", "Interview Questions": "unexpected was what would I bring to a potluck?"}]]