[
  [
    {
      "date": "27 Jan 2023",
      "title": "IT Support Technician Interview",
      "results": "No Offer",
      "experience": "Negative\nExperience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. I interviewed at Alameda Health System (Alameda, CA) in Jan 2023",
      "Interview Descriptions": "Interview process was very simple and straightforward. just a basic video zoom Interview. I applied through their portal, and received an email to confirm a time for the interview. Basic requirements were high school diploma, 1-2 years of experience etc.",
      "Interview Questions": "General questions were asked in terms of what I have done, and what I want to do in the future etc. Surprisingly no technical questions were asked which was shocking. only thing I was asked is whether I know MFA, which is multi factor authentications. I was so shocked that, somebody asked only this question in a technical scenario."
    },
    {
      "date": "3 Feb 2023",
      "title": "IT Technician Interview",
      "results": "No Offer",
      "experience": "Negative\nExperience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. The process took 1 week. I interviewed at Alameda Health System (Alameda, CA) in Jan 2023",
      "Interview Descriptions": "Interview process went like this, just simply application and an response along with availability option. I gave my time and a zoom interview were sent. Very rigid process, and unhealthy. they are particularly looking for a given racial population and certainly undervalue often ignore the talent. Seems like inside work culture is highly politicized.",
      "Interview Questions": "They seems like don't ask questions at all, more like elaborated what they do, what the purpose of the roles are."
    },
    {
      "date": "8 Nov 2022",
      "title": "Recruiter Interview",
      "results": "No Offer",
      "experience": "Negative\nExperience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alameda Health System (Alameda, CA)",
      "Interview Descriptions": "Very slow communication/no communication and follow-up. From scheduling the interviews to receiving feedback. \r\n\r\nEither they are extremely understaffed and overworked or this is just typical protocol. Either way, it's bad and they need to revamp their entire recruitment process. I also received the first intro call from the recruiter with no meeting scheduled or intro email beforehand. A little unprofessional, in my opinion. I get the sense that they are very outdated in how they do things.",
      "Interview Questions": "- Am I comfortable with coming in to the office? -Go through entire my recruitment process from start to finish."
    },
    {
      "date": "21 Sept 2021",
      "title": "Manager Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I interviewed at Alameda Health System",
      "Interview Descriptions": "They were interactive and fair.  The interview was scheduled timely.  The panel was kind and engaging. \n They represented the health system well and answered all of my questions.  They asked pertinent questions of me.",
      "Interview Questions": "Where do you see yourself in 5 years?"
    },
    {
      "date": "24 Nov 2021",
      "title": "Social Work Intern Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Difficult Interview",
      "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Alameda Health System in Mar 2021",
      "Interview Descriptions": "Thorough interview by two panels of interviewers. Questions were relevant and fair, although they did include one \"wildcard\" question that seemed completely unrelated and out of the blue but was meant to see how you responded to such a situation. The case study and practical application questions seem to hold the most weight.",
      "Interview Questions": "Describe your experience working with diverse populations."
    },
    {
      "date": "12 Jun 2023",
      "title": "Collections Specialist Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alameda Health System (San Leandro, CA) in Aug 2019",
      "Interview Descriptions": "Panel Interview with all managers with you sitting on one side of the table and managers on the other. Only one interview required . Normal interview question they ask everyone. Eternal employee will be hired first due to union environment.",
      "Interview Questions": "Why do you want to work here"
    },
    {
      "date": "8 Mar 2020",
      "title": "Physician Interview",
      "results": "Accepted Offer",
      "experience": "Neutral\nExperience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. I interviewed at Alameda Health System (Oakland, CA) in Jan 2019",
      "Interview Descriptions": "You submit CV and then the recruiter send qustions made by the chief of the department and you answer those questions and submit to recruiter, then the phone interview and then site interviews",
      "Interview Questions": "what kind of things have you started and accomplished"
    },
    {
      "date": "3 Oct 2018",
      "title": "Executive Recruiter Interview",
      "results": "No Offer",
      "experience": "Negative\nExperience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alameda Health System (New York, NY)",
      "Interview Descriptions": "I received a call from the recruiter asking if I had time to interview right now on the phone.  A little unusual from a courtesy standpoint but I had the time and we talked.  Went through fairly standard questions and the recruiter said they would reach back to me by mid next week if next steps are in order.  It's been over a month and no call or even your boiler plate not selected email.  It's disappointing to be disrespected in such a fashion. The lack of professional follow through is a window into the larger organization.",
      "Interview Questions": "Tell me about your previous experience"
    },
    {
      "date": "17 Sept 2018",
      "title": "Clinical Nurse Leader Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "N/A",
      "Application Type": "I applied in-person. I interviewed at Alameda Health System (Dublin, CA) in Sept 2018",
      "Interview Descriptions": "Questions will be asked by a selected panel which are staff and other nurse leaders and departmental head. Your answers will determine if you will be hired. It is process every candidate have to go through and it is very intimating but again you have to be well prepared to spontaneously tackle the questions asked.",
      "Interview Questions": "What are your strengths and weaknesses"
    },
    {
      "date": "29 Sept 2017",
      "title": "Project Manager Interview",
      "results": "No Offer",
      "experience": "Neutral\nExperience",
      "difficulties": "N/A",
      "Application Type": "I applied online. I interviewed at Alameda Health System",
      "Interview Descriptions": "After three weeks of applying to the position, the recruiter contacted me to ask about my availability. I replied right away with a few options, then waited a week to hear a response from her. We decided on a date but unfortunately I had to reschedule. It's been two weeks and I am still waiting to hear from her....",
      "Interview Questions": "after 5 weeks, still in the scheduling stage LOL"
    }
  ],
  [
    {
      "date": "22 Aug 2017",
      "title": "Intern Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied through an employee referral. I interviewed at Alameda Health System in Jun 2017",
      "Interview Descriptions": "It was not very long. Was a position that was needed as soon as possible so the process was expedited once the qualifications were met and interview went well. Started working not too  long after",
      "Interview Questions": "Tell me about yourself"
    },
    {
      "date": "10 Oct 2018",
      "title": "Staff RN Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. I interviewed at Alameda Health System in Jun 2017",
      "Interview Descriptions": "Very conversational interview with nurse manager, HR and assistant nurse managers. I felt very comfortable with the panel as they seemed to ask about my experience and interests. Started out with introductions, the role and then proceeded to behavioral yet conversational topics.",
      "Interview Questions": "How do you handle stress?"
    },
    {
      "date": "31 Jul 2017",
      "title": "Digital Communications Manager Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. I interviewed at Alameda Health System (San Leandro, CA) in Mar 2017",
      "Interview Descriptions": "Submitted application via online portal. Recruiter called day after for phone screen. One week later I had a face-to-face, panel interview. 2 weeks after that I was offered the position.",
      "Interview Questions": "Where do you see yourself in 5 years?"
    },
    {
      "date": "9 Jan 2017",
      "title": "Clinical Nurse I Interview",
      "results": "No Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alameda Health System (New York, NY)",
      "Interview Descriptions": "There was a online application with a few questions, then I was emailed for a interview. There was a in person panel interview. I wasn't asked back for a second interview, saying they had many applicants and went with a better fit.",
      "Interview Questions": "What is something a coworker might not like about you?"
    },
    {
      "date": "31 Aug 2020",
      "title": "Data Analyst Interview",
      "results": "Declined Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. I interviewed at Alameda Health System (Oakland, CA) in Jan 2017",
      "Interview Descriptions": "The interview went well, it was around 3 panels. First a phone interview with the recruiter, then a phone interview with the hiring manger, and lastly an in person interview.",
      "Interview Questions": "How can you handle difficult situations if your manager is absent? "
    },
    {
      "date": "29 Dec 2016",
      "title": "Staff Nurse I Interview",
      "results": "No Offer",
      "experience": "Neutral\nExperience",
      "difficulties": "Difficult Interview",
      "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alameda Health System (Oakland, CA) in Nov 2016",
      "Interview Descriptions": "I had to go through 2 interviews, one that took and hour and the second one took 6 hours with a group with the assistant manager and unit manager. It was a general interview the first time around but the second round, I had an individual interview with the manager and then a pop quiz with some med calculations following some group activities.",
      "Interview Questions": "Who is your role model and why? How are you different from your role model? Why nursing? Why this hospital?"
    },
    {
      "date": "3 Jan 2017",
      "title": "New Grad ICU Interview",
      "results": "No Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alameda Health System (Oakland, CA) in Nov 2016",
      "Interview Descriptions": "Applied online. Was emailed the date and time.2 interviewers, asked and recorded 10 basic questions. No counter questions.  Asked about what kind of people do you find it difficult to work with.",
      "Interview Questions": "5 adjectives to describe yourself "
    },
    {
      "date": "25 May 2019",
      "title": "Nurse Practitioner Interview",
      "results": "Accepted Offer",
      "experience": "Neutral\nExperience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 6 months. I interviewed at Alameda Health System (Oakland, CA) in Oct 2016",
      "Interview Descriptions": "It will really depend on what department you interview in. The actual job interview and offer was pretty simple like any other job, but credentialing was really terrible. It actually took them 5 months to credential and bring me on board.",
      "Interview Questions": "Tell me about yourself."
    },
    {
      "date": "7 Apr 2017",
      "title": "ICU RN Interview",
      "results": "Accepted Offer",
      "experience": "Negative\nExperience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 2 months. I interviewed at Alameda Health System (Oakland, CA) in Aug 2016",
      "Interview Descriptions": "Called to set up interview time with Manager. Set time, commuted a long way to make appointment >5 hours and manager did not show for appointment. Assistant manager interviewed me was straightforward and a few scenarios regarding ICU care.",
      "Interview Questions": "How do you deal with unfortunate physicians who do not listen/respond?"
    },
    {
      "date": "28 Oct 2016",
      "title": "Pharmacy Technician Interview",
      "results": "Accepted Offer",
      "experience": "Neutral\nExperience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. The process took 1 day. I interviewed at Alameda Health System (Oakland, CA) in Feb 2016",
      "Interview Descriptions": "Interviewed with two Directors and the hiring manager. The interviewers were in business attire. They then referred me to the temp agency they are contracted with who performed my background check and drug screen.  I had to make sure all my shots were up to date. I was first employed by the agency then transitioned to an AHS FTE within 2 months.",
      "Interview Questions": "i was asked the typical \"tell me about yourself\" type questions. They asked if I was proficient in MS Office."
    }
  ],
  [
    {
      "date": "28 Jun 2015",
      "title": "Registered Nurse Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. I interviewed at Alameda Health System (Oakland, CA)",
      "Interview Descriptions": "I applied on the website three times before I got a job interview. I met with three staff - one manager, one educator, one staff nurse. They asked several questions regarding interpersonal conflicts and patient scenarios. Was conducted in a professional manner. \r\nThe panel made an effort to make sure that the facility was the type of place that I wanted to work at.",
      "Interview Questions": "Name one time when you had difficulty with someone at work and how did you resolve it?"
    },
    {
      "date": "27 Sept 2019",
      "title": "Medical Assistant Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Average Interview",
      "Application Type": "I applied online. The process took 2 months. I interviewed at Alameda Health System (Oakland, CA) in Jan 2015",
      "Interview Descriptions": "long process. Applied online. took about 2 months to get hired. Once I was given an interview it was with the supervisor and a nurse over the clinic. The questions were average interview questions",
      "Interview Questions": "What are your strengths? "
    },
    {
      "date": "22 Nov 2014",
      "title": "Receptionist Interview",
      "results": "No Offer",
      "experience": "N/A",
      "difficulties": "Easy Interview",
      "Application Type": "I applied through an employee referral. I interviewed at Alameda Health System (Alameda, CA) in Mar 2014",
      "Interview Descriptions": "It was an informal interview with just one person interviewing.  The atmosphere was relaxed.  The facility was an average county-type facility which needed to be updated.  I enjoyed the interview because I connected with the person who was interviewing me.",
      "Interview Questions": "Tell me about yourself?"
    },
    {
      "date": "24 Oct 2013",
      "title": "Patient Services Interview",
      "results": "Accepted Offer",
      "experience": "Positive Experience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alameda Health System",
      "Interview Descriptions": "Submitted my resume to the recruiter, and had one over the phone interview. She then sent me for my shots, and I started working a week later.",
      "Interview Questions": "It was fairly simple, the recruiter just asked me about my background, we chatted for a few minutes and that was the end of it. "
    },
    {
      "date": "16 Jul 2015",
      "title": "Laboratory Interview",
      "results": "Accepted Offer",
      "experience": "Negative\nExperience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied online. The process took 8 weeks. I interviewed at Alameda Health System (Oakland, CA) in Feb 2012",
      "Interview Descriptions": "ACMC process takes 6-8 weeks way too long From the time of initial job offer to the start date. This made it difficult to plan and give notice to current job. Also communicating with Hunan resource and employee health depts was not easy.",
      "Interview Questions": "name a time you went over and above the call of duty for patient care"
    },
    {
      "date": "11 Jul 2012",
      "title": "UR EDUCATOR Interview",
      "results": "Accepted Offer",
      "experience": "Neutral\nExperience",
      "difficulties": "Easy Interview",
      "Application Type": "I applied in-person. The process took 1 day. I interviewed at Alameda Health System (Oakland, CA) in Sept 2008",
      "Interview Descriptions": "I was interviewed by an interim director who had less knowledge of the position than I did. After speaking with her, I was then interviewed by the only ER case manager they had, who also didn't know how to do the job. I was hired to teach them all how to do UR & assist in case management in the ER.  The ER CM broke into my locked desk & stole all of my project work for a grant I was working on & said it was her work, not mine.  I reported this to HR & hospital Administrator.  I was too high paid compared to the thief, so I was laid off..",
      "Interview Questions": "What do you do after work to relax?"
    }
  ]
]