[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good employer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Jan 2023", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- Great exposure to senior external people and innovation in ESG/CSR, good networking and chances to represent the organisation even if you weren't that senior - Strong professional development, everyone who leaves goes to jobs they would never have been qualified for when they came to OYW. I left because I had to move abroad and received great support in getting new role. - The Summit is amazing, it's one of the best experiences personally or professionally of my life - Travel and international opportunities - The work/life balance was good other than in the run up to the Summit - Kind leadership who went out of their way to provide support to staff when they have difficult experience in their personal life. They did so much more than any other company would - member of staff who wasn't able to receive some treatment had it paid for.", "cons": "- The internal processes can be a bit chaotic but there were efforts to improve these - Not many opportunities for remote work - A lot of snowflake staff, lots of junior people who are very woke social justice warriors. It's great that there's a cause but there's quite a lot of professional immaturity because they have a lot of young staff. I honestly found a time was wasted on staff making a deal of non-issues."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Special workplace and experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "9 Dec 2022", "job_title": "Team Lead in London, England", "duration": "N/A", "pros": "- Genuinely feel like you are making a difference - From early stages you get to interact with very senior stakeholders - Very interesting work, global community - Diverse and international team - Rapid development and lots of responsibility - Very good private medical insurance, ability to get therapy etc quickly and paid for - Travel opportunities - Central London location", "cons": "- It is a global organisation with a big reach but in comparison the team is pretty small so there is a lot of responsibility put on everyone - It used to be extremely stressful in the run up to the Summit, it is more balanced now because of the 4 day week - The impacts of Covid-19 were very difficult for OYW because they weren't able to have live events, I think it will resume in the next 6-12 months to come but it was a hard time - The Summit period is stressful and there are a lot of last minute changes which adds extra pressure - A lot of empowered junior staff - they get promoted and given responsibility really quickly which is a good thing but they leave and go on to other jobs to get a bigger salary and title - it's great for the juniors but leads to a lot of talent churn"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great team and company spirit", "rating": "5.0", "reviewer_affiliation": "Former Intern, less than 1 year", "job_date": "6 Oct 2021", "job_title": "Community Intern in London, England", "duration": "N/A", "pros": "The people are friendly and passionate about their work. They work hard to make everyone feel included. I was never asked to get coffee or make copies. They always had projects for me to do and made me feel like part of the team.", "cons": "The company is very lingo-heavy and they could do better explaining all of these terms up-front."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Contractor, less than 1 year", "job_date": "7 Jan 2021", "job_title": "Coordinator Delegate Services/Conference Accommodation in London, England", "duration": "N/A", "pros": "Lovely people and work-life balance", "cons": "Pay not great for a London job"}], []]