[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A fantastic place to make a difference", "rating": "5.0", "reviewer_affiliation": "Current Contractor, more than 1 year", "job_date": "6 Jul 2022", "job_title": "Director of Communications and Marketing in London, England", "duration": "N/A", "pros": "- Working at the leading edge of sustainability consultancy with multi national businesses and FTSE100 companies, finding solutions to create a sustainable society and economy\r\n- Talented, intelligent, and committed colleagues and a progressive culture that supports wellbeing and career development\r\n- A charity and social enterprise, where all profits are reinvested into public education to influence government policy and industry best practice", "cons": "- In common with others in the sustainability sector we're not yet as diverse as we would like, but are working hard to put this right."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One of the best places I've worked so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Dec 2021", "job_title": "Communications Officer in London, England", "duration": "N/A", "pros": "I feel lucky to work in a fun, supportive environment surrounded by knowledgeable, lovely team members who are all passionate about sustainability. The work is varied and meaningful and I have a lot of opportunities for development here. The work-life balance is also pretty good!", "cons": "Could be more diverse but I guess it's a reflection of the sustainability sector as a whole. The organisation is aware of this though and is actively looking at ways to address this and improve, which is fantastic."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Friendly and climate driven sustainability charity wanting to make a difference", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Sept 2020", "job_title": "Project Officer in London, England", "duration": "N/A", "pros": "Everyone at Bioregional is very approachable - all the way up to the CEO - as well as being truly passionate about people and the planet. \r\n\r\nThere's lots of scope to work on a number of different projects due to the charity working across a number of industries. It's a great place to learn new skills too, due to the varied technical project work delivered to clients.\r\n\r\nThe charity's overall mission is very clear: to bring as many people, businesses, cities etc as possible to adopt a one planet living mentality.", "cons": "Salaries could be better (it is a small charity though)"}]]