[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Volunteers", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Apr 2023", "job_title": "Volunteer in Johannesburg", "duration": "N/A", "pros": "Flexible working hours and good work -life balance", "cons": "Few or limited career growth"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Powerful learning, endless restructuring", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "10 Feb 2021", "job_title": "Anonymous Employee in Johannesburg", "duration": "N/A", "pros": "Incredible colleagues rooted in movement experience, strong theory of change, really devoted to bottom up change and the long run transformative work (for the most part, though some country offices could do better) great training and learning opportunities, only big organisation I've come across that at least tried to look at it's own power relations internally. Not sure where that is now. Wish this organisation very well because it is golden. I learned a tremendous amount and am grateful", "cons": "Endless restructures that wasted time and left organisation in near constant paralysis, 3-4 of international secretariat in time I was there. Brazilian ceo had amazing vision and powerful representative you would be proud of but completely incoherent in how he wielded power, ruthless in how he treated people. Not the feminist leader he asked us to be. Disappointed ultimately"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Awesome", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "17 Nov 2020", "job_title": "Sponsorship Coordinator in Johannesburg", "duration": "N/A", "pros": "Travelling Independent diversity Skillshare  growth opportunities", "cons": "Donor strategy  heavy reliance on 1 income stream"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "ActionAid International - Great mission hampered by rudderless leadership, insularity, and zero accountablity", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Nov 2017", "job_title": "Anonymous Employee in Johannesburg", "duration": "N/A", "pros": "- Mission driven with dedicated and skilled staff", "cons": "- AA International CEO has created a highly political & insular culture of favouritism, & nepotism which disempowers staff. ActionAid is a sinking ship and he is at the helm, clearly scrambling to jump off . He has driven it into the ground, and I would not be surprised if it folds within the next 5 years.\r\n- Awful HR & IT capacity\r\n- Corrosive internal politics - infighting between Directors & Country Directors, with lower level staff often caught in between\r\n- Focus on internal politics diverts attention from the mission and organisational effectiveness in achieving its work, and means that good staff are lost quickly  \r\n- Very cliquey, with no effective performance management nor accountability\r\n- Limited job security - numerous restructures due to various funding crises as leadership clearly don't know how to adjust to a changing funding landscape\r\n- Systems and approaches are from a different era - dysfunctional & dinosaur-like organisation"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Does not operationalise its values", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jul 2020", "job_title": "Program Officer in Cape Town", "duration": "N/A", "pros": "Some excellent, justice-based resources for social change are created by AA\r\nThere are some people working there who are actually dedicated to the empowerment of vulnerable communities", "cons": "AA is a highly political organisation in a negative way. Rather than working together as a federation, different country programmes vie for influence, funding, power and control and often times it is global north countries that dictate terms and conditions to global south countries. \r\nThe lack of clarity around projects and processes is also an ongoing issue and is so disappointing when that funding could go to local organisations on the ground who need it and are not 'professional activists' actually facing the issues outlined in such projects\r\nThere is little/no internal democracy either between global north/south country programmes and less so in the hierarchical organisational structure. This also means that manager's decisions, no matter how inefficient, unethical, sexist or short-sighted cannot be questioned or issues broached without the possibility that raising such will result in the whistleblower being let go or warned\r\nThe wages paid to support staff/service providers in global south country programmes is near poverty levels and often do not include such things as health insurance or school fees aid - disappointing an organization dedicated to poverty alleviation would not start with those who work in manual labour positions for the organisation\r\nCareer advancement is non-existent in AA and it appears that if you are actually good at your job that will be seen to challenge others and they will work actively to block you\r\nSexism and sexual harassment run rampant and complaints are *not* taken seriously if at all dealt with even when reported to International Auditors at AA\r\nGlobal north contracts for the same positions as the global south are much better in terms of time, pay, benefits etc. Local contracts do not include school fees help whilst international contracts do even where both colleagues are working in the same office meaning that educational inequality is actually policy in AA"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Management accountant", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Oct 2015", "job_title": " in Johannesburg", "duration": "N/A", "pros": "People orientated, good benefits, market related salaries", "cons": "Poor performance management of staff, culture was not deadline driven"}]]