[[{"date": "11 Jul 2022", "title": "Web Graphic Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbia Southern University", "Interview Descriptions": "I was contacted by HR for phone interview.  I had phone interview with dept manager and this was followed with an in-person interview. I was interviewed by three members of three department members.", "Interview Questions": "What is your strongest attribute"}, {"date": "23 Aug 2020", "title": "Evaluator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbia Southern University", "Interview Descriptions": "Phone interview, very professional. Will be followed up with another more formal interview within the next coming week or so. Overall was a good and positive experience. Very happy and looking forward to future interview", "Interview Questions": "How my skills can help prepare me for the position. What type of work environment I prefer. "}, {"date": "31 Jul 2019", "title": "Video Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia Southern University (Orange Beach, AL) in May 2019", "Interview Descriptions": "The questions asked were relevant to the position, and the overall mood was relaxed. I was given clear expectations of what the job entailed, and any questions I had were satisfied.", "Interview Questions": "Can you work autonomously?"}, {"date": "29 Oct 2019", "title": "Lead Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Columbia Southern University in Jan 2018", "Interview Descriptions": "Preliminary interview with HR. One hour group panel interview with over 10 questions and fairly complicated questions. Interview was more complicated than those with Fortune 50 hiring companies.  Drug test follows.", "Interview Questions": "What past experience will contribute to your effectiveness in this position; explain what situations you would have handled differently."}, {"date": "22 Sept 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia Southern University", "Interview Descriptions": "application, interview over the phone. It was a regular, normal process, nothing special to declare. Kind management staff,  interesting in looking for good adjunct faculty with student management experience", "Interview Questions": "education, experience, teaching philosophy,"}, {"date": "14 Sept 2017", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbia Southern University", "Interview Descriptions": "Brief phone interview that was unannounced or forewarned. Interview whispered questions and basically sped read a pre-written dialogue. The interview process was very straight forward and unapologetically frigid. I presume she meant well, but definitely needs some interview etiquette. About 2 minutes into her whispering, it was finally inferred that it was a phone interview.", "Interview Questions": "What is the most rewarding part of your career?"}, {"date": "15 Dec 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Columbia Southern University (Telephone, TX) in Jul 2017", "Interview Descriptions": "Sent in application with unofficial transcript, about one or two months later I was contacted for an interview, I sent in my official transcripts, waited one month, then began my onboarding class.", "Interview Questions": "Why do you want to work for us?"}, {"date": "12 Apr 2016", "title": "Academics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Columbia Southern University (Orange Beach, AL)", "Interview Descriptions": "Interview process was typical. Was in a room with 2 or 3 people 1 asked questions, while another took notes. They do ask if you are offended by prayer due to Christian affiliations, but I'm not sure if they can legally ask it.", "Interview Questions": "Best/worst customer? Best/worst customer service received? Strengths/Weaknesses, Teamwork, etc."}, {"date": "14 Mar 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Columbia Southern University", "Interview Descriptions": "Phone interview lasted about 15-20 min. After the phone interview you have a panel interview with about 6 people. They ask standard interview questions, that lasted like 30-45 min. \nThey ask behavioral interview questions but nothing too hard.\nThey go over the position and ask if you have any questions. \nGot a call back 2-3 weeks later saying I got the job and that I had to do a background check . After you pass the background check and send in your transcripts they send you a offer letter.", "Interview Questions": "What would you do if you and another coworker didn't get along."}, {"date": "4 Nov 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Columbia Southern University", "Interview Descriptions": "Basic boring interview questions. They speak in a very condescending tone and do not actually attempt to know what kind of a person that they are about to hire. Very shallow and general questions.", "Interview Questions": "What is your greatest weakness?"}], [{"date": "8 Apr 2016", "title": "Admissions Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia Southern University (Orange Beach, AL) in Oct 2015", "Interview Descriptions": "Panel interview, very short.  Casual atmosphere for panel.  Asked numerous questions about how to deal with staffing issues and difficult situations. Used personal and work experiences to answer all questions.  Prior to interview submitted app online and then was given interview time 2 weeks later.", "Interview Questions": "How have you dealt with difficult staff issues?"}, {"date": "2 Apr 2016", "title": "Student Affairs Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Columbia Southern University in Jun 2015", "Interview Descriptions": "3 individuals in the room. One supervisor from the department one from another department and an employee from the department asking questions.They did not allow you to ask any questions.  They aske 2 questions and were done.", "Interview Questions": "How does this position align with your career goals."}, {"date": "9 Mar 2015", "title": "Corporate Outreach Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Columbia Southern University (Orange Beach, AL) in Dec 2014", "Interview Descriptions": "I applied for the position in November 2014. I was contacted in early December for an interview. The interview went very well (or so I thought). It was an interview with three individuals, including an HR recruiter, the Corporate Outreach supervisor, and a Corporate Outreach representative. The interview was about an hour long. I was told that the position would not start until January because of the upcoming holidays, and that I would hear back sometime then. I immediately sent out my thank you letters and a week after my interview I received an email saying the position had been closed. I contacted the HR recruiter that was present at my interview, since she advised me to contact her with any questions I may have. When I asked her if the position was permanently closed or they had decided to hire someone else, she simply responded, \"The position has been closed,\" with no detailed information. Fine. \r\n\r\nFirst week of February, I notice the position had opened up again. I was still very interested in the position so I went ahead and sent an email to the HR Recruiter, asking if I should resubmit an application or if my previous application would be considered. After two days of not hearing back, I decided on my own to resubmit my application. \r\n\r\nEarly March I was sent one of those generic emails thanking me for my application, but they were pursuing other candidates, etc. This really soured my entire experience with Columbia Southern. I had such a pleasant interview and genuinely liked everyone but it was so unprofessional for the HR Recruiter to not have the common courtesy to return my email. All she had to say was that I was not what they were looking for. I found it so ironic that I applied to a position where communication was key, and yet, there was a complete lack of communication when it came to my application. \r\n\r\nI hope others have a better experience than I did.", "Interview Questions": "Describe a time you experienced great service. \r\nDescribe a time you had to deal with a difficult person. \r\nWhat motivates you?\r\nWhat experience do you have with organizing the most efficient/cheapest travel arrangements?\r\nHow do you organize your tasks?"}, {"date": "17 May 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Columbia Southern University", "Interview Descriptions": "First interview with a Dean. Then over the phone interview with a panel of individuals.  A few questions were asked, did I know how to use Blackboard technology? Orientation was online, no compensation for the time spend learning about the university or learning policies and procedures and technology used.", "Interview Questions": "N/A"}, {"date": "6 Mar 2014", "title": "Academics Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Columbia Southern University", "Interview Descriptions": "Needs some work.", "Interview Questions": "None. They were all standard and not related to the position."}, {"date": "9 Dec 2013", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Columbia Southern University", "Interview Descriptions": "none", "Interview Questions": "N/A"}, {"date": "9 Jun 2015", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia Southern University in Jul 2013", "Interview Descriptions": "Good interview process with insightful questions. I heard back in a timely manner and was offered the position a few weeks later. The process was hassle free and was very well done.", "Interview Questions": "N/A"}, {"date": "4 Nov 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbia Southern University (Foley, AL) in May 2013", "Interview Descriptions": "They use a scripted list of questions tailored and carefully pre-approved by HR for the specific position.  Each interviewer gets asked the exact same questions.   Very little time for free-play. \r\n\r\nI had a phone screen with HR, then an in-person interview about a week later with three employees, then I had to come back a week later and give a presentation, then I had to come back a week after that to meet with a senior executive.  Received an offer a few days later.  The whole process took almost a month.", "Interview Questions": "Which is more important, quantity, quality, or speed?"}, {"date": "12 Mar 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Columbia Southern University (Orange Beach, AL) in Sept 2012", "Interview Descriptions": "interview was a joke, I should have known better then, these people don't know what they are doing, and they will ask you in the interview about your religious beliefs and you better be Christian and willing to pray", "Interview Questions": "my religion and do I pray"}, {"date": "5 Jan 2012", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Columbia Southern University (Orange Beach, AL) in Jan 2012", "Interview Descriptions": "Spoke with two people via the phone interview--the Department Chair and Academic Dean.  Very basic questions--do you have 18 hours in your discipline, why do you want to work here, etc.  Then I was given a brief overview of what is expected and provided an opportunity to ask questions.", "Interview Questions": "N/A"}], [{"date": "10 Jun 2014", "title": "Travel Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Columbia Southern University (Orange Beach, AL) in Jan 2010", "Interview Descriptions": "they don't know how to give a real interview? they asked questions that had nothing to do with the job itself. also i was there approx 3 hours for an interview that should have only taken 30 minutes.", "Interview Questions": "N/A"}]]