[[{"date": "N/A", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delta Dental Ins.", "Interview Descriptions": "Simple video interview with basic excel and software related questions. Nothing too technical was asked over video. Make sure to know about advanced excel and SQL concepts. Interview was short and easy.", "Interview Questions": "How would you rate yourself in Excel?"}, {"date": "14 Jun 2023", "title": "Grievance and Appeals Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delta Dental Ins. in Jun 2023", "Interview Descriptions": "I applied online, received an email from the recruiter to schedule a call, and passed on to hiring supervisors to schedule an interview. I will say be careful. I received an interviewer who completely changed her attitude mid-way and cut me off as I was explaining my work history.", "Interview Questions": "What is your previous experience relating to the role?"}, {"date": "31 May 2023", "title": "Account Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delta Dental Ins.", "Interview Descriptions": "HR Recruiter by phone and Then Hiring Manager by Video. You have to create a candidate profile on their website and you will be able to keep up with the process there", "Interview Questions": "Normal interview questions are very basic"}, {"date": "19 May 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delta Dental Ins. (Alpharetta, GA)", "Interview Descriptions": "Very easy just not a job for someone without a car MUST be on time. It is a very big deal also must be willing to learn a lot about teeth and take a test because your job depends on it", "Interview Questions": "Name some of your strengths/weaknesses"}, {"date": "26 May 2023", "title": "Consumer Care Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Delta Dental Ins. (Stevens Point, WI) in May 2023", "Interview Descriptions": "I applied online and after a few days was offered a phone interview. The recruiter told me about the position and asked about two questions. It lasted probably like 3 or 4 minutes, it was very odd. Myself asking questions to the recruiter took up more than the time he spent talking with me. The call lasted 10 minutes total and at the end told me I would have to complete a leadership assignment and Wonderlic test which I completed. It felt very unprofessional as a whole and put me off the company.", "Interview Questions": "Name a problem you recently had to overcome at work."}, {"date": "1 Feb 2023", "title": "Sales Account Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Delta Dental Ins.", "Interview Descriptions": "Received an email to meet with a team with dress code and other pertinent information to prepare for interview. Professional and welcoming. Interview team was in person and through Skype.", "Interview Questions": "Question regarding how I handled stress."}, {"date": "8 Jan 2023", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Delta Dental Ins.", "Interview Descriptions": "1st interview was with talent acquisition over the phone, 2nd interview was with the manager, and the last one was an interview with the director. It all happened within a month.", "Interview Questions": "About skills and scenario based."}, {"date": "4 Nov 2022", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delta Dental Ins.", "Interview Descriptions": "Great recruiter, folks asked questions that were thought out. The whole process happened in the span of a month, from start to finish. Overall, I enjoyed it and would recommend applying to the company.", "Interview Questions": "How would you deal with many people who wanted demands for features from you?"}, {"date": "28 Oct 2022", "title": "Grievance and Appeals Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Delta Dental Ins.", "Interview Descriptions": "Zoom interview with one to two people it was very laid back and they’re were actually socializing during the interview and not really focused on the interview questions which made it a little backward.", "Interview Questions": "Discuss a difficult situation you had to work through"}, {"date": "20 Oct 2022", "title": "Grievance and Appeals Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delta Dental Ins.", "Interview Descriptions": "The first step of the interview process was a telephone call where they asked basic questions regarding your office experience. The second part was a virtual panel interview with questions related specifically to the position.", "Interview Questions": "Are you familiar with CMS regulations?"}], [{"date": "6 Nov 2022", "title": "Benefits Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delta Dental Ins. (Seattle, WA) in Oct 2022", "Interview Descriptions": "Interview process was speedy than most. It could be a good or bad thing depending on your interview preparation time. My recruiters and interviewers were informative and friendly. However, having a test before your behavioral interview was a little bit intense. Also, the interviews were too close to one another so it felt a little rushed. I think if the behavioral interview came in first before the excel sheet test, it may have been a whole lot of a better candidate experience with less pressure on time.", "Interview Questions": "Q: Excel test about Vlookup before the actual interview (back to back)."}, {"date": "23 Sept 2022", "title": "Customer Service Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delta Dental Ins. (Atlanta, GA) in Sept 2022", "Interview Descriptions": "easy and quick. the recruiter was very welcoming and answered all questions. I look forward to hearing back hoping to receive an offer soon. It is a two-part interview so a zoom interview will follow after", "Interview Questions": "what is your customer experience?"}, {"date": "30 Aug 2022", "title": "Associate ITSM Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delta Dental Ins.", "Interview Descriptions": "2 rounds of interview, one over the phone (more like a screening) and one in-person or virtual interview depending on the position and where you are located. For my second interview I had 3 people, the Manager for that are, the previous manager and the Lead Analyst for that area", "Interview Questions": "What makes you the best candidate for this job?"}, {"date": "24 Aug 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Delta Dental Ins.", "Interview Descriptions": "HR was difficult to talk to and kept asking questions not relevant to the role. I felt extremely uncomfortable during the entire length of the call and felt like my answers were being brushed off.", "Interview Questions": "Why are you leaving your current job. "}, {"date": "22 Feb 2023", "title": "Art Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delta Dental Ins. in Aug 2022", "Interview Descriptions": "The interviewer didn't know much about the technical aspects of the position or how my background might relate to it. It made the process awkward. Not one of my favorites for sure.", "Interview Questions": "What do you know about our company?"}, {"date": "20 Jul 2022", "title": "Translation Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delta Dental Ins.", "Interview Descriptions": "Applied for the position online and received an email requesting my availability for a initial screening phone call. Scheduled it via email and received the call from Human Resources recruiter. At the end of the interview was informed it could take a few weeks to hear back from them.", "Interview Questions": "What translation softwares do you have experience with?"}, {"date": "4 Jul 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Delta Dental Ins. in Jul 2022", "Interview Descriptions": "The interview process was a smooth one. After submitting my application and resume, within a few days the recruiter reached out to me via email. We set up some time to connect for a brief interview and then within less than a week I met with the hiring director.", "Interview Questions": "Provide an example when you had to lead your team through a difficult change. "}, {"date": "15 Jun 2022", "title": "Sales Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Delta Dental Ins.", "Interview Descriptions": "There are two  managers at once conducting the interview. The questions are situational. Even if you have not been in the situation it is best to provide an answer on how you would handle it. It was done via zoom.", "Interview Questions": "What are some ways that you overcome sales objection?"}, {"date": "1 Jul 2022", "title": "Customer Advocate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delta Dental Ins. in May 2022", "Interview Descriptions": "First there was an online assessment. If selected you'll do a phone interview, followed by a virtual interview with a couple leaders on management. The virtual interview was great. It was conversational rather than an interrogation.", "Interview Questions": "Describe a time you went above and beyond. \nHow does your past experience equip you for this role?\nWhat made you apply ?\nWhy did you leave your last position?"}], [{"date": "3 Mar 2023", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delta Dental Ins. in Apr 2022", "Interview Descriptions": "Recruiter, hiring manager, team member, sales director conversations. Basic review of experiences, and standard interview questions. Professional, but reasonably friendly and conversational. Nothing particularly challenging about the process, but some team members had more company experience and vastly different perspective.", "Interview Questions": "Why would someone with many creative interests wish to work in insurance?"}, {"date": "2 Jun 2022", "title": "Actuarial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Delta Dental Ins. (Oakland, CA) in Apr 2022", "Interview Descriptions": "Call with a recruiter and they basically just read the job description and talked about my qualifications. They require coming into the office in person 3 days a week. I don’t want that commute so did not move forward in the process. This was for Oakland office.", "Interview Questions": "How many exams have you passed"}, {"date": "12 Mar 2022", "title": "Product Owner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Delta Dental Ins. (Seattle, WA) in Dec 2021", "Interview Descriptions": "The interview process for me was comprised of a phone screening and four interviews with five people.\r\n\r\n1) 15 min phone screen with recruiter\r\n2) 30 min interview with hiring manager/director\r\n3) 1 hr interview with two product owners\r\n4) 30 min interview with project manager\r\n5) 30 min interview with UI designer\r\n\r\nWould say the process was quite grueling but it was for a direct FTE position which essentially takes a little more time. \r\n\r\nI wasn't impressed with the company's organization and follow-up.  The recruiter had emailed me know twice on two different occassions that she would let me know of a status post-interviews, but that never happened.\r\n\r\nShe also informed me of a formal offer they had made me (after my first interview) and to expect that in my email.  Come to find out, it was a mixup with a person of the same name for a different role.", "Interview Questions": "Behavioral, process, and product management questions.  \r\n\r\nFirst interview was pretty standard and a little bit organic conversation.\r\n\r\nSecond interview was 45min of being grilled with standards interview questions on product management followed with 15min for me to ask questions.\r\n\r\n3rd interview was organic conversation, not exactly an interview (interviewer even said she didn't want to grill me).\r\n\r\n4th interview was similar to 1st and 2nd interviews. Was asked a series of behavior and process questions. Not a lot of conversation."}, {"date": "5 Jan 2022", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Delta Dental Ins. (Mechanicsburg, PA) in Dec 2021", "Interview Descriptions": "I was told about the position. The interview consisted of rambling about how people go for walks in the afternoon. It then came out how the interviewer wanted to talk to me about the sex site she's involved with, and not really interview me.", "Interview Questions": "Was the position explained to you."}, {"date": "14 Dec 2021", "title": "Sr Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Delta Dental Ins. in Nov 2021", "Interview Descriptions": "Applied online and HR reached out for a screening call. She talked about the role and what they were looking for. \r\n\r\nNext I had a one on one with the hiring manager who talked about the role and what they do. Asked about my background and hobbies outside of work.", "Interview Questions": "What insights and recommendation have you made and how did it contribute your current employer?\r\n\r\nHave you used data to analyze something outside of work?\r\n\r\nDo you have an experience with A/B testing? Any experience with experimentation?"}, {"date": "20 Apr 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at Delta Dental Ins. (Alpharetta, GA) in Oct 2021", "Interview Descriptions": "The review process was straight forward and brief. There are a lot of steps that go into the interview process and they make it exciting. Not just a boring virtual sit down.", "Interview Questions": "They asked me have I ever Been in a confrontational situation with a employee."}, {"date": "20 Sept 2021", "title": "IT Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delta Dental Ins.", "Interview Descriptions": "Very straightforward, the recruiter was very friendly and kept me up to date with next steps in the process. I had multiple interviews but that is to be expected for a mid-level position.", "Interview Questions": "Why I wanted to work for the company"}], [{"date": "20 Sept 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Delta Dental Ins.", "Interview Descriptions": "The interview consisted if basic questions and less about skills, but more about personality. The screening was a quick call that was less than 30 minutes. It was one of the least interesting screenings I have ever had before. I believe they had a candidate they are hiring and additional interviews were just a part of the HR process.", "Interview Questions": "What gets you out of bed in the morning?"}, {"date": "24 Oct 2021", "title": "Information Security Architect Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delta Dental Ins. in Sept 2021", "Interview Descriptions": "The conversations with Delta Dental were nice and all, but the InfoSec architect role is not on the InfoSec team (does not report to their CISO). Additionally, the hiring manager was focused on experience regarding Identity Management and privileged access management (PAM). These areas are an entire subset of InfoSec architecture, usually a separate team and focus. Good luck finding someone who has a broad & in depth architecture background of networks, systems AND identity/PAM. From my conversations, the role is not scoped nor in the right place in the organization to ensure success for the individual they hire.", "Interview Questions": "What is your experience with identity management? "}, {"date": "29 Jul 2021", "title": "Senior Scheduling Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delta Dental Ins. (Alpharetta, GA) in Jul 2021", "Interview Descriptions": "Interview with recruiter, interview with hiring manager, interview with director of the department. First was over the phone last two were zoom with video have your smile ready. Interview with HR was actually quite familiar with the role along with introduction to the company. Second interview was knowledge and resume overview last interview was expectations all around company culture and climate all allowed time for questions take notes and have questions ready.", "Interview Questions": "Tell me about yourself : Introduce Yourself  "}, {"date": "1 Mar 2022", "title": "Regulatory Compliance Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Delta Dental Ins. (Alpharetta, GA) in Mar 2021", "Interview Descriptions": "The interview process was lengthy, but overall not difficult. I had to go through 4 rounds of interviews- one on one and  team interviews. I was selected for the position, but I ultimately ended up accepting another role at a different company because it was a better opportunity for me at the time.", "Interview Questions": "Basic questions regarding prior employment and work experience. "}, {"date": "20 May 2021", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Delta Dental Ins. (San Francisco, CA) in Oct 2020", "Interview Descriptions": "Very thorough...which also means time consuming. Met with the recruiter, the team mates, Director, VP as well as participated in a writing exercise. Took over a month from first interview to receive an offer.", "Interview Questions": "Standard interview questions were asked "}, {"date": "25 Aug 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Delta Dental Ins. (San Francisco, CA) in Aug 2018", "Interview Descriptions": "The interview was friendly, straightforward, and overall a pleasant experience. The team members that I met with, of varying levels, all seemed to have a good energy about them and seemed excited to be building out the team.", "Interview Questions": "What are you hoping to gain or looking forward to from this role?"}]]