[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "LPN", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Mar 2017", "job_title": "Licensed Practical Nurse in Sharonville, OH", "duration": "N/A", "pros": "They care about their residents\r\nThey care about the staff\r\nThe do lots of activities with the residents\r\nIt's clean\r\nEverything they do is centered around the residents, not money. I love it here", "cons": "The pay could be a little better"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Selling dreams.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Mar 2019", "job_title": "Direct Support Professional in Cincinnati, OH", "duration": "N/A", "pros": "The residents and people who work the floor(dsps and some nurses).", "cons": "There is a lack of management interaction and support. This is a beautiful place to be until it hits the fan, which is daily. We are under staffed and under paid with a huge hint of unappreciated. The nurses break the rules as much as dsps but there is no accountability in their regard. There is a lack of leadership. The residents are taken advantage of whether they want to participate or not. There is a huge atmosphere change once night shift comes in at 6, which is for the worse. The residents suffering drastically, physically, mentally and emotionally."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Out dated", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jan 2019", "job_title": "Manager in Cincinnati, OH", "duration": "N/A", "pros": "Wonderful individuals living in the home.", "cons": "Nobody takes responsibility for anything. HR department is made up of 3 people, two of whom are terrible at what they do.  The Vice President is very unprofessional and partakes in toxic gossip, even goes so far as putting things on reviews that “she heard” through other employees.  You are responsible for training yourself and no help is offered outside of what you do for yourself. Terrible environment for go getters."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "We can and we MUST do better", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 May 2019", "job_title": "Direct Support Professional in Sharonville, OH", "duration": "N/A", "pros": "The residents are the best part of working here, and they never fail to put me in a good mood when I come in to work. They provide you with a truly humbling experience and I love them as if they were a part of my own family.\r\n\r\nThere are always ample hours if you like getting overtime, especially if you like working 2nd shift.\r\n\r\nMost of the coworkers are friendly and knowledgeable with a few bad apples in the mix (but no place is truly perfect).\r\n\r\nThe hours are fairly flexible if you're a student, single mom, etc.\r\n\r\nYou will never be called in and they have a very good work/life balance, which is one of the biggest reasons I have stayed with this company for so long.\r\n\r\nQuick PTO accrual, you have PTO you can use after you have worked here for 6 months", "cons": "Over the years I have been working here there has been a major disconnect between management and their employees. They only can be bothered to pop out of their offices when there are parties and ever still, they huddle together and make nervous glances at their employees. As an employee it makes me feel terrible that they only come and see us when they are obligated to and then conduct themselves as if they are terrified of all of us. \r\n\r\nWe have been exceptionally short staffed for the past year or so since the starting $11 an hour is quite frankly, not cutting the mustard for the very physical job that we do on a near daily basis.  When we have held meetings in regards to why we can't raise our pay, we are given the answer that it is simply not in the budget. All was very believable when we were first told this however, since these meetings they have increased the Human Resources team to having 6 people. Advancement has about 7 people, and they keep expanding office positions and can conveniently offer them more pay than what we make. To further add insult to injury, they have been bringing in temps and paying them $16 an hour, and yet they can't increase their loyal worker's pay?"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Awful Management", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jul 2020", "job_title": "Anonymous Employee in Cincinnati, OH", "duration": "N/A", "pros": "Residents are great to work with", "cons": "Hours, have to work on holidays, weekends, late nights.\r\nManagement is awful, unhelpful, and allow poor behavior and poor work ethic to fly."}], []]