[[{"date": "21 Jun 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Catholic Health", "Interview Descriptions": "It was pretty good. They first did an over-the-phone interview about what position you want and asked you to tell them about yourself. They also discussed the positions that are open as well as days or nights.", "Interview Questions": "Describe the time you dealt with a difficult patient and how did you resolve it"}, {"date": "29 May 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Health", "Interview Descriptions": "2 part interview -on the phone first with talent acquisition they tell you about the open positions Also ask you -tell me about a time you dealt with a difficult patient Then in person interview With nurse manger", "Interview Questions": "Tell me about yourself Ask questions"}, {"date": "21 May 2023", "title": "Outpatient Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Catholic Health (Long Island-Queens)", "Interview Descriptions": "Applied for an outpatient clinician position. I waited more than 3 months and did not hear anything. Needed to follow up with HR which finally prompted an interview. I completed the interview but never heard anything back. Many months have past since the interview without any sort of correspondence. I see continuous posts for this position. The interview process feels very drawn out and I did not feel I was valued as a potential candidate throughout.", "Interview Questions": "Why do you want to work in this setting?"}, {"date": "10 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Catholic Health (Melville, NY)", "Interview Descriptions": "You will first interview with a recruiter. If you at a candidate you will move on to the next step. The only downfall is it takes weeks to hear back.", "Interview Questions": "How would you deal with a difficult employee?"}, {"date": "30 Mar 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Catholic Health (West Islip, NY) in Mar 2023", "Interview Descriptions": "It was extremely straight forward. they told me after the phone interview where they had openings. Even though I thought I did bad they were extremely nice and took in account my nervousness", "Interview Questions": "Tell me about yourself? Why Catholic health over other hospitals? describe a time you had a disagreement with a colleague?"}, {"date": "22 Feb 2023", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Health", "Interview Descriptions": "Quick effective interview processing,they focus on good faith to become a health care worker.The orientation is amazing.The new hire processsing is simple and clearly.If you have no experience,here is a good place to get started.Everyone is patience and helpful.", "Interview Questions": "Why do you want to work here? What is your experience with this hospital in the past? Where is your strength come from? What do you think you are doing above and beyond ?"}, {"date": "23 May 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Health in Feb 2023", "Interview Descriptions": "The process was long. Went on 2-3 rounds and then was left high and dry. Sent many follow up emails and then was sent an automatic rejection letter. Never discussed salary", "Interview Questions": "Why do you want to leave your current employer?"}, {"date": "8 May 2023", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Catholic Health (Buffalo, NY) in Jan 2023", "Interview Descriptions": "I barely spoke. I was spoken at for an hour and a half. I got weird vibes from the dude. Seemed focus at talking about all the administrative duties than working with the populations.", "Interview Questions": "Not much. I came in at was talked at. They seemed desperate to hire. Probably due to a high turnover"}, {"date": "20 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Catholic Health (Nassau, NY) in Jan 2023", "Interview Descriptions": "Quick, efficient. RN phone screen call asked simple behavioral questions such as, “explain a time you had to escalate a situation.” After phone screen, I met w Nurse manager of unit for an in person interview.", "Interview Questions": "Tell me your strength and weaknesses."}, {"date": "15 Aug 2022", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Health", "Interview Descriptions": "Went very well quick process overall and had a phone screen first before the interview which went well too the hiring manager was very nice and informational overall I felt that the interview process went smoothly", "Interview Questions": "Tell me about yourself please? "}], [{"date": "30 Jun 2022", "title": "Nursing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Health", "Interview Descriptions": "Applied the beginning of the month on Catholic health's website, about 2 weeks later I get messaged by a recruiter where we scheduled for a phone interview where they ask for behavioral questions such as, when was a time you had to advocate for a patient, how did you deal with a conflict. If you pass the  phone screening questions they'll schedule you for an in-person interview with the hiring manager. \nI have to say the process felt very long - at least one month between applying, phone screen and in-person interview - that's even without getting hired and orientation.\nI was discouraged however, there were computer issues with the hiring managers online scheduling causing HR to schedule my interview on a day the hiring manager was off. So when I arrived for my in person interview, I ultimately did not get interviewed by the person I was supposed to be interviewed by. But after what I felt to be a great interview experience and I thought the interview went really well, I ultimately never heard a word back and was ghosted. I followed up twice, and nothing, no response or letter, nothing. Real disappointing. When I heard that the hiring manager wasn't working that day - I felt a sinking feeling in my gut that it'll hurt my chances. But hey, it could have been anything - that they hired someone else, found a better candidate, who knows. A tip is - The only sure sign you got the job is an offer, so whatever happens in the interview, the \"good signs\" are just subjective even if you felt it went really well - but this was just my experience. Otherwise, I felt it was a positive experience, I have nothing else bad to say. I really loved the people I spoke to, I'm sure it would have been a lovely place to work, but it just wasn't meant to be for me. \nMy advice would be to keep job hunting and putting out other applications even when you're in the process of interviews.", "Interview Questions": "Tell me about yourself.\nDescribe a time you had to advocate for a patient.\nDescribe a time you went above and beyond.\nwhy nursing?\nhow did you handle a conflict between you and a colleague, friend, professor, whoever/etc. \n"}, {"date": "1 Jul 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Catholic Health", "Interview Descriptions": "The nurse managers were excellent to interview with, they made me feel comfortable and explained the position in detail. Overall I had a great experience  interviewing here, and would gladly accept a job here if offered.", "Interview Questions": "what would you consider your strengths to be "}, {"date": "14 May 2022", "title": "Perioperarive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Health (Smithtown, NY) in Apr 2022", "Interview Descriptions": "It was a very pleasant experience. The interview lasted about half an hour and the interviewer was very sweet. She made the process seem very fluid, in terms of the way questions were asked.", "Interview Questions": "Q: What kind of experience do you have in healthcare?\r\nQ: How did you hear about us?\r\nQ: How did you handle a tough situation? Was it resolved? How? \r\nQ: How long do you plan on staying with the company?\r\nQ: What is your ultimate goal? "}, {"date": "2 Nov 2021", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "It was a Very slow process with little communication from HR. Seem distracted working from home. A bit unprofessional and hard to get any kind of response directly. My interview with one of the higher ups was ok and the other one seemed unprepared and unable to ask questions .", "Interview Questions": "They asked about my experience "}, {"date": "25 Jun 2021", "title": "Biomedical Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Catholic Health in May 2021", "Interview Descriptions": "It was a quick over the phone interview for 20 minutes, then an in person interview was scheduled. The interview dates weren't too far apart and not much lag time", "Interview Questions": "Patient care, priority of patients, how to handle critique"}, {"date": "6 Jan 2021", "title": "ER Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY) in Dec 2020", "Interview Descriptions": "Due to Covid they took my temp first..I arrived a few mins early...It went smooth..basic questions what made you choose st.Francis ...felt like family! Conversation went smooth. I hope I got the job", "Interview Questions": "Basic..tell me about yourself...why do you want to work here? "}, {"date": "8 Oct 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "One call from  APP lead. One interview from supervising MD, coworker, and APP lead. One call from HR.  There might be another interview. It took about one week to get the second interview. The HR interview was about one week after the panel interview. HR interview is parallel to the panel interview.", "Interview Questions": "What is your strength? From the APP lead. "}, {"date": "24 Sept 2020", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Health", "Interview Descriptions": "Initial interview with recruiter over the phone which lasted about 20 minutes. I was informed that my information would be passed along and someone would reach out should any positions become available.", "Interview Questions": "What are your short term and long term goals?"}, {"date": "8 Sept 2020", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "Phone interview was much more faced paced than in person interview. Ended up declining the job since I applied for a part time position and orientation was full time for 4 weeks", "Interview Questions": "What are your greatest strengths?"}, {"date": "11 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY) in Jul 2020", "Interview Descriptions": "First interview was over the phone with a nurse recruiter followed by an in person interview with the unit manager and nurse educator. They asked about priority, delegation, medications, arrhythmias and pre/post surgery questions.", "Interview Questions": "What are you strengths and weaknesses?"}], [{"date": "12 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (New York, NY) in Jul 2020", "Interview Descriptions": "First interview with nurse recruiter: basic questions tell me about yourself, what do you know about SFH. Next interview with nurse manager and CNS: went well: more detailed questions, scenario-based questions\r\nWas told I would be called within 1 -1.5 week. Heard back with an offer within a week.", "Interview Questions": "What do you know about SFH?"}, {"date": "17 Jul 2020", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health in Jul 2020", "Interview Descriptions": "Applied online, got a call to schedule a phone interview then answered questions and then got an in person interview at the main hospital. The application was fairly easy to fill out", "Interview Questions": "What do you know about st francis "}, {"date": "1 Jul 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Health (New York, NY) in Jun 2020", "Interview Descriptions": "The process was smooth. Applied online and received a phone call from recruitment to set up a phone interview with the nursing recruiter. It was about 10 minutes long with fairly basic questions: strengths&weaknesses; time you went above and beyond for a patient; time you had a difficult patient", "Interview Questions": "Talk about a time you had to time manage"}, {"date": "2 Jul 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Health (Roslyn, NY) in May 2020", "Interview Descriptions": "Applied online, first did a phone interview with nurse recruiter. Was asked personality questions related to who I am as a person. More or less a screening of what I sound like, who I am. Told I would get a call for a second interview or a letter in the mail that I was declined. Second interview was over the phone with the nurse manager and unit manager. More challenging questions specific to patient situations as well as how I'd work in a team. I would brush up on your cardiac education before this interview. Process took a month and received an offer 2 weeks after my second interview. Overall good experience and both nurse manager and unit manager had great things to say about working there.", "Interview Questions": "Why did you become a nurse?"}, {"date": "19 Jul 2020", "title": "Medical Coordination Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Aquebogue, NY) in Apr 2020", "Interview Descriptions": "The interviews took place both times on the phone, due to pandemic with two separate interviews. First by HR then with house manager. They seemed rather detailed and thorough..", "Interview Questions": "What was my experience with sensitive medical info?"}, {"date": "12 Mar 2020", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "First had an interview with the nurse recruiter then with the nurse manager for a floor for their telemetry residency. The interview with the recruiter was very straightforward. The one with the nurse manager is harder with behavioral/priority questions.", "Interview Questions": "Strengths/Weaknesses?"}, {"date": "8 May 2020", "title": "New Grad Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Health in Mar 2020", "Interview Descriptions": "I applied online for a few positions. They called me to set up a phone interview a week later.  It was a phone interview with the recruiter.  After the phone interview, they mentioned they will call me if I am selected and will send an email if declined. \r\n\r\nThe lady was very monotone and asked questions while I answered, it seemed like she was writing everything down.", "Interview Questions": "Why St Francis?\r\n\r\nWhat are some of the difficulties you had?"}, {"date": "9 Mar 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Health in Feb 2020", "Interview Descriptions": "Spent 45 minutes trying to find a parking spot and barely made it in time for my scheduled time. Then I waited 20 minutes while my interviewer went off somewhere else. Went in and was told halfway through the interview that because I'm a new grad, I do not qualify for the unit I applied for and am interviewing for telemetry instead. Which is something I didn't mind, but would have liked to know when they asked me to come in for an interview the day before. The nurse recruiter just rattled off questions and I answered. The whole thing took less than 10 minutes. Was told I would receive a letter or a call if I get the position, which I felt was a way of them saying that they're not interested in me (since you would get an interview with the nurse manager and someone from the unit if they were serious about hiring you). I'm not sure why they called me in at all for the interview. Felt like a waste of time.", "Interview Questions": "Why do you want to work for St. Francis?"}, {"date": "18 Mar 2020", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Health (Manhasset, NY) in Feb 2020", "Interview Descriptions": "2 interviews, the first one is with the HR, 2nd with nurse manager.  got an offer 3 weeks after the 2nd interview.   Then you are required to do a drug screening test within 48hours.", "Interview Questions": "where do you see yourself in five years?"}, {"date": "9 Jun 2020", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Health (Roslyn, NY) in Jan 2020", "Interview Descriptions": "the people who interview me were very nice, i felt very comfortable. the process was easy phone interview followed by in person interview with a manager and the nurse educator on the floor. the interview went well, they did ask a lot of clinical question, some of the question i wasn't prepare for.", "Interview Questions": "tell why you chose nursing ?"}], [{"date": "3 Feb 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Catholic Health (Roslyn, NY) in Dec 2019", "Interview Descriptions": "I met with the nurse recruiter and she had a piece of paper with a bunch of questions on it. She wrote down word for word what I said and was going to send it to the nurse manager. Average and basic interview questions.", "Interview Questions": "What are you weaknesses/strengths?"}, {"date": "11 Dec 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Roslyn, NY) in Dec 2019", "Interview Descriptions": "The process take about 2 weeks. There is an interview with a recruiter and with the nurse manager. They complete a work history and background check. You submit your transcript and diploma and CPR card.", "Interview Questions": "Tell me about what you know about the hospital."}, {"date": "15 Nov 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Health", "Interview Descriptions": "First interview with HR was a breeze- very basic questions that are all behavioral. Second interview was ridiculous. They were 45 minutes late calling me in, and i interviewed with 3 people who were not originally supposed to interview me and who had not looked at my information at all. They asked me questions about specific drugs and what I would \"predict\" a doctor would order. It was inappropriate for a new graduate interview. Told me I would hear back in a week, and it took a month to get a letter of rejection in the mail, which I truly did not find necessary.", "Interview Questions": "What do you predict a doctor would order for a patient who was in afib?"}, {"date": "7 Aug 2020", "title": "PCA Caregiver Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Health (Roslyn, NY) in Nov 2019", "Interview Descriptions": "applied online, received a phone call a few days later regarding a position. The interview took place at the hospital. Went into a room and discussed briefly about myself and why I was interested in working for the hospital.", "Interview Questions": "Q: Describe a time you went about and beyond for a patient. "}, {"date": "26 Jan 2020", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Catholic Health (Melville, NY) in Nov 2019", "Interview Descriptions": "I met with the manager who was very friendly. They asked me to talk about the things on my resume and my job history and they had told me a bit about the company and what they have to offer. It felt like more of a conversation than an interview which I enjoyed.", "Interview Questions": "Walk me through your resume."}, {"date": "20 Oct 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY)", "Interview Descriptions": "Applied online, got a call a few days later to interview. It was a general interview so not for any specific position. First interview with HR, second with nurse a manager.", "Interview Questions": "Why St. Francis? "}, {"date": "3 Oct 2019", "title": "Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Health (Roslyn, NY)", "Interview Descriptions": "Applied online & got called two days after and had an interview the following week. Same dsy she sent over a reference sheet to fill out so they can contact them by email and your references fill it out. I got to the nursing dept they made me fill out a background check paper and overtime paper. I met with a lady in the nursing dept she showed on emotion at all until the ending she started to smile here and there. She went kind if fast and asked only about five questions. She  didn’t have the shift i wanted but said she could find something. I think i did good but im not sure she said u find out in a wk for another interview or get a letter saying you didn’t", "Interview Questions": "What do you know about st francis? Why do u wanna work here? Strengths & weaknesses? Tell abt yourself . Still waiting for offer"}, {"date": "1 Oct 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "first interview with the recruiter was odd, she really didn't show much emotion but I ended up getting the second interview. The second one was with the nurse manager and it was lovely. Interview went well.", "Interview Questions": "Describe a situation where you disagreed with a supervisor or professor on something and how you handled it "}, {"date": "13 Dec 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health in Oct 2019", "Interview Descriptions": "Quick reviewed email , booked interview, went to interview , was given a job. Overral was a decent process everything was explained and written in an email . Directions were very helpful", "Interview Questions": "Asked if I had BLS certification "}, {"date": "4 Nov 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (New York, NY) in Oct 2019", "Interview Descriptions": "The interview process took about 2 and 1/2 weeks. I had 2 interviews, one with the nurse recruiter and then a week later with a nursing manager and 2 staff nurses.", "Interview Questions": "Priority questions regarding chest pain patient"}], [{"date": "19 Nov 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (New York, NY) in Oct 2019", "Interview Descriptions": "Met with nurse recruiter in October and then with a nurse manager and two nurses about 2 days later. Received an offer 1 week later. Process was very fast and moved smoothly.", "Interview Questions": "What makes a team?"}, {"date": "19 Nov 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Catholic Health (New York, NY) in Oct 2019", "Interview Descriptions": "Got called in for an interview a couple months after applying. Met with the nursing recruiter who was not too friendly and was busy writing ie, transcribing my answers to questions. So it didn’t feel like an interview (conversation), more like a test.", "Interview Questions": "What would your preceptor say about you?"}, {"date": "9 Apr 2021", "title": "St Francis Hospital RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Long Island City, NY) in Sept 2019", "Interview Descriptions": "Met with recruiter who asked scripted questions and took notes on my answers. Lack of conversation, felt more like a test. Numerous situational questions. Questions were expected. Did not get the second interview with the nursing manager.", "Interview Questions": "Tell me about a challenge and how you overcame it."}, {"date": "18 Jul 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY) in Jun 2019", "Interview Descriptions": "I was first contacted via email by a member of HR to do a phone screening. The HR representative was late calling me for the interview  and I was asked a few behavioral questions.\r\n\r\nWhen I went to the in person interview, I was interviewed by one doctor and another member sat in on the interview. The position was explained to me and what I would do on a daily basis. I wasn't asked much questions due to the interviewer often going off topic.\r\n\r\nOverall I felt the interview was simple, they said they had to talk to HR and they would give me a call that I had gotten the position. Though I never got a call back, it was a simple interview and I felt comfortable talking to the interviewer.", "Interview Questions": "What do you know about St. Francis?\r\nDid you graduate?\r\nHow did you find out about this opportunity?"}, {"date": "8 Jun 2020", "title": "Patient Care Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health in May 2019", "Interview Descriptions": "I had one 1:1 in person interview, and it took me less than 2 weeks to get offered an interview after I submitted the application. I received notice that I did not get the position through mail a few weeks later.", "Interview Questions": "Describe a time you went above and beyond. \r\n"}, {"date": "25 Jul 2019", "title": "Patient Care Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Catholic Health in Apr 2019", "Interview Descriptions": "Applied online and it took three full months for them to contact me for an interview.  Interview with HR was both pointless and impersonal.  Then you interview with the nurse manager of the floor they're putting you on (note: this may not be the floor you applied to).  After that, you wait for you offer.  Gave multiple people less than a week's notice for the month-long training to start.", "Interview Questions": "What do you know about our hospital?"}, {"date": "25 Apr 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY) in Apr 2019", "Interview Descriptions": "Replied a day after my application to set an interview date and input reference information on a specific web page. Waited at the patient care office, the front desk didn't call the nurse manager until it was 5 minutes after interview time. Interviewed with the nurse manager, staff nurse, and the nurse educator.  Was told to get a reply in a week, been over 2 weeks still didn't get anything. Called recruiter and said it takes up to a month and should receive in the mail.", "Interview Questions": "What would your care plan look like with a CHF patient? "}, {"date": "28 Mar 2019", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "Phone Screen and in person with director. The director seemed to have very limited knowledge of what the role is and whats going on in the company. Took 3 months to get a decision.", "Interview Questions": "tell me about yourself, why should i hire you"}, {"date": "18 Mar 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "Applied on their website, got a phone call from Nurse Recruiter, went in for interview. Interview experience was terrible. Looked like there was one recruiter for the entire hospital, and she was very rude. She didn't seem interested in interviewing me at all. Not sure why I was even called in for the interview. It felt more like a Q&A session where she would ask questions and just jot down my answers, rather than trying to get to know me. Was told that I would get a phone call from her if I was selected, and if not, I would get a letter in the mail. Took her a month to send out the rejection letter, which was long after I had already moved on to another hospital.", "Interview Questions": "What do you know about St. Francis Hospital?\r\nTell me about a patient care story where you went above and beyond.\r\nWhat would your coworkers say about you?"}, {"date": "9 Mar 2019", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY)", "Interview Descriptions": "The worst experience ever. Welcoming part was the worst and the person in the nursing recruiter Dept who was interviewing me was rude, unpleasant, and from the start had an attitude. Seem like she was not in the mood or she hates her job. I can understand if you have a bad day but try to be more professional or be fake for the moment you are interviewing the person even if you think they are not fit for the position. If working with that type of people I will rather avoid it.", "Interview Questions": "What do you know about St Francis? "}], [{"date": "11 Apr 2019", "title": "Payment Poster Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Melville, NY) in Mar 2019", "Interview Descriptions": "I applied online first and than I was called about a week later for a phone interview. The recruiter said she will get back to me to schedule an interview with the billing department manager. In a few days later she emailed me to schedule an interview. The interview in my opinion went well. Two weeks later after my interview I got an offer. The process from the beginning to the end took about a month an half.", "Interview Questions": "What would my boss say about me if they were to call my employer?"}, {"date": "27 Feb 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "Applied online and within a week got a phone call from the Nurse Recruiter. She scheduled my in person interview and gave me instructions on what to bring and where to go.\r\n\r\nThe day of the interview, I walked in about thirty minutes early, equipped with everything she mentioned I needed. I introduced myself and reached out for a handshake. This is when it went all down hill. \r\n\r\nShe took my hand but did not look at my face. She  handed me a form to fill out and told me to sit down in a chair facing the wall. She called me about twenty minutes after this and without any explanations or introductions she goes on to say \"I'll be asking you these questions, answer them the best you can.\" \r\n\r\nShe went on to ask the questions, without looking at me or engaging. She went as far as chuckle when I answered some of the question implying I may not have given the answer she wanted or needed. When I paused to allow some time for her to continue writing down my answers, she would make hand motions suggesting I should keep going. In the middle of the interview, she received a phone call. She took it and had me sitting there listening to her personal conversation. Towards the end, she stated that orientation was to begin the following monday. In my confusion, I asked about the follow up of this interview and whether there was another orientation scheduled following that monday. She simply stated she didnt know.  When she allowed for me to ask some questions, I asked about tuition reimbursement and health benefits. She simply answered, \" That's something we discuss when you're actually hired.\"  \r\n\r\nSimply put, she was flat out rude and obviously not a good representative of what this facility state they're all about. In all honesty, it almost seems like she was racist. She barely smiled nor enganged in any sort of conversation. It seemed as though this interview was made just to make a quota of interviewing non white applicants. \r\n\r\nHighly disappointing considering the facilities reputation.", "Interview Questions": "Give a time when you went above and beyond "}, {"date": "9 Jan 2020", "title": "Human Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Catholic Health (Suffern, NY) in Feb 2019", "Interview Descriptions": "very nice people i liked that they were friendly and not intimidating.  they asked the general interview questions and talked about the job quite a bit as well as discussed their philosophy on human services", "Interview Questions": "why did i want to work there"}, {"date": "11 Feb 2019", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Catholic Health in Nov 2018", "Interview Descriptions": "I applied online, had an interview set up with HR and then an interview about a week later with a nurse manager, PCA and another member of their team.", "Interview Questions": "Very cardiac focused. It is their specialty so they want to know how well versed you are in it. then your basic questions, strengths, weaknesses, etc. "}, {"date": "27 Oct 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "First interview was with the nurse recruiter and then the second interview was with the nurse manager, CNS, and a RN on the unit I was being interviewed for. The overall process was quick so far and very organized and I am currently waiting for a call back to see if I have been selected", "Interview Questions": "Tell us about yourself? What would your current employer say about you? What would you do if you had two patients that needed you at the same time? Why do you want to work at St. Francis?"}, {"date": "3 Sept 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Health (Roslyn, NY) in Aug 2018", "Interview Descriptions": "I applied online and got called in for an interview  the next day.  The interview was relatively easy. I wasn't well prepared  hence I was all over the place with my answers. The interview lasted half hour.  I first met with a Nurse Recruiter then the NM.", "Interview Questions": "I was asked:   What do you know about our hospital and why you want to work here? What are your strengths and weaknesses?  Where do you see yourself in 5 yrs? Tell me about your clinical rotations.  Time management and tell me about a time when you were part of a group and had a difficult team mate."}, {"date": "26 Aug 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Roslyn, NY) in Aug 2018", "Interview Descriptions": "Applied online and got a call from HR 4 days after. First interview was with HR ( strengths/weakness? time you went above and beyond for patient? tell me about your last clinical. Describe a time you had to time manage. Describe a time you had a difficult patient. 5 year goal? what would your last employer say about you? What do you know about st. francis hospital?). At the end of the interview, she scheduled me for an interview with the nurse manager. The 2nd interview was with the nurse manager and nurse educator. I was offered the position the following week for telemetry residency. The whole process took 2 weeks.", "Interview Questions": "strengths/weakness, ideal nursing position?, what do you know about st. francis hospital? time you went above and beyond for a patient? Experience delegating? Describe how you would care for a patient with CHF. Describe how you would care for a patient on heparin drip."}, {"date": "17 Jun 2018", "title": "Applications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Catholic Health", "Interview Descriptions": "This processes is ridiculous. They are asking way to much information and it takes so long to complete the application. Why do you need to know what elementary school I went to? Why do you need my drivers licence number and references when I have not even been called for an interview yet? How do I know my personal information is safe and what it is being used for? A month goes by and you hear nothing. Then you get a call like you applied yesterday. What a waste of time. How you treat candidates is a reflection of how you treat employees. I did not bother returning the call.", "Interview Questions": "What elementary school did you attend"}, {"date": "16 Jul 2018", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Health (Roslyn, NY) in Jun 2018", "Interview Descriptions": "Applied online got a call for first interview a week or so later. Then went for a second interview. First interview was very straight forward and was like a screening to see if you should get an interview with the nurse manager. Questions were read off of a sheet and written down when I was answering. Overall good experience they were really nice; was kind of surprised I did not get an offer. Also in second interview asked a priority question with a few patients.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "7 Mar 2018", "title": "Administrative Secretary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Catholic Health (Flower Hill, NY) in Mar 2018", "Interview Descriptions": "This is the 2nd horrible interview experience I've had with CHS. Most unprofessional company. They do not return phone calls (even though they call you and leave a message) or e-mails. The first interview process I had with them was back in 2015. They brought me in for 3 interviews all on different days. After the 3rd interview, they told me \"they were looking for someone with more HR experience.\" Why waste my time? My resume didn't change after the first or second interview. I decided to get CHS another chance but this time...HORRIBLE service. The HR employees I dealt with did not return my e-mails or phone calls. So I cancelled my interview. Don't waste your time!", "Interview Questions": "N/A"}], [{"date": "28 Feb 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health", "Interview Descriptions": "Met with the chairman, was open conversion regarding position and went over past rotations and clinical experience. It was a fine interview, heard back within few days. Credentialing process took a while. Overall not a bad interview.", "Interview Questions": "Why emergency Medicine?"}, {"date": "29 Sept 2019", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Health (Port Jefferson, NY) in Jan 2018", "Interview Descriptions": "Interview was great, met with the director and supervisor of the department. Very friendly and quick. I was offered the job on the spot and started working less than two weeks later after my background check and drug tests were completed.", "Interview Questions": "It was a very non formal interview and I felt so comfortable!"}, {"date": "16 Dec 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Roslyn, NY)", "Interview Descriptions": "Relatively simple interview. They contacted me within two weeks and asked to meet with me. I was asked basic interview questions by the recruiting manager. The recruiting manager was attentive and took notes throughout the whole interview. The only negative thing I have to say is that it is next to impossible to contact the recruiter after the interview. I left a voicemail and never heard back.", "Interview Questions": "What do you know about St. Francis? Why do you want to work here? Difficult experience? Time Management? Where do you see yourself in five years? Strengths? Weaknesses?"}, {"date": "7 Mar 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (West Islip, NY) in Dec 2017", "Interview Descriptions": "you meet with the HR nurse recruiter first for 20 mins or so then they bring you up to the floor to meet the manager. He asked me questions about the resume and was just asking why I wanted the position.", "Interview Questions": "Strengths and weaknesses"}, {"date": "5 Jan 2018", "title": "Registered Nurse, Critical Care Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Catholic Health (West Islip, NY) in Nov 2017", "Interview Descriptions": "I received a call about 2 weeks after applying online for a position, and set up an interview for the following week. A few days later I received another call to push the interview back because they misread the schedule and the recruiter wouldn't be there the originally scheduled day, which was frustrating but not the end of the world. The day of the interview I arrived a bit early, filled out all the paperwork, and had to wait almost an hour to meet with the recruiter finally. The interview went well once it started, no surprise questions, and she was very friendly and provided a wealth of information about the position, as well as benefits and salary without me having to even ask. Afterwards, she walked me to the unit which I was  applying to work on, introduced me to the unit manager, and he proceeded to do his own interview with me. The interview was very casual and easy going, and gave a good feel of how the unit would be. I had a great feeling leaving the interview, and the unit manager told me to expect to hear back within a few weeks, as they had several openings available on the unit. Based on his response to my experience and answers to questions, I left feeling rather certain I would get an offer. For the next several weeks I tried repeatedly to reach out to both the recruiter I had met with as well as the manager and received no response from anyone. I tried calling, leaving messages, sending emails, everything I could think of. Finally I gave up and accepted a position at another hospital with a higher salary and better benefits, which I applied for after my interview with Good Samaritan. About a week after starting at the other hospital they finally called me and offered me the position (about 6 weeks after my interview at this point) with orientation starting a week later. Even if I hadn't already accepted another job the time frame would have forced me to leave my previous job on short notice in order to attend their orientation, and I did not want to burn bridges as I was leaving my prior employer on good terms. Overall what I initially thought was a great opportunity that left me feeling hopeful only turned out to be incredibly frustrating and left me feeling annoyed at the utter lack of response.", "Interview Questions": "Tell me about a difficult patient and how you handled it "}, {"date": "20 Oct 2017", "title": "Fellowship Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Health (New York, NY) in Sept 2017", "Interview Descriptions": "Met with office manager then met with other coordinators. Received email for a follow up interview with director. I am currently waiting for my follow up interview with the director.", "Interview Questions": "Why. Are you interested in the position "}, {"date": "29 Nov 2018", "title": "PACU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Health (Roslyn, NY) in Aug 2017", "Interview Descriptions": "Easy, asked why I'd be a good fit. It was mostly just a conversation because i was technically an internal applicant  and I had critical care experience. The interview was done by laura, the best assistant manager there.", "Interview Questions": "What can you bring us?"}, {"date": "6 Jul 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health in Jun 2017", "Interview Descriptions": "The initial interview was great. The nurse recruiter actually sat down and got to know me. It was more like a conversation. The second interview was absolutely horrible. I met with the nurse manager. She interviewed me in her office in the middle of a busy unit with the door opened. Panel members kept going in and out of a tight little office. She never made eye contact with me (even at the start of the interview). She never let me finish my answers to questions she'd ask. She seemed like she was interviewing me for formality but had already hired someone. She never told me follow up steps.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Aug 2017", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY) in Jun 2017", "Interview Descriptions": "Applied to alot of residency and full time RN positions  then I was called after 2 weeks for an interview and was asked to submit references. I was able to meet their nursing recruiter.", "Interview Questions": "Describe to me about your clinicals. Why did you choose this hosp? Strengths, weaknesses. Tell me about a situation where you had difficulty making a decision, had exhibited time management, went above & beyond. "}, {"date": "1 Jun 2017", "title": "Clerical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Catholic Health (Smithtown, NY) in May 2017", "Interview Descriptions": "I found my interview to be very informative in how a hospital processes a candidate for a position.  I was welcomed with a highly skilled professional. I exited my interview feeling hopeful.", "Interview Questions": "What types of licensing do you have?"}], [{"date": "10 Aug 2017", "title": "CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Catholic Health (Roslyn, NY) in Feb 2017", "Interview Descriptions": "I applied at a job fair in Roslyn Ny. I was drilled. Excuse me, I was interviewed by 2 head of departments. A few months later a recruiter emailed me. I was asked to have 3 formal emails sent from on 3 referrals. This was followed up with a 2nd formal interview with said recruiter.\r\nI was supposed receive a response within a few weeks. Months went by. I followed up with a phone call. Months went by and finally received a generated letter saying they will keep my research me on file.\r\nI was very disappointed that so much time went by and didn't get the job.\r\nHoping for a call back someday!!!", "Interview Questions": "What is a quality you don't like about  yourself ? "}, {"date": "21 Apr 2021", "title": "Credentialing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Melville, NY) in Jan 2017", "Interview Descriptions": "I was scheduled for my interview by the Human Resources department and met with managers and the director of the department.  They were pleasant and helpful.  I got a good feeling about CHS from the interview.  There was a standard background check and drug screen process afterwords.  I heard back from them quickly.", "Interview Questions": "I was asked about my attention to detail skills and salary requirements. "}, {"date": "13 Dec 2016", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Health (New York, NY)", "Interview Descriptions": "Interviewed first with HR and then with the Unit manager. Was told that they would call me in a week to let me know if i had the job, but was offered the job on site.", "Interview Questions": "Prior job experience"}, {"date": "13 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health", "Interview Descriptions": "I applied online for an ER position but ended up interviewing for and being offered a MedSurg position (probably because I'm a new grad). About a week after I applied online I was called (on a Monday) and asked if I was also interested in MedSurg even though I applied for ER. I said yes, and was asked to interview with the recruiter on Wednesday. \r\n\r\nThe recruiter asked first what my GPA was and then how I heard about the hospital and why I wanted to work there. She also asked about my interests as far as specialties (critical care, ER, etc). Another question was about my future plans and my goals/where I see myself in 5 years. She also asked about a challenging decision I had to make and how I came to the ultimate decision. And of course after all of her questions she asked if I had any questions about the hospital, the position, etc.\r\n\r\nAt the end of that interview I was asked to come back the next day to interview with the nurse educator and nurse manager of the floor I would potentially be working for. I was told I needed to bring copies of my degree, transcript, CPR card and nursing license (I think that's it). Note that they have to be copies and not the originals because they take them from you for HR processing in case they end up hiring you. \r\n\r\nThe second interview went well, more behavioral questions and asking \"describe a time when...\" type of questions. Things like a time when you had to make a difficult decision and how you went about it, a time when you dealt with a particularly complex patient, a time when you had to exhibit time management, how do you handle conflict, how do you determine when to escalate a situation to a manager, etc. They also asked why I chose St. Francis and why I think it's a good fit for me/why I want to work there. A little later into the interview they asked about organizational skills. They mostly wanted to know what my organization style was (ie. do I prefer making to-do lists, etc). They also asked about my learning style (hands on, auditory learner, visual learner, etc). And at the end they asked me if I had questions for them. Both the educator and the nurse manager who interviewed me were very nice, easy to talk to and I was not intimidated at all. Of course I was a little nervous because I really wanted the job and interviews can be nerve racking, but the experience was really good and I walked out with a smile on my face.\r\n\r\nAbout a week after the second interview I got a phone call from the recruiter and was offered the job.\r\n Good luck to anyone who is interviewing!", "Interview Questions": "Describe a time when you had to make a particularly difficult decision and what your process was for making your ultimate choice."}, {"date": "8 Aug 2016", "title": "Patient Care Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health", "Interview Descriptions": "The nurse recruiter is friendly. There is definitely nothing to be afraid of. The interview questions that were asked were simple and easy to answer. You meet in a trailer that is on the campus of the hospital. Be aware that you have to pay for parking.", "Interview Questions": "Describe a time that was difficult for you and how you handled it"}, {"date": "15 Aug 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Health (Roslyn, NY) in Aug 2016", "Interview Descriptions": "First met with the very nice recruiter then scheduled an interview with a manager on a unit. I felt very welcomed and the questions were not challenging if you genuinely want to be a nurse. If not it may be more difficult.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Aug 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Roslyn, NY) in Jul 2016", "Interview Descriptions": "I  was called back in 4 days by HR... interviewed with the manager and the Educator, and then received a job offer the next day. There is a pharm exam that you have to pass on the 2nd try.", "Interview Questions": "describe your experience "}, {"date": "3 May 2016", "title": "RT Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Health", "Interview Descriptions": "Interview with HR and director of department; it was a two part interview. Took around two weeks to get called in for interview and another week for the actual interview to take place.", "Interview Questions": "Why do you want to work here?"}, {"date": "27 Feb 2017", "title": "RN Med/Surg Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Los Angeles, CA) in Feb 2016", "Interview Descriptions": "The process took about 2 weeks. Panel interview. They asked situational questions. The general process was relatively easy and the interviewers were very nice.  I really enjoyed interviewing for this opportunity.", "Interview Questions": "Describe a situation in which you had a communication error and how you fixed it?"}, {"date": "9 Jan 2016", "title": "Staff Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Catholic Health (Kansas City, MO) in Jan 2016", "Interview Descriptions": "It was a telephone interview. The Recruiter asked me several questions. I thought I answered them appropriately. The interview was about 10-15 minutes long, and the recruiter said she would get back with me.", "Interview Questions": "How to better the life of the patient?"}], [{"date": "9 Dec 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Catholic Health", "Interview Descriptions": "The interview process was amazing. It was to the point, concise, and educational too. The interviewer were friendly and welcoming. The interview process were smooth. The questions were appropriate and relevant to the work.", "Interview Questions": "Why did you like to wok for us?"}, {"date": "21 Aug 2015", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Catholic Health (Plainview, NY) in Aug 2015", "Interview Descriptions": "submitted both online and paper resume. Had not received a call so I went into HR. HR person kindly called director to see if she would be free to do an interview right then! She was so I sat down with director and head nurse. They gave excellent information about patient population, their concerns for patients and employees and the training process they provide. Both director and head nurse very friendly, took time from busy schedule to see me. Haven't heard anything but hope to be called back.", "Interview Questions": "Describe a time when you made a positive improvement with a situation?"}, {"date": "8 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Catholic Health (Roslyn, NY) in Jun 2015", "Interview Descriptions": "Interviewed two separate times. First with the nurse recruiter. Then a manager who ended up not being my manager going forward. Another RN was there for the interview process to answer questions and provide feedback for every day life.", "Interview Questions": "Do you want to go back to school or become certified in your field?"}, {"date": "5 Apr 2016", "title": "IT Client Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Catholic Health (Melville, NY) in May 2015", "Interview Descriptions": "I was interviewed by 5 individual from various departments. Simple, basic interview, why are you looking to move and etc. The entire process took about 1 hour or so. Upon leaving, I was told that HR will follow up for the next steps but I never heard anything back.", "Interview Questions": "Experience"}, {"date": "30 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Health (Roslyn, NY) in Feb 2015", "Interview Descriptions": "First met with Nursing HR. She was very monotone and didn't seem interested in life itself, but then I met with the Supervisor of the nursing floor. The interview was with her and a floor nurse. The floor nurse made the interview much more relaxed. Overall it was a positive experience.", "Interview Questions": "Why do you want to work for St. Francis Hospital?"}, {"date": "22 Feb 2019", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (West Islip, NY) in Jan 2015", "Interview Descriptions": "Applied online.  Interviewed with the Human Resources representative, 1:1,  then with the nurse manager, assistant nurse manager and nurses of specific unit that I applied for and toured the unit.", "Interview Questions": "Explain a challenging situation and how you handled it?"}, {"date": "15 Sept 2015", "title": "Comfort Care Provider Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Roslyn, NY) in Jul 2014", "Interview Descriptions": "I applied online and got a call for an interview within a week. The nurse recruiter interviewed me and asked basic character questions, She reviewed details of the job and scheduled for a second interview. The second interview, i met with the nurse manager and another aid on the unit. She asked several questions about what I would do if a situation would arise during my shift with patients and with staff. She also asked for examples in my past work experience.", "Interview Questions": "How do you stay organized?"}, {"date": "18 Apr 2014", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Catholic Health (Brockton, MA)", "Interview Descriptions": "Was referred to open positions here after completing a Nurse Assistant training course.  Called and immediately was offered 2-part interview with Head of HR and the Director in charge of nurses and patient care.  Very nice, informative and seems like it would be a ver good job.  Offer an extended orientation.", "Interview Questions": "Who was an example of a great leader in your CNA training..."}, {"date": "4 Aug 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (Nassau, NY) in Feb 2014", "Interview Descriptions": "Apply on line. Easy to see job availability across all of the CHS hospitals. Informative about hospital & system mission. Easy to talk to. Made to feel welcome & comfortable.", "Interview Questions": "Give an example of how you would handle a certain situation "}, {"date": "11 Mar 2018", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Health (Yonkers, NY) in Feb 2014", "Interview Descriptions": "it was good. the process was not that bad. i thank god for the job. it was a pleasure working here. i left because i wanted to go back to school. i am glad i was able to go back to school", "Interview Questions": "why should i hire you"}], [{"date": "7 Nov 2015", "title": "Registered Nurse, Telemetry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Catholic Health (Roslyn, NY) in Dec 2013", "Interview Descriptions": "This was only a 2 part interview, first with HR, then a few days later with one of the floor managers, presumably the floor you'll be working on.  My interview was not very stressful. My manager didn't even know what job I was applying for at first.", "Interview Questions": "Why did you become a nurse"}, {"date": "16 Dec 2013", "title": "Desktop Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Catholic Health (Melville, NY) in Nov 2013", "Interview Descriptions": "The company usually post the position for 3 to 6 months. You must apply from their website. Human resource department will contact you for interview and department supervisor will give you a call. The interview can be a phone interview, and there is a long waiting period. The wait period can be 6 weeks to 3 months. It depend on the company, they often post position while they have hiring freeze and they will open the position every few months. \r\nThe question that supervisor asked is not very technical, mostly base on customer services. They want to know how can you resolved issue while the doctors or medical staff are urgent to use the device.", "Interview Questions": "What should you say to the user when they are mad about the computer is not working? "}, {"date": "18 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Catholic Health (Roslyn, NY) in Sept 2013", "Interview Descriptions": "No interview with HR. Was told to arrive at the hospitals nursing office where the NM came and picked me up. Easy interview with NM and educator who was present for maybe one or two questions before being paged out of the room.", "Interview Questions": "Some questions they asked were nearly impossible to answer as a new grad, not yet having an opportunity to be faced with specific situations, but I spun my answer around to apply to a comparable situation that I did have experience with, and they were very understanding of the fact that as a new grad there are some things you can't answer yet as you simply have not experienced them."}, {"date": "15 Jun 2015", "title": "Software Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Catholic Health (West Islip, NY) in Feb 2013", "Interview Descriptions": "Interview was by a panel of people.  All nurses in various departments within the hospital.  It was somewhat intimidating being interviewed by that many people at once.  That being said, they were all very nice and courteous.  It was more of a conversation than a interview.  ALso had a separate meeting with human resources.  This was more of a quick screening.", "Interview Questions": "How can you make the process better?"}, {"date": "23 Jan 2013", "title": "Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Health", "Interview Descriptions": "Applied via career website. Called for interview. Simple typing exam to check for data entry skills and words per minute. Followed by typical HR interview. Nothing surprising or unexpected. Explain a few easy scenarios, when you made a mistake, what's your strongest characteristic, weakest, etc.", "Interview Questions": "Number 1 comment your parents received from going to parent teacher night. Caught off guard. More of a fun/interesting/different question. Probably no wrong answer."}, {"date": "10 Feb 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Health (West Islip, NY) in Mar 2012", "Interview Descriptions": "Submitted  entry level resume per my instructor advice. Received appointment  in a timely manner. Interviewed by director.  Having no experience other than a brief internship, interviewer seemed reluctant  to be reassuring. When allowed to explain my reasons for wanting to be a cna, interviewer warmed to me. I received verbal offer of employment  less than 2 weeks later.", "Interview Questions": "Why did I want to be a CNA"}, {"date": "27 Apr 2015", "title": "Operating Room Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Catholic Health (Port Jefferson, NY) in Aug 2011", "Interview Descriptions": "I initially made a call to speak with the OR Nurse Manager about the position. Met with OR Nurse Manager and spoke about my OR experience. Was shown the operating room, the recovery room and the ambulatory area. We spoke about the general flow of the work day and the type of cases, mostly orthopedic. Spoke about required call time. Met with HR for review of salary, benefits and paperwork.", "Interview Questions": "What kind of experience do you have?\r\nHow long have you been a nurse?\r\nWhere did you hear of the job?\r\nWhen can you start working?"}, {"date": "17 Sept 2015", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Catholic Health (West Islip, NY) in Jun 2011", "Interview Descriptions": "Quick and to the point. Very firm and concise. A bit intimidating but it's well worth it. Long process at first to get IN to the hospital, but afterwards transferring is very quick and easy. I moved all over the hospital. Every interview ended clearly whether i was getting the job or not.", "Interview Questions": "Why do you want to be part of our team?"}, {"date": "20 Feb 2014", "title": "Provider Credentialing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Catholic Health in Mar 2010", "Interview Descriptions": "The conversation went in circles.", "Interview Questions": "Who takes my kids to school."}]]