[[{"date": "10 Apr 2023", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Reid Health (Richmond, IN)", "Interview Descriptions": "Interview with department supervisor. Excellent, thorough interview. I felt comfortable throughout and was able to easily talk with the interviewer. Interviewer was welcoming and answered any questions I had as well.", "Interview Questions": "What diagnoses have I worked with."}, {"date": "6 Oct 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Reid Health (Surprise, AZ) in Oct 2022", "Interview Descriptions": "Interesting. It was all via telegram not once spoke to someone physically. Got asked about 8 questions via telegram. I got asked to do an interview based off my resume posted on a job board website and then they texted to see if I was interested and we conducted the interview after I downloaded the app.", "Interview Questions": "What are you career goals?"}, {"date": "21 Apr 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Reid Health (Richmond, IN) in Jun 2021", "Interview Descriptions": "Process was quick until I interviewed on the unit. The interviewer kept me waiting. She insulted me several times and ended up hiring a friend. This interview was also observed by another superior who let it happen.", "Interview Questions": "Why I am interested in working for them. "}, {"date": "21 May 2023", "title": "Customer Care Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Reid Health (Richmond, IN) in May 2021", "Interview Descriptions": "Three step interview process: takes about two months to finally get hired 1. Telephone interview 2. In-Person Interview 3. Peer interview/ Job Shadow Asked questions about employee experience and also questions regarding Reid’s mission and customer experience.", "Interview Questions": "Asked questions about employee experience and also questions regarding Reid’s mission and customer experience."}, {"date": "11 Oct 2020", "title": "Medical Laboratory Technician I (MLT) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Reid Health", "Interview Descriptions": "I had a brief phone interview, which has led to an in person interview. The interviewer was very kind and asked very basic questions involving one’s characteristics. Nothing specific to the job I was I applying for.", "Interview Questions": "They asked questions involving teamwork and quality care."}, {"date": "25 Jun 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Reid Health (Richmond, IN) in Jul 2020", "Interview Descriptions": "Two stage interview. First an interview with HR to discuss values and hours. Then an interview with lab managers to see if it is a good fit. Fairly straightforward process.", "Interview Questions": "Are you okay with working variable shifts?"}, {"date": "26 May 2022", "title": "Emergency Clerk Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Reid Health (Richmond, IN) in Feb 2020", "Interview Descriptions": "Multiple Stages, Interviews with HR, Staff leaders and ultimately a job shadow. All good people, easy to get along with; however, never gave clear indication on where you stood in the process.", "Interview Questions": "Why do you apply at Reid instead of another hospital network? "}, {"date": "3 Sept 2019", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Reid Health (Richmond, IN) in Aug 2019", "Interview Descriptions": "Did open interview and was scheduled for a second interview the next day. The second interview was short, the interviewer seemed rushed, went over schedule and pay. Then hurried me out. Haven’t heard back yet.", "Interview Questions": "If I had a problem working holidays. "}, {"date": "16 Jul 2021", "title": "Nursing Care Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Reid Health (Richmond, IN) in Aug 2018", "Interview Descriptions": "First you interview with Human Resources, then interview with the unit manager of the unit you applied to. The interview with HR was a more general interview, such as why would you want to work for the company and what are your career goals. The interview with the unit manager was more in detail in relations to patient care.", "Interview Questions": "How would you delegate patient care (manager gave a certain scenario)"}, {"date": "20 Aug 2019", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Reid Health (Richmond, IN) in Mar 2018", "Interview Descriptions": "Very long and drawn out process. Took nearly three weeks to hear from them initially, and about two weeks from interview to job offer from there. I asked that they not contact my previous employer when I filled out the application, and come to find out that is a requirement. I feel that puts the employee in a tough spot if they are not ultimately offered a position with Reid. Generic interview, felt like they were just going through the motions, nothing for job specifics.", "Interview Questions": "How do you handle emotions? "}], [{"date": "20 Jun 2019", "title": "CMA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Reid Health (Richmond, IN) in Feb 2018", "Interview Descriptions": "Lacked specific questions. More of a meet and greet. Based more on personality and not qualifications. Applied on line, waited a  week called in for interview, met for half hour another week to hear back.", "Interview Questions": "Not really traditional questions. More of a meet and greet."}, {"date": "20 Dec 2017", "title": "Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Reid Health (Richmond, IN) in Nov 2017", "Interview Descriptions": "First interview was great.Second interviewer acted like she was going through the motions and couldnt get me out fast enough.its painfully obvious that this person is only sending the apps and resumes through that fit her own agenda regardless of experience or references.Probably friends of friends or relatives.", "Interview Questions": "Many questions that had nothing whatsoever to do with the job applied for."}, {"date": "25 Aug 2021", "title": "PACU RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Reid Health (Richmond, IN) in Jul 2017", "Interview Descriptions": "Met with HR and nurse manager. I was asked several questions and they gave me a brief overview of what the job would look like. Mostly talked about being on call and assessment skills.", "Interview Questions": "Asked about assessing skills and staying overnight for call"}, {"date": "24 Apr 2016", "title": "Central Scheduling Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Reid Health (Richmond, IN)", "Interview Descriptions": "After filing out an application consisting over a hundred pages taking over an hour, the interview took less than 10 minutes and only asked the questions already answered very generic! They weren't concerned with my skills or experience or what I thought I could bring the job. It honestly felt as though they already had the slot filled and we're just going through the motions with the interviews!", "Interview Questions": "Name something you did that made you feel good about yourself!"}, {"date": "6 Oct 2015", "title": "TPC Advocate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Reid Health", "Interview Descriptions": "Meet with HR...Meet with director of department...Meet with others who you may possibly be working with. Very long and slow interview process. Went through all 3 interviews and checked my references but did not have the courtesy to call and let me know that I did not get the job.", "Interview Questions": "What can you bring to the table to benefit Reid Hospital and the community? "}, {"date": "10 Jan 2017", "title": "Central Scheduling Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Reid Health (Richmond, IN) in Aug 2015", "Interview Descriptions": "The hiring process was very time effective and everyone was helpful as I went into my new position. All of my questions were answered in a timely manner and I felt confident in my new position.", "Interview Questions": "Why should we hire you?"}, {"date": "2 May 2016", "title": "Environmental Services Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Reid Health (Richmond, IN) in Jul 2015", "Interview Descriptions": "My first interview was with the Supervisor, and the he scheduled for me to come back for a second interview. The second interview was with a team of two current employees that I would be working with. They asked me a series of questions, and gave their input of how well they thought, I would fit among others on the team. I was then scheduled for a third appointment with the executive director, who briefly went over my interview and told me that I would be contacted, should they desire to hire me. I was later contacted by the HR department, asking if I would accept the position and salary for the position. At that time, I was scheduled for drug testing, deadlines to submit paperwork, and orientation dates.", "Interview Questions": "Tell me about a time when you exceeded the expectations of a customer."}, {"date": "21 Dec 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Reid Health", "Interview Descriptions": "Emailed HR and the set me up with an internship", "Interview Questions": "N/A"}]]