[[{"date": "2 Mar 2023", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Maryland, Baltimore in Feb 2023", "Interview Descriptions": "The interview was process was very easy and fast I was literally hired in the spot . The only problem is paying for parking , the job description, and the older more veteran employees that work here. When I say run don’t walk .", "Interview Questions": "Is paying for parking a problem ?"}, {"date": "29 Jun 2022", "title": "PhD Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Had to interview with 3 professors, including a program director. mention my current project and why I wanted to join such program. obviously they asked for the weaknesses in application", "Interview Questions": "Explain current project and future directions"}, {"date": "28 Feb 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "It was a full day interview. It was well organized and thorough. Some of the interviewers were less welcoming than others and it could have been a bit more hospitable.", "Interview Questions": "The asked me to present my vision in a presentation format. "}, {"date": "11 Jun 2021", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Long interview process, as to be expected with state or university hiring. BUT the PATIENTS Program team was kind, understanding, and incredibly nice throughout the whole interview process. I received another offer and withdrew from consideration, but they were amazing! I hope to have the chance to work with them in the future.", "Interview Questions": "What research experience do you have?"}, {"date": "26 May 2022", "title": "Certified Nurse Midwife Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in May 2021", "Interview Descriptions": "I had to have ELEVEN interviews for this position, and then they ghosted me and never even told me whether I had gotten the position.  The process took many unpaid hours away from my current work, and I wasn't even given the courtesy of a response.", "Interview Questions": "Typical questions were asked of me"}, {"date": "13 Apr 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Zoom interview with manger, coordinators and PI’s. Director is very research oriented and will want to know the connection between your educational background and the research. \r\n\r\nBe prepared to go in depth about your research background, ability to handle high level stress situations, patient contact experience etc. All the key elements to be a successful coordinator.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "6 Mar 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Two part process, but second one was pointless. You must pay for parking. Allow enough time to park, walk blocks, go through security, and find location. Overall, OK experience. Too many interviewers.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "14 Dec 2020", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "The first interview is with Nurse Recruiter, she would inform you about the nurse residency program and focus on the departments you would like to follow, and then with the Nurse Manager.", "Interview Questions": "What would you do if you find yourself in a situation with a difficult patient?"}, {"date": "26 Oct 2020", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Great interview process. Virtual interval which was good because of the pandemic. Less risk for catching COVID. Anyone looking to interview with this company, I encourage you to do it.", "Interview Questions": "Tell me a situation where you went above and behind to help a customer "}, {"date": "8 May 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Very smooth. Applied on their website, got a call a week later. Interviewed with the nurse manager and was offered a position on the spot. Very straightforward and the questions were routine (tell me about yourself) type questions", "Interview Questions": "Tell me about a time you overcame a problem with a coworker"}], [{"date": "24 Jan 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Initial contact was a telephone screening with Human Resources representative, then met with Human Resources rep in person, then interviewed with Team. Good communication regarding expectations, process and new team member orientation.", "Interview Questions": "Standard interviewing questions. "}, {"date": "25 Mar 2020", "title": "Grants and Contracts Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Nov 2018", "Interview Descriptions": "There were two in-person interviews with two different groups of people. One group with the potential new boss and the one other person in the department and the other person I would be working with in the office and the other interview with 3 other higher level administrators.", "Interview Questions": "Did I know how to use Excel to do pivot tables."}, {"date": "6 Sept 2018", "title": "Buyer I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Baltimore, MD)", "Interview Descriptions": "Very long process. First, I received an email requesting an interview about a month after I applied. Then, after the interview, it took about three weeks for them to send me the request for a background check. After that, it took another week and then I received a call with a job and my salary.", "Interview Questions": "Describe your last position."}, {"date": "22 Mar 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland, Baltimore in Sept 2018", "Interview Descriptions": "Submitted resume and asked to interview a few weeks later.  They narrowed it down to eight people and each of us had individual interviews with two people. Was told I would receive a response in about a week, never heard from them.", "Interview Questions": "Can you handle working on multiple projects at once?"}, {"date": "8 May 2019", "title": "Clinical Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Sept 2018", "Interview Descriptions": "I was emailed by emailed by a manager end of August. I came in for one interview in September and was hired mid October. My start date was mid November.", "Interview Questions": "Strengths, weaknesses, why I wanted a career in clinical research. General interview questions"}, {"date": "9 Feb 2018", "title": "Senior Bio Statistician/Civil Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at University of Maryland, Baltimore (Baltimore, MD)", "Interview Descriptions": "Stone aged  have no idea of fore-experience .We have new tallents and they are not yet born what is.             Bb experience for. Why do you deserve my skills in your company..I was the one demostate my qualities..", "Interview Questions": "What they can learn from me"}, {"date": "26 Jan 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at University of Maryland, Baltimore (Rockville, MD) in Jan 2018", "Interview Descriptions": "Very brief. Just asked basic questions about my previous experience and my salary requirements. It was very casual and laid back. The interviewer was so nice and understanding when I was super nervous.", "Interview Questions": "What kind of previous experience do you have in this environment?"}, {"date": "29 Dec 2017", "title": "Academic Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "I was very excited for the interview. I interviewed with an Dean and one other person. It went very well but was rushed, I didn’t really get a chance to ask any questions. I was called back for a 2nd interview but the job was given to an internal candidate.  When positions are only posted for two weeks, it’s for an internal candidate. Don’t bother with applying.", "Interview Questions": "Tell me about yourself."}, {"date": "17 Oct 2017", "title": "Student Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "I applied to the school of nursing not once, but twice. My first experience went very well. To the point I had my letter of resignation ready. The hiring manager told me she would be in contact with me within 24 to 48 hours. I took her at her word since she immediately called me when I applied. After several follow-ups I never heard back from her. If it wasn't for my friend who worked there I may have never known that they hired someone. A few years passed and I thought, why not? Let's give it another try! There was a job opening that I was very excited about and I was immediately called back for an interview. The hiring manager was the same lady, and she said she recognized me. The panel they had doing the interview was a joke! These individuals read the interview questions for verbatim off of the paper. They didn't engage in any type of conversation or discussion. When I talked about their mission statement and the direction of the office and their ability to be student-focused they almost seemed offended that I even asked them a question. Then the hiring manager and I almost got into a little tiff because apparently we had very different views of Student Success. And the icing on top of this crazy interview cake was that I was told the salary range is well below what I requested and HR should have never even called me. That school is a damn joke! Don't work there.", "Interview Questions": "What do you do at your job now?"}, {"date": "15 Oct 2017", "title": "Grants Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "The position was ear marked for a specific person but required to follow UMB policy by posting position and completing a specified amount of interviews. In addition, the final say for hiring is by the COO not the specific department which you are applying. I completed this type of interview for the same position on three separate occassions", "Interview Questions": "N/A"}], [{"date": "8 Nov 2017", "title": "Population Health Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Laurel, MD) in Oct 2017", "Interview Descriptions": "Applied on Indeed, received an email advising me to contact staff to set up an interview.  Made several attempts finally got in touch with staff to schedule an interview. Interviewed with the manager and was told that she will invite top 3 candidates for a panel interview. Did not receive a call back to date.", "Interview Questions": "Behavioral questions."}, {"date": "6 Sept 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Baltimore, MD)", "Interview Descriptions": "Division of Translational Radiation Sciences (DTRS) will hire anyone, they are desperate for people cause everyone quits so fast. The easiest interview you will ever have in your life, they lie to you throughout the whole interview process", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Apr 2018", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Sept 2017", "Interview Descriptions": "I applied online; about 3 weeks later I received a phone call requesting an in person interview. There were two in person interviews, about two weeks in between them. After the second interview I was told I would hear back by the following week (there were only two candidates remaining in the process, me and one other candidate). I did not hear back and did not receive a reply when I followed up.", "Interview Questions": "Tell me about your research experience"}, {"date": "26 Jun 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Sept 2017", "Interview Descriptions": "Sending CV to the email provided on the job advertisement. After two weeks, I got a phone interview and further had a opportunity to go to the lab for on site interview.", "Interview Questions": "What's your future plan for your career development?"}, {"date": "4 May 2017", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "The HR department was friendly and organized. I interviewed with an HR employee and a manager. My job does require an proficiency assessment. The interview was comfortable and to the point.", "Interview Questions": "What do you find most frustrating about working in your current field?"}, {"date": "31 Oct 2017", "title": "Environmental Service Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Bel Air, MD) in Apr 2017", "Interview Descriptions": "it was extremely hard to get in touch with human resources when they call me for the interview. the man in charge was very absent minded and had to much on his plate. the director for evs and the human resources man were nice enough though.", "Interview Questions": "Tell us about your self? \r\nwhat is your end goal (what made you want to work in evs)? \r\nDo you have any special skills  for this  position ?\r\n"}, {"date": "7 Feb 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Jan 2017", "Interview Descriptions": "In- person 2 interviews with the Principal Investigator, Medical Doctor for approcimately one hour each.\r\nMust pass several examinations and earn Patient Confidentiality Certifications prior to being hired. \r\nReview of my resume and requested to provide 3 references from previous employers. I met all of these requirements successfully.", "Interview Questions": "What is your experience working in Public Health Education Programs and Services?"}, {"date": "11 Jun 2016", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "Very easy. interviewed by 3 managers. Long orientation afterward. The first interview was more about what the next two interviews were to be about. They got more detailed as they went on.", "Interview Questions": "Tell me about yourself."}, {"date": "28 Jun 2016", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in May 2016", "Interview Descriptions": "Interviewed with one person. She told me about the job.  Was called back for a second interview with the CFO.  I was told Human Resources was slow on hiring.", "Interview Questions": "What type of software do you use."}, {"date": "20 Apr 2017", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Mar 2016", "Interview Descriptions": "1 in person interview in designated department. Very informal. I was asked questions based on experience I listed on my resume. No panel.  consider the interview to be very easy.", "Interview Questions": "General experience questions that were related to job desciption"}], [{"date": "3 Feb 2016", "title": "Housekeeping Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Baltimore, MD)", "Interview Descriptions": "I had two interveiws. One when I came in for the job. And I had another one with the supervisor,s at umb. A couple weeks later they called me for the job.", "Interview Questions": "What would I do if I was asked by a customer to do something out of my area."}, {"date": "2 Jan 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland, Baltimore (Cheverly, MD)", "Interview Descriptions": "I applied online and was contacted to schedule a phone interview a month later. Passed the phone screen and was then scheduled for a face to face about a month after that. Interviewed with many people (about 13) because of the nature of the position. Received an offer about 3 weeks later.", "Interview Questions": "How do you manage conflict?"}, {"date": "13 Sept 2017", "title": "Distribution Clerk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Bel Air, MD) in Nov 2015", "Interview Descriptions": "The interview took place at Upper Chesapeake's Human Resources department.  In the interview  were the supervisor and the director of the department.  They both gave valuable insight into what the job conditions were like.  They also offered to give me a day to shadow before I decided if I liked the job or not.", "Interview Questions": "They asked me \" How do you handle making sure products don't expire on the shelf\""}, {"date": "28 Oct 2015", "title": "Counselor Part Time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "The process took about two weeks to get an Interview. The interview itself was pretty straight forward. I met with one manager and it felt more like a conversation. But it was productive. I felt comfortable asking questions about the company and the interviewer was experienced and knowledgeable.", "Interview Questions": "Tell me about some of your specific experiences since being in the mental health field?"}, {"date": "8 Oct 2015", "title": "Fitness Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Maryland, Baltimore (Baltimore, MD)", "Interview Descriptions": "You first can informally speak with the supervisor of the section of the facility in which you want to work.  This is not required, but the application/interview process is relatively informal, so this can actually be very beneficial and speed things along.  The application is then online, but you want to follow-up with the supervisor once it is submitted.  After that, you will be called in for a relatively brief interview and a decision will be made (often on the spot)", "Interview Questions": "Why do you want to work at URecFit?"}, {"date": "9 Oct 2015", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland, Baltimore in Sept 2015", "Interview Descriptions": "I applied online on a Thursday and was contacted the following Monday via email to schedule my assessments. The email stated that if I passed the assessments I would have the opportunity to interview with an Hr employee afterward. I did well on the tests and met with an Hr person for an interview. She asked situational questions and questions about my resume. That lasted about 3 hours. A week later I was contacted by the department to schedule and in person interview. I had the interview with the director and assistant director that lasted 30 minutes. It went well, but they seemed concerned about me not having exactly the direct experience they were looking for (she didn't say it but i could tell). They were very kind. I was emailed within the week letting me know they picked someone else. Great communication!", "Interview Questions": "What do you know about this program?"}, {"date": "8 Aug 2015", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Jul 2015", "Interview Descriptions": "I am writing this from the position of an internal candidate who has been interviewed and who has interviewed people for jobs at the University. \r\n\r\nAfter matching candidates are screened by the HR department, a hiring committee determines the people they want to interview by phone. After phone interviews, the hiring committee decides which candidates to invite for an in-person interview. The in-person interview often includes a number of meetings with faculty and staff in the team/department. Once the hiring manager has made a decision, he/she works with the HR department to do a background check on the person and to make a formal offer. The whole process can take months.", "Interview Questions": "Nothing in particular comes to my mind right now."}, {"date": "21 Jan 2016", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in May 2015", "Interview Descriptions": "I interviewed with course director, and I was asked several questions. It was more towards my previous experience, and how I can contribute to this new role. Then, I was asked about my previous job and why I wanted to leave. I was also asked about my availability and how flexible I was with my schedule.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Feb 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore", "Interview Descriptions": "It was a very positive experience overall. Interviewer was very polite, friendly, and helpful. Interviewer asked most of the common job interview questions, like why did you apply for this position; tell me about your working experience, etc. Interviewer then explained with some detail what the position entailed, and to close the interview I was asked if I had any questions. Was called for a second interview, and it was very straightforward too.", "Interview Questions": "Why did you apply for this position?\r\nTell me about you work experience?\r\nDo you have working experience in Baltimore?"}, {"date": "19 Jun 2015", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Washington, DC) in Feb 2015", "Interview Descriptions": "straight forward and asked questions that were relevant and helpful in the whole process.  Had to give a job talk, which was welll received and people asked good questions. overall it was not a difficult process", "Interview Questions": "what is one research question you would like to answer"}], [{"date": "16 Jul 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Jan 2015", "Interview Descriptions": "I was asked mostly about my research experience.  Very little time was spent on my grades or GRE score.  Experience and practical demonstration of abilities were most important to my interviewers and now that I'm graduating years later I agree that this is the most prognostic indicator of success in a PhD program.", "Interview Questions": "Tell us about your research experience."}, {"date": "2 Feb 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland, Baltimore in Jan 2015", "Interview Descriptions": "Initial phone interview with HR rep to discuss basic eligibility and qualifications for employment. Next, onsite interview with HR Director regarding work history and more substantive job duties. Then, individual interviews or panel interview with other directors and managers with whom you'll work closely", "Interview Questions": "Will you be able to manage the unique challenges to this particular institution?"}, {"date": "31 Jan 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Maryland, Baltimore (Cheverly, MD) in Aug 2014", "Interview Descriptions": "When you arrive, you will meet your selection board (usually two or three people, including the supervisor of the position and a representative of Human Resources). The team leader will tell you what to expect, and will explain that the board will be recording your answers for later review. Don't let this recording process distract you—it’s a normal part of the interview and necessary to make a complete assessment later on.\r\n\r\nThe board will then begin asking you a series of questions to assess your knowledge, abilities and personal suitability. These may include:\r\n\r\nClosed questions that demonstrate your knowledge by requiring a specific factual answer.\r\nOpen-ended questions that are broader in scope and require you to work through the answer.\r\nSituational questions that describe a hypothetical situation and ask how you would proceed in those circumstances.\r\nBehavioural questions that ask you to describe a time in your own history when you dealt with a certain situation, and to explain how you dealt with it.", "Interview Questions": "I don't remember them all, but think behavior based!"}, {"date": "18 Jan 2015", "title": "Software Engineer At Medical School Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland, Baltimore in Jul 2014", "Interview Descriptions": "Resume, one recommendation letters and onsite interview. Because I am a PhDc, the questions are most related to my research and development procedure such as what is your research topic, how you define and address those problems, why did you choose such method and how can you justify your idea.", "Interview Questions": "Not really have the difficult question, the question about coding is very basic."}, {"date": "23 Mar 2017", "title": "Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Bel Air, MD) in Jul 2014", "Interview Descriptions": "Go online to the website and apply from there, then Human Resources will give you a call within a week to set up an interview if you're qualified. You will go to the interview and meet with 2 people who will ask you questions.", "Interview Questions": "Why do you want this job?"}, {"date": "12 Jan 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Maryland, Baltimore (Belcamp, MD) in Jun 2014", "Interview Descriptions": "Grilled by a bunch of people with dated mindsets that are terrified off change, I was paid to deliver printed service. I did that and the manager was scared i was going to take his job.", "Interview Questions": "Do you work"}, {"date": "30 Nov 2015", "title": "GYM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Maryland, Baltimore in Apr 2014", "Interview Descriptions": "The interview process was easy. I was asked the regular interview questions like what are your strengths and weaknesses and how I would handle a certain situation. The interview lasted for 30 minutes.", "Interview Questions": "What are your strengths and weaknesses, I was given a scenario and asked how I would handle the situation."}, {"date": "1 Jun 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Maryland, Baltimore (Laurel, MD) in Nov 2013", "Interview Descriptions": "Interviewed with 3 managers and many lab tests and also background and credit evaluation. The enire process was as exhausting as could be. But I guess it was necessary for their security.", "Interview Questions": "N/A"}, {"date": "22 May 2017", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Maryland, Baltimore (Havre de Grace, MD) in Jul 2013", "Interview Descriptions": "one on one with a supervisor.  formal but not intimidating.  went well it was very positive with me getting a chance to ask a lot of questions as well.", "Interview Questions": "what are your short and long term goals ? how do you feel you will be able to contribute to our department? what are your greatest strengths and weaknesses."}, {"date": "9 Mar 2016", "title": "Research Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Apr 2013", "Interview Descriptions": "Found job posting on indeed.com. I submitted my resume and cover let and was emailed directly by the hiring manager of the research lab who set up a time and date for an interview. I was interviewed by the three faculty members who run the lab as well as the lab manager. It lasted roughly 30 minutes followed by a quick 10 minute question and answer session afterward. Most of the questions asked about my study management experience and skills as well as the nature of the research studies I had previously worked on.", "Interview Questions": "What was your previous research experience?"}], [{"date": "5 Apr 2017", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Mar 2013", "Interview Descriptions": "very informal, just meet the hiring manager in her office for about an hour and chat. there was very little pressure and you just talk about casual things and what you do.", "Interview Questions": "Tell me about yourself."}, {"date": "26 Jul 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Jun 2012", "Interview Descriptions": "I was very good. I had to interview with the office manager which took about and 1hour and half. She took me down to the office where I would be working and to see what they be doing the fit of the office. I also would be traveling to other office so I had to do a share day with two of the offices of at least 4 hours", "Interview Questions": "how long I been doing medical assistant"}, {"date": "7 Mar 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Mar 2012", "Interview Descriptions": "Great opportunity to learn about the organization. Read the strategic plan to familiarize myself with the organization.  This interview process included five interviews with stakeholders. The process was overwhelming and at times challenging. However, it provided a great oversight of the organization", "Interview Questions": "Relevant experience to the position"}, {"date": "21 Apr 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Maryland, Baltimore (Houston, TX) in Feb 2012", "Interview Descriptions": "It was a telephonic interview once i received and read my PI proposal. It was all about if i can handle this project and willing to learn new techniques.", "Interview Questions": "If I am familiar with the techniques I am going to use in project. "}, {"date": "29 Apr 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Aug 2011", "Interview Descriptions": "It was behavioral interview based.  Not difficult, have to do your homework.  It's a graduate and professional campus, so most of the hiring managers are MD's and PhD's.  You cant BS them, tey know how to get to the heart of a question.", "Interview Questions": "Describe an interaction with an unhappy customer."}, {"date": "8 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at University of Maryland, Baltimore (Baltimore, MD) in Jan 2011", "Interview Descriptions": "conduct interview in a very friendly environment one o one, review the credential and discuss the pros and con and job environment and flexibility, discuss the job specification and job responsibilities, overall it was a wonderful experience", "Interview Questions": "tell be about our self"}, {"date": "24 Sept 2014", "title": "RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland, Baltimore in Jan 2010", "Interview Descriptions": "average one has to work with hr for a week and a half share a day non-existing just very drawn out, human resouses does not assist a employee, medications were difficult to obtain from the pharmacy", "Interview Questions": "upper management cares nothing for the unit staff i was, and still am, injured in my spine, and they did everything but help my situation. I have to live everyday with extreme pain in my neck/spine. They faught and faught with my attorney. I went back to work with this condition and it will only get worse"}]]