[[{"date": "22 May 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ESSEC Business School (Paris)", "Interview Descriptions": "It was long but we were talking about my life in general the way that I see thing and the way that I want to help them in the future", "Interview Questions": "What’s your purpose for this job ?"}, {"date": "1 Mar 2023", "title": "Key Account Manager (KAM) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ESSEC Business School", "Interview Descriptions": "Processus classique: RH, manager, DG. Pas de mises en difficulté mais questionnement très pertinent, entretien s'apparentant plus à une conversation qu'à un entretien avec le RH, autres entretiens plus classiques.", "Interview Questions": "Quelle est votre vision de...?"}, {"date": "10 Feb 2023", "title": "Coordinatrice de programmes Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at ESSEC Business School", "Interview Descriptions": "Parcours entretien classique: entretien RH au téléphone, entretien Manager puis entretien avec N+2. On m'a aussi demandé de faire un cas pratique/mis en situation entre le deuxième et troisième entretien.", "Interview Questions": "Savez-vous travailler sous la pression ?"}, {"date": "30 Jul 2021", "title": "Étudiant, programme grande école post-prépa Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 12 months. I interviewed at ESSEC Business School (Cergy) in Jul 2021", "Interview Descriptions": "Entretien de personnalité de 45 minutes, auquel s'ajoute deux entretiens de langues. Les questions varient, entre personnelles et assez générales, et des mises en situations professionnelles.  L'étudiant doit se présenter pendant 5 minutes de prise de parole continue, puis  laisse champs libre au jury pendant 40 minutes afin qu'il connaissance votre profil. Les questions sont parfois destabilisantes, le but du jury est d'avoir un aperçu global de votre personnalité, et de ce que vous pourrez apporter à  l'école.", "Interview Questions": "- mise en situation de crise\n- question personnelle pour mieux connaitre le futur étudiant"}, {"date": "2 Sept 2021", "title": "Formateur/Responsable Pédagogique Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at ESSEC Business School (Paris) in Mar 2021", "Interview Descriptions": "Le RRH de Essec Executive Education m’a imposé un entretien téléphonique à l’improviste. Il devait me répondre sous 8 jours , je n’ai eu aucune nouvelle. Je l’ai relancé. Il m’a rappelé alors qu’il avait ses enfants entre les jambes. Il n’a pas été capable de me donner un motif factuel justifiant le rejet de ma candidature. Attitude très peu professionnelle.", "Interview Questions": "Pourquoi vous voulez postuler chez nous?"}, {"date": "7 Dec 2022", "title": "Étudiant MIM grande école Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ESSEC Business School (Paris) in Feb 2021", "Interview Descriptions": "It was a 45 mins interview process, and my questions were based on my statement of purpose. They wanted to see my motivation and validate if all my experience was true. They were very friendly.", "Interview Questions": "1. What do you think is the measure of success? 2. Future goals 3. Things needed to run a startup (because I said I wanted to be an entrepreneur) 4. Why essec? why france? 5. What do you bring to essec? 6. What are some of the things you'd like to improve? 7. Something related to my job details."}, {"date": "28 Nov 2020", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ESSEC Business School", "Interview Descriptions": "Très simple et rapide avec pas mal d'aide et d'indications. Très gentils et aimables ! Continuez comme ca. Les recruteurs nous accompagnent tout au long du processus de manière efficace.", "Interview Questions": "Parlez vous anglais ? Français ? Arabe? Cantonais ? "}, {"date": "9 Jan 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at ESSEC Business School (Cergy) in Jul 2019", "Interview Descriptions": "The interview process was fair and lasted for 45min. The student starts with a 3min into, then answers questiosn coming from a senior student, a teacher and a former student", "Interview Questions": "What is your motivation to join the school ? Which activity do you want to participate in?"}, {"date": "14 Jan 2020", "title": "Chargé De Communication Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at ESSEC Business School (Cergy) in Mar 2018", "Interview Descriptions": "Envoi d'une candidature puis rappel par la direction des ressources humaines. J'ai ensuite obtenu un rdv avec la RH, qui est la première étape. Par la suite, un rdv a été fixé avec le responsable du service en charge du recrutement. L'entretien s'est très bien passé et j'ai été rappelé une semaine environ plus tard pour me faire une propostion.", "Interview Questions": "Décrivez vos missions sur vos précédents postes ?"}, {"date": "14 Jan 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at ESSEC Business School (Cergy) in Jan 2018", "Interview Descriptions": "Processus très rapide avec un unique entretien pour présenter au professeur parcours et intérêt pour la matière. Puis présentation du rôle TA, ce qui est attendu etc. Mise en place dates d’assistanat", "Interview Questions": "Questions en lien avec parcours et la matière enseignée "}], [{"date": "22 Jan 2021", "title": "Assistante Administrative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ESSEC Business School (Cergy-Pontoise) in Dec 2017", "Interview Descriptions": "Après avoir postulé à l'annonce sur Indeed j'avais été contactée rapidement pour convenir d'un RDV.  Le responsable RH m'a bien vendu le poste par téléphone. Le RDV se passe très bien et on me fait savoir que je serais en poste prochainement. Sauf qu'on me recontacte pour un deuxième RDV (qui n'était pas prévu) pour rencontrer ma future collègue.  Je m'y rends et suite à ce RDV aucune nouvelle. J'ai rappelé quelques jours plus tard et on m'apprend que finalement le poste a été pourvu en interne. La  \"future collègue\" n'a pas du apprécier mon faciès. Vraiment pas sérieux pour un grand nom.", "Interview Questions": "Des questions basiques d'entretien, sur mon parcours et ce que je sais faire\r\nSi je savais parler anglais"}, {"date": "16 Oct 2017", "title": "Ingénieur Stagiaire Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ESSEC Business School", "Interview Descriptions": "Prise de contact par téléphone pour confirmer la motivation du candidat et convenir d'un entretien physique. Entretien individuel avec le responsable des ressources humaines puis entretien individuel avec le responsable opérationnel.", "Interview Questions": "Présentez-vous ?"}, {"date": "10 May 2021", "title": "Chef De Projet Digital Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at ESSEC Business School (Paris) in Apr 2017", "Interview Descriptions": "J'ai d'abord fait un entretien avec le RH. Puis je me suis entretien avec le directeur du services et à la fin je me suis entretenu avec le responsable de services.", "Interview Questions": "Quelle est votre avis sur l'ESSEC?\r\nComment vous nous avez connu?\r\nComment vous comportez-vous en équipe?\r\nQuels sont vos ambitions professionnelles?\r\n\r\nQuels sont les techniques de gestion de projet que vous connaissez?\r\nParlez-moi de la matrice RACI?  Comment calculez-vous les risques ?\r\n"}]]