[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Fantastic expereince  if you want to enter the impact space", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jul 2022", "job_title": "Director in Mumbai", "duration": "N/A", "pros": "If you have been working as a professional in the not for profit space and want to pursue work in impact space-- Women's World Banking is a perfect stepping stone as they recruit expereinced talent. \r\n\r\nThe orgnisation is very focussed on solving 1 problem and this is thier biggest strength and despite being small have built a name & credibility for themselves.\r\n\r\nAs a proffesional you are expected to be independent & drive your business verticals. Very little heirarchy; you can make a lot of decisions. \r\n\r\nBeing a niche area you can develop your own unique personal brand as an expert.", "cons": "There needs to be better thought through career paths especially for younger team members. There is no defined promotion/ graduation curve which can be very overwhelming if youve worked in more structured organisations. \r\n\r\nThere is heavier staffing at the NY end comapred to local offices; which adds a layer of cost to operations; with regional teams being under-staffed"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Culture promoting 13hr+ workday and weekend working", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Dec 2020", "job_title": "Consultant in South Twenty Four Parganas", "duration": "N/A", "pros": "Only Salary is good, and work from home", "cons": "Indian management is very unclear and tries to stretch people into long working hours. It's a norm here to hear people say \"I will complete that over weekend\". Weekend meetings are not rare. \r\nWork is not planned properly with very short term vision. People have very high egos and are trained to work long hours. \r\n\r\nIf you do not want to have a personal life, if u only love money, it's a good place for you."}], []]