[[{"date": "7 Jul 2023", "title": "Multicultural Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Arkansas (Fayetteville, AR) in Mar 2023", "Interview Descriptions": "As per usual with higher ed jobs, the process consisted of a phone screening, a group panel interview, a presentation, and another interview. As a Queer, BIPOC, first-generation low-income recent college grad, I was first contacted with enthusiasm about my fit for the role. However, when I declined to pursue a separate role under the University, they also withdrew my application from this role. I waited to hear back from someone to confirm my withdrawal with THIS role, but no one ever reached out. It made it feel very artificial considering the initial contact. Let's not even begin to divulge into the emotional labor a candidate is supposed to endure considering the intersectional identities I carry--ironic to say the least.", "Interview Questions": "Why are you applying for this role."}, {"date": "25 Nov 2022", "title": "Working Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Arkansas", "Interview Descriptions": "Through the Venture Internship Program, I met with entrepreneurs in the area and asked about who I was and my value add to their company. Fairly simple interview process, just had to set up the time to meet with them and have a conversation about yourself and their company.", "Interview Questions": "Tell me about yourself. Walk me through your resume."}, {"date": "10 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "Interviewed by three people, a DON, a staff nurse and the medical director. They were very polite and genuine. I felt comfortable answering their questions and sharing my nursing experience.", "Interview Questions": "They asked if I would be comfortable taking care of gender fluid patients."}, {"date": "15 Jun 2022", "title": "Property Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas in Apr 2022", "Interview Descriptions": "Good Job! You have to go in different buildings on campus to get some bard codes. There will be some people helping you from each department. You will enjoy it!", "Interview Questions": "Why do you want to get this job? "}, {"date": "7 Feb 2023", "title": "Reference Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Arkansas in Apr 2022", "Interview Descriptions": "Very quick and painless interview. Interview consisted of explaining the pros/cons of the job. Asked me to give him a resume and told me the university would be in touch with me.", "Interview Questions": "Are you comfortable with technology?"}, {"date": "12 Jan 2023", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at University of Arkansas (Fayetteville, AR) in Apr 2022", "Interview Descriptions": "Super easy, had a casual conversation and got offered the position on the spot. Wasn't too much to it, just a few questions back and forth. They were looking for quite a few people at the time.", "Interview Questions": "What is your summer availability?"}, {"date": "8 Feb 2022", "title": "Business Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "First interview was by phone with the committee. The second round was an in-person interview with the committee that lasted about half of the day. They asked me to give a short presentation on what I saw as opportunities for collaboration. They spoke with my references before calling with the job offer.", "Interview Questions": "There were a lot of open ended questions asking me to describe different experiences I had and how I reacted to them."}, {"date": "7 Jan 2023", "title": "Social Media Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas in Nov 2021", "Interview Descriptions": "A panel of interviews were very approachable. It was via zoom and I interviewed with the director and the person that would be my direct supervisor. Enjoyed my time with them!", "Interview Questions": "What did you do when you made an mistake?"}, {"date": "2 Mar 2022", "title": "New Student Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas (Fayetteville, AR) in Oct 2021", "Interview Descriptions": "We went through two rounds of interviews and the second one was much more formal than the first. The first is mostly to make sure that you are a fit for the company and the second is where they ask you about your technical abilities and what you have to offer the company professionally.", "Interview Questions": "What are things that you value within a company?"}, {"date": "15 Apr 2021", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "Efficient, very personable. Typical process of admission. Interview was pretty average. Felt like a two way conversation. They were transparent throughout and very clear about the program. They asked why  I chose to apply to their program.", "Interview Questions": "Why did you choose to apply to our program?"}], [{"date": "1 Feb 2021", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas (Fayetteville, AR) in Dec 2020", "Interview Descriptions": "On Zoom with two of the office hiring professors, met approximately 45 minutes and discussed typical interview questions. All UofA jobs have \"panel\" interviews, so expect multiple people on the interview.", "Interview Questions": "Why am I interested in this specific position?"}, {"date": "1 Oct 2020", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas", "Interview Descriptions": "The interview was three-on-one, but still very casual. You do need to dress professionally, but the interviewers will be pretty relaxed. They are very friendly and want to know more about you and what you bring to the team.", "Interview Questions": "How would you work with a difficult mentee?"}, {"date": "14 Mar 2021", "title": "Fundraiser Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2020", "Interview Descriptions": "Standard interview where you need to describe your communication and interpersonal skills. Answer how good are you when working with teams. The interview was followed by the compliance rules and procedures which was long.", "Interview Questions": "Describe how your skills could help the fundraising goal?"}, {"date": "2 Oct 2019", "title": "Facilities Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "Multiple rounds. First round is basic questions from a list. If you get a call back the interview is more in depth. The cal back interview was fairly short and straightforward.", "Interview Questions": "Basic STAR question"}, {"date": "8 Dec 2019", "title": "GA - Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Arkansas in Aug 2019", "Interview Descriptions": "I applied for graduate school and then for the GA position.  The dean of engineering student success. The University of Arkansas is a public land-grant, research university in Fayetteville, Arkansas. It is the flagship campus of the University of Arkansas System and the largest, best-known university in the state.", "Interview Questions": "Who did you do well as an international student at this university?"}, {"date": "14 Jul 2021", "title": "Procurement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jul 2019", "Interview Descriptions": "Unprofessional/discriminatory (wanted to check the box-my experience  for the job-exceptional).  I would recommend the leadership send the management team in this department through DE&I/cultural competence training, as well as have their interview records reviewed...", "Interview Questions": "N/A"}, {"date": "4 Feb 2020", "title": "Turf Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Arkansas (Fayetteville, AR) in May 2019", "Interview Descriptions": "face to face interview was very laid back and the boss was very easy to talk to. He makes you feel very comfortable. The boss has a lot of experience in the grass turf area. Very impressive", "Interview Questions": "why do you want to work here"}, {"date": "4 Apr 2019", "title": "Facilities Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "If you are applying for this position they have 2 annual hiring sessions, one per semester. You will receive an email after you apply to find out if you made it to the in person interview. The in person interview is set up in one of the dance studios; they set up about 60 chairs for candidates to sit in and have multiple interviews going on simultaneously behind curtains in the front. May be interviewed by student staff or graduate assistants.", "Interview Questions": "What are some of your strengths and weaknesses?"}, {"date": "15 Mar 2019", "title": "Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas", "Interview Descriptions": "Very easy. Went in and they asked me some basic questions. I was offered a position right then doing temporary work. I filled in for various position around campus doing all kinds of work.", "Interview Questions": "What do you hope to get out of working here?"}, {"date": "14 Mar 2019", "title": "Fiscal Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas (Fayetteville, AR)", "Interview Descriptions": "Applied on line, took a few weeks to hear anything, phone then group interview with location team (typically 4-5), where your head is on a swivel for about an hour answering classic questions.  Interview team is made up of the staff in the target department and they take turn asking questions over about an hour.", "Interview Questions": "Why do you want this position?  What do you bring to the position? What do you look for in a work culture?"}], [{"date": "4 Oct 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Arkansas", "Interview Descriptions": "Formality. You're going to be interviewed by people who already know you, and already want you to have the job. So if you're not in a position where you can network, don't count on getting a better job on campus, even if you are more qualified than your competitor.", "Interview Questions": "How do you handle angry customers/parents/students?"}, {"date": "2 Mar 2019", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Oct 2018", "Interview Descriptions": "Took half a day for the interview, including the assessment with head of team, the team and students. I have also requested to do a presentation / demonstration on spot as well. \r\n\r\nIt was quite tiring as taking such a long time for interview and get involved in discussion with the team members. However it was a very friendly and positive discussion with the team. They even provided a campus tour for me.", "Interview Questions": "What makes you fit best in the role? "}, {"date": "30 Oct 2018", "title": "Academic Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Arkansas (Fayetteville, AR) in Aug 2018", "Interview Descriptions": "I had a phone screen, which I thought was going to be with one individual, but ended up being a panel interview. I was then brought on-site for an in-person panel interview with leadership, a series of short 1:3 interviews with the team, followed by a 10-minute presentation... which would have been fine, had one of the job's primary components been giving presentations. I think the presentation portion, which took up half of the on-site time, was a poor metric for on-the-job performance. I was not notified of the status of my application afterward and had to reach out. I was not given mileage, though I drove from out of state. Sluggishness was continually blamed on HR. Overall a very poor experience.", "Interview Questions": "Tell us a little bit about yourself."}, {"date": "20 Jun 2018", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at University of Arkansas (Bentonville, AR)", "Interview Descriptions": "Way too much waiting. The interview process took about 5 weeks with 3 interviews total (1 phone interview and 2 in person panel interviews). 5 weeks was how long it took them to tell me they needed someone who already knew the computer system, and that was my ONLY downfall. Otherwise i was a great candidate according to them. This was for a very entry level role, meaning skills are easily taught. my advice—start as a RazorTemp if you really want to work here and if you were never a student. Its not completely the university’s fault, its the government that makes these extensive requirments for employment. Nonetheless, a lot of my time and energy was wasted. I cant stand how political everything has become!", "Interview Questions": "How do you handle a foreign customer that does not speak english?"}, {"date": "9 May 2018", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR)", "Interview Descriptions": "Nightmare. You apply for the position, 4 weeks passes, you have already found another position with another company and then they contact you about coming in for an interview. Who can go 4 weeks without employment?", "Interview Questions": "Do you get a long well with students?"}, {"date": "1 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Mar 2018", "Interview Descriptions": "Heard about the posting via email. The professor I  worked for researched with Asphalt, so I sent him an email saying that I was interested in the work. After filling out a form, and writing a brief essay pertaining to my interest for the position, I was selected for Interview. The interview was very easy and relatively straightforward.", "Interview Questions": "Why does this job interest you?"}, {"date": "5 Mar 2022", "title": "Supplemental Instructions (SI) Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Arkansas (Fayetteville, AR) in Mar 2018", "Interview Descriptions": "It was a brief interview with the person in charge of the program for the subject I was interviewing for. It was around 30 minutes and around six to seven questions.", "Interview Questions": "Describe leadership opportunities you have had in the past."}, {"date": "29 Dec 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2018", "Interview Descriptions": "overall pretty quick and easy, questions were not very difficult and were related to the department that I was to be working in. I would say overall an eight out of ten interview experience and level of difficulty probably ranging around a six out of ten", "Interview Questions": "What experience do you have working with students?"}, {"date": "3 Nov 2022", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Arkansas in Jan 2018", "Interview Descriptions": "Direct interview, conversation with the hiring manager, telephone interview, presentation. Provide career path, publication records, research statements, motivation letter, emails communication, certificate evaluation, background checks, review of offer letter, start up date decisions etc", "Interview Questions": "Any mistakes you did in the past and how you fix them?"}, {"date": "27 Sept 2017", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Arkansas", "Interview Descriptions": "20 to 30 min with manager. Nothing super fancy but it was good overall. Started with basic questions and continued with details about what I have done in the past. \r\n\r\nThey gave me the offer a week after that.", "Interview Questions": "Tell me about your experience in previous job"}], [{"date": "4 Oct 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Arkansas (Fayetteville, AR) in Sept 2017", "Interview Descriptions": "Casual environment with two interviewers. Took place in a large conference room, but the interviewers were relaxed and easy to talk to. Wanted to know experience with managing people and what my availability looked like.", "Interview Questions": "What is the most difficultproject/group you’ve managed?"}, {"date": "11 Dec 2017", "title": "Program Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Sept 2017", "Interview Descriptions": "Informal, lunch interview. Asked questions about why I wanted the position and I answered specifically why I wanted to work for the program. Very good experience! No time was wasted and we got to the offer very quickly.", "Interview Questions": "Casual conservation was all."}, {"date": "23 Sept 2020", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Arkansas (Fayetteville, AR) in May 2017", "Interview Descriptions": "A set of questions were sent out via email. Some questions were \"What are your strong and weak skills\" and  \"How are you with working with technology?\" and \"Are you okay working remote?\" and \"Do you mind coming in person to work?\"", "Interview Questions": "What are you weak and strong points with technology?"}, {"date": "22 Mar 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Arkansas in Apr 2017", "Interview Descriptions": "The interview process was simple and direct.  I met with my advisor and was referred to other members of the team to discuss expectations and opportunities.  I was seeking an internship so there was no need to discuss salary or benefits.  It was designed to meet my scheduling needs and was a very positive experience from beginning to end.", "Interview Questions": "What would you like to learn?"}, {"date": "11 Jul 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Arkansas (Fayetteville, AR) in Feb 2017", "Interview Descriptions": "Skype interview with two professors which took about an hour. They usually use skype or phone interview first because there are applicants from different parts of the country. I was contacted first by email and then I was called to join the skype interview. The whole process did not take more than two interviews.", "Interview Questions": "They asked questions about background and experience, why you think you are a good fit for the position, and how you would manage certain situations at work depending on your role. It is usually asked how do you picture yourself within 5 to 10 years and what challenges you think you would face if you are hired for the position."}, {"date": "29 Sept 2021", "title": "Business Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Arkansas (State University, AR) in Feb 2017", "Interview Descriptions": "Best team and best working experience! Love the people, love the atmosphere, and grew so much. The team is approaching, inviting, and excited for the value you will add to the team.", "Interview Questions": "Describe your work ethic and how that contributes to your past work history"}, {"date": "19 Jan 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR)", "Interview Descriptions": "I had one interview and then got the job. It was a very straight forward interview with the HR Manager. Nothing out of the ordinary, just a one on one in his office.", "Interview Questions": "There were no curveball questions, or any sort of thing like that. Very straight forward questions. It was easy to tell his intent in asking the questions he did. Good interview as a whole."}, {"date": "14 May 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2017", "Interview Descriptions": "Multi-part interview, fun at times, long process. The process took over 3 months because you have to apply in the fall and interview in the Spring. The group interview part is fun, but also close to 3 hours long.", "Interview Questions": "Why do you want to be a Resident Assistant?"}, {"date": "14 Feb 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2017", "Interview Descriptions": "Applied online, a week and half later I got a call for a phone interview with a panel of 2. Few days later I got asked for an in person interview with a panel of 7, told to give them two weeks for background checks and HR paperwork. A little past 2 weeks I got a call that said the process was taking a little longer but I should hear something by the end of the week and that they were doing my background check. That took a couple days and then I was officially offered the position. All in all the process took a little less than a month but everyone was very pleasant and straight forward.", "Interview Questions": "Why do you think you are the best fit for this position."}, {"date": "1 Aug 2016", "title": "Club Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Arkansas (Fayetteville, AR)", "Interview Descriptions": "I arrived at the guest services office and greeted by the director of guest services. During the first part of the interview I was asked some questions about my background and which was in the form of a chat. There after I was asked about my work experience and my skills. The interview ended with instruction of my first shift.", "Interview Questions": "What was my previous work experience."}], [{"date": "26 Feb 2017", "title": "Study Abroad Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Arkansas (Fayetteville, AR) in Aug 2016", "Interview Descriptions": "It was a phone interview with full-time staff that consisted of a series of basic interview questions, and questions regarding my strengths and weaknesses.  Overall a great interview experience.", "Interview Questions": "What are 3 words that an employer would use to describe you?"}, {"date": "23 Jun 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "I had applied through university online process. All paper works and recommendation letters has to be sent to graduate school which is the same process as in other university. Follow up with the professor whom i was going to work with is key.", "Interview Questions": "Initially had in touch with professor through email. Professor decided to talk with me in phone and asked me about the research interest, experience and publications."}, {"date": "20 Feb 2017", "title": "Systems Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Arkansas (Fayetteville, AR) in Jun 2016", "Interview Descriptions": "I was emailed in response to my resume and asked to interview. I interviewed once with a panel of 4 or 5 people and then was asked to come back in for a follow up interview, which was actually more of a meet and greet with upper management than a formal interview.\r\nI've also been a part of hiring since I've worked there and we sometimes also ask that IT professionals complete a skills test to determine how proficient they are. You would be surprised at how much people are willing to talk about their skills and how poorly they perform in a basic skills test of those same skills.", "Interview Questions": "Talk about a time with things didn't go the way you had hoped and how you handled it."}, {"date": "22 Mar 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Arkansas (Fayetteville, AR)", "Interview Descriptions": "I was asked to submit a resume to the hiring manager, after it was reviewed I was asked back for a one on one interview with the hiring manager.  The interview was in the style of a conversation more than direct knowledge based questions.", "Interview Questions": "What are some of the things you have done while at the University?"}, {"date": "24 May 2017", "title": "Institutional Service Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2016", "Interview Descriptions": "Four of the Housing Coordinators join in the interview and ask a series of brief questions regarding the position requirements. They are all very professional but also very down to earth and easy to communicate with so the interview process is fairly simple.", "Interview Questions": "They will most likely ask you what percentage of attendance you expect to have in that position."}, {"date": "5 Jun 2017", "title": "Research Affiliate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2016", "Interview Descriptions": "Discussion of background relevant to research of interest. Questions regarding research in university settings as well as industry setting. Knowledge of testing equipment, certification  of instrument use, and use of advance imaging techniques.", "Interview Questions": "Research experience in biomedical technologies, project management, and lab experience questions. "}, {"date": "24 Mar 2018", "title": "GA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2016", "Interview Descriptions": "Many incredible staff came to the interview, so it ended up being a group interview where all attendees asked a question. We discussed experiences in the field and future aspirations, as well as time commitment and ability to work in teams.", "Interview Questions": "Tell me about yourself"}, {"date": "10 Nov 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Oct 2015", "Interview Descriptions": "online application, called for first interview, panel for 3 people, emailed to come in for a second interview, panel of 6 people, told there would be background checks and reference checks. My references told me they were never called, and I received an automated \"position filled\" email later.", "Interview Questions": "How did you handle a mistake that you made at work?"}, {"date": "29 Dec 2016", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Arkansas (Fayetteville, AR) in Aug 2015", "Interview Descriptions": "There were 3 parts to the interview process. The first was a phone interview with basic questions about experience and skills. If you pass the phone interview, you move to a 1:1 interview. It was about 3 hours. I met with the supervisor individually, then the immediate team for a group interview, followed by a skills test, and ended with the supervisor again. The third part to the process was an interview with the supervisor's bosses for a final stamp of approval. \r\nUsually they call about 5 contenders, bring in 2-3 for interviews, and 1 to meet the bosses.", "Interview Questions": "What has been your biggest accomplishment?"}, {"date": "28 May 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "The interview was very casual and laid back. It was a group interview where they told me a lot about the company and asked my own personal interests. There was four different people at the interview and they were very nice. They went into specifics about the job and pay. They also asked me about my own personal experience and work.", "Interview Questions": "What are your skills?"}], [{"date": "13 May 2015", "title": "Athletic Tutor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR)", "Interview Descriptions": "There wasn't really an interview. It was mainly just talking about how you would tutor the athletes. They are super friendly and really care about what they are doing as a part of the athletic department. They also really care about the athletes which is cool. The person in charge of the department is normally the one that interviews you and it going pretty smoothly.", "Interview Questions": "What makes you think that you'll be a good tutor?"}, {"date": "19 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Mar 2015", "Interview Descriptions": "My employer was looking for someone to assist in organizing her radio show; the process was smooth and professional, nothing out of the ordinary. I could see that she was indeed in need of someone who could help her get things in order and do the small things so she could focus on the big things.", "Interview Questions": "Would you consider yourself organized?"}, {"date": "7 Dec 2015", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Feb 2015", "Interview Descriptions": "First there was an online application where there were 2 short essay questions regarding legacy and why you want to be an RA. Then you get an individual interview, and if you pass you go on a group interview where you do activities together along with other applicants and presentations as well.", "Interview Questions": "Give an example of a time you did beyond what was required."}, {"date": "12 Dec 2017", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2015", "Interview Descriptions": "just 1 round interview, base question of computers, like word, excel, ppt. when computer has some problem, how could you fix this problem for student.  Went through your resume. you better did server job before,  and like to help people", "Interview Questions": "how do you familiarly with Excel  "}, {"date": "30 Dec 2017", "title": "Production Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2015", "Interview Descriptions": "The interview was incredibly easy.  After a few questions, I was given a tour of the building and was almost reassured I had the job. All things considered, this was probably unique to my position.", "Interview Questions": "What are your experiences in the field?"}, {"date": "1 Jun 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2015", "Interview Descriptions": "Met lab members, see if I was a good fit.  Saw the lab and all areas involved in the program, along with meeting professors and department personnel.", "Interview Questions": "Asked about what I wanted to do for my thesis"}, {"date": "9 Jul 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas (Fayetteville, AR) in Nov 2014", "Interview Descriptions": "I applied online. \r\nThen was selected for a phone interview. After that I was invited to campus for a face to face interview. \r\nOnce on campus I first meet with the committee and then I had to give a presentation to the whole staff.", "Interview Questions": "How do I stay motivated"}, {"date": "17 Mar 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Arkansas (Little Rock, AR) in Aug 2014", "Interview Descriptions": "They ask about my background, the projects I was working, my research interests, my work experiences and my skills, my weakness and strengthen, my goals, if I had teaching experience, What was the biggest project I was working on", "Interview Questions": "what are your strength"}, {"date": "30 Jun 2014", "title": "Instructor Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Arkansas", "Interview Descriptions": "1st round - phone interview. Ask why you are interested in this position, etc\r\n2nd round - skype. Several person question you one by one, what is your  teaching phylosiphy questions?\r\nwhat is the most difficult case you have dealt with student? what is the comments from your student?", "Interview Questions": "what is the worst case happened in your class?\r\nwhy do you think you can be a good instructor?"}, {"date": "4 Jan 2016", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Feb 2014", "Interview Descriptions": "Standard questions, polite interviewers, but there were more people in the room than I expected. Overall the interview was a pretty simple one. They are look for well rounded, stable employees who they can trust to be nice/friendly to students.", "Interview Questions": "Describe a time that a customer was angry with you. How did you resolve it?"}], [{"date": "24 Jan 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Arkansas", "Interview Descriptions": "The interview process for grad school is mostly merit based, rather than question based. In the chemistry department, your undergraduate GPA, GRE score, and letters of recommendation have the most sway. I think in person interviews are only employed when the minimum requirements for acceptance are not met, but the department would like to increase enrollment. For the most part, you deal with office personnel who only know about the paper pushing side of things, not really the chemistry side of things.", "Interview Questions": "What would be the focus of your ideal research project?"}, {"date": "1 May 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2014", "Interview Descriptions": "It was a very fair process.  Nerve-wracking but fair.  You need to know your stuff before you go into the interview.  Study up about the overal culture and norms at the U of A.", "Interview Questions": "What wil you do to improve the culture here?"}, {"date": "24 Oct 2016", "title": "SI Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Arkansas in Dec 2013", "Interview Descriptions": "I met with Anne Raines and Charlotte Lee both once to discuss my experiences in economics.  How I thought I could contribute to the organization, and what I was trying to get out of my experience as an SI instructor.  I would say that building strong report with instructors (and of course excellent grades) is the best way to get a job.  Some teachers interact more closely than others with CLASS.  If you have the qualifications, interview well, and have a recommendation from a professor who is well known within the organization than you have a very good chance of getting the job.", "Interview Questions": "How do you think you can contribute to the organization?"}, {"date": "6 Nov 2013", "title": "Geospatial Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Arkansas", "Interview Descriptions": "It took only a week for the Employer to contact me after submitting resume. During the interview he was very polite and intuitive in his interviewing. He was understanding of lack of experience, but was very optimistic in educating while working.", "Interview Questions": "What make you think that you will be good in this position?"}, {"date": "9 Jul 2013", "title": "Administrative Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Arkansas", "Interview Descriptions": "Interview process is to meet first with the hiring committee (4 - 5 people), then with a group of potential co-workers who weren't on the hiring committee once you're a finalist (4 - 5 different people), then with the potential direct supervisor and the supervisor's boss once you're a final finalist. The interview by committee can be pretty nerve-wracking, but mostly they try to put you at ease.", "Interview Questions": "Didn't really get any memorably difficult or unexpected questions; it was all pretty standard, except for the sheer number of people on the panel, which I'd never experienced before (I had been accustomed to 1:1 interviews). They seemed inexperienced at interviewing, so mostly they were taking turns reading questions for me from a list."}, {"date": "30 May 2013", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Arkansas", "Interview Descriptions": "Take a copy of your resume or review it intently before you arrive for the interview.  Be prepared to answer questions regarding your past experience and future plans.", "Interview Questions": "What are your plans for the future?  "}, {"date": "17 Jun 2015", "title": "Post Doctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Apr 2013", "Interview Descriptions": "It was an on site interview without phone interview or skype meeting. I was required to send three recommendation letters.The interview was a Full day meeting people in the group and giving a presentation of my past work. Afterwards a dinner with my future boss. Great day an a little tire at the end.", "Interview Questions": "what are your strengths? "}, {"date": "2 May 2013", "title": "Part-Time Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Arkansas (Fayetteville, AR) in Apr 2013", "Interview Descriptions": "Candidates must have submitted a cover letter and resume. Then there is an interview hour block, ex (Monday 10-3pm). Just go between that time and you will have to check in. After check in, there are two interviews, and thats it. They will call you in a week to notify if you got the job.", "Interview Questions": "Give you situational questions. What would do in this situation kind of questions. "}, {"date": "3 Oct 2013", "title": "Computer Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Arkansas (Fayetteville, AR) in Nov 2012", "Interview Descriptions": "Submit online application. If the software matches the application with the job requirements then it is forwarded to the department for review. The department calls you in for an interview (may take several months due to state \"red-tape\" to jump through). Finally is background check.", "Interview Questions": "Explain experience with detailed software, such as Oracle Peoplesoft. "}, {"date": "15 May 2012", "title": "Report Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Arkansas (Fayetteville, AR) in Apr 2012", "Interview Descriptions": "I applied online through their website and got an email about scheduling a phone interview after few days. Phone interview was with the director of the department and it was ok, basic questions like tell me about yourself, related work experience, few behavioral questions.", "Interview Questions": "Tell me about yourself?"}], [{"date": "23 Jul 2015", "title": "Administrative Specialist II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Arkansas (Fayetteville, AR) in Mar 2012", "Interview Descriptions": "There was a group interview with the entire office staff (about 15 members). Each person asked about 2-3 questions each. This part of the interview lasted about an hour, then there was a personal interview with the supervisor and assistant that only lasted about 15-20 minutes.", "Interview Questions": "How do you handle conflict when it comes to who has priority?"}, {"date": "19 Dec 2013", "title": "Fiscal Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Dec 2011", "Interview Descriptions": "The hiring and interview process was very standard for a state college.  However, this process was very professional.", "Interview Questions": "The most difficult question asked would be \"where do you see yourself in 5 years\""}, {"date": "7 May 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Nov 2011", "Interview Descriptions": "You apply online under the classified section. Once you make it through the HR screening you are forwarded on to the department hiring. If they select you for an interview, they will call for a phone interview. They will then select a few candidates for a group interview. The interview was pretty generic.", "Interview Questions": "What is your greatest weakness? "}, {"date": "12 Aug 2014", "title": "Admissions Orientation Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in May 2011", "Interview Descriptions": "After submitting an application and resume the list of applicants is dwindled down to about 75. My year had about 200 applicants. From there group and individual interviews are conducted. Group is just to understand one's dynamic among a group of peers whom you don't know. Icebreakers are used to facilitate this. From here the individual interviews take place asking a plethora of questions about one's involvement at the university, cultural experience, and possible scenarios. From this point the staff makes the final cut to about 30 mentors with 10 alternates.", "Interview Questions": "If an angry parent approaches you about a privacy policy they don't agree with how might you handle that situation?"}, {"date": "17 Aug 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2011", "Interview Descriptions": "Was fairly simple application process. Applied online through their website. Got called up, went in for a quick interview with another tutor. He asked me to solve a few problems and explain them to him as if he was unaware of the answer or process to solve it. Did that, then talked to management to fill out a little paper work.", "Interview Questions": "Q: Show us how to solve this chemistry problem."}, {"date": "16 Jul 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Jan 2011", "Interview Descriptions": "An application was required. Then, there was a day in which there were group and individual interviews. In the group interviews, a team had to solve a problem. For instance, they would read a riddle of sorts, and the group would have to come to a conclusion as to which next steps should be taken or who was the most at fault in a certain scenario, etc.", "Interview Questions": "They were very interested in assessing interest and reasons why people were wanting to pursue this position, They assessed interest in leadership roles."}, {"date": "23 Oct 2014", "title": "Fiscal Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas in Oct 2010", "Interview Descriptions": "Apply online. Submit your resume online.  I am not sure how I feel about this 50 word minimum and I don't like being told that I have a minimum.  I may just give this whole glass door process the boot.", "Interview Questions": "N/A"}, {"date": "20 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Feb 2010", "Interview Descriptions": "As a international student, I got phone interview from my future advisor and once he approved my hiring, the program admitted my application.", "Interview Questions": "N/A"}, {"date": "15 May 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Arkansas (Fayetteville, AR) in Feb 2009", "Interview Descriptions": "Lengthy but typical for higher ed.", "Interview Questions": "I can't remember, but the most telling was, \"Do you work well with difficult people?\""}]]