[[{"date": "18 Jun 2023", "title": "Collections Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Jun 2023", "Interview Descriptions": "Panel of five people in interview, generic questions. The interview was fairly easy, each person had several questions. The interview was approximately 30 minutes. I interviewed at the beginning of the week and they told me they would let me know by the end of the week but they were a week delayed in responding.", "Interview Questions": "Asked about past experiences in field."}, {"date": "17 Apr 2023", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Denver in Feb 2023", "Interview Descriptions": "The process was very slow, it took months for the application process to begin and the interview process took over seven weeks, to the point that I had received another job offer.", "Interview Questions": "Name a time where you faced a project timeline that was off track and how you got the project back on track?"}, {"date": "2 Aug 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Colorado Denver", "Interview Descriptions": "I gave one interview with a hiring committee, one interview with the direct supervisor, one interview with the department head with about a week in between each one. Interviews were easy.", "Interview Questions": "Why are you interested in this position?"}, {"date": "30 Jun 2022", "title": "Director of Public Relations and Integrated Media Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Denver (Denver, CO) in Apr 2022", "Interview Descriptions": "This was a 2.5 month process from beginning to end, resulting in no one getting hired. \n\nTwo weeks after I applied, I was told I was advancing to the next round, which was a time-intensive, four question writing assignment. After passing that test, I was invited to a Zoom interview with four team members, which went well. \n\nThen, after some follow up emails and weeks of waiting, I was finally advanced to the final round, which involved meeting with nine team members, including the two hiring managers, over four hours. \n\nTen days later, I was told that none of the three final candidates got the job and that the Vice Chancellor wanted to reopen the position to look for someone with more higher education experience. This was never brought up as an issue at any point of the process.\n\nI was genuinely excited for this position, but now would never consider applying for another job there.", "Interview Questions": "What is your experience forming communication plans?"}, {"date": "10 Mar 2022", "title": "Vice Chancellor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2022", "Interview Descriptions": "I was invited to apply for a role in the marketing department by a recruiter. My next communication was from the head of the search committee, inviting me to interview. The interview was with the search committee and was fine. \r\n\r\nI sent a thank you and then followed up a week later to see if there would be next steps. He has ghosted me. I know through other channels that they already moved forward with other candidates. \r\n\r\nIf you work in marketing you should know your hiring practices impact your band. Do better CU Denver.", "Interview Questions": "How do you develop a brand strategy?"}, {"date": "9 Feb 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Jan 2022", "Interview Descriptions": "over 15 people on call - lots of pressure - had to prep powerpoint. Never been on such an intense call - lots of pressure but nice to know the university put in time and consideration to find best fit", "Interview Questions": "What cereal would you be? I dont even eat cereal\r\nwhy this position and university\r\n"}, {"date": "24 May 2022", "title": "Medical Physicist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Sept 2021", "Interview Descriptions": "it was very typical zoom interview with the team, everybody were nice .nothing unusual. not much else to say . this word counts is quite stupid. how many more words do you need ?", "Interview Questions": "nothing unusual. why do you want to join our program ?"}, {"date": "10 Aug 2021", "title": "Enrollment Operations Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Colorado Denver", "Interview Descriptions": "After application, I received a 30-min panel interview invitation with 5 members from the recruiting committee. They had a list of questions to ask and they went around the circle and had each person ask a different question. They didn't ask for follow up so you will want to have as clear of an answer as possible the first time.", "Interview Questions": "Tell me a time when you accomplished a project and what did you learn from it."}, {"date": "3 Jun 2021", "title": "Professional Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver in Jun 2021", "Interview Descriptions": "It was great - asked a set of approximately 8-10 questions all very straight forward, they were very kind and open and created a great dialogue. The interview lasted approximately 40 minutes over Zoom, and they broke it up into two sections so there is a second Zoom interview with the other half of the team as well.", "Interview Questions": "What is your greatest weakness? What is your greatest strength?"}, {"date": "31 Mar 2022", "title": "Peoplesoft Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Apr 2021", "Interview Descriptions": "Interview process was very professional , they did not ask  any memory based questions - it was more about troubleshooting  pesky issues based on hands on experience , I liked the interview process.", "Interview Questions": "Hogging thread in  weblogic server - what would have caused it , what can be the impact and  how will you handle it ??"}], [{"date": "25 Mar 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver", "Interview Descriptions": "It was an in-person interview committee (pre-COVID)  of their staff and interns that had 8 - 12 questions, with time for interviewee to ask questions, plus a tour at the end of their facility.", "Interview Questions": "What is your comfort and experience with presentations? "}, {"date": "17 Mar 2021", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Denver", "Interview Descriptions": "Three rounds, standard interview questions. First was a screening call, then a call with a few individuals from the department and then a final panel interview. Process was all completed in a timely fashion", "Interview Questions": "What are some skills you have that specifically apply to this position? "}, {"date": "6 May 2022", "title": "Research Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Denver (Denver, CO) in Mar 2021", "Interview Descriptions": "Preliminary interview with hiring manager, then full day panel interviews with different departments and then give a seminar. Several follow up meetings. The process took over three months from application to final decision.", "Interview Questions": "Why do you want to work here"}, {"date": "15 Jan 2021", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Colorado Denver", "Interview Descriptions": "The interview took around 20 minutes. In first 5 minutes, Professors talked about the university and the program. Then they asked several questions. Lastly, they asked if I have any questions.", "Interview Questions": "1. talk more about your background 2. research interest 3. career goal 4. why this program versus other programs. 5. will you be a full-time student?"}, {"date": "7 Dec 2022", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Colorado Denver in Jan 2021", "Interview Descriptions": "The interview process was very informal. However, having a recommendation from a teacher helped immensely. I had to apply via application, then write a paragraph why I wanted to be an learning assistant.", "Interview Questions": "Why do you want to be a learning assistant?"}, {"date": "1 Dec 2020", "title": "Transfer Equivalency Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Nov 2020", "Interview Descriptions": "I went through two interviews.  The first interview was with the hiring manager, direct supervisor and an HR rep.  The second one was with the hiring manager and the Director of the Office of Registrar.", "Interview Questions": "Tell us the skills you would bring to this position?"}, {"date": "20 Oct 2020", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Aurora, CO) in Sept 2020", "Interview Descriptions": "One doctor and one HR representative performed the interview on Zoom. They asked about 10 questions and the interview took about 45 minutes but was scheduled to only take 30. They alternated asking the questions and two questions had a follow up question.", "Interview Questions": "How would you adapt to a job in which you are required to multitask and work with many individuals as well as alone on a daily basis?"}, {"date": "15 Oct 2020", "title": "Temporary Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Aug 2020", "Interview Descriptions": "I had two interviews, both on Zoom. The first was with the HR director of the college, the second was with the HR director and two other members of the college administration. During the second, the interviewers rotated through questions. Every bit of communication was a strict form letter, which ultimately made me thankful I didn't receive an offer. It was very impersonal, even after a second interview, and the interviewers alluded to some issues among the staff with new administration. Also I was told that the provost \"doesn't support remote work or learning of any kind,\" so this would have been a fairly high risk position during COVID.", "Interview Questions": "They asked about how I handle situations in which I don't know the answer or process very well."}, {"date": "25 Mar 2022", "title": "Student Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Mar 2020", "Interview Descriptions": "Applied through handshake portal. The standard/basic interview questions were asked that you would expect. Interview took less than 10-15 minutes total. Was asked how long I intended to work there.", "Interview Questions": "Why do you want to work here?\r\nTell us a little bit about yourself?\r\nStrengths?\r\nWeaknesses?"}, {"date": "9 Oct 2019", "title": "Business Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Sept 2019", "Interview Descriptions": "Initial screening via Skype, then about 10 days later 5 interviews back to back via Skype.  Was told I did well and they wanted a full day of interviews with faculty including lunch and dinner meetings.  Waited another 10 days for this to happen and then got a generic email stating they were not going to consider me further.  No details, incredibly unprofessional.", "Interview Questions": "They asked me about my professional background, management style, experience with analytics, and biggest failure. "}], [{"date": "18 Jun 2019", "title": "Advancement Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver", "Interview Descriptions": "Initial phone screening with HR then in person panel interview. The process was slow and the point of contact was a member of the department, not someone from HR. They never reached out in the anticipated time frame and only responded if I reached out first.", "Interview Questions": "Describe your ideal workplace in three words."}, {"date": "26 Apr 2022", "title": "Graduate Research Assistant/Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Apr 2019", "Interview Descriptions": "I was invited to have a full scholarship for being a computer science research assistant in computer science/data science field. They asked me about my previous projects and papers and the topics I like to do my research on.", "Interview Questions": "What projects have you worked on so far?\r\nWhat are the topics that you're interested in for your research study?"}, {"date": "13 Apr 2023", "title": "Admissions Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2019", "Interview Descriptions": "The interview process was simple enough. It was a group interview, multiple of them and just me. Each of them took turns asking me their questions. They were all professional, and friendly, and made me feel comfortable.", "Interview Questions": "Tell us about a time when you handled a negative situation."}, {"date": "6 Oct 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado Denver (Aurora, CO) in Oct 2018", "Interview Descriptions": "I was contacted the day after submitting my resume. Interviewed was scheduled for the next week. Multiple candidates interviewed on the same day. Heard back less than one week later. They were kind but I could tell they had a particular type of person in mind as it was a very small group of just women.", "Interview Questions": "Experience questions and career goal questions. "}, {"date": "14 Nov 2018", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado Denver (Denver, CO) in Oct 2018", "Interview Descriptions": "It went well, but a lot of questions that seemed unnecessary.  The interview was long and had to meet with an entire panel with respect to the position.", "Interview Questions": "What are my goals? "}, {"date": "18 Sept 2018", "title": "Business Service Pro Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Colorado Denver", "Interview Descriptions": "It was easy and a quick turn around. Most employee get transfer between department since alot do not want to train new employees. But usually it will take up to three month to review and hire someone.", "Interview Questions": "Culture was a big factor and how you will work with others. "}, {"date": "14 Nov 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Sept 2018", "Interview Descriptions": "The interview was via zoom. Funded projects were described. They asked about my experience and how I can contribute to the team. You may be receiving a related assignment prior to the interview that you need to complete to demonstrate your ability in the required skills.", "Interview Questions": "was asked about my experience"}, {"date": "30 May 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Jul 2018", "Interview Descriptions": "The process was normal, in-person interview with many questions specific to the department that I was applying for. Applying online was a lengthy requirement and took a day or two of preparation.", "Interview Questions": "Many questions on diversity"}, {"date": "5 Feb 2019", "title": "Research Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Jul 2018", "Interview Descriptions": "I was overlooked for a position at a university where I have been an affiliate for eight years. The hiring process at the institution is not clear and not explained by superiors or advisors or peers.", "Interview Questions": "Do you have a PhD from an ivy league school?"}, {"date": "19 Sept 2018", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Denver, CO) in May 2018", "Interview Descriptions": "University of CU Denver staff are very easy to talk with and willing to use a video call. It was a standard interview, including the \"tell us about yourself\" and \"why are you interested in this position.\"", "Interview Questions": "Describe your research background"}], [{"date": "6 Sept 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in May 2018", "Interview Descriptions": "Two interviews back-to-back. Nothing out of the ordinary. Standard questions about past experience, challenges you may have faced, examples of things you do well, and an overview of the available position.\r\n1.5 hours total.", "Interview Questions": "Tell me about a time you made a mistake, how you dealt with it, and what you may have learned."}, {"date": "28 Apr 2018", "title": "Data Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver", "Interview Descriptions": "My first interview was two weeks after I submitted my application and my final interview was a week after the first interview. They were both pretty standard interviews, and each time I interview with a panel of 3 people", "Interview Questions": "How would your coworkers describe you?"}, {"date": "26 Mar 2018", "title": "Graduate Applicatiton Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Colorado Denver (Denver, CO)", "Interview Descriptions": "Great experience. Kind individuals who were genuinely looking for someone suitable to fill the position. Straightforward, general questions that were easy to answer. Interviewed in a small office with two people.", "Interview Questions": "What is considered as exceptional customer service?"}, {"date": "17 Jul 2022", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Mar 2018", "Interview Descriptions": "Five individuals on the hiring committee. During in person interview, NONE of them even knew the job description. I felt like I was there to entertain them during a government required process. Waste of my time", "Interview Questions": "Why did you apply for the position"}, {"date": "13 Dec 2017", "title": "Human Resources Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver", "Interview Descriptions": "It can be a long process, some positions require 3-4 separate interviews and most of the times there are lots of applicants.  Universities usually take a long time so sometimes they do not get back to you in a timely manner.", "Interview Questions": "4.\tGive me an example of a time when you used your fact-finding skills to gain information needed to solve a problem; then tell me how you analyzed the information and came to a decision."}, {"date": "17 Nov 2017", "title": "Education Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Colorado Denver", "Interview Descriptions": "Applied online and was contacted by phone. It was an initial video interview with a panel. I was later contacted to have an on-campus interview for half the day.", "Interview Questions": "Experience managing volunteers or interns?"}, {"date": "20 Nov 2017", "title": "Billing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Nov 2017", "Interview Descriptions": "The invitation to an interview came about 1-2 weeks after the application submission deadline. \r\n\r\nI just came back from the first interview with three very welcoming ladies and possibly future colleagues. If selected there will be a second interview with three managers.", "Interview Questions": "- What is the difference between debit and credit? \r\n\r\n- When did you have a very stressful situation at work and how did you handle it? \r\n\r\n- Have you had a dissatisfied customer before? How did you handle it and what was the outcome?"}, {"date": "17 Oct 2017", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Oct 2017", "Interview Descriptions": "Very pleasant, professional but casual. I first met with the PI and 2 other lab members. I got to meet the majority of lab members and learned of their projects. Then was asked to take a basic math quiz.", "Interview Questions": "Why did you leave your previous career track?"}, {"date": "29 Sept 2017", "title": "Senior Project Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver", "Interview Descriptions": "Got a call back after a couple of days and scheduled a phone interview. Phone interview was quick (about 10 minutes) but she started to ask me the questions to another position. I asked her what position she was hiring for and realized her mistake. She said she was conducting 11 phone interviews that day and 15 the next. Still waiting to hear back.", "Interview Questions": "What project management software do you use?"}, {"date": "13 Feb 2020", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Sept 2017", "Interview Descriptions": "Sat in front of a panel. The manager emailed me directly for the interview and time. Received an offer two days later.  First I received a verbal offer and then I signed my offer letter on my first day", "Interview Questions": "How have you handled a difficult situation with a coworker? "}], [{"date": "3 Feb 2019", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Mar 2017", "Interview Descriptions": "slow, required at least 7 online references including from all past employers ---even one questionable response and you may not move forward. Request for second interview was rescinded after one of my past references filed online report.", "Interview Questions": "/How do you feel about social media?"}, {"date": "23 Mar 2017", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2017", "Interview Descriptions": "The process took over a month. I interviewed with the PI and the post doc that lasted over an hour. and was scheduled for a second interview right after and then was asked for my reference a couple days later.", "Interview Questions": "How do you extract RNA "}, {"date": "28 Jan 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Colorado Denver", "Interview Descriptions": "The interview process was fairly informal. Questions were mostly relate to previous experiences and skills. A lot was about discussing details about the specific research conducted in the laboratory and the potential projects I was going to be responsible for.", "Interview Questions": "What was my previous experience, what skills I had mastered."}, {"date": "31 Mar 2017", "title": "IT ASSISTANT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Jan 2017", "Interview Descriptions": "Interview was fairly layed back, I got the usual questions. Most questions were about expirience and clarification on my resume. Process was a total of 30 ish minutes and i got an offer at the end", "Interview Questions": "N/A"}, {"date": "16 Dec 2016", "title": "Help Desk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Dec 2016", "Interview Descriptions": "Phone interview. They asked specific questions referencing the position they had posted. The wanted to know if I have talents and experience for the position. They were courteous and forward in what they wanted to know. The questions they asked were understandable in the language they used.", "Interview Questions": "Did I know how to use AD?\r\nWhat would I know in a very busy day?"}, {"date": "23 Aug 2016", "title": "Finance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Aug 2016", "Interview Descriptions": "I applied online and was called to set up an interview a week later. I received an email with information for the interview which stated it would be a screening interview. I interviewed with 3 employees of the department as well as the manager. Interview consisted of them asking questions for 20 minutes and then asking if I had any questions", "Interview Questions": "Tell us about a time you completed a project, but could have had someone else do it for you. "}, {"date": "2 Dec 2016", "title": "ETL Developer - Health Data Compass Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Aug 2016", "Interview Descriptions": "Phone screening (by webex), then had a personal group interview. 6 people interviewed me at once in a room with a big table and white board. The SQL questions ranged from very easy to very very difficult. The questions were VERY abstract and in retrospect, that should have been my first red flag to just leave the interview. At the end of the interview I thought I did very well, and I asked them the next steps in the hiring process. They stated they may do one more round of interviews, or may hire somebody, but, and I say this verbatim:  \"Either way you will hear from us by next Monday.\"  I emailed them a thank you note and literally didn't hear back from them for another 7 weeks. I would NEVER work for a place that flat-out lies to interviewees and has such a poor lack of communication skills. If they called and offered me the job today, as excited as I was to excel at this job, I would never, ever take the job based on their blatant disrespect to me the second after I left the interview.", "Interview Questions": "Gave me a box of legos and had me build a tower as high as I could in 3 minutes that'd hold a cell phone for at least 10 seconds. After I did this they told me to make it higher. Then they had me make it even higher.  "}, {"date": "17 Oct 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Aug 2016", "Interview Descriptions": "Very comfortable and easy. Was introduced to panelists and told to introduce myself.Inquired about my background. Helped me know about the organization and let me speak out about the various experience and my duties in previous jobs. They asked my options about joining the institute and helped me know more about my duties. The process was delightful and pleasant.", "Interview Questions": "Do you have access to finances?"}, {"date": "19 Jul 2016", "title": "Professional Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado Denver (Denver, CO)", "Interview Descriptions": "It was an hour total. I talked about 15 minutes with the PI and then 45 with the lab team. Overall it was a great experience and I was able to gauge the environment and ambiance of the lab. They next said they liked me and would check my references", "Interview Questions": "What kind of experience do you have?"}, {"date": "26 May 2016", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in May 2016", "Interview Descriptions": "There was an online application including resume, cover letter, and 3 professional references. The first interview last a half hour with the principle investigator and the postdoc, then I had a second interview with the business manager.", "Interview Questions": "What are your limitations?"}], [{"date": "20 Feb 2020", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Colorado Denver (Denver, CO) in Jan 2016", "Interview Descriptions": "First round phone or Zoom video conference meeting with a group of interviewers. Second round in-person interview with multiple groups of interviewers. Questions were about basic workplace style, practices, and attitudes/values. From group to group, some of the questions were redundant and also repeated first round questions.", "Interview Questions": "How have you demonstrated a commitment to diversity?"}, {"date": "14 Apr 2017", "title": "Residency Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Jan 2016", "Interview Descriptions": "The first was a short phone interview, the second was an in-person interview with some of the Program Directors I would be working with, the 3rd was the all of the other staff and faculty that I may work with.", "Interview Questions": "Are you able to handle stress well?"}, {"date": "6 Sept 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver (Denver, CO) in Dec 2015", "Interview Descriptions": "There is almost always 2-3 rounds of interviewing. Most likely a search committee and then a supervisor interview and sometimes a presentation that will go with it. Sometimes the hardest part can be making it past the paper round so really make sure you are tailoring your resume and cover letter!", "Interview Questions": "Questions related to your commitment towards inclusion and diversity."}, {"date": "5 Dec 2015", "title": "Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Dec 2015", "Interview Descriptions": "Interview day consisting of 3 attending physician interviews, lunch, hospital tour, and a dinner. Candidates also attending teaching sessions, including morning report and noon conference. Applicants apply through ERAS system with Step 1 (and sometimes Step 2) scores, transcript, and 3-4 letters of recommendation. Applications are due in September and applicants are notified regarding interviews in November - January.", "Interview Questions": "Tell me about an interesting patient encounter."}, {"date": "30 Apr 2019", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Denver (Denver, CO) in Nov 2015", "Interview Descriptions": "I applied as an internal employee from a sister campus. The online application system was easy to navigate and what I would consider standard. After two weeks I received a call to set up an f2f interview with the department chair and tenured faculty. I was not initially offered the job and was reached out to after the original PA moved on to another job.", "Interview Questions": "How would I contribute to making the department a warm and inviting place for students and other visitors. "}, {"date": "19 Oct 2016", "title": "Contracts Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Nov 2015", "Interview Descriptions": "Two rounds of interviews, both are in group settings. The questions are set beforehand and they go over your experience in previous similar jobs or positions. Some of the questions include \"What website do you visit every day?\" and \"What traits do you prefer in a boss and not prefer in a boss?\" There's usually three people per panel (sometimes four) and your supervisor, his/her supervisor are present, a department administrator and perhaps another person in a similar job description will be present.", "Interview Questions": "\"What website do you visit everyday?\"\r\n"}, {"date": "18 Jun 2015", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Colorado Denver", "Interview Descriptions": "The interview was handled professionally and the questions were relevant to the position. It was a phone interview that last around 45 minutes and they gave ample time for questions from the interviewee.", "Interview Questions": "N/A"}, {"date": "2 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Colorado Denver (Denver, CO) in Apr 2015", "Interview Descriptions": "There was basically a  question regarding interest and whether I had my COMIRB certification. Once I confirmed I did, the process was smooth. Within a few hours, I got an email with my first assignment working with another professor.", "Interview Questions": "Why do you want a position here?"}, {"date": "27 Mar 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Colorado Denver (Denver, CO)", "Interview Descriptions": "Several years ago, I interviewed for a RA job in the Department Education. It was obvious that the interview was solely for training purposes for the interviewers (at least that's the only way I could make sense of the ludicrous situation). When it was time for me (the interviewee) to ask questions, none of the 5-panel interview team could even answer what the position would be doing on a daily basis. Some hem/haw, and \"well, we really won't be the ones overseeing this position.\" What????\r\n\r\nThe cost of having 4-5 personnel sitting in a room for hours on end, interviewing potential candidates for a part-time job that only pays ~$15/hour is straight up crazy!  Simple math -- that CU department spent more $$ hiring for the position than they would pay for one year of salary.", "Interview Questions": "Asked all of the cheesy interview questions - straight out of some corporate interview guide."}, {"date": "13 Mar 2015", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver", "Interview Descriptions": "just email contact and reserved an time for phone interview. during interview, just talk in general, and the potential projects. then salary, re location, and benefits etc. The interview last about half an hours, that s it", "Interview Questions": "the research interest, advantage and work type etc"}], [{"date": "3 Mar 2016", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2015", "Interview Descriptions": "Upfront. The interview process was very straightfoward. I applied took the GRE recieved my scores and then got an interview. The interview was tense at the beginning but as they began to understand my experience it became better.", "Interview Questions": "Where do you see yourself with a degree in 10 years."}, {"date": "1 Dec 2015", "title": "AngularJS Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at University of Colorado Denver (Aurora, CO) in Feb 2015", "Interview Descriptions": "Basic technical screening on the fundamentals of AngularJS. The hiring manager made small talk and tried to gauge my personality. It is important to know what controllers, directives, scope, and views are. The position requires that you know how to build a RESTful API. Also knowing Twitter Bootstrap was a plus.", "Interview Questions": "How much experience do you have?"}, {"date": "1 May 2016", "title": "Post Award Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Jan 2015", "Interview Descriptions": "Hard to get in the door because lots of internal hiring. Many computer systems to know. Once you are in, there are many opportunities to move up in the company and learn more about sponsored research and working on a large medical research campus.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Oct 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Colorado Denver (Denver, CO) in Jan 2015", "Interview Descriptions": "two interviews face to face\r\nBackground\r\nAbout yourself\r\nPractical situation handling\r\ntwo interviews face to face\r\nBackground\r\nAbout yourself\r\nPractical situation handling\r\ntwo interviews face to face\r\nBackground\r\nAbout yourself\r\nPractical situation handling\r\ntwo interviews face to face\r\nBackground\r\nAbout yourself\r\nPractical situation handling\r\ntwo interviews face to face\r\nBackground\r\nAbout yourself\r\nPractical situation handling\r\ntwo interviews face to face\r\nBackground\r\nAbout yourself\r\nPractical situation handling", "Interview Questions": "Background\r\nAbout yourself\r\nPractical situation handling"}, {"date": "22 Jul 2017", "title": "Marketing Blogger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Colorado Denver (Denver, CO) in Dec 2014", "Interview Descriptions": "I was asked to submit a video of myself stating why I thought online classes were important. Then we corresponded via online answering questions. Then I was asked to come in to interview in person.", "Interview Questions": "What do you think you would contribute to the team?"}, {"date": "31 May 2014", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Colorado Denver in May 2014", "Interview Descriptions": "Applied online. Was contacted within two days regarding an interview.  The interview was standard and pretty informal. I was shown around the lab space and chatted with the PIs.  Overall interview didn't contain any unexpected or difficult questions. I was asked about my experience with genetics. I was offered and accepted the job a few days after the interview.", "Interview Questions": "N/A"}, {"date": "18 Apr 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Colorado Denver", "Interview Descriptions": "Informal one on one interview focusing on previous research in the group, my skills, my previous experiences and the project that I was going to do. Got asked to present my previous work to the group a few days after, then there was an informal lunch with the group members without the PI. I was offered the job within a couple of days.", "Interview Questions": "Nothing difficult or unexpected"}, {"date": "31 Jul 2015", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver in Apr 2014", "Interview Descriptions": "After applying online, I heard back from the lead research assistant within a few days. Scheduled and had a phone interview with the lab research assistants a week later. Was forwarded to the study PIs, who I had another phone interview with the following week (I lived out of state). One more Skype interview a week later with the research assistants again, and was offered the job a week later.", "Interview Questions": "What are your future goals and plans? "}, {"date": "24 Apr 2014", "title": "Professional Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver in Apr 2014", "Interview Descriptions": "I was contacted one week after submitting my application for a Skype interview. The interview was one week after that. No unexpected questions were asked, the interview was pretty straightforward and lasted 30 minutes.", "Interview Questions": "There were no unexpected or especially difficult questions asked."}, {"date": "12 Mar 2014", "title": "PRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Colorado Denver (Denver, CO)", "Interview Descriptions": "To attain this position I submitted my customized resume, cover letter, references, and sample of my work.  After this, I interviewed with a panel of 6-8 people.  After the interview, I was asked to complete a task.  This took about an hour.  It required analyzing the provided data and writing and executive summary.", "Interview Questions": "N/A"}], [{"date": "3 Feb 2014", "title": "Instructor Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Colorado Denver", "Interview Descriptions": "None", "Interview Questions": "N/A"}, {"date": "14 Nov 2013", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver", "Interview Descriptions": "The hiring process takes a very long time and the interview process did not start until 2 months after I applied. The interview committee was not very technical and the members were rude. There was also no technical test, just a HR qualifications check and then the group interview. There was a short additional final interview but the manager was not really engaged and I got the impression he was going hire me regardless of what I said because they have a high turn over rate and were desperate.", "Interview Questions": "The asked a silly question about office 2003 and 2007 that really didn't matter. The older lady with the bad perfume asked me why I applied, with a really poor attitude. "}, {"date": "7 Dec 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Colorado Denver (Aurora, CO) in Jun 2013", "Interview Descriptions": "contact PI, get hireddo", "Interview Questions": "What do you want to be in 10 yr ?"}, {"date": "28 Oct 2017", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Apr 2013", "Interview Descriptions": "Very easy interview. Felt more like a casual conversation than an actual job interview. Your experience may vary, as I have helped conduct interviews in the past and they were much more rigid and formulaic.", "Interview Questions": "Tell us a time where you had a conflict with a co-worker and how was it resolved?"}, {"date": "26 Feb 2016", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Mar 2013", "Interview Descriptions": "way  to easy, didn't talk about my scientific ability enough, was an in-person interview, professor proceeded to put down all 3 collaborators he works with.  I took position as a temporary paycheck", "Interview Questions": "Do I ski or snowboard"}, {"date": "23 Mar 2016", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Colorado Denver (Denver, CO) in Mar 2013", "Interview Descriptions": "Since it was an hourly position, the interview was much more informal. Only met with one person, who was my supervisor for this position. It was almost an informational interview.", "Interview Questions": "I was given some scenarios on possible interactions with patients."}, {"date": "4 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2013", "Interview Descriptions": "It was easy and smooth. They invited me for an in person interview and asked me questions on why I was interested in the position. They also briefed me on the job description and duties. After 2-3 weeks, they offered me the job! It was overall a one phase interview cycle, which is why the entire process took over a month from interview to hearing about the offer.", "Interview Questions": "Why do you want to be part of an academic institution as a RA?"}, {"date": "14 Dec 2015", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Colorado Denver (Denver, CO) in Aug 2012", "Interview Descriptions": "1) Online application, 2)Phone interview, 3)Video interview, 4) Personal on-site interview, 5) Position offered, 6) Acceptance, 7) Background check, 8) Drug test, 9) Confirmation.  The whole process was rather lengthy with lots of time waiting.  After being on the inside, it's a long and involved process to hire someone.", "Interview Questions": "How do you manage projects?\r\nHow do you handle conflict?\r\nDescribe your management style."}, {"date": "30 Apr 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Aug 2012", "Interview Descriptions": "I had several interview rounds with different Primary Investigators for the clinical trials. Each interviewer was extremely personable and gave a great insight to the job. I was asked to come in on several different occasions to help accommodate other's schedules. They asked basic interview questions, but nothing was out of the ordinary or challenging.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "20 Oct 2015", "title": "Student Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Jun 2012", "Interview Descriptions": "Meet with a manager and a few other student workers; answer interview questions / past history. Was asked things such as what skills I had to offer, and what I expected growth-wise from the position. Pay was lightly discussed, as it is was a entry-level position. However, it was clear that scalability was there after experience was attained.", "Interview Questions": "A parent is wanting information about their son/daughter, do you give them access to that information?"}], [{"date": "25 Aug 2015", "title": "Business Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Jan 2012", "Interview Descriptions": "Easy group interview with laid-back people. Prescribed questions that if you are able to add to should set you apart from other candidates. The hardest part is locating the parking and getting into the building. Once in there is no one to ask so a drive by visit beforehand would help alleviate confusion and tardiness.", "Interview Questions": "Describe a time when you worked with difficult people?"}, {"date": "21 Sept 2015", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Sept 2011", "Interview Descriptions": "An easy process but not always very fair. Due to internal applicants from the university itself a lot of the times, candidates are selected on the basis of personal recommendations and PI recommendations. For international applicants, visa is an issue since most labs don't want to apply for work visa due to cost factor.", "Interview Questions": "Future goals\r\nWhere do u see yourself in 3-5 years\r\nWhy you want to work in this area."}, {"date": "13 Nov 2011", "title": "Campus Security Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Aug 2011", "Interview Descriptions": "I was notified of an interview time and date after applying with Denver University.  I went through a fairly\r\nstandard interview that was primarily about background verification of information on the application.\r\nThen I was given a timed test on a computer.  Watched a video and wrote a written report.  The\r\nposition, interviewer, and work culture was all very positive and professional.  I would highly recommend\r\nthe University of Denver as a place to work.", "Interview Questions": "Ordinary questions about the information on the application and why should they\r\nhire me over other candidates?"}, {"date": "1 Nov 2015", "title": "Professional Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University of Colorado Denver (Aurora, CO) in Jul 2011", "Interview Descriptions": "I was referred by my graduate mentor. I sent the PI my resume directly. Was flown out for an interview within one week. I meet the entire lab, then they showed me the surrounding Denver neighborhoods of places I could potentially live.", "Interview Questions": "Basic behavioral questions and previous work experience."}, {"date": "22 May 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (University of Denver, CO) in Mar 2011", "Interview Descriptions": "Apply online, wait for email invitation to interview, respond by email, attend, answer questions, ask to see the offices involved, withdraw from candidacy, depart, send a follow-up thank you. The chief interviewer liked my resume which is solid.", "Interview Questions": "somewhat similar to are you willing to be servile because it is expected by the women working there. I withdrew from candidacy."}, {"date": "23 Aug 2013", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2011", "Interview Descriptions": "Amazing experience.  Great people to work with.  I felt at home from the moment I walked into the interview.  The interviewers are very personable and I felt as if I was having a conversation rather than a formal interview.  They make sure that they're hiring the right people.", "Interview Questions": "Why should we hire you?"}, {"date": "9 Jul 2015", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Colorado Denver (Denver, CO) in Jan 2011", "Interview Descriptions": "it was 1:1 interview process and  it was wasy and i would rate the overall experience as easy and positive. interview was mainly asked regarding my subjects.it was overall an nice experience.", "Interview Questions": "about subjects"}, {"date": "6 Apr 2012", "title": "Mental Health Specialist for Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at University of Colorado Denver (Aurora, CO) in Jan 2011", "Interview Descriptions": "This was for a promotion within my organization. Networking and knowing the persons hiring directly really helped me in this case, especially since I was an entry level candidate.", "Interview Questions": "What do you know about NAEYC?"}, {"date": "5 Jan 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Colorado Denver (Aurora, CO) in Sept 2010", "Interview Descriptions": "I was contacted via email and scheduled an interview.  Upon showing up everyone was relaxed and in casual clothes.  Interview was fast and the PI did most of the talking.  I was asked about my relevant course-work, interests in science/research, and if I was comfortable working with animals if the occasion arises.", "Interview Questions": "What is a 1 molar solution?  Easy but wasn't expecting it."}, {"date": "6 Jul 2010", "title": "Laboratory Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Colorado Denver (Aurora, CO) in Jun 2010", "Interview Descriptions": "I presented research information, and then spent the rest of the day interviewing with the staff who would oversee my work.  Initial communications were in person.  The lab is casual, and staff seems friendly.", "Interview Questions": "Explain how you would handle personnel problems."}], [{"date": "25 Mar 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Colorado Denver (Denver, CO) in Feb 2010", "Interview Descriptions": "Full day of interviews with about 6-8 professors", "Interview Questions": "All questions were expected and not difficult"}]]