[[{"date": "27 Nov 2022", "title": "Disability Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Turning Point", "Interview Descriptions": "They will ask a questions from Care Certificate. They will want to know how you handle difficulties and how you ensure the Duty of Care being followed. They will be looking into your character.", "Interview Questions": "Why do you want this job? Why do you think you can do this job? How would you support someone with anxiety?"}, {"date": "19 Mar 2022", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Turning Point", "Interview Descriptions": "Swift process great company. It took two weeks to complete the process. I Was picked and told to go\r\nOnto the next stage. Staff very friendly. Recommend the company. Interview questions were also straightforward.", "Interview Questions": "Tell me about yourself, strengths, weaknesses, safeguarding ect"}, {"date": "6 Mar 2022", "title": "Leadership Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Turning Point", "Interview Descriptions": "Interview with Presentation.  I was asked to present a Leadership Development programme and talent management for the organisation\r\nSecond Interview to meet the team and during this process questions were asked on how I will approach different projects.", "Interview Questions": "Presentation on Talent Management Presentation to design and share"}, {"date": "8 Aug 2022", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Turning Point in May 2021", "Interview Descriptions": "Applied through indeed and interviewed via teams due to pandemic in July 2021 with team leaders of two homes. Very friendly and chatty, not too formally dressed, made me feel at ease right from the get go even though the questions were difficult. Very care focused, ask about CQC, QoL, person-centredness.", "Interview Questions": "Do you know what the care quality commission is? How do CQC make sure that services meet the required standards?"}, {"date": "21 Apr 2021", "title": "Youth Recovery Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Turning Point", "Interview Descriptions": "Post adversed online, NHS website.\r\nTwo interviewers, ten questions, chance to ask questions at end. \r\nInterviewers were warm and friendly, and were very open in terms of communication of what was expected and how the questions were going to be asked. Interview was held online via Microsoft teams.", "Interview Questions": "About referrals "}, {"date": "2 Oct 2020", "title": "Mental Health Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Turning Point", "Interview Descriptions": "Interviewed by a panel of staff including the ward manager. The staff were extremely welcoming and friendly. It was one of the best interviews I have done. The interview lasted approx 30 mins. Overall the experience was good.", "Interview Questions": "A patient was invited into the interview room to ask me a question of their choice. He asked how I would support him."}, {"date": "14 Apr 2021", "title": "Outreach Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Turning Point in Sept 2018", "Interview Descriptions": "I applied through NHS jobs and received an interview around 3 weeks after. The interview was in front of a group panel of 3 people. DBS certificate and a criminal background check were mandatory.", "Interview Questions": "How would you react if a service user self-harmed?\r\nTell me how you manage your workload?\r\nWhy do you want this job?\r\nThere were quite a few scenario questions around clients and drug use\r\n\r\n"}, {"date": "22 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Turning Point (London, England) in Aug 2018", "Interview Descriptions": "Interviewees were very nice and friendly. Created a nice environment for the interview. Felt very comfortable about what i was going to be doing and what to expect from my first week.", "Interview Questions": "What attracted me to working for Turning Point"}, {"date": "18 Jan 2021", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Turning Point in Jun 2018", "Interview Descriptions": "A friendly chat with the hiring manager who was lovely to speak to. It was done at the office in Manchester City Centre and I had no issues with this at all.", "Interview Questions": "Questions were centrered around my current benefits package"}, {"date": "25 Nov 2017", "title": "Supported Living Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Turning Point (Basingstoke, England)", "Interview Descriptions": "The interview wasn't bad it was after! The interview was more like a friendly chat rather than am actual interview witch I feel wasn't good specially for the job I was applying for! After the interview I was told that I would find out the following Monday,the Monday came and went, I waited until the Friday after then rang them myself to find that I had to wait even longer because the person I spoke to told me that they have to contact the interviewer for the results, so I waited until the end of following week when I rang them back up again for them to tell me that they still hadn't heard anything! I waited another week, I ring them and finally they'd got back and said was oh you weren't successful on this occasion because of your interpersonal skills but you had great knowledge and understanding of person centred planning/ care and turning points views and ethics. About 7 months after my interview I see the job come up again so I thought I'd go for it I had done a lot of training and shadowing of some very good managers who wanted to help me become a good manager showing me all I needed to know to turn round homes I applied then done some more in-depth research on the home apart from what I already new as I had worked there prior plus still being in contact with staff they would let me know what was happening and the company itself, a week had passed after the closing date I heard nothing from them it was only because I was told they had already found someone and where gonna start there in a few days so thought ok never mind I then saw it come up a 3rd time I applied and again didn't hear anything so applied for the team leaders position they rang and said that I was over qualified and would pass me on further then emailed me and said that they won't be considering my application as I had previously interviewed in the last 12 months and unsuccessful so cancelled my interview for both!!", "Interview Questions": "where did you hear about the job?"}], [{"date": "8 Nov 2017", "title": "Residential Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Turning Point", "Interview Descriptions": "I successfully completed a phone interview and was invited to attend an interview. The interview consisted of a group activity, individual interview and a written assessment. \n\nThe group activity was intimidating because I was working with staff that had worked for the company for years and had previous experience attending interviews.", "Interview Questions": "Why would you be a good candidate for this role?"}, {"date": "23 Aug 2017", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Turning Point (Leicester, England) in Aug 2017", "Interview Descriptions": "Applied online through there website (had seen it advertised on indeed). Had a confirmation email. Within a few weeks, after the closing date I was invited to am interview which was to commence one week post the phone call\r\n It was a 30 minute interview, 6 structured questions asked by a panel of three people", "Interview Questions": "Tell us about yourself "}, {"date": "5 Apr 2016", "title": "Criminal Justice Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Turning Point (Croydon, England) in Mar 2016", "Interview Descriptions": "I was asked 6 Questions by two Managers on the panel.  They both made the effort to help me relax.  They asked me what skills I have to offer the role.  I was also given a scenario  in relation to the role which I enjoyed.  I was asked what I would do if I interviewed someone in the police cells who shared information about his substance misuse and how it was impacting on his personal life.  I then gave the panel the answers around this about what action I would take and how I would manage the feelings of the client.", "Interview Questions": "What made me apply for the job"}, {"date": "4 Feb 2016", "title": "Health Checker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Turning Point", "Interview Descriptions": "After applying online, I received a phone call to book phone Interview. Then, week after the week I got booked a face to face interview with a panel of two. They were quite friendly and work place seemed very  friendly as well.", "Interview Questions": "Tell us about a time where your communicate skills helped you to solve a problem?"}, {"date": "7 Dec 2015", "title": "Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Turning Point in Oct 2015", "Interview Descriptions": "The interview process was short and well organised by the recruitment team. I was contacted one day after submitting my application. Interviewers were impolite and disorganised though, keeping me waiting for half an hour and giving me the sense they were doing me a favour for interviewing me.", "Interview Questions": "Clinical Scenarios.. eg tell us about a conflict/difficult client/colleague"}, {"date": "5 Jul 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Turning Point (Birchington-on-Sea, England) in Sept 2015", "Interview Descriptions": "Phone call which was a 15 minute interview giving you questions on what you think is expected then if successful you were given a face to face interview where you are asked about your experience in healthcare if you get through the next stage is a meet and greet in the place you will be working in", "Interview Questions": "Flexibility on hours"}, {"date": "27 Sept 2016", "title": "Recovery Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Turning Point (Cheltenham, England) in Jan 2014", "Interview Descriptions": "Apply online for vancancies advertised on website. Application goes through to external recruiter who contact you and offer a phone interview. This is a simple screening in/out process. Then invited to a face to face interview.", "Interview Questions": "What is recovery capital and why is it useful to know?"}]]