[[{"date": "10 Mar 2023", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Colorado Christian University in Mar 2023", "Interview Descriptions": "I applied and got an email requesting a zoom interview within 24 hours. The video questions focused mostly on beliefs. There was about 8-10 questions. It gives you about 30s to 1 min to read and prepare your response before it automatically records.", "Interview Questions": "- Did I support the free market and the original intent of the constitution - How did I come to have a relationship with Jesus - How does my teaching and ethics support Jesus mission of life and renewal"}, {"date": "4 Mar 2022", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Colorado Christian University", "Interview Descriptions": "It was very convoluted. I had to interview with 3 different people on zoom to get a job that paid 45k per year. It was also much more impersonal than I was being led to believe. Training was very extensive, about three weeks", "Interview Questions": "How to handle difficult scenarios in the workplace."}, {"date": "4 Sept 2020", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Colorado Christian University", "Interview Descriptions": "Intensive, 5-step process:  Recorded Interview, Live Panel with 3 directors (mock student call), Zoom call with Assistant VP of enrollment, Zoom call with HR, Phone Call with VP of enrollment.", "Interview Questions": "What do you think of sales? Describe a time when working interdepartmentally that a colleague let you down. Describe your former supervisor. Share your testimony. What is your faith like right now? "}, {"date": "8 Jul 2020", "title": "Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Christian University", "Interview Descriptions": "Received an email to complete an online video interview that was electronically administered (it appeared to be a screening interview of sorts). Questions varied. Received an email that I didn't advance.", "Interview Questions": "What is your teaching style"}, {"date": "16 Jan 2020", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado Christian University in Jan 2020", "Interview Descriptions": "They were very nice. The interview took place over the phone and they allowed me space to get back on track when I needed to. As long as you relax and be yourself, that's all that matters.", "Interview Questions": "What's one word you think of when you think of sales? "}, {"date": "5 Nov 2021", "title": "Adjuct Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado Christian University (Denver, CO) in Jan 2020", "Interview Descriptions": "The video interview I prepped for by practicing job-related questions was only a review of my religious beliefs and its alignment with evangelical Christianity which was not mentioned when they requested the video interview.", "Interview Questions": "How do I feel about the US Bill of Rights"}, {"date": "9 Dec 2020", "title": "Enrollement Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Colorado Christian University (Jacksonville, FL) in Dec 2019", "Interview Descriptions": "Very intense process.  The interview process was a span over a period of 3 months.  The first interview was a recorded interview, if you were chosen from the record video the next interview process is with a panel of 3.  Next, you will have two zoom meetings with Human Resources and VP of enrollment.", "Interview Questions": "Please tell me about yourself."}, {"date": "4 Jul 2019", "title": "Field Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Colorado Christian University (Remote, OR)", "Interview Descriptions": "I applied online and received a very quick invitation to complete a video interview.  I was not asked anything about my experience, professional skills or expertise. All of the questions focused upon my faith (traditional evangelical Christian).  I was rejected based upon a one-way video interview with approximately 12 minutes of responses. Seems like a very limited way to get to know prospective members of your team.", "Interview Questions": "What is my view of the sanctity of life?  How do I see the Lord working in my life today?  Describe my conversion experience."}, {"date": "20 May 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Colorado Christian University", "Interview Descriptions": "The Dean of their business school asked me, a job candidate (not a paid employee), to find out the cost of living in Denver area for several years so he could lobby the President to increase their salary, because “faculty salary increases have NOT kept pace with Denver Metro’s COL.” (COL is the cost of living). This is a direct quota from his email. \r\nThis tell us three things:\r\n1.\tNone of the entire business faculty members know how perform this simple task—the homework problem I assign to my own undergraduate business students. \r\n2.\tThe President is not the most generous person you can find.\r\n3.\tThe school is unethical—they asked for free service from a job candidate because they are at the upper hand.", "Interview Questions": "What do you say to a student if he tells you he is gay? "}, {"date": "29 Jul 2019", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colorado Christian University in Jan 2019", "Interview Descriptions": "You meet personally with Lynda and she gives you typical interview questions and is very welcoming. You are encouraged to just be yourself when talking to her and there is no persona you have to put on. She gives you a clear outline of what is expected to make sure it is something you can/want to do.", "Interview Questions": "What experience do you have?"}], [{"date": "5 Sept 2020", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado Christian University (Denver, CO) in Jan 2018", "Interview Descriptions": "It was a great experience. Every interaction throughout the interview process was positive. Mission and visions was consistent among all departments, and levels of leadership. Appreciated the transparency and consistency of the identity of the university and appreciated that they knew who they were and were unapologetic about what they believed.", "Interview Questions": "Why I wanted to work for the University?"}, {"date": "13 Oct 2016", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Colorado Christian University (Northglenn, CO)", "Interview Descriptions": "Looking more at Christian character and personality than experience. First, they will send you a request for a video interview where you record your answers. A week later, you will meet with your manager. You will meet with HR later that day or later that week.", "Interview Questions": "1. How do you handle rejection?\r\n2. Do you have sales experience?\r\n3. What does team work look like for you?\r\n\r\nFor HR:\r\nDefining the core Christian values, such as traditional family, homosexuality, abortion, etc. might ask about free markets too... All values can be found on website"}, {"date": "14 Jan 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado Christian University (Lakewood, CO)", "Interview Descriptions": "Very lengthy and detailed. Be prepared to wait weeks for an answer. Meeting different individuals from different departments. The university wants to hire the \"right\" people and therefore has multiple individuals involved in the process, which is a good and a bad thing. The good is that hopefully the organization succeeded in finding the right candidate that will fit into the organization, and the bad is that quality educators and staff may not meet every single little detail are being turned away.", "Interview Questions": "What is your view of Christianity? \r\nWhen did you accept God into your life?\r\nHow do you feel about homosexuality?\r\nHow do you feel about abortion?"}, {"date": "13 Oct 2015", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Colorado Christian University (Denver, CO)", "Interview Descriptions": "The interview process was unclear and long. I was not aware of how the entire process would go nor what each subsequent step meant in the entire process. I asked, but often did not get clear answers. In the end, it appeared that the institution was more interested in filling a cog in their growing wheel than me personally. There was no room to discuss the offer that was placed on the table. I learned from such to ask about future offers, but it was disappointing to go through the long process only to have it not work out.", "Interview Questions": "What are my beliefs on (insert various controversial topics) and to explain my faith?"}, {"date": "21 Jan 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Christian University", "Interview Descriptions": "There are two interviews. One to assess your business fit and the other to assess your spiritual fit. You may be required to interview up to three times for the position.", "Interview Questions": "Questions regarding your personal and spiritual beliefs regarding homosexuality, abortion and your Christian walk.."}, {"date": "24 Apr 2017", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Christian University (Denver, CO) in Jun 2014", "Interview Descriptions": "Met with the team and ended up giving a presentation to all staff. Met with a lot of different people from the school. They flew me out to Denver for the in person interview.", "Interview Questions": "If I would be willing to travel. "}, {"date": "21 Aug 2015", "title": "Employee Benefits Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Colorado Christian University (Lakewood, CO) in Sept 2012", "Interview Descriptions": "Phone interview for initial screening, then meeting with the entire team at a Starbucks. Great people to interact with, very helpful and non-threatening. Final sign off was a quick meeting with the department VP, again extremely friendly and great to meet with. There was a web based excel test as well that was done between meeting people. Final piece was over a late lunch with the dept. director, offer was extended there.", "Interview Questions": "Describe a time when you overcame a poor employee interaction to achieve a desirable outcome."}, {"date": "18 Jul 2015", "title": "Affiliate Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Christian University (Lakewood, CO) in Jan 2011", "Interview Descriptions": "The process was standard--typical questions and of course, some questions about personal faith and beliefs.  It was initially with the Dean of the school I was interviewing for and then the manager of the online programs.", "Interview Questions": "How will you handle a difficult student?"}]]