[[{"date": "3 Jun 2023", "title": "Compliance Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Preferred Family Healthcare (Atlanta, MO) in May 2023", "Interview Descriptions": "I was told that I have all the right QUALIFICATIONS. Then told (wink wink) I am the wrong sex and race. I was told I was not the perfect team member. I am the wrong sex and color. This company is racist and violates the whole 64 Civil Rights Policy. IF YOU ARE AN EDUCATED WHITE MAN, STAY AWAY, THEY WONT HIRE YOU.", "Interview Questions": "Q; Where do I live?"}, {"date": "19 Apr 2023", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Preferred Family Healthcare", "Interview Descriptions": "Easy going and laid back. Made it easy to discuss beliefs and thoughts. Directors were great and supervisors made the interview easy going. Overall found the interview process to be easy", "Interview Questions": "What are your thoughts on SUD counseling?"}, {"date": "24 Mar 2022", "title": "Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Preferred Family Healthcare in Mar 2022", "Interview Descriptions": "They called back the day they received my application. Three days later,  I was interviewed and offered a position. The interview process was more of them asking for me to work for them versus figuring out my fit and abilities.", "Interview Questions": "What are your strengths and weaknesses?\r\nThat was basically it. "}, {"date": "26 Nov 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Preferred Family Healthcare in Nov 2021", "Interview Descriptions": "The interview process was very relaxed and genuine. It felt more like a conversation than a formal interview.  The interviewers had a sense of humor so it was easy to open up and be totally honest.", "Interview Questions": "What skills would you bring to this role beyond the technical? "}, {"date": "1 Oct 2019", "title": "Outreach Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Preferred Family Healthcare", "Interview Descriptions": "very informal interview, which caught me off guard cause I was ready for the standard interview questions. was over an hour long. I had 3 different people call me after the interview which gave me the impression there is not good communication among the people there.", "Interview Questions": "what is your background?"}, {"date": "14 Jul 2018", "title": "Clinical Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Preferred Family Healthcare (Saint Louis, MO) in Jun 2018", "Interview Descriptions": "Met with Clinical Director and another Clinical Supervisor, had second interview meeting with same Clinical Director and Regional VP. The process took approximately 4 weeks but there was good contact via email during.", "Interview Questions": "Routine questions regarding experience and behavioral based questions. I.e. How would you handle a stressful situation. "}, {"date": "21 Mar 2018", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Preferred Family Healthcare (Saint Louis, MO)", "Interview Descriptions": "I was interviewed by two managing staff.  Interview was nice.  Felt more like a conversation, which is great.  Only thing is I wish the pay would have been discussed.", "Interview Questions": "Preferred method(s) of therapy."}, {"date": "26 Apr 2017", "title": "Associate Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Preferred Family Healthcare (Saint Louis, MO) in Apr 2017", "Interview Descriptions": "Very professional, upfront about the possible change from full-time to part time in the position. Easy to find and were prompt in making a return call. Still waiting to hear back", "Interview Questions": "How have you dealt with resistant clients?"}, {"date": "19 Apr 2019", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Preferred Family Healthcare (Kansas City, MO) in Jan 2017", "Interview Descriptions": "The interview process was pretty straight forward, questions centered around past work experience and some situational questions, in total the interview lasted about 45 minutes. Four days later they contacted me via email and offered me the position.", "Interview Questions": "How would you handle two clients that are starting to become aggressive toward each other, in order to diffuse the situation before it becomes physical? "}, {"date": "10 Jun 2017", "title": "Youth Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Preferred Family Healthcare in Nov 2016", "Interview Descriptions": "After submitting your resume they called within the week to schedule an in person interview. Interview is with a couple of people in management and very laid back. They asked a variety of questions mostly focusing on how you react in situations rather than your background or work history.", "Interview Questions": "How do you handle situations with people acting unethically? "}], [{"date": "25 Sept 2016", "title": "Substance Abuse Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Preferred Family Healthcare (Saint Louis, MO)", "Interview Descriptions": "Called someone I knew who was working at Bridgeway in St Louis and was told there was an opening, I applied on line noting I knew someone there and I received a call the following week to set up a one on one interview. My friend told me that  Bridgeway offers $100 if a person staff refers , the person is hired and competes the three month review period.", "Interview Questions": "Typical questions for substance abuse like describe what addiction is, how you you respond if you saw a co worker breaking the ethics code, what counseling style do you use the most."}, {"date": "19 Feb 2016", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Preferred Family Healthcare (Kirksville, MO) in Jan 2016", "Interview Descriptions": "Questions in regards to knowledge of Substance abuse disorders. Very Friendly and provided lots of information to assist in making a decision.  I thought it was a relaxed interview for the process and the questions were relevant to the position.", "Interview Questions": "Do you know what comorbid means?"}, {"date": "24 Nov 2015", "title": "Behavioral Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Preferred Family Healthcare (Kirksville, MO) in Nov 2015", "Interview Descriptions": "I filled out an application online and attached a resume. About a week later I got a call and set up an interview. The interview was with someone from the department I had applied for, not HR. \"This is going to be easiest and most laid back interview you've ever had,\" was the first thing he told me. The questions he asked were ones that he had created. They were so easy. After he asked me the questions, he rambled about his experiences working for the company. The interview lasted two hours because he wouldn't stop talking. It was the weirdest interview ever. I felt like I did really well, I was very qualified for the job. He said he would call the next day and two weeks later I've heard nothing. The position is still open though, so technically not a \"no\" yet. He did say the position would be $10 an hour and the shift was 4pm to 12pm. The person interviewing me was unprofessional and scatter-brained.", "Interview Questions": "How would you handle conflict with consumers?"}, {"date": "24 Sept 2015", "title": "Provider Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Preferred Family Healthcare (Springfield, MO)", "Interview Descriptions": "Easy. I had a lot of direct care experience. They questions were mostly typical interview questions. The hiring process was easy. You spend the entire first day reading over policies and procedures and filling out paperwork.", "Interview Questions": "How would it personally effect you if a client had beliefs were contrary to your core beliefs? How would that impact your treatment of your clients?"}, {"date": "23 Sept 2016", "title": "Family Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Preferred Family Healthcare in Jun 2015", "Interview Descriptions": "The agency was not in a hurry and this was frustrating. I interviewed and was not given a final answer for almost a month. The supervisor did not keep me informed on hiring procedure and process.", "Interview Questions": "They asked scenarios about how I would respond in crisis type situations. "}, {"date": "11 Aug 2016", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Preferred Family Healthcare (Saint Louis, MO) in Jun 2015", "Interview Descriptions": "I applied online through the PFH website and asked a contact I had within the company to forward my resume to the clinical supervisor of the site for which I was applying. I received a call from the clinical supervisor and scheduled a one on one interview. I was offered the position shortly thereafter.", "Interview Questions": "How do you handle stressful situations? Provide example of stressful situation you have had to resolve and what techniques you used to handle it properly."}, {"date": "21 Apr 2016", "title": "Multiple Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Preferred Family Healthcare (Saint Louis, MO) in May 2015", "Interview Descriptions": "Unorganized, informal, staff were friendly and gave a lot of information about the different jobs available. Was confusing on what the follow up prices would be. Good at answering questions and sharing details about benefits and hours", "Interview Questions": "Why I would be a good fit for this company"}, {"date": "3 Mar 2015", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Preferred Family Healthcare", "Interview Descriptions": "Met with the Program supervisor of the Adult residential program in Jefferson City.  The supervisor stated that I would meet later with the Clinical supervisor, which did not happen.  I was offered the position about a week later.  It was not as intense of an interview as I thought that it would have been, which I was 8 month pregnant at the time as well.  Thought that it would be little harder for me to get a job since I was that far into my pregnancy.", "Interview Questions": "Do you know how to write a treatment plan?"}, {"date": "15 Apr 2016", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Preferred Family Healthcare (Saint Louis, MO) in Apr 2014", "Interview Descriptions": "One on One, question and answer session for 10-15 minutes.  The interview was interested in candidates background with substance abuse and what were my future plans for myself and the agency.", "Interview Questions": "When can you start."}, {"date": "28 Feb 2014", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Preferred Family Healthcare", "Interview Descriptions": "My interview experience was fairly laid back, which I loved. The particular individual I interviewed with was an extremely nice person and made me feel right at home. The questions that I was asked seemed to be fairly typical interview questions. Compared to other interviews I have had, this one ranked easy to average.", "Interview Questions": "I wasn't presented with any unexpected questions for the position I was applying for. "}], [{"date": "27 Jun 2014", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Preferred Family Healthcare (Kansas City, MO) in Oct 2010", "Interview Descriptions": "very quick and straight to the point. You will mostly be asked about group experiences and ideas and how would you be able to handle difficult groups.  What they don't prepare you for is working with gossiping Co-Workers and poor management who do no follow through with the policies of the company, which is something that you may have to learn on the job.", "Interview Questions": "How to control a difficult group"}]]