[[{"date": "11 Jul 2023", "title": "Digital Content Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Children's Society (London, England) in Jun 2023", "Interview Descriptions": "Great as through a portal. The interview was more based on the practicality of the job. I was surprised that there were little questions to show personality and passion for the cause. Very glad I didn't get an offer as my first impressions were not great.", "Interview Questions": "Give us an example of where you used XYZ to reach XYZ."}, {"date": "23 Nov 2022", "title": "Shop Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Children's Society", "Interview Descriptions": "A 2 stage anonymous job application process is used. This means selection is based only on the skills, knowledge and experience a candidate could bring to the organisation. Interview Structure: • Standard interview questions • SA interview assessment • SWOT analysis of the shop to be completed by candidates for presentation on the day.", "Interview Questions": "How would you deal with difficult customers?"}, {"date": "24 May 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Children's Society", "Interview Descriptions": "Quick and friendly, 2 stages of interview and no tasks or presentations necessary. I heard back quickly after the interview and did not have to chase them up. All good", "Interview Questions": "My knowledge about local welfare assistance"}, {"date": "1 Mar 2022", "title": "Project Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Children's Society", "Interview Descriptions": "An agency found my the job and got me an interview with both the Project Manager and BA. Both asked a series of behavioral and competency based questions in addition to a breakdown of my work experiences pertaining to the role.", "Interview Questions": "Tell me about yourself and your experiences?"}, {"date": "18 Oct 2021", "title": "Digital Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Children's Society (London, England)", "Interview Descriptions": "There was only one interview, 1.5hrs long broken into two sections. First section was your standard interview format, and the second section was a written Project Management task. The interviewers were friendly and professional. \n\nThere were plenty of opportunities to ask questions. The only thing to consider changing  is having some culture related interview questions, so you can get a feel for if you would fit within the working culture.", "Interview Questions": "Tell us about your experience managing lots of stakeholders"}, {"date": "18 Aug 2021", "title": "Emotional Health and Well-being Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Children's Society", "Interview Descriptions": "The two interviewers made me feel very comfortable and at ease. They asked 9 questions in total and although some of them were ones I hadn’t prepared for , they were very lenient with giving me time to think about my answers", "Interview Questions": "- If a child had a swollen eye and was more reserved during your 1:1, how do you get them to open up more ? "}, {"date": "6 Jul 2021", "title": "Data Services Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at The Children's Society (London, England) in Nov 2020", "Interview Descriptions": "Had to do a written test on databases, database logic, example data scenarios and technical  SQL Scripting examples and questions on SQL Server.\r\n\r\nThe interview itself was a three panel interview. The panel asked good and fair questions.", "Interview Questions": "How would you select the top 25 rows across 2 tables."}, {"date": "14 Oct 2019", "title": "Administrative Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Children's Society (London, England)", "Interview Descriptions": "Applied online - Email with interview date/time - interview in London with the project director and another administration manager from another project.  I was emailed with the outcome that same week and also had feedback.", "Interview Questions": "Why are you applying to our Charity?"}, {"date": "13 Jun 2019", "title": "Refugee and Migrant Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Children's Society", "Interview Descriptions": "1) case-study question: given a scenario with some questions and 30 minutes of alone time to answer the questions\r\n2) pre-prepared 10 minute presentation\r\n3) hour ish long interview \r\n\r\nThe two interviewers were very friendly. I was nervous but they reassured me a lot. I didn't get the job but they called and gave me very good and useful feedback. Definitely had a lot of respect for their candidates.", "Interview Questions": "How would you retain volunteers?"}, {"date": "25 Jul 2018", "title": "Programmer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Children's Society", "Interview Descriptions": "I had a 45 minute interview with two people in the Children's Society's Newcastle office. The interview consisted  primarily behavioral questions. They switched off asking questions, and were overall kind and polite.", "Interview Questions": "If you were with a child who showed signs of abuse, how would you handle the situation?"}], [{"date": "29 Jan 2018", "title": "Project Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Children's Society (Preston, North West England, England) in Jan 2018", "Interview Descriptions": "The interview took place in Preston. I had 15 minutes to complete a safeguarding assessment where I had to read a short paragraph case study and then answer three questions about it. As I was applying for a role as a Safe Families Project Worker the case study was about an unaccompanied refugee minor. After I completed the assessment I was interviewed by two people, who were really nice and personable. They asked me to read out what I had written as answers to the assessment questions, then asked me 7 interview questions and then allowed me to ask any questions I had. All in all it was a good environment for interview and they obviously want there candidates to feel comfortable and able to do their best.", "Interview Questions": "What is your understanding of multi-agency partnerships?"}, {"date": "20 Nov 2016", "title": "Refugee and Migrant Service Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Children's Society (London, England) in Sept 2016", "Interview Descriptions": "Panel, around 1,5 hours\r\nWritten test for around 30 min \r\nPresentation of answers to the test and questions around 1 hour\r\n\r\nThe panel encouraged to take time in order to prepare answers to the questions. That was helpful because questions were more of a problem-solving type and required some time to come up with an answer. \r\n\r\nThe reply was within several weeks from the interview. The manager informed that I can request the detailed feedback on my performance at the interview. I did that, but no feedback ensued )", "Interview Questions": "For example, What would you do if an asylum seeker complains to you about your organisation's volunteer?"}, {"date": "21 Jul 2015", "title": "Project Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Children's Society (London, England) in Jul 2015", "Interview Descriptions": "The process was simple and comprehensive. A panel of two executives interviewed me.The interview was planned for 1.5 hours and they took exactly that time, not a minute more not a minute less!\r\nFirst 1 hour:  Relevant experience in previous jobs was discussed, facing a challenge and how I overcame that challenge, if I underwent organizational change during my career and how I coped with change, an instance where I went over and above my job duties and why.\r\n\r\nAfter this, an aptitude test was administered, it was timed, 50 questions to be answered in 30 minutes. The results were not shared though! \r\n\r\nI received a call exactly a week later and was offered the position!", "Interview Questions": "Relevant experience in previous jobs was discussed, facing a challenge and how I overcame that challenge, if I underwent organizational change during my career and how I coped with change, an instance where I went over and above my job duties and why."}]]