[[{"date": "31 May 2023", "title": "Medical Scheduler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "Basically told me I was over qualified after having surgical medical experience, gave me a list of interview questions to prepare for and did not ask a single one, got back to me late on their decision and didn't feel warm or friendly over the phone.", "Interview Questions": "Name a time where you had to change processes."}, {"date": "12 May 2022", "title": "Authorization Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Dec 2021", "Interview Descriptions": "They interview is based on the company's value. One question from  each category. About 4-5 core questions. A tip is a learn the company's value, missions and goals and think about how you can relate to them.", "Interview Questions": "If you have a conflict with a team member how do you deal with it?"}, {"date": "14 Oct 2021", "title": "Call Center Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Park Nicollet Health Services", "Interview Descriptions": "Straightforward and standard questions for the interview process. The representative was friendly and easy to speak with, allowing for a more relaxed interview to take place. I sent a follow-up email afterwards however am waiting on a reply for position update.", "Interview Questions": "Description of a difficult or challenging event & how did you manage it?"}, {"date": "15 Sept 2021", "title": "Nursing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "The interview process was as to be expected. Be confident and comfortable in your responses and enjoy the opportunity to be welcomed to the company. Continue to research all the listings they have available.", "Interview Questions": "Why do you want to become a nurse?"}, {"date": "30 Mar 2021", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Park Nicollet Health Services", "Interview Descriptions": "The recruiter I spoke with on the phone was detailed and answered all of my question. I really enjoyed speaking with my interviewer. I was notified that I was not selected for the position in a timely manner.", "Interview Questions": "Explain how you would you go about planning and executing a video shoot?"}, {"date": "9 Jan 2021", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "After emailing a recruiter with questions about the job posting and never receiving a response, I blindly applied for a job with minimal details. I was later contacted for a phone screening and was asked to provide dates/times that would work, which I did. Then, one day, the recruiter sent an email asking if she could call me in an hour. Having worked the night shift, I was asleep. Rather than waiting for a response to the email, she called and woke me up, conducting the screening while I was half asleep.", "Interview Questions": "Why do you want to work in this specialty? What does this specialty area mean to you in regard to the type of patients you would see?"}, {"date": "12 Jan 2021", "title": "Inventory Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Dec 2020", "Interview Descriptions": "Phone interview with recruiter, then met with the supervisor of the department in person. Went well. Friendly people. Questions were pretty typical and a bit repetitive from the original call with recruiter.", "Interview Questions": "Tell me how you handle ambiguity in the office place? "}, {"date": "5 Mar 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "First had a phone interview, asked a few basic interview questions. After the phone interview that information then went to the hiring manager who then reached out to offer an in-person interview. In-person interview asks basic questions, tour of the facility interviewing and lasted about 45 min. Estimated length between interview and offer to be made about a week and a half. Currently still waiting to see if I am going to get an offer.", "Interview Questions": "What do you look for in an organization?"}, {"date": "27 Sept 2020", "title": "Claims Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services (Saint Louis Park, MN) in Nov 2019", "Interview Descriptions": "All situational questions .  Didn’t go through my resume.  Ask about on boarding and training.  Beginning was ok.  Ask a lot of questions from time off, to start times, and raises.  They skipped over all that information.", "Interview Questions": "How do you handle tough calls. "}, {"date": "24 Jun 2019", "title": "Medical Receptionist Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "I received an email to set up a phone interview about a week after I had applied online. Questions were very simple and straightforward. I received an email about an hour later requesting I come in for an in-person interview. I scheduled to do so the following day, and the interview was 1:1 with who would be my manager. Questions were fairly difficult, I was asked 10 behavioral/situational questions that definitely required some thinking regarding my leadership experience, how I transition well into leadership positions, how I handle not getting along with coworkers, etc. Two days later, I received a final interview request via email. The interview was scheduled for early the following week. This interview was panel style, where I was interviewed by two other managers from other departments as well as the original interviewer. This interview was short and asked more in-depth questions regarding my resume and management style. There was allotted time for me to ask questions as well. I received an offer via phone 3 days later. Following the offer, there is a mandatory background check and employee health screening (including TB blood test).", "Interview Questions": "Tell me about a time you were part of an excellent team, what made this team so successful?"}], [{"date": "18 Apr 2019", "title": "Financial Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Apr 2019", "Interview Descriptions": "I submitted an online application with my resume (no cover letter required) and got an email from an HR recruiter within one business day to set up a phone interview, which was a few days later in the morning. That afternoon, the same day as the phone screen, I received a phone call from the supervisor for an on-site interview, which was a few days later, also in the morning. The same afternoon as that, the HR recruiter reached out by phone with an offer.", "Interview Questions": "When you are new to a job, how do you find out how things *really* get done?"}, {"date": "7 May 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Park Nicollet Health Services (New York, NY) in Sept 2018", "Interview Descriptions": "Phone interview with recruiter. Then in-person with leads of department and clinics. I had about 3 interviews until I was offered a position. Looking back I am happy with their decision to interview me multiple times, besides the fact you would never hear back from the ones that rejected you. Regular interview questions and a tour of each department. I was also able to shadow a LPN before I accepted their offer.", "Interview Questions": "what would you do if you had an upset patient?"}, {"date": "2 Jun 2018", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "Submitted resume on company website. About 4 weeks later received email from HR. Had phone interview with HR and then was invited to interview in person with PT supervisor and manager. Phone interview was 15 min. In person was 2 hours including tour. Everyone was extremely nice and the entire process was professional without being intimidating. Interview included basic get to know you things as well as behavioral based questions. HR called 1 week after in person interview with job offer.", "Interview Questions": "Describe a time where you had to challenge authority. How did you handle the situation? Would you change how you handled the situation?"}, {"date": "29 Aug 2020", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services in Jan 2018", "Interview Descriptions": "Easy going and very friendly. They had a new position and wanted to have a lot of feedback from the hire. The interview was a panel of three but they didn't make it nerve racking.", "Interview Questions": "why do you want to work for Park Nicollet?"}, {"date": "16 Nov 2020", "title": "Health Unit Coordinator (HUC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jan 2018", "Interview Descriptions": "phone interview, in person interview, job offer.  The process was smooth and I have no complaints. There was a lot of company based training but I think this has changed with Covid.", "Interview Questions": "Basic behavioral questions were asked"}, {"date": "18 Jul 2017", "title": "Associate Patient Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in May 2017", "Interview Descriptions": "Interviewed with CNO, 2 HR representatives, 3 Clinical Nurse Directors, 3 unit nurse managers during first interview. Called back to meet with Medical Director and Nurse Educator and staff panel. Behavioral questions were intense, definitely need to do your homework to be prepared.", "Interview Questions": "Explain a time when you dealt with conflict between a peer/coworker?"}, {"date": "24 Mar 2017", "title": "Claims Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "2 people telling you about positions they have in their department. Medicare department and Claims Denials. They both take turns asking 5 behavior questions and they are pretty in depth, ones you wont be prepared for!", "Interview Questions": "Expalin a time when you had to challenge authority?"}, {"date": "11 Feb 2017", "title": "Triage Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Dec 2016", "Interview Descriptions": "I received a telephone call from HR representative after applying for a certain position.  I was told that the position had been filled internally but asked if I would be interested in another available position.  I was advised to look at the position and call back if interested in it which I did.  I then scheduled a phone interview with the HR representative which lasted about 30 minutes.  A few days later I received a phone call from the hiring manager to schedule a in person interview with 3 of the department managers and director.", "Interview Questions": "How would I expect to use my previous pediatric nurse experience in the position that would cover all age groups?\r\n"}, {"date": "10 Sept 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Park Nicollet Health Services", "Interview Descriptions": "HR called for an initial interview, it went good and she passed my information on to the supervisor for that specific site. They than contacted me to set up an interview with 3 other she worked with. Set up another interview with 2 of the same people plus another 3(making it me interviewing with 5 staff members). HR than contacted me a few hours later offering me the position.", "Interview Questions": "How do you handle negative feedback"}, {"date": "9 Jul 2016", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "I was called for a phone interview with Human Resources.  They scheduled the phone interview for a different day and were willing to work around my schedule. Once I passed that they followed with an in person interview in the department with which I applied", "Interview Questions": "Tell me about a time when you were surprised by negative feedback you received"}], [{"date": "12 Feb 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jun 2016", "Interview Descriptions": "At first intimidating but then easy going. The interviewers were nice, a lot of behavioral questions. And scenarios, also they would like some experience. Which I had from a non-skilled nursing home.", "Interview Questions": "Are you a certified nursing assistant?"}, {"date": "7 Jun 2016", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Park Nicollet Health Services (Robbinsdale, MN) in Jan 2016", "Interview Descriptions": "I was interviewed for a Pharmacy Tech position by the Pharmacy Manager.  He gave me a whole 10 minutes and we didn't even sit down!  I didn't even get a chance to show him my state pharmacy certification form!  I thought I was not given a fair interview at all and it was terribly unprofessional.", "Interview Questions": "Why do you want to work here? What is your availability (for work hours)?"}, {"date": "3 Nov 2015", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Oct 2015", "Interview Descriptions": "Someone will call for an interview. the interview consist about 30 to 40 mins. Question base interview. After two weeks they will send an email to confirm the next process. After phone interview the manager will contact you for a in person interview. the in-person interview was short and simple with about 4 to 5 questions. If you're lucky you get to look around at the facility", "Interview Questions": "what are your strength and weakness"}, {"date": "20 Aug 2015", "title": "Private Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN)", "Interview Descriptions": "There was an initial telephone interview with a follow up interview with department management.  HR was not familiar with the job I was applying for, which made the telephone interview difficult as the examples I used were job specific.  I spent a lot of time explaining the background to my answer.  The department level interview was engaging.", "Interview Questions": "Describe a difficult situation which you handled effectively."}, {"date": "25 Jul 2015", "title": "Vascular Ultrasound Technolgosit Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN)", "Interview Descriptions": "The in person interview process consisted of 3 parts: meeting with the lead tech, observing a tech scan a patient, and being interviewed by the technologists.\r\nWhen I met with the lead tech, she only asked me about 4 questions.  I was able to elaborate on them to provide details; however, I was surprised by the lack of questions.\r\nObserving a scan went fine and was simply watching a scan to see if you liked what you saw - no questions for you here.\r\nI was disappointed when I met with the techs.  They didn't have time to actually meet with me.  They were busy working and some were busy chatting with each other.  So essentially, I was able to introduce myself to all of them and let them know my current position, but they were too busy to actually get to know me.  At other interviews I've had, they've set aside time for this and took turns asking a series of formal interview questions. \r\nI was told that the decision was made by a vote by all of the technologists.   I got the feeling that they already had someone in mind and this was just a formality - the techs just weren't that interested in hearing what I had to say.", "Interview Questions": "How would you handle a difficult patient/situation?\r\nStrengths/weaknesses?"}, {"date": "5 Aug 2015", "title": "Administrative Billing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jul 2015", "Interview Descriptions": "I enjoyed the interview process quite a bit, it was less traditional than expected, at least after the initial phone screen interview with the recruiter. The interviewers at the in-person interview asked more about situations I've encountered and how I dealt with them and less about specific job details. It was conversational instead of feeling like an interrogation. I was given the opportunity to ask questions along the way, and benefits were thoroughly explained too.", "Interview Questions": "Tell us about a situation when you had a conflict with another person at work, and what you did about it. How did you feel about it?"}, {"date": "19 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jun 2015", "Interview Descriptions": "Was interviewed by the department manager and two daytime supervisors about my skills and previous experience. We reviewed all my jobs for the past twenty years.  I was questioned by everyone in the room.", "Interview Questions": "They asked about my filing skills and calendar management. "}, {"date": "3 May 2015", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "panel interviewing multiple times. bring you back more than once. kind if intimidating. whole process takes a couple of weeks or more. they were very friendly though. did receive an offer", "Interview Questions": "why do you want to work here"}, {"date": "24 Jul 2018", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Feb 2015", "Interview Descriptions": "Phone interview, then in person interview with Supervisor and Lead, asked mostly behavioral based questions that sometimes feel repetitive.  Recruiter is the person that communicates with you between interviews, keeps you in the loop, and is pretty easy to get a hold of if there is a question.", "Interview Questions": "Behavioral based questions."}, {"date": "21 Jan 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "Submitted application, heard from HR within 2 weeks for phone interview and then within another week for in person interview.  Met with 3 managers.  Hour long interview, was asked questions and then had a chance to ask some.", "Interview Questions": "What do you do when you realized you've made a mistake?"}], [{"date": "19 Dec 2014", "title": "Clinical Data Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "Applied online via website. Called a week later for phone interview with HR person, then called for interview in person. Met with direct supervisor and her manager who was on her laptop the entire time. Very little opportunity to talk and process felt very rushed. Offered job a few days later. I accepted immediately as I had been looking for a job for a couple months after being laid off. I should have heeded the interview red flags", "Interview Questions": "Can you read a medical chart"}, {"date": "30 Sept 2014", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Park Nicollet Health Services in Sept 2014", "Interview Descriptions": "Telephone interview, face to face with ov manager and physician. Skills assesment along with work related scenario questions on how to handle these situations. The telephone interview was about experience how it relates to the job and what brought you to be interested in working for this company", "Interview Questions": "N/A"}, {"date": "17 Jun 2014", "title": "Management Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "Phone interview and 2 panel interviews, one with the director and other with the department leaders and staff. Interview questions were pretty average. Good conversations around the my skills and the culture of the organization.", "Interview Questions": "Why do you want to work here?"}, {"date": "1 Oct 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jun 2014", "Interview Descriptions": "I applied online and received a call from HR within 2 days. After a telephone interview with HR, I was told that I would hear back about a  possible face-to-face interview in about two weeks. In fact, I was contacted the next day and scheduled for an interview with the hiring manager about one week later. I was interviewed by the clinical nursing manager and the evening nursing supervisor for the unit on which I would be working. Both were very professional, but also friendly and welcoming. They gave me a detailed explanation about the units on which I would be working.", "Interview Questions": "Why are you interested in working with this patient population?"}, {"date": "19 Oct 2018", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Park Nicollet Health Services (Saint Louis Park, MN) in Mar 2014", "Interview Descriptions": "Standard interview, spoke over the phone with the HR recruiter then had a one on one scheduled with the supervisor. In my opinion it was an easy interview as I was a student there and knew already knew the ropes.", "Interview Questions": "Common interview questions"}, {"date": "4 Jan 2014", "title": "Administrative Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Park Nicollet Health Services", "Interview Descriptions": "The interview and hiring process was a bit slow, but that's the norm for a lot of fellowship positions. After an initial phone interview, I made it to the next round for an all-day onsite series interviews. All the interviews are behavioral in nature, so a lot of \"tell me about a time...\". The onsite consisted of the following: Interview with an HR Director, interview with Quality Improvement Team Directors, and panel interview with 4 VPs.", "Interview Questions": "There really wasn't an inherently difficult question, just the detail you have to drill down to on the behavioral questions.  "}, {"date": "2 Feb 2017", "title": "Rehab Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Sept 2013", "Interview Descriptions": "It was a 2 part interview process.  A phone screen followed by an in person interview with the supervisor.  The supervisor was friendly and spent more time asking me about my life and my aspirations as opposed to traditional interview questions.  It felt more like a conversation than an interview.  The interview ended with a tour of the department.", "Interview Questions": "Why do you want to work for Park Nicollet?"}, {"date": "13 Dec 2013", "title": "Director, Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jul 2013", "Interview Descriptions": "An initial telephone screening interview with the recruiter.  This was followed by multiple one-on-one meetings with the hiring manager, a panel interview with direct reporting team.  Leadership assessment with third party vendor.  Final confirmation interviews with CFO and CHRO.  Both recruiter and hiring manager were very accessible and willing to answer any questions or concerns.", "Interview Questions": "Leadership assessment consisted of three online cognitive, logic, computational assessments.  Followed up with personal interview with assessor, as well as an 'in box'  exercise"}, {"date": "14 May 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Feb 2013", "Interview Descriptions": "You apply online, HR will call for a phone interview, and if they think you will be a good candidate they pass your resume on to the floor manager. Once you get to the actual interview with the manager and assistant manager, they typically have you wear scrubs to the interview so you can shadow another nurse on the floor for about 30-45mins.", "Interview Questions": "What does our mission statement of head + heart together mean to you?"}, {"date": "13 Oct 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Park Nicollet Health Services in Aug 2012", "Interview Descriptions": "There was a phone screen, a phone interview and eventually an in person interview. At the job site, the director, a program manager and another manager conducted the interview. I was called about one week later with the offer. I accepted the position and started training/orientation about 4 weeks later.", "Interview Questions": "Why do you want to be a research assistant?"}], [{"date": "22 Feb 2014", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Park Nicollet Health Services (Saint Louis Park, MN) in May 2012", "Interview Descriptions": "3 interviews......... 1 by phone.......... 1 by supervisor............ 1 by HR", "Interview Questions": "Name a weakness that you have."}, {"date": "8 Jan 2012", "title": "IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Park Nicollet Health Services (Eden Prairie, MN) in Sept 2011", "Interview Descriptions": "Basic background check on experience.", "Interview Questions": "Experience was reviewed with salary on this first interview.\r\n"}, {"date": "9 Jul 2015", "title": "Medical Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Park Nicollet Health Services (Minneapolis, MN) in Jun 2011", "Interview Descriptions": "I had to take a personality quiz and blood test, than had two interviews with manager and another clinic manager.  Very nice and easy going people. Questions were fair, and pretty standard. They didn't make me nervous at all, remember to do some practice interview questions before.  Be prepared to explain previous work experience and why you would make a good fit working with the team.", "Interview Questions": "What previous experience do you have working in a stressful environment?"}, {"date": "15 Jan 2014", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Park Nicollet Health Services in Oct 2010", "Interview Descriptions": "Was offered a position for Computer Tomography.  But during interview, was offered a clinical radiology position, covering several sites in south metro aria.  I took the position because the market was getting flooded with Radiology Technologist.  The interview was with the supervisor I would be working with.  We met at a coffee shop outside of any Park Nicollet facility. This supervisor lacked people skills.", "Interview Questions": "None.  Only that I was told by another supervisor that I had this job.  But the interviewing supervisor told me he would get back to me in two weeks."}]]